{"Reviews": [{"Title": "LG is underrated.", "Author": "Miech", "ReviewID": "R21RAFG8GZZE95", "Overall": "4.0", "Content": "I had quite an ordeal over the last month attempting to purchase a new HDTV. I was looking in the sub $1000 range, wanted a 40-42\" LED-Lit model and did a lot of research before settling on the Samsung UN40C6300.I originally settled for Samsung over LG due to in-store picture comparisons and quite frankly, Samsung's great reputation over the past years. They were the pioneers of LED edge lighting and for a long time remained king of HDTVs. When my set arrived via Amazon (which was super simple by the way) and I set it up, I was instantly shocked and disappointed. The samsung model had the worst backlight bleeding I have ever seen in any LCD TV/Monitor.. ever.. Upon researching the issue further I discovered that Samsung now outsources panels and I got stuck with a horrible Chineese CN02 panel while the model in the store happened to be using a Samsung Branded IPS panel. I can't say for sure whether stores always get the better panel for display purposes, but this sneaky bait and switch should be illegal. Needless to say, the viewing angles on the horrible CN02 panel and the awful bleeding (spots the size of softballs scattered through the image). Furious, I set up an immediate exchange with Amazon and went back to researching.Digging deep in Amazon's search, I stumbled across the LG 42LE5400 which was only $4 more then the previous Samsung model. What caught me about this TV over the previous was the following:1) Same exact price.2) Research indicated NO panel lottery and LG using superior IPS panels.3) 2\" Larger Screen4) NetCast Apps (Samsung's only supplies these on higher-end models)5) Wider range of inputs including composite-in6) Matte screen (Yes glossy looks nicer, but I'd rather not watch TV in a mirror).The exchange through amazon was painless and I am always impressed by their policies and understanding. After the horrible Samsung model was dragged away and the new LG panel dropped off, I set it up and was pleased.The picture was just as nice as the Samsung in my opinion (though a bit less crisp due to matte screen instead of glossy, but that was to be expected and actually ended up being preferred due to lack of reflections). I confirmed a genuine IPS panel by the orientation of the pixels and the push-test. I cannot comment on the sound since I always use a home theater receiver and have never used the built-in speakers. The Set comes with tons of calibration options, eco-sensors (which I disabled as I found it preferred to darken the screen too much. Why have an LED screen when you dim it down to nothing). Even the lighting on the power and function buttons has a neat animation and full control of turning off pesky logo lighting when watching in the dark, a nice touch.The only gripes I have on this panel are the following:1) There is some mild backlight bleeding around the top right and bottom left corner. This tends to make blacks in that general area a bit more grey, but nowhere (and I mean nowhere) as bad as the Samsung. I suppose this is just a limitation of Edge-lit panels.2) NetCast does NOT include Pandora even though it lists Pandora all over LGs website. I suppose they only include that in their receivers/blu-ray players, a major disappointment. Should be called \"NetCast Lite\".I really rate this panel a 4.5/5 due to the mild backlight bleeding. I feel more care should be put by all brands regarding this issue, but this panel was much better then others thus why I'm keeping it. I'm also a bit put off by the differences in NetCast.Other then that, I'm glad that I finally have this whole fiasco behind me. LG came out of the woodwork for me and blew me away with a far-superior television then the comparable Samsung model with no surprises, tricks and included many extras for the same price range. Unless something goes wrong (or they start getting sneaky with bait-and-switch like Samsung), LG is my new television brand.", "Date": "August 5, 2010"}, {"Title": "Great unit, but delay lag problematic for video games; audio sync fixable", "Author": "not-just-yeti", "ReviewID": "R2J6CCSAUAGWTO", "Overall": "4.0", "Content": "This is a great TV: awesome picture and features.- picture brightness is great: I'm using it in a bright living room (with windows on either side of TV), and the LED screen is bright enough to watch w/o problem.- overall features great: Assume I've gushed on about the picture quality, the number of inputs (including several on the side for easy access), the neat 'video mute' feature (under energy saver) so I can play a music CD on my DVD player and not have to see the DVD's stupid music screen, and so on.  (Hmm, I guess I could play mp3s on a thumb drive directly from the tv itself; I haven't tried that yet.)- Audio sync problem fixed via firmware:  As others have mentioned, after 45min-1hr, the audio became noticeably out of sync from the picture; this seemed to be equally true for all inputs.  It wouldn't get *worse* after more time, but it was bad enough that it looked dubbed.  My initial hack was to switch to a different input then switch back to the program, and it would re-sync.  However, after upgrading the firmware via the internet this problem disappeared.  A few notes:  ~ getting the internet connected took me a bit; even though DHCP should have happened at plug-in, I had to turn my wireless hub off/on in order to get the TV to get its IP address;  ~ In order to trigger the firmware update, I had to press 'netcast' or 'widgets' on the remote; I think it was at that point that the TV automatically sought out the update.  ~ it took two firmware updates in a row to reach the most recent version (6.0.something, I think).- Noticeable delay lag for video games: about a tenth of a second or even a bit more (after some measurements and calculating).  This is acceptable for many games, but for Wii Music every note I play is off beat, and for Dance Dance Revolution a perfect step scores between \"great\" and \"good\".  (This is a lag between when the signal is received and when it actually gets displayed -- it doesn't matter for normal TV since you'd never notice if your entire movie is shifted back 0.1s.  N.B. \"Delay lag\" is *not* related to \"pixel response time\".)~ [Delay lag on other models: I dragged my Wii Music down to Best Buy and tried it on several similar models I was considering.  The Samsung LEDs I tried also had ~0.10s lag; Sony Bravia LEDs had ~0.06s lag (still noticeable); no noticeable lag on LCD Viera or Sharp Aquos *LCD*, but (weirdest part) the Sharp Aquos *LED* did have lag (~0.10s).  All the models I tried were 40-46\"; most were 120Hz.  I hope all the time I spent measuring helps out somebody else!]This is for a 42\" LG5400; 2010.Jul.15.", "Date": "July 20, 2010"}, {"Title": "Picture quality is good but Wireless Ready feature is useless", "Author": "Pallab Ghosh Choudhuri", "ReviewID": "R9A51WQ82F9KM", "Overall": "3.0", "Content": "So far, the picture quality is good to me, who never had LCD or LED tv before. So anything better than CRTV is kind of a \"wow\" to me. So, I dont want to write too much about picture quality.There is one thing I felt betrayed about. There is nowhere in the product description tells that the \"Wireless Ready\" feature works if and only if one uses USB wireless adapter made by LG and no other USB wireless adapter. I purchased this \"Internet Ready\" TV with a hope that I would use a different wireless USB adapter that can be purchased for just $15. Now, I am shocked to learn that I will have to use only LG adapter that one can buy for about $80 in amazon.So, when you purchase this product,keep in mind that you will have to spend another 80 bucks to make Netcast and netflix work. Although other option is to hook your computer to the TV by HDMI or AVI.I hope this review help you make informed decision.", "Date": "August 30, 2010"}, {"Title": "Great TV", "Author": "A. Wayne", "ReviewID": "R1NCKZM4RB60N0", "Overall": "5.0", "Content": "The LG 42LE5400 is my first flat-screen television, and I've only had it for a couple weeks now. So there are the caveats.But to my eye, it's a beautiful machine -- with the power on or off. I'm the kind of person who wants the giant TV in my living room to look nice even when it's off; only Samsung sets can match this LG in the looks department. It's almost impossibly thin, and when powered off it's just a cool-looking black panel sitting on my entertainment center.Turned on, it's amazing. I haven't noticed any blurring while watching sports or action, the colors are great, flesh tones look like flesh, and the blacks look more than adequate. I did have to fiddle with the settings some out of the box -- turned the backlighting way down, for example. But to me, the television's self-calibration system seems to work great.The Internet apps are pretty good, if a little spare. The TV connects to Netflix, Vudu, YouTube and other Internet video using an Ethernet cable plugged into my wireless router. LG sells a separate wireless receiver that you can plug into the television to ditch the 10baseT. There are also a bunch of Yahoo! \"widgets\" that do things like tell you the weather and check stock prices. They seem relatively useless.So: Five stars, for now. That could change depending on the television's durability; it's a new model, so it doesn't really have a track record.", "Date": "July 2, 2010"}, {"Title": "Good Choice", "Author": "Elroy Jetson", "ReviewID": "R1FLTNZYB7NPL0", "Overall": "4.0", "Content": "The TV was very easy to set up. Laying it face down on a side by side pair of couch cushions (thus elevating it above the floor) made attaching the pedestal super easy. Lifting it onto the stand was easy too, it's a heck of a lot lighter than the behemoth tube TV it replaced.Once all connections were made and the unit was powered up, it immediately detected the wired internet connection and requested permission to download a software update. And another update. And another update. And another update. I think there were four. I use an outdoor antenna instead of cable, the tuner pulls in all the channels my converter box did, and then some. If there is a broadcast signal strength indicator, I haven't found it. A broadcast signal strength indicator is very important for aiming your antenna. Digital signals don't fade if you turn the the antenna the wrong way, the picture simply disappears. I'll be keeping the converter box around for antenna alignment purposes. There is a bit of a delay when changing channels - I suppose it takes a moment to lock in and start decoding the new channel. My old decoder box had a similar delay when changing channels.The remote's fairly intuitive, and even has light-up buttons (they time out in about five seconds). The \"Netcast\" and Wigets\" buttons are too close to the up and down on the four way rocker button that's used for navigating setup, Netcast, and Widgets menus - care must be taken when tweaking settings, or you find yourself kicked out of your menu unexpectedly. I already had a Netflix account, so all I had to do was click on Netflix, get the TV's code number, log into Netflix with my computer, and enter the code there. My Netflix cue was up on the TV within thirty seconds.The picture looks really good. I only have one analog broadcast channel, and that one even looks fairly good. The digital broadcast channels look great in SD, and the HD channels look fantastic! Netfilx movies play beautifully. I tried out a preview on VUDU in full 1080, and it was as smooth as silk! My living room gets lots of sunlight, but the TV shows up clearly. At night, during dark scenes, there is a tiny hint of a light glow on the lower right edge, but it is very, very minor (I probably wouldn't have noticed it at all if I hadn't learned of the phenomenon from other reviews).Aside from the aforementioned lack of a broadcast signal strength indicator, I'm very pleased with my LG 42LE5400. So far.*UPDATE* (8/21/2010)Finally found the digital signal strength indicator (via LG's knowledge base search). It's located in the \"Channel\" sub menu, under \"Manual Tuning\". They really should mention this in the owners manual. My old digital converter box has a dedicated button on the remote for the digital signal strength meter.", "Date": "August 19, 2010"}, {"Title": "Exceedingly Pleased", "Author": "Robb", "ReviewID": "RS38CP52XEK9I", "Overall": "5.0", "Content": "Like so many others I did several weeks of checking all the high end name brands online and at many of the big box stores.  At the start I never even looked at the LG line of LED/LCD TV's. After visiting one particular store, that happened to have this model, I was quite surprised at the picture quality and the features. My wife and I are exceedingly pleased about this TV purchase and have been urging our friends who are thinking of a new TV  not to dismiss LG.  One of our favorite features is the auto volume setting which goes a long way toward lowering those annoying advertising sound spikes.  LG 42LE5400 42-Inch 1080p 120 Hz LED HDTVI would recommend this TV to anyone as a quality value item for the price, the features and the technology.", "Date": "September 2, 2010"}, {"Title": "A Wonderful TV", "Author": "M. Santina", "ReviewID": "R35U4GTNNDOCNC", "Overall": "4.0", "Content": "I love this TV.  Bought it for our bedroom along with the wireless media kit.  It is perfect.  The tv was very easy to set up, the picture is crystal clean and its just a very clean looking set.  The power consumption economy mode is pretty cool, dims when the lights go down which is perfect for the bedroom then brightens up when the lights come on.  As far as the TV itself I have not found any problems.  I do have a couple minor issues with features.  Netcast - the LG website shows many apps however this TV only gets 4; Netflix, You Tube, Picaso and Vudu (not including Yahoo widgets). I was really looking forward to having Pandora and Facebook so I'm not sure why the website shows them but they are not actually available. Then theres the remote.  I do like the illuminated buttons but thats about it.  The buttons are too close together around the directional click wheel and I've been having troubles with it.  It comes and goes but sometimes it won't let me click the same direction more than once.  For example if I was scrolling or tryng to type something in and I needed to go to the right I will have to click right down right up just to get 2 spaces to the right.  Same thing if I'm choosing and setting the sleep mode.  Annoying but I can live with it.  Having the wireless media kit I need to use my cable tv remote most of the time anyway.  I do wish we could get more apps though.  Another feature I like about this tv is that you can choose inputs.  Standard cable, HDMI or over the air digital.  This is nice because we have the wireless media kit hooked to our main cable box in our living room via a splitter which means both TV's would need to be watching the same shows.  Being able to switch inputs means gives me the option of watching any show on basic cable is someone else is watch HD oon our main TV.  Anyway, I highly recommend this tv unless you are heavily into apps.", "Date": "September 6, 2010"}, {"Title": "Very Netflix capable", "Author": "Moosejaw \"Spirit of Saint Louis\"", "ReviewID": "R18G8SJ4NXE9LI", "Overall": "5.0", "Content": "I want to add some Netflix info for folks wanting to know.  Unlike what I have read about other brands, LG's Netflix app is very useful.You have the ability to: -search and rate any title -add any title to your dvd or instant que -remove any title from your instant que -view your instant que -select any episode for viewing (i.e. South Park season one episode 1,2,3 etc) -pause playback of titles and FF or RR in ~ 6 second intervals via thumbnailsI find movie streaming is very good with great pq.  Adding movies to a que is easier using a pc, which is expected so no downgrade for that.  User interface is responsive and not laggy.  Does not stream the Starz content but I don't think any internet tv does that right now.  Of course everything is subject to change as firmware updates are released and more features are added.Overall this Netflix interface does everything you need with a simple and user friendly interface that anyone can master.", "Date": "November 17, 2010"}, {"Title": "Panel Lottery on 42 inch confirmed", "Author": "Patrick", "ReviewID": "R235G73E5MKX51", "Overall": "3.0", "Content": "The TV is OK but LG should do better. As mentioned in the reviews of the 37LE5300, LG uses both IPS and non-IPS panels but they don't make that clear to the consumer. The white sticker on my box reads 42LE5400-UC.ASUDLUR which means unit is a non-IPS model. Had it read 2LE5400-UC.ASUWxxx would be an IPS model. IPS is WAY better than the non-IPS (I looked in a store). Many people (myself included until today) think there is no panel lottery on 42 inch models, but it has happened to several of us now as noted in the comments on other reviews here. I only want IPS so I'm returning it. Check the AVS forum on it or google \"le5300 panel lottery\" for more info.", "Date": "December 30, 2010"}, {"Title": "Nothing tops this TV", "Author": "Allen J. Levinsky", "ReviewID": "R3H2G7X0YDD1NC", "Overall": "5.0", "Content": "When it came down to shopping for a new TV, I compared several models from several manufacturers, including, Sams**g, S*ny, Pana***ic, Tos**ba, etc..... and from reading all of the reviews, this model had excellent reviews from top to bottom. And boy were they right. After calibrating the TV, which takes just a few minutes using the LG wizard, I saw the most incredible looking High Definition that I have ever seen. And that was just using my Comcast cable box. Then I popped in my Avatar Blu-ray and I was BLOWN AWAY!!!! I've never seen a picture more perfect in my life. No motion blur, no microblocking, absolutely nothing flawed whatsoever, even while watching fast actioned sports. The TV's speakers work pretty good for such a thin set. Even the streaming video from Netflx is awesome. I haven't tried any of the other optional internet based addons. If you're looking for a stunning picture that will not break the bank, I highly recommend getting this TV. 1080p, 120hz, what more could you ask for around $900?", "Date": "August 1, 2010"}, {"Title": "Beware of this TV", "Author": "Caymandiver", "ReviewID": "R27SOV6PQWTAAR", "Overall": "1.0", "Content": "I have just posted a review for the Vizio SVT423SV, which I am very happy with, but since part of that review discusses the LG 42LE5400, which I bought and returned before buying the Vizio, I thought I would share that review here as well. As I explained in the other review, this is the first time I am reviewing a product, and I am doing so only because given the amount we have to shell out for these types of TVs, it's important that we all have as much information as possible before buying.  I bought the LG 42LE5400 in January.  I was attracted to its slimness, and although I had heard that edge LED backlight TVs have problems with blooming, I didn't think it would be a big deal, and was persuaded by the mostly positive reviews this LG model had received from other purchasers.  Sadly, after I got the LG, it became clear to me why blooming is such a big issue.  While the TV is great for watching sports, it was terrible for watching movies or even TV shows whenever a scene with a dark background appeared.  My LG had large bright auras emanating from the four corners, and they gave a faded and washed out image to the picture in those areas.  I called LG customer service to see whether anything could be done about the problem, and the representative's only response was that \"It happens with all edge LED TVs.\"  After trying to live with the problem for a couple of weeks, thinking I might have been overreacting at first, I gave up and returned the TV for a refund.  I then bought the Vizio SVT423SV.  It is not as slim as the LG 42LE5400 (although still only 3 inches thick) but it has a full-array LED backlight, which eliminated the blooming issue.  I did notice what appeared to be some slight blooming once when I happened to look at the TV from the side, at a very extreme angle.  But since that is not how I will be watching the TV, it's a non-issue for me.  I have been very pleased with the picture quality and color of the Vizio, and on top of that, this Vizio model has built in Wi-fi.  So if a slim TV takes precedence over picture quality for you, go for an edge LED backlight TV.  If picture quality is important to you, buy a full-array LED backlight TV like the Vizio SVT423SV.", "Date": "March 14, 2011"}, {"Title": "Great TV, home delivery service misrepresented", "Author": "Kirby1322", "ReviewID": "R1YD8SY0SE6G7F", "Overall": "5.0", "Content": "The LG42LE5400 is a great TV, no question about it. Picture is excellent, sound quality is much better then expected, and the lag time as suggested by other reviewers while playing video games is not noticeable. My PS3 looks great linked into this TV with an HDMI cable, and the blu-ray player looks even better. Watching Avatar tonight on the set, can't wait to see the picture quality.The only downside to this set had nothing to do with the TV at all, instead, it had to do with the misleading home delivery service. The company that delivered my set did nothing but push the TV to the end of truck and then I carried it into my house. NO SETUP, NO TESTING. The packaging was great and the TV has no blemishes, so I guess I can't say the shipping was all that bad, but it was definitely misleading.However, if you're looking for a great picture on a TV with tons of perks, this is definitely the way to go. I researched for over 6 months to pick the right TV. I kept going back and forth between the Panasonic Plasmas, and this LG LED LCD. Major factor that pushed me to get the LCD was the amount of light that would be cast upon the screen in the room that I have it set up in. If I had a theater room that was kept in the dark I may have gotten the plasma, although, this TV looks so great I think I made the right decision for any room with any level of natural lighting.", "Date": "September 22, 2010"}, {"Title": "First impressions", "Author": "W. D. Leeper \"Protagonist\"", "ReviewID": "R1IS4KMCRPH5RM", "Overall": "4.0", "Content": "This is the first flat screen TV I have owned and I have had it just for a couple of weeks so I am giving my first impressions. I would have liked to rate it 4.5 stars but that does not seem to be an option. My biggest complaint with this unit is the remote control. If you have large hands you will have problems with pressing the wrong buttons located around the joystick control section. This seems to be a rather poor design choice on the part of LG.As for the TV itself I couldn't be happier. Since this unit replaced a CRT TV going HD makes quite a difference. Colors look very good and even the sound through the built in speakers is acceptable. I will be using external speakers in the near future, though. Other than the afore mentioned problem with the remote everything else seems to be well laid out.I ordered the wifi dongle with the set and wifi router hookup is a breeze if your router has WPS. All I had to do was go to the router setup page in my browser, click on the WPS button, go to the TV and click the WPS setup entry on it and everything was set up automatically. Netflix streaming comes across at the highest quality with no buffering pauses. As mentioned in another review Pandora is not accessible with this set at the time. It is, however, accessible through my Blu-Ray player so that is not a real negative for me. Since I don't yet have any blu-ray disks I can't comment on how they look.Anyway, first impressions to this point are very positive. I would definitely recommend this TV to others.", "Date": "August 11, 2010"}, {"Title": "Fabulous LED LCD 1080P HDTV", "Author": "Steven Atkinson \"Saints Fan\"", "ReviewID": "R13R2T7WPN8WAO", "Overall": "5.0", "Content": "What a marvelous TV! I love it! The High Definition is unbelievable. The colors just pop out and are so vivid. You see colors that you never noticed before on a conventional TV. The internet and netcast are awesome and easy to set up. The sound is fine and more than adequate for TV speakers with lots of volume, it goes to a scale of 100 and I usually set mine around 10. I am very pleased with my purchase and would recommend it to anyone. My only complaint and it really isn't a problem, is that everywhere I look, including LG's website, states that the contrast is 4,000,000:1 but the box mine came in states 3,000,000:1. Could someone even tell the difference between 3 or 4,000,000???? I don't know, I would just like to be told what the specs actually are.", "Date": "July 21, 2010"}, {"Title": "My thoughts 1 year later", "Author": "Stephen B", "ReviewID": "RK8EAEHBO59EO", "Overall": "5.0", "Content": "I bought this TV shortly after it came out last year, end of April 2010, and I have to say I love this TV. At the time we had just moved into our first house and it turned out that the living room would be more awkward to place all the furniture then we originally thought. So the only place to put the TV was in this little corner between the staircase and a strangely placed closet door. Being the guy I am, I HAD to squeeze every inch of TV I could in that corner. This required something very thin so I could push it as far back as possible as to not interfere with the closet door. Well the LG LE5400 is all kinds of thin, at about an inch thick I had no problem putting it in that corner.I did buy this TV right after release, so I did pay close to MSRP, which was a lot. But I'm very happy with my decision. I didn't want a TV that was already a year old and outdated. I wanted a TV that was an LED flat panel, 120Hz, had Netflix built in, and was energy star certified. This was one of the few on the market at the time. I knew the type of quality products LG produced, and I did as much research as I could on a TV that was brand new, so I went for this model. This was the 2nd TV I've ordered off of Amazon. The first was my 56\" Samsung DLP back in 06', which is in the basement right now, still going strong. It arrived via UPS with only one little ding on the box corner, but nothing serious. The TV was well packaged anyway.First off this TV is pretty light, being only an inch has a lot to do with this. The screen is bright and very clear. It is an edge lit LED and I do notice that when the TV is on and the picture is all black that there is some bleed in from the bulbs at the top right and bottom center. This is no big deal as like I said, I only notice this when the screen is completely black. Otherwise, the screen is crystal clear. I know a lot of people say that you cant really see the difference between refresh rates, but I will tell you that first couple of days with this TV, peoples movement on screen looked a little weird at first. But that's because everything was now smoother. Its hard to explain, but after a few days, I got used to it. Blu-ray movies look fantastic and crystal clear.Sound on this TV actually isn't that bad. It was a while before I got my sound bar, so I used the TV speakers for a few months. The LE5400 has 'invisible speakers' hidden behind the frame. No speaker holes or any indication of speakers anywhere. This also make the frame that much more seamless and sexy. They can get loud pretty well and the sound is pretty clear, although I still prefer my Sony sound bar. But the stock speakers did a pretty good job.Netcast is a nice little pack of applications built right into the TV, no additional devices required. There are 5, but the only one we use is Netflix. Its really great not needing to have another device hooked up to get Netflix, even though my PS3 is capable, its just easier for my wife to use just one device. I have the TV wired with an Ethernet cable so its really fast. The TV is wireless 'ready', but I wasn't dishing out extra for it especially since I had the wire already run, plus I prefer hard wired anyway. Its just easier and most importantly, faster. Its nice to see that LG actually updates the firmware of the TV to make it better over the past year. At first Netflix was a bit slow and only capable of viewing things that were already in your instant queue. This meant that in order to add a movie that wasn't there, I had to go downstairs to the computer, log in to netflix, add the movie we wanted to watch, then back up to the TV to watch. But after a few weeks they updated it to be able to browse and find what you want. Much better. Still waiting for a TV with a HULU app (if there is one, I dont know about it), and maybe then I could think about canceling Cable all together.The LE5400 is also capable to plugging in a USB hard drive or memory stick and play video files right off of the hard drive. This saves me from having to burn files to DVDs in order to watch them on my TV. It really comes in handy.Overall I'm very happy with this TV. It was a smart purchase and recommend it to anyone interested. I see that the price has come down considerably from when I bought it. If you're on the wall deciding, but the LG LE5400.", "Date": "March 9, 2011"}, {"Title": "Same light bleed as others", "Author": "Mike Freeman", "ReviewID": "R3AY43AFHFYDKS", "Overall": "3.0", "Content": "I also had light bleed on the left side of the screen.  I contacted LG support and they sent someone over and replaced the screen and now it looks good.  LG definitely has a quality problem with this set.", "Date": "December 26, 2010"}, {"Title": "Great Picture Great Price", "Author": "Owlyn", "ReviewID": "R3UXTFSFKHCLAG", "Overall": "5.0", "Content": "Well, I don't have a whole lot to add to the other reviews. My other TV is a 32\" Toshiba LCD. The picture on the LG is incredible. Totally blows away the 3 year old Toshiba. Bright, crisp, amazing. I used the picture wizard to adjust for the room. The wizard was outstanding. The wireless USB dongle works perfectly. Everything was not too difficult to set up. The instructions for assembling the base and setting up the wireless are not fantastic, but I managed. My biggest complaint is the sound. The various controls don't seem to make much of a difference. Even my wife commented on the sound quality, and she generally doesn't care about these things (she watches in SD stretch mode!) The Toshiba's sound was much better, but the picture on this thing is so good, I forgive the poor sound. And, as the others have said, if you are running the sound through a home theatre, it won't matter. I use the TV speakers, so I'm a bit disappointed, but, I can live with it. I run the sound through my desktop stereo for movies (you can stop snickering now- I like it). Which reinds me- there is no audio L/R out. It's either HDMI, component, optical, or headphone jack (underpowered). To get the sound to my (old) stereo, I have to run HDMI or Component to my older DVD player/recorder, and then audio out fronm there to the stereo. I guess I could use the component audio out- just realized that.Oh- regarding the lip sync issue. On my setup, I found that the problem was the audio setting on the Motorola DCX-3425 cable box. It was set to \"Auto\". The other choices were L-PCM and pass-through. Once I set it to pass-through, the lip sync problems went away, except for one or two shows on a particular channel. These shows are time-compressed, and I suspect this somehow is the cause of the problem (it shouldn't be, but it's what I see and hear, and even as it is, the change in setting improved the problem greatly). I did get one firmware update, but that isn't what fixed the problem. I've only had the set for about a week, so we'll see if the lip sync problem returns. So far, I am very happy. Can't beat the price-to-value ratio. (I paid $999 at a brick and mortar store that bundled a blue-ray player and the USB dongle). Cable management could be better. There is no way to completely hide them if you are using the stand.I did begin to stream so blue-ray previews over the net, but my internet connectin is only 1.5 DSL, so I hit buffering. But what I did see was breathtaking. I finally found an excuse to upgrade my internet service. I like the Yahoo Weatherbug widget. The others are okay, but maybe there will be more down the road. The included Nero software (on CD) allows you to stream media from your PC's hard drive to the TV. Way cool.I have big hands, and have no problems with the remote. It takes some getting used to, as the design is a bit unconventional.So, to sum it up:PROSThe pictureThe picture setup wizardSeamless internet connectivityStreaming/Viewing/Listening from your PCOverall Value (and styling)CONSSound QualityNot enough Audio Out optionsPoor headphone jack amplificationSub-par instruction manual (There is an included CD that is better)Poor cable managementNEUTRALRemoteWidgetsStand assembly procedure (due to poor instructions)", "Date": "November 16, 2010"}, {"Title": "Great buy... but it took a while to grow on me", "Author": "Mr. E", "ReviewID": "R2DHFJ86HFIR44", "Overall": "5.0", "Content": "I recently bought this LED TV from Best Buy in a bundled package. It was a big selling point for me to get a bluray player with it and honestly I probably would not have bought it otherwise. Overall, I paid $899 for the whole package and I considered that a good buy.First off, right out of the box this TV is stunning. It's thin, stylish, and has a great overall look to it. The base of the TV is a little larger than I expected but it is proportionate to the TV. I have this TV hooked up and it looks fantastic. It had a slight audio sync problem but it was solved with firmware updates. That is it looks fantastic after playing with the settings for about an hour and a half. Which brings me to the biggest negative aspect with of this TV...If you're looking for a TV that you can plug in and have the best looking picture right off the bat without having to adjust the settings... this isn't the TV for you. I recently had a Sony KDL-46V3000 and that TV had a perfect picture and sound right out of the box, no need for change at all. I was hoping for the same. At first, I was very unimpressed when I started to flip through HD channels. Once I started to mess around with the different settings and really dig deep into the TV I started to fall in love. I have never had an HDTV with this level of customization before. After getting everything down for all of my inputs and making sure that everything was perfect, I put the TV through the paces.Blurays from a PS3 are spectacular. Video games are incredible and there is very little to no lag at all when using the customized Game video setting. HD channels are stunning and even SD channels are bearable. Overall, the picture is great, the contrast is good, abut the audio is sub par. I did not get this TV with the intent to use the internet widgets or games so I can not review them at allPROS:great picture qualityhuge PQ and SQ customization abilitiesability to switch off the typical 120 Hz 'soap opera effect'large viewing anglegood contrast for an edge lit LED TVeasy navigation of menu and submenusnon-glossy screenbacklit remoteTV runs very cool and does not warm even slightly with heavy use (also easy to clean out dust from upper vents)CONS:out-of-box PQ is disappointingsound is terrible even with customizationnoticeable delay in picture smoothing when switching inputs and turning on (almost seems like it takes a few moments for all of your custom settings to take hold)requires a necessary update to fix slight audio sync problemsminor flash lighting effect when viewing from a low angleOverall, I would absolutely suggest this TV to anyone looking to buy a new LED TV. However, I can only suggest it when it's at a discounted price. I honestly could not see myself paying $999 for this TV, even with what I know now. I can say that it is probably not for everyone but after changing settings and playing around with a few things I absolutely love this TV.", "Date": "November 7, 2010"}, {"Title": "How bout a sw update to support Amazon Prime?", "Author": "nonickname476", "ReviewID": "R3DYAWNTWQMJ18", "Overall": "5.0", "Content": "Love the TV - had ot for a year, but sure wish I could use it to stream Amazon Prime.I don't care for Netflix, and would love to be able to use Prime", "Date": "October 31, 2011"}, {"Title": "Really Good Quality at a Decent Price", "Author": "DizyDazz \"DizyDazz\"", "ReviewID": "R2M4L180HF24KN", "Overall": "5.0", "Content": "LG is a reputable company that makes good quality products. I was comparing this 42LE5400 to Samsung's LED TV and had a hard time deciding which to buy. After a few days of researching, I found this LG has more to offer than Samsung at the same price. Video and audio quality is superb and comparable to Samsung's LED. This 42LE5400 is highly recommended.", "Date": "November 21, 2010"}, {"Title": "Perfect", "Author": "Aaron S. Goldhammer", "ReviewID": "R27THWPLLIPPCP", "Overall": "5.0", "Content": "This was an excellent transaction.  The TV is perfect for me.  Having the Netflix built into the TV with the wireless conection is fantastic!  The delivery was excellent.  They called 30 minutes before they were scheduled to arrive and brought the TV in my house, unpacked it, and set up the TV exactly where I wanted it.  The deal, shipping experience, and the product make me love Amazon even more.  Thank you!", "Date": "October 13, 2010"}, {"Title": "Image Quality is Jaw Dropping", "Author": "MaxMax256", "ReviewID": "R3STZWLPLT08GW", "Overall": "4.0", "Content": "After 6 years of buying products from Amazon, this is the first review I have written.  When we installed our LG 42LE5400 42-Inch TV, my wife and I were in awe. (and still are.)  Our primary TV is Panasonic Viera TH-58PZ850U 58\" which is known for it's great picture quality, but the LG just blows it away.  We installed the TV in our cabin in the woods and are NetFlix'ing only to it. (Crazy that we get 10Mb down and 1.5Mb up cable internet deep in the woods!)  NetFlix is not even streaming HD and our jaws are still dropped.  We do wish it had Pandora like the box says, but when I connect up the LG Blu-Ray player that I will purchase next month, problem will be solved.  I would buy this TV in a second again and am telling all the guys at work to go with it.  Just to note.  I did get one with an IPS panel.", "Date": "March 12, 2011"}, {"Title": "Great TV, sound sucks.", "Author": "jbw", "ReviewID": "R24CKUMXW7LIHV", "Overall": "4.0", "Content": "Had for almost a week and it has been pretty awesome. The picture is great, the plethora of inputs is nice, but the sound quality of the on board speakers is awful.If you buy this TV plan on getting some sort of surround or aftermarket sound system. After 2 days hearing this thing, I purchased a sound system, the sound just plain sucks.But hey, you are buying a 42inch led tv, of course you are going to buy a sound system.UPDATE: 1 year later: the tv is still going strong, not a dead pixel on the thing. Everything is really nice, the only thing I do not like is the fact that I seem unable to update netcast. Netcast is LG's internet app service (things like netflix, youtube, vudu, etc..)I heard LG got more apps for their netcast lineup, but nothing new has come up on my unit...if there is a way to get new apps on one's netcast, LG does not make it well known or easy to do", "Date": "December 17, 2010"}, {"Title": "Really nice TV, especially for the price", "Author": "Chris", "ReviewID": "R1615L0GQTK6UZ", "Overall": "5.0", "Content": "This TV is really everything it says it is. It is a really good picture, really thin, passes through sound well.  The initial picture setup is really easy to do, also the menu is easily controlled. The remote is a little long, I have big hands and reaching from the top to the bottom without a second hand isn't possible, But a universal remote or just not being lazy solves that.  The only other negative thing is when an entire black screen is shown you can see some brighter spots, However; this is only visible on an entire black screen, if anything else is on screen it is not visible.  It has good built in speakers that can go pretty loud and are clear but they can't compete with a full sound system.  The LED lighting is incredible, the colors it can show trump that of tube TVs and when next to a regular LCD TV you can tell the difference.  The clear voice feature works well and actually makes peoples voices easier to hear. I bought this TV for $900 and I think that was a steal for the features and quality of the product. It has a relatively good base but it won't help if someone pushes/falls into the tv, but its a 42\" HDTV so people shouldn't be falling into it.  I haven't tried the internet on the tv yet because I just hook up my computer via HDMI cable but that works really well.  The tv is really thin and light, especially for being a 42\" tv.  Another thing that could be considered a con is when scanning for channels it still checks the old analog stations but you can skip this if you press the button when it's scanning.Pros:  Great picture, Really thin, LED lit allowing for amazingly deep colors, 4 HDMI ports, Great value, Clear Voice system works well, Good built in speakers,  Overall A great TV.Cons: Longer remote than needed, Some bright spots when on an entirely black screen, still scans the old analog channelsI would recommend this TV to anyone I know. It's a great TV and the price is great compared to what a 1080p 42\" TV would cost two years ago.", "Date": "December 3, 2010"}, {"Title": "Amazing Picture", "Author": "Frank Feci", "ReviewID": "R3O9WBINIYGX2V", "Overall": "5.0", "Content": "Did research and saw that this TV was highly rated by many customers. I went to an Appliance Store and saw the wall of TVs and at first they all seem to look very similar. I then closely examined them and then one can see the difference. I then stepped away by about 20-25 feet and this LG TV stood out among most of the TVs in the store including many that were thousands more. It is a truly exceptional picture. We love it in our family room. You cannot go wrong with this TV.", "Date": "November 18, 2010"}, {"Title": "My First HDTV and it's amazing", "Author": "SLR", "ReviewID": "RJTRRSA9O1EHI", "Overall": "5.0", "Content": "Granted, I have never owned an HDTV and only played with one other (my mother's), but I am very happy with this TV.  The picture quality is amazing.  The ability to change picture quality, ratio, etc. quickly and simply is very useful.  The simplelink part of the tv, was pretty nice, but I exchanged my LG blu-ray for a Sony, so that is no longer a factor for me.  I love that the base allows you to angle the tv easily in any direction you want.  The only qualm I have with it, is that LG has less online options than some of the other brands, which is part of the reason I went with Sony for the blu-ray.", "Date": "October 27, 2010"}, {"Title": "What a Great TV!", "Author": "Mary E. McGawn", "ReviewID": "R3JPU34TL1ZFVE", "Overall": "5.0", "Content": "I have had this television for two weeks, and am very impressed.  Granted, I upgraded from a 24\" \"old-fashioned\" set; nevertheless, I have been amazed with the HD picture (color, motion, etc.).Just yesterday I installed a wireless router and the USB adaptor, and have everything working.I will say that my TV did not work right originally.  A number of colorful pinstripes appeared vertically.  I contacted LG right away, and they sent a technician to my home.  New parts (the entire screen assembly) were ordered, and were installed yesterday.  So, although the produce \"should\" have been perfect right out of the box, their customer service took care of things for me right away.", "Date": "October 13, 2010"}, {"Title": "Awesome TV with great quality picture.", "Author": "James Mac", "ReviewID": "R3B77CHH3WB1IY", "Overall": "4.0", "Content": "I've own this set for a few years now and it still works excellently. Awesome picture quality in even the brightest of rooms.The only annoying thing is that LG refuses to upgrade the software by adding any more apps. So I am stuck with a coming soon tab on my Netcast page. Seriously would it hurt LG to add 2 of the more popular apps, Amazon and Hulu plus? My guest is that they don't support any older models after a certain date because they want you to buy new products every 2 or 3 years. I did purchase the LG ST600 Smart TV Upgrader with Digital Streaming and Internet Services however do I really need another power device to run up the electric bill? With my recent contact with LG customer support on this device and my disappointing LG BD690 3D Wireless Network Blu-ray Disc Player with Smart TV and 250GB Hard Drive I may have to rethink my loyalty to the LG brand name. Click the tab below the image that says to \"see all 6 customer images\".", "Date": "February 22, 2013"}, {"Title": "Top of the line", "Author": "Ronald E. Martin \"Plumb Cheap\"", "ReviewID": "R12CJY8C7C8JSB", "Overall": "5.0", "Content": "I bought this unit about one year ago from Amazon. We have several LG appliances and everyone is top notch. Amazon had a special deal when I purchased this... free LG blu-ray player and home theater system. I absolutly love this package. As for the wireless adapter, go with a cat5 or cat6 ethernet cable instead. You can get 50 feet for around $15 from Amazon. Can't go wrong with Amazon!", "Date": "April 20, 2011"}, {"Title": "Smooth, clean, amazing", "Author": "HauteShot", "ReviewID": "R30YOC5L8XL7SR", "Overall": "5.0", "Content": "I have been doing lots of research about TVs before this purchase. LG' Led line got high reviews and my own experience with LG has been good. So when I found this TV for this price I went for it. Not surprisingly after doing the setup and customizing the features to my liking, I was amazed at how great the tv is.If i had one negative about the tv it would be the widgets, they are so slow to load, i could get on my computer and check weather and come baco to the tv before the widget would even load. But since widgets are an optional feature, it does not affect the score.", "Date": "February 14, 2011"}, {"Title": "So far so good....", "Author": "Ralysport", "ReviewID": "R345S9STTA68RZ", "Overall": "5.0", "Content": "I researched well before purchasing this LED TV.  Make sure you get an IPS panel.  Comments by some that the TV is slow for gaming (Black ops) are false the folks making the comments didn't set the HDMI ports to the gaming profile.  Colors are amazing \"Blacks ok\" sound good enough for my bedroom.  Viewing angle good & glare not an issue.  Most of my research was on the AVS forum website where they have a discussion group for this model TV.  I've had the TV for 2 weeks and love it.", "Date": "January 30, 2011"}, {"Title": "LG 42LE5400 1080p 120Hz LED HDTV with Internet Apps", "Author": "nick c hauer", "ReviewID": "R38PLY8VJMI3M5", "Overall": "5.0", "Content": "Great TV, mine shipped across 5 states and arrived in great condition. Great color and picture, adequate basic sound. Super easy to set-up and operate with LG remote and/or a universal. Internet access is easy and fast, apps easy to access and use. Overall an awesome TV for the price, also great for movies and gaming, you can also hook your computer up.", "Date": "January 27, 2011"}, {"Title": "Great TV - Internet Apps a nice addition", "Author": "Maerev", "ReviewID": "R2CKXK4XY4412R", "Overall": "5.0", "Content": "Great TV! Below is what I like best:Picture quality - I am no expert but the picture looks better or as good as any of the TVs on display in stores, right out of the box. Multiple pre-set options allow users to easily adjust.Wireless/internet app - Until the day TVs can be used to browse the web just like computers, this TV is a great compromise, offering essential web features without commanding a higher price. Netflix, Yahoo and Youtube can be easily accessed. Streaming from Netflix works perfectly and you can watch Youtube videos (although searching for them is a bit painful using the remote control). Note you will need to buy a LG specific wireless USB adapter. You can get one on Amazon for $30/$40.Matte screen - If you want a glossy screen this TV is not for you. However if you have large windows in your living room and want to reduce glare to a minimum this is it. Even in broad daylight the reflection is very small and does not affect the viewing experience.FYI for Wii users - You will need to purchase HD cables from Nintendo ($30) then change the Wii settings to 480p to remedy a 0.5 second lag on the TV, which takes the fun out of most games. With the HD cables no problem. This is a problem with Wii rather than the TV. From what I read this happens with most HD TV as it takes a split second to convert the 480i Wii signal into 1080p.", "Date": "January 23, 2011"}, {"Title": "Great TV", "Author": "Grant", "ReviewID": "R33KTKM8E9W5XO", "Overall": "5.0", "Content": "Great TV. Using all of the internet functions which were all easy to set up given my existing wireless network. I've got 2 PC's set up to stream to this TV.As a 1st Gen internet connectible TV, there is no web \"surfing\" in the traditional sense. Moreover, using the TV remote as a data entry tool is clumsy. Still, with a little practice we're getting from this TV exactly what we expected. It will be nice when more internet portals come online.", "Date": "January 21, 2011"}, {"Title": "Outperforms much more expensive sets", "Author": "J. Harley", "ReviewID": "R8FMXU62R44CY", "Overall": "5.0", "Content": "This TV is an excellent value!  I searched for weeks for a 42\" LED LCD.  Everywhere I turned, people were touting \"Samsung\" this and \"Samsung\" that.  Well, After seeing a few TV's in my local stores and comparing pictures, I wasn't overly impressed with Samsung.  Don't get me wrong, they have a great picture, but at a premium cost.  However, there were several other televisions with great pictures.  I didn't see anything that compelled me to pay several hundred dollars more for that brand. I then purchased a Vizio (primarily for price) but saw this model while shopping for a TV stand.  Ironically, it was right next to the Vizio I had purchased earlier.  Not only was the picture better, but the price was pretty much the same.  Well, needless to say, the Vizio was returned unopened and I went with this set.This TV is fantastic!  Lightweight, razor thin, and a gorgeous picture.  The contrast is great.  The blacks really pop instead of being a muddled dark gray.  There is no light leakage among the edges.  When I switch the picture to a dark solid colored screen the lighting is uniform and perfect.  The 120 Hz makes my sports and my sports/news channel tickers finally stop blurring.  HD looks awesome, especially Blu-ray.  Even the SD channels (a particular sore spot for me and I'm sure many other HDTV owners) don't look bad.The television is Internet enabled and wireless ready.  Just be advised, \"wireless ready\" means you have to purchase a $50 LG USB wireless device. It also has a LAN port on the back.  Since I plan to stream a lot of content to it, I opted for the wired config.  You can get things like Netflix, Pandora, and Picasa via the TV.  It also ships with a disk containing Nero MediaHome 4.  I thought the Nero software would be great, however, it uses a ton of system resources and can bring your computer to its knees.  I plan to find a different software solution.  The widgets are okay.  One thing I like is the automatic software updates.  The TV performed an update when I powered it on for the first time and regularly checks for updates.  In fact, it's performing an update right now as I type.  The set ships with a non-backlit remote.  I'm not sure if it's universal, but if I had to guess, I don't think so.I love my new television.  I really love the fact that this 42\" 1080P 120Hz LED cost me roughly the same as the three-year-old Sony 32\" 720P 60Hz LCD it replaced (prices have really fallen!)  And the picture on the LG blows away the Sony. In fact, my uncle has a 55\" Samsung LED and my HD picture (to me) looks better.  I honestly don't understand all the hype surrounding Samsung.  If you have the (truly) disposable income and must have the designer name, go with Samsung.  If you want a TV with just as good a picture and also save a couple hundred bucks in the process, go with LG.  I bought this set and a 55\" LG LED LCD for what I storngly feel was less than my uncle paid for his 55\" alone last year.", "Date": "January 14, 2011"}, {"Title": "Right TV for the price", "Author": "jnb", "ReviewID": "R3UO4F6085N6AF", "Overall": "5.0", "Content": "This is an upgrade from a tube TV.  It was easy to put together.  Easy to configure and setup.  The picture is great, but I bought from Best Buy in order to make sure it was an IPS panel.  You should check into this discussion as having the IPS panel does make a difference.  I have not set up a blu-ray player yet, but HD comes in great from the cable company and sports look amazing.  I do not notice glare problems and until you get at an extreme angle, the picture looks consistant and good.  If you are watching the news or kids cartoons, then the sound is fine.  But I would recommend getting an audio system to support for movies and such.", "Date": "January 13, 2011"}, {"Title": "Great TV", "Author": "3texmom", "ReviewID": "R1LJVG8HZFA6TH", "Overall": "5.0", "Content": "I bought this tv for my husband for Christmas.  He wanted a tv with internet connections.  I did some research and found this LED-LG tv to be a good price with the specs I thought he would want.  He loves it, and it was very easy to set up!  We have had several family members comment on the picture quality.  Now they want an LED tv too.", "Date": "January 4, 2011"}, {"Title": "Don't look elsewhere!!!", "Author": "Pappu \"Pappu\"", "ReviewID": "R1LNB7N2QFHNW", "Overall": "5.0", "Content": "If you are still looking around for an LED TV, stop!!! This is the one that I will recommend you to buy blindfolded. I had a tough time in selecting a new generation TV. I started with LCDs, then moved to LED, then upgraded my range from 32\" to 40\", 60Hz to 120Hz, VA to ISA panel, and finally bought this one. In the process I tested 3 different TVs, and all of them were not satisfactory. I used to think high of Sony but similar model (40\") failed on sound and feature richness (as compared to this LG model). Watching a movie on Sony sounded like watching a TV serial. I see some reviews complaining about sound on LG. May be they haven't tried changing the audio setting. I tried Q-Menu -> Audio-> Cinema mode/ Clear Voice option to ON/ True Voice (or something similar option ) to ON, and I had to reduce my volume from 55 level to 10 level, and it was pretty crisp audio response. So I do not have any complaints on Audio from this TV too. Yes, the out of the box (Standard mode) audio is not that great. But who cares if there is a way to adjust it in 10 seconds.. The other complaint was on response time. I don't have a gaming console, so I can't comment on that.All the aspects of this TV are pretty satisfying. Picture quality is amazing. Internet feature works like a charm. Super Thin, light weight. I did have to return one LG back (as it was defective - showing a thin blue and green vertical line on the screen) and got a replacement from Amazon. But even in that, I could sense that this TV is great.Finally, Kudos to Amazon customer service. The shipping, returns, delivery, refund was awesome!!!", "Date": "December 29, 2010"}, {"Title": "This TV ROCKS!", "Author": "PAHPAW", "ReviewID": "R1KGB7E5DB7XOF", "Overall": "5.0", "Content": "Excellant Price. Excellant Delivery. Excellant performance.This is my first \"none tube\" TV. Spent plenty of time researching my purchase. I am NOT dissapointed.Everything from the cost, to the ease of use, is exactly as advertised.Even the delivery date and TIME were spot on.I searched the Internet for a coupon. If you are an AMAZON Store Card or Credit card holder, you may be elligable for the discount and finacing I received.Total cost for me, including 3 day delivery, under $700.00.I wired my ethernet connection directly to my router. The performance is excellant. If you are looking for web access, remember it does not have a \"browser\". Just the applications advertised.The USB ports allow you to view pictures and VIDEO's from your USB device. PRICELESS.Thank you AMAZON.", "Date": "December 26, 2010"}, {"Title": "Great TV", "Author": "T. Becker", "ReviewID": "RS6JPRBF03XLG", "Overall": "5.0", "Content": "This is my first HDTV (yes in 2010).  I had an old Sony Trinitron tube that just wouldn't die, and for years I watched screen sizes go up and prices go down.  I finally bit the bullet and picked up this 42\" LG, and am completely satisfied with the purchase.  Picture quality is great, with practically no drop off at odd viewing angles.  Setup was straightforward and took only a few minutes.  One of the reasons I went with LG is they seem to be the only manufacturer making 42\" LCD sets right now.  We have a TV cutout that limits our size choices, a 40\" would fit easily but a 46\" will not.  The 42\" screen fits perfectly.  The set is attractive, and sound is reasonably good for a flat panel TV.  I have also noticed no \"flashlighting\" nor backlight leakage that is purported to be a problem on some LED backlit sets (Samsung in particular).  One thing I will point out is that unlike what I read in another (otherwise excellent) review, LG does do the \"panel lottery\" thing.  This means that the actual panel type is variable, and is not selectable by the consumer.  This particular set seems to come in IPS and VA panel variants.  IPS is the superior technology but I was sent a VA panel, and as previously mentioned I am still completely satisfied. The only way to determine this is by an obscure code that's on the box.  So one downside to ordering from Amazon is that if you're set on an IPS panel, you're essentially flipping a coin.  Otherwise I have no complaints with the shipping/service (as usual).", "Date": "December 23, 2010"}, {"Title": "Great TV all around", "Author": "Ted", "ReviewID": "R1N4528Y32BAPO", "Overall": "5.0", "Content": "Not complaints at all for this TV. Beautiful picture, with $50 USB wireless internet connectivity is no problemo.  Sound is surprisingly good (we don't have an external sound system.  Super flat. Durable screen, cleans up great.  Amazing in HD.  We've had it 6 mos and I'd buy it again in a heartbeat.", "Date": "December 17, 2010"}, {"Title": "Serious Delays for Gaming", "Author": "Baum", "ReviewID": "R1I9TTOW626F7C", "Overall": "2.0", "Content": "The picture on this TV seemed a little off. You know how live TV shows look a little different than movies, for example. Everything looked like it was live TV.Also, there was a noticeable delay in the picture when using the PS3. I would guess it was probably a 1/2 second delay. This isn't a problem when watching TV (since everything is delayed by the same amount), but is a problem when playing games and your responding to something that actually occurred a 1/2 second earlier.I ended up returning the TV.", "Date": "January 19, 2011"}, {"Title": "LG LED/HDTV 42 - Inch", "Author": "Don P", "ReviewID": "R25D3UD77B1YPZ", "Overall": "5.0", "Content": "The LG LED 42-Inch TV is fantastic.  Undoubtedly the best picture on any TV we have seen.  Love the fact that it doesn't heat up as we have it in an entertainment center.  All the applications for operating the TV are very user friendly.  We purchased a 46-Inch Toshiba Regza in 2009 for our second home.  The LED TV's were not out at that time.  I would highly recommend the purchase of any LG TV HDTV/LED.  The delivery from Amazon went very smooth and the TV was in excellent condition when it arrived by special carrier that unwrapped the TV.", "Date": "September 22, 2010"}, {"Title": "Wonderful", "Author": "masterofpuppets242", "ReviewID": "RJD7XEOZLH1TI", "Overall": "5.0", "Content": "Recently put the tv together...its the greatest...great picture...great interface with netflix very very easy to use...the picture wizard is easy to set up...and for the price its not bad at all...i have it in a 13 by 11 room and it looks more like a 46 inch...its great no complaints from friends who have seen it..have played games on it and watched all types of hd channels great quality....recommended", "Date": "August 24, 2010"}, {"Title": "Exceptional", "Author": "KP", "ReviewID": "R3CI5PRZ1VKSLH", "Overall": "5.0", "Content": "I was a little leary of buying an LG product because of the cell phone that I had years ago. This TV is without doubt the best purchase I have made in the last year. The picture quality is fantastic, the sound is just fine even for my hard of hearing husband. No additional speakers needed. I will be replacing my hd dlp tv in the living room within the next year and it will definately be with an LG LED. The picture is 100 times better on this TV than my living room picture. It is also very easy to set up and connected wirelessly no problem with the adapter. Thanks LG for a great product.", "Date": "August 24, 2010"}, {"Title": "Beyond my expectations!", "Author": "John Robert Mobley", "ReviewID": "RBVYLT57AWQYP", "Overall": "5.0", "Content": "I don't know anything about consumer electronics but bought this model television here.  I could not be more pleased.  The picture is crystal clear.I thought long and hard before I bought anything this large and expensive from a website,  but I had absolutely NO problem!I should have paid more attention to my shipping options when it came to free shipping.  I thought it took a few days longer to arrive than it should have, but chalk that up to my not having read all the details.I did try to do my homework about brands and features, etc. I must have done alright because I don't see how this television could be any better.  I'm going to eventually investigate how I can do the wireless hookup to my computer so that I can do the Netflix instant download thing.You can buy a cheaper tv this size but you might get what you pay for.", "Date": "July 28, 2010"}, {"Title": "so far so good", "Author": "xiangrui", "ReviewID": "R66EDZKPA7QYI", "Overall": "4.0", "Content": "This is my first HD TV, so I don't have much comparison. The features look good, and picture quality is good.I did some professional test about the timing and refresh rate. Those specifications are all cheating im my opinion. But to be fair, since there is no standard for these specifications, I believe most, if not all, HDTV have this problem. It says 120Hz, but the real highest it can reach is 60Hz. It says 2.6 ms response time, but the actual value is not any better than regular LCD monitors, which is normally 8 or 16 ms, depending on their own definition (no one knows how they define it). I heard from some experts that they can't distinguish 120/240Hz from 60 Hz. This is ture for sure. Given the slow response time, it is useless even with real high refresh rate.", "Date": "July 25, 2010"}, {"Title": "almost too good", "Author": "M. Maloney \"luvs pups\"", "ReviewID": "R3EQLAZI8W4Y4V", "Overall": "5.0", "Content": "We did quite a bit of research and felt that this LG 42\" LED HDTV w/ internet applications had the features we wanted with the best price/reviews/ratings.  Set up was easy, picture quality is excellent, sound quality is good.  The remote control is logical and easy to use.  Access to internet applications (we hope more applications will become available) works as promised.  There is nothing we don't love about this television.The problem we had was with delivery, which was promised by a certain date and did not arrive.  It took several phone calls and email to arrange a new delivery date, ten days later.  The shipper did make a special \"run\" to deliver the TV and Amazon deducted what we would have paid for shipping.", "Date": "December 8, 2010"}, {"Title": "Don't do it.", "Author": "Kim Bey", "ReviewID": "R1YZJ61N3AZAS8", "Overall": "1.0", "Content": "It's disheartening. I bought it the first part of December 2013, cyber Monday and it starting shutting off and on at will on January 8th.", "Date": "January 10, 2014"}, {"Title": "Beautiful TV", "Author": "Troy", "ReviewID": "R3GUF5PMZWC3G5", "Overall": "4.0", "Content": "Had this TV for lil over 2yrs now and had no problems ,excellent picture quality and sound which is consistent with most LG brands.  I would have given it 5 stars if it was really \" wifi ready \" without having to buy this  LG wifi adapter . Next time LG should be upfront and say that was the case . Overall it is an excellent TV ..very happy with the purchase", "Date": "March 18, 2013"}, {"Title": "Purchased August 23, 2010", "Author": "coalro", "ReviewID": "R2TU65IJ3M120S", "Overall": "3.0", "Content": "Had the TV since August 2010, and has worked great until recently in November 2012. The video and quality is great the audio could be better, but it is a LED slim television.The recent problem is that it seems the screen on the LG 42LE5400 must \"warm up\" before it works or shows a picture. It takes about 5 minutes for the screen to start working, after turning the television on and off several times. This decreases my rating on the television to a 3 star, and not less simply because the screen still works after it stays on.", "Date": "February 17, 2013"}, {"Title": "1080 P LED TV", "Author": "Cecilio Martinez", "ReviewID": "R2JHX3CVR142WD", "Overall": "5.0", "Content": "This Tv turned out to be one of the best I have owned. The Picture quality was clear almost 3d Quality. I bought in 2010 and still working.", "Date": "January 21, 2013"}, {"Title": "Great picture, easy set-up", "Author": "C. Perez \"Artist, business woman, Child of God\"", "ReviewID": "RAU108F43VY4T", "Overall": "5.0", "Content": "We love our TV. The picture is sharp and clear, the colors vibrant. We have connected to our cable box, blu-ray and receiver through HDMI cables and co-axiel. Either way, it worked great. We purchase the USB seperatly that allows us to connect the TV wirelessly to our computer network. It also has an ethernet connection if your would like to be hard wired. We have connected to our mac mini to watch downloaded movies prior to obtaining the USB and the blu-ray. No problem. The TV acted like the best monitor for the computer, ever! It was a great investment and I highly recommend this television.", "Date": "January 9, 2013"}, {"Title": "Great TV", "Author": "oldman", "ReviewID": "RHKSXK5E7IJJQ", "Overall": "5.0", "Content": "Have really enjoyed this TV.  The color and clarity is really good and no blur at all.  Also I connected it to my computer and can view my photos and videos that are stored on my pc.", "Date": "January 1, 2013"}, {"Title": "Great picture quality, few little fixes would make it perfect", "Author": "Nick Richard", "ReviewID": "R2XDBNNZDTC8ZY", "Overall": "4.0", "Content": "We've had this TV for almost 18 months now. It still works great and the picture is outstanding.Out of the NetCast package, we've only used Netflix, Youtube in some occasions and I fiddled with the widgets so I can only comment on these 3 things.Netflix is working fine and the interface is simple enough that kids can use it although there is no parental filter that I know of.Youtube is fine too although the interface is not as easy as with Netflix.The widgets are irrelevant.The TV received maybe 2 updates over 18 months and the support is quasi nonexistent. No new features/services have ever been added which is truly kind of sad.The TV itself is able to play movies from a usb stick and I've been lucky enough that it would stream movies from my Synology NAS. Codec compatibility is basic and in general I think it doesn't play MKV files or any files that had audio encoded in more than 2 channels (although I didn't pinpoint exactly the requirements for a file to fail)Later on I just decided to use XBMC to play files so I guess you would say that I fixed the problem myself.One thing that has been a bit of a problem is that the audio from the headphone plug is pre-equalized (no bass) and there is no way to adjust it from the TV interface. So when I wanted to connect my set of 2.1 speakers that only gets audio in from a mini jack plug, I was really disappointed. Of all, this has been my biggest complaint at this point. I understand that this won't be an issue for most people because they'll plug the optical out to their receiver but I thought that skipping any capability to fix the audio is a mistake.so OK I spent a large amount of this review listing cons but to be honest I love my TV for the picture, it is a truly great panel.Now I got everything worked out, no audio issues whatsoever and I can watch any movie I want but I had to fork out for the right devices.", "Date": "August 28, 2012"}, {"Title": "Great Deal", "Author": "Reply Hazy Try Again", "ReviewID": "RRC2ML9G9ZH0Z", "Overall": "4.0", "Content": "Good picture, options are good. Netflix streaming is the best. Only wish that the apps were better and that Hulu was an option. Since it was an older model, I am happy that it has Netflix.", "Date": "March 14, 2012"}, {"Title": "Perfect", "Author": "Carolynne", "ReviewID": "R3L2Q17MYZCFFB", "Overall": "5.0", "Content": "I bought this TV as a gift for my boyfriend. We have owned it since Christmas 2010. So far there has not been a single problem with the TV. The LED is fanastic, screen quality is amazing. It's super light weight which is a huge plus. No dead pixels, sound quality is great, and so is the wireless. You cannot go wrong if you buy this one. I shopped around for long time and I am very happy with this tv.", "Date": "October 17, 2011"}, {"Title": "Best TV you can buy!!", "Author": "Wayne Pelton", "ReviewID": "R3OAI4QQKQ3ENE", "Overall": "5.0", "Content": "After nearly a year of research and comparing I finally settled on this TV.  I am very very glad I did.  This TV has an incredible picture.  I went to Best Buy and looked at many models and brands, this TV has the best picture quality out there.  I love the apps that come with it as well.  I use many of them frequently.  I also love that I can connect a hard drive to this TV via the USB and play all my digital movies, music and photos on it with no issues.  I will have to say the sound is not that great but I did not expect the internal speakers to be that good in any TV.  I also am a little disappointed with the speed.  Very rarely but on occasion you can see some ghosting when something is moving fast.  I notice this specifically on two occasions.  One is watching football.  every so often you can see a trail behind the ball when it is thrown.  Overall it is not bad but that just bugs me when it does occur.  The second occasion is when I play a Tiger Woods golf.  The ball in the air has a line behind it.  I play all kinds of other games and don't notice this but it is there for the golf.  Overall I am very pleased with the TV and would not go back and change my mind if I could.  You will be very pleased with this purchase.  My mother in law keeps commenting on how she wished they had bought this one like I recommended rather than the Panasonic they got.  The picture between the two is not even comparable inspite of the fact that the Panasonic cost more.", "Date": "September 6, 2011"}, {"Title": "Very pleased overall", "Author": "PBcup", "ReviewID": "R1KN8KYMUD920R", "Overall": "5.0", "Content": "I've had this TV for 10 months and so far very pleased.HD Picture quality is excellent from both the internal digital tuner and Blu-ray: a lot of my friends have said the HD on this tv looks better than theirs. The colors are very well balanced, images are crisp and bright...overall very good. I suppose that other tv's have better black levels but I always watch TV with a light on and never have problems with inadequate black contrast. The biggest plus is the screen coating. Some tv's use a highly glossy screen to make their colors appear more vivid but this causes lots of ambient reflections. This TV looks GREAT in a well-lit room- reflections aren't an issue.  Only image-related advice is to to turn on \"game\" mode when playing HD games otherwise it can be a little jittery!I really bought this TV to watch netflix and it's very good & easy to do that on this tv. Two issues that haven't bugged me too badly deal with the internet applications (vudu, MLB, esp. netflix):1) Still no hulu or Amazon instant video in Netcast although it's been promised for a while now...2) The audio on the internet streaming apps seems to lag on digital output connections (analog is fine though). I have a home theater system hooked up and have to switch it from the digital to analog input to avoid weird echoing.Overall I'm impressed with this tv and feel it was a very good purchase.", "Date": "July 4, 2011"}, {"Title": "I Like this TV!", "Author": "Betty Johnson", "ReviewID": "R8JTVYBN0CD95", "Overall": "5.0", "Content": "I like this TV, although it seems a little blurry if you get too close.  My eyesight is not great and I watch from about 12 feet away so it is an AWESOME picture from that distance.  Only issue I'm having is getting the display setup correctly to use as a monitor with my HP pc.... maybe LED is not the best display format for this option but I can use it pretty well.  All in all a good investment.", "Date": "April 17, 2011"}, {"Title": "LG 42LE5400", "Author": "loudlizard", "ReviewID": "R2IPGZ7H5H4XC1", "Overall": "5.0", "Content": "I have had this set for about 4 months now and love it. I made sure to get one with an IPS panel, not a VA panel. There is a huge difference. This set has amazing colors, nice blacks, and plenty of inputs. I have not tried connecting it wirelessly because my router is 2 feet away. I have not tried connecting a hard drive via usb either because i have a NAS. The internet apps are ok, but everything else i have already has them (SP3, TiVo, Xbox 360). The picture wizard setup does a pretty good job, but i also bought a calibration disc for some fine tuning. The viewing angle is great, almost 180 degrees. Overall this is a great TV for the price. I highly recommend.", "Date": "March 31, 2011"}, {"Title": "LG 42LE5400", "Author": "Evan J Day", "ReviewID": "RHVX6SS37J1X0", "Overall": "4.0", "Content": "Coming from a 25 year old, 800 pound tube TV, anything would look spectacular.  After a lot of research, I decided to go with an LG LED and found a good price on Amazon.First, the television - well worth the money.  The model I received has the \"good\" panel, and the picture quality, field of view, and brightness are all top notch.  I haven't upgraded the cable box to HD yet, but DVDs, Wii, and XBox360 all look amazing.  No blurring or ghosting is evident, and there's no apparent picture lag when playing video games.  The sound is passable, but I wasn't really expecting much.The packaging, on the other hand, was unacceptable.  I nearly refused delivery after seeing the state of the box - the retail box (Hi!  I'm a big television!) had a mailing label affixed to it.  It was also severely beaten up and nearly open on one end.  After noting this to the UPS driver and hearing no rattling parts on a gentle shake, I accepted the package.  Turned out that nothing inside the box was damaged, but I would expect better packaging on a big ticket item, especially from Amazon.  My past experience with packaging on Amazon deliveries has always been good, but I'll probably think twice before buying anything large or expensive.That said, I'm very happy with the product, and the price is still unbeaten, even after everyone knocked prices ahead of the Super Bowl.", "Date": "February 10, 2011"}, {"Title": "LG 42LE5400 42-Inch 1080p 120 Hz LED HDTV with Internet Applications", "Author": "rrogler", "ReviewID": "R3PC8SJ8RJO13Q", "Overall": "4.0", "Content": "One bad pixel. Very inconvenient return policy (send repairs to manufacture). Separate wifi dongle req'd. Wireless connection the worst in the house (Roku and Sony dvd located imediately close by). Skip the internet capability if you have another option. Beautiful set. Intuitive setup/operation. Good remote layout. Incredible picture clarity. Too real...everything looks like a movie set. Takes some getting used to. I'll manage.", "Date": "February 10, 2011"}, {"Title": "Great value and quality", "Author": "country music", "ReviewID": "R2IHOUESKQECFG", "Overall": "5.0", "Content": "We wanted to upgrade our TV, so I began researching what we may need or want. Settled on on the 42\" Led LG with wireless features. We live in the country so we have satellite service. For us, we don't need or have HD service. Only had TV for a couple of months but are well pleased with purchase.", "Date": "February 1, 2011"}, {"Title": "Very Happy", "Author": "R. McGaha \"Avid Hunter\"", "ReviewID": "R2RI9Q4YDC2PKH", "Overall": "5.0", "Content": "I'll just say that it exceeded our expectations and that we are very pleased with our purchase and how quickly we recieved it.", "Date": "January 28, 2011"}, {"Title": "Great Picture", "Author": "Dave", "ReviewID": "R3HTQSUOZY1G9L", "Overall": "4.0", "Content": "Great picture ,easy to set up ,just the right size for my room .I connected to internet via cable as wireless connection requires additional equipment. The only thing to note ....I have Bell South lite internet connection (700MBS) too slow to stream movies. Also the only audio output (except headphone) is optical. But overall a great TV for less than $ 800.00 (Free shipping) slow ....not when expected ..had to P/U myself at local depot.", "Date": "January 28, 2011"}, {"Title": "Excellent picture quality", "Author": "Kasthuri sankar", "ReviewID": "R2EIE2BKH9NHCZ", "Overall": "5.0", "Content": "One of the best televisions in the market. Excellent picture quality, good sound, light weight, slim design, plus Internet apps.", "Date": "January 26, 2011"}, {"Title": "Awesome TV for the buck!", "Author": "BayArea Tech Kid", "ReviewID": "R32B6WEDVBER9F", "Overall": "5.0", "Content": "I got this TV for almost a month now, and it's working great. Although I don't have any HD channels, the picture quality from playing Blu-rays & DVDs are great! The sound from the TV works, just like most normal TVs, can't complain. I give it 2 thumbs up for this LG LET TV!", "Date": "January 24, 2011"}, {"Title": "Great Picture", "Author": "ck77", "ReviewID": "RD66UYYJURSUX", "Overall": "5.0", "Content": "This LED TV provides a beautiful picture complete with bright whites and deep blacks.  Fairly easy to set up wireless internet  applications with a dongle that was purchased separately.  The sound is acceptable but I will be purchasing a home theatre system.LG is under rated and I am glad I gave it the benefit of the doubt.  Would purchase again.", "Date": "January 15, 2011"}, {"Title": "Great product for the price", "Author": "Andrew", "ReviewID": "R2E74TR0EBS2U3", "Overall": "5.0", "Content": "Had the TV about a week now. Super easy to setup out of the box. Had to do a double-take on the picture quality at first. The menu is very intuitive with a nice quick menu feature which easily allows you to switch between preset or customized picture and sound settings based on what you are watching (i.e. sports, cinema, gaming, etc).I am very pleased with the picture quality on this TV. I researched many others and finally went with the LG and have no regrets. I know several reviews have commented on the sound, but if you are not an audiophobe then the sound will do just fine.I haven't used the online component yet, but am planning on taking advantage of the YouTube and Netflix. Hopefully some other content comes out to be more appealing for online use.", "Date": "January 12, 2011"}, {"Title": "Our first LCD TV", "Author": "Norman Sohar \"Norm Sohar\"", "ReviewID": "R1FOJ987FS9HGP", "Overall": "4.0", "Content": "This LG is great, I am a techie and hooking it up was childs play everything just worked. The picture is great and there is now depth to the screen we never had before. I would recommend this TV to my friends and family. I just love it. The sound system works best with a solid wall behind it standing it out in the open the sound is louder behind the TV than in front. Maybe if I get my sound system hooked up to the TV those problems will be gone.", "Date": "January 10, 2011"}, {"Title": "Great TV", "Author": "DTA", "ReviewID": "R2VF9OYMYN6SEU", "Overall": "5.0", "Content": "I was very skeptical about buying a tv online but after reading many of the reviews on here and the cost savings of doing such a splurged. I chose this particular set because I wanted something very thin with a great picture. I went to my local best buy, which luckily had this tv on display. everything about it looked great so I ordered it that night.I received my new tv about 2 weeks ago. I set it up and it looks great out of the box, but I did do some advanced set up to get the best picture possible. Sound is good, albeit not spectacular. I plan on getting a surround sound system soon. I would highly recommend this television.", "Date": "January 10, 2011"}, {"Title": "Very satisfied", "Author": "Avi Flax", "ReviewID": "R3FINFB1MDJFZC", "Overall": "4.0", "Content": "My wife and I are both very happy with the TV. We use it with digital cable (no box, using the built-in tuner/decoder), Apple TV, XBox 360, and the built-in Netflix app. The performance, picture, ease of use, setup; they're all good. The UI in particular is above average for TVs. We really like the wifi adapter (sold separately) and the Netflix app. The remote is convenient and easy to use.A few notes:* there's no RCA audio-out. So if you have an older sound system, you'll need to use the ¹''\" headphone jack on the side, and you'll need to provide your own adapter/cable. Using the jack also disables the \"Clear Voice\" feature, which we were looking forward to trying* we don't like the \"TruMotion\" feature -- it makes things look strange. we keep it off.* We don't use the built-in speakers, only a separate amplifier and bookshelf speakers, so I can't address how the built-in ones sound* I really like that it can be set up to keep all lights off at all times. When we're watching a movie, there's no power light, logo light, or anything at all on the bezel to annoy me.* The included stand is attractive, well built, and swivels very easily, which can be handyI'm pretty picky about technology, and I'm very satisfied with this TV.", "Date": "January 9, 2011"}, {"Title": "AMAZING TV", "Author": "SaM", "ReviewID": "R1906R691V1IT5", "Overall": "5.0", "Content": "I looked at a lot of TV's before I made this purchase and I got to say I am so glad that I purchased this one. The picture quality is amazing with Blu-Rays and with playing games on the PS3. Best TV for the price!!!", "Date": "January 9, 2011"}, {"Title": "LED HDTV", "Author": "Willie Montgomery \"womont\"", "ReviewID": "R2QZCFY1JYYN76", "Overall": "5.0", "Content": "I have a DLP HDTV which I am planning on replacing within the year.  When I do it will be for an LED HDTV-probably an LG.  The resolution and brightness far exceeds the DLP, plus the comparable weight and slimness makes the choice a no-brainer.  As far as I am concern the LED is to the DLP HDTV as the flat screen HDTV is to the analog TV.  Before I make any major on-line purchase, I read the reviews first before making a final choice.  With my purchase of LG's LED HDTV, the reviews were \"right-on\".  The only disappointment I have so far is with the instructions on the remote control.  But with time and further research this will be solved.", "Date": "January 5, 2011"}, {"Title": "WOW", "Author": "Gunga32", "ReviewID": "R34IG7TMFT9KR3", "Overall": "5.0", "Content": "Works just great, easy set up. Remotes are virtually interchangeable with the LG BLU Ray player I bought (LG590). Not an issue thus far. Far Greater VALUE I would say. Only time will tell though.", "Date": "December 31, 2010"}, {"Title": "awesome tv for the money", "Author": "king xfactor", "ReviewID": "R3DTCMLHT4R5WN", "Overall": "5.0", "Content": "this was my first purchase of a led lcd tv and it is awesome and great glad i purchase this tv and will do so again", "Date": "December 30, 2010"}, {"Title": "a great tv for the money", "Author": "rkarg", "ReviewID": "R27J7JFHU4PEU9", "Overall": "5.0", "Content": "I actually got this TV at walmart for 850.  Seems to be a competitive price with the online shops.  The picture quality and brightness are excellent.  I got a BD 570 dvd player (also LG) that works really well with the TV.  Sound isn't bad, but you'll want to get a speaker system eventually.  42\" model is plenty big!", "Date": "December 30, 2010"}, {"Title": "Awesome TV", "Author": "Tim", "ReviewID": "R1EI9I07WRA0Z6", "Overall": "5.0", "Content": "This TV is awesome.  I may be biased as I am coming from a regular tube TV, but I have friends and family with HDTVs that I can compare with.  The picture quality on HD channels is excellent and on regular channels is pretty good too.  Sound quality is good enough for me, my wife thinks its only OK.  Set up is easy as can be, I set it up without needing the manual.  I needed the directions in setting up the Netcast features but this was relatively easy too.The only bad thing I can say has nothing to do with the TV, it has to do with shipping.  The product took twice as long to get to me as was quoted.  I realize that this was bought after Thanksgiving and shipping slows a bit at this time but when your quoted a week and then a week goes by and it hasn't even shipped yet, that's poor business.  In the end I received the TV and now I am quite happy.", "Date": "December 27, 2010"}, {"Title": "A great buy", "Author": "S. Hohneisen \"Movie Maker Wannabe\"", "ReviewID": "R2KK8NTSFNSCZJ", "Overall": "5.0", "Content": "We have had this tv up and running for about a week now.  The picture is gorgeous!  We haven't used the internet applications yet but hope to do so shortly.  We are very pleased with our purchase!", "Date": "December 26, 2010"}, {"Title": "Very satisified", "Author": "matthew madden", "ReviewID": "R1ZV9QBCHO0WTT", "Overall": "4.0", "Content": "I looked at a bunch of LED TVs but finally settled on this model and I am very happy with it. The picture quality is very good and I'm sure would be even better if I took the time to properly calibrate it. The design of the TV is also very nice. Extremely thin and relatively light weight for the size. My favorite feature however is the Netflix app. It was so easy to setup! Just plug in the ethernet cable and the TV does the rest. For the money, I really think this is a great buy.", "Date": "December 22, 2010"}, {"Title": "Love it", "Author": "VC \"VC\"", "ReviewID": "RQQWWQRA4B79", "Overall": "4.0", "Content": "We are loving it and are quite happy with the choice we made. The wifi enabled internet apps makes the experience so much more richer. I would have given a 5 except for the sound quality - which is not great though esp. on streaming. I hear a jarring noise if I increase the volume beyond 10.", "Date": "December 22, 2010"}, {"Title": "Great TV", "Author": "J. Riggleman", "ReviewID": "R38QD968K5HC3N", "Overall": "5.0", "Content": "Wonderful TV...a big improvement for us.  Excellent packing and delivery.  Feels like the people are going to jump off the screen and join you in the living room.  No problems with set up.", "Date": "July 26, 2010"}, {"Title": "Awesome TV!  Even Better Service!!", "Author": "Kevin", "ReviewID": "R23ATASJKS6GXX", "Overall": "5.0", "Content": "I got everything I wanted with the TV.  It was shipped very securley with bubble wrap completely surrounding the tv.  I received is days before I expected, which was awesome.  Highly reccommend doing business with these guys.", "Date": "August 25, 2010"}, {"Title": "Great Tv shame about Internet Apps Not working with Bekin N+ Router", "Author": "sne0000", "ReviewID": "RNE622KKCMMF1", "Overall": "3.0", "Content": "Great Tv, shame about internet apps and wireless integrationPros -- Picture Quality- loved the auto-adjust sensor for day and night viewing..- Ability to play video from my external HDD (including music, video & photos from my digital camera were allCons -- Unable to get working with additional USB adapter and Belkin n+ router, (After a lot of playing around, finally contacted LG Support how indicated Wireless USB does not work with Belkin N+ router at this time, and I sould either buy a new router or plug it in to the router directly (enough said)...- No PIP functionality (would have liked to split screen my computer with tv)", "Date": "December 5, 2010"}, {"Title": "Great picture, poor sound, frustrating data input using remote", "Author": "Rajiv S. Kumar \"Rajiv\"", "ReviewID": "R30XD2FI9SCCXN", "Overall": "4.0", "Content": "I recently purchased this after much research. The picture quality is amazing as many reviewers here have pointed out. But the audio quality is terrible (also noted by most reviewers). It sounds like the hosts on CNN are talking to you on a telephone (sometimes worse). I thought using HDMI inputs you should get the best of everything. It seems the audio quality is an issue with most Flat Screen TVs nowadays because the manufacturers expect you to have external speakers. If you like to watch VH1 or like to listen to MP3s on your external USB, then the audio quality is going to be an issue.For internet access, I am using a wireless USB dongle from LG. I have a one word review for this feature - \"FRUSTRATING.\" It asks you for a wireless WPA password everytime you turn on the TV instead of remembering it. Since the remote doesn't have a QWERTY keyboard, you have to use telephone like inputs to enter your inputs. The inbuilt browser is pretty bad. It doesn't try to fill in forms for you from previous inputs. Page navigation (forwards, backwards) doesn't work the way computer browsers do. So I often have to input entries all over again when I am trying to search Youtube videos, using the telephone like keypad. Perhaps TVs will have better inbuilt browsers in a couple of years.I am still giving this 4 stars because of the picture quality on some of the HD shows. But note that a lot of video content, especially old archives are not shot in HD, so when the TV tries to stretch it to fit the big screen, it can look pretty bad.", "Date": "December 9, 2010"}, {"Title": "More than I expected", "Author": "C. Mok", "ReviewID": "R3A60NFB43RTNZ", "Overall": "5.0", "Content": "I was looking for a large screen monitor for a project I am working on that requires a fair bit of screen real estate. I was tired of toggling between tabs and moving windows around my iMac monitor.  Buying an 30\" Apple Monitor screen would have set me back $1799. I started to do some research and I was surprised to find price of comparable LED screens to be significantly less.I bought this at a local retailer as an open box item for $950. The additional features of Internet and WiFi ready, D-TV scanning and audio options just makes this a no brainer even at full retail price.Took a little while to get this all set up but well worth the effort.", "Date": "April 29, 2010"}, {"Title": "Very Satisfied", "Author": "Kapampangan ku", "ReviewID": "RYGKVRRDGAZBC", "Overall": "5.0", "Content": "My first one was a Sharp 40 LED aqous which I returned to Best buy becausee it is so bad that I prefer to watch on my CRT TV.Then after reading a lot of reviews and going to the store (Best Buy) I finally decided on this LG 42\" LED5400 model. I've had to say that it is way better than the Sharp TV and cheaper too. I got mine last Dec. 2010 for $900 with a free 14\" lcd tv from Best Buy. What I like most about it is it's Netflix interface which is better than the Netflix interface in my Sony BRP (which is wireless by the way so I don't need the LG wifi adapter)So from now on, when I buy TV, LG is my first option", "Date": "May 29, 2011"}, {"Title": "Awesome TV, Awesome Value", "Author": "Dan from DC", "ReviewID": "R1BGOQ8S769UVA", "Overall": "5.0", "Content": "I bought this last year around the holiday season when it was only $799.  What an AMAZING TV.  The picture is crystal clear, the speakers are crisp and loud (if you want them to be - some TVs dont have a loud volume) and the color is spot on!This is my first HDTV and I'm loving every minute of it.  Now when I order PPV MMA fights, I get to see all the action in HD.  I went to my parents to watch TV and standard definition looks so blurry now compared to HD.Look for coupons/sales like I did and get a good deal on this TV if you can - otherwise, even at $1300 I believe it's worth the money.", "Date": "April 27, 2011"}, {"Title": "mess1", "Author": "mess1", "ReviewID": "R1LCZNOLO50PKX", "Overall": "5.0", "Content": "The sound and picture quality is superb.  Love watching HD pictures, as the characters seem that they are in the room with you.", "Date": "April 23, 2011"}, {"Title": "LG le5400 42\" edgelit LED internet app ready 120hz TV", "Author": "CTmets Fan \"shoes54\"", "ReviewID": "RNVO2X4T094SF", "Overall": "5.0", "Content": "First of all i`m very satisfied with my purchase of this LG le5400 42\" edgelit led TV.My other choice was the the Samsung 40\" 6000 seriesI choose the LGThis review could cover all three versions of this set: 5300le basic 42\" led tv 5400le internet app 42\" led tv (wireless is a add on option 115.00) 5500le wireless internet built in app 42\" led tv  The delivery was \"white glove\" which i did not expect, they unpacked the Tv set it up and tested itoffered the option to take the box (garbarge away)  Is this the best 42\" Tv ........NO! but its very good for the money  On a scale of 1-100 i would give it a 86......so yes there is room for improvementThe \"final\" setup allow 45-60 minutes for tweaking settings in the menu color, tint, brightness sound backlight level,and firmware updates. There are a ton of tweaks you can do to this set ON the down side it take 15 seconds for Netflix app to load  there IS some backlight bleed in spots ONLY when in 16:9 mode and if you look really hard for itspeakers that come with it  ARE ok but add on one`s really add to the viewing experienceGenerally speaking it has a very rich picture 90/100 scoreI have had this set for 4 months as of today 4-21-11 and i would reccomend this to friends", "Date": "April 21, 2011"}, {"Title": "Great TV in LED LCD HD class", "Author": "technoswitch", "ReviewID": "RQCZK7KEJ4E5N", "Overall": "5.0", "Content": "Set up is 5 min, has easy Picture Wizard to get optimum picture for a show. You can Zoom to get full screan if Blue Ray disk gives you black bars, requires HDMI to get best features, do not use AV cables they are included as a prop they do not use full HD capabilities; base is heavy enough to avoid tipping but if ih you have children you must secure screen to a wall or furniture bolts and clamps are provided in a box with TV", "Date": "January 12, 2011"}, {"Title": "remote", "Author": "jack", "ReviewID": "RQYKIIWUSU47U", "Overall": "4.0", "Content": "tv seems to work just fine so far. has very good picture. only problem is the remote sucks. the netcast and widgets button is to close to the direction arrows. when im searching netflix movies it is too easy to hit the netcast button and then it starts all over. maybe i will get used to it but i dont know. a real pain in the a--. overall i think it was a good purchase", "Date": "December 21, 2010"}, {"Title": "Edge Lit LED technology problems", "Author": "Mo", "ReviewID": "R22VDPXFJBU8P6", "Overall": "2.0", "Content": "Great feature rich thin LED TV however due to the edge lit technology you will be very disappointed with flashlight looking light sources in all corners in dark scenes.  You will not notice this till you take it home and watch it in complete darkness.  Included remote is not universal and design sucks.  I bought it from Bestbuy and returned it.  I would stay away from this one.  Vizio XVT series is looking better and better.", "Date": "September 13, 2010"}, {"Title": "Terrible backlight bleed and Noticeable lag", "Author": "happygolucky", "ReviewID": "R1MZRFQ7M1IYRZ", "Overall": "3.0", "Content": "To be fair, I'm not a big tv/movie watcher.  I don't even have cable (or any free channels for that matter).  We were looking for a new tv to replace one that I broke a few months ago.  Its only purpose would be to watch free online content via a computer, occasional movie watching, and playing video games. The lag on this tv while playing video games was enough to make us return it.  It also has major backlight bleed.  It was immediately noticeable, especially around the corner and edges and in also the center.  After researching, it looks like LG has used 2 different panels for this tv.  Unfortunately, we got a bad one.From what we watched, the picture quality was fine.  You definitely need to turn off the true motion to stream netflix or else the contrast is noticeably off but I've seen this on the Samsung as well.  As for it's other features: Aesthetically - the tv looks great.  The remote and menus were user-friendly.  Seeing that I still need to connect my computer to the tv, I found most of the app pretty useless.", "Date": "November 19, 2010"}, {"Title": "What a letdown!", "Author": "bethany", "ReviewID": "R36KNKRSQELS3I", "Overall": "2.0", "Content": "We bought this TV from a large electronics store for $900. It had excellent specs for the price. We got it home, set it up, and immediately noticed that the whole left side of the screen was brighter than the rest of the TV. It was noticeable even while watching a movie. With a black screen, the \"flashlight\" light bleeding was painfully obvious - there were distinct blotches scattered around the screen, with the left side being the most uneven. It was really too bad, because this TV was truly beautiful and the picture quality was excellent. Even the speakers sounded good. But the blotchiness was unacceptable so we packed it back up and returned it.I do not know if this is a weakness of all edge lit LED LCD TVs, but rather than gamble on another I think I will just buy a second plasma model.", "Date": "August 9, 2010"}, {"Title": "Excellent Awesome Product!!!", "Author": "sampler", "ReviewID": "R1GZIBGN5BGXNU", "Overall": "5.0", "Content": "An excellent product. Easy to operate, setup, connect etc. Awesome picture quality with LED back lighting. Awesome product, like it very much.", "Date": "June 20, 2011"}, {"Title": "Amazon current price", "Author": "Leonid Zolotarev \"leo\"", "ReviewID": "R1CUBYXSREA0RL", "Overall": "4.0", "Content": "Please check the price on HSN right now.  It is $899.00, and the item is on a flex pay plan: 5 payments of 179.99.", "Date": "September 9, 2010"}, {"Title": "Defective", "Author": "Laurence P. Letarte \"Pats fan\"", "ReviewID": "R1L6B8ZL2MV9HS", "Overall": "1.0", "Content": "Shortly after setting up the TV the control panel and remote were non-functioning.There was no volume control etc. and I would have to unplug the set in order to turn it off.When plugged back in, at times it would reset and the controls and remote would temporarily work normally.On other occasions when plugged back in, the TV would turn on immediately with the control panel and remote were not functioning.There appeared to be no correlation with the time left unplugged and whether it worked normally or not.", "Date": "December 3, 2010"}, {"Title": "pending", "Author": "Jerry", "ReviewID": "RBS8SCLZOC3L4", "Overall": "1.0", "Content": "As of today still waiting for a replacement for original TV.  After hook up found sound OK, but no picture.  Changed cables even had local cable company come in.  Customer very anxious to have the new TV in place.................", "Date": "July 12, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "LED Backlighting\nNetCast Entertainment Access (Wi-Fi Ready)\nWireless 1080p Ready\nTruMotion 120Hz\nPicture Wizard II\n1920 x 1080 full HD 120Hz resolution With LED Backlighting\n3,000,000:1 dynamic contrast ratio\nPicture Wizard II with 2.6ms response time\nWide 178-degree vertical and 178-degree horizontal angles", "Name": "LG 42LE5400 42-Inch 1080p 120 Hz LED HDTV with Internet Applications (2010 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/41OmTMz2SkL._SY300_.jpg", "ProductID": "B0039JBXSM"}}