{"Reviews": [{"Title": "Satisfied.", "Author": "Nostromo", "ReviewID": "R17B6YRJL9BAI5", "Overall": "4.0", "Content": "I am quite satisfied with this TV. I bought it after reading many online reviews, from which I concluded that one of the most common problems with inexpensive flat-screen TVs is tinny sound. This TV has good speakers, and the graphic EQ feature enabled me to tailor the sound to what I wanted. There are also extensive ways to customize the picture, which I needed to use because I was initially dissatisfied with it (the \"home\" setting is not as bright and cheery as the \"retail\" setting, but that can be fixed.) The only features I miss are an electronic program guide readout, which my miserable little analog converter box was able to provide, and a \"favorite channel\" selector. With this TV, you only have the option of the deleting channels from the \"up\" and \"down\" selector buttons, instead of being able to jump to your favorites.", "Date": "May 15, 2011"}, {"Title": "NO CLOCK!!!!!", "Author": "anonymous", "ReviewID": "R1MO5RIFATU00M", "Overall": "4.0", "Content": "Wanted a small, SIMPLE tv for the bedroom with a remote i could operate half asleep. This was great (sound, pic, operation, setup - all good).But... it has a sleep timer (yay), yet NO CLOCK!!!! My TV is my alarm clock so i might actually take it back. Pity for such a nice little unit. I haven't seen a tv without a clock in 25 years. Never occured to me to even check before buying. BUMMER!!!", "Date": "February 1, 2011"}, {"Title": "tv", "Author": "nklinger01", "ReviewID": "R2M3F5XHKYDV05", "Overall": "5.0", "Content": "Great Television, we got it for our kitchen and it fits great, picture and quality are awesome.  Very pleased!!", "Date": "December 31, 2010"}, {"Title": "didn't last", "Author": "prayerman", "ReviewID": "R3UR8XEM705VXQ", "Overall": "1.0", "Content": "I got it around Black Friday two tears ago, and it worked OK til today, when it just died...Sylvania support was not very helpful-told me to check the power cord, and that was it--looks like I'll have to look for another Black Friday special, but not a SylvaniaHave updated this review and changed it from a 2 star to a 1 star, because I checked to have it fixed, and it was $98 for a new power-board for a $140 TV.  And I've read that other Sylvania TV's have had simlar short longevity problems.", "Date": "November 9, 2012"}, {"Title": "syvania lc19osl1", "Author": "Tim O", "ReviewID": "R1T9HZIXDLBHYM", "Overall": "1.0", "Content": "Only lasted one year and picture screen went all white when warmed up. Sylvania said too bad, over one year, and they were absolutly no help. TV repairman said this happens all the time with Sylvainia because the glue they're screens together instead of welding and would cost as much to buy a new tv as to fix. Total loss and tv not much more than a year old.", "Date": "January 12, 2013"}, {"Title": "Amazing!", "Author": "cveazey", "ReviewID": "R2KR5CJJN6ZQA0", "Overall": "5.0", "Content": "This little TV is awesome! I purchased it over a year ago for my daughter's room. It is mounted on the wall and works like a dream! A must for a small room.", "Date": "February 10, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Supports 1080i,720P,480i,480p\nSide PC Input,2 HDMI inputs\n1366 x 768 WXGA res\nSleep Timer, auto shut off\n5 band EQ and ECO", "Name": "Sylvania LC190SL1 19-Inch 720p LCD HDTV, Black (2010 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/411ymjzPcJL._SX300_.jpg", "ProductID": "B003AVMZ5Y"}}