{"Reviews": [{"Title": "best 37\" lcd for the money, hands down.", "Author": "benrush \"-ben\"", "ReviewID": "R38TTQR937UOSZ", "Overall": "5.0", "Content": "Just got this last week. Could not be happier with my purchase. This is a really good product, and unbeatable for the price.Big Pros:1. Great picture quality and accurate color, even with non-HD sources. No issues with jitter or artifacting, even during high-speed motion scenes.2. Super simple menus and controls. Everything is well-designed and placed exactly where you'd expect to find it. You can even name the various inputs so you don't have to remember which port your devices are plugged into.3. Decent sound, for an LCD (Note to the other reviewers who criticized the sound: Come on! If you're that passionate about audio fidelity, get a stereo. There's no LCD on the market that produces deep, rich audio... there just isn't enough room in the box to put large speakers.)4. LOTS of options for adjusting color, contrast, picture size/position and audio (but the factory settings work just fine for me).5. Uses less that 75 watts of energy when powered on, and less that 1 watt when off!Minor Cons:1. Very mediocre styling (looks like the tv and remote were designed in 1990).2. The back-lit Vizio logo stays on even when the TV is off. (Come on, Vizio!)3. Power button is hard to get to.4. No side-mounted HDMI port.5. The base could be sturdier (just a little too much wobble for my comfort). Also wish it had a swivel base.6. The high-gloss finish on the plastic bezel is way too delicate. Managed to scratch it just wiping clean with windex and a paper towel.7. The \"quick start\" instruction sheet is made for several different models, and most of it DOESN'T apply to this model.Audio tip:Though I believe the \"TruVolume\" setting is supposed to REDUCE problems with volume jumping between commercials and shows (and volume difference between channels), I found the sound was much better with this option turned OFF. Go to Menu -> Audio -> Advanced Audio to change.Tips for AT&T; UVerse users:- Use remote code \"1343\" to program your UVerse remote, not the codes provided by Vizio or ATT.- To ensure you're sending the highest resolution signal to your tv, go to Menu -> Options -> System Options -> Aspect Ratio, and change to 1080i.", "Date": "January 10, 2011"}, {"Title": "Was surprised.. no problems.. including sound.....", "Author": "Fred in Los Angeles", "ReviewID": "R3CZHFOU46MY5A", "Overall": "4.0", "Content": "Ok, I know alot of people have been saying this TV has some issues... but I have not really noticed anything with mine.I connected it to my FIOS HD box and works nicely.  HD is really nice on this tv... with SD content I see artifacts... but not too bad.. but noticable.  I turend off the TruSound and TuVolume (remember you need to adjust settings for each input).  For me, it made a great difference (this TV is in a bedroom).. and the TruVolume seems to do the opposite of what intended to do.That being said, alot of nice features and adjustments.  I have it in my backroom and about to order the mount.  But really enjoying the picture quality.  One note, the Vizio logo stays lit as long as power is on the set... White when powered on, yellow when powered off... the off setting is not too intrusive.. but may take getting use to in a bedroom...overall very nice tv and works well with FIOS!", "Date": "October 2, 2010"}, {"Title": "Fantastic TV!", "Author": "sbrem", "ReviewID": "R1FYYW7D0OX39Y", "Overall": "5.0", "Content": "I bought this TV yesterday and set it up in about 5 minutes. The menu options are a breeze and the picture is unbelievable. I always find problems with the Sound level or quality on most TV's that aren't hooked up to some sort of audio system, but the sound from this TV is the bomb! I bought this for $458 brand NEW! I love it!! Highly recommend!", "Date": "October 13, 2010"}, {"Title": "good tv for the $", "Author": "willy \"home owner\"", "ReviewID": "R1YQB0CN5MGGJZ", "Overall": "5.0", "Content": "Bought this tv from costco 1 week ago.  Watched some football over the weekend with over the air antenna and the picture was fantastic.  Haven't experienced the problem with the volume that some other people are talking about.", "Date": "October 4, 2010"}, {"Title": "Sound is NOT stable", "Author": "C. Mendoza", "ReviewID": "R3EP2U68GSIFWA", "Overall": "2.0", "Content": "This TV has GREAT picture quality and everything about this TV has been impressive except for the sound. It has a feature called TRU SOUND which is supposed to keep the volume levels stable between channels and commercials. It doesn't work. You will be watching a program, a commercial comes on and the volume skyrockets. Even DURING a program the volume will fluctuate. You find yourself having to have the remote in your hand during the entire program to keep the sound levels even.I'm hoping the set is just defective, so I'm going to exchange for another one because everything else about the set is great.", "Date": "September 11, 2010"}, {"Title": "Excellent for the money", "Author": "A. Ferreira \"64-year old baby boomer\"", "ReviewID": "R313C4C1PHHLAT", "Overall": "5.0", "Content": "I ordered an RCA 37\" for our bedroom and it was DOA from the shipper.So I got my money back from Wally and then found this one on display in their Club store for a really good price.We wanted a 37\" for our bedroom.The color and picture quality are excellent, and it was very easy to set up. I had it out of the box and up and running and adjusted in under 30 minutes.The neck is already attached but you have to attach the base. The base is a tight fit on the neck, so if the one anchor screw that attaches the base doesn't seem long enough to thread, be sure you peel off the plastic protective sheeting from the base and neck, and then try pushing on the base just a tad harder to get it seated adequately, which will allow the screw to thread. Only one screw holds the base to the neck, however there are plastic fittings in the base and neck that interlock to hold the base securely --but that one screw IS important, because it will keep the base firmly on the neck and thus make the entire assembly stable. Work at it until you get that screw in tight, it's important to avoid wobble, and to keep the TV from detaching from the base over time.To unpack safely and scratch-free I put the entire TV box on our bed-- TV face up-- then reached in and gently eased the TV out of the box and onto the bed linens. To attach the base, I just eased the TV over to the edge of the bed and screwed the base on, then gently picked up the completed TV assembly and set it on our dresser, which is its designated spot. Piece-o-cake. And the base has a screw hole in the center rear if you want/need to tie the TV down to its resting place.I'm not going to address sound quality issues-- Our bedroom sound requirements are meager and the sound is quite adequate. We have the true-volume turned on with no problems, and the sound at 1/3 of max is more than enough for us. I checked the sound without the true volume and it was significantly less.I do wish the remote was not solid black, or at least that it was lighted-- as it is not lighted, I won't see it in the dark at all.One weird thing happened with the remote: the TV got \"stuck\" and the remote appeared not to work, in fact not even the controls on the TV itself worked. Even turning the TV off and on did nothing to allow any controls to work.Come to find out, the mute button the remote had evidently been depressed just slightly, not enough to actually mute the sound but somehow this paralyzed all of the TV's controls. Depressing the remote's mute button fully took care of the problem and all worked normally again.Our son has a Vizio that he's been using for 5 years with no problems. Here's hoping this one lasts as long and as trouble-free.I uploaded a couple pix from a TV movie. These aren't perfectly clear because there is movement at the time I snapped them but at least you get the idea of how the color looks and the size in our bedroom, if such is of interest to you.", "Date": "September 4, 2011"}, {"Title": "Very Fine Television for Less Than Newer Models", "Author": "Joshua T", "ReviewID": "R3B2PS06RKN8AE", "Overall": "5.0", "Content": "I bought this refurbished on Amazon from ugochuik (highly recommended) at a bargain price, and am tickled at what I got for the money. Looks and plays like new, although I had to adjust the voice synchronization and the skin tone selection. The picture is incredibly sharp, with no more blur than I have seen on any television less than 240 hz (and that sure is not worth an extra thousand dollars). The 100,000 to 1 contrast seems to help, and 6.5 ms refresh, while not great, is better than most. Since I sit close to the set, and am sensitive to blur, I have set the picture style to \"movie\" and turned the brightness down to 53; very comfortable for day-to-day viewing.I might add that, for me, 37 inches is the sweet spot on size; I do not feel like I am looking at a small screen, but rather at a human scale picture on interview shows. Just large enough to lose myself in scenery shots, too.I am using it with a set of old rabbit ears, and live a short distance from the transmitting towers, so the picture is quite satisfactory, although I cannot seem to pull in Fox. Also using a new Roku, getting Netflix streaming movies.Regarding the sound, it sure doesn't have any bass. If you can live with that (after turning off the tru-volume), you can go into sound adjustments, choose \"classical\" or \"jazz\" profile, and lower the three mid-range setting to the same low setting (around -1). Pretty tolerable until you spring for an upgrade to the sound, and it sounds better than most new sets, which value thinness above all.I really do not watch much television, so I cannot justify this purchase on a rational basis. I confess that I am having fun watching it.", "Date": "March 30, 2011"}, {"Title": "Excellent value in 4Q2010", "Author": "Konrad Roeder", "ReviewID": "R1KCTEHMW41UKM", "Overall": "4.0", "Content": "I bought a Vizio E370VL 37\" LCD HDTV on a black Saturday sale and I'm very pleased.  Why a 37 inch? - I bought it to fit a recessed area above our fireplace that's 38 in. wide.  Comparing it against other, similar sized models, I looked closely at the overall picture quality (the resolution (1080p) and the refresh rate (60Hz) ... and price.  I was impressed.  The plastic fit of the parts is impeccable.  I have basic cable, so the TV takes a coax connection from the cable provider directly.  For some stations I see both the old analog service which only fills the screen part way and the digital service right next to it.  The TV has only two HDMI inputs.  I use one to hook up to our PS-3 and the other to a Blockbuster set-top box.  Quite candidly, I can see that the TV may require more HDMI inputs in the future to accommodate other sources such as a cable tuner, a digital TV camera or DVR ... etc.  By hooking up a 10 foot E-VGA cable from my laptop to the VGA input on the TV, I can do computer work very well with it at 8-10 ft sitting distance.I matched-up the TV with a Boston Acoustics sound bar with a wireless subwoofer (TVeeM20B) to give it surround sound without the wire mess.  The TV and soundbar work very well with our PS-3 for gaming and Blueray movie watching.Overall, I think this TV is an excellent value in 4Q2010.", "Date": "December 16, 2010"}, {"Title": "disappointed", "Author": "A. donato", "ReviewID": "RJA7IG3OY5RGB", "Overall": "2.0", "Content": "I really wanted to like this tv.  It has an incredible picture and is priced right.  Unfortunately there is always a low hum through the speakers that is noticeable at low volume.  I called Vizio twice and they were no help - blamed the cable provider (I have a Panasonic HDTV with no problems).  Google \"Vizio and hum\" and you'll see I'm not the only one.  Rather than exchange it, I'm returning it and getting another brand.One other very annoying thing.  Vizio's logo stays lighted at the bottom of the screen when the TV is on.  Can be distracting***Update***I replaced the Vizio with a 40\" Toshiba and I have no humming or buzzing sounds with the it. While the Toshiba also has a lighted logo but at least there is an option to turn it off.  No cheesy logo splash screen you first turn on the tv either.", "Date": "February 5, 2011"}, {"Title": "Good LCD for the money", "Author": "Schinde \"Schinde\"", "ReviewID": "RB2R0LRKYALS6", "Overall": "4.0", "Content": "I wanted a medium size LCD HD TV for wall mounting in my bedroom, but didn't want to spend a lot of money.  I found a great deal here on Amazon, and the reviews were good for this Vizio.  The TV doesn't have the most up to date styling, but it looks good on the wall.  The picture is VERY good using the HDMI connection to my Comcast box.  I am spoiled by my 55\" Samsung LED in the living room, but this TV has a very good picture none the less.  Yes, the sound is lacking, as in all thin flatpanels, but a Vizio sound bar I mounted underneath more than makes up for it.  Just remember to turn off the True-Surround and Volume Levelling, and set the external audio to variable in the TV Audio Menu.  This way, you can set the sound bar to medium one time, and adjust the volume from there with the TV remote.  37\" seams just right at the end of the room from my queen size bed.  I recommend this TV for a bedroom or any small sitting room.", "Date": "May 10, 2011"}, {"Title": "Fantastic Television. Definitely worth the Money.", "Author": "Thomas", "ReviewID": "R3FGX7A1F60I5U", "Overall": "4.0", "Content": "Let my say that I did not purchase my television on Amazon, but from eBay, as a refurb. But I must say that upon first glance, I was amazed. This TV has a matte finish screen that does not become distorted in the light( I have a window facing directly at the TV. Overall the TV is absolutely wonderful, but I do have two minor cons ( which are below). And I do have Xfinity HD, so that really contributes to wonderful overall picture quality while watching TV.PROS:Picture quality is amazing, I tweaked the settings just a little and was able to get deep blacks and very nice skin tones(Not pale and not yellow).Sound- Actually not bad at all. I know some people are saying that you need external speakers to hear anything loudly, but that is not the case. This TV has loud sound, which would be ample for any bedroom or living room. ( But obviously, with any Big screen, a home theater system would make everything better)Frame- Very nice glossy black, I saw the TV at Wal-Mart before I purchased it and let me tell you it looks so much better than what I saw at the store. You wont have any problems with appearance. This TV is absolutely stunning to look at.Remote- Remote is perfect. Although I did notice that you have point the remote towards the base of the TV, when looking at it dead on. I dont know if that was a one time thing, BUT I'll UPDATE on that that soon.Menu- Alot of options for picture quality and sound, so nothing to worry about there. You definitely have full control of the TV. Alot of options.CONS:TV Base- The base could be a little more sturdy, I found that if you wiggle the TV from the top, it does move very prominently. But It wont break, unless you really put some strength into it, so No worries about the tv falling, unless something hits it extremely hard.Ports- TV only has two HDMI inputs, which I found to be a little odd, and there are no side inputs. But not many people have more than 2 HDMI inputs, so it wont really bother many people. ANd you could just buy an HDMI extender, if you need to plug in more device.", "Date": "February 9, 2011"}, {"Title": "So far, so good.", "Author": "Fun while it lasts", "ReviewID": "R3CCCTQ8AWO3J7", "Overall": "4.0", "Content": "Bought and set-up my first Vizio TV today.  Set-up was very easy and it accepted my antenna connection with no problems.  Audio and visual are both very good with a good number of options and settings.  The only downside is that there is only one A/V port so I can only connect my PS2.  I wish I could also connect my WII, too.", "Date": "November 27, 2010"}, {"Title": "Extremely happy with this Visio HDTV", "Author": "Robert R. Garcia", "ReviewID": "R33BHZJ74KT3DD", "Overall": "5.0", "Content": "Easy setup. Easy menu, for picture variations and sound: no problems. The picture resolution is superb. This is a great system. The 1080P sharpness is better than I ever expected. And the price is great. Don't forget when you connect it to your cable company, make sure their box is set to 1080p, or you could only get 720p resoluton or less. This is great size for my den; I'm not too far away from the screen. Later I might get a Visio 47 inch (or larger) screen for my living room. I also hooked up my roof antenna to this HDTV and the resolution is great. Colors are great.For you picky movie buffs, I purchased, later, a Visio sound bar to go with this. This HDTV has adequate speakers; however when I play a blu-ray or DVD movie I like all the little detail sounds too. That's when I'll turn on the Visio sound bar. I bought that for 80 bucks at Costco. Most of you won't need the sound bar, either because you have a surround sound system or don't need to be blasted.", "Date": "September 5, 2010"}, {"Title": "Super sharp tv", "Author": "Allen", "ReviewID": "R3EC44E9O9FZ0K", "Overall": "5.0", "Content": "I bought this TV for watching standard definition TV and playing my PS3 in HD. That changed as soon as I had this TV because once I seen what it could do in HD I changed my cable service to HD on the spot! It is very sharp, easy to use and is very attractive with its shiny finish; all in all, its a great TV for the money spent and 37 inches is prefect for a small living room or even your personal room. 5/5 stars for sure.", "Date": "August 21, 2011"}, {"Title": "Good Sound No remote Problems", "Author": "Tvengineer", "ReviewID": "R2J6B2U0GMUUN7", "Overall": "4.0", "Content": "I have had this TV for about a month now.. and I can find very little that I don't like about it.When I was researching it I read the reviews on this site as well as others...The two common complaints were the sound and that you had to aim the remote directly at it.I am writing this review to say that I do not find either of those problems with my set.I have some hearing loss and was very concerned that a new LCD TV would be a problem for me without external speakers.  One of the reasons I chose this VISIO was because the speaker grills actually face forward..  I find that I can hear this set just fine with just the internal speakers with plenty of volume to spare.As for the remote... I can control the TV with the remote without even pointing the remote at the TV at all... so no problem there..If I had to come up with something to complain about it would be the lack of a dedicated button on the remote to change aspect ratio... it takes four button presses to go from normal to zoom.. or back again..  I minor gripe I will admit..", "Date": "February 23, 2011"}, {"Title": "BEST BUY", "Author": "William W. Webb", "ReviewID": "R304Q7EHQB3NXU", "Overall": "5.0", "Content": "Absolutely a BEST BUY for the money, excellent picture quality, excellent price and coupled with a Vizio sound bar system provides theater like sound.", "Date": "February 14, 2011"}, {"Title": "Everything is OK", "Author": "Neil", "ReviewID": "RQB8XZK2OWQTQ", "Overall": "5.0", "Content": "The price was right, the item was as specified, and it was actually delivered about ten days prior to the estimated delivery date.  A very pleasant shopping experience.", "Date": "February 11, 2011"}, {"Title": "Great under $500 TV.", "Author": "Phillip A. Lowery \"cigarnut81\"", "ReviewID": "R2ROCT0RAFP1IF", "Overall": "5.0", "Content": "I watched LCD TV's for about two years as I learned more & they advanced. All that time, this tv remained my favorite for less than around $1500. I just couldn't see anything truly worth any more money until that price point. I finally decided to jump in & purchased this one as it always caught my eye in the stores. A month later I am still %100 happy with my purchase. I am in love with this TV. Thank you Vizio for keeping some cash in my pocket:)", "Date": "December 24, 2010"}, {"Title": "nice if would last", "Author": "ibpitty", "ReviewID": "RU4IZIX90UQDK", "Overall": "2.0", "Content": "I'm done with Vizio.  Bought my first E370VL and only lasted 4 days before we had issues.  We would turn it on, it would display Vizio and then shut off.  That one we took back to store and had it replaced.  Sad to say, 25 months later, the same thing has happened to second Vizio.  Sounds like it's going to cost $300 to get fixed.  I'm done with Vizios.", "Date": "July 24, 2012"}, {"Title": "great tv, great price", "Author": "Matthew J. Paul", "ReviewID": "RWSUJTZG4SYEY", "Overall": "5.0", "Content": "I didn't want a tv with all the apps and 3d stuff that's available now. I just wanted a good tv with a nice picture. This tv has delivered. It is hard to beat Vizio's price. People complain because they didn't get the top of the line tv but they also didn't want to pay for the best out there. This tv was worth every penny and then some. I'd get it/or another Vizio again. My 360 works great on it. I added a vizio soundbar to it and everything has been working great.", "Date": "May 11, 2012"}, {"Title": "Bang For The Buck!", "Author": "steve miller", "ReviewID": "R33AUOMGRGYHX5", "Overall": "4.0", "Content": "I bought this television for my mom, for Christmas. The television is amazing. The only thing i don't like is the remote control, but you can always just buy a better remote control at walmart for like 20 dollars. Even the built-in speakers are fantastic. Don't expect the sound quality to be some ultra high end surround sound system. But if you live in a small apartment, the sound is amazing.", "Date": "January 22, 2012"}, {"Title": "Great TV For the Price", "Author": "GTIM2L8", "ReviewID": "RHSBTIIARDS3Y", "Overall": "5.0", "Content": "I got a great deal on this one as a refurbished unit.I plugged it in and it has been playing for several years now with no problems.", "Date": "November 16, 2013"}, {"Title": "Vizio", "Author": "charityk", "ReviewID": "R15ISNA2R721KG", "Overall": "5.0", "Content": "The tv is great, comes in great and works great But the only thing I do not like about it is the sound is not the best. If you are heard of hearing this is one tv you should Pass on. Sorry but its the truth", "Date": "June 5, 2013"}, {"Title": "So Far, So Good! - Tiger D. (Refurb)", "Author": "Ken", "ReviewID": "R37IFCO5RH1WO2", "Overall": "4.0", "Content": "Like NEW 37\" Vizio, has a great Picture,The Menu is sleek looking, A Left side Pop Out grid of large easily view-able Icons to navigate is nice.The USB Media player is nice but, It only recognized My photos, (I expected Music too.)The built in EQ is Nice.The Remote is functional & Sleek enough but, it feels a little Light (cheap)4 Picture Aspect (Size) Modes, (Wide, Zoom, Normal, Stretch) enough & functional.Everything I expected, & a great price too...", "Date": "January 24, 2013"}, {"Title": "Sweet TV", "Author": "Jason", "ReviewID": "R8BHO9OYHK8QT", "Overall": "5.0", "Content": "great like new TV for the price. Awsome picture quality, and fast shipping. will buy from here again when I get another TV.", "Date": "April 30, 2012"}, {"Title": "Not as nice as the Vizio E370VA LCD HDTV", "Author": "south texans", "ReviewID": "R4ZVB47TMB57T", "Overall": "4.0", "Content": "We were slightly disappointed with this set after having purchased the E370VA earlier in the fall.  It is not quite as easy to set up as the E370VA.", "Date": "December 30, 2011"}, {"Title": "Base is unstable", "Author": "TOPJOB7 \"topjob7\"", "ReviewID": "R36MW8VK1FYK6Y", "Overall": "1.0", "Content": "I really like the picture on this, but beware of the base design.  It isn't very stable and tips over with a small bump.  If you wall mount it this won't be an issue, but if you use the base be careful because the screen breaks easily.  Tried a couple of them and both had this issue.  If you put it somewhere it won't get bumped at all it works but not if it might get jostled at all.  Recommend you check one out in store before buying.  They should NOT sell this without a better base, especially with such a fragile glass screen.Update 2/17/2011:Regarding their propensity to tip over, Vizio now has this in many of their new manuals:* Use only with the cart, stand, tripod, bracket, or table specified by manufacturer or sold with yourHDTV. When a cart is used, use caution when moving the cart/HDTV combination to avoid injuryfrom tip-over. Do not place your HDTV on an unstable cart, stand, or table. If your HDTV falls, itcan injure a person and cause serious damage to your HDTV.", "Date": "November 25, 2010"}, {"Title": "Great picture but lousy sound", "Author": "Seabrooker", "ReviewID": "R200ENB39KAJVN", "Overall": "1.0", "Content": "I've had one of the Vizio E370VL's for 2 weeks now, and the sound \"system\" drives me crazy! It has a feature called \"SRS TrueVolume\", which is supposed to manage volume fluctuations between channels and commercials. It does not! One network is loud, one is quiet. Some programs are quiet with loud commercials, some are the other way around. I can only assume I have a defective unit, but Vizio Tech Support are no help.", "Date": "August 17, 2010"}, {"Title": "Very nice TV", "Author": "T. Jensen", "ReviewID": "R25M91AOYOZ0QV", "Overall": "4.0", "Content": "I purchased this TV yesterday at Walmart and I'm very happy with it so far. I'd give it 5 starts but a) the first one I bought was dead on arrival and b) It only has 2 HDMI ports which is odd because the lower model has 4. Major upside, it's not an 80lb CRT TV. This thing ways about 25 lbs.", "Date": "June 27, 2010"}, {"Title": "Great value!", "Author": "austin", "ReviewID": "RQL5KOCCU31E1", "Overall": "5.0", "Content": "I bought this tv about 3 months ago, and for the price, the quality of this tv is amazing! Highly recomend this tv. Buy it off Walmart, its a lot cheaper", "Date": "November 25, 2010"}, {"Title": "Don't buy", "Author": "Jason M", "ReviewID": "R307O3BLPLX8EA", "Overall": "1.0", "Content": "The tv worked fine for three weeks then it decides not to turn on. When you press the power button the Vizio logo comes on for a few seconds, and the unit shuts itself off. I've tried all the things customer service said and nothing. I certainly won't be suckered into buying another Vizio product again.", "Date": "July 6, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "op of the line features such as full 1080p high definition resolution\nRefresh Rate: 60Hz", "Name": "Vizio E370VL 37 LCD 1080P", "ImgURL": "http://ecx.images-amazon.com/images/I/41c9%2BFG8O2L._SX300_.jpg", "ProductID": "B003TYH7S2"}}