{"Reviews": [{"Title": "Viera, Viera nice TV!", "Author": "nagappa", "ReviewID": "R1V3SJH6IHP6Y", "Overall": "5.0", "Content": "My wife and I were really planning on buying a 42\" 1080p Samsung \"LED TV\" (i.e., an LED backlit LCD TV) when we came across this TV on sale for roughly 60% the price of the Samsung 42\" LED TV. So I spent the best part of an evening researching LED versus Plasma, 1080p versus 720p and also the Samsung brand versus Panasonic. Details of my findings are in the Appendix at the bottom of this review.With the required research behind me, we concluded that we couldn't go wrong with either choice. The Panasonic won because not only would it would save us a bundle, but we would also get a 46\" TV instead of a 42\", which would be perfect for our living room HD cable setup. We decided, therefore, to postpone our purchase of a 42\" 1080p LED TV for our bedroom to the near future when the prices for LED TVs would drop even further.Although the C2 series is the most basic of Panasonic's 720P Plasma lineup, the build quality is very nice and refined. It took less than 30 minutes to set up the TV and connect it to our HD cable box and digital receiver.The only initial calibration we made was to set the picture mode to \"Cinema\". Quite honestly, we were stunned at the quality picture when we first tuned to a HD channel - which was an English detective drama on PBS. The color reproduction, clarity, and fine details were way above our expectations, easily on par with the best LED TVs we saw in the showroom . With its 2,000,000:1 dynamic contrast ratio, this TV is able to produce an awesome level of gradual black levels, with no dithering artifacts to speak of.This TV has a moving picture resolution of 720p. We watched the Hawaii Five-O remake premiere with disbelief. With its 600Hz refresh rate, there were very smooth image transitions in the action sequences, making for a very film like experience with none of the \"digititis\" with fast moving images that I was used to seeing on some LCD TVs.Being the most basic in the current Panasonic Plasma lineup, this TV has a basic set of features - which is actually a good thing because the menu system uncomplicated and intuitive. Some of the menu features can be accessed through dedicated buttons on the remote. For example there is a button to toggle between aspect ratios - which is handy when you need to watch old non-anamorphic DVDs.This TV also has \"anti-image retention\" features to prevent logos from being seared onto the surface of the Plasma display. For the first 100 hours or so, it is a good idea to watch 4:3 aspect ratio programs in \"zoom\" mode, to prevent retention of the black bars on the side, and to switch channels frequently to prevent \"logo burn\" from particular channels. Once the TV has crossed the \"break in\" period, you can resume normal watching.I have not tried Blu-Ray yet on this TV, but it does a pretty decent of upscaling DVD movies from 480p to 720p through component video, though not perfect. But playing DVDs through upscaling DVD players, like the Panasonic DMR-EZ48VP-K 1080p Upconverting VHS DVD Recorder with Built In Tuner, through HDMI is another story. From a normal viewing distance of 8 to 10 feet, DVD movies look almost like HD. I watched the DVD of the movie Downfall and it was hard to convince me that I was not watching full HD.The sound quality on this TV is pretty good and more than adequate for most program content.As for hum, it's present only when I stick my head right next to the back panel where a very low volume buzz can be heard. But from more than a few feet away this TV produces no audible hum!Cons:-----I can think only of a couple of downsides to this TV. The first is that the C2 model has no anti-reflective coating like the higher models in Panasonic's Plasma lineup. But, to be quite honest, the reflections were not noticeable or bothersome until we turned on some bright lights in the side in the direct line of reflection. Having said that, the front plate glass in all Plasmas are reflective and it is therefore best to set them up in an environment where you have control over light sources.The second issue is that this TV has only a single digital optical audio output, which limits you to using a digital receiver for external sound.Conclusion:-----------This TV represents the best bang for buck for any TV out there. Although this is an entry-level Panasonic plasma, Panasonic has not skimped on build quality and the thing that absolutely matters most - picture quality! This TV packs the latest display technology of Panasonic, at a fraction of the price you would have paid just a couple of years ago. Sure, it does not have ethernet or in-built streaming video. But if your really want streaming Netflix or iTunes movies, why not spend just an additional $99 and buy an Apple TV - MC572LL/A NEWEST MODEL?This TV is definitely in the \"best buy\" category and I have no hesitation in giving it a rating of five stars. Thank you, Panasonic!Appendix:---------LED versus Plasma:Both LED and Plasma TV's have excellent picture quality, colors and black levels as well a rated lifespan of 50,000 to 100,000 hours. LED TVs are thinner, lighter, \"greener\" in power consumption, have less reflective screen surfaces, can be viewed in bright daylight conditions and do not require a \"break in\" period for the first 100 hours of use. Plasma TVs, on the other hand, have excellent color accuracy and refresh rates that are hard to match, and they support wide viewing angles. Plasma TVs now come with 600Hz refresh rates, while most LED TVs still are in the 120Hz level. That, in itself is worth the price of admission for videophiles and video enthusiasts, given that the higher refresh rates have the effect of making the viewing experience pleasing, more film-like and easier on the eyes.1080p versus 720p:1080p versus 720p is not much of an issue if most of your viewing is HD broadcast, satellite or cable, which is pretty much 720p for the most part. But if you are serious about Blu-Ray, then 1080p is preferable since the difference becomes noticeable for larger TVs and at close viewing distances. But in most situations it is hard for people to tell the difference between the two formats even with a 46\" panel.Samsung's reputation versus Panasonic's:Recent TV ratings from Consumer Reports indicate that Samsung has top ratings in the LED TV technology. But Panasonic Vieras still occupy the top spot in Plasma! (Samsung Plasma TVs are reputed to have an annoying audible hum or buzz from the rear of the panel, which the Panasonic Plasmas do not have).Update: 02 October 2010:I made changes to the white balance for the Cinema/Warm picture mode using settings described in AVS Forum, based on reference settings from member \"D-Nice\". The picture now is really natural and awesome. I had to get into the Service Menu for this. Please see the link in the Comments section of this review for more details.", "Date": "September 22, 2010"}, {"Title": "Panasonic Plasma's Pimp Hand Is Strong", "Author": "Cass G", "ReviewID": "R3LFRCWEQIIHQA", "Overall": "5.0", "Content": "I'm not an expert, but I am an enthusiast, who loves watching tv and movies, and I continue to be blown away by Panasonic, this is my 3rd Panasonic hd set and I love it,  for the price points of Panasonic plasmas, versus the competition, there is just no contest. I can see a lot of improvements on this set compared to my 5 year old 37inch plasma, the blacks are extremely dark and colors  true and bright, and color adjusting is more sensitive, the set is very intuitive to its source and self adjusts format for each channel, 3:2 pull down adjusts to 24fps sources, pixel orbiter to prevent image retention, the just setting is improved for a more true less stretched picture, picture is very smooth and fluid,no dead pixels, no ghosting,fast action is great with the 600hz refresh rate, the tuner is improved for more free hd channels, the sound also improved with 2 10 watt speakers. I do have some nit picks though, the surface of the screen being large picks up alot of reflection from any light source and it is difficult to watch with out the windows covered and lights off, the remote is not universal, and I'm not a great fan of vera link because all of my components are not Panasonic, this set also has a CATS feature that adjusts the set to the lighting conditions of the room, while I appreciate the thought, this feature hinders viewing and you will want to set it to off on all your picture modes for optimal viewing,  no vga, only 2 hdmi ports, speakers, although sound is good, are on the bottom of the set facing down in to the table. I can live with all of this though, it's a high quality BIG plasma set with an outstanding picture I will enjoy for years to come that I got for an incredibly low price.", "Date": "May 5, 2010"}, {"Title": "Best Plasma for the price", "Author": "D. Pearl", "ReviewID": "RP5Y6M2PKVMNM", "Overall": "5.0", "Content": "First off, don't get sucked into the difference between 1080P and 720P.  The difference is so negligible, you have to be right next to the set to be able to see it.  Even then, most cable boxes don't even broadcast at 1080P anyway so you only get 720P on most 1080P sets.I was in the market for a plasma over LCD for a couple big reasons: First, the price is better.  Second, the picture quality on a plasma is significantly better, especially when viewing from an angle.  Plus, it's less strain on the eyes.  You have deeper blacks, crisper images, better sound quality (in general with plasmas compared to LCD's).  Now on to this particular set.  I've had it for about a month, and after a few minor adjustments, I honestly think this TV is better quality than my sister's Samsung LCD 1080P TV.  Be sure to turn the CATS feature off (in the default mode it's on).  This is a feature that adjusts the screen to the ambient light in the room.  While it sounds good, the screen is simply too dim with CATS on.  2nd, the contrast looks best at 58 (over the default mode of 50).The sound is good also after a few minor tweaks.  Over all, for $499, there is no better deal for a plasma TV in the market.  Plus, it's a Panasonic, the leader in plasma TV's, and probably among the best brand TV's in general over the past twenty years.  If you are looking to spend around $500, I'd strongly recommend the Panasonic TC-P46C2!", "Date": "September 14, 2010"}, {"Title": "Great TV for a great price", "Author": "John D. West \"Heywoodwest\"", "ReviewID": "R3VQQ2ZK6RE2ZU", "Overall": "5.0", "Content": "I am not what you would call an early adopter of new technology, I wait for the market to settle down and for the bugs to be worked out of the products. So this is my first big TV and I love it. No more squinting across the room trying to make out what the DVD menu says and the quality even from a DVD player is so much better than what I've had before. I can't wait to get it set up for Blu-Ray, guess I'd better get the old wallet out again.I was sceptical about buying a 720p rather than a 1080p resolution TV, but after reading some reviews and comments on the two technologies, I went into a couple of stores and found unless my nose was nearly on the glass, I couldn't tell the difference.Only downside is that the price of this TV has come down slightly from what I paid a couple of weeks ago! If, like me, you've held off buying a big TV - wait no longer.", "Date": "August 19, 2010"}, {"Title": "Awesome TV", "Author": "Zip1980", "ReviewID": "R14EL9O0JKOW35", "Overall": "5.0", "Content": "After using a 42\" 1080p Samsung LCD television ($2000 when I bought it) for the past couple of years, I was prepared to get what I payed for in this 720p 46\" Plasma ($499).  After hooking it up and tweaking the settings I have to say - WOW. This 720p plasma looks just as good as the 1080p LCD and even better during fast motion scenes.  I did have to buy an optical audio to RCA converter box ($40) to get surround to my theater system, but I knew that I would have to when I bought it.  Don't fret to much about whether to buy this or not - I was worth every penny.", "Date": "December 2, 2010"}, {"Title": "Great TV at a Great Price", "Author": "MARC REGAN", "ReviewID": "R1S3H3UO0KBL1M", "Overall": "5.0", "Content": "We're really happy with this TV.  Great value.  I agonized over whether to get the U2 or S2 models over this entry level C2 model.  The picture is fantastic and it looks great on our living room.  The built in sound is pretty bad but I think that's to be expected.  Good input options, menus are fairly coherent, and remote isn't as bad as other TVs.One hint - if you check this out in a bright showroom, it looks really awful compared to the LCD TVs. You have to view it in a dimly lit room to get a real feel for how it looks.  In general, the LCDs looked much better in the bright showroom, but in the showroom's fake living room the plasmas dominated.", "Date": "November 20, 2010"}, {"Title": "Awesome TV, awesome price", "Author": "Tom Hanks", "ReviewID": "RMORXSOIBHEVV", "Overall": "5.0", "Content": "I'm 25 and have been using my 27\" tube TV I got for Christmas when I was 16. I finally caved and decided it was time for an upgrade. The whole plasma vs LCD stuff made the decision to buy a HDTV that much more intimidating. Then there's the 720p vs 1080p. Oh yeah, and now there's LED and 3D HDTVs. However, after doing a lot of research, a few things became clear...ON PLASMA VS LCD:Prices on plasmas are MUCH better than LCDs. I want a big TV. I'd rather have a 46\" plasma than a 40\" LCD.Drawbacks on plasmas don't seem that bad. I don't have windows surrounding my TV so I didn't care about glare. Everyone is scared of burn-in, but I'm not going to pause a videogame and leave my TV on while I'm at work.ON BRANDS:If you buy plasma, Panasonic is the only way to go.ON 720 VS 1080p:Unless you have very high standards for picture quality and money isn't an issue, a good 720p is awesome. At hh gregg, they had this 46\" Panasonic right next to the 1080p version. I'll admit, the colors were more brilliant and the picture was slightly better on the 1080p. The 720p was $499 and the 1080p was $905. Nearly double the price for brighter colors? No thank you.When I'm at home, I don't have a 1080p right next to this TV to remind me how my colors aren't quite 1080p. Great way to sell the more expensive model in the store, but only a TV salesman could blindly walk into my place and know my TV is 720p. And considering how I was used to a 27\" JVC tube, this is an upgrade in every way.BOTTOM LINE:For the price and quality, this is it. I am in love with this TV and I don't even have anything HD plugged into it yet. Standard cable and component DVD cables alone, this plasma beats the hell out of my old tube.Price conscious buyers should look no further. When you go into a BB or Sears or hh gregg, it's easy to spend more than you originally planned. The 720p is next to the 1080p which is next to the LCD which is nearby the LED right beside the 3D TV playing Avatar. It's a slippery slope, indeed. You want a big TV? You want a TV that is of high quality that is worlds better than a standard TV? Buy this.", "Date": "January 30, 2011"}, {"Title": "nice picture, lousy delivery service", "Author": "Corolla Queen", "ReviewID": "R1BTA8SPHLU0VH", "Overall": "5.0", "Content": "Nice TV, gorgeous picture.  Not a top of the line plasma, but a big upgrade at a decent price if you haven't had plasma before.  When setting it up, make sure to upgrade the picture settings from \"normal\" to get the intense colors you see in stores.  I like the TV and the sound seems fine but I was completely unimpressed with the white glove delivery service and am glad I was not charged extra for it.  The delivery guys were in a hurry and wanted to just carry the box into the house and leave.  When my husband pointed out that they were supposed to be providing a higher level of service, they reluctantly took the TV out of the box and plugged it in but had to be talked into lifting it off the floor and onto a table -- they refused to lift it onto the mantle and did no setup apart from turning it on.", "Date": "October 4, 2010"}, {"Title": "Nice TV but dissapointing sound", "Author": "Shekhar E. Walter \"walter\"", "ReviewID": "R2QHJW3YF4SE27", "Overall": "4.0", "Content": "This TV is easily the best value for your money right now if you are in the market for a 46\"plasma. The picture quality is great. The only downside for me is the sound quality.Even at max volume it is not sufficient for enjoying a movie. Also, the sound is thin. So be prepared to shell out some extra bucks if you do not already have speaker systems/HT to supplement the sound. But overall great picture quality, colour and easy remote menu options.", "Date": "December 11, 2010"}, {"Title": "nice tv", "Author": "loudv8", "ReviewID": "RD4HCRQDZLA9C", "Overall": "5.0", "Content": "I'm cheap and had a budget of $500 when shopping for a flat screen. My thought was to replace my 43\" Hitachi HD widescreen rear projection when it died but it will not die and continues with good HD picture quality. I ended up moving it to another room.Got the Panasonic on sale for $499, the store had 2 left. Could not pass up the deal after researching this one. Like the other reviewers, don't get sidelined on 720 vs 1080. The store had a 1080 and a 720 side by side the difference is negligible.Set up for the big Panasonic was a breeze and the picture is awesome. No complaints at all, would highly recommend it. The SD card slot is a nice feature. Go buy this one.", "Date": "November 28, 2010"}, {"Title": "Great Tv at an Excellent Price", "Author": "Keith W. Kuby", "ReviewID": "REVP7O4UGGAL5", "Overall": "4.0", "Content": "Very pleased with a great picture and very good sound out of the standard speakers.  This is an excellent value considering the picture, size, and price!", "Date": "November 18, 2010"}, {"Title": "Great picture but average sound.", "Author": "R. Nelson", "ReviewID": "RCDQF0EA2YAFS", "Overall": "5.0", "Content": "I have owned this TV for a year. It has a great picture and I have no screen reflection problems. Sound quality is not as good as a Panasonic Plasma TH-42PX600U that I had in this location before moving it. Some of the sound issue is probably due to the downward facing speakers and less power than the 42\" TV. I own three plasma TV's(two Panasonic and one Pioneer) and have had minimal reflection or image retention problems. These issues are completely overblown in forums as LCD sales people like to sell their higher priced TV's.", "Date": "April 21, 2011"}, {"Title": "A good TV for the money @ $550", "Author": "dl0154", "ReviewID": "R14GR2SK95NIDR", "Overall": "4.0", "Content": "I am no expert on HDTV but am satisfied with this TV for the money I paid for it. The picture is good and it has ample connections as far as I am concerned. It is a good looking TV to look at and has enough options and adjustments to meet all my wants.The major problem I have with it is if you are going to use an OTA antenna as I do it will not allow you to store stations manually or previously auto programed stations you have ran so every time you change directons on your antenna to pick up a station in a different direction you will need to go through auto program again. And unless the station is in the last auto program you can not manually select a channel by inputting the channel manually. Example, I auto program and pick up channels 6.1, 6.2, 7.1, 7.2 exc. I then change antenna direction to pick up channel 15.1, I can not manually put in 15.1 for the channel and pick it up but have to go through auto program again to get that station and then all my previously stored stations are wiped out and have to go through the same thing again when wanting to pick up channel 6.1, 6.2 exc. So if you are going to use an OTA antenna as your channel receiver I would most likely choose another TV if it is not too much of price difference that you can live with. I can live with this problem because I don't want to go through the hassle of returning it and looking into another one. If you are on cable or satellite you should have no complaints. I wish some one would have written about this issue before I bought it so I would have choosen another TV. I did contact customer support at Panasonic and they confirmed that the problem I have with this TV is the way it is made so there is no fix. Hope this helps future buyers!", "Date": "February 2, 2011"}, {"Title": "Plasma TV", "Author": "Arleen Wilson", "ReviewID": "R38PMRHZH47GJ1", "Overall": "5.0", "Content": "Purchased this Panasonic 46 inch TV from Amazon. They contacted us promply, set up an appointment to deliver and it was delivered within a week.  Very happy with TV as well as with Amazon.", "Date": "December 27, 2010"}, {"Title": "so far so good.", "Author": "mintreview", "ReviewID": "R3B4HCQD1DCA72", "Overall": "4.0", "Content": "I have had this TV for a few weeks so far. So far so good. It looks good with HD. I also played XBOX on it, and looks great. I was worried with plasma since I have LCD For my other TV, but soo far its great. It shipped in a few easy to open box which was great.It does seem heavier then I was expecting, but I will be mounting it soon, but I assume it will be fine.", "Date": "November 26, 2010"}, {"Title": "Great TV", "Author": "Warren Claassen", "ReviewID": "R1ZS34SLVKR4TO", "Overall": "5.0", "Content": "After two years I have not had any problem with this tv.  Love the multiple connections that allow so many different input signals.", "Date": "December 23, 2012"}, {"Title": "great buy for price", "Author": "sigma chi", "ReviewID": "R10XOWGT40P6J4", "Overall": "5.0", "Content": "I bought this right after black friday in 2010 at walmart for $499, i still have it up and running and its perfect for me.  I watch alot of sports, movies and play video games on it and it looks awesome.  The only thing I think its missing is more hdmi ports (has 2) and maybe a picture in picture feature, other than that its perfect for the price i got it at and i was upgrading from a Vizio 32\"", "Date": "May 5, 2012"}, {"Title": "Decent...", "Author": "Marlin McElwain \"Marlin\"", "ReviewID": "R1SA8RSDQUSUCB", "Overall": "3.0", "Content": "i shouldn't complain much - i got this on clearance for only 269 from target...but i was replacing a Panasonic TH-42PX600U which was the best series of early plasmas so my standards are high.  this is a decent tv and seems comparable in many ways except two.  1. i agree with another review that says colors are somewhat cloudy or creamy looking 2. it seems to pixelate slightly when changing from major scene to scene (such as commercial to commercial).  it's great within the same scene but seemingly pixelates when the screen goes completely away and then comes back suddenly.it was so inexpensive that i won't return it but i am somewhat disappointed with panasonic because in the old days, they could do no wrong with plasma tv's.  i would appreciate anyone replying to this review with what they think might be the best settings for this particular model -- because i have learned that each model seemingly requires different settings to coax the best high def picture.here's the panasonic product link if you need a manual or something:[...]", "Date": "November 30, 2011"}, {"Title": "5 Months and Failure", "Author": "LV", "ReviewID": "R3PA9KSYVIPYGD", "Overall": "1.0", "Content": "Urge prospective buyers to search 7 blinking light error code. That's what we got after 5 months of use. Week # 3 and still in repair shop.", "Date": "March 4, 2011"}, {"Title": "Great TV for the price", "Author": "An opinionated Jazz Fan", "ReviewID": "R3FSUD7055G43O", "Overall": "5.0", "Content": "So, we ended up needing a new TV in a hurry, and didn't have a bunch of money to spend.  After checking out a bunch of various models, we ended up deciding that the Panasonics had, by far, the best bang for the buck, especially for 720p models.  We were all but set on the 42\" model, but the 46\" was only $25 more at the place we went to, making it a total no brainer.  A month in, we couldn't be more satisfied.  Really a great TV.  My only complaint is that there's no USB port, meaning that in order to hook my PC up to it, I've got to drop $79 on a USB to HDMI converter.  Oh well.", "Date": "March 2, 2011"}, {"Title": "Great deal on a great TV!", "Author": "ArtyG \"ArtyG\"", "ReviewID": "R2FT2LHPFART6J", "Overall": "5.0", "Content": "I found myself in Best Buy on Christmas eve at 2PM hoping to score a $500 Dynex 46\" LCD 1080P. Alas they were all gone; but as I turned to leave I saw this beautiful Panasonic Plasma for only $549. What a deal. I have long been a fan of all things Matsushita starting with the Vivitar 283 back in the '73. So I took the plunge and brought one home with zero on line research which is very unlike me. This TV is everything you could hope for in picture, and adequate in sound as well. It gives a sharp, contrasty picture with some adjustment. Great for movies with an up-converting DVD player via HDMI and the quality from an HD signal over the air or via cable is breathtaking! Even the Letterman show has an \"in the room\" look to it. It's not any funnier but it looks great.The remote is good but I am not going out to buy Panasonic peripherals just to access  the Viera functions. You can populate the \"Favorite Channel list with up to 30 presets which I highly recommend for your first job after you let the tuner set itself up.Yes, plasma TV's do reflect more than LCD TV's but for that you get a better, sharper picture that is analogous to the difference between an 8X10 glossy photo and an 8X10 matte finish. The glossy, as you know may show fingerprints and reflections but it's also much sharper with deep colors and blacker blacks.I do wish it had a couple more HDMI ports, my ROKU and DVD player fills both of them, but should I need more I can buy an HDMI expander for very little money.", "Date": "January 24, 2011"}, {"Title": "Best Bang for the Buck", "Author": "Robert \"Living in Paradise\"", "ReviewID": "R1OK4KQLCL45KD", "Overall": "5.0", "Content": "Assembly of the panel and included stand was easy.  It took longer to unbox and carry into the house, than it took to assemble.  BTW, while it's possible for one person to put the set together, I'd suggest that it's really a two-person task.Once set up, the picture quality seemed even better than when we saw it in the store.  The set has a \"command presence\" in our living room, that doesn't come across in the showroom.As others have noted, the set handles action scenes with aplomb - no image streaking issues to speak of, and the viewing is great from every seat in the room.Note:  The color rendition is \"okay\", but it is still in the burn-in period and I haven't fine-tuned any of the settings.  I expect that after the set is adjusted, the color performance will be more than satisfactory.The internal speakers were better than I expected - not an audiophile experience, but better than any of the TV sets that I have previously owned.My set is located next to a large picture window in our living room.  With sunlight streaming into the room in the morning, the conditions tend to be quite bright and glarey.  Since a number of reviewers criticized the set for being too dark or complained about reflections off the glass, I was pleasantly surprised that we haven't noticed any such problems.My only complaint is about the remote control unit.  (a) The keys are raised and some are angled, but tactile differences are far more subtle than the remote control units that I've used in the past.  The lack of tactile differentiation between keys makes it difficult to navigate by feel alone.  I find that I frequently have to look down at the keys in order to see which one I want to select - even when I know the keyboard layout by heart.  (b)  That leads to the second problem:  the keys are not backlit nor are they glow-in the dark.  Since I often watch the set while in bed, with the lights out, I would have appreciated a remote control that was easier to manipulate by feel in the dark - or was otherwise visible in the dark.  (c) The remote control is a shade of dark gray.  The color doesn't stand out in the day and is very difficult to see in the dark.  I plan on getting some 1/2\" yellow plastic tape and wrapping it around the perimeter of the remote control so that it doesn't get lost!Bottom line:  My family is very happy with this set and my pocketbook was very happy with the sub-$500 price tag.  It's not perfect, but it's the best bang for the buck.EDIT:  Update June 2012.  After a year and a half of use, I can still say that my family is still very happy with this purchase.  I'm sorry to see that it is no longer carried by Amazon.", "Date": "January 22, 2011"}, {"Title": "awesome tv", "Author": "Rusty", "ReviewID": "R23W3X4VPFDK9I", "Overall": "5.0", "Content": "I've had this tv 1 month and I have to say I love it. It looks just as good to me as my 1080p Panasonic 50\".", "Date": "January 2, 2011"}, {"Title": "Review of Panasonic TV bought from Amazon", "Author": "B. Goodman", "ReviewID": "R2O8Y5PWKB5DB", "Overall": "5.0", "Content": "I had expected an early delivery and got it but was completely surprised to see the gentleman, that made delivery,  open the carton and completely set the TV up for us. All we had to do when he finished was to select the channel that we wanted to watch. We are very satisfied with all aspects of this purchase.", "Date": "January 21, 2011"}, {"Title": "great TV overall at this price", "Author": "james", "ReviewID": "REI9KJP56TN6P", "Overall": "4.0", "Content": "get this one on sale, and it is my first HDTV. Love its shape and color.best one i can get at this price", "Date": "December 27, 2010"}, {"Title": "Bang for the Buck!", "Author": "M. Rhea \"Connor'sMom\"", "ReviewID": "R2X9UIYJRLMCY9", "Overall": "5.0", "Content": "Got this outstanding TV for $494 on Thanksgiving Day 2010...no tax, free shipping. Simply cannot beat that price anywhere for a new 46 inch plasma.  Only negative is glare off the screen...which is common to almost all plasmas. Picture is great, sound is suprisingly good, easy hook-up to components, mounted easily to wall with a universal mount.  Wish I had bought 2!", "Date": "December 27, 2010"}, {"Title": "Best TV You Will Ever Purchase", "Author": "tea", "ReviewID": "R2OFCO3O903APW", "Overall": "5.0", "Content": "The best picture quality you will ever see;  Great price on Amazon;  Shipping on time Arrived in perfect condition; Many Thanks Amazon", "Date": "December 9, 2010"}, {"Title": "It's not as good as other's said.", "Author": "Shiao", "ReviewID": "R15UFGEZ8E33RJ", "Overall": "2.0", "Content": "I read reviews other's put at Amazon's site and good ratings by Consumer Report and felt confident that this is an easy choice. After I received it, I put it next to my 7 year-old LCD and sadly found out that this new plasma was inferior to the older tv. The major flaw was the color; it was powdered, like you were looking thru a cloud, didn't matter how I adjusted the color, brightness, and contrast. After 3 days, I decided to return it. Amazon has very good return policy and I had no hassle returning it at no cost at all.", "Date": "January 12, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "46-inch Plasma HDTV with 720p HD resolution; 720 lines of moving picture resolution\n600Hz Sub-field Drive technology for superb full-HD motion; 2,000,000:1 dynamic contrast ratio\nVIERA Image Viewer for JPEG image slideshows directly from an SD memory card\nInputs: 2 HDMI, 2 component, 2 composite, 1 digital audio output\nIncludes removable stand; measures 44.6 x 30.4 x 14.1 inches with stand", "Name": "Panasonic TC-P46C2 46-Inch 720p Plasma HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51XSk7ShfGL._SY300_.jpg", "ProductID": "B0036VNQ0Q"}}