{"Reviews": [{"Title": "Latest technology from Westinghouse? Not reliable tho!", "Author": "westcoastcop", "ReviewID": "R3UPZCPMC4PDK1", "Overall": "2.0", "Content": "EDIT-9/18/13 3 years later..after owning 2 of these Westinghouse TV's...I'll add that one out of 2 we bought has a serious issue...the right half of the TV Screen LED's died...so the right half of the picture is now dark...viewable but not lit at the original level...and it can't be adjusted. I'll stick to Samsung from now on! So just a 2 star now...should be less but the other one we got for my dughter at christmas is still working great!After researching the purchase of 2 LCD TV's for my kids, I was shopping around and discovered this Westinghouse. I actually didn't think it would be a serious TV, as it was less money that comparable LCD TV's sitting on either side of it on the stores shelf. All were on, and set to the same channel. So comparisons were easy! I was prepared to hate the Westinghouse, thinking is was in the same class as some of the \"no name\" brand sets..junk! After all it was less than $400.00!But when we were getting ready to pick up the boxes of Phillips TV's and put them in the cart to take home, we started reading the box thatthe Westinghouse was in. Did my eyes deceive me? Did it really say LED on it! No way. We walked over the the high end and expensive LCD TV's. and the 32\" ones that said LED were $700.00 plus! Samsungs, Vizio, Panasonics, etc.Not as reliable as it should have been...I would now avoid this brand!", "Date": "July 19, 2010"}, {"Title": "Westinghouse 32\" LED", "Author": "J. Moreno", "ReviewID": "R7254P6NI4RCZ", "Overall": "3.0", "Content": "I first noticed this television at Target when I saw the word LED and realized the the very inexpensive price ($429). The television looked pretty good on display, and was very thin. I decided to check if they had it on Amazon, and yes they did. However, the model number was different and it was much cheaper here. I'm guessing that the Target model (LD-3257DF) was specifically made for them, and on the website it lists that the model adds a QAM tuner. QAM isn't a necessity so I purchased this one.The TV itself is very easy to put together, all you do is screw a few screws in for the base. Next just plug the TV into the wall for power and you're set. If you do use cable television, be sure to plug that in. Put the two batteries in the remote and press the red power button on the remote. One thing, the remote really does suck, it's very ugly and sometimes you do have to press a button twice in order to get it to work. I have no idea if you can set up another remote with it or not. When you first turn on the TV it will bring up a setup guide to search for channels. I had previously connected a coaxial cable to the RF Input, the TV scanned for channels and found the same amount as my older Sony did. However, when I began to skim the channels, they all looked disgusting. Even the HD channels it picked up (720p and 1080i) looks like crap. The Sony displayed these channels brilliantly. It crossed my mind that maybe I set my standards too high because of the Sony, after all, this is only a $350 dollar TV. As another reviewer said, it does take a couple seconds to change channels. Also, channel names will not be displayed as you switch.I hooked up my PS3 to the TV via HDMI, and this is where the TV actually shines. I popped in Uncharted Drake's Fortune, and it actually looks pretty darn good. In the areas where there was sunlight the grass looked kinda iffy, but I was okay with that. In the really dark areas, it was pretty darn hard to see. Now this doesn't mean that the TV has excellent blacks, because it made almost everything black, I could barely see Drake's head. I must mention that there is a Dynamic Contrast setting which should be turned on in order to get blacker blacks, it seemed to help a lot. Playing HD movies through the PS3 looked pretty good too. Again though, the blacks were not very black. Also, you need to look directly at the TV to get the maximum viewing angle, any change in seating will diminish the all the colors to nothing. I do have one major gripe though that made me decide to return the TV, when using the PS3 and switching to a movie, or game, the TV will lose the signal from the PS3. It will say that it is searching, and after a minute, it will give up. Sometimes, this wouldn't happen, and sometimes it will happen, and the image will pick up after a few seconds. When the TV gives up on searching, I found that the only way to fix it would be to turn the TV off and on a couple times. When I popped in the Star Trek (2009) Blu-Ray, it did this in between the trailers. Star Trek looked good, but not great on the TV. I believe that a television viewing experience should be seamless. I am hoping that this was only my TV set, and if not, that Westinghouse should issue an update quickly.About the sound, if you care anything at all about sound, please buy decent speakers to go with it. The TV has no bass, and will squeal if any high pitched noises come from it. There is an optical out which is nice.A quick list of things I like and didn't like:+Thin (1.5 inches maximum)+LED Edge-lit+Exceeds Energy Star 5.0 requirements+Great for console gaming+Very light+Inexpensive-Television channel quality-Not the most vivid colors-Blacks aren't very black-Signal loss-Very limited viewing areaI purchased this TV despite all the negative reviews I have read about the Westinghouse brand. Other people have liked this TV, I am hoping that I will be only a handful of unhappy customers. I recommend this TV if you are looking an inexpensive set for the kids, but not for a living room experience.", "Date": "August 1, 2010"}, {"Title": "Before you buy a Westinghouse TV", "Author": "JB \"jb6606\"", "ReviewID": "RWA9BG9WPIROD", "Overall": "1.0", "Content": "Before you buy a Westinghouse TV, do an Internet search for \"consumer complaints Westinghouse TV\".  There is a problem with these TVs where the screen will go black and you have to turn the TV off and on a few times to get it to go back on.  I thought I might have a bad power supply, but there are sites full of complaints about these TVs, all with the same problem.  At first I could turn the TV off and on and the screen would come back on, but now my TV is totally dead.  I'm one of the lucky ones who got a few years of life out of my TV before it died.  Many people experience these problems after just a few weeks or months.  Customer service is horrible - if I ship my TV back (I have to pay shipping), Westinghouse will send me a refurbished TV for $250 plus freight charges.  It makes a lot more sense to put that money towards a new TV that might actually work.When there's a class action lawsuit, I'll be on board.  I am now shopping for a Sony or Samsung to replace this piece of garbage.", "Date": "January 18, 2011"}, {"Title": "Great Buy!", "Author": "OC Resident", "ReviewID": "R22S7I314Z8G64", "Overall": "5.0", "Content": "I have had good experiences with Westinghouse TV and monitors in the past so when i saw this LED TV at my local club at such a low price, I went ahead and get this and the 26\" for my guest bedroom and home office. This 32\" ends up in my office and 26\" in the guest bedroom (LOL, the original plan was the reversed). The image is just amazing. 1080i source from my satellite box, and my PC. I totally love it!! The viewing angle is wide enough for me to roll my chair around the office and still get a great picture. Another amazing thing is how thin and light it is. I mean my other 32\" LCD TV weights like almost twice heavier than this unit. I wish it has 4 HDMI rather than 2 but hey, for the price, i can't complain.I highly recommend this TV for bedrooms and home offices because of the size. I think 32\" is too small for a living room. I have a surround sound speaker system in my office and using that combined with the TV, I feel like I am in my own private movie theater. Now how do get my wife to stuff bugging me and I will live a peaceful and happy life.", "Date": "July 13, 2010"}, {"Title": "Good feature set, some quality-control issues", "Author": "Viet-tam Luu \"part-time race car fabricator\"", "ReviewID": "R333KR3RN212DZ", "Overall": "4.0", "Content": "I'll try and cover points not covered by other reviews:- Unlike the 26\" LCD TV it replaced, \"Native\" mode works so that I get a 1:1 pixel mapping from my HTPC (i.e. no scaling); curiously the HTPC (a Dell Inspiron 400 \"Zino\") defaulted to 1360x768 but this was easily changed to 1366x768, the true native resolution, where it's stayed since.- I run HDMI from aforementioned HTPC to the TV, then an optical digital cable from the TV to a soundbar; both the TV and soundbar are wall-mounted in my bedroom, and the shallow depth of the TV makes for a nice clean install.- The TV is mounted using a \"Peerless Universal Flat Wall Mount for LCD Flat Panel TV's 22\"-40\"\" also purchased from Amazon.- The power cord from the AC adapter to the TV is a bit short, about 5\" and I'm going to try and extend it so that I can run it through a conduit to conceal the cables.- Very energy-efficient; I observe this by feeling how emitted heat I feel if I hold my face an inch away from the screen. With CCFL-lit LCD TVs I can feel a lot of heat from the screen (heat = wasted energy). With the LED-sidelit screen there's almost no heat felt, and also very little heat felt rising from the back of the unit.A couple of issues to note:- The first unit I received from Amazon had some kind of problem with the IR (infrared) remote control receiver such that the remote would only work 1'-3' away from the TV. I sent it back to Amazon and the replacement they sent me works just fine (remote control works from across the room).- I have the TV speaker turned off through the Audio settings and occasionally the TV seems to \"forget\" this setting and I have to turn it off again.", "Date": "September 30, 2010"}, {"Title": "Best deal for the money", "Author": "Steven L. Mckee", "ReviewID": "R1J9AU7ZKXUEQZ", "Overall": "5.0", "Content": "This was my second HDTV and of course it is not close to my Samsung 6300 LEDSamsung UN46C6300 46-Inch 1080p 120 Hz LED HDTV (Black), but the price also was not close either.  This TV met all of my expectations and exceeded them when I realized it played 1080p.  You really see the full capability of this TV when watching Blueray and playing the PS3.Pros:1) Price2) Slim Design3) Light Weight4) Picture Quality / When watching movies, HDTV and playing PS3Cons:1) Watching regular cable looks worse than my old \"box\" TV ... need to get an extra HD box soon!2) Remote is very cheap and the back cover comes off often ... may buy an universal soon.3) TV stand does not swivel, but not an issue for me.4) Sound is weak at times,, but my bedroom is small and it is loud enough most of the time.Overall Opinion:  I understood that with such a low price that costs needed to be cut in some areas and I can deal with the Cons mentioned above.  This is a solid HDTV for your bedroom, or kids room.  I would not use this as my primary HDTV, due to size and other high end features missing.  However, this was a great deal and I would buy it again. ... best deal around!", "Date": "August 21, 2010"}, {"Title": "No control", "Author": "mFlynt", "ReviewID": "R8KKH1FEQYO8T", "Overall": "1.0", "Content": "+ Picture quality on HD channels is amazing.+ Set is thin and lightweight- Sound is awful.  Highs are piercing, bass is nonexistent.  I've heard it can be fixed with external speakers and an amp.  Factor that into the cost of the TV if you care about sound quality at all.- Lag time when changing channels is long.- Remote hardly works.  Has to be lined up perfectly, and no further than ~4' from the set.  Sound can be rectified with external speakers.. there's no fix for a bad remote, which is a dealbreaker when it's something I use so much.", "Date": "December 23, 2010"}, {"Title": "Liked !", "Author": "J. Haller", "ReviewID": "R16O49DPJAYME6", "Overall": "4.0", "Content": "Well, great deal for sure.For the pros:  First of all, amazing TV/Display design. I have to say, beautiful, slim, awesome finishing.  Great job there Westinghouse!.  The TV is super slim, 1.5 inches at the thickest part.  Is so thin that it feel wrong not to mounted on a wall!!.(I still have it on a stand).  The image is great too,  colors are superb. No need for more resolution for a TV of this size, the image is very sharp.  Blacks are really blacks and whites are absolute whites. Best technology for TV (LED LCD). I'm never going back to no LED (Sorry!). And all this for less than $ 350.conts:  Well, the most annoying thing for me is the TV tuner, I get HDTV from my air antenna, and changing channel is really slow (when I say slow, like 5 seconds from the time you hit the remote control to when you get your new picture, feels like satellite TV slow). This probably won't matter if you have cable and a cable box.  The control remote design sucks (well, doesn't match the nice slick TV, is like what the heck!). And I got a little confused with the inputs in the back (doesn't have that 5 cable A/V digital input anymore, instead comes with an adapter, this uses up your computer input, so now you might need a computer to HDMI adapter if you want to hook both at the same time).I like this TV a lot.  Again awesome picture quality!  I totally recommended this product. Love the display design... really nice (nicer than most other brands).  I have to say I bought it because of the great price. But if I would need to go back,  I now would buy it because I think is a great TV, is stylish and has great technology.", "Date": "July 30, 2010"}, {"Title": "Great TV if your on a budget *updated*", "Author": "John G", "ReviewID": "R1FOOGAXXJ3O9B", "Overall": "4.0", "Content": "***UPDATE*** Westinghouse fixed a couple input and sound bugs via software download. It still seems to have trouble with my ps3 but it occurs less often now and corrects itself in time.Here is the update page: [...]What can I say, the price point says it all. If you play ps3 on a non-hd tv (like i did) and don't have the money for a newer samsung or panasonic, GET THIS!!! I am a techy, so I know what people say about westinghouse. I took a leap of faith but it looks like it paid off. I was really unsure of the picture quality when I plugged the tv into my cable HDMI, but upon comparison with other LCDs in my house, I noticed they were all underperforming. Simply put, Comcast sucks. How do I know this? Because I just moved and had Verizon HD service in my old house and it blows Comcast out of the water. In my disappointment, I rushed to connect my PS3 and test it to see if the mediocre picture quality was universal. Thankfully it was not; the ps3 truly shines on this TV. Blacks are not as black as a plasma but the refresh rate is fast and the contrast ratio is extremely high, which is important when gaming. I will admit that the connectivity (the ability for the tv to respond to inputs) is rather slow and requires some patience. It might be a software issue and not hardware.In the end, the TV has a few cons:- Only 2 HDMIs (not and issue for me BUT may be a problem for some)- No TRUE component HD input (BGR cables) rather, it uses a VGA converter.- Sound is poor (BUT not an issue for me: you can shut off the TV speaker output in the settings and use your own sound system)- Stand does not swivel, BUT TV weighs 14 pounds, so its not hard to adjust.", "Date": "August 2, 2010"}, {"Title": "great deal", "Author": "college kid", "ReviewID": "R35AII9MU6GMWE", "Overall": "4.0", "Content": "Pros: slim, stylish, clear picture (720p), lightweight, easy set up, optical output (digital audio), low price ($350).Cons: stand does not swivel, tv seems to be angled downward slightly, unimpressive speakers, only 2 hdmi inputs.Other thoughts: no component inputs, but it does come with a vga adapter kit so you can hook up a single device using component connections. Also might want to make sure your hdmi cables are 1/2\" thick or less (most I have seen are), my hdmi cables barely fit into the slots because of their thickness (this is understandable, as the tv itself is only 1.5\"). The TV does slant downwards slightly. Not a terribly big deal, but modestly annoying since the stand cannot be adjusted. speakers are on the bottom/back of the tv, so sound is below average. Overall, you will have a tough time finding a better 32\" 720p LED tv for the same price.", "Date": "July 22, 2010"}, {"Title": "Surpisingly amazingly good!", "Author": "The Curious Miss Bibliophilly \"miss-bibliophilly\"", "ReviewID": "R3PFS7UECW0W3R", "Overall": "5.0", "Content": "I got this at a local target store where it was very inexpensive (275) on sale and easy to carry out for use in a bedroom with over the air (free) digital tv.  I had very low expectations considering the price, the maker and the inputs.  WOW - what a surprise!  This TV shows the digital channels over the air in beautiful HD.  I no longer need a converter box because it has a tuner built in, so all I had to do was hook up my antenna. Setup was easy. I don't read the manuals, and setup was intuitive.  The picture is so good that it is making my analog TV less attractive to me.  Even in the box it's light - I didn't have to get any help - and I have a breathing difficulty, so really anyone could carry this which is a surprise for a 32\" television.  This TV is so much better than I expected that I am planning to buy two more of them.  I was wondering where because there were no more where I bought the first - but now that I found it on Amazon.com I am thrilled. This TV also has a very small footprint. This 32\" HDTV takes up less space than a 19\" analog television took up.  It is very slender and comes with a sturdy base.I am finding the picture a little dark, but I'm sure I just need to adjust the brightness. On the other hand, the blacks are very deep and more like a plasma screen quality.I will add a caveat that I am perhaps not the most sophisticated television consumer and definitely not the pickiest.  But the price, ease of carry and setup, slimness, minimal footprint, combined with good picture quality and good tuner for over the air digital make this TV absolutely irresistible.", "Date": "August 29, 2010"}, {"Title": "How do I give this 0 stars!!!", "Author": "CP", "ReviewID": "R280DG3N8JXBPJ", "Overall": "1.0", "Content": "Well, after buying a Westinghouse 40' LCD 8 months ago, I am now on my SECOND REPLACEMENT tv under their \"warranty\" and this time they sent me a brand new one (not refurbished).  Plugged it in and all I got was a distorted picture and red squiggly lines across it (in every mode).The first time my original Westinghouse went out was 4 months after I bought it...couldn't return it cause it was past the return date at target so I had to PAY $ 40 to SHIP IT BACK to Westinghouse (their warranty does not cover shipping and there are no repair facilities you are allowed to take it to).  Luckily I  had a box or I would have been out another $20 buying a large box to put it in (since I stupidly trusted that I had a reliable tv and threw away the box)!That replacement tv lasted 1 month before it stopped turning on.  This time I kept the box and this time they PAID for me to send it back (how nice of them..NOT!)So they just shipped me my THIRD tv and now that doesn't work from the moment I plugged it in..Tried to get my money back cause I am sick of packaging this up and dropping it off to be shipped, being without a tv for weeks while they \"process\" the order\" and then getting another tv that is junk. Sorry, they don't do refunds even if you are now returning your THIRD tv!!!!I have owned lots of different brands of tvs and never have I encountered such junk!Don't buy this...you will be throwing your money away!!!", "Date": "August 3, 2013"}, {"Title": "Started smoking on the 61st day!", "Author": "Clem", "ReviewID": "RQ4VXL1TN6PBG", "Overall": "1.0", "Content": "I bought this at Walmert online brand new and it just went kaput. I can't believe it! I read the reviews and it looked pretty decent. It was cheap at $260ish and thought it was a good buy...PLEASE DON'T BUY THIS FOR YOUR OWN GOOD. It's seldom used at my uncle's thinking it will be sufficient, so wrong.", "Date": "March 9, 2012"}, {"Title": "So far so good (2 days)", "Author": "Budget Consumer", "ReviewID": "R3K5V1O1QT5SE4", "Overall": "4.0", "Content": "This was my first flatscreen TV purchase, first HD experience.  I found this for $249 at hhgregg on the Saturday after Thanksgiving.I opened it and attached the TV to the stand with 4 screws.Other reviewers have alluded to a difficult start-up process?  It was a 4-step process (step 1 was selecting English...)  that took 14 seconds.  I didn't have any difficulty.Turned the TV on, everything looks fine, I can't imagine that on a 32\" that 780p vs. 1080p makes much difference.Others have referred to poor sound quality - I turned the sound up to watch Lord of the Rings - didn't notice any degradation of quality.The remote gets 1 star in my book, it's just a tiny cheap remote - but I only use the remote to turn it on - - after that it's the Comcast remote for channel surfing.I'm a satisfied customer, especially for $249.", "Date": "November 27, 2011"}, {"Title": "Nice starter TV", "Author": "quan", "ReviewID": "R5A8ZH6PLFIVS", "Overall": "4.0", "Content": "i brought this tv to use while here in iraq.anything is better then the off brand they sale in the PX, a 32in would run you over 500 easy...i got this for 300 with free shipping and received it in the fastest yet(4 days). The tv is very light..maybe 12-14 pounds..during the setup i didn't like when you get to the tuner setup you have to call or go to a website to get a code and then return to your TV to finish..thats fine while your in your Living Room in Texas but here in iraq internet is crap and forget about placing a call..so that was a PITA for me..once i was able to obtain the code the tuner locked onto the US channels we have piped here for morale boostingmy other complaint is the speaker..it's useless..my speakers on my dell are 10 times betterthe picture is nice when using PS3..when on tuner SHOWS ARE SENT VIA SAT FROM EUROPE TO IRAQ SO PIC QUALITY IS....CRAP BUT THATS NOTHING TO DO WITH THE TVi would recommend the tv for someone's first HD set..a child maybe or grand parent..a techie like me, it works for what i need it for..PC display,tv for PS3..and tuner...side by side comparo to my LED samsung @ home..this tv is crushed in every single area but i also paid 4 times more...so you get what u pay for", "Date": "February 25, 2011"}, {"Title": "Do not waste your money", "Author": "David Gardiner", "ReviewID": "R2PSEIQAPP3OU5", "Overall": "1.0", "Content": "I got this TV because of its features and amazing prize. I was really happy with it, but after 3 short weeks of using it the tv stopped working. The tv had sound but would only show a blue screen. No picture what so ever. After doing some online research I discovered that I was not the only one having this issue with Westinghouse tvs. After dealing with the Westinghouse and its non-exixting warranty (they do not cover shipping on broken tvs, they dont even send you a box for shipping) I did the math and it was cheaper to just return the tv to amazon. IF YOU ARE THINKING YOU WANT THIS TV BECAUSE OF ITS PRICE, THINK AGAIN!!! DO NOT WASTE YOUR TIME AND MONEY.", "Date": "August 25, 2010"}, {"Title": "WORST TV EVER", "Author": "Lori Mason", "ReviewID": "R2VNW56UHHSCLP", "Overall": "1.0", "Content": "Mine broke within 2 months of buying it & westinghouse makes you pay to have it shipped to California to have it fixed. Never again will I buy. Westinghouse TV. Don't waste your money.", "Date": "September 11, 2013"}, {"Title": "Westinghouse TV's are horrible", "Author": "Travis J", "ReviewID": "R12Q0PKRFR3VJQ", "Overall": "1.0", "Content": "Westinghouse TV's are as horrible as their customer service.  Think I'm wrong, Google it.  I'd consider a buyer extremely lucky if their TV still worked 1 to 2 years after purchase.  Do yourself a favor and buy another brand.  Don't get burned like I did.  I've got Panasonic TV's that are still going strong after 5 years and will never buy Westinghouse again.", "Date": "August 13, 2013"}, {"Title": "no title", "Author": "Nancy", "ReviewID": "R7B1R1FNX3MCY", "Overall": "1.0", "Content": "Bought a 51\" Westinghouse at Target before Christmas. Stood in line 3 hours for this sale. TV picture had red line through it, a pixel problem. Customer Service sucks! Called 4 times, getting a promise of a response within 24 hours, no response at all. Target could not exchange TV because 51\" only available at Christmas. Didn't know that. Would NEVER recommend Westinghouse.Check other sites with Westinghouse reviews. This company has issues!", "Date": "January 14, 2013"}, {"Title": "Westinghouse does not stand by product.", "Author": "scoob", "ReviewID": "R353W9HGOGZP50", "Overall": "1.0", "Content": "Bought a tv on Black Friday from Westinghouse. TV defective. Westinghouse will not stand by warranty. Product is subpar. Customer service ineffective.", "Date": "October 2, 2012"}, {"Title": "GREAT Picture, HORRENDOUS sound...", "Author": "Joseph Puglisi", "ReviewID": "R3GASVOAQ0TQ01", "Overall": "5.0", "Content": "Before deciding on purchasing this TV, I read ALL of the reviews and let me say that the reviews were DEAD on...The picture is STUNNING !!! You WILL NOT find another 32\" LED HDTV that has a 100,000:1 contrast ratio for under $350.The TV cabinet is sleek, slim, and absolutely 'feather light'...The remote is not as bad as other reviewers stated, or maybe I just got lucky with my unit.Setup with my DirecTV receiver via HDMI was a breeze.I was excited that I was able to program the Westinghouse TV remote directly my DirecTV remote. ONE REMOTE !!!!!WARNING !!!If you buy this TV, please plan on spending a little more money for AUDIO output.The sound that comes from this TV is HORRENDOUS! I have an AM Ryobi work radio that has better quality sound.There is NOTHING that you can do with the settings nor the Firmware update. This TV just has horrible sound...But do not let the Audio problem stop you from buying it... Here is why........I just purchased a Logitech Z313 2.1 PC speaker set for $40 from Best Buy.I hooked them up via the audio out from the back of the TV. AUDIO PROBLEM SOLVED!!!I now have a mini home theater in my bedroom.Even if you take the extra $40 that I spent on the speakers, and put it towards a different TV with better sound, you will not find a better picture than this TV for the $40 difference.You can ALWAYS fix an audio problem with better speakers via the audio out of any TV.But you CANNOT fix a poor quality picture problem.Do the research, and you will see that I am right...In this price range, you will find LCD or an LED TVs with contrast ratios of 1,000:1, 3,000:1, 5,000:1 and if you are lucky, maybe a TV that offers 10,000:1... But nowhere near the 100,000:1 that this TV offers.When it comes to an LCD or LED TV, the contrast ratio is one of the MOST IMPORTANT things that contribute to it's picture quality.This TV is the best 32\" in its class!!! Hands Down!!!Overall, I am very happy with this TV.I did not buy it from Amazon only because my local Best Buy has these on CLEARANCE for $249.99.Buy this TV... You will not be disappointed... But remember, get better speakers!!!!", "Date": "April 4, 2011"}, {"Title": "Great TV for the price", "Author": "UrbanRedTag", "ReviewID": "R1TWX1P93CW5L3", "Overall": "5.0", "Content": "TV is not a highly-sought brand, but works as good as a Samsung, or the more popular brands. Picture and sound is sharp and clear, set-up was a breeze, connecting to Blu-ray player was a snap with an HDMI cable to stream Netflix to. The TV functions are of the quality of our more costly units in the household but at a fraction of the price.", "Date": "February 11, 2011"}, {"Title": "Careful", "Author": "Brently", "ReviewID": "R8KAOCLJYS9LJ", "Overall": "2.0", "Content": "I'll spare you with boring details that most people don't understand. What I will share are things that matter. This TV is very nice for the money. The picture is just great, and it's easy to set up. The sound is just awful, (but you pretty much know that's what you get with LED's anyway) so we got a sound bar to go with it. Here's my major hang up: The remote capability. We purchased this to hang from a wall in our master bedroom. After going through that pain in the tail, we discovered that the remote didn't seem to work very well. It works fine when you are fairly close to the unit, but once you move back it starts to be sporadic. After trying two separate universal remotes, I finally called the Costco Consierge service to see what was up. Come to find out, the remote is rated ONLY up to 10 feet away with a 20 degree top to bottom swath. It's a real liabilty if you're ANY more than 10 feet away. I measured the distance to where we lay, and came up at about 11 1/2 feet. Granted we may also be a bit off the optimum degree as well, but by comparison a similar Vizio is rated up 22 feet and 25 degrees up and down. Funny you can be so terribly disappointed by remote capabilities, but we are. That being said, if you can use the Westinghouse in the parameters I have mentioned it's a great buy.", "Date": "November 26, 2010"}, {"Title": "WTH is wrong with the IR Receiver?", "Author": "P. Garcia \"HomeStudio\"", "ReviewID": "R17LUPGGWAOKK0", "Overall": "3.0", "Content": "So far so good i have the TV for about 2 months and the only problem i've found (besides the poor quality of the sound) is the remote control.. or maybe the IR receiver... it's so difficult to turn the volume up from more then 3' away from the TV. I mean it's almost impossible.Yeah i did try to configure the remote from my cable system.. THE SAME... IR receiver got serious issues.besides this, the quality of the image is really good considering the price of the set.", "Date": "October 26, 2010"}, {"Title": "Horrible Sound and IR reception", "Author": "Brent112", "ReviewID": "R3OATYRL8B5GPV", "Overall": "2.0", "Content": "I wanted a cheap LCD for our bedroom so i picked up this Westinghouse as it was cheap and LED. It arrived next day and I quickly set it up. The picture was great, however; the sound was horrible. I know this is a small TV and I was not expecting theatre quality sound, but this was the worst sound quality I have ever heard on a TV. I had to turn the volume up to max nearly before I was able to understand what the people were saying. There is just too much background noise and the voices sounds like they are In a cave.The IR reception is very bad on this TV as well, with the factory remote and a universal remote you have to be about 3-5 feet from the tv and point it directy at the iR receiver to turn the tv on or change the volume.I ultimately returned this TV and bought a LD350 from LG. I could not be happier with it.", "Date": "September 11, 2010"}, {"Title": "Good Price Poor Quality", "Author": "Frank", "ReviewID": "R3ABMXLKQ5YV52", "Overall": "1.0", "Content": "We purchased one of these TV's through Amazon and it was delivered promptly. I set it up and went through the set up instructions in the manual.In a word, the picture quality was the pits. It looked OK (not LED quality)with the x-box but everything else was poor. The remote was minimal and the sound quality was not of a modern TV set.We had to send it back and we purchased a VIZIO LCD set at Wal-Mart for $30.00 more and we have a much better set with a much improved picture and sound.I think  we may have gotten a \"bad one\" but if it is typical, don't waste your time or money.", "Date": "September 24, 2010"}, {"Title": "Great TV and Computer Monitor", "Author": "DanielJ", "ReviewID": "R1PACQ7C92K3KO", "Overall": "5.0", "Content": "I love this tv, I use it as a computer monitor and it works out great, I mostly play video games or watch videos on the internet so resolution was not that big of a deal for me.", "Date": "July 17, 2010"}, {"Title": "Westinghouse 46\" LED HD TV", "Author": "Tru", "ReviewID": "RWF0Y9X13506U", "Overall": "1.0", "Content": "I bought this TV a little over 14 months ago. The warranty was for 12 months. Normal usage and all of the sudden I pressed the power button and nothing happened. The outlet it was plugged into was fine. Took it to a TV repair service and they explained to me it wasn't the power which would have been a $150 fix, but that the screen just burnt out or something. To replace the screen was more than the cost of the TV. Customer service for Westinghouse was AWFUL. I called and used the web service to let them know the problem. It took them over a month to respond. I will never purchase anything related to Westinghouse ever again. HORRIBLE TV NEVER BUY ANY WESTINGHOUSE PRODUCT!!!!", "Date": "May 28, 2013"}, {"Title": "HORRIBLE!", "Author": "truth", "ReviewID": "R280HZPU7X5RP5", "Overall": "1.0", "Content": "This product is complete junk! The company needs to reevaluate the things they put out into the market. I owned my weshitinghouse from april 2012 to november 2012, its already starting to flicker and black out. I WILL NEVER EVER EVER BUY such JUNK!!!! NEVER!", "Date": "November 29, 2012"}, {"Title": "Worst TV ever", "Author": "Melinda Martinez", "ReviewID": "RCMBUKHPJ9LRJ", "Overall": "1.0", "Content": "I purchased this TV for the great price, how ever I went through hell  trying to get it set up, nothing but lines running across the screen until I only recieved a blue screen,  no picture. I could not even pull up the menu, and of course it is Christmas eve, so no customer service. Never again, I would rather pay the price for a better brand!!! TV's should be plug and play!!!", "Date": "December 24, 2011"}, {"Title": "Cheap tv, poor service, Don't waste your money", "Author": "fireup", "ReviewID": "R1VHUCKPJVQMDV", "Overall": "1.0", "Content": "Three months after buying this tv. The picture was lost. Westinghouse does not offer local service or in home service. They required me to ship the tv to them. Seventy dollars later. I recieve a call from them five days after they recieved it and said the tv was damaged in shipping and I would have to pay for repairs. ???? One year warrenty apparantly is NOT BACKED UP. Dont waste your money on anything from westinghouse. I decided to buy a sanyo tv and wow what better quality. Definatly sorry I bought a westinghouse product.", "Date": "November 9, 2011"}, {"Title": "Horrible warranty policy!", "Author": "Diane Dayton", "ReviewID": "R3IM3U5PGB87CH", "Overall": "1.0", "Content": "I purchased this television from Costco.  After four months of light use (an average of 30 minutes to 1 hour a day), it started to get horizontal black and white lines across the screen.  The television now flickers like a strobe light and the picture will go black and just play sound.  Costo put me in contact with Westinghouse since I had just surpassed their 90 day return policy and Westinghouse is making me ship the television to their repair center.  I have to pay for the packaging materials and the postage to mail my television to them and go without the television for as long as it takes them to finish and send it back to me.  I am outraged that I have to pay to ship this television when it is their faulty merchandise in the first place.", "Date": "October 11, 2011"}, {"Title": "You get what you pay for.", "Author": "NS", "ReviewID": "R31N08A112DF2J", "Overall": "1.0", "Content": "I bought this TV from Best Buy because it was very inexpensive and it looked great. I set it up, and I loved the look and the picture quality. But, after two weeks the HDMI ports went bad and the picture would not work. I verified this by trying different HDMI cables and the problem persisted. I also tried hooking a different TV to my cable box and the other TV did not have any problems, so it led me to believe that the Westinghouse was a dud. No problem, I returned it to the store and got another one. Again, after a week, the same thing happened. So I returned it altogether and got an LG TV, and it works like a charm. The Westinghouse cost $279 at BB, which is a hell of a price. But, after two defective TVs, I gave up. I guess a price like that IS really too good to be true. Too bad, because the picture quality was excellent when it worked.", "Date": "October 8, 2011"}, {"Title": "Good deal for a tight budget.", "Author": "Mom in Missouri", "ReviewID": "R2B0J2SS3UK960", "Overall": "4.0", "Content": "We purchased this Westinghouse t.v. to replace our gigantic 32 inch monstrosity that must have weighed close to 200 pounds.  This is very lightweight, it weighs only 14 pounds.  The picture quality is great.  There are setting choices for bright, medium, or dark rooms.  We don't have cable so I can't judge how high def television would be.  Yes, the sound does sound like a small portable radio, but apparently all slim t.v.'s do.  There is a surround sound choice for hookup in the back of the set. I read reviews about the t.v. facing down too far on the base.  We don't have that problem.  It seems plenty sturdy enough for us (We don't have young ones in the house.).  It would be plenty lightweight enough to hang on the wall without worry, also.  We paid under $300 dollars and I feel it was a good deal.  We did the firmware update, and it wasn't hard to do at all.  It just took a few minutes.  I think if you are on a budget, this is a good choice.  We also use a Roku player and have it hooked in the composite part of the set, but there are also two hdmi plug ins to use if needed.  We bought this off of Amazon.", "Date": "August 25, 2011"}, {"Title": "Don't buy Westinghouse TV's", "Author": "JP from TJ", "ReviewID": "R3CN6WE76U4P8U", "Overall": "1.0", "Content": "The tv looks very good, it is very slim and looked great in my bedroom but, after 24hrs of using it it just went black!, the tv was on stand by and i just couldn't take it out of it, i had to turn it off for a  couple of minutes and then was ok but happened to me 3 times in 2 days so i decided to return it. Amazon's customer service was awesome they sent me  a total refund and gave me $20 dlls as a gift for the inconvenience. Thumbs up for Amazon! Thumbs down for Westinghouse.", "Date": "April 7, 2011"}, {"Title": "good TV - for the price that is", "Author": "Amazoniac", "ReviewID": "R2E8E3EJGE8S9U", "Overall": "3.0", "Content": "Looking for an affordable new-age TV (yes I was on old school equipment up to now!) I was happy to be able to step into the future for under $400 - even with LED-technology. That being said I'm quite happy and don't want to repeat all the good and for tech-geeks not-so-good stuff. The things important for me - easy to use - i.e. not much to set up and mess around if you don't want to - turn on and watch; nice picture, handles a weak (analog) cable signal quite alright, almost brilliantly handling VGA, and does a good job with low resolution stuff like divx movies.To the you-get-what-you-pay-for part. The plastic foot doesn't seem to be designed to hold the thing, it shakes scaringly so put it up high where nobody can bump into it. That again supports the slight downward tilt of the whole structure though, I have it on an almost five foot high shelf and it points down right to where I'm sitting :o)Now the real downfall is if you are a channel zapper. The IR remote functionality plainly s***s! There is only a small window right in front of the TV where it actually reacts to the remote. slightly off and you'll get blisters on your thumb! So changing channels and adjusting volume is a pain in the -you know where. Plus it takes far too long to tune into the next channel after changing.So if you watch TV a lot then I wouldn't recommend this one, anything else is very satisfying to a newbie...I just got it so I can't talk about durability. I sure hope it'll last a while and will update my review about it...... as an update on the remote functionality: I contacted customer support about it and two days later I had an IR-sensor replacement in the mailbox - put it in (some screwdriver skills needed) and it works - not perfectly perfect but much better and I'm happy with it!", "Date": "November 23, 2010"}, {"Title": "Good TV, TERRIBLE remote", "Author": "Rod", "ReviewID": "R20HQ6455PLE2S", "Overall": "3.0", "Content": "The TV itself works great, especially at this price point.  The speakers are crap, but I can live with that or get external speakers as others have done.The remote is the problem.  It's horrible.  You have to be right next to the TV for it to work, I tried new batteries.  I went out and bought a Universal Remote (GE 24950 from Amazon) and it didn't help a bit.  It wouldn't take any of the codes for Westinghouse, so I had to \"learn\" the remote.  No better than the crappy original.", "Date": "October 23, 2010"}, {"Title": "Bad Quality !!", "Author": "Chris", "ReviewID": "R1IQ6OOMKLDW6J", "Overall": "1.0", "Content": "The screen doesn't turn on only after a few days use, I think they rushed it to the market and failed to do a thorough quality control. Bought one from a reputable brand instead.", "Date": "October 20, 2010"}, {"Title": "New Westinghouse 32 inch led ?", "Author": "Ronald P. Weatherbee", "ReviewID": "RUMQ1MIDO9B44", "Overall": "2.0", "Content": "I really think they should have spent just a bit more time on this tv particularly with the audio which is of very poor quality, I have a 32 inch lcd Ive had for almost 4 years and the audio on the lcd puts the audio to shame on the new led. You would think after all that time Westinghouse would be able to offer audio comparable to my lcd but thats just not the case. I actually returned this unit because when I got it there was a dead pixel in the screen as well as being dissapointed with the sound quality. Needless to say Westinghouse wont earn my vote again until they invest a bit more engineering and time in their products instead of trying to rush things out to the market too quickly. Sorry", "Date": "September 10, 2010"}, {"Title": "Very affordable with very good quality features", "Author": "Skippy", "ReviewID": "R3LFW5ACU7C06X", "Overall": "5.0", "Content": "Very Affordable, am so fascinated with the price, and the features are superb.  Beyond expectation.  I will definitely going to buy more.  Highly recommended.", "Date": "September 4, 2010"}, {"Title": "I like the TV for my use", "Author": "Jerry", "ReviewID": "R30O3DWRBQD5H7", "Overall": "3.0", "Content": "1} The picture is great quality. The side vision is not that great, about 140 degrees, my guess. But in my use, straight is good for me. If you hang it in a wall cornerner, you may never see this issue. Very light, can be hung with picture frame hangers. 10 pounds I think. Hard anchors in sheet rock with no problems.2} The remote is very hard to use. I need to push the buttons really hard to make them work. I thought the batteris were weak, but even with new batteries, same thing.3} HDMI is excellent. Pre sets of pictures have a lot of green in all settings but can be adjusted to look realistic in the manual mode. Ultimately a great pic. It seems each chanel needs some adjustment. But once set, a super picture. I love it. I can say that for this price, $329.00 from Amazon and free shipping, this was the best deal I found for a 32\" HDTV. This set sold earlier for over $700.00. LED is super.4) Sound quality is very tinty. I run it through my stereo for good sound. TV speakers are not too good. They sound 60's quality transistor radio. Output to a stereo is super.5} For the price I paid, I am very happy with the set. If set up properly with the use your external components,  this 32\" is a great TV. HDMI is super, Be sure to use all the electronics you have available to produce the best possible picture and sound.6} I am also comparing this to a Samsung 42\" Plasma with a lot better resolution, 600 HZ, 3,000,000 to 1  contrast and other things. But for $329.00, Westinghouse 32\" LED is a great set. It eases my eyes to a greater pic than I had on my 27\" CRT. Just have to make adjustments to aquire a great pic. The samsung is more automatic. If there are any left, and your room is not very big, I do strongly reccomend this Westinghouse model. I will never go back to a CRT television.", "Date": "August 25, 2010"}, {"Title": "Westinghouse LD-3255VX 32-Inch LED HDTV", "Author": "Anthony!!!h.", "ReviewID": "RYNRCQU58CLP8", "Overall": "5.0", "Content": "THIS 32 LED TV IS GREAT.I HAVE IN MY LIVINGROOM WITH MY BLU RAY HOME SURROUND SOUND SYSTEM.THE PICTURE IS REAL NICE,IM THINKING ABOUT GETTING ANOTHER TO USE IT FOR MY MUSIC STUDIO FOR A MONITOR.WESTINNGHOUSE DID THERE THING & THE PRICE AND THE SHIPPING WAS GREAT.", "Date": "August 1, 2010"}, {"Title": "Best TV deal I've ever seen.", "Author": "Eileen", "ReviewID": "R190KQ6UL9WW65", "Overall": "5.0", "Content": "This television is awesome.  However, the description is lying: the TV is not 720p.... It's 1080P capable!! Games are what really shine on this television (literally, the Veyron in Forza 3 glistened), although normal cable isn't bad by any means.  Yes, the speakers are not up to par, but forty dollars on craigslist can hook you up with a basic surround sound system that fixes that plus some. Also, the remote IS terrible.  It was designed alright (I like the feel) but the IR signal just isn't processed in a decent amount of time, so it takes several seconds to adjust volume, when it should only take a split second. Again, the receiver of the sound system and it's remote fixed this, and now I'm working on getting a universal remote it and see if that helps with the IR lag.And the component input adapter is strange so here is a small explanation: you cannot use the VGA and Component inputs at the same time.  The way the TV handles component is to package a VGA female to Component Female adapter and a 3.5 audio male to RCA female adapter.  Awfully nice of them.Did I mention this can easily be picked up with one hand? My friend and I debated on whether duct tape would hold it to a wall. The answer is yes, but we didn't trust the tape, so we took it down.All in all, if you're on the fence, GET IT.", "Date": "August 21, 2010"}, {"Title": "Great for the Price", "Author": "Brad Davis", "ReviewID": "R3QXYFXWJAGM7D", "Overall": "3.0", "Content": "Pros:  - Very good picture quality.  - Great value.Cons:  - Speakers are horrendous.  - Changing channels takes nearly two seconds per click.  - Sometimes I have to click the remote twice to get it to function.Other Thoughts:  - This is a great buy at the price point.  - Ideal use would be for a computer monitor.", "Date": "July 22, 2010"}, {"Title": "Bad remote...will barely work and I've changed the  batteries.", "Author": "Sheila", "ReviewID": "R1EJH0VCYNKQVN", "Overall": "2.0", "Content": "The picture isn't as good as I thought it would be.  The remote doesn't work unless I get right next to the screen and keep pushing the buttons.  I got it for my bedroom and now I have to get out of bed to change the channels...not good.  If I had to do it over, I would not purchase this tv.", "Date": "August 15, 2010"}, {"Title": "I think this Westinghouse has great sound", "Author": "J. Nielsen", "ReviewID": "RCG8X7MKDO4XY", "Overall": "5.0", "Content": "I've had this Westinghouse for about 2 1/2 years. I have a great room that is open to the kitchen, and I enjoy listening to my TV programs on the TV which is on the far end of the great room. I think it has a great picture and realistic quality sound. My sister has a Samsung and the sound sounds like the people are talking into a can. I'll stick with the Westinghouse. I have no complaints about this TV.", "Date": "January 9, 2014"}, {"Title": "Bought a Westinghouse at Menards.  The picture is good but the sound is so dismally bad its laughable.  You will have to buy a", "Author": "D.P. St.Germaine", "ReviewID": "R1YSWPTSKQU5KJ", "Overall": "2.0", "Content": "separate surround sound setup to watch TV.  You could not listen to the sound from this Television for 5 minutes without running from the room.", "Date": "December 27, 2013"}, {"Title": "WORST TV, do not buy", "Author": "Katelin", "ReviewID": "R2GGKR063AXFA9", "Overall": "1.0", "Content": "This is the worst TV I have ever had. The sound goes out all the time and for a long period of time. DO NOT BUY IT!!!!", "Date": "December 8, 2013"}, {"Title": "Good Television, Terrible Monitor", "Author": "J. Anderkin \"openmindgood\"", "ReviewID": "RTVKIAQZAR32", "Overall": "3.0", "Content": "I haven't had this TV for more than 24 hours. I am typing this review on it now and can barely see the text it is so blurry. I don't have a complete grip on all of the set's functions, but I have adjusted the picture to reduce the blurring as much as I could. The funny thing is, when I play a high resolution movie file from the pc or when I plug in my Xbox 360, the picture is AWESOME, but for web-surfing, emailing, facebooking and such, the resolution is TERRIBLE. The price was too good though, so I will probably use my larger and higher quality Sony TV as my monitor (as is gets better text/web resolution) and use the Westinghouse as my Television.Pros:LED flat panel television with attractive case for around $200Large screen for priceGreat picture depending on feedCons:Speakers in rear (doesn't bother me and keeps the sleek look)Its a Westinghouse (their toaster almost caught my house on fire)Extremely blurring when used as a PC monitor (mostly text viewing)Yes, there are blotches or smudges underneath the screen (return worthy?)No buttons, just the ON/OFF buttonMore to come, I'm sureDetails:-My PC is connected via HDMI and I'm getting a 1080p signal-I bought this Westinghouse specifically for use as a pc monitor-I hate it as a monitor, but will keep it as the television viewing is pretty good-I know that you get what you pay for, sometimes I just need a reminderEDIT/UPDATED 11/30/2013:-Okay, my review is for the 1080p model (my bad)-There is an irritating smudge inside of the screen (from day one) that isn't going away-The text viewing resolution seems to have gotten a little better, or I am getting used to reading through blur-PC games look very nice on this set, considering the price, VERY nice-I am certainly NOT returning this and I WOULD recommend it to a friend", "Date": "November 19, 2013"}, {"Title": "Great TV for the price!", "Author": "Josh", "ReviewID": "R31E5YT5GBGZ9P", "Overall": "5.0", "Content": "Having owned this tv for almost 2 years now, I know a lot about the quality of it. The price on this thing has really dropped! I got it on sale for 294 at hhgregg. It is on amazon now in august 2013 for only 190! People have been giving it negative reviews saying it only lasted a couple months, however In 2 months it will be 2 years since I bought it! The LED display is brilliant! I have both my verizon box and ps3 hooked up to it via HDMI and it works great for both. The speakers are pretty bad though, and that is my only complaint. But hey, for 190 bucks you really can't go wrong! And one other thing i liked, is that on every Hdtv i've used with my ps3, there is a lag with the display, but this one doesn't have any display lag with gaming whatsoever! Overall i'm really glad I got this tv and it's definitely worth the price!", "Date": "August 23, 2013"}, {"Title": "Decent product", "Author": "Duane Day", "ReviewID": "R2UAC0Q9N7L7HQ", "Overall": "4.0", "Content": "No problems with the unit, I just wish it had more outlets for my other entertainment equipment. But other than that, it's a solid unit", "Date": "July 3, 2013"}, {"Title": "My first HDTV", "Author": "JC SD \"jeancarleo\"", "ReviewID": "RABKGWJYQ7HQJ", "Overall": "3.0", "Content": "I didn't know the differences between 720p and 1080p HDTV so I bought this one. I bought it in August 2010 and it's now February 2013 and it's still working.The bad experiences with this tv is mainly the remote for volume up or down, you have to press the buttons really hard to make it work so I just end up buying a universal remote but it didn't work with the coding for this brand so I use it with the cable box just to mute the tv since the volume doesn't work on the cable box for some reason.Another issues are when turning tv on it will display a black screen. This doesn't happen all the time but it can be annoying when it does. Also turning off the tv and then it turns on by itself right after you turn it off. Other than that it works perfectly for cable, ps3 and xbox 360.If I would have known about tvs back then I wouldhave purchased the 1080p. I'm just glad the tv works even with those little issues.Picture quality it's not bad but it's not the best. For the price it's worth it but now tvs are cheaper and I'm soon buying a new tv and will post my review. Hope this helps.", "Date": "February 13, 2013"}, {"Title": "No Complaints", "Author": "SunshineChick", "ReviewID": "R2DNQ73DY2PN7I", "Overall": "5.0", "Content": "Bought in 2010 and still love it.  This TV is a great deal and looks great also.  I would definitely recommend this TV to anyone looking for a thin, sleek TV with very good picture quality.", "Date": "January 28, 2013"}, {"Title": "Product quality is good .", "Author": "sokabaru", "ReviewID": "R2Z3FP2UPKWLKY", "Overall": "5.0", "Content": "Product quality is good .. is according to the price paid .. recommend this product is just what I needed..all ok", "Date": "December 10, 2012"}, {"Title": "hola todo fino", "Author": "Carlos E.Cabrera Morin", "ReviewID": "R1SI3QD2WFBFAB", "Overall": "5.0", "Content": "hola todo fino hola todo fino gustaooo muchoooooo everything right all excellent recommendy poreque esta muy buernono em ha llegadotodo bien lo recomiendo", "Date": "November 23, 2012"}, {"Title": "Great TV for the price if u dont mind the cons", "Author": "David Chen", "ReviewID": "R1D09UL4Z8WS8G", "Overall": "4.0", "Content": "Unit has awesome picture but remote was slow at changing channels. Unit went pitch black and wouldn't turn on all the way (it would show the \"W\" log then go black), so i went to Westinghouse website and downloaded the new firmware, after i upgraded the firmware the TV worked again and it changed channels faster!!! No other problems for a couple months, going strong for about 8 months then i had to re-flash the firmware again cuz the tv went black again. Once i re-flashed the firmware again the TV reset itself and came back on...this TV is strange but hey its been working for 2 years (with a couple firmware flashes in between those years)so im happy it just works....i don't mind flashing the firmware once every few months although the other people in the household get mad!pros: cheap price and picture quality for the price is good. very thin and compact. looks goodcons: have to re-flash firmware every so often (my experience about 1 time every 6 months) - changes channels a little slow", "Date": "November 5, 2012"}, {"Title": "totally unsatified customer", "Author": "triple6chi", "ReviewID": "R1JCUWYV74WUQ5", "Overall": "1.0", "Content": "I purchased a 55 inch Westinghouse television in February, 3 months after the thing stop working absolutely nothing. I called and they did not have a replacement so I opted for a refund. I sent them the copy of my receipt and was told it would be 12 wks before I receive my refund, 12 wks passed and no refund, I called again now they are saying another 5 week's for a total of 17 weeks. I'm still waiting, I'm doing this review to WARN others not to take their hard earned money purchasing any TVs from Westinghouse, don't waste your money like I have. I was made to feel like I was being punished for buying their product. The Westinghouse name is not as reputable as they were in the past.", "Date": "November 1, 2012"}, {"Title": "OK for an LED TV at this price range.", "Author": "jedagirl", "ReviewID": "R1CD15SKBW1699", "Overall": "3.0", "Content": "I bought this TV two years ago at less than $350 here on Amazon. It's beautiful -- slim, great picture, I can't say anything about sound as the volume I use is always low (being in an apartment building, I don't want to cause noise problems for my next door/upstairs neighbors). And reading the reviews here, I'm fortunate that mine is still working. My only gripe I guess is that I can't figure out how to make it use an external speaker (namely, my wireless headset the base of which has a standard 3.5mm jack).", "Date": "October 5, 2012"}, {"Title": "Would not recommend", "Author": "Scott", "ReviewID": "REKRRRZCGOFYY", "Overall": "1.0", "Content": "I won't be buying another Westinghouse TV.  Every TV I've ever had has lasted at least ten years or more.  Until now.  This one lasted less than years and during that time the picture would often freeze up or their would be no audio and I would have to turn it off and on to get it to work.  Not a huge deal, but I should have taken it as a warning sign.", "Date": "September 23, 2012"}, {"Title": "Both the product and the company SUCK", "Author": "Wei Huang \"avid reader\"", "ReviewID": "R31F5R3LVRTO98", "Overall": "1.0", "Content": "I never had a TV with such unreliable quality. Originally I bought it from Costco. It's a 32 inch and I used it as my computer monitor. after about 9 months, the screen images starts to wobble. after another 2 months, it stopped working completely.I called and they shipped me a refurbished one to replaced the old one. After 3 months, this 2nd one was dead, simply doesn't show any images any more.I called again now, they were going to ship me the 3rd one and I should receive it within 2 weeks. Because I still haven't received the 3rd TV after 2 weeks, I called again. The rep told me that she couldn't find a tracking number, because it hasn't been shipped out!!!It has been like hell dealing with Westinghouse TV and Westinghouse customer service. If you want to burn your brain out and drive yourself absolutely insane, buy Westinghouse TV. For me, this is absolutely the last time I will deal with Westinghouse. I don't want to get another few white hair with a stupid product and a stupid company.", "Date": "September 11, 2012"}, {"Title": "good tv poor sound", "Author": "lewis84", "ReviewID": "R2TAMSH3NE960M", "Overall": "2.0", "Content": "I bought this tv back in Jan and it worked fine for the first month but in mid Feb that all changed. The picture would go out and only the sound would play. I was just outside of my 30 days so I looked up reviews to see if it was an issue unique to me. Turned out I wasn't the only one and that my experience with customer service was about the same also. So, with nothing to lose I took the backing off my tv to see if any wires were loose. Nothing looked strange so I disconnected the white clip from the power supply and firmly reconncted it and re taped all the ribbon wire that I had pulled loose. Once I turned the tv back on it worked fine. No issues since great picture for the price minus the iniitial problems.", "Date": "August 20, 2012"}, {"Title": "Biggest piece of **** I have ever purchased!", "Author": "Sara", "ReviewID": "R349JG749YJLNP", "Overall": "1.0", "Content": "I'm not speaking of the seller.  My problem is with the brand. This TV doesn't even deserve the one star I had to give it! Caution to all buyers!!! Read the reviews all over the internet.  This brand of TVs have a very short life.  I have two Westinghouse TVs.  The first one, after about one year, would mysteriously max out the volume on its own after being turned on for a few minutes and would not let me turn it down.  Before I had the problem with the first one, I had already purchased a larger one (32\") for my living room.  The TV in my living room died this past Saturday, after using it for a little over 6 months.  Went to turn it on and no picture, no sound but the red light came on.  In the process of contacting Westinghouse to see about a replacement though I don't have much hope, judging from the reviews I've read about people that have had similar issues with their TVs.", "Date": "June 29, 2012"}, {"Title": "DO NOT BUY!!", "Author": "jabbaj08", "ReviewID": "R3COSWUDLM5MFD", "Overall": "1.0", "Content": "I got this tv as a christmas gift and here we are 5 and a half months later with a broken screen.  The screen blacked out on the left side and only the right side shows the picture.  It happened out of no where, I have read the reviews and now see that this is an ongoing problem.  It did have a very clear image and its a nice looking tv but I honestly wouldn't take the gamble, go with another tv if not run the risk of writing a bad review a few months later.", "Date": "June 7, 2012"}, {"Title": "Westinghouse ADMITTED this tv has a BAD tuner!", "Author": "lisa", "ReviewID": "R3UM4RIF90O1BE", "Overall": "1.0", "Content": "Steer clear of this model... I bought this in Jan 2012 And didnt try and use it till today... It would only search for Analog channels... I called Westinghouse and was Informed they ARE aware this model has a bad tuner... And for a HUGE shipping bill I CAN return it to them for repair. Im sure with and a additional charge! Save your $$$$$$ and Buy another model do what im gonna go and buy from a REAL company who stands behind thier brands!", "Date": "April 19, 2012"}, {"Title": "Worst Television and company in the industry", "Author": "Rachel", "ReviewID": "RZBDPAE4F9X3X", "Overall": "1.0", "Content": "I have had the worst experience with Westinghouse. Not only did this T.V. stop working within 2 months of purchasing it, but I received absolutely NO help from this company whatsoever. I shipped it to their facility with proper packaging, and it apparently got damaged during transit and even though absolutely NONE of this was my fault, I got nothing in return. I would have given this product 0 stars but it wasn't an option. Do yourself a favor and NEVER buy a Westinghouse T.V. It is cheap for a reason.", "Date": "April 13, 2012"}, {"Title": "Very disappointed", "Author": "Suz", "ReviewID": "R2WUN9XOFS5QUU", "Overall": "1.0", "Content": "Dont like anything about this set.My big old Panasonic is much better.I just got because of the price and that it would take up less room.And I thought I would like it better than my old one.The picture is a little blury,color not good.Screws for the base were not included.I would not recomend to anyone.I don't understand why so many good reviews.", "Date": "March 14, 2012"}, {"Title": "Great value", "Author": "tarun45 \"tarun45\"", "ReviewID": "R55DU8MBRUPLR", "Overall": "4.0", "Content": "Getting an LED TV of this size for this price is almost unheard of. This is definitely a great deal. The only downside is that the resolution is 720p and not 1080p but given the size of the screen that is not an issue at all. Would recommend", "Date": "November 22, 2011"}, {"Title": "Fine for HD, poor for SD", "Author": "ReDVsion", "ReviewID": "R3MCK8GWWGO9PU", "Overall": "3.0", "Content": "Yes, the sound is terrible. I'd be surprised if you could find any television at this price point, especially a slim form factor LED-backlit one, that has anything close to decent. If you care about sound quality, I don't think you'll be sticking with any television's stock speakers, anyway. There are always concessions to be made in buying an LED TV this size for this price, this one simply didn't match up with my own needs.The picture quality for HD is good, I didn't have any noticeable ghosting issues and colors were fairly vibrant. Were I to be using this with HD channels only, or hooking it up to a computer or gaming console, I think I'd be fairly satisfied with the picture.The main issue I returned this unit was the lack of a feature I never thought I'd see missing: any sort of zoom function for standard-definition TV signals. I consider this a necessity with any high-definition set; I hate wasting most of the screen space almost as much as I hate distorting the picture by stretching it. Since most of the stations I use are standard-definition, it became a waste to pay for this size screen when I wasn't even using most of the screen real-estate.After buying another TV in the same price range, I have to say the Westinghouse did look and feel a bit cheap. The clear plastic / red accent on the front looks tacky, and the stand isn't particularly solid.", "Date": "July 21, 2011"}, {"Title": "Westinghouse Fan....disappointed", "Author": "Smanson", "ReviewID": "R2AYK6SFJUXP60", "Overall": "3.0", "Content": "I use westinghouse monitors and have had great success from them. I saw this TV at a bestbuy on closeout. The price (def. less than target and amazon) was just for that particular store and I jumped on the purchase after a quick smart phone review search.Setup and design is top notch for the price point. However, channel changing load up is slow to say the least and volume output is very suspect. I enjoy everything else about this TV, and if used as a monitor (with speaker attachments) I would be jumping for joy.Westinghouse should fix the channel load ups and the Volume output. In my opinion, a old Flat screen CRT with better channel load ups and volume output capability wins out. Which is sad....returning TV.", "Date": "May 28, 2011"}, {"Title": "Sound Horrid and customer service meh", "Author": "The Mom \"The Mom\"", "ReviewID": "R1ELL96M27OO1X", "Overall": "3.0", "Content": "Got this TV for a kid room.  I was hesitant due to the reviews on the sound and other issues but there were posts saying that you could resolve those issues with the firmware up date.  1 hour on hold with customer service to try to find out how fix the horrid sound to be told to just go to the web site.  Followed the directions on the website and the firmware will not update. Ended up having to get a sound bar.  Picture is good", "Date": "April 22, 2011"}, {"Title": "increible", "Author": "Zaida Machado", "ReviewID": "R1U4XYUCEHOO1Y", "Overall": "5.0", "Content": "Recomiendo  mucho  este  equipo  lo estoy  utilizando y me  parece  de  una  nitidez  extraordinaria y  no  pesa  nada  transportarlo, buenisimo", "Date": "March 24, 2011"}, {"Title": "Great slim tv!", "Author": "strainpain", "ReviewID": "R2RFUV2UPTTZYQ", "Overall": "5.0", "Content": "I purchased this tv after having 2 other westinghouse lcd tvs, and I am not dissppointed.  I read about the poor speakers, and that wasn't a concern for me because I'm using this as a computer monitor/tv that I am mounting to the wall and using computer speakers with it.  The picture is great, tv is incredibly light weight and looks great on my office wall.  Interface isn't high tech and speakers aren't great, but now I wish I would have bought the 42\" version.  Recommended!", "Date": "March 19, 2011"}, {"Title": "Good enough for the price", "Author": "Gewgaws", "ReviewID": "R330JSQKQX9Q16", "Overall": "3.0", "Content": "I picked up this TV on sale and with an Amazon gift card for a final price of about $150; an unbeatable and appropriate amount.  PROS: Super slim and lightweight.  Amazingly so.  You almost can't see it from the side.  Picture is bright and clear and smooth but see my \"Cons\".  Startup time is decent.  Locks onto signal quickly (I'm only using a single HDMI input).  Responds briskly to remote.  If claims are to be believed, it'll sip less electricity than a typical incandescent light bulb.  CONS: (this is only a \"Con\" if you're not wall-mounting it) it is REALLY lightweight.  I thought the box was empty when it arrived.  There's a hole in the base so you can screw it down onto whatever furniture you have it on, and you should use it.  With a really big screw.  The weight of the cables attaching it to power and video sources will pull it off balance.  A strong breeze will knock this thing over.  I worry about tuning to The Weather Channel because I'm afraid footage of hurricanes blowing through palm trees will be enough to send the TV crashing to the ground.  Moving on... The picture is great as long as you're directly perpendicular to it.  Picture quality drops off fast as you move off center, and I mean fast -- if three people are watching something, two of them can forget about seeing fully saturated colors.  Sound quality is terrible; tinny and piercing and unpleasant, but I gave \"Sound quality\" 2 stars because as bad as it is, you can hear it from two rooms away.  It's the opposite of the picture quality; instead of having a tiny little sweet spot, the full effect of the audio barrage grinds on any nerve in a full 360 degree circle and, like I said, through walls, even if the viewer sitting six to ten feet directly in front of it thinks the volume is modest.  Use external speakers.  SUMMARY: I'm looking forward to the energy savings over the giant CRT it replaced in my home.  For less than $200 this is actually an adequate 2nd TV, such as for a bedroom or office, as long as you have supplemental audio output.  For more than $200, size/weight and energy savings, not picture/sound quality, are likely your highest priority.", "Date": "February 23, 2011"}, {"Title": "Westinghouse Led Tv 32\"", "Author": "Harold Webb", "ReviewID": "R2PUDAJL2IPYAW", "Overall": "4.0", "Content": "My New Led Tv is working perfectly, nice slim design, fantastic picture, I use this with my desktop computer and the video is incredible, I am very happy with this TV....Excellent Price...", "Date": "February 19, 2011"}, {"Title": "Great TV + Saving Cash on Energy = 5-star", "Author": "WVUIra", "ReviewID": "R2FO0L91O9SA7K", "Overall": "5.0", "Content": "We are a family that doesn't watch mainstream TV, but we love our movies and DVDs from Netflix.  We ARE NOT gamers, nor to we put emphasis on High Def picture quality, but we play Nintendo Wii from time to time.  As long as we can see it and it's not blurry, we're good.  We had an old flat-screen from just before the panel TVs when they were still 200 pounds.  And that thing was using up some serious energy as well.  We moved and did not have room for it anymore.  So I thought it was time for a wall-mounted flat screen.  I couldn't believe my eyes when I saw the price, good reviews, and energy usage for this LED...couldn't pass it up.So far WE LOVE IT!Positives:  Picture quality seems great for all of our uses,  playing the Wii has been great, plugin/setup was a breeze, thin and light (takes up very little space), energy savings.Negatives:  No S-Video input (we are not up to HD technology yet, so we are not using HDMI cables and our DVD player doesn't use HDMI, so we used regular Video cable), sound quality VERY poor (however, this is not an issue since we did not expect good sound, and we have ours running through the home stereo anyway).", "Date": "February 14, 2011"}, {"Title": "Westinghouse LD3255VX", "Author": "nebster", "ReviewID": "R22OWGG2MKYKL3", "Overall": "4.0", "Content": "Initially for $300 this TV meets all my requirements. I use it in the kitchen; therefore, no issues with remote in a medium size room (less than 10 feet away from TV). Tuner tends to be slow when changing channels. Connected sound surround system to replace poor OEM audio. TV is too thin to produce good sound quality without supplemental speaker system. In my opinion, all HDTV's require additional audio to enhance the video.", "Date": "February 14, 2011"}, {"Title": "People are setting to high of standards for a cheap t.v.", "Author": "kk", "ReviewID": "R3G76PCJHSYEXH", "Overall": "5.0", "Content": "For the price of this LED, I love it. I have my cable hooked up through an HDMI cable and the picture is bright and crisp. The t.v. is also cery thin and light and very easy to wall mount. The only con to the product is that the sound qaulity isn't extremely great, but you can definintly live with it. We just bought this t.v. for the bedroom and I think it is perfect for what I needed and came at the perfect price.", "Date": "February 8, 2011"}, {"Title": "Good TV for the right Application.", "Author": "mongofrye", "ReviewID": "R39PAKQ351A9LF", "Overall": "4.0", "Content": "I needed a tv that Was extremely thin but didn't cost 500+ bucks.  this was  the only option, really.  Picture looks good but appears more washed out at wider viewing angles.This thing is light.  A good thing, but bad in the sense that it feels very flimsy.  the housing and construction feal very cheap. ONce its on the wall, none will notice.  could pose problem if you don't mount and instead use the tv stand.Also, i have experienced no problems with the remote.  i mostly use my cable box remote, but changing inputs and powering off and on work without a glitch. I bought mine from Costco, so could be a new batch?I haven't and will never use the tv sound, so i can't comment.Bottom line. If you need a slim tv to wall mount that will mostly be used on an external sound source.  this is a good choice. and wow, price can't be beat.If weight and depth are not an issue, i would go with a standard lcd.  better prices, and a little better picture.", "Date": "January 17, 2011"}, {"Title": "Short and sweet review", "Author": "Brian Kelley", "ReviewID": "R20FQYED5KSQQL", "Overall": "4.0", "Content": "I originally bought this because it was fairly cheap and better priced than some LCDTV's. The LED picture is great. Very vivid colors, and I couldn't ask for more.However, the one resounding and frustrating con this TV has is the lag in controls. I could be controlling the volume or channel and it's always a toss-up when it'll actually change. The lag in the input is almost 2 seconds.If you don't mind the laggy controls, but want a nice slim TV that looks good and uses less electricity, go for it.I've had it about 6 months so far, and give this TV a 4/5 rating based on value alone. It really is a decent buy for around $300.Update 1/25/11: The firmware update actually improved the response time for controls. It's much better now, but it still gets a 4/5 because of  the ugly remote and on-screen controls.", "Date": "January 15, 2011"}, {"Title": "Great tv but has some down falls", "Author": "Whowantstoknow", "ReviewID": "R2MKP0KBZ7189P", "Overall": "3.0", "Content": "this is my first flat screen tv and i love this thing the picture quality is way better than anything out there that i have seen.  It was a great deal for the price i got it at and would buy it again given the chance. The only two major complaints that i have about it is that the sound is not very good although i mostly use my surrond sound and the remote sometimes is a pain and does not work well but both of thos problems can be fixed with surround sound and a universal remote. so all in all a great tv for an even better price.", "Date": "December 29, 2010"}, {"Title": "Westinghouse NEEDS to get OUT of the TV business", "Author": "Ervin Rome", "ReviewID": "R3G3UGX46GGDRS", "Overall": "2.0", "Content": "I got one of these televisions from Best Buy. After hooking it up to cable the VIDEO was HORRENDOUS. The sound SUCKED also; Absolute CRAP! I returned it the next day. Westinghouse is better known for appliances. Televisions are out of there league. Save your money for a REAL tv such as a Vizio, Samsung or LG.", "Date": "December 14, 2010"}, {"Title": "Dont buy", "Author": "Christine E. Perry \"Xizzi\"", "ReviewID": "R1QT65EQSBH0V4", "Overall": "1.0", "Content": "Love the way the tv looks. The picture is no better than an lcd picture, as a matter of fact my lcd of same size had better picture.  The sound is just terrible. I wouldn't want this tv if I got it for free, you pretty much have to hook up external sound, but I haven't even bothered, I'll probably resell it on ebay.", "Date": "December 10, 2010"}, {"Title": "Not to shabby for the price", "Author": "CeeGee", "ReviewID": "R3IMQCR4MSCLND", "Overall": "4.0", "Content": "So here I am walking around the night of black friday at best buy when I see a sale for this LED tv for $379..I figured I could replace it since I have a 32 inch LCD from Insignia...I bought it took it home and set it up...Very easy...Not too much of a difference when it came to picture, but there was a difference in the vibrant colors and cliarity, nothing substantial...The sound is what really got me, considering it sounds like an AM alarm clock when it goes off. I have it set to have sound coming from my sound bar, so that's ok. Super light, very light weight, and saves a lot more space than my flat LCD...all in all, its not bad for the price, plus its an LED so you do get to play around with the brightness and colors to adjust to your liking. If you plan on using this without a soundbar, or connected to a stereo, don't get it! The sound will hardly get you past 7 feet, even when you adjust it (treble and bass). It seems like when you pass the 75% mark on the volume, it all of a sudden sounds a lot more clear and less muffled, which I thought was weird. Good picture though! Hope that helps! Enjoy!", "Date": "November 27, 2010"}, {"Title": "not good!", "Author": "Mr Matt", "ReviewID": "RKOOT60C1XROS", "Overall": "1.0", "Content": "Screen and unit are nice looking.I tried to overlook the sluggish channel changes (without cable box) and poor remote range over 10 feet, but I could not stand the poor sound.  Imaging listening to TV through a cheap alarm clock radio and you'll understand how flat and boxy the sound is.", "Date": "November 24, 2010"}, {"Title": "Great TV for the Price, bad sound and remote", "Author": "jwater7", "ReviewID": "R3KKBWH2212SR6", "Overall": "3.0", "Content": "Bought the TV at costco for $319, so far it has been good except for the sound (which I really don't mind because I have external speakers) and you can't use the remote control more than 5' away from the TV.  It sounds like this is a normal problem they are experiencing from the sound of the other reviews.  Changing channels also takes quite a while.  I'm considering returning it, but it's a hard decision since it's LED (and uses less watts) and the price is so good.", "Date": "November 5, 2010"}, {"Title": "Save Yourself", "Author": "Chemist", "ReviewID": "RQ20MSB7RAZWP", "Overall": "1.0", "Content": "This product is horrible. The picture looks faded and sometimes the picture blacks out. The sound is like listening to those old hand held radios.The remote control is of cheap quality and half the time does not work.  I tried to give the TV time to warm up and maybe work better with time.But the quality of the picture got worse. Sometimes the picture just freezes and I have to turn the TV off and hope the picture returns.Save yourself the hassle and disappointment.", "Date": "October 23, 2010"}, {"Title": "Great TV for the Price", "Author": "JT \"JT\"", "ReviewID": "R3OBCIRO1D6ME3", "Overall": "4.0", "Content": "There are several negative reviews on this display. Let me put my 2 cents:Amazon sells two identical TV's the only difference is that one ends with an AR in the model umber the other ends with VX. I initially ordered the VX model and it arrived very quickly, but one issue, there was something broken inside the unit. The reason was Amazons packaging, they stuck the manufacture box inside a slightly bigger box with no padding!!!! Called an got it replaced, only thing was they didn't have the VX model so they shipped me the AR model. Again identical except this one came in a different style Westinghouse box but this was more heavy duty with double padding to hold the TV firm. I called Westinghouse and they confirmed that the only difference between the models is the packaging and where they are sold. So if you are thinking of buying buy the AR model, my opinion.Now to the TV, this is a great LED panel for the price, lot of people have complained about the sound and it is valid, the sound is \"tinny\" but hey this is a small panel just attached 2.1 system for $30 and you are in good shape. The HD (720P) on this panel is superb almost as good as name brands like Samsung and Sony for a third of the cost. Now this is definitely not a IPS panel as colors do desaturate above a certain viewing angle. Again the thing to remember here is the price and second this is not a home theater system, its meant to be used in the bedroom or a small room. The firmware update does fix the subpar controller performance.Bottom line Fantastic TV for the Price. I would recommend it to anyone looking for a TV for the bedroom or dorm room.", "Date": "October 19, 2010"}, {"Title": "A Good Value", "Author": "W. Penners", "ReviewID": "R39MJ0PJEHO2U1", "Overall": "4.0", "Content": "This is a solid TV for the price.  The only drawback is you must use two remotes with DirecTV.", "Date": "October 18, 2010"}, {"Title": "Super Value..Picture quality great -- no problems so far!", "Author": "Early BW", "ReviewID": "R2UCNQKX6LZ4FW", "Overall": "5.0", "Content": "The second Westinghouse in 5 years - great products so far.  Expect much better brightness and color intensity if upgrading from an older fluorescent backlight unit. This model is a steal if had for anything under $350! I personally compared to every thing BestBuy had to offer as of 9/2010 - A to Z in the 26 to 32\" size bracket. This super slim LED model has the same issues ALL LED Slimline designs have to date.... which is... 1) they are so bright there is a narrow range before the burn on the whites. Colors are more intensely saturated and the screen should last far longer- so it's well worth it. 2)...the major complaint is true.. the slim dimensions just don't allow for a decent full range built in speaker -- so plan on adding external speakers. It's not a big deal. I just added a $25 2.1 stereo powered computer speaker system-- the TV has a preamp out jack which is controllable via the remote - the one problem with this plan is the internal speaker stays active - still, not a problem. It's tinny midrange output  will blend in with what ever external setup you have.  3) Lastly, the remote sensor is very weak. May be overcome by a stronger universal remote. Have not tried. Hasn't been a problem really. 4) To conclude, getting an LED TV, nicely sized 32\" at this price - I don't see who could complain. You would pay far more at even Walmart - and not even get LED technology. It's a winner for now!!", "Date": "October 11, 2010"}, {"Title": "Descent for the price", "Author": "M. Donnelly", "ReviewID": "R2E0C35WBFQE4K", "Overall": "4.0", "Content": "Descent for the priceNot great, not bad either.  I wish I spent (really more like \"had\") the 250-350 more to get a little better quality but this is a bedroom TV and services just fine.  No complaints.", "Date": "October 10, 2010"}, {"Title": "Not a heavy hitter brand, but wish I bought another!", "Author": "Howzer", "ReviewID": "R2Z178NEVJC3CV", "Overall": "4.0", "Content": "If your looking for a 32\" LED TV and not looking to break the bank, do yourself a favor and purchase this TV!  I did, and have been using it for my laptop monitor while I renovate my room.  Soon I'll move this into the bedroom.  I have been so happy with the picture that I have a feeling I'll get another soon.  You really can't beat the value this TV gives you.  It's supposed to use less energy than a 60w light bulb which is pretty cool!  It's amazingly thin, and light.  The speakers are tin can kickers which a 2.1 Altec Lansing system has easily resolved.  And standard def channels are NOT meant for this TV.  Otherwise, buy two!", "Date": "October 6, 2010"}, {"Title": "Do not buy", "Author": "mw", "ReviewID": "R1P7O9YWZCT7ZN", "Overall": "2.0", "Content": "Returned TV, sound was very poor & tinny. Could not get a code for cable remote that worked.  Remote only worked if standing in front of TV.", "Date": "October 4, 2010"}, {"Title": "Good Value", "Author": "Savalani Vishal", "ReviewID": "R22PGRL5UFYW5N", "Overall": "4.0", "Content": "I have read positive and negative reviews about this tv, but I took a risk and ordered it on Sept 10th. Paid the extra $3 and Amazon delivered it the following day. The item was packed properly.Installing the TV was pretty easy, as soon as I plugged in the cable, it searched all channels. The picture quality in HD is simply amazing, it's better than my 40\" Sony Bravia LCD. However, SD is pretty much bad quality compared to other TV's. You'd rather watch HD in this LED tv.The sound is not as good, but if you're a college student who need a TV for your room, then it's perfect.The remote is bad, as people have mentioned, you really need to be next to the TV in order to change the channel, but since I'm using it in my room I'm fine with it.The design is amazing, and it's slim; it's really an attractive TV.Here are my pros and cons:PROs : Design, HD picture, priceCons : SD picture, sound, remoteIf you're a college student, you should get this TV as it's great value for money. If you have more money to spend, go for a LED Samsung/LG.I'm happy with this product. Didn't have problems like others.", "Date": "September 27, 2010"}, {"Title": "Great TV for the money", "Author": "PS3 Fan", "ReviewID": "R1I6LP8VETWYHP", "Overall": "4.0", "Content": "Great picture with a good input source, don't judge picture quality on any new TV using cable. This TV truly shines with our XBOX360, PS3, and Direct TV. Remote is a bit slow, but everything this TV does is a bit slow. Sound is not great, but is fine for a small room. Knowing everything I know about this TV, I would still buy it again. I would have given it 5 stars if not for the sound and the delay in changing inputs and volume control. Still a great buy.", "Date": "September 23, 2010"}, {"Title": "Not worth the money", "Author": "Stephen S. Foote \"Stovetop\"", "ReviewID": "ROZ04X1GHKA1Y", "Overall": "2.0", "Content": "I bought this TV recently.  It was the one TV in the store that wasn't displaying the in store demo (should've taken the hint).  The LED technology was an really good appeal for the price range.  After having the TV setup for a week I was totally dissatisfied with my choice.  The regular ATSC tuner displayed the channels extremely poorly.  To the point that it was very frustrating to watch some of them.  Last night I went back to the store where I bought it and picked up a Samsung.  I plugged them both in and the Samsung blew it out of the water in terms of picture quality.  The speakers are also make a HUGE impact in quality with the Samsung.  My xbox360 looked amazing through the Westinghouse but it crashed twice while being hooked up to the TV.  This had never happened before and after the second crash the xbox no longer turns on.  I don't know if this is related to an electrical problem with the TV or if it was just dumb luck that it happened at the same time.  I wish I could check it out with the Samsung to compare but I know it will look better anyway.The one positive thing about the Westinghouse is that the tuner picked up more channels than the Samsung did with just cheap rabbit ears hooked up.  I'm going to invest in a better antenna and see if I can get the extra channels back.  It was about $70 price increase to upgrade to the Samsung and I think it's worth every penny.  I also saw a forum recently from an employee of a major electronics store chain, one that offers the best stuff you can buy who said that Westinghouse is one of the top brands returned to the store because of malfunctions.  Just something to consider.", "Date": "September 22, 2010"}, {"Title": "Fantastic Picture", "Author": "DuchessII \"DuchessII\"", "ReviewID": "R3HV2QCG4BN4HL", "Overall": "4.0", "Content": "After reading all of the reviews I decided to go ahead and purchase this TV (I had been holding out waiting for the 42\" to come down in price); The picture quality is unbelievable. I can't believe the contrast between it and the Westinghouce LCD that I bought a couple of years ago. It is brillant.However, my old Westinghouse sound quality is far superior to this one. When I walk from my livng room to my bedroom the difference in sound quality floors me. I can't believe how \"tinny\" any kind of music sounds (TV programs theme songs, etc) on this new TV. I tried adjusting the treble and the bass with no discernable difference. Since I am not a techy and have no \"surround sound\" system can anyone suggest settings that I can adjust to get rid of this \"tinny\" sound? The volume is not the problem, but I guess in singing it would be called the pitch that is the problem.", "Date": "September 2, 2010"}, {"Title": "Westinghouse 720P", "Author": "A.Q.Wracklesnackle", "ReviewID": "R14QRXFY7XZB87", "Overall": "5.0", "Content": "This is a bargain.  I needed a new tv for my motorhome and this one fits the bill.  It's slim, light and has low power usage.", "Date": "August 27, 2010"}, {"Title": "Quality + value = win", "Author": "Hometown Computers", "ReviewID": "R3NRCNLC0CG9J1", "Overall": "5.0", "Content": "The only shortcoming of this TV is the sound which is sounds much like it's coming out of a tin can.  A problem easily fixed by hooking up an external set of speakers.  I like the adapters that came included in the system.  One of which is a PC to RGB adapter.  Another is a 7mm to RCA adapter.  That is what's really handy to hook up those external speakers.  It doesn't matter what type of speakers you have, that adapter can help.  I only wish there was a 7mm m/f adapter as well but that's easy enough to get.Picture quality is excellent, which is what I was really looking for.  And the price makes it hard to beat.  Setup was easy enough, with a bit of construction to the base.  Just need a phillips head ready.I'm very happy with this purchase.", "Date": "August 24, 2010"}, {"Title": "Pleased", "Author": "Rick", "ReviewID": "R31TYNI1JERPEE", "Overall": "4.0", "Content": "I purchased this TV on Amazon for our bedroom after seeing it at our local Costco. What I love about it is the super slim profile and the excellent picture quality. My wife says the speakers are fine for a bedroom TV, but I'll admit that the sound sucks and now I'm looking for a sound-bar to accompany the TV. However, I still feel like this was an excellent purchase for me. I did not expect to find an LED TV in this price range.", "Date": "August 19, 2010"}, {"Title": "Good quality product", "Author": "Jose Alberto Lopez Lopez", "ReviewID": "R3PMQKALGMTUP5", "Overall": "5.0", "Content": "This is a good quality tv, it is easy to setup and it has good quality sound and picture.", "Date": "August 19, 2010"}, {"Title": "Hope you aren't expecting to hear what you're watching.", "Author": "Patrick F", "ReviewID": "RL4XYKNXXSH0H", "Overall": "4.0", "Content": "This tv is great. I was absolutely stunned at how thin and light the entire tv was. I installed it on the wall in minutes and it looks absolutely amazing. The picture blows you away as well. So sharp and such great black levels... something that's pretty important when it comes to gaming especially. So... the tv puts out an awesome image... but what about the sound? No sir. I think I'd rather listen to a baby scream in my ear for 9 hours straight than to use the built-in speakers. No matter what source you hook up to it, the speakers are horrible. But that's the price you pay to have such a thin chassis. So overall, this is a great purchase. It exceeds its value for the price. But I would suggest buying some  speakers along with it. Enjoy!", "Date": "August 14, 2010"}, {"Title": "VERY PLEASED", "Author": "MYSTERIOUS ME", "ReviewID": "R1D2CL41ADEDYJ", "Overall": "4.0", "Content": "I am very happy with my new Westinghouse 32-inch LED HDTV flat panel tv. The picture is great, so is the sound and the size and ease of installation make it a great addition to my room. Thanks Westinghouse.Westinghouse LD-3255VX 32-Inch 720p LED HDTV, Black", "Date": "August 9, 2010"}, {"Title": "32\" Westinghouse LED TV", "Author": "Jay", "ReviewID": "R2M4SXG8JJ7MU4", "Overall": "5.0", "Content": "Recently picked up the Westinghouse 32\" LED TV for the bedroom.  This TV is amazing!  The TV is super thin and the colors are amazing.  I was extremely surprised to see a LED TV for this price and decided to take a chance and was happy I did.  This is the perfect TV for a bedroom or for the kids heading to college.  Plenty of inputs allow you to hook up everything you'll need to connect.  Way to go Westinghouse!", "Date": "August 9, 2010"}, {"Title": "Looks pretty. Too bad it didn't turn on", "Author": "A_L", "ReviewID": "R2C4Z7QNCLNIMN", "Overall": "1.0", "Content": "It arrived much faster than expected. After I set it up, I went to turn in on. The screen remained black, however the little red LED light would turn on and off. I contacted tech support who promptly instructed me to ship it back. I went to a retail store the same night and bought a Phillips that was the same size for about $30 less (it was on sale). Needless to say, you get what you pay for. The name brands are more expensive for a reason.", "Date": "September 20, 2010"}, {"Title": "Poor Picture Quality", "Author": "Customer-pn", "ReviewID": "R2CLDFB4RI9W2C", "Overall": "1.0", "Content": "I bought the 46 inch (LC-4695) four days ago.  It contained a tv, power supply, stand and a huge 11 in x 17 in \"Quick Connect Guide\".  The guide says \"STOP DO NOT RETURN THIS TV TO THE STORE!\"  ... instead call 800-701-0680.I called the number to tell them about the 7 in wide by 4 in tall white spot at the top/left-center on the screen.  The person took my information and said an RMA specialist would call in 24 hours.  After waiting three days I called again.  The person could not find any reference to my previous call and took my info again.  The only thing you can do is keep calling the 800 number.  There is no other escalation path.  I was told there is no manager available to talk, I said I'd wait ... didn't matter.The Westinghouse LED TVs are the worst.  Now I understand why best buy does not have the Westinghouse TV on display with the quality merchandise.Mine is going back and I'll not be purchasing Westinghouse again.", "Date": "January 14, 2013"}, {"Title": "OUTSTANDING!!  Love it!  AAA+++", "Author": "Richard Warkenthien", "ReviewID": "R267RCIRBIXU88", "Overall": "5.0", "Content": "Shopping at Costco and discovered this gem for $239.99 in JUNE/2012.  Bought three and placed in 3 bedrooms. All of us are in love with these TV's. Super rich color and clarity. Only about 2\" thick if that!(unbelievable). If watching a game, you feel like you are at the stadium. My 8 year old daughter said she was thinking about her new TV all day at school. She came home and went into the bed to enjoy her new set. For the price I am still in shock. I also bought all way tilt swivel wall mounts on Amazon for only $25.00 each. Plus bought 15\" HDMI High Speed Premium Cables for only $5.99 ea. Amazon just keeps on giving. It's funny that Walmart claims to save the average family $2500.00 a year. Well if that's true Amazon and Costco have them beat by thousands!  Buy this TV an you will be extremely happy!  Have fun and enjoy!", "Date": "June 13, 2012"}, {"Title": "Don't waste your time...", "Author": "joe", "ReviewID": "R1EQBH9UPCPGHS", "Overall": "1.0", "Content": "TV died within 6 months of normal use.  Sent it back to be repaired/replaced over 6 weeks ago....still waiting.  Good thing I kept my old TV.  Spend an extra $100 and get a trusted brand.  My grandma has a TV from 1982 that still works perfectly after all these years.  It's 2012 and I've had 2 different TVs crap out on me less than 6 months after purchase.  WTF??", "Date": "May 22, 2012"}, {"Title": "NEVER BUY WESTINGHOUSE TV!!!!!!!!!!!!!", "Author": "J. A. M. ExportsImprts \"JAM ExImInc\"", "ReviewID": "R2C2UFDB2VUWS9", "Overall": "1.0", "Content": "NEVER BUY WESTINGHOUSE TV!!!!!!!!!!!!! I purchased this TV at Costco about 6 months ago.  Never have I had a problem with tvs in my past. Being that I would always go to a bigger better model, I would do away with my tvs, but not because I was having issues with them.  Barely had this tv 6 months and horizontal scrambling lines start to appear.  Starts with a couple, then more and more till the screen goes black.  Sound remains.  No it's not the cable, because if you unplug the cable the irritating lines are still there.  I called Westinghouse, they told me to contact Costco since I bought it there.  DON'T MAKE THE SAME MISTAKE I MADE, DO NOT, I REPEAT DO NOT EVER BUY ANY WESTINGHOUSE PRODUCT!!!!  Btw I only gave ONE star because you have to pick a minimum of one, otherwise I wouldn't even have given this tv a star.", "Date": "February 13, 2012"}, {"Title": "CRAPPY TVS", "Author": "Mitchikoko", "ReviewID": "R2OMKPV8ODWQQW", "Overall": "1.0", "Content": "I bought a 42 inch tv from Westinghouse. After a month, it stopped working. Called the customer service and they sent the technician in our house after a week. The technician wasnt able to fix the problem so they want to replace the product but took them more than 30 days and still they couldnt find a replacement. So I asked for a refund and until not it has been 6 weeks and my refund is not yet here...I am very disappointed with how they handle my case and the long wait without a tv. Please dont buy any product from this company. They suck!", "Date": "January 25, 2012"}, {"Title": "bad sound but great screen for the bucks!", "Author": "cali086", "ReviewID": "R3JXDJDWRHJ4EC", "Overall": "5.0", "Content": "everyone knows the sound is really bad. like an old tv. but it has SRS for audio out so if you use a Home theater or any decent sound system, it has a great sound thanks to SRS! just turn the inner speakers off. the screen is led and works great, good quality and supports 1080p! it takes more than normal to switch between chanels, but for me thats not a problem cus i use it for my xbox 360 and HD movies with my hi-end laptop.so in conclution. if oyu are gonna use this with no aditional speakers, and for watching tv chanels, better look for another tv. but if you are gonna use it for gaming, watch HD movies, blue ray, xbox, ps3 etc... and have a soudn system, this is a great deal for you!", "Date": "May 17, 2011"}, {"Title": "Sound and remote were poor", "Author": "T. Vokaty", "ReviewID": "R1NH3OJENLELPH", "Overall": "2.0", "Content": "I was very excited to buy an LED TV this cheap. Unfortunately, the cheapness made it not worth it for me. No matter how hard I tried the sound was hollow. An attempt to raise the bass made a mediocre improvement and when attaching to a stereo the poor quality transferred there as well.The remote felt cheap and seemed very directional. The options it has are at the bare minimum.As much as I wanted to like this TV I returned it. I bought an LCD model of a different brand for the same amount of money and am much happier! In fact, before deciding which to keep I had them side by side. Video was comparable w/both. Actually liked the LCD picture better because I could control the black levels more. Hands down, the LCD audio was WAY better!Bottom line, don't buy just because it's LED. And, you get what you pay for.", "Date": "December 21, 2010"}, {"Title": "Horrible TV Horrible Company", "Author": "Mr. Michael S. Kelly \"Mike in NJ\"", "ReviewID": "R1S04AHBARQG4X", "Overall": "1.0", "Content": "First off you need to know that if you have a bluray player made by anyone else (especially Panasonic like me) you can expect the HDMI connection will not work. Dont expect HD level watching via cable or movies. They make these tvs but there are no software updates and they move onto the next shiny thing on the market. Dont expect them to help you at customer service either. I feel sorry for these CS reps as they must have to suffer listening to former consumers like me being angry & frustrated. Not to mention the fact that we voice our regret over purchasing the damn thing. \"We're so sorry you feel that way\" is all you will get from them. Don't forget you get what you pay for. I got mine pretty cheaply and of course 'caveat emptor'.DON'T BUY A WESTINGHOUSE TV EVER!! Go with one of the better names. I know my next one will be.", "Date": "December 11, 2010"}, {"Title": "Slim, inexpensive, entry-level LED HDTV", "Author": "Sal", "ReviewID": "R1R4FDVJA97T5R", "Overall": "3.0", "Content": "Pros:-Size and weight: Very slim and weighs under 15 lbs.-HDMI x2-LED lit (Westinghouse says it uses 52 watts max which is great when compared to other 32\" 720p LCD such as Toshiba's, LG's and Samsung which all drain 80-100+ watts - searching for the other manufacturers power consumption specs was very hard)-Price (find me another LED TV at this price range)Cons:-No component (would have liked a component connection even if I had to sacrifice one HDMI port. This is the sole reason preventing me from buying this TV. I wanted to be able to hook up my Nintendo Wii with component cables)-Not the best picture and only 720p-Have had and heard lots of negative experiences with Westinghouse's customer service.", "Date": "August 14, 2010"}, {"Title": "Westinghouse Warranty Scam", "Author": "Another sucker", "ReviewID": "RT9P05ZGFC1K9", "Overall": "1.0", "Content": "This TV and all other Westinghouse LCD tvs are at rock bottom prices everywhere because they die before the 1-year warranty is over.  Do not waste your money.  It is not a deal.  For more info:[...]", "Date": "October 16, 2010"}, {"Title": "westinghouse ld platinum screen 32 inch", "Author": "new tv", "ReviewID": "RE24AWPDF22S5", "Overall": "5.0", "Content": "I love my tv I have only had it about 20 days, but it is perfect.  The volume is great, the picture quality is great.", "Date": "March 15, 2012"}, {"Title": "Do not purchase !!!!!", "Author": "dianna", "ReviewID": "R1KMJTVGGY46BC", "Overall": "1.0", "Content": "Used this tv for 1 week only watching it 3 times. It wouldnt come on and westington house will not honor warranty so do not purchase these, not only that but we bought two of these for both kids, recieved 1 already not working so sent it back now this one is a waist of our hard earned 329.00 ......", "Date": "December 9, 2011"}, {"Title": "Nice television but horrendous setup instructions", "Author": "Dr. Michael A. Rinella", "ReviewID": "R3H5GYCBDKSV9M", "Overall": "4.0", "Content": "I recently purchased the 37\" version of this same unit.  Setup ought to have been a breeze but the instruction booklet was semi-useless.  There are 12 installations screws, six each of two distinctly different sizes and types.  Six attach the stand to the base, and the stand to the screen.  The setup book does not distinguish between them at all.  There is no part manifest so you can figure out which is which.  Just two tiny, tiny diagrams that tell you nothing.  It was pure guesswork.  Then, I accidently chose a wrong setting in the \"setup wizard\" and as a result got \"no signal\".  The booklet again is totally useless in telling you how to get back into the setup wizard.  It took much trial and error before I finally found the button(s) that worked.  The on-line version is essentially a PDF of the same useless text, but in color (!).  Hardly helpful.", "Date": "October 2, 2011"}, {"Title": "Customer service rude...", "Author": "Anonymous", "ReviewID": "R3XT66JZ9LT6M", "Overall": "2.0", "Content": "Do not expect much help from the customer support. They are rude and they try to evade the issue.The only reason I considered keeping this TV is because I brought it from Costco and they provide warranty.", "Date": "January 9, 2011"}, {"Title": "WASTE OF YOUR MONEY!!!", "Author": "Vinston Smithen", "ReviewID": "R2U50768VB08U3", "Overall": "1.0", "Content": "PEOPLE DON'T BUY THIS TV!!! I GOT MINE YESTERDAY, IT ONLY WORKED FOR ABOUT 15MINS. IN THE 15MINS THAT THE TV WORKED I WAS NOT IMPRESSED. THE COLORS WERE NOT CRISP AND THE PICTURES WERE CONSTANTLY FREEZING UP ON ME.I TURNED IT OFF AND ON, THAT WAS THE END OF THE TV. I HAVE NEVER SEEN SUCH CHEEP MERCHANDISE! I READ THE OTHER REVIEWS PEOPLE ARE HAVING SIMILAR PROBLEMS. IF YOU WANT TO TAKE A GAMBLE FINE BUT I LOST ON MINE. IF I WERE YOU I WOULD GET A DIFFERENT BRAND. I AM SENDING MINE BACK TO AMAZON", "Date": "September 11, 2010"}, {"Title": "Great TV for the Price", "Author": "Ryan", "ReviewID": "RKJL7RC32VUSR", "Overall": "4.0", "Content": "TV looks good so far, only had it for 3 days though... Cant complain for the price", "Date": "August 12, 2010"}, {"Title": "Amazing... for 2 hours... Do not buy!!!", "Author": "Duncan White", "ReviewID": "R1WE80WULO9AD", "Overall": "1.0", "Content": "I bought this television seeking to save $80, rather than buying the comprable sony 32\". Brought it home and set it up, worked well with my cable and xbox but about 2 hours after I started to use it the screen would freeze and glitch.Pros:-Sharp HD-Thin and lightCons:-Poor sound quality-about 30% of these will quit working within a day or twoInvest your money well, buy a sony or panasonic!!", "Date": "September 7, 2010"}, {"Title": "Sending it back", "Author": "PcTeCh805", "ReviewID": "R17OLGCL3730VP", "Overall": "1.0", "Content": "The first time I turned it on there was no picture on the screen. After many times of turning it on and off it finally worked. I must have used it for a few hours and then the screen would shut off by itself so I would turn it off and on until the picture would come on again. A couple hours after that I couldn't do anything to make it work so I unplugged it and put it back in the box. I would have given it 3 or 4 stars if it would have worked.", "Date": "September 7, 2010"}, {"Title": "Picture quality is nothing to brag about, however, size makes up for it", "Author": "Jonny", "ReviewID": "R367WHICAR0E2J", "Overall": "4.0", "Content": "This HDTV is a quality product, I am in love with the slim design, how light it is, and the price per inch ratio at about $11 per inch; which you simply cant find anywhere else at this price range.  The fact that this HDTV has very low power consumption is absolutely awesomazing, but doesn't have any noticeable impact yet.The quality of the picture itself through HDMI is good, however, not superb.  The only things I have to compare it to are 32\" LCD HDTV's, 42\" LCD HDTV's, and a 42\" Plasma HDTV.  Its picture is better than the 32\" and 42\" LCD HDTV's in my household from varying brands, AOC, Samsung and Digital Lifestyles, however the picture quality is not as good as my plasma, as to be expected, the plasma was 4 times the price.My first LED HDTV (or semi-LED) did not break the bank and is functionally and aesthetically magnificent, might buy 3 more.To sum it up;PROS:Picture quality better than normal LCD HDTV'sVery low priceCONS:Somewhat small screen real estate for my tastesPicture quality is not better or equal to PlasmaIsn't a 72\"DOES NOT Allow selection of audio input for hdmi, your audio MUST be coming from HDMI in order to hear it on the HDTV while viewing hdmi video.  So if you're running an Nvidia graphics card with hdmi output, you're in luck, go in your Nvidia control  panel and set your audio to output from your card.", "Date": "August 9, 2010"}, {"Title": "Remote control has problem", "Author": "Tvnewact \"atvrseqvrs\"", "ReviewID": "R2M3OGRE9K338R", "Overall": "3.0", "Content": "You have really close to the TV, within 5 ft, otherwise the Remote could not control it. also could not turn it on/off.", "Date": "September 14, 2011"}, {"Title": "OK TV.", "Author": "Citris1", "ReviewID": "R1LH2RSLM8LN89", "Overall": "3.0", "Content": "I bought a similar Westinghouse TV at a local big box store. TV works OK but the remote control doesn't work at all. Called Westinghouse customer service. They didn't have a replacement remote for that model. Told me to take it back to the store.I managed to get the remote working. The set works fine.", "Date": "June 21, 2011"}, {"Title": "Is this your 1st? Then you're missing out.", "Author": "Tunnelboy", "ReviewID": "R1GE6PUPIZBL1M", "Overall": "2.0", "Content": "Our family has a 42\" Panasonic plasma that is just amazing. Extremely rich colors and contrasts. It's beautiful. I sell products at trade shows across the country, so I bought myself a Visio 32\" LCD. The picture quality is nothing close to the plasma, but it was certainly adequate and much lighter (in weight) than the plasma so it was perfect for hauling around the country. I wanted to get another display for the trade shows and settled on this one. I love how thin it is! And the fact that the LCD is LED backlit makes it a huge energy saver. I plugged in my \"Kill-a-Watt\" and it came in at 51 watts. Amazing!But sadly I'm going to return it. The picture quality is just awful. I've spent a few days with it connected to our Directv HD, and also ran a few Blurays on it. It's just a sub-par picture. I've even set up all 3 of our HD's side by side and quickly plugged a signal into each, and the difference was easily evident between all 3.What really perplexes me, and I didn't realize it until I got home, the box says 1080p, 1080i, 720p, but the resolution says 1366x768. I had thought the definition of 1080 was the vertical resolution (i.e. 1920x1080). When I click the \"info\" button on the remote (which is crappy too... tiny buttons, tiny lettering), it says 1080p. But here's the kicker.... everywhere I look and punch in this model LD-3255VX, it shows it as a 720p model. On the support website it says 1080p.But the bottom line is the picture is poor. If it's you're first dive into HD, you might think it's great. But you're missing out on some pretty spectacular jaw-dropping hi-def. You're just not going to get it here sad to say.", "Date": "November 17, 2010"}, {"Title": "No Power", "Author": "rusluc", "ReviewID": "R1LDAALNO73YPZ", "Overall": "1.0", "Content": "3rd straight bad review. Can not tell you about picture, sound quality, etc., it never powered up. RMA'd immediately to Amazon.", "Date": "September 8, 2010"}, {"Title": "Worked for a hour....", "Author": "rick", "ReviewID": "R1X0X80YLI3MPJ", "Overall": "1.0", "Content": "I finaly recieved my tv yesterday but after a hour of use it quit on me. I was playing my 360 through HDMI and then all of sudden the screen blacked out and I couldn't get an image regardless of what I did.... I am very disappointed to say the least and I recommend getting a smaller set for a cheaper price and that is a different brand or buy the known brand and pay the extra cost. Overall save the hassle and don't buy the Westinghouse brand. By the way before my \"TV\" went out there was a lot of static when I was playing Xbox 360.", "Date": "August 3, 2010"}, {"Title": "Junk.  It stopped working after 4 hours use. DO NOT BUY WESTINGHOUSE EVER!!!!!", "Author": "Timothy B. Holt \"Go into the western sea\"", "ReviewID": "R1A91V78WROYMI", "Overall": "1.0", "Content": "I thought it great for 4 hours.  So it was functional in a normal environment of DVD and DTV use for 4 hours. Then it made some horrible noice during one TV broadcast the first night I had it.  I could not shut it down with the remote and had to pull the plug.  It came back up and was fine and even played a DVD. It did not do anything with a USB flash drive despite haveing a port.  The next day after I first got it, it started to play a DTV station and was fine, but started to make loud statacco noises and froze failing to respond to the remote again.  I repowered and it soon failed again. This time it showed grey and white bars on the screen. And the next repower it did nothing but show the \"Westinghouse\" logo for a few seconds.  I beleive that this is a junk and has had no quality control. Plainly it can play DVD and Digital TV but if it fails in 24 hours in a normal home situation (one HDTV input and digital antenna) showing highly distorted audio before dying, it is not something anybody quality controlled on USA soil.  Westinghouse, you must be purely a brand name worth nothing now. THey have sold their brand to folks with no quality control.  Amazon should be ashamed to sell it and I will forget the brand name I knew and bury Westinghouse for dead and forever.", "Date": "September 2, 2010"}, {"Title": "Not so much", "Author": "Christian", "ReviewID": "R1HJ86OHRJX91G", "Overall": "2.0", "Content": "This TV has the capability to look into the future!  The screen initiates some sort of time vortex in 5-10 seconds after turning it on.  At first I was scared, I felt my heart beating faster and faster, my blood pressure rising, my head heating up.  I couldn't handle this tiny machine's supernatural powers! I would turn it off right before it sucked me into its demonical wormhole plans.  But, right before I turned it off, the tv would whisper what would happen next on whatever channel it was on.LITERAL TERMSThe damn tv's screen would freeze me.  You can hear whats going on, if you're on a channel, but the image would be frozen.", "Date": "August 2, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "720p LED HDTV\nSlim - 1.0\" edge design and feather light 14.6 pounds\nEco - Energy Star 5.0 compliant, uses 10% less energy than a 60 watt light bulb\nVivid color - 100,000:1 contrast ratio, 22% increased color gamut\nNo Mercury, No lead, recycled/recyclable packaging printed with soy-based inks", "Name": "Westinghouse LD-3255VX 32-Inch 720p LED HDTV, Black (2010 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/3178NzuPmPL._SX300_.jpg", "ProductID": "B003SZRWBO"}}