{"Reviews": [{"Title": "excellent value", "Author": "Informed Shopper \"hal2007\"", "ReviewID": "R2MMWKTAH73AKL", "Overall": "5.0", "Content": "This Sony was sold to me directly from Sony in exchange for a 5 year old 60\" Sony that had an 'optic block' problem that would require an expensive fix.  Sony had been repairing this problem for free but I had no way to know that until mine went bad and then talking to Sony they had switched to an exchange program where the customer would pay about slightly less than half the retail price.  If you have a slightly older Sony that is putting either a blue color on the screen or a green one you might start directly with the Sony Style website and contact their support help to see what they may offer you.  On one hand I was very sad to see my 5 year Sony develop a problem but on the other hand I have to give Sony credit for standing up to the known problem.The largest TV offered in the exchange program was this 55\" model or I certainly would have gone for the 60\" because I prefer that size.  That said this model has a better and more vibrant picture than my older Sony which was a premium model that I had paid over $4,000 for. So the bottom line for me is that this new Sony has a better picture for less than the old one even if you pay retail.  My old Sony weighed 113lbs and this new one is around 65lbs so it is easier to handle.  The remote is better and more intuitive.  We watch this in a very bright room filled with natural sunlight during the day and this TV handles that very well with no glare.  The speakers are nothing to write home about and probably not as good as my old Sony but we tend to watch movies with the sound coming from a quality sound system anyway.  My old Sony was 1080i and this one is full 1080p which is an excellent picture.  We get our signal from Dish Net which broadcasts almost exclusively in 1080i anyway.  For movies we use a Samsung Blu-Ray player which works beautifully with this TV.  In fact there is a type of automatic setting that the Samsung and the Sony have where when you turn on the Samsung the TV also turns on and then goes directly to the input from the Samsung.  Very cool.  Truthfully I can barely tell the difference from a good blu-ray picture and a good standard DVD. We tend to use Netflix a lot and always order Blu-Ray when available.I thought the set up was easy and the available HDMI connections are excellent as my old Sony only had two HDMI inputs and this one has 4.  We actually use all 4 with a DVD recorder, Dish Net, HD camcorder, and the blu-ray.I would have no problem recommending this Sony LCD TV and in fact when I looked in the stores I thought the new LED LCDs seemed a little too bright.  I do miss the 60\" size but everyone who has looked at this picture has been in the 'wow' camp with it.", "Date": "March 4, 2010"}, {"Title": "This is a beautiful set!", "Author": "Arthur Carter", "ReviewID": "R3LPK2MX5BALPS", "Overall": "5.0", "Content": "Had been looking for a new tv for a little while to upgrade from my 6 year old Mitsubishi Rear Projection 48\" HDTV. Was trying to decide between Sony, Samsung, Panasonic, LG, and Vizio, and also LCD or Plasma. Did extensive research and decided LCD was the way to go for us. We had decided on a last years model Sony 52\", but then it was sold before we got ready to get it. Thank goodness it did! Went back to Costco and found this beautiful new 2010 model Sony 55' LCD KDL-55EX501(costco's model is 501, whereas other stores carry the 500-same tv, even lists it in the instruction manual that way). This tv is so sharp and beautiful! The colors are rich and vibrant, and that was out of the box without adjusting any settings yet!Fine tuning made it even better. Has the Bravia engine 2 and that really makes it look sharp. 120hz processing, and i really dont even see anything wrong with motion scenes. Black sure looks black to me on this set, which is an issue with lcd tv's. Most stores don't carry the set yet as it was just released the first week of Feb. Can't beat Costco though, at this time its [...] and the offer not only the standard warranty on all electronics, but on this model tv, right on the box it states is has a 3 year warranty! Paperwork inside confirmed this! Lots of settings and adjustments can be made as well. Does 1080/24p very nicely. If you can get one, i would really recommend it, you wont be disappointed.", "Date": "February 13, 2010"}, {"Title": "Excellent picture, works great with gaming, low price.", "Author": "ijcast", "ReviewID": "R39MXT81IB0HUL", "Overall": "4.0", "Content": "As a mid-level LCD TV, the KDL55EX500 is simply a stunning bargain for what you get. And despite the fact that it doesn't use LED technology, it's still has excellent picture quality.This is a standard LCD TV. Despite this, it has picture quality that rivals many of its LED competitors. I've found that after visiting several stores that many LED-based sets have restricted viewing angles (often getting washed out easily if you move away from center). Also, if you've ever done research on various tech sites, you would find some people complaining about how their LED TVs have uniformity issues, and/or light-bleed from the edges of the screen. Lastly and most important to me, most of the LED TVs that I liked seemed to have significant input lag. Input lag is a slight delay of the video displayed on the TV. All LCD TVs suffer from at least a small amount of input lag, but it seemed all the LED TVs I liked (mostly Samsungs) had a significant amount of it. (Input lag is not rated on most TVs. But on PC monitors input lag often rated as \"latency\" and measured in milliseconds or \"ms\".) And since I like to play Gran Turismo 5 on my PS3 a lot, input lag was a concern for me. My previous TV had a lot of input lag (a Samsung) and it made playing Gran Turismo 5 impossible. I had to resort to playing the game on my PC monitor - it was that bad. (Note: I know a lot of TVs now boast of 120hz, or 240hz motion processing. This does not address input lag. Input lag is a seperate problem.)So after doing a bit of research (reading up on owner's forums of various TVs), I narrowed it down to the KDL55EX500 and the KDL55EX710 - both from Sony. (I really liked the Samsungs, but as I said before, the owners forums swayed me away from them due to quality issues and input lag.) There is about a $700 difference in price of these two TVs because the EX710 series uses the newer LED technology. Seeing them both side-by-side at a local store, it was really hard to see a difference. The EX710 model looked a bit sharper, but the difference was really hard to discern. I couldn't justify paying another $700 for the EX710. Yea, the EX710 is a lot thinner, and consumes less energy, but I don't care about that (gasp!). I just want a good picture for a good price - and the EX500 had both of those things. (When I asked if they had any of the EX500 in stock at that store, the salesman said they did not - which didn't surprise me.)I will admit that the EX500 series does not have the best picture quality I have seen. The best I think are the upper tier Samsungs (UN558000XF is amazing looking when you see it in person). But after owning a Samsung and having it die on me after only 4-years I'll stick with Sony - who seem to have a better quality track record regarding TVs. (I still own a 12-year-old Sony TV that works perfectly). The picture quality on the KDL55EX500 is still nothing to laugh about. It is simply beautiful. It's sharp, vibrant, and bright. My only gripe is that flesh tones on my older Samsung seemed to look better and smoother, not sure why - but it's true. But that's a minor complaint in an otherwise excellent-looking TV.This TV is great with games. I could not discern any sort of input lag at all on standard settings. Sony, however added a \"game mode\" where it supposedly increases response time from the TV. To be honest, the difference is minute, but I like that it's there. If you're a gamer and want decent response time from your TV with minimal input lag - the KDL55EX500 won't disappoint.", "Date": "January 17, 2011"}, {"Title": "Good picture on angle", "Author": "D. Palm \"Palm\"", "ReviewID": "R1KZPWYMNPSTXL", "Overall": "4.0", "Content": "Just bought this TV from the big blue box store for $1700.  Tweaked the settings a little while watching some of my reference material, but out of the box settings were pretty good.I got this set because:1) I think LED is a little over-hyped2) I was unable to discern any difference at the store between the Bravia 2 and the new Bravia 3 engine (in fact a friend who works in AV confided in me that there probably is no difference)3) The glare from the glossy finish of the Samsung and Sharp sets were very distracting to meI'm very impressed with the way this TV handles video material.  Blu-ray is perfect.  Playstation 3 looks awesome (made for each other?).DVD (upscaled) looks very very good also.  HD cable varies depending on source but overall very sharp.  Lower grade sources look pretty good also.  I was worried that going from a 47 in. (Philips) to a larger screen would make lower grade sources look really bad, but the Sony's Bravia engine really smooths things out and makes it look very good.  Better in fact than the 47 in. Philips!So far the biggest problem I have noticed is that the set looks very washed out when viewed from off angle.  20-30 degrees off of center and you can really notice a loss of depth to colors and black levels.Overall, I think I will be very happy with this set.  I would have given it 5 stars if it looked better from the side.Hope yo ufind this info helpful.", "Date": "June 24, 2010"}, {"Title": "Very Happy with this TV", "Author": "Sean \"Sean\"", "ReviewID": "R2LZCN2Y8WRZ13", "Overall": "5.0", "Content": "I had the same experience as the other reviewer with a 5 year old 60 inch rear projection Sony TV that developed a blue blob on the screen. I was none too happy when Sony put me on hold after telling me my [...] TV was out of warranty. When they came back on and offered me this TV for less than half the retail price I was OK with that result.Now that I've had the TV for a couple of months I'm thrilled with it. It doesn't have all the bells + whistles/internet connectivity of other models but I love the picture. It's a great value even at list price and I'll get all those bells + whistles with my new Blu-ray player anyway.Nothing bad to say about this TV.", "Date": "May 1, 2010"}, {"Title": "Great Picture, Big Size, Reasonably Priced", "Author": "Brett Petersen", "ReviewID": "RDCS3VTKL0A6Q", "Overall": "4.0", "Content": "I was in the market for a reasonably priced TV with a great picture and big size, and little else factored into my decision. After months of research I came across this TV and now that I've owned it for a couple of months, I must say that I love it.It's lacking Internet connectivity so no Netflix streaming directly through the TV, no yahoo gadgets to play with, and no other specialized content available like there is on higher end TVs. If this makes no difference to you, as is the case with me (I use my PS3 if I want those bonuses), then this TV may be up your alley.The main pro of this TV is the superb picture and the size. The size speaks for itself. Blu-Ray looks ridiculously good, video games on my PS3 are perfect (no input lag that I can detect either- which is a huge plus for me because I play a great deal of online FPS games that require quick twitch reactions), and watching sports or a movie on cable is great even though cable is usually broadcast in 1080i. Standard definition channels look like crap though, so make sure to upgrade your cable to high def.Other pros: Better than expected sound (although I would recommend investing in a sound system), a great number of inputs, it's energy efficient, and you have the choice between 60hz and 120hz.If you do make the purchase I have some suggestions. When it comes to the motion flow feature, which when on displays the picture in 120hz, I recommend using it on high for when you watch sports or when you're playing video games (by the way, to you gamers out there, do not play video games using the game scene option- it turns off the motion flow so you're going to see too much motion blur, especially in faster paced games, and the scene mode makes no difference when it comes to input lag). Otherwise, unless you like the soap opera effect that to me makes human movement on the screen look unnatural and makes movies in particular bizarre looking, put motion flow on standard or turn it off all together. I would use the Standard Picture Mode instead of Vivid, but if you want to customize further you can choose Custom if you wish. Beyond that, spend some time tweaking the settings even if you're not a techie so you get a picture that looks right to you, it can make a difference in my opinion but it really comes down to how anal you are about picture quality.Good luck shopping.", "Date": "July 18, 2010"}, {"Title": "Wonderful TV !", "Author": "Skipster \"I'm just saying ...\"", "ReviewID": "R36X3DJUM970BK", "Overall": "4.0", "Content": "Quite possibly the best bang for your buck when it comes to TV's , especially HDTV's ! The brightness and depth of the picture is incredible . The flexibility of it's useage is impressive . The cost for a reputable , name brand tv is easily among the best i've found . The sound is fair or better but when coupled with a Home Theater or external system it's great and very dynamic . 3 months into ownership and i have no complaints what so ever ...", "Date": "December 16, 2010"}, {"Title": "Great TV for the price.", "Author": "Wen-chun Cheng", "ReviewID": "R1AL0SHMP3ZSLK", "Overall": "5.0", "Content": "This is a great basic TV with excellent picture quality, and easy to setup. And the matte screen make it much easier to watch during the day as well as night where my room has several windows which reflect light.It doesn't have internet which is a plus for me from the price point of view because I am connecting it with a Sony vaio laptop with Blu-Ray via HDMI, which works great.", "Date": "December 27, 2010"}, {"Title": "Love it", "Author": "Kevin S. Epps", "ReviewID": "R1AP512JNBDPQ3", "Overall": "5.0", "Content": "After searching for my first 'big screen' for months, I ran across the Sony.  I was actually looking at a 50\" LG plasma when I spotted the Sony.  I was leaning towards the plasma until I saw the two units sitting side by side with the same programing.  The difference was amazing.  I knew immmediately that I would be taking home the Sony.I worked with the owner/salesman for a bit, going over the settings and such. I was worried that the picture in my home wouldn't be as nice as in the store.  He assured me that as soon as I turned it on (after the self-progaming mode was finished) the picture would look just as good.  Wow, was he ever right.  I am VERY pleased with the unit.  I watch a lot of sports and action movies. I have not been let down.  Even before my HD Fios was in, the picture quality was amazing.  With the HD..well, I'm in heaven.The sound quality isn't the best.  The low end isn't really low end.  My Christmas present to myself this year will be a home theater sound system.  I'm sure that will just increase the awesomeness.", "Date": "November 29, 2010"}, {"Title": "Great TV for our budget", "Author": "K. Nguyen \"Kenny\"", "ReviewID": "R3N42W5S6V5ROR", "Overall": "4.0", "Content": "I looked at the Samsung 55C630 and this Sony 55ex500 at my local BestBuy and Wal-Mart for hours until I decided on the Sony. The Samsung has bright and sharper pictures on display but it also suffers a lot of glares. I spent time to read on AVS forum and I'm glad that I pick the Sony.", "Date": "December 8, 2010"}, {"Title": "Beautiful Picture", "Author": "TomP", "ReviewID": "R1M0H91R8Y749B", "Overall": "5.0", "Content": "I bought this TV to replace a high def 52inch DLP that went bad and I am very happy that I did.  My family room can be a challenge for watching TV, as we have \"sky light\" windows in the ceiling that provide glare during the day, and lofted, recessed lighting which provides inadequate light at night.  The light sensor in this set provides an amazing picture at any time of day and in any light condition...and NO glare.  The incredible detail when watching Blu-Ray and HD TV must be seen to be appreciated, and I feel like I am watching HD for the first time.  I am very satisfied with my purchase.", "Date": "September 1, 2010"}, {"Title": "Just purchased the Sony EX500", "Author": "Judy A. Harbaugh", "ReviewID": "R1XYICAIBF2AGE", "Overall": "4.0", "Content": "This TV replaces a Mitsubishi 55\" rear projection TV that we bought 3 1/2 years ago.  Really liked the Mits but right after the warrenty expired (@ 1 year....learned our lesson the expensive way about buying an extended warrenty!!)the infamous 'white stars' problem developed & flourished.  The cost of repair would have been $800+ so decided to ditch the projection TV & try a LCD one.  After several days of Internet searching, we decided on this Sony 55\" EX500 series TV. While we didn't buy this set through Amazon.com, we did get a very good price on it at our local BestBuy electronics store.  We also purchased their 4 year extended warrenty. The setup was easy, once we got it out of the box (most difficult part so that shows you how easy the rest of setup was). The picture was not ready to go for us out of the box as it has been reported by other reviews I had read.  We had to do quite a bit of adjusting.  Flesh tones still need a little more work.  We were comparing this picture to our deceased Mits DPL picture, which was excellent.  After our adjustments, I can say that we are pretty happy with the picture & color.  The HD is very nice.  No complaints there. The sound is fine.  We have external speakers that we will connect it up to when we want the movie effect.  Otherwise, for everyday viewing, the sound is fine for us.  The remote is great, easy to navigate & easy to use. This set has more inputs than our DPL which really makes my husband happy.  The shiny frame does not bother us. Matte screen is a must in our living room.  Overall, it is a nice looking TV. One thing that is a bit of a nuisance & hopefully not a long term problem, is the slight odor that this set emits (on or off).  We really noticed it when we walked into our living room where the TV is located this morning.  I had read on other reviews that there was an odor problem.  While it is not a problem for us humans (we get used to it & don't notice it as the day wears on), I am hoping it will not be a problem for our pets, especially our birds that share the living room with this new set.  Will call Sony tomorrow & see what they say about it.  Maybe it dissipates after a while?  The verdict is out on that for now.Bottom line:  This is a nice set for the price.  We did get to compare pictures & prices with other same size sets, different manufacturers, while at the store & still came home with the Sony EX500 55\".  Part of the decision being that we have had great luck with our other Sony products (VCR, 32\" LCD, Blu-Ray, CD player etc.) We are looking forward to a longer life with this set than we had with the Mits.", "Date": "April 17, 2011"}, {"Title": "Great Picture and Input offering", "Author": "Dylan's Dad", "ReviewID": "R1NNEJC85KG74R", "Overall": "5.0", "Content": "I've done countless hours of research for TV's, and it seems that everything changes with each year of new products coming out.  What I've come to realize is that it is very hard to compare models from brand to brand or even within the same brand.  What you have to do is figure out what type of inputs you need and what type of setting your TV will be in and go from there.With that being said, I have a well lit room with lots of windows and an open area with viewing from straight on and from both sides.  Each viewing seat is about 10-12 feet from the TV, and it is mounted to a wall (5 feet from bottom of TV to floor).  All of my components go through a receiver and surround sound system, so I don't use the built in TV speakers.  I've had this TV for over a year now.  The picture has been great, and it works perfectly with all of my components.  I've had absolutely no problems with the TV so far in regards to pixels going out or changes in tint, sharpness, or clarity.  Blu-Rays, video games, and HD channels with Direct TV all look great.I would recommend this TV if it is even still available to purchase.  I'm sure it would be much cheaper now than when I bought it.  If not, you can't go wrong with the Bravia TV's.  Just make sure you look at the number and types of inputs you need before purchasing.  There are usually 3-4 different models within the same size range that are the same TV except for inputs and other internet/wifi related add-ons.  For a main living room TV, that stuff might be important, but for a bedroom TV, you may not need all that stuff.", "Date": "November 9, 2011"}, {"Title": "Sony Bravia 55\" LCD TV", "Author": "Rich C", "ReviewID": "RFXTEPM4AW8KZ", "Overall": "5.0", "Content": "Delivery of our Sony Bravia 55\" LCD TV was quick, easy, and without any problems.  Installed TV in minutes.  Great picture and sound.  Have two other Sony Bravias at another home. Wouldn't purchase anything else at this point. Completely satisfied.  Getting great comments from guests as well.", "Date": "July 31, 2011"}, {"Title": "Dependable and Great Picture!", "Author": "J. Campbell \"Northwoods Artist\"", "ReviewID": "R3HYE857Z2XIMC", "Overall": "5.0", "Content": "We purchased a Sony 55 inch Bravia almost five years ago and we have not had any problems whatsoever!  The picture quality is great, good sound with and without extra amplification, nice controls, easy installation by myself, and it has been used a lot over the years.  We highly recommend it!", "Date": "October 15, 2011"}, {"Title": "great picture clarity, nice frame around the LCD", "Author": "Mikel", "ReviewID": "R9YI4PIB0NF2M", "Overall": "5.0", "Content": "Sony makes a great product in 99% of the times I have purchased from them. I would like to point out a very important fact about LCD TVs. The border makes a huge difference. I didn't notice this until I went into the store. This border is not super reflective like some of the other brands. The picture quality is what you would expect from Sony: awesome. And I will be buying another one for my bedroom.", "Date": "October 2, 2011"}, {"Title": "Great TV", "Author": "GT", "ReviewID": "R1FBJGEMN2ADMV", "Overall": "5.0", "Content": "I bought a Samsung DLP TV in 2008 and this Sony absolutely blows it away.  The picture is awesome, and you won't find a better TV for the price.  I'll never buy a Samsung again.The item shipped from Focus Camera.  My contact there was a nice guy who was very helpful.  The only issue I had was the delivery company they hired sent me a postcard to set up a delivery date instead of calling me, so I suggest aggressively pursuing them the day it ships to make sure there are no delays.", "Date": "April 3, 2012"}, {"Title": "A Steal Of A Deal", "Author": "ShowMeStateMan", "ReviewID": "R1860T526HUZ80", "Overall": "5.0", "Content": "Wasn't shopping for an LCD TV when I came across this model at Target on floor display close-out at $497.The picture quality is excellent. The sound from the built in speakers is adequate at best (hooked up through my 5.1 Dolby Surround system...much better).Would highly recommend this Sony model to anyone that is looking in the 55\" size class. For $497, I could not pass this up :)", "Date": "November 26, 2011"}, {"Title": "Best bang for the buck if you can find it!", "Author": "Robin \"Old Man in the O.C.\"", "ReviewID": "R3C8RAKEPI3MD1", "Overall": "5.0", "Content": "Got the 2-month old demo at Pacific Sales for $750 after arguing with the wench manager of Best Buy Fullerton who wanted $1699 for the discontinued model.The difference between Best Buy and Pacific Sales is night-and-day.Got the same TV (albeit a 2-month-old demo)for less than half.  Bought 5-year extended warranty for $170, so out the door with tax, warranty, and free delivery (although we packed in our RAV-4) for less than a grand out the door.Black levels equal to any TV; features as well.Not LED, so energy cost will be an extra $1 per month.Would have bought on Amazon if I got the same or better deal.Just ordered Kindle Touch.Happy Amazon Camper  - :)", "Date": "November 13, 2011"}, {"Title": "superb tv", "Author": "D. M. Benoit \"anook\"", "ReviewID": "R2ZSBUJ3Q3WLB1", "Overall": "5.0", "Content": "This is a wonderful tv at a great value.  The picture is great, cannot complain about anything concerning this tv.", "Date": "September 25, 2011"}, {"Title": "Good value for money", "Author": "Gadget Man \"Dum Vivimus Vivamus\"", "ReviewID": "R1W77Z8XNSUM6C", "Overall": "5.0", "Content": "I looked around for a 55\" for a while, what I liked about this TV compared to same size different brand was that the Sony had significantly less glare than it's competitors.  The TV is light, easy to setup, and comes with a great stand. I like the feature of being able to connect a USB stick but I think that is pretty standard these days.  The Ambient Sensor and LightSensor feature which allows to automatically adjust the color and backlight based on a room's lighting is also very useful if your TV is in a room with a lot of windows. Needless to say this TV is Energy Star qualified which was a plus.What I don't like is the TV lacks internet access which as we move into the future will become more standard.  However, you can connect your Laptop via HDMI and project.  I do get the \"Program description not available\" not sure if that is a SONY problem or cable provider issue.Overall a good buy and would highly recommend it.", "Date": "August 1, 2010"}, {"Title": "Extremely happy with this after 1-1/2 years", "Author": "Sandra D", "ReviewID": "RS2MZ9BVIUQTS", "Overall": "5.0", "Content": "I highly recommend this awesome TV!  I could not be more pleased w/the picture and performance of this TV.  I bought it (elsewhere for ten ninety nine, which was a crazy good deal at the time) when I moved into my new home in July of '11 and still absolutely love it.  I think what first struck me about it was how black the black is on this TV; I can literally not tell any difference between the black backgrounds of some shows/movies vs the actual frame of the TV.  I also love that it is low-glare, and an added bonus is that if I leave it on after turning off my receiver, it will shut itself off after a while (I have gotten into the habit of using that feature as a 'night light' when walking upstairs to bed each night).I watch a lot of TV and movies, and paired with my Yamaha receiver and Sonance in-wall surround sound, I am thrilled.  The only thing I cannot comment on is the sound/speakers, since the way my installer hooked everything up, I can only listen to TV/DVDs via my receiver/surround sound.  (That's really odd, and I have no clue why he set it up that way, but I didn't realize it til after he had left and I had a negative experience w/him so didn't want him back in my home.)", "Date": "November 29, 2012"}, {"Title": "Great TV", "Author": "Kenneth Cornet", "ReviewID": "R3L6OC3I22OED5", "Overall": "4.0", "Content": "Product was great. Delivery was on schedule. However, crew only brought it in the front door and no further. Opened the box to show that it was undamaged, and left. Customer service was extremely helpful during the purchase process.", "Date": "July 19, 2011"}, {"Title": "Great picture quality", "Author": "Franco", "ReviewID": "RDDJ4PL7XEU5K", "Overall": "5.0", "Content": "This is the first HDTV I own. I could have settled for 46 or even 52 inch but I'm glad I chose the 55. Get the largest screen you can afford and you won't regret. I compared the 52 inch Bravia but it had a glassy reflective screen so I am happier with the matte finish of the EX500 55\". I would prefer 240hz and the LED but this is fast and bright enough in a room with windows. With comparable Samsung and LG 55 models I still prefered the Bravia. Great picture quality and I'm very satisfied.", "Date": "January 1, 2011"}, {"Title": "Really Good TV for the Price...", "Author": "Detrich", "ReviewID": "R3LW2YM0YJ03J2", "Overall": "4.0", "Content": "Picked up the Sony Bravia 55EX501 @ Costco yesterday for $1700 + tax and ran it for about 12+ hours straight through.  So far, so good...PROS:- GREAT PIX QUALITY for HIGH QUALITY TV BROADCASTS.  For Blue Ray movies and high quality HD broadcasts, such as CBS Sports, this TV is a home run.  For example, watched Iron Man on Blue Ray on it, and the pix quality was fantastic!- TRULY PLUG & PLAY- controls and remote are very easy to figure out.- LOSTS OF INPUT PORTS- 4 HDMI ports, 2 component, and 1 composite port- intuitive Input selector and easy to label.CONS:- POOR VIDEO QUALITY for MEDIUM TO LOW QUALITY TV BROADCASTS.  For lesser quality HD tv broadcasts or non-HD tv broadcasts, the picture quality is WORSE than my Sony KDL42 rear projection LCD HD TV.  This is because this TV is so high resolution, that it is less forgiving on less-than-pristine broadcast signals...  Regular DVD's still look very decent though.- VERY LIMITED \"FAVORITES\" CHANNELS. 10 only?  And, they jump around in order every time you select them and don't \"stay in place.\"  This is actually very annoying.- DIGITAL BROADCAST CHANNEL DESCRIPTORS DON'T WORK- ie all channels show up with \"The programming information cannot be displayed.\"  I found this to also be very annoying, because I like being able to see the names of the programs if it's on a commercial as I flip channels.- NO S-VIDEO PORT.- REQUIRES SOME HORIZONTAL LEVELING DURING SETUP.  This tv mounts onto a flat stand, which you then have to screw in 4 philips screws to tighten down.  Problem: you actually have to horizontally level the tv or it will slightly TILT to one side.  I only just realized this AFTER setting it up.  So, I will have to wait until I can get some help to loosen and re-fasten the screws to level it in place properly.  (What a pain!)  Also, the tv wobbles around a bit, even on the stand.  Doesn't feel 100% firmly secure.- NO EARTHQUAKE FASTENING STRAP LOOP.  There are no strap holes for you to fasten down this TV to the tv stand or to the wall...  Sony sells these \"separately\" now?  I used 3 strips of velcro and fastened it best I could to the TV stand.  <knock on wood.>", "Date": "June 7, 2010"}, {"Title": "Brilliant", "Author": "Maximus", "ReviewID": "R1J9YO0PYOB86", "Overall": "5.0", "Content": "This was a great buy. I spent a long time deciding what to get in the 55\" region, and Sony's quality is tough to match. This TV lived up to all expectations. The 'game' display mode with the XBox 360 makes video games look really crisp. I have it hooked up with a surround system so can't comment on the sound, but I highly recommend this TV. The gray TV frame looks really classy too.", "Date": "July 17, 2010"}, {"Title": "best", "Author": "scott", "ReviewID": "R3FPL1Z6BXSO5N", "Overall": "5.0", "Content": "Best TV I have ever had. Also very compatible with my Sony 170 home Theater system.Arrived from Amazon in Just 3 business days in excellent condition.", "Date": "March 22, 2011"}, {"Title": "Its a SONY...", "Author": "Ray", "ReviewID": "R3DBG5MPZI80MG", "Overall": "5.0", "Content": "First....its a sony, anyone up to date with the times knows what im saying here. I placed this TV with my Sony souround sound and there is no longer a reason for me to go to the movie theater, better picture, sound, and hell I can pause when theres a bathroom break needed, not to mention the comfort of ones home....Greatest TV ever.", "Date": "February 23, 2011"}, {"Title": "Avoid SONY at all cost ... too much $$$ for Chinese junk", "Author": "LessonsLearned", "ReviewID": "R2WFPJ2CX1RXAV", "Overall": "1.0", "Content": "I paid $2,500 LCD that went bad due to an optical block.  A problem that has brought them several class action lawsuits.  AVOID Sony at all cost.  It's too much for a piece of Chinese junk.  Sony offered it to me and then change the price on me last minute.  Sony is a sick Japanese company now.  It is no longer the Sony that I knew with their Walkman.This TV is blurry.  It is made out of cheap plastic.  The volumn is terrible.  Pictures are slow to come on.  Can't watch sports due to blurriness too.  Save your money and go somewhere else.Sony has these reps kept calling me not knowing what's facts to tell me.  One tells me something then another one calls me to tell me something else.Stay away from Sony.  It is NOT worth your money and time.", "Date": "December 7, 2011"}, {"Title": "Do yourself a favor and avoid any Sony TV", "Author": "NeverSonyAgain!", "ReviewID": "RM69DPF33P0E4", "Overall": "1.0", "Content": "I bought a new 52 in. XBR9 back in Oct. 2009 for $1,900, and the LCD panel has already gone bad after 22 months. Cost to fix = $2,800! I called Sony and they could care less! Offered to sell me another set for a reduced price. I wouldn't spend another penny on their products! Look elsewhere.", "Date": "September 7, 2011"}, {"Title": "This TV did not live up to expectations:", "Author": "Rodney Roof \"Warlord\"", "ReviewID": "R3JU8I0KSSWHP9", "Overall": "1.0", "Content": "I purchased this TV at HHGREG for $1590.00 taxes included, which at the time I thought was a great deal, and I was really hyped about this new Sony series. When I got home and set the TV up, right away, I knew I had made a Big Mistake. This TV (or the one I had) suffers from the same flaws that are inherented in all LCDs from: backlight bleeding, banding, dead pixels, terrible off-axis, the colors were way over staturated no matter what setting was applied. I had hoped LCD would have improved in this area by now, I guess not. The TV itself also seemed very cheaply made, the only thing even remotely nice is the shiney metal strip at the bottom everything else seems to be thin plastic thst almost feels like it would crumble in your hands with the slightest pressure.I admit I am picky when it comes to my AV equipment but this TV is sub-par at best. TV manufactors you need to focus on QC and lay off the mass-production junk.", "Date": "April 24, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "55-inch HDTV with Full HD 1080p resolution and Motionflow 120Hz technology for smooth motion\nMotionflow 120Hz technology for smooth motion; BRAVIA Engine 2 fully digital video processor optimizes color and contrast\nAmbient Sensor adjusts color based on room light; automatic increase or decrease in backlight brightness based on room's lighting conditions\nInputs: 4 HDMI, 2 component, 2 composite, 1 PC, 1 USB, 1 optical digital audio output\nIncludes removable stand; measures 52.25 x 32.9 x 13.9 inches with stand", "Name": "Sony BRAVIA KDL-55EX500 Series 55-Inch LCD TV, Black", "ImgURL": "http://ecx.images-amazon.com/images/I/31%2BK7vt5JgL._SX300_.jpg", "ProductID": "B0035ER1IW"}}