{"Reviews": [{"Title": "Amazing!", "Author": "Richard L. Morrow", "ReviewID": "R3BVWJ404MK7HJ", "Overall": "5.0", "Content": "Might not appeal to the people who can afford a $2500 TV..aka the videophile, but I'm in love with this. For 95% of people this should be more than enough. After months of shopping around and doing my homework, I went against the grain and decided to try the LG. Purchased this set through Walmart site to store. It was $70 more than the LD450 model on the shelf. But in my eyes well worth paying a little extra and waiting another week for it. The extra hdmi port alone justifies the $$$$.Picture Crisp! Bright. Color is deep! Pops off the screen when in high def. Nothing in 480 (standard) looks good on this though . Keep that in mind. Initially struggled with adjustments. In the end a couple of tweaks to cinema mode were all it took. Looks as good (maybe better) than the comparible Sony's and Samsungs.A word of advice... I saw one of the 450 models on a store shelf...which basically has the same picture with a few less features. It looked horrible next to a Sony. Huh? The sales guy tried to tell me that the LG wasn't getting as good of a signal. Ummm...why does the 47\" inch version way down on the other end also look bad next to the Sony? Or even the Sanyo? Why do I see the same thing when I visit the store down the road in fact? The answer? LG's 'store demo' presets are horrible. I'm not sure why they did this. But they badly misjudged something. Once you get the picture correctly adjusted, you'll see what I'm talking about. It's an \"oooh and ahhhh\" kind of thing when you see what it is supposed to look like.Final Settings: Aspect Ratio 16:9Energy Saving OffCinemaBacklight 30Contrast 90Brightness 75 (adjusted)Sharpness 50Color 50Tint 0Color Temp W50Advanced ControlDynamic Contrast Low (adjusted)Dynamic Color Low  (adjusted)Clear White OffSkin Color 3 (adjusted)Noise Reduction OffDigital Noise Reduction offGamma MediumBlack Level LowEye CAre Greyed Out/offReal Cimema OffColor Gamut StandardxvYCC AutoTrumotion OffTHOUGHTS:Intellegent Sensor is useless. Makes the picture WAY too dim. It might have been good if they weren't so conservative with the energy savings. I could achieve 100% power savings by unplugging it, but what would be the point? Options to adjust Itelligent Sensor are greyed out too. The IS logo that pops up on the screen is also annoying. Blech! . Strongly recommend disabling this feature.Trumotion=much ado about nothing. Doesn't add anything great to the experience and in many cases makes things worse. Thankfully it's easy to disable. Interloping of frames just creates an artificial feeling to everything. Even on low it's bad. If motion blur/judder is an issue to you, then you to look into Plasma. I really don't notice it though. NBA finals and World Cup matches looked amazing WITHOUT this feature enabled!!!!!60hz vs 120hz: The difference is slightly noticable. Will 60hz ruin your viewing experience? No. But for the slight price difference it's worth it. You'll notice the difference with Blue Ray movies for sure.Glare almost non existant. Good job!!!Off angle viewing isn't flawless, but I don't notice issues unless I'm watching tv from the other room.Reported 'lip-sync' issues: I saw it do this once and the issue never resurfaced. So I'm writing this off.Remote control simple to use. Well done. Although I can make all adjustments I need to with my Directv remote, so it will go into mothballs.Noticed a bit of uneven backlighting when I'm flipping channels, on a pure white screen. But don't let that scare you. You shouldn't notice it 99% percent of the time. If it does become an issue to you, then adjust the intensity of the backlight accordlingly.Sound could have been better. Meh! Having speakers in the back was a bad idea. Asthetics aside..they shouldn't have done this. But I'll be getting a home theatre system soon anyway. So it's a minor issue to me.The stand: I had heard rumbling about the stand not being very 'secure' on the LD450 models. Definitely not an issue with the 520 series. Seems perfectly stable to me. I've bumped it a couple of times and it barely moved.Lack of an ethernet port: Would have been nice had LG included this feature just for pulling down firmware updates. But I can live without itBOTTOM LINE:This tv is great! You can't go wrong....as people have said...for the money. If you are looking for something better....wait a year or two for the next generation of led-backlit sets to hit the mainstream market at a reasonable price. But I can honestly tell you that this unit provides the best balance of all worlds. It's candy for the retinas!!!!!!!!!I wish I could give it more than 5 stars.Well done LG-Rick", "Date": "June 27, 2010"}, {"Title": "Excellent Picture Quality, Buy.", "Author": "Babak", "ReviewID": "R1E086KX6YXKG0", "Overall": "5.0", "Content": "I spent close to an hour in the store comparing LCD TVs. This LG stood out with its sharp and bright colors. I used the store's Internet connection to check out the reviews but since it is a new model there wasn't many. The older model however was popular among gamers.The speakers on this TV are hidden on the back and this gives it a neat look. The speakers also sound great. There are different sound options in the menu plus advanced picture controls. In \"Intelligent Sensor\" mode the TV adjust the brightness and color contrast according to the room lighting conditions. The picture quality is easy to setup using the picture wizard option.This TV has three HDMI connections in the back to use with your laptop or desktop plus an RGB (VGA Cable). There is also a USB 2.0 port in the back. I connected a USB thumb drive and was able to listen to music and display my digital pictures on the screen.Over all I am very pleased with quality of this LG model and recommend it to anyone who wants to buy a LCD TV for under $1k, and I mean not for picture quality but the size of the screen since this had as good, if not better, picture quality as other more expensive models in the store.", "Date": "April 9, 2010"}, {"Title": "Nice TV", "Author": "Eric \"goodadvice75\"", "ReviewID": "R2XH9F2RWNLX7", "Overall": "5.0", "Content": "I bought this TV from the big box retailer that constantly rolls back prices. The TV was actually cheaper than online. Overall I like the TV very much and I think the value proposition is excellent. My local Bestbuy had this TV on display.I have three recommendations for people who are not technically inclined - like myself - and get this TV to utilize the TV's full potential:1. Make sure you use an HDMI cable to connect this TV to your cable box. You need to make sure that your HDMI cable is at least version 1.3.2. Get HD cable or satellite. Having HD channels makes a huge difference.3. Make sure your cable box is set at 1080p output signal. Our cable box was set at a much lower picture quality and it took me a while to figure this out. Some cable boxes might adjust the output signal automatically, but not all do that.If you follow these three simple steps you should be able to enjoy the full potential of the TV. Also, think about getting netflix and one of the blue ray players that allows you to stream netflix. The quality of some of the movies is just awesome.My last recommendation is to get an additional warranty. LCD TVs seem to be  more prone to failing than CRT TVs. There are huge differences in the cost of these additional warranties. So account for these differences in your comparisons when you shop around.", "Date": "June 15, 2010"}, {"Title": "LG 42 INCH 120 HZ LCD TV", "Author": "Jerome A. Mortenson \"dorsai23\"", "ReviewID": "R18YD7IWWSUADA", "Overall": "4.0", "Content": "Picture looks great crisp contrast, vivid bright colors, excellent sound would recommend this TV to anyone. My only complaint is the lack of analog audio output connection.", "Date": "May 27, 2010"}, {"Title": "Excellent TV", "Author": "Michael Vannier", "ReviewID": "R2PAZCDJLG2V8T", "Overall": "5.0", "Content": "Product arrived safe from California (we're in Illinois) in 4 days. Perfect condition. Took only minutes to install, replacing an old Sony set with CRT. Light enough to carry and exceptionally flexible. After channel scan (about 10 minutes), it was ready to play HDMI link to cable, HDMI link to laptop, DVD player, and videotape player. Picture quality is outstanding. Remote is self explanatory. Vastly superior to many other 42\" sets that I've seen in stores and homes of friends.", "Date": "November 18, 2010"}, {"Title": "Great value!", "Author": "Matt", "ReviewID": "R1FRJMWAR68RPH", "Overall": "5.0", "Content": "I've had my eye on this TV for about a month now. I saw it at Fry's on sale for 499 about a month ago while I was just browsing around. I was tempted to buy it, but without permission from the wife... it could've been a bad idea. Went back two days later to get it but the sale was gone and the price was back to like 799. I was so mad. Last night I went again for some other things, to my surprise they had this TV on sale again for 499! Wife was with me, we talked- we got it.This TV is all around great. We have it in the bedroom, and the thing I like best about it so far (besides the amazing value and great picture) is the intelligent sensor. It allows you to save power (and your eyes). When it's dark in the room it dims the screen to save power and not to be overkill on your eyes. AWESOME. Our plasma was so bright and a hassle to adjust settings all the time so I just dealt with the brightness. This power saving feature can be turned off, but leaving it on auto is the smart thing to do.Other than all of that, speakers have come a long way in built in LCD TV's. I'll have to say these sound about as good as my 46\" Samsung in my office- which was a pricier purchase. If this is going in a living room or game room, a sound bar or full surround sound would always be better- but for basic TV watching the speakers are more than adequate.As most people will say the 120hz is iffy. At times people look to be moving faster than they should, or there are little distortions. I think it's best used on blu ray, but I generally have that turned off.If you're in the market for a TV- go to Frys ASAP and grab this for 499. The price Amazon has is fair, but Fry's price was unbeatable and I couldn't resist....", "Date": "November 9, 2010"}, {"Title": "Great picture possible, but terrible flaws", "Author": "S. Kolopic \"S.K.\"", "ReviewID": "R3NWPB11I7M7VD", "Overall": "2.0", "Content": "It's been 4 days now and while the picture can be excellent and the 120hz can be used very effectively, it has terrible problems with ghosting and image retention -- probably the worst I've seen on an LCD tv in the last 4 or 5 years. If a graphic or any stationary scene is on for even just 10 seconds, it remains visible for up to a minute as the scenes/channels continue to change. (And yes, the all the picture settings have been turned way down as soon as I turned on the set)I was watching the world cup for about 20 minutes today, and the station's logo and score ticker took about 5 minutes to completely disappear after I changed the channel...maybe mine is just a lemon - quite intolerable. It is incredibly disappointing considering the TV's potential. It's going back to the store in a few days....", "Date": "June 13, 2010"}, {"Title": "All the features I wanted at an amazing price", "Author": "Ben", "ReviewID": "R74ZYNF1DS1OL", "Overall": "5.0", "Content": "I'd been looking for 42-inch LCD television for a while before I finally settled on this model. My price range was about $500-600, and I couldn't pass this model up when I saw it for $550 on Amazon. As soon as I got it, I popped in a DVD produced by George Lucas' studio Lucasfilm and used their video calibration tool to calibrate the TV, and I must say it looks great. A lot of these TVs come preset with some pretty harsh settings, so it's really a must to tone down the brightness and color a bit.But for the money, this TV had all the features I wanted. It's 1080p, 120 hz and has a 100,000:1 contrast ratio. With the new LED televisions coming out recently, you can get an LCD television for a great price -- and I'd say they still look great.One feature that is a must for an HDTV that LG surprisingly doesn't mention on this model is 1:1 pixel mapping. What this does is ensure your television gets you every single pixel the input device -- whether it's digital cable, a DVD player or your computer via HDMI. Many televisions will overscan the picture by default, meaning it \"crops\" the image you see by about 5 percent then stretches or scales it back out to fit the screen. What this does it distort the image in addition to cutting out a portion of your picture -- this is particularly annoying with football and other sports where the score is listed at the bottom. Under aspect ratio, select the \"Just Scan\" option, and you're set. It's not available on analog input devices like cable television via a coaxial cable, though, for obvious reasons.When I was looking at this TV, there was a lot of discussion about the TruMotion feature. What this does is artificially increase the frame rate to (hopefully) give you a smoother picture with less blur during fast scenes. It's really a matter of opinion whether you use it or not. I use it for football games and other sports where the camera shots change often and there's a fast pace of motion. But if you have this on during a DVD or a cable broadcast, you'll notice everything looks like a soap opera and artificially rendered.All in all, this is an amazing TV for the price. The picture is great when calibrated properly, it has all the HDMI inputs you'll need (three) and has great features. I bought a three-year warranty from SquareTrade for about $75, and they guarantee to refund the purchase price if anything goes wrong. All this considered, I expect this TV to last me a long time.", "Date": "February 17, 2011"}, {"Title": "A Happy Customer.", "Author": "Haink", "ReviewID": "R2VCZ6HFGXK897", "Overall": "4.0", "Content": "I did a ton of research looking for a new TV. There were a couple of items that were extremely necessary for this purchase. It had to be 40 inches or larger, 1080P, and 120 HZ. As I was reading reviews and comments I kept coming back to the LG 42LD550. After really looking at it I decided to go with the LG 42LD520 42-Inch 1080p 120 Hz LCD HDTV as I have a PS3 and stream netflix off of that. With only an optical audio out I wouldn't be able to run the internet apps through my surround sound. This made the internet apps less intriguing.I am extremely happy with this purchase. I am not a professional TV watcher or reviewer but her are some of my feelings. First some Pros:PROS:Great Picture in HDEasy menu controlsPlenty of inputs (for me)Sleek looksVery adjustable picture for the priceSwivel standCONS:Picture in SD is a little fuzzy (Not unwatchable)(This could be settings as well)Motion Blur is strange but can be configured to your liking or turned offNo Audio outThe sleek looks and gloss frame tend to show dustSome light bleeding from the back of the TV Enclosure (Noticeable in the dark with dim colors on the TV)This TV is on the swivel stand at the moment and i will eventually mount it on the wall. So far this TV is exactly what I was looking for and I am extremely happy with my purchase.", "Date": "December 29, 2010"}, {"Title": "Very nice TV for the price, but no RCA audio out", "Author": "C. Taylor", "ReviewID": "RAGHHUO4OMYOH", "Overall": "5.0", "Content": "So let me start by saying I got this TV for a steal at $549.  I ordered it on a Sunday for $639, then got it on a Wednesday and when I checked the listing on Amazon to leave a review I saw the price was lowered to $549--the awesome customer service at Amazon refunded me the difference that day.  So, as far as shipping and customer service is concerned, this gets 5 stars.The TV itself is very attractive, seemingly well built, and has given me no technical problems.  One thing I was not aware of when buying it, if you have a receiver that does not have a digital audio input, you can not run the sound from the TV to the receiver.  There is a headphone jack which you can run a 1/8\" to RCA cable from, but the headphone output level is not great and crackles a bit when plugged in to my receiver.  The way I took around this was simply going from my audio sources (cable box and Blu Ray player) to my receiver, so it's not that big a deal, just a deal breaker for someone who needs the TV plugged into a receiver.The other complaint I have with the TV (and why I gave picture quality 4 stars) is that the blacks are pretty lightened on all the settings.  I've tried adjusting the contrast and brightness and backlight settings, but they aren't really helping.  It's not horrible, but I definitely saw better performance out of my 32\" Sony Bravia 1080i TV.  Also, the TruMotion thing is very strange, I would advise turning it off.Otherwise, all the menus and things are easy to navigate and relatively fast.  Excellent TV for under $600.", "Date": "February 14, 2011"}, {"Title": "Excellent TV for the price.", "Author": "Jon B", "ReviewID": "R2UMPSTD1E9HC8", "Overall": "4.0", "Content": "Purchased this shortly after the beginning of the new year. Shipping was through a non-UPS/FedEx carrier but was hassle free. They emailed to confirm the scheduled delivery date and the brought it right up inside my home. TV was securely packaged and had all parts & pieces.Installation was easier than removing the old CRT TV that had been used in the living room for 11+ years. Only hitch was not seating the power cable properly in the TV. This can be attributed to oversight on my part thought as I had though it was seated all the way in when it had about a half-inch more to go.On screen setup was easy enough. Menus are brisk and easy to navigate. The picture wizard feature was not very impressive, but after playing around with some of the pre-set modes and making minor adjustments the picture looked great. There was a little pixelation on graphics from HD stations (noticed this on the score ticker with the Jets / Pats game). But otherwise the picture itself was nice. TrueMotion on adds an almost 3D level of depth and clarity to a picture, but feels a little artificial. I can see that feature being a love it or hate it setting for most people.The built in speakers do a decent job. Obviously not a home theater system, but they are loud and clear enough to get the job done. The ClearVoice feature helps for scenes where there is a great deal of background noise that might overwhelm the dialogue.Price when purchased was $549 with delivery included. Would most definitely recommend at that price or up to $650. Above that though and you might want to start looking for deals to pop up with this or other HD sets.", "Date": "January 17, 2011"}, {"Title": "Pleased As Punch With This TV", "Author": "LJ", "ReviewID": "RKCFNUB71UJ0A", "Overall": "5.0", "Content": "I spent a fair amount of time researching HDTV's and when I ran across this LG 42\" LCD for a really good price, I jumped. The picture on this TV is amazing. The 120hz refresh rate is a real improvement from 60hz.This TV will impress your eyes. You will love this TV!", "Date": "December 16, 2010"}, {"Title": "Wonderful product.", "Author": "MC", "ReviewID": "R21F7LSO3KH4XC", "Overall": "5.0", "Content": "This is an amazing product for an awesome price. I purchased it for $734 total...no tax...no shipping. It was a brand new product and that is a wonderful price. You cannot go wrong with an LG...their quality far surpasses any other brand out there. We do not have HD channels...but the clarity and HD quality come through anyway. Everyone who watches it talks about how wonderful it is and how great the picture is. You would swear we had HD channels. No special cords or services and this HD TV shines on its own. Highly recommend. If you buy any other brand besdies an LG you are wasting your money. We will never purchase any other brand again.", "Date": "September 23, 2010"}, {"Title": "woodman71 1st HDTV purchase", "Author": "woody teel", "ReviewID": "R2SBBP7FCZL5TM", "Overall": "4.0", "Content": "This was my 1st HDTV purchase & I would rate my selection 4.5 stars out of 5. The unit was a little expensive compared to the big box stores economy Brands but I thought this TV had alot of technology built into it & I had seen LG HDTV's in Motel rooms & @ friends homes.  It has an amazingly clear picture even on standard cable & I am probably not going to upgrade to HD Cable for a while because of that.  Beware tho; Optical Video out only; I can't run it thru my 20 Yr. old Pioneer VSx9500 Stereo Amp because there are no RCA video out connections, only a female 1/8th\" female port for a head phone. I am going to try to find a Y adapter to RCA plug to hook up but this seems rediculous. The remote control must be aligned up close to the TV in order to switch channels Etc. Am still learning how to use all its features tho. Life's Good!Woodman71", "Date": "August 29, 2010"}, {"Title": "Life IS Good for 120hz", "Author": "1Dub79", "ReviewID": "R1B98KL3XOL3TW", "Overall": "5.0", "Content": "I was looking for another LCD, after returning my Toshiba 40G300U 40-Inch 1080p 120 Hz LCD HDTV (Black Gloss). I was going to buy a Sony BRAVIA EX 500 Series 40-Inch LCD TV, Black, but the Brandsmart associate swung me a deal for this LCD, which would be bigger than the Toshiba and the Samsung LN40C630 40-Inch 1080p 120 Hz LCD HDTV (Black), which I already own. Not to mention, I have familiarity with LG's because I also own a LG 37LG30 37-Inch 720p LCD HDTV. What I love about this LCD television is the many, many picture options. I will give my opinion of each one.TruMotionThis is the best feature of this LCD. It gives the user, what is called the \"soap opera\" affect. I already know how this works because this is a major feature of the Samsung, The Tru Motion feature rivals that LCD.Clear Voice IIThe sound of this LCD is one of the best of the LG LCDs. The Clear Voice II amplifies the human voice on the LCD. I really noticed this, while playing Call of Duty Black Ops. I noticed when voices are heard, they are much louder than the actual sound.Picture WizardThis feature is great, in my opinion. This option shows a picture of a painting, which lets you adjust the black levels, tint, color etc. The painting is just to show the user how the picture will look, once you go back to watching a program. The changes will be saved to the picture mode, which is called ISF/Expert Mode.AV ModeThis feature is just a quick way to change the picture settings, without going to the menu. I already know about this feature because I already own another LG LCD.Energy SavingThis mode is OK. I like to put it on minimum. It dims the LCD picture, slightly. If you go beyond that selection, the screen dims, tremendously.Intelligent SensorThis feature is similar to the Energy Saving feature because it dims the screen.SimplinkThis mode has improved from previous LG models. Now, if you hook another device up, you can access it by way of the LG remote.The VerdictThis LCD is a steal. Not to mention, the picture and color rivals the Sony and Samsung, as far as picture quality. What makes this LCD great is the options. You will not be limited to how you want your picture to be. It took a while, but here are some great picture settings for this LCD:Aspect Ratio: 16:9Picture Mode: Expert 1Energy Saving: MinimumBacklight 75Contrast 90Brightness 40H Sharpness 80V Sharpness 80Color 70Tint 0Expert ControlDynamic Contrast LowNoise Reduction HighDigital Noise Reduction HighBlack Level HighReal Cinema OnColor Gamut StandardEdge Enhancer High", "Date": "February 23, 2011"}, {"Title": "great buy", "Author": "bangbambang", "ReviewID": "RHJP60G8AAOOF", "Overall": "5.0", "Content": "This is the best picture you're going to get for this price range. period. I wandered around the store for a while and eventually went with this one. What attracted me was the price, 1080p, and 120Hz refresh rate. And when i set it up at home I was very satisfied. With the tru motion i realized what a huge difference the higher refresh rate makes on picture quality. I was actually going to go with a plasma for the high refresh rate, but I was satisfied to find an LCD tv with a bumped up refresh rate. Although it may not be the 600Hz that a plasma boasts, its definitely an improvement over most LCD models and it retains the qualities that make LCD T.V.'s great: Bright, crisp picture; low power consumption; and a longer life span.", "Date": "February 16, 2011"}, {"Title": "Better picture than my 42\" Panasonic edge-lit LED", "Author": "Amazon Customer", "ReviewID": "R2ONG6VOT4L0VK", "Overall": "5.0", "Content": "I've had this TV only a few days now, but after a bit of tweaking, I am really happy with it.  I had previously purchased a 42\" Panasonic with edge-lit LED from Costco.  That TV really stood out to me when browsing the options at Costco.  It was really hard not to love it.  But the price was a little more than I wanted to pay ($699 plus tax), and I'd been hearing good things about LG.  I also just bought the BD570 Blu-Ray player and thought it would be nice for both components to be from the same maker.  So when I saw this LG on sale at Amazon, I decided to give it a shot.  Delivery was prompt, and the guys from Pilot were as helpful as could be.  Setup was a snap.  I confess I was a little disappointed at first with the picture.  It really seemed to pale in comparison to the Panasonic.  But after changing the settings, this LG really shines.  Great colors, crisp picture, and even deeper blacks than my Panasonic LED!  That was a surprise.  For the price ($549 last week), I don't think you can find a better value right now.", "Date": "January 11, 2011"}, {"Title": "Exactly What Was Expected", "Author": "E. R. Jones", "ReviewID": "R23YKEF1SAP7XS", "Overall": "5.0", "Content": "I was looking for a cheap 42\" LCD but I wanted 1080p and 120hz to support a PC in addition to cable and blu-ray.  If I wasn't going to hook up a PC, I would have settled for the cheaper 720p / 60hz.  My office uses a 60\" LG plasma and I like that product, so I went with what I knew.  The 42\" LCD was packed well and arrived with no flaws.  I had it set up and running in a few minutes.The TV was installed in a very bright room.  The room is half glass, facing a beach.  The TV is mounted 90 degrees from the incoming sunlight.  I am happy to report the TV is viewable at all times of the day and has almost no noticeable reflections of the bright spots in the room behind the viewer.  It is truly amazing.  It is like a black hole.  One thing that caught me by surprise was how light this TV is.  It says it is 38 pounds, but compared to the old tube TV it replaced, it felt feather light.It makes a great PC monitor in addition to HDTV.  The 120hz ensures very smooth motion on both the PC and fast movement in movies or sports.  Overall, it is exactly what I was looking for.  In hindsight, I flip between the web and cable so frequently that picture-in-picture would have been a nice feature to add.  Happy hunting!", "Date": "September 17, 2010"}, {"Title": "Our's was a lemon - returned it", "Author": "Jagade", "ReviewID": "R1YBLC3DJRY703", "Overall": "2.0", "Content": "We buy a lot of merch from Amazon and have been amazed at the pricing and service offered by Amazon. When this HDTV came up for sale, we decided to buy one despite the small number of negative reviews mostly concerning the picture quality. We received the unit ahead of stated schedule and proceeded to hook it up. We have been running a 50\" Mitsubishi Plasma HDTV for quite awhile. So, we had a basis of comparison to judge the new LG by. When we fired up the LG, the picture was horrible on HD channels and even worse on the SDTV (480p)channels.We tried all of the available adjustments, both auto and manual, provided by the units administration console. None of that worked to improve the picture quality to acceptable levels. We even followed the advice and settings posted by others on this review site. Still no Love.We then went to the local Fry's electronics and they had this LG model as well as many others. We chose to purchase a Samsung Series 650 LCD model. Wow! What a beautiful full HD picture!Sadly, we had to return the LG. Not sure if the problems with this TV are across the whole model line or just isolated to some of their production.We love Amazon and they were great about accepting the return of the unit. Amazon is a great example of a company doing business the RIGHT way.", "Date": "December 8, 2010"}, {"Title": "Waste of Money", "Author": "fmnjr", "ReviewID": "R29YK5HICXAXEW", "Overall": "1.0", "Content": "We bought this TV just after Thanksgiving 2010.  Within a week we were having problems getting the sound to work properly.  Whenever we turned on the set there would be no sound through the HDMI 1 (Direct TV) input, so we had to switch the input to something else and then switch it back.  Every time.  Needless to say, I don't like spending $700 on something and having an annoyance like this.A few days ago we started seeing yellow lights bleeding onto the screen from the lower left-hand corner of the frame.  They were there regardless of input device (DVD, PS2, DTV) or TV channel.  I know that people have had similar problems with edge-lit LED TVs, but we shouldn't have had this problem. Luckily, Best Buy accepted the TV as an exchange with no problems whatsoever.  We now have a Sony Bravia.  Everything seems to be working well, and the picture seems as good as it could be for a TV in this price range.", "Date": "January 6, 2011"}, {"Title": "Stay away", "Author": "ZippyStick", "ReviewID": "R2HIK19XU4DP4D", "Overall": "1.0", "Content": "1 year and 2 months after purchase the tv started turning on and off with no picture.  Has a bad main power board that costs over half the price of a new tv.  Nothing seems to last anymore...", "Date": "May 20, 2012"}, {"Title": "just what I was looking for", "Author": "justanotherguy", "ReviewID": "R3JRAOR0SGFFB6", "Overall": "5.0", "Content": "This is my first venture into LCD TVs. The TV does exactly what I need and looks awesome. I'm not a videophile so I won't be critical of some color shading or technical aspect. Defiantly turn the Truemotion junk off. Inputs I'm using: VGA (HTPC), component (DVD), composite (PS2), broadcast TV. I only achieve full 1080 with my VGA input from my HTPC, and it looks amazing.", "Date": "February 14, 2011"}, {"Title": "Great TV!", "Author": "Nicole Hedden", "ReviewID": "R1EJR82MOEQZVR", "Overall": "5.0", "Content": "I searched and searched for the right tv... This TV is great! Excellent picture quality and I couldn't be any happier with my purchase. =)", "Date": "January 14, 2011"}, {"Title": "This is my bedroom tv to match my living room", "Author": "KushWizard", "ReviewID": "R1ATVQNU1W7VRM", "Overall": "5.0", "Content": "I bought the 47LH40 last year, just received the 42LD520 and was surprised it's actually a better tv. More colors (spec) and very clean volume and menu displays. Smoke glass trim, upgraded stand. Couldn't be more impressed for the money. Actually blows away similar samsungs ive seen, and I was under the impression that LG played second string to Samsung. Don't believe the hype! Also check out the SL series. Seamless boarder and 240hz for a reasonable step up.", "Date": "December 7, 2010"}, {"Title": "Worth for the price", "Author": "Worth it", "ReviewID": "R1OL4BW7ETX1O9", "Overall": "5.0", "Content": "As usual Amazon rocks, Offered me a beautiful TV with guaranteed low price. I heard people saying, do not believe amazon guranteed low price. But guys, It worked for me. They are going to return the money back to me.Coming to the TV review. What to say, It is awesome awesome awesome... Before buying a TV I was doing a research whih brand and which model to take. I used HD nation for reviewing. The reviewers are knowledgeable. As per they said, I fing it is damn good. User friendly. Just go and buy it with closed eyes. Yu wont regret for buying this product.", "Date": "December 1, 2010"}, {"Title": "Awesome TV", "Author": "Geoffrey From \"Frommy\"", "ReviewID": "R3F773NZF8JR7C", "Overall": "5.0", "Content": "Overall this is a great tv. I own a LG blu-ray player as well and when mated with this tv it looks amazing. The 120hz Trumotion is really fun to watch sports on and can't wait till football season. Thanks LG for another great product!!", "Date": "May 19, 2010"}, {"Title": "Fantastic", "Author": "Wired", "ReviewID": "R3E5QS3X4U7O12", "Overall": "5.0", "Content": "We bought this tv on sale for $449.00 at Fry's two weeks ago. Great picture and easy setup. We can't believe the picture quality difference between this tv and our 4 year old Magnavox LCD.", "Date": "September 18, 2010"}, {"Title": "Worst tv ever", "Author": "bgfzy", "ReviewID": "R3NZXOVDY5NL3R", "Overall": "1.0", "Content": "I bought this tv and when it worked it was great! Two months after receiving it, it stopped working no sound no picture Lg service was fantastic they actually came to my home and had all the parts to repair it with them new power supply and mother board. Now I have owned the tv for 15 months and the same problem has returned since it out of warrenty I ambuying a new tv today.So as I said I really liked the TV LG service was great I just can't afford to buy a new every 15 months.", "Date": "July 10, 2012"}, {"Title": "Great TV!!", "Author": "Nichole", "ReviewID": "R3HILP9EBAZ8M9", "Overall": "4.0", "Content": "After having this TV for a year it began turning itself off and on. I called LG's customer service and they told me how to do a hard reset (turn the tv off, unplug it, hold the power button on the tv for 20 seconds, plug it back in). So far, I've had no more problems with it. I would highly recommend this television, and LG!", "Date": "February 16, 2012"}, {"Title": "Nice TV", "Author": "Paula", "ReviewID": "R10TU65FBJIUVG", "Overall": "4.0", "Content": "I've had this TV for about a month and i like it. I didn't care for true motion feature, all the shows looked really weird with it but there are so many options to choose from as far as settings that i am sure you'll find the one that fits your liking. I surely found mine. I didn't like the glare from the plastic sides around the screen, i wish they made them not as shiny but i got used to it in a couple of days and don't notice it anymore. Overall i am pretty happy with the product.", "Date": "April 24, 2011"}, {"Title": "great tv for a very good price", "Author": "Eugene K. Babineaux \"eb334\"", "ReviewID": "R38Y3XJ0990XHX", "Overall": "5.0", "Content": "I just got my tv and i love it. Great price and great picture. I found the same tv where i live and it cost about 100.00 dollars more. I works great with my xbox and ps3 and hd dirctv. I wish it had more hdmi ports and the sound is not that good but that is all the cons that i can see with this tv", "Date": "March 1, 2011"}, {"Title": "Amazing!", "Author": "Big Mike", "ReviewID": "RBRS734BENJ1H", "Overall": "5.0", "Content": "No cable, roof antenna. Perfect picture. I feel like I have been watching TV with sun glasses on my whole life.  I can`t say enough about how amazing the picture looks on this TV. Easy set up. Easy calibration and all kind of options on the settings. I love this TV.", "Date": "February 8, 2011"}, {"Title": "Good TV, misleading shipping info", "Author": "L. Ryan", "ReviewID": "R3JS3KFSCJA4ED", "Overall": "4.0", "Content": "So far the TV seems to be very good for this price range... we are having some volume issues with external devices but, hopefully, we'll find a remedy for that - we just have to turn the volume way up for gaming and DVD viewing.My main beef with this purchase is that while it states Prime (in this case means you don't pay any additional for shipping) it took a full 7 days for delivery and the carrier didn't contact us until the truck was one day away from delivering (and this was via an automated system/recording). I had to contact them before that to track the order.", "Date": "January 29, 2011"}, {"Title": "Great picture!", "Author": "seekbest", "ReviewID": "R2TVLK5ZPCRNID", "Overall": "4.0", "Content": "Did not need to make any refining picture quality adjustments. Audio seems a bit muffled, but not enough to be distracting.", "Date": "December 28, 2010"}, {"Title": "Wow!!", "Author": "Randal A. Messner \"bucksfan10\"", "ReviewID": "R2II5R71JQXZ8V", "Overall": "5.0", "Content": "I never really was impressed by any of the HD TV's I had seen in stores, friends' houses, ect. I had decided I would never buy one until I had to. While that time came when I moved into a new (but very old) house and needed a new TV. After doing a lot of research I found Amazon had this one on a special financing deal plus it seemed like a decent price. I made the jump. And boy am I ever glad I did. The picture on this TV is great. When the very courteous delivery driver brought it into the house I hooked it up and it looked great right out of the box. Didn't have to do any adjusting. Old shows, new shows, sports, they all look great. My kids will be over for the holidays and we'll see how it looks for video gaming. I would recommend this TV without hesitation.", "Date": "December 14, 2010"}, {"Title": "Outstanding", "Author": "Techie", "ReviewID": "R2B7OIODACOSGB", "Overall": "5.0", "Content": "I have been using this TV for around a week now, and I have been nothing short of completely satisfied. Not only does it flawlessly handle all my presentation needs via HDMI from my computer, it handles fast paced action much better than our other 42\" which is only a 60Hz refresh rate. I have played several blu rays, streaming from my Play Station 3, played several computer games on the screen via HDMI, handled business as well. No problems. Shipping was fast and on time, TV was easy to handle out of the box, and set up nicely. My only complaint would be that the four screws provided on the back of the computer are not of sufficient length to support a wall mount. I had to use the screws that came with the wall mount kit. Nothing big, but I do catch a glint of silver every once and a while when in view of the rear. USB picture viewer worked great. Features on the television all seemed to do what they said.", "Date": "December 5, 2010"}, {"Title": "LG HDTV", "Author": "Jones87", "ReviewID": "RZ3YLK2CANXS6", "Overall": "5.0", "Content": "Have had the TV for almost a month now. It was actually delivered earlier than expected!! The set up was simple & the picture quality and features are outstanding. Very pleased with this purchase.", "Date": "November 27, 2010"}, {"Title": "Excellent product", "Author": "AWes", "ReviewID": "R2COQI50ZAO8D7", "Overall": "5.0", "Content": "I purchased this television as a gift for my husband and we have had no complaints thus far. The set up was simple, the picture looks great, and it's perfect for us.", "Date": "November 19, 2010"}, {"Title": "No wonder LG is top of the line", "Author": "Spotswood10", "ReviewID": "R1MN42I7ZS3P98", "Overall": "5.0", "Content": "I have had this LCD for about 2 days now and I can say that it is the best LCD that I have ever owned. The colors are unbelievable, the picture is perfect.  1080p looks amazing.  Overall if you are in the market looking for a great LCD TV to buy, this one is your best bet, especially for the price.  Perfect for gaming.", "Date": "July 27, 2010"}, {"Title": "All was right and good!", "Author": "Jason's Opinion", "ReviewID": "R1VITMFSH9TFM3", "Overall": "5.0", "Content": "I ordered this tv with my fingers crossed.  I had already looked at the same model in a local store and knew from investigating online that this tv was what I wanted.  My worry was in ordering a tv \"online\" and having it \"shipped\" direct to my house.  Let me say that I had worried for nothing.  The tv came ahead of schedule, even though I got free shipping.  The carrier called me the day before (automated), to tell me it would be there in a specific window (albeit, a large window) the next day.  The box had no damage, and the tv was sound inside.  This site gave me the best price I could find and shipped in a timely manner.  A+ for them.", "Date": "September 30, 2010"}, {"Title": "DISAPPOINTED -- TV is a potential FIRE HAZARD", "Author": "Bianca Malcolm", "ReviewID": "R3QY9UVMS4K8GQ", "Overall": "1.0", "Content": "I really wanted to like this TV. I had been researching TVs for months and really liked the features and reviews for the LG 42LD550. However, when that TV when out of stock, I moved on and decided on this TV (LG 42LD520) because it also had great reviews and features and was on sale for $578. I waited anxiously for this TV for five days (I ordered it on a Saturday) and I was more than excited for it when it finally arrived. I quickly unpacked the contents and assembled the TV and stand, placed it on my TV cart, put in my cable, and plugged it into the nearest outlet. Then, when I turned on the TV, the picture flashed for a millisecond and began to instantly flicker. The TV then rapidly turned off and on and a loud popping noise started coming from the back of the TV. Shortly after the popping sounds began, SMOKE started coming from the back top of the TV and I could smell a very strong fire odor. I immediately unplugged the TV. At first I thought the smoke was because the TV was still cold from coming from outside. So, I decided to walk my dog and left the TV unplugged and off for about two hours. I then plugged the TV back into the outlet and turned it on. The picture stayed on longer this time, but it was still flickering. Not only that, but the popping noise from the back of the TV was LOUDER and even MORE SMOKE and a STRONGER burning odor came from the back of the TV. I thought the entire set was going to catch on fire. So, like before, I immediately turned off the TV and unplugged it. However, unlike last time, I was not going to wait and plug it back in. I had come to terms that this TV was terminally defective. So, I called Amazon's excellent customer service department and the nice rep arranged for UPS to pick up the defective TV, issued me a full refund, and gave me a $15 credit and free one-day shipping on my next purchase. I would have liked to try this TV again in order to see if my TV was just a bad apple in an otherwise exceptional bunch, but they were out of stock at Amazon, hence the refund. I am very disappointed in my purchase and wish that I had had a similar experience as prior 5 and 4-star reviews, but I did not. I hope that others TVs work and that they do not receive the fire hazard that I did.", "Date": "March 31, 2011"}, {"Title": "Went into Black after 10 days. Poor", "Author": "fyllas", "ReviewID": "R1HDMUMSDGDNTG", "Overall": "1.0", "Content": "I was really hoping for something better. Beginning was ok, even though there was some flickering and white dots, but I thought it would go away. Did NOT.After 10 days, one morning, I tried to turn it on. And only a black screen.I will never buy a LG product again. Stick to Samsung as my other TV is.", "Date": "March 28, 2011"}, {"Title": "thats ok", "Author": "Vova pupkin", "ReviewID": "R11H3CV1ZHP1S2", "Overall": "3.0", "Content": "Well, if you are into movies, its a decent choice, but not the great. still you can see motion blurring and pixels. I would say its a decent choice for the budget. But if you are really picky about pic quality you shoal go with better models.", "Date": "January 23, 2011"}, {"Title": "Good TV but has flaws", "Author": "Brandon", "ReviewID": "R2HAB5X7HES5C9", "Overall": "3.0", "Content": "I really wanted to like this TV and everything is great with it. The picture is good, sound isn't bad and the 120hz doesn't hurt but I don't think it's really needed. Blu Rays look awesome, can play my xbox 360 on it no problem.But I don't know if this is a problem with my set or with them all but I have terrible light bleeding on the corners of my set. And it's noticeable during scenes with color, especially while playing a game like Metro 2033 or Alan Wake.Overall an OK TV.", "Date": "December 31, 2010"}, {"Title": "a Good TV", "Author": "apayton316", "ReviewID": "R3MRJAR5XS25AW", "Overall": "4.0", "Content": "I like it. One needs to look upclose before purchasing a TV I beleive! Up close alot of HDTV's pixilate! This tv does good upclose!", "Date": "December 31, 2010"}, {"Title": "Great television", "Author": "Tammy Windham", "ReviewID": "R30PYRF2QCZXZ5", "Overall": "5.0", "Content": "We bought this television not seeing one like it in stores. It turned out to be a very nice television!", "Date": "November 24, 2010"}, {"Title": "The Shortest Life Span TV ever.", "Author": "Cuong", "ReviewID": "R14T60PUAYXIG8", "Overall": "1.0", "Content": "Bought the TV on March 14, 2011 for my parents so they can watch tv in their room. When we first got it, it was great. The quality was good, picture was good, and we all liked it. After two years of enjoyment, the TV turned to crap yesterday, when my niece saw SMOKE coming out of the back of the TV. Mind you, we didn't watch TV much, maybe a few hours a week, and some week we didn't even turn it on. I don't want to get into a brand debate here, but my Sony TV lasted for 11 years no problem. my Panasonic plasma lasted 5 years and still going.This is the last of LG brand I will ever buy for a TV. I know sometime you get a bad unit but I also believe in you get what you pay for. Therefore, I'm going to spend a little more next time so thing can last longer, hopefully.", "Date": "October 21, 2013"}, {"Title": "Rewarding experience", "Author": "BeachBlonde \"~ llw\"", "ReviewID": "R1BG5OL3ZCEHIN", "Overall": "5.0", "Content": "My husband must have been one of the last dinosaurs to approve the purchase of a new HDTV. The old cathode ray tube worked just fine! But once this was in the house, he couldn't stop exclaiming about the quality of the picture - both with regular programming, and with sports. He was converted, and converted well. We originally had a few issues with the picture and sound, but a call to the LG Customer Service provided fast and knowledgeable support, and we've not had a problem since! The screen is non-reflective, which works well in our room which has windows facing it on two walls. It adjusts well to changes in ambient lighting within the room as well. Technical factors? Read someone else's review. We watch television for pleasure, and this set has been easy to operate, and provided us with hours of enjoyment. Now, would someone please have a word with our cable provider?", "Date": "July 8, 2013"}, {"Title": "Amazing image", "Author": "MUHAMMAD SAMIR", "ReviewID": "R33MFGYPZ6HDAC", "Overall": "5.0", "Content": "This is an amazing TV, cetails pop out of the screen, colors are vibrant (and adjustable) and ambient light sensor is really great.", "Date": "January 31, 2013"}, {"Title": "Perfect TV", "Author": "Nicholas Krzanowsky", "ReviewID": "RFJ7CJDXKZBKK", "Overall": "5.0", "Content": "First HD TV and I just love it.  Perfectly clear picture.  Most happy. Would definately recommend this TV to others.", "Date": "November 22, 2012"}, {"Title": "Wife's sewing room tv", "Author": "Jerry W. Trammell", "ReviewID": "R71ZUMG1AK26H", "Overall": "5.0", "Content": "I built my wife a 700sq ft sewing room over the garage.  I purchased this tv for it.  It has a great picture and she loves it.  The room is very large and she can see it from all points.  At first she said she thought it was too large now she loves it.", "Date": "January 20, 2012"}, {"Title": "Great for a Dorm", "Author": "College Mayjor", "ReviewID": "RQHTKMQNERFOO", "Overall": "5.0", "Content": "Got this TV as my growing up present for my college dorm at christmas. Had the whole hall in my room permanently.Seriously the TV was well priced at 650 when I got it thanksgiving 2010. Just so y'all know what I use this for: I play a pathetically large amount of video games on my 360.  Also, I hook my macbook up to it with an HDMI to mac cable for watching movies or shows or listening to music.The TV quality looks great but one thing I've noticed comparing it to my friends similar TV is that his blacks are blacker. By that I mean that when the screen is showing lots of colors, the blacks on the screen are like if someone held a black shirt in front of a bright ol lamp. Looking at reviews before I bought this I didn't understand the black blacks deal.Prepare for people to tell you your TV looks fake or cartoony or bad. The picture with 120Hz looks different. It looks like green screen on green screen kind of. I like it but some people don't. It definitely makes old or poor quality movies look older or at least points out the flaws.I at first used the feature of music on the TV by permanently having a flash drive in the back of the TV. Now I use my Xbox or more often now I just plug my macbook directly into my speaker system. Cut out the middle man.The sound on the TV is alright but if you're spending this much on a TV, go all the way and get some decent speakers. I spent $50 on a $100 set of broken box speakers from logitech. I'm pretty sure they're more for a computer or something but they sound a hell of a lot better then the TV's speakers and they were an older model.The energy saving feature is nice. When I'm playing with the window it's nice to have the screen brighter and then turn the energy saving on high when I play with just a small lamp on. It's probably good for the environment too. Minus the fact its a 42 inch lightbulb.In conclusion........ The  TV is nice and I would probably buy it again. They only thing is that at the speed technology moves, I might have gotten a cheaper one so could upgrade sooner. At the current, I'll have this baby for many years to come.", "Date": "January 18, 2012"}, {"Title": "Great for SPORTS!!", "Author": "Bobby G", "ReviewID": "R22SMBDOR4RSOD", "Overall": "5.0", "Content": "Bought this set last year (2010) around Black Friday deals. Felt like it was a great set for the price (I did a great deal of research). So, I've been using it for a year now, and NO PROBLEMS with the TV yet (knock on wood). Great picture for the fast motion of sports (which is what I usually watch). Just now adding components with HDMI, so I can't really speak to if I have enough b/w HDMI and AV jacks (someone else may be able to speak to this more than I, but that was my only hesitancy in getting it). Great set for the price! Sound seems better some simular sets in the price range. Overall: VERY PLEASED SO FAR!!", "Date": "December 28, 2011"}, {"Title": "LG LCD TV", "Author": "Manny", "ReviewID": "RIL8IPEB833UA", "Overall": "5.0", "Content": "I love my new TV! It took me a moment to adjust to the true motion feature but it is simply breathtaking the level of detail that i notice now on movies that i did not before.  I had to play around with the colors and the lighting quite a bit before being 100% satisfied with the picture quality on the TV witch kinda bothered me.  Gaming on this TV is amazing! the true motion makes games feel a lot more smoother a makes them look awesome, to b honest the TV is making want to play all my old games again because of how good it looks now.  Over all a very good buy at a great price and delivery was fast.", "Date": "August 21, 2011"}, {"Title": "Great TV!", "Author": "nehpets99", "ReviewID": "R2PNYJH4BAEQLX", "Overall": "4.0", "Content": "I've had my TV now for 2 weeks and have used it often.  The picture is very clear (especially in 1080) and I have not seen any ghosting that others have mentioned.The default settings are, in my opinion, worthless, and I changed them almost immediately.  The menus are very easy to navigate so I did not have a problem tweaking the settings to how I want.  I disabled the energy saver and the blur reducer so shows no longer look like a dim soap opera, however watching DVDs still get that \"soap opera\" effect.  If you have multiple systems hooked up to the TV, changing to them is a breeze.  The TV recognizes which inputs have something hooked up to them so switching to your DVD player or game system is as easy as pushing the \"Input\" button and selecting the appropriate input.", "Date": "June 27, 2011"}, {"Title": "Extremely happy!", "Author": "Emma", "ReviewID": "R37GZSM7IDXS6C", "Overall": "5.0", "Content": "I bought this TV about a year ago.  I have never had any problems with it.  We are extremely happy with the picture quality, sound, ease of use, etc.  I would definitely recommend this product to anyone!", "Date": "May 23, 2011"}, {"Title": "Great basic LCD TV", "Author": "Joe Smith", "ReviewID": "R107HX6ZTO5MY8", "Overall": "5.0", "Content": "I couldn't be happier with this TV.  I was looking for a no-frills second TV and didn't want any extras like Internet connectivity, since my primary, more expensive, TV already has all the bells and whistles.  My only criteria was the size (42\"), 1080p resolution, and a cost of no more than $600.00.  This set met all three, since Amazon had it on sale at a great price.  The picture quality is excellent, very sharp.  There are ample manual picture adjustments, but I just use the default \"Standard\" setting with a little more brightness added to suit the lighting in the room.My only two complaints really are not a complaints, but just facts of life with a TV in this price range:  it is on the thick side, and the bezel around the screen is a little wide, which is why I gave the TV four out of five stars for aesthetics.  However, this really is just being nit-picky, and it still looks great mounted on the wall.  One positive benefit of the thickness may be better speakers.  The speakers provide a much fuller sound without clipping or distorting than my other TV that cost three times the price.  I can only assume the thicker housing allows more room for bigger speakers that can better handle higher volumes.I don't game, so I can't comment on picture quality or motion response for this purpose.", "Date": "May 10, 2011"}, {"Title": "Good to go!", "Author": "Aaron", "ReviewID": "R25HPUEWBBDSUU", "Overall": "5.0", "Content": "I was looking for a TV to buy my girlfriend and I am a fan of LG so I looked them up and came across this gem.  We wanted to stay within the $470-$500 range so I took a big chance and bought this one used.  THIS SCARED ME A LOT TO DO!  I've never bought something like this used before, let alone without being able to physically see it.  But, I looked at Amazon's rating of favorable transactions of used products and was impressed with it so I thought \"what the hell\" and went for it.  The TV was described as being in great condition and that's exactly how it was when it arrived on time, in one piece, with no damage at all.  If you told me it was brand new you coulda fooled me.  We've had the TV for about a month and we love it.  The picture is great, volume is fine and we got it for way cheaper than what most people are selling them for.  All in all I was pleased with this purchase and am not so afraid of getting things gently used anymore.", "Date": "May 10, 2011"}, {"Title": "WOW! Even commercials look good on this TV!", "Author": "squirrelgirl \"squirrelgirl\"", "ReviewID": "R1UYAQPFRL6F45", "Overall": "5.0", "Content": "I LOVE this TV.  Picture is wonderful.  No problems whatsoever with delivery via free Amazon shipping.  My 14-year old set it up easily... only problem was that first there was no sound, but it was a Cox Cable box problem and not the TV.  If this should happen to you, you need to reset the cable box's audio settings, took only a second to fix.  Audio is fine, but would like to add speakers later.  Picture is visible from extreme side views.  So many settings to choose from if you do not like the HD \"soap opera\" effects.  Life with HD is wonderful- even the commercials look good!  Xbox looks amazing on this and was simple to hook up.For the $499 I paid through Amazon (yes- the price at one time dipped that low!) this TV is worth every penny.I was hesitant to buy a TV without seeing one in person, but this TV received excellent reviews from Consumer Reports, and they rated it #2 in the category of 40 to 42 inch HD TVs with 1080p (March 2011 issue).  #1 went to the Samsung UN40C5000 starting at $900.  This TV received \"very good\" for HD, standard definition, viewing angle, ease of remote and menu.  Sound quality received a \"good.\"  It got an official \"recommended\" from Consumer Reports (white box with blue check) if you're familiar with their ratings.Yes, the frame is shiny (not noticing it at all anymore), and the time is military when the TV turns on before the cable box kicks in, but these are the only two very trivial negatives in this overall wonderfully clear, amazing TV.", "Date": "May 9, 2011"}, {"Title": "Great for our media center", "Author": "ComradeF", "ReviewID": "R17C5UDERGGBFT", "Overall": "5.0", "Content": "We bought this as basically a big monitor for our media center. I can't really comment on all its jazzy features -- we watch all our stuff on Windows Media Center without any issue. We also surf the net sometimes too... after all, it's hooked to a PC. We don't watch any sports so I don't know if the \"TruMotion 120Hz\" stuff makes a difference. I think I disabled it, in fact.When it arrived, it had a dead pixel smack in the middle of the screen... ouch... but I called LG and they took care of it! A technician came to my house and confirmed that it did in fact have a dead pixel, and a week or so later he came back and installed a new screen. So if you're like me and you dread ordering monitors and the like online because of bad dead pixel policies (and you *know* you'll get a dead pixel that *one* time you order online), don't worry about this one!", "Date": "May 8, 2011"}, {"Title": "I just love this tv", "Author": "jamzombie", "ReviewID": "R1PG2CH54CV6S2", "Overall": "5.0", "Content": "i bought it for 578$ here in amazon and i keep looking at the reviews and the price went up lol and this is a great tv great size too!!", "Date": "April 28, 2011"}, {"Title": "Very Satisfied", "Author": "Seismic Guy", "ReviewID": "R1BBIPALXY7DWN", "Overall": "5.0", "Content": "Product arrived in excellent condition (with very sound packaging), roughly a week after I placed the order. Easy to set up (to a Comcast set-top box). I like the ability to customize the sound and picture. The picture quality is very high - bright, high definition, good color contrast. Better than my old Samsung DLP, which was only about 5 years old. It was going to cost me $300 to repair the Samsung and I got a new TV (of the same size) with an improved picture for <$600. You can't beat that.Only thing that I'd change on it is the 'glossy black frame' that surrounds the screen. My TV is near a big set of picture windows (that face north). Though the light coming in doesn't affect the picture, it does reflect off the frame which can be distracting at times.I'm very pleased overall.", "Date": "April 27, 2011"}, {"Title": "LG 42LD520 LCD TV", "Author": "Jackie Zloch", "ReviewID": "RL3IKLDJ5FLWB", "Overall": "5.0", "Content": "I was blown away with the service, I ordered this TV on Friday with Amazon and it was delivered Saturday a.m.  The box was in good shape and the TV was packed well.  I didn't have much trouble getting it set up and playing.  There are still some features that I haven't gotten around to learning, but I'm sure I will when I have more time.  I spent a lot of time looking and comparing and reading reviews before purchasing.  Price was a big concern to me.  I would have liked to have a high end LED yada yada yada, but for the price I paid, I'm delighted and so is my bank account.", "Date": "April 18, 2011"}, {"Title": "Good so far", "Author": "Lalith Perera", "ReviewID": "R2SLE3UWFENBHN", "Overall": "5.0", "Content": "Bought this after reading reviews and consumer reports recommendations. I am using it with an indoor antenna, picks up all air channels.  Pictures looked great out of the box, did not have to make any adjustments. Only annoyance is have to select the aspect ratio manually when switch to each channel. This is my first HDTV so not sure if this is a common problem/feature of them. So far very satisfied.", "Date": "April 17, 2011"}, {"Title": "LG 42LD520 42-Inch 1080p 120 Hz LCD HDTV WONDERFUL", "Author": "Rachel Yoakum \"Amazon Lover\"", "ReviewID": "R19BPE3AKBCJKY", "Overall": "5.0", "Content": "WONDERFUL!!!!! Picture is excellent. The people almost look real when you watch movies. Great price and amazing TV. Could not have made a better purchase!", "Date": "April 13, 2011"}, {"Title": "Great product for great price!", "Author": "J. Brosien", "ReviewID": "R3RH1FG7SXTGMB", "Overall": "5.0", "Content": "First time I got a TV online instead of walking into a store. Everything worked great! Was delivered on time and while I thought I might get disappointed ( 42\" for $578) - I am now pretty happy. I get an additional LG home entertainment system and the two work great together", "Date": "April 10, 2011"}, {"Title": "Great HDTV", "Author": "Carl A. Fleming \"dakar1\"", "ReviewID": "R90WZ01WIQJH4", "Overall": "5.0", "Content": "Got this from Amazon warehouse. Ordered with one day shipping. So one day old type TV and next day wonderful HD. This was supposed to be a refurbished TV. I don't think it had ever been turned on. It took about 5 minutes to set it up and I was in TV Land. I saw this identical item at a big name store for $200.00 more than I paid for mine. I would do it again and just might at that because I also need one for my rec room.", "Date": "April 7, 2011"}, {"Title": "Love this LG!!", "Author": "Rachel C Lee", "ReviewID": "R1XTC34GVCNG93", "Overall": "5.0", "Content": "We bought this TV during the pre-Christmas special pricing with free delivery!  It has been worth every penny!  It is a wonderful TV for the specs and price, and we cannot complain about it at all.  It is a perfect size for our living room.  The picture quality is amazing!  The remote is designed in a way that is easy to use.  LG makes great TVs, and I would recommend this to anyone.  Great buy!", "Date": "April 6, 2011"}, {"Title": "GREAT TV!", "Author": "fuzzywuzznt", "ReviewID": "R3NB2VY8NK6YKI", "Overall": "4.0", "Content": "shopped and compared several brands; samsung, sharp, panasonic, philips and almost bought another samsung, but going by other reviews i chose this lg. great picture and the sound is twice as good as my 3 year old 40\" samsung. my only complaint are the manuals-the manual provided in the box doesnt provide much past the very basics while the manual i downloaded at the lg website is more of a novel-printed on 8 1/2 X 11 its 171 pages and an inch thick, but very detailed. otherwise very happy so far. also purchased the 4 year warranty from square trade", "Date": "April 4, 2011"}, {"Title": "Finally Happy!!", "Author": "eaBen83", "ReviewID": "RXH745PIKA7O", "Overall": "5.0", "Content": "I have had this TV for two days and so far I am beyond pleased.  I already returned a 46\" Samsung and a 46\" Phillips LED-LCD for lack of color and picture quality.  The Samsung was alright and the Phillips was abysmal.  I LOVE this TV, it has a very crisp picture and clarity second to none.  I personally love the Vibrant preset with a few minor adjustments, as it is most like the bright and colorful plasmas out there without the worry of glare or burn in.  If you have been looking around for a great LCD at an amazing deal you can't go wrong with this one!  I bought the TV in \"like new\" condition from amazon deals and must say it truly was like new(still had the product registration card) and I saved $220 off the new price.  What a deal!! Highly recommend Amazon, LG and Amazon Wharehouse Deals for all who read this.  Also, the Standard setting is the most \"natural\" looking if that's what you are into, I just feel like the Vibrant has more pop and crisper whites.....No lack of video adjustment options to make it your own too.*UPDATE* 4/6/11: If you like the bright/crisp picture of a Plasma try these setting.  Unbelievable!!Energy Saving: offpicture mode: Vivid (or pick the setting you like least and therefore will not use anyway!)Back: 90 (A)Contrast: 90 (A)Brightness: 40-50 (A) (dims the black to much at a higher level)Sharpness: 60 (A)Color: 85 (A)Tint: 0Color Temp: 0 (A)Advanced SettingsDynamic Contrast: Medium (A)Dynamic Color: Medium (A)Clear White: HighSkin color: 0Noise Reduction: MediumDigital Noise Reduction: MediumGamma: Medium (A)Black Level: LowColor Gamma: WideTrue Motion: Off (still can't decide if I like this or not, will update after the Masters this weekend)Hope some find this useful, very bright and plasma like!*Update 4/14/11*Love it so much I bought a second one!!", "Date": "April 4, 2011"}, {"Title": "great purchase", "Author": "eSteph9", "ReviewID": "R1AHRKUL7MT1XD", "Overall": "5.0", "Content": "My item got here on time in its original packaging, i bought it brand new. Service was great, quick  and painless. I would buy from this person agai.", "Date": "March 28, 2011"}, {"Title": "Great LCD 42\"", "Author": "Joseph Zmijewski", "ReviewID": "RBHHIDX4A9V0T", "Overall": "5.0", "Content": "I purchased threw Amazon and it was more than I can imagine. I had a Sony 32\" XBR and this unit just blows the Sony away. Picture is clear. The only thing that is a problem, if you have to nit pick, it would be the TV's Clock, just that it is shown only in 24 Hr format. Another thing is the instruction Manual comes on a DVD/CD and it has every models directions on them. I would think that they separate them by model, wouldn't be that hard. But other than that, this TV is an Awesome one. I would recommend this to anyone.", "Date": "March 28, 2011"}, {"Title": "Nice TV for the price", "Author": "xeno", "ReviewID": "R1YO3E7S9542IW", "Overall": "4.0", "Content": "This certainly isn't the best TV out there, but for the price it is a nice value that will deliver a quality picture for those looking for a budget TV.  I owned a 47\" LD520, and I thought that the picture was blurry on that TV.  The 42\" has performed much better than it's larger counterpart, at least in my experience.  The picture does need some calibration out of the box.  If you buy, or own, a basic HDTV calibration blu-ray (I use AVE essentials), then you can get the TV to look pretty good, even without a professional calibration.  You won't find many TV's with ISF calibration settings in this price range, and it made it really easy to get the TV to demonstrate good clarity and color reproduction.  Granted, blacks on this TV are not as good as my plasma, but I didn't buy this TV to be a showpiece of electronics, either.  I use the TV for gaming, and I haven't had problems with motion blur or ghosting.For those considering plasma or LCD, I own both, and I can tell you that both formats have their pluses and minuses.  Plasmas have a sharper picture, better color reproduction, less motion blur, and deeper blacks in comparison to LCD/LED.  LCD/LED use less energy, run cooler, and have no burn-in or image retention issues in comparison to plamsa. There are exceptions, but this generally is the way the two formats compare.  I personally use LCD for gaming and plasma for everything else, so I don't have to worry about burn-in of static images when gaming.Anyway, long story short, my experience with the TV has been positive up to this point.  Since this model is no longer in production (or shortly will not be in production), it's a nice time to pick it up at a discounted price, in comparison to the new 2011 models.", "Date": "March 27, 2011"}, {"Title": "Love the tv!", "Author": "IdolFan \"DDT\"", "ReviewID": "R2EQV7GIYK5XJX", "Overall": "5.0", "Content": "This is the 2nd LG tv I've bought within the last month.  42LD550 with apps is a great tv with bells and whistles and I got it at a great price here at amazon.  I received the 42LD520 2 days ago and love it.  I didnt need another tv with apps.  I put this one in the room where I watch tv and hooked my pc and roku box to it.  The picture is great and the sound is very good.  The 2 way speakers equating to 4 is one major reason I purchased LG. I also got the extended warranty at a good price.  I actually paid more for this one then the one with the apps since I got it at an xtra good price.  Im not interested in 3D so I figured buy clearance at a good price and with customer input.  Amazon delivered both tvs way ahead of expected delivery.  Packaging was good.  Setting up was easy.  We havent called satellite to bring HD receivers because we are dropping it.  No need for it with apps and roku and indoor antenna for local channels.  I ordered the leaf antenna and its at the post office so Im excited to see what I can pick up with it.  My hubby hooked the RCA equivalent of the leaf to the other tv and got 4 channels.  We only have 4 local channels here.  We have a hill right behind us and one across the road so getting all 4 channels was unexpected and the picture is unbelievably good with just the indoor antenna.  If the occasion arises to buy another tv, it will be LG also.", "Date": "March 27, 2011"}, {"Title": "Incredible Quality & Value, Great for 1st-Time HDTV Owners", "Author": "Tami", "ReviewID": "R2TGMNVCJR5RPU", "Overall": "5.0", "Content": "When our old CRT tv finally gave up the ghost, I knew we had to upgrade to HD flatscreen. But the choices are overwhelming, and like most people I am extremely budget-conscious. What to choose? Plasma? LCD? LED LCD Backlit? What size? What features would fit best with the needs of our family? I love watching movies, but my son uses it more for his xbox & wii gaming, and we both like to watch some regular programming and sports as well.Summary of my experience (details will follow below):Price: A really good value, especially if you get it on sale; really, you can't afford NOT to buy itDelivery: Expensive but worth it. Timely and professional, not a scratch on the packaging.Ease of set-up: Ridiculously easy, anyone can set this up as long as you read the manual which is very clearly written. The interactive menu is a breeze to use so you can customize the picture YOU want to experience.Picture quality: OMG SO AMAZING!Definition: at 1080p, even non-HD broadcast channels look very crisp, sharp, and detailed. In some animated programs you can just barely see some very slight pixellation (chunky or jagged edges rather than completely smooth)in black lines, but only if you are REALLY looking.Color: The biggest concern I had was about the blacks as many reviewers say LCD doesn't handle blacks as well as plasma does - I see absolutely no problems with blacks, they are deep and still hold detail.Viewing angles: this is another area where LCD tvs sometimes get lower marks, but I don't know anyone who sits way off to the side to watch tv. This tv provides a nice wide viewing area so the picture still looks great even when seated off to the sides.Blur (sports primarily): Another quality that seems to get marked down in many LCD tvs, the 120Hz refresh rate makes this a nonexistent problem. No detectable blurring.Sound: The sound system is perfectly adequate, but the bass in particular is rather weak. A theater sound system really goes hand-in-hand with this tv for the optimum experience. I purchased the Onkyo HT-S3300 5.1-Channel Home Theater Receiver and Speaker Package (Black) which is a nice starter to go with it and it really enhances the viewing experience.Size: Since I've never owned a flat-screen tv, I was concerned a screen this size would completely overwhelm and dominate my smallish family room (approximately 12x15). Instead it is ideal, it does not take up much room at all and would work just as well in a larger room.Details:I did extensive research, and finally took the plunge when this 42\" LG went on sale for about $545.44. The shipping was expensive (almost $90) but very well-worth it, the delivery people took great care with it, got it here right when scheduled, and were very polite and professional. They won't set it up for you but they do unpack it so you can all inspect it for damage right then.It's so light that I was able to get it on the mount myself (I'm a 46 year old female). I bought the Jaguar 3 in 1 TV Stand - Cherry and Glossy Black to use with it and it looks great and proportionate on it.The tv was set up and ready to go in about a half-hour.How does it handle everything we wanted it to?Broadcast tv (even non-HD broadcasts) looks incredible - sharp, nicely saturated colors, and each program is presented at the correct size without stretching or distorting the image.Video games: this is the tv Xbox was made for, huge crisp image, color that you don't get with a regular tube tv, just an overall amazing experience. Use the XBox's HDMI capability to get all the benefits. The wii is not capable of hi-definition output but still looks great.DVDs: Incredible, and again I recommend a theater sound system of some sort to enhance the sound. I was never interested in Blu-ray but this tv's capabilities have causes me to put it on my wish list. If DVDs look this good, I can only imagine Blu-ray will look amazing.The menu is very easy to operate and you will want to experiment with the picture and lighting presets to determine which is best for you. This tv offers a nice variety of presets so you are pretty much guaranteed to get exactly what you want. Personally I don't like the picture quite as bright as some people may, and there is a setting for that as well.Overall recommendation: While I purchased this tv at a sale price of $545.44, I would buy it even at a higher price up to $750.00. The price I got made this a STEAL. Don't forget to add the cost of shipping on to the purchase price when budgeting - in my area (rural ND) the additional cost was about $90.  It was still MORE than worth it, with gas prices at $3.60/gallon it would have cost nearly $30 in gas alone for me to drive to a city for a comparable tv at a comparable price. I completely recommend this tv, particularly if you are new to flat-screen technology and aren't sure what you should be looking for. It will blow you away and you will wonder how you got along without it for so long! I do recommend that you purchase a theater-style sound system to go with it, but by no means is that a requirement (particularly if you live in an apartment). But once you have a picture THIS good, particularly if you are a movie buff, Xbox or PS3 player, you'll want the sound to match.", "Date": "March 27, 2011"}, {"Title": "Our First HDTV, very Happy with this TV", "Author": "R. Foote \"The glass is full! 1/2 water, 1/2 a...", "ReviewID": "R2PX6C2Q4HYWHZ", "Overall": "5.0", "Content": "We bought this (the last one at the retailer) for less than online - full warranty, etc.  Already had HD Cable/DVR.  After resetting the Cable box to 1080 (had to call them for help)  we've been blown away. Sound, controls, etc.  While this model does NOT have the internet, netcast apps and stuff, many bluray players do.  We bought the LG bluray player that has all that stuff.  The player has upshift so even our old DVDs look better than ever.  Even though I'm a geek, it was really easy to set up.  Get the HDMI cables.  You can find good ones online under $5.  We record several series, movies and watch DVD.  Even our VCR tapes look pretty good.  It is fun to finally be able to read the fine print on the car lease ads and see what the fine print really says!BTW, it fits perfectly on our little $20 Ikea stand that was under our old TV  stand.  No need for $100s or a wall mount and all that stuff.  The sound is fine.  Maybe a home theater someday, but no need now.", "Date": "March 26, 2011"}, {"Title": "LG42LD520, Bang for your buck!!", "Author": "SLC", "ReviewID": "R2IYAANXUCI3ZR", "Overall": "5.0", "Content": "My wife and I purchased this t.v. cause we were tired of our small 32\" sharp, it has a nice picture just a little small for the room. The new t.v. arrived and the small one got demoted to the bed room. The first one we received had the flashlight effect going on so we returned it with no issues, (thanks amazon), the second one shipped even faster than the first one and when we hooked it up, it worked great. The picture is very good, especially when playing the ps3 or watching blue rays. The size of the t.v. is perfect for the room and it looks good too!! All in all we are very pleased with this t.v. and with the service we received from amazon!P.S. The price was outstanding, this t.v. was $321.00 more at our local best buy!!!", "Date": "March 23, 2011"}, {"Title": "LG 42\" HDTV", "Author": "E. Speyer", "ReviewID": "R1KUDWLSBVDT53", "Overall": "4.0", "Content": "I've had my TV for about 2 weeks and am enjoying watching true HDTV and movies. Once I finally got it set up and working (set up wasn't bad, but had to have a professional come out and do the settings and get it working with the universal remote) it was great, but this TV has without a doubt the most useless manual I've ever seen. Anyway, happy with it now.", "Date": "February 10, 2011"}, {"Title": "After looking FOREVER very happy I bought it", "Author": "Jess", "ReviewID": "R3JYYJ0OEA466G", "Overall": "5.0", "Content": "Reading reviews is always something I do and this TV had great reviews. After thinking it over I bought a TV online! I am very happy I did. I was extremely nervous about shipping but everything went great. The picture is beautiful and of course the whole unit is visually appealing. I would recommend LG to anyone if  this is what they all look like!", "Date": "February 8, 2011"}, {"Title": "Awesome picture", "Author": "Pistol", "ReviewID": "RC9Q80TVRWH72", "Overall": "5.0", "Content": "Got this at an unbelievable price shortly after New Years.  Never saw it in person before ordering so I had to trust the reviews, but felt I couldn't go wrong for the price.  So far it's been a great product for our family room.  We were limited by an entertainment center on the size we could get (42\" was the max).The picture on this is amazing.  My wife even gets confused whether she's watching HD or not - of course I can tell, but the SD picture is still good.  It has all the inputs I need.My only concern is the sound quality was not as good as I hoped.  I guess that's what you get with rear speakers.  I don't have surround sound in the family room (wife doesn't approve) so I'm stuck with the tv speakers for now.  Not sure if it's a setting on my cable or the tv, but the sound is actually better on SD channels than HD channels.  I deal with it because the picture quality is so good.", "Date": "February 7, 2011"}, {"Title": "Consumer Reports correct! Excellent HDTV", "Author": "Mark D Levine", "ReviewID": "R25C1Y6K311N1U", "Overall": "5.0", "Content": "Consumer reports has this HDTV as there second highest rated 40-42 inch TV, and this one is a Best Buy. The top rated one was not a best buy or recommended.  Picture quality is excellent, and it is easy to set-up. I haven't found really any negatives about this product.  It works pretty much as expected.  The \"sports\" preset makes everyone look a little pasty, but you can set-up your own presets. I also got it for a spectacular price before xmas. The Tru-motion (120Hz) works well, and it makes you feel you are almost there when watching sports.  Excellent value.", "Date": "January 30, 2011"}, {"Title": "TOTALY WORTH IT!!!", "Author": "kamron", "ReviewID": "R2K0QIEOBSRG3J", "Overall": "5.0", "Content": "After doing a lot of research on TV's we learned that Samsung is the \"popular\" choice, Sony is known for its dependable quality and popular name, and LG is known for their quality of electronics. I'm sure there are several differing opinions out there, but every LG cell phone or electronic has been incredible. After buying an Insignia 42 inch LED from Best Buy, we returned the piece of junk, and ended up coming home with this baby. It was an open box item, so the price was incredible. Because it was such a cheap price my wife let me pick out a blu-ray player too. We took it home, set it up within five minutes, turned it on and WOW!! I am not a TV junkie but it was the best picture I've ever seen. The different modes to view things is awesome. Cinema mode rocks, Sports mode is amazing, etc. We spent two hours putting in different movies (all normal DVDs, we have no blu-rays. Yet) and just seeing how it looked. It was a blast, and we were so impressed with the incredible picture quality. It looked like we were behind the camera. We played a few edited dvd from clean flix and even those looked AWESOME! Sound was great. Picture is unreal. Size is just right for a mid-size living room. Price and quality cannot be beat. We are thrilled. Can't wait to see how the blu-rays look.", "Date": "January 27, 2011"}, {"Title": "My first flat-screen and I love it!", "Author": "J", "ReviewID": "R25ACJF28W7BL", "Overall": "5.0", "Content": "I had put off buying a flat-screen for years and finally decided to go for it. After doing some  research on different tvs, I came across this one on Amazon. It had all the specs I was looking for and was offered at the best price. After reading the good reviews, I decided that this was it. I was a little nervous about buying a tv that I hadn't seen in person, as well as buying online rather than a brick and mortar store. I'm very happy to say that I had nothing to worry about.I ordered the LG 42LD520 on Dec. 14.  The next day I got an email from the delivery company asking me to call to schedule delivery, so I did, and I had the tv set up in my home on Dec. 16! Delivery was very fast and very easy...and free! The delivery guys were great and set up the tv for me by putting the stand together and set the tv on the entertainment center.The HD picture is great with out-of-the-box settings, but I've been trying out different settings and now I think it looks even better! When I first got the tv I didn't yet have an HD cable box and I thought that standard def tv looked pretty good on it too. I also want to add that I think the exterior of the tv looks great--better than most other tvs I've seen. It looks very sleek. The speakers are located on the back of the tv, and a lot of people have complained about the sound not being great. I have the tv in a bedroom rather than a large living room, so it's perfect for me.If you're looking for a 42 inch lcd tv, I would definitely recommend this one.", "Date": "January 25, 2011"}, {"Title": "Great LCD", "Author": "Luke J. Gorsett \"Dukiz\"", "ReviewID": "RJ02JPZ3ITHYA", "Overall": "5.0", "Content": "The TV is great! I will say this though. Read Richard L. Marrow's review (above)on this TV and do exactly as he says. The default picture settings are awful! In his review he provides the perfect settings for the best results. Turn off the TRUMOTION!!! unless you want to feel like you're watching a mid-day soap opera. I don't know what they were thinking with that. I watched \"Inception\" as my first blu-ray and my head was hurting because it looked so wierd. With the new settings it's like I'm in a movie theatre. This is my first LCD so I'm no expert, but seems like Mr. Marrow has got it all figured out. Buy it and enjoy.", "Date": "January 24, 2011"}, {"Title": "LG TV", "Author": "Larry Hinds", "ReviewID": "R2GKTD99DRKEI8", "Overall": "5.0", "Content": "I bought this LG TV to replace a 42\" Philips TV. The Philips TV only lasted about three years. I have only had this LG TV for about a month but I can tell that it is a better quality TV than the Philips. The picture is very easy to adjust for sports, movies, etc. The picture is super and the audio is much better that the Philips.", "Date": "January 24, 2011"}, {"Title": "Two Thumbs Up", "Author": "M. Hofelich", "ReviewID": "R1G1DD2JLG9G32", "Overall": "4.0", "Content": "Update:I've now owned this television set for eleven months. I'm still very pleased with it. The sound issues remain my only complaint. I intend to purchase separate speakers at some point to help with this issue.Original Review:I'm extremely pleased with this television. I purchased it in November 2010. The picture is crisp and bright. I have not had to make any picture adjustments. The sound could use a little help. Sometimes it sounds a little muffled, and turning the volume up doesn't help. However, I'm not sure if this is an issue with the television or my cable provider (Comcast).", "Date": "January 21, 2011"}, {"Title": "lg 42 tv", "Author": "dario", "ReviewID": "R2NJ7GBCMYOLA6", "Overall": "5.0", "Content": "This TV has excelent quality picture and sound.  The only thing I did not like was the remote did not allow adjusting picture size easily.", "Date": "January 17, 2011"}, {"Title": "LG 42 lcd, hdtv", "Author": "skipper", "ReviewID": "R2QOFECZ2VG973", "Overall": "5.0", "Content": "I made this purchase after reviewing consumer opinions and the specs. I was looking for a particular size screen, specs., and price point and this LG fit the niche. (I did not previously see the product in person, so I was taking a leap of faith with it.)  I can report that I am very pleased with the quality and picture.  For the price, this is a great TV.  The colors are bright and sharp.  HD content looks fantastic.  Easy to set up.  I admit I was never an LG fan, but this TV has really impressed me.  My only criticism (and this is a just personal preference) is that I am not a fan of piano black frames in general. (I don't like the reflection the frame can cause when in a sunny room and it is a dust magnet, but that is a minor annoyance. The style of the set is very simple and sleek; a plus, and I even like the simple, unobtrusive curved red/blue on/off light in the lower right corner of the set.)  Overall, I am very pleased with my purchase.", "Date": "January 17, 2011"}, {"Title": "Love this TV!", "Author": "vol1967", "ReviewID": "R10G29PV0NWOGJ", "Overall": "5.0", "Content": "I read other reviews at Amazon.com before purchasing this television.  I haven't found that I had to adjust anything.  The picture was just fine right out of the box.", "Date": "January 10, 2011"}, {"Title": "Great product. Delivery not so good.", "Author": "D. Ostrander", "ReviewID": "RIGW2KVTPFXX3", "Overall": "4.0", "Content": "The LG TV is what we expected since being a fan of all LG products over the years. I was a little disappointed in the 3rd party delivery service that Amazon has contracted with in the Detroit area.  Had delivery scheduled only to be called by the service to say they didn't have anyone available to delivery the TV. Fortunately I did not have to rearrange my schedule because of this. Delivery of the TV was then scheduled for the next day and arrived as planned. I am retired so this did not cause much of a problem.", "Date": "January 9, 2011"}, {"Title": "42in 1080p 120 hz lcd hdtv", "Author": "richard", "ReviewID": "R4GQB5H105M8H", "Overall": "5.0", "Content": "great tv  best picture like the opions on the tv, easy to hook up dvd player, the hdmi cable I ordered from amazon too works great on my dvd player to the tv, when you watch sports on the tv you get the best seat in the house I am very happy many thanks.***** THANKS LG", "Date": "January 1, 2011"}, {"Title": "very good choice", "Author": "trebor", "ReviewID": "R2SQJRUK8EOM7N", "Overall": "5.0", "Content": "Caught this LG tv for a very affordale price on Cyber Monday. Arrived here no problem, set up was very easy, picture and sound are very good. Not a gamer here so can't judge that aspect. 42\" was just what I was looking for.", "Date": "December 31, 2010"}, {"Title": "Great Buy!", "Author": "KimBrand137", "ReviewID": "R23ZNKMRFR2VEE", "Overall": "5.0", "Content": "I researched tons of TV's to get for my husband for Christmas...the cheapest and most convenient was Here on Amazon!! The TV it self is great...but the shipping was slower than usual..for amazon i was suprised. If your buying a TV don't foget to buy a wall mount and an HDMI cord to go with it...then the purchace will be complete (if you want thoes items). I dont have any cons besides the shipping...but it got here before christmas(might have been the holidays)!!", "Date": "December 31, 2010"}, {"Title": "LG42LD520", "Author": "Carlos D. Sanga", "ReviewID": "RIUTPKDRPRY7B", "Overall": "4.0", "Content": "This LG 42inch flat screen LCD TV with 120 Hz 1080p is great.  Picture and sound is great.  I just had this tv for a couple of weeks.  I am happy with my purchase.", "Date": "December 31, 2010"}, {"Title": "its nice for the money", "Author": "dj", "ReviewID": "RDQC68ERGKK3F", "Overall": "4.0", "Content": "Its picture is nice although on some games its a little choppy but on blue ray and hd tv its amazing", "Date": "December 31, 2010"}, {"Title": "BAD TV", "Author": "David Bennion", "ReviewID": "RG2DCDY4047T9", "Overall": "1.0", "Content": "I HAVE HAD THE TV FOR AFEW YEARS NOW WITH LIMTED USAGE AND A VERTICAL LINE HAS APPEARED IN THE TV SCREEN. LG OFFERS NO SUPPORT WITH A GUESSTIMATE OF $225 PLUS PARTS FOR REPAIR. NOT A GREAT VALUE TO HAVE THE TV BREAK IN SUCH A SHORT PERIOD OF TIME.", "Date": "December 30, 2010"}, {"Title": "Excellent Quality", "Author": "Paresh Bhatia \"Paresh\"", "ReviewID": "RAV3XCYTHHA8K", "Overall": "5.0", "Content": "Bought this TV aroun May 2010, excellent picture quality. Sound is above average, I have a surround sound system with it so i hardly switch on to TV sound.There is not a single complaint on the TV till date. I am haapy that had shell less $$ as compare to samsung or a sony TV of same Tech specs.", "Date": "December 30, 2010"}, {"Title": "Great TV", "Author": "Victor Neilson", "ReviewID": "RDTHLSVV5KG7R", "Overall": "5.0", "Content": "Bought this TV during black Friday and got a good price.  The TV is worth the money.  Right out of the box the colors were great and needed just minor adjustments.  I recommended this TV to my cousin and he loves it also.  My selling point was not only the price but the rating in Consumer Reports.  Great product.", "Date": "December 29, 2010"}, {"Title": "pleased", "Author": "cindy9716", "ReviewID": "R3QBAVYN8R7QDP", "Overall": "5.0", "Content": "We are totally pleased with our purchase. Delivery was exactly as they said. TV came in perfect condition and works fantastic.", "Date": "December 27, 2010"}, {"Title": "wonderful", "Author": "Stephanie L. Andrews \"mother of 3\"", "ReviewID": "R1NZWU8O983Z1O", "Overall": "5.0", "Content": "Iam very pleased with the purchase once i received it after it was lost but amazon took care of the problem Thank you", "Date": "December 21, 2010"}, {"Title": "Very Good LG LCD", "Author": "J. Keeler", "ReviewID": "R1X3M14X2VP7I5", "Overall": "5.0", "Content": "I've owned plasma, lcd and projector HDTV's and recently purchased this LG 42\" set. I'm very impressed with the overall picture quality.Great image quality and very accurate colors after tweaking the attributes a bit.I haven't tested it with a CRT monitor, but gaming lag seems very low.Amazing clarity and sharpness, works very well as a PC Monitor using HDMI.I believe the setting \"Just Scan\" is 1:1 pixel mapping.120hz for Sports! It's great! I don't like it at all for any other viewing other than sports. The Trumotion 120hz feature can be disabled or enabled at any time. It creates a rather unnatural looking \"Live Shoot\" \"Home Video\" kind of effect--but it works well with live action sporting events such as football. In 60hz mode this LCD performs well with sports but you'll notice slightly blurry, slightly pixellated \"artifacts\" when a football player is running (certain camera angles are worse/better) pixellated turf at times, etc. It's not hugely noticeable but it's there when you really focus on it in fast motion sports. The Trumotion feature almost eliminates these artifact/blur issues, I leave it on during NFL games--yes the commercials look a bit weird with it, but for the live action game I love it.Black level could be better, some backlight flashlighting on an all-black background--one of the tradeoffs with many LCD's.Cooler than a plasma which heats up a smaller room, great (almost too much so) clarity and definition compared even to most plasmas (plasmas usually have a slightly softer definition that many believe looks more natural)Lower resolution standard TV and even lower res pictures on a PC suffer, this baby loves 720p/1080p/1080i and general high res content.Excellent \"tweakability\" the controls are great for getting the picture you want. Many different modes, cinema with warmer hues, game mode with all specialty controls turned off, and one thing I love is this TV remembers your picture settings per input. A lot of tv's in this range don't do this. Tweak the Cinema picture setting on your Blu Ray HDMI 1? It remembers those settings for that HDMI 1 input and all other inputs when you switch inputs.", "Date": "August 30, 2010"}, {"Title": "Another Great LG Monitor......Oops! I Mean TV!", "Author": "Pete Moss \"Pete Moss\"", "ReviewID": "R2LY7FYZTU83GF", "Overall": "5.0", "Content": "Another great monitor from LG! Awesome picture! Acceptable sound, but who uses TV sound anymore? Optical out to my surround system and \"Wow\"! Sleek package. A multitude of connectivity options. Easy setup. Broke her in during a 2 hour session of Borderlands.  As with my 32\" LG 32LH40 monitor, awesome graphics! No blurring even during the most demanding video game action sequences! I'm sold on LG products! The $577 price directly from Amazon and the 4-day free shipping are additional selling points!Oh yea, works great as a TV also!", "Date": "July 27, 2010"}, {"Title": "Great Value Purchase", "Author": "Nick", "ReviewID": "R2ZLT6VYJHVSAU", "Overall": "5.0", "Content": "Completly satisfied with this TV. Crisp clear picture and sound quality is great.Three modes are very useful, you can enjoy cinema, sport as required.", "Date": "July 14, 2010"}, {"Title": "We Like it alot!", "Author": "Kelly B. Behm", "ReviewID": "R334AQ7XHTCYLU", "Overall": "5.0", "Content": "Arrived on time and was Easy to assemble. (My son did it) works like a charm and we have not had any issues with it at all.  Picture is fantastic and i was able to get rid of a component switch with all the inputs. The sound quality is great even with out any other speakers.  This was a great purchase.", "Date": "March 5, 2011"}, {"Title": "Nice LG", "Author": "msgood", "ReviewID": "R11RZV3JF2BO42", "Overall": "4.0", "Content": "This is my first 42\" and I must admit that it is a very nice television and the picture quality is amazing. The only thing that I did not care for is the quality of the sound that comes out of the TV so what I did was purchased a sony sound system and added it to this and wow! what a big difference.", "Date": "February 11, 2011"}, {"Title": "Great product from LG Electronics", "Author": "Ananda", "ReviewID": "R1T7I688GFOLNS", "Overall": "4.0", "Content": "Pros: Great product for an affordable price. The pictures are very clear with 120Hz. On screen operational manual for easy of use. USB connection for images and mp3 playback.Cons: Cannot play movie files with USB media. No analog audio out (only digital optical audio out).", "Date": "July 25, 2010"}, {"Title": "great tv", "Author": "jorge", "ReviewID": "R2VNONM2MVZ29X", "Overall": "4.0", "Content": "i bought this tv a mnth ago i could not be happier the sound rocks and the 120 tru motion rulesthere are so many options on sound picture colors everythingupdateits been about six monts and i tweeked  with the settings and got it to look perfect so awesome no regrets whatsoever like looking out a window", "Date": "February 24, 2011"}, {"Title": "Good TV for the money...", "Author": "Dadman", "ReviewID": "RP4OM1BFA78UM", "Overall": "4.0", "Content": "Good TV for the money... color, at times, seems slightly off.  We can't seem to fix this by adjustments, but it still has a good picture and sound 99% of the time.", "Date": "February 11, 2011"}, {"Title": "lg 520 hdlcd tv120hz", "Author": "Randall D. Wilburn \".randy52\"", "ReviewID": "R2MHKECP9Y1XX1", "Overall": "5.0", "Content": "orderd this set jan 15 2011had the set in my home less than a week delivery was fast the gentelman who braught it helped me set it up to direct tv we fool with it for awhile but picture was fuzzzy so i watched it like that last night i was gona call direct tv the next day well i got up the next morning and was siting on my sofa  same thing just fuzz i went over to sit in my recliner to think and i got up to turn the screen a littel towards me and wnen i did i was shocked i couldnt beleive my eys the picture on this set is amazing i was so surprized this set is greatso far 2 THUMBS UP  RANDALL W", "Date": "January 22, 2011"}, {"Title": "Happy with purchase", "Author": "Patricia", "ReviewID": "R14T70JK6B5EX9", "Overall": "5.0", "Content": "We've had this tv for 2 months and are very pleased.  We added surround sound as the sound is very basic.  We also have HD which improves the picture on any tv.  Very easy to set up.", "Date": "January 17, 2011"}, {"Title": "Very nice 120hz LCD TV", "Author": "Zippy1450", "ReviewID": "R142GOBXNYAETS", "Overall": "5.0", "Content": "Our 3 year old 34\" Sony Trinitron CRT 1080 HD TV went on the frizzle, replaced it with this TV, extremely happy. Watched World Cup matches, no motion blur. Great sound !", "Date": "July 12, 2010"}, {"Title": "HDTV", "Author": "Intrigue", "ReviewID": "RYR1XX0IE2P2E", "Overall": "5.0", "Content": "Wonderful. But now I think I should have bought TV with internet streaming capacity for netflix. But for the product I bought, it was an excellent choice.", "Date": "November 21, 2010"}, {"Title": "LG TV", "Author": "JMS", "ReviewID": "RV5GL85RXB6GS", "Overall": "5.0", "Content": "Service is great and quick, except for two weather delays which could not be helped.  It is a wonderful TV.", "Date": "February 28, 2011"}, {"Title": "LG Rocks", "Author": "A.M.J.", "ReviewID": "R3921U8KT2CFST", "Overall": "4.0", "Content": "We love this TV. Replaced a 52 inch rear projection tv. Smaller size is hardly noticed. Bright, crisp picture. Can't wait to compliment this screen with a LG Blu-ray player to really see he HD! Hard to keep the kids fingerprints off the gloss exterior,at least I can tell when to dust thanks to them.", "Date": "September 12, 2010"}, {"Title": "Not so great", "Author": "TLRocket", "ReviewID": "R11TFO4AYKQO95", "Overall": "3.0", "Content": "The TV arrived quickly but after setting it up with cable, we noticed that there isn't any sound when you turn on the TV. We have to turn it off then turn it back on to get sound, every... single... time! I will be calling LG shortly regarding this problem.", "Date": "August 23, 2010"}, {"Title": "burning smell", "Author": "Matt", "ReviewID": "R1VKMI5UUCLDNA", "Overall": "1.0", "Content": "Just got it turned it on and it smells like burning plastic returning it!  LG wanted to come service it, I don't want a TV that smells burnt from the box!  Stick with samsung!!!", "Date": "January 11, 2011"}, {"Title": "Cheap Plastic", "Author": "John \"John\"", "ReviewID": "R2WQBYFO6UQG23", "Overall": "1.0", "Content": "We bought one of these then returned it only to find the next one had the same problem. The problem being that the front plastic around the screen is all shiny and black which is great unless there is an assembly mistake. Apparently it is assembled by snapping pieces together and for both the ones we tried some the snapping points were not snapped in (and could not be snapped in no matter what). What ended up happening was that the shiny black plastic was all warped so you get the clown mirror effect all around the TV. This may have been ok for some cheap Visio or something but not for the money we paid for this TV. I never even turned them on - maybe they are great, maybe not. But, they are made of cheap plastic and the assembly workers did a terrible job. We are going to return this again tomorrow and forget about LG from now on ... you would think the part you see would be the part they actually try to make presentable.", "Date": "July 5, 2010"}, {"Title": "Damaged!", "Author": "stacy-ann", "ReviewID": "R1FNR1EOJGINOL", "Overall": "1.0", "Content": "I only just received the package on New Years Eve and my tv screen is damaged! I am soooooooo disappointed!I realised my greatest fear in relation to buying electronics online!!!", "Date": "January 1, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Full HD 1080p Resolution\nTruMotion 120Hz\n100,000:1 Dynamic Contrast Ratio\nPicture Wizard II\nSmart Energy Savings", "Name": "LG 42LD520 42-Inch 1080p 120 Hz LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41bJAl854nL._SX300_.jpg", "ProductID": "B0039RV0DM"}}