{"Reviews": [{"Title": "Great deal", "Author": "bs-2010", "ReviewID": "R32ZEW4C3FAE8Y", "Overall": "5.0", "Content": "I bought this Vizio because I needed a decent sized tv that was relatively cheap but would also fit into a dorm room. The picture quality is excellent and the difference between this tv's 720p and other 1080p is negligible. At first colors looked a little washed out on my 360 but after fiddling with the tv/xbox settings it now looks superb. The size of the tv is also nice...it is lightweight and is super slim. The only thing that could be improved on is the speakers which imo are still a lot better than most tv's in this price range/size. It sounds a little hollow and could use more bass but overall it isn't too bad (it helps to turn off srs surround and switch to rock equalizer). Volume also isn't too big of an issue with this tv like on other tv's since this has front facing speakers as opposed to rear speakers. There is also very little lag or ghosting at 8ms and 60ghz refresh rates.  Highly recommended if you are looking for a tv that is cost efficient and has good picture quality.", "Date": "August 18, 2010"}, {"Title": "Decent for Guest Room; Not for Master Bedroom.", "Author": "Gordon Gekko \"HDTheaterMan\"", "ReviewID": "R10BWP2JX5DINK", "Overall": "2.0", "Content": "I purchased this LED for our guest room when the price was $299 at Target.  They dropped the price down to $209 and I was able to get a price adjustment on the guest room TV and thought it was too good of a deal to pass up for a TV we needed for our bedroom.  I am using over-the-air (OTA) feed for my guest room and DirecTV for my bedroom.At $209 for an LED TV, I would normally say \"beggars can't be choosers\" and be happy that I got such a good deal.  However, given the overwhelming glowing reviews for this product here on Amazon, I feel I should mention a design flaw to make sure everyone is aware of what they are buying.  You can read the \"positives\" from the other reviews on here.When watching dark programming or dark colors, you can see waves in the picture emanating from the center of the screen going both up and down.  It is more evident in \"Movie\" mode and less in \"Retail\" mode.  Likely do to the \"Retail\" mode being the most used in store displays.  Those who currently own this model, give it a try.  At first I thought it might be a singularly bad TV I bought.  Only, I went to our guest room to see if the other TV pulsated with waves.  Sure enough, the same thing.This engineering flaw may not bother some people, but it does me regardless of the price.  What is funny is my wife was the first to notice these waves.  This, coming from a woman who initially couldn't tell the difference between an HD video feed and an SD video feed.  Bless her heart, she got it right with this baby.These were my first Vizio TVs.  I will be keeping this model in my guest room but returning the model for my bedroom.  We watch too much programming in our bedroom to look past this issue.Again, maybe this warning will not deter someone set on a deal like this.  I suggest going into Target and changing the picture setting from \"Retail\" to \"Movie\" to see for yourself.Good luck!", "Date": "November 22, 2010"}, {"Title": "Great picture, sounds standard!", "Author": "hatebreed1885", "ReviewID": "R2Q7TI8ZRN9MGS", "Overall": "4.0", "Content": "The picture on this TV is far above my expectations. The image is bright, crisp and vibrant. The remote is a little unresponsive, have to press a couple times to get it to respond sometimes. The sound is mediocre, nothing to run and tell your friends about. All in all, this is a great tv, the flaws are so minor(IMO) when compared to the quality of the television.", "Date": "August 29, 2010"}, {"Title": "Great", "Author": "TR2516", "ReviewID": "R2PBDFV3L2GHU8", "Overall": "5.0", "Content": "This tv is great! It is plenty big for a bedroom, and very crisp. The picture is perfect, the only flaw is the sound. The speakers in it could be a little better, but they are still not terrible. Overall, this tv was easily worth the cost. Vizio is doing something right and they keep me with them, this is my 3rd Vizio tv and they are all great.", "Date": "August 21, 2010"}, {"Title": "Love it!!", "Author": "Brenda S. Taylor", "ReviewID": "R23HGF4B0R48UB", "Overall": "5.0", "Content": "I had a smaller Vizio that was great but too small for my room. I read many reviews about the 26in and they sounded good except some thought the sound quality was lacking. To my pleasure the sound is great as well as the whole TV. I feel this brand is superior compared to Samsung which is too expensive and then a Sony that a relative had and I didn't care for the picture quality as well as this. You'll love it!!", "Date": "October 13, 2010"}, {"Title": "Pretty Good TV", "Author": "O.P.T. \"O.P.T.\"", "ReviewID": "R3WWPXCAJCETO", "Overall": "4.0", "Content": "For the most part I love this TV.  It's thin, lightweight, stylish, and has good picture and sound quality.  My only complaint is the volume...I like to watch TV rather quietly in my bedroom, and volume setting 1 is a bit too low while the next notch up (volume 2) is too high.  So I have to choose between having to strain to hear the TV or being slightly annoyed at the higher volume.Update: Another thing that's been really annoying me with this TV lately is that it produces some very noticeable after-images.  I have a Tivo hooked up to it, and whenever I pause a program for more than a couple of minutes and then go back to it, there will often be a some ghosting or burn-in that lasts for nearly a minute (especially areas of white text...those last the longest).  Annoying!  I have a Sony Bravia also and it does not have this issue.", "Date": "August 22, 2010"}, {"Title": "Amazing TV", "Author": "sl926", "ReviewID": "R22SEHC6VO8X5W", "Overall": "5.0", "Content": "I was shopping around for a 26\" LCD tv for some time and I came across this one. The fact that it was \"LED\" pretty much caught my attention. The picture quality is great 5/5, the sound quality is decent, not as bad as what others say, 4/5. I like the fact that it's LED and only 0.86\" thin! Response time is not bad at all and I haven't experienced any ghosting yet. Well recommended and would definitely buy again for this price!", "Date": "October 20, 2010"}, {"Title": "Great Purchase", "Author": "BSchock", "ReviewID": "R13QQERKP2885Q", "Overall": "5.0", "Content": "I bought this TV as a replacement for my bedroom TV (which was an old tube TV) and I love it. I do wish that it had a higher stand but all-in-all, that is my only gripe. I LOVE that when you do the set-up and scan for channels, it picks up digital channels that my other TVs didnt. It has great picture and good sound. I like that it has a sleep timer on it as well. Definitely would recommend for others to buy this TV. I bought mine at Target for the same price as it is listed for on Amazon.com.", "Date": "October 20, 2010"}, {"Title": "Perfect Fit!!!", "Author": "Scott C.", "ReviewID": "R3KIR3PZ45K3PI", "Overall": "5.0", "Content": "I bought this television for my daughter's dorm room. It's the perfect size and the picture quality is excellent (dorm cable feed, notwithstanding). I haven't seen it in its true HD \"glory\" but the sleek design and size is perfect. GREAT TV for a GREAT price.", "Date": "September 3, 2010"}, {"Title": "Great TV", "Author": "C. Jones", "ReviewID": "R3GVHNMBV44NVV", "Overall": "4.0", "Content": "This is a great little set.  We couldn't be happier with the picture and the sound.  We wall mounted this on our bedroom with Vuepoint F18 Tilt and Low Profile Mount 13-32\" TVs and it doesn't stick much more then the picture frame that it replaced.  The only thing I could really complain about is how long it takes to power up, seems a little long.One other thing to watch for is the placement of the HDMI inputs. When mounted with the Vuepoint F18 Tilt and Low Profile Mount 13-32\" TVs the mount blocks the HDMI inputs.  I had to modify the bottom of the mounting bracket inorder to use them.  I don't have any experience with other brackets so I not sure if it will be a probelm with others, but it is something to watch out for.", "Date": "October 8, 2010"}, {"Title": "Love our Vizio", "Author": "KBo", "ReviewID": "R1J3IOA2EQDB1X", "Overall": "5.0", "Content": "I thought this was an excellent purchase. The Picture is crisp, the sound is good. I haven't experience any ghosting or remote issues. For the money this is an excellent buy.", "Date": "November 6, 2010"}, {"Title": "Good deal", "Author": "George Posada \"Sir George\"", "ReviewID": "R38J4XQGTVAXVG", "Overall": "5.0", "Content": "Bought two tv's to hang on the wall of my game room. My sons and I can watch three games at the same time (along with the 50\" we already have) while playing cards or pool. Picture quality is excellent at this 26\" size. Can't beat the price. Sound quality isn't bad, but we run sound from the Tivo and Cable box through a separate AMP and speakers for a better sound experience than this little TV can be expected to deliver. Light weight. I am an old guy and had no problem installing on a couple wall brackets hung high overhead. I wouldn't attempt that with a heavier TV. Can't believe you can have this much fun for so little money! After hanging the TV's, I was up and running in 5 minutes with the easy intuitive remote and menus. We can switch easily between the 3 TIVO/Cable boxes which we hooked up to the two HDMI and the coax terminals. It's now easy to get my 4 sons over for a game or two.", "Date": "October 27, 2010"}, {"Title": "Buyer beware", "Author": "R. Cantisano", "ReviewID": "R3T48E2ZTUQGF4", "Overall": "1.0", "Content": "I purchased the white framed model after returning a Toshiba 19\" that was so poorly shielded that every AM radio in the house became white noise when the tv was just plugged in.... but as far as the Vizio, I had higher hopes. For one, the plug was grounded. It looked slick out of the box. The first trouble came after about two hours. The picture went black but I could hear the audio. I changed the channel. Problem solved for about 10 minutes. Then the same thing happened.  I eventually called tech support and spoke to a helpful person who told me how to reset the unit. (turn it off, unplug the unit, and hold a button down for 30 seconds. This seemed to solve the problem..... for about 30 minutes. Even though the gentleman gave me a case number and instructed me to call back if there were further problems, I decided 300+ dollars was too much to be messing with tech support on day one. Back it went. I have noticed many newer brands of Chinese \"junk\" tvs out there- both in stores and online. Many of these newer brands have horrendous sound and they cannot be fully programmed with Direct TV receivers, which is important to me. Also the Vizio continued with the am radio interference, although to a lesser extent. I have come to realize that ALL tvs, even the major brands are now made in China due to dirt cheap labor. I settled on a 26\" LG unit. I have a blue ray player from them which has been very good. So far, all of the problems I have had with the Vizio are not present with the LG. Amazon thankfully has the best return policy.  The makers of tvs should concentrate on QUALITY. It is sorely lacking.", "Date": "January 16, 2011"}, {"Title": "Spectacular for the price", "Author": "OmegaDoc", "ReviewID": "R21RUH3INDRD5Z", "Overall": "5.0", "Content": "For the price, this is a spectacular 26 inch HDTV.  Beautiful case.  Incredible picture right out of the box.  Clearly labeled inputs.  Very rapid channel changing response.  Just bought 3 of them, and would buy more if needed.  The picture rivals or surpasses my other sets:  Sharp, Sharp Aquos, Samsung LED and Sony.  A no brainer.", "Date": "October 28, 2010"}, {"Title": "Good television.. for about 2 weeks.", "Author": "Thomas J. Cherry", "ReviewID": "R2KCA8GJGE8LFJ", "Overall": "1.0", "Content": "I purchased the TV on a whim at Target for use as a monitor for my laptop and to play my xbox 360 on instead of using my very laggy 55\" vizio LCD tv. I was quite impressed by the brightness and crispness of the picture but not impressed that I was still acquiring quite a big of lagginess in gaming. Speakers sound pretty flat so don't expect to listen to music or watch movies with plenty of explosions. I believe the speakers on my iphone could do a better job of managing action sounds that this tv. The killer was that it eventually died out. A large pop and then a black screen made it R.I.P. After a lot of hassle at Target I eventually got most of my money back. I am currently in the market for a more suitable LED computer monitor.", "Date": "January 10, 2011"}, {"Title": "Very Compact for a 26 inch.", "Author": "Larry Alvey", "ReviewID": "R1Y29QC8B2948U", "Overall": "5.0", "Content": "I replaced a 20 inch flat screen in my Kitchen with this 26\" Vizio. This is the largest TV that will fit under my cabinets. I like the feature that it does not require a base that adds height. The TV sits flat on the counter. The Picture quality is good for the price.", "Date": "October 4, 2010"}, {"Title": "poor quality picture", "Author": "1032bigfoot", "ReviewID": "RNV0BDGJGUO36", "Overall": "2.0", "Content": "Not happy with the picture quality.  The feed is HD and I have played with the tint, sharpness, color, etc,.  and not much success compared to other LED TVs I have seen.  Would not recommend purchasing this TV even though the price was good.  Guess you get what you pay for.", "Date": "December 24, 2010"}, {"Title": "Great TV for the price!", "Author": "Derrrrrrrrrrrk", "ReviewID": "RTYQ2TBTF4QV3", "Overall": "4.0", "Content": "It's a solid tv for $233.33. It is only 720p but is an excellent second monitor for my laptop. I don't use it for bluray or video games, so 720p is more than enough for me. After 30 days, the tv started to fade. I called Vizio and had it on its way back to California within a week of my first call. Everything paid for. The people I talked to were very helpful and nice. I'm still waiting for it to come back, but I'm sure it won't be a problem.", "Date": "December 24, 2010"}, {"Title": "Good deal", "Author": "Tom Pittman", "ReviewID": "R1BG17GD58B7UW", "Overall": "4.0", "Content": "I owned a smaller Vizio TV, so I knew about what to expect, however the TV picture quality was much better than I expected.  The sound is average but acceptable.  For the money, this is a good deal", "Date": "November 9, 2010"}, {"Title": "Good Bedroom, TV", "Author": "Tom Frasier", "ReviewID": "R7OOEURSC8T2X", "Overall": "4.0", "Content": "I like all the size, weight.  Ideal for the bedroom.  I bought based on reviews and price.  Easy to set up. The picture is very good except for facial detail/color clarity.  It seems to be a bit washed out.  Still working with adjustments to correct that.  As always the service from Amazon was excellent,", "Date": "October 19, 2010"}, {"Title": "Defective Vizio", "Author": "margaret ann dunne", "ReviewID": "R6JA05G9ELZ4N", "Overall": "1.0", "Content": "Amazon typically great but this product (Vizio - M260 VA - 26\" Razor LED 720p)  arrived defective.  What a mess.  The screen kept going black.  The sound would go completely mute, then sputter off/on before going mute again.  Color quality is poor compared to my Samsung.  Will try another time because probably just defective.  Amazon has good \"free shipping and free return\" policy luckily.", "Date": "November 24, 2010"}, {"Title": "It makes a great monitor!!!", "Author": "asdf", "ReviewID": "R1SF836QK368T0", "Overall": "5.0", "Content": "I have been very pleased with this Tv, It has been a great monitor for my mac pro!!!!! It has a super slim profile so you could fit it almost anywhere, and a ver clear 720P resolution. It has 2 available Hdmi Inputs and also a RGB. If you are considering buying this as a monitor, I would recommend it.", "Date": "October 16, 2011"}, {"Title": "Pretty good and met my needs", "Author": "R. Precourt", "ReviewID": "R3PPDZKDPDTIKU", "Overall": "3.0", "Content": "I needed a TV to fit into a very specific space on a bookshelf in my office and this one fit perfectly.  The picture is sharp and clear, however, the contrast ratio is not that impressive, especially for an LED TV.  My much older Samsung LCD TVs have much deeper blacks and more vibrant colors.  Also, the picture settings are not that great; color temperature presets for example goes from a very warm tone to drastically cold tones, with not midle ground.  The custom adjustments are very hard to work with also, so I finally gave up and left it on 'Normal', which is about the best I can hope for.  The other thing I don't like about it is that it sits at an angle, rather than vertically straight.  Since I have it sitting in a bookshelf it looked akward, so I placed something under the back of the stand to level it a bit and now it looks great.  All and all I'm happy with it for what it is and it's serving my needs-just wish the picture was a bit better.", "Date": "March 11, 2011"}, {"Title": "poor remote", "Author": "T. Brown", "ReviewID": "R1K35SX27WLTQA", "Overall": "3.0", "Content": "This TV has a pretty decent picture with very deep blacks.  I have experienced the rolling bars or waves others have reported here especially when the TV is first powered on.  My main gripe is with the remote.  A TV this size would typically be used in a darkened bedroom.  The remote is black-on-black making it virtually worthless in the dark.  Compounding the problem, the numeral buttons are long bars grouped in numbers of three rather than individual buttons.  It is really impossible to use this remote in the dark.  The audio is a bit tinny too.", "Date": "March 8, 2011"}, {"Title": "Nice TV", "Author": "Charles Morel", "ReviewID": "R3TCSKQT67CARR", "Overall": "4.0", "Content": "Bought this to replace a Sylvania 22 inch HDTV that lasted one month. We don't receive HDTV broadcasts on this set, so I can't really tell what the HD picture quality is. I did have to make adjustments from the factory settings to get the picture color quality more acceptable for standard definition. It had a very greenish tint when I first turned it on. The TV is now connected through a TiVo dvr system, and it works fine with that also. The sound quality from the speakers was not that good which is common for a small TV, though it was better than the Sylvania. Like the Sylvania, I hooked up a pair of $26 computer speakers with a subwoofer and the sound is much better. I did have some problems while trying to adjust the color, and had to call customer service several times. Everytime I called they were very helpful, and the issue was eventually solved.", "Date": "January 27, 2011"}, {"Title": "decent quality but cheap compared to other brands", "Author": "Javier Rodriguez", "ReviewID": "R40SLK45G8LY2", "Overall": "4.0", "Content": "although this really is a great deal for a led tv, it's not that great for a couple reasons. One reason is the picture doesn't look that great when displaying high resolution tv shows such as 720p or 1080i, the colors are either too dark or just don't look very good with contrast being a huge problem when there is very bright scenes and switching to a dark scene the tv just cannot keep up, this is where the quality of the tv really shows. Another big difference in this tv is the stand; it's tilted somewhat and this bothers some people, unless you mount it on a wall though. So i would probably only buy this tv is you have a very low budget, otherwise please stick with the better quality brand tv's such as sony, samsung, or lg, honestly this tv would be better suited for a small bedroom or just for a garage tv instead!", "Date": "January 19, 2011"}, {"Title": "Disappointed!", "Author": "mtwieck", "ReviewID": "R1DRE4KALW9W04", "Overall": "2.0", "Content": "The picture on this set is pretty good most of the time. But it does have a serious blooming problem in which the contrast seem to go to max on it's own for a few seconds and then settles down to normal. For this reason the best rating I can give it is only below average at best!", "Date": "November 29, 2010"}, {"Title": "Good TV", "Author": "Sky2424", "ReviewID": "R3TRTS35F8WCZI", "Overall": "4.0", "Content": "So far so good amazon shipped very fast was pleased it's a nice tv only regret is you can purchase a 32-inch for a slight increase in price, but overall great tv clear picture especially for the price", "Date": "November 5, 2010"}, {"Title": "Many problems with this Vizio....would avoid this company if I were you!", "Author": "Joshua Jones", "ReviewID": "R1U3O3YNRPWM50", "Overall": "1.0", "Content": "I bought this 26 inch LED Vizio TV about two years ago.  Previously, I owned one of the old dinosaur CRT TVs for about 15 years with no problems whatsoever.  Well, I bought this thing at Walmart because it was on sale for $198 right before Christmas thinking I got a good deal.  I learned the hard way that you get what you pay for.  First after a few months, one of the HDMI ports stopped working.  I refused to accept that so I sent it back to Vizio for warranty servicing.  After paying for the shipping of about $30 bucks, I got it back about 3 weeks later and it was working fine.  Well, recently I noticed that my tv went black and would not pick up the signal from the cable box.  Then the power light started to flicker and the tv would not respond to my remote control.  I changed batteries and tried another universal remote and it would not respond. Now the power light stays on all the time, even when the tv is off.  I tried unplugging it and plugging it back it but no change at all.  The warranty was up but I bought a SquareTrade warranty when I bought the tv so they are going to refund me the cost of the TV.  I am done with Vizio after this.  I am on to either Samsung or considering TCL because the reviews were good.  Do yourself a favor, don't buy Vizio!  If there are several one or two star reviews, don't buy it.", "Date": "July 29, 2012"}, {"Title": "Great \"Little\" TV", "Author": "Melissa Mularski", "ReviewID": "R1WEQAO8Z2GDSQ", "Overall": "5.0", "Content": "We bought the VIZIO Razor a year ago for our kitchen, and we still love it. It's hard to believe at 26\" television fits on a kitchen counter under our upper cabinets.Sleek, sexy design & thin profileBright LED displayRecommended for kitchens, rec rooms, dorm rooms, bedrooms, offices.Can be used as a computer monitor (supports 1360 x 768, 1024 x 768, 800 x 600, 640 x 480 via RGB/HDMI)Decent sound -- VERY decent compared to other TVs I tested in this price/size rangeDoes NOT have internal WiFiWorks great with Apple TV 2 (via HDMI)Has a stand for setting it on a surface. Wall mount can be purchased separately.Rear inputs include:- 2 HDMI with HDCP- DTV/TV (RF Connector)- Component (Y, Pb/Cb, Pr/Cr) plus Stereo Audio (L, R)- Computer RGBRear Outputs Include:- SPDIF Digital Optical- HeadphonesSide Inputs Include:- Audio (White & Red for stereo) & Video (Yellow)- USB (for .jpg image viewing only)Side Outputs Include:- Headphones", "Date": "November 22, 2011"}, {"Title": "Mind of its own", "Author": "cookies", "ReviewID": "R3V34L7DEXYWV6", "Overall": "2.0", "Content": "Great color and I like the speakers in the front.  Unfortunately, the speakers have a mind of their.  The volume goes up and down on its own.  The remote gets used a lot either lowering or increasing the volume when the TV goes into one of its moods.  I think it is possessed.", "Date": "April 30, 2011"}, {"Title": "Great little tv", "Author": "Blue Eyed Love Goddess \"BELGM\"", "ReviewID": "RNLDU8VDX7O0Y", "Overall": "4.0", "Content": "I got this TV for the bedroom...great little tv for this spot.  Slow response time on the remote and needs to be pointed directly at the responder. I can live with that.  Not liking the \"streatched\" out screen but when going to the normal it is too small....got used to it now, and only use a few times a week for breif watching.  Great tv for the price $219.", "Date": "April 17, 2011"}, {"Title": "Nice TV", "Author": "jwec00", "ReviewID": "R252IX96MYIMSZ", "Overall": "4.0", "Content": "Purchased the tv for our bedroom. Works great. Great picture. No problems since I purchased it 2 months ago.The sound is average, but not too bad.... nothing a set of aftermarket speakers can't fix. Recommend.", "Date": "April 13, 2011"}, {"Title": "Has great quality and good sound!", "Author": "3GAKids1521", "ReviewID": "R24R973IPX2W2N", "Overall": "5.0", "Content": "I was a little skeptical on this because I didn't know the Vizio name.  I am glad I took the chance.  The picture is crystal clear.  The sound is good, although sometimes, in a busier household like we have, you have to turn it up a little bit louder than the norm.  Very little delay in channel change time.  The input system is easy to figure out even for a dyslex tech like me.  All in all, a great tv for the little bit of money.  We will go with Vizio again.", "Date": "April 11, 2011"}, {"Title": "Excellent for a bedroom or travel trailer/rv.", "Author": "Robert D", "ReviewID": "R1WAKMELT68E4F", "Overall": "5.0", "Content": "Purchased two of them about 2 months apart. Just an excellent value. Don't really know about the warranty part yet as it works well so far.", "Date": "April 8, 2011"}, {"Title": "Good for the price", "Author": "Rob", "ReviewID": "R3NW936YEJPLFI", "Overall": "4.0", "Content": "Overall I'm not impressed with the company due to a past bad experience. Now with that said this T.V. is Thin, light and has a good picture quality. For what I use it for it is good for the price. If I were looking for a large unit I would never buy a Vizio. Beware of this company if you need warranty service as they will NOT stand behind their product and they will LIE when confronted with a BBB report.", "Date": "April 5, 2011"}, {"Title": "Purchased tv after reading good review.", "Author": "Faith", "ReviewID": "R16MZRVXZTPSSO", "Overall": "5.0", "Content": "I purchased this tv after reading good reviews on it.  I have had it a little over a month and haven't had any problems with it.  The sound and picture quality are very good.  I also purchased a larger LCD tv at the same time and this LED is much brighter and clearer picture. Don't get me wrong I really love my other Vizio tv as well.", "Date": "March 20, 2011"}, {"Title": "First Vizio, very impressed.", "Author": "Scott", "ReviewID": "R17NCQ4PH3AATA", "Overall": "5.0", "Content": "What can I say that hasn't already been said?  For my uses, Vizio got absolutely everything right with this set.  Even the case design is brilliant.  If you're unfamiliar, all the inputs are color coded and labeled, by type and relative quality.  That, and the case itself is the absolute sharpest design I've seen on the market. I wish more manufacturers would take notice instead of sticking to the over-sized-monitor look.Luckily, the list of \"pros\" does not end at \"the case looks nice.\"  The screen is incredibly crisp and vivid, even before adjusting.  There's the option of having the television take over brightness control, saving your eyes in the dark and cranking up the juice in direct sunlight (not sure a total of 44 watts is really \"cranking up the juice\" but work with me, here.) All the specs and features are here that you'd expect when dealing with video quality, a nice response time, great contrast ratio, and most importantly to me, a great viewing angle.  It sits quite a bit higher than my bed, but the picture is flawless.  Other notables, there's very little delay in the remote, you can surf without waiting for each to tune.  And another tiny but critical aspect that some manufacturers can't seem to wrap their heads around, a \"sleep\" button on the remote.  Why on earth do some manufacturer's tuck this away in a menu?  Ridiculous.So what's not so good?  The sound, of course.  Scourge of the LCD TV.  Despite their absolute best efforts in software, including options for SRS surround,  TruVolume, equalizer settings, balance, bass and treble controls, it's still average at best.  By now I'm willing to accept that LCD TVs will never sound that great.  In my family room, I would need to buy an amplifier and speakers, but in my bedroom, it's just fine.I took the risk buying a TV from a fairly new face on the market, but they've made a great first impression.", "Date": "March 1, 2011"}, {"Title": "Great little TV", "Author": "ethan vyce \"ethanvyce\"", "ReviewID": "RZCYGXAPDVOG", "Overall": "4.0", "Content": "I got this for my mom and it is a great little TV. The Remote is simple with fairly large buttons. I do wish the remote had a dedicated button to switch to the VGA input (it does for TV, HDMI, and component) or would let you program which input the button was for. The antenna picked up all of her local channels (standard and HD) and the menu let's you rename the channel names. Though it doesn't let you change the channel while in naming menu so you have to keep going back into the menu for every channel. The picture quality is fine. The sound seems fine to me, a lot of reviews say it's poor, but I wasn't looking for window rattling, just good enough so she can hear it. The input connections are easily accessible and well marked. This is a great option for a small apartment or second room.UPDATE: December 2011- This TV is still going strong. No problems with it yet.", "Date": "February 14, 2011"}, {"Title": "Great T.V. for the price", "Author": "Jay", "ReviewID": "R10EN8KU0BNW1J", "Overall": "5.0", "Content": "The tv has great picture quality, and sound quality. I dont understand peoples complaints about the sound at all, I have had absolutely no problems with it at all. I highly recomend this tv.", "Date": "January 14, 2011"}, {"Title": "Great value", "Author": "Jaja185", "ReviewID": "R4W94WC329YOU", "Overall": "5.0", "Content": "I have had this TV set up for a little over a week now and have no complaints. Picture, sound and price create a great value on this TV. Couldn't be happier! Cheers!", "Date": "January 9, 2011"}, {"Title": "Great TV", "Author": "cjf78", "ReviewID": "R31YLIO04V46UE", "Overall": "5.0", "Content": "I just got this tv today and it is incredible. I needed to upgrade from my tube 19inch tv that I have had forever. This tv is easy to set up and so slim. The picture quality is great and the sound is perfect for the space of my bedroom. My other tv had to be turned up to 30 to be able to hear it, this tv can be set at half that is still plenty loud. I would recommend this tv for someone looking for a tv in a small space or bedroom.", "Date": "January 4, 2011"}, {"Title": "Great for First time HD TV", "Author": "Sweet Mommy", "ReviewID": "R3NXDBXU53ATYS", "Overall": "4.0", "Content": "This TV does have a wonderful Picture once you can get it without the white refresh waves. It was terrible and very noticable to me constantly flickering in the back but once i messed with the brightness and the contrast under the custom setting i got them to go away. So it kinda bad that i had to figure that out on my own since ive never owned a hd tv but once that was fixed i love the tv! The Sound is awesome and so loud! its great! I would definately recommend this TV! just custom set your picture if the white lines are in the back.", "Date": "December 27, 2010"}, {"Title": "Excellent TV", "Author": "B. Slater \"Computer fan\"", "ReviewID": "R1E3ACK98RBGV9", "Overall": "5.0", "Content": "I purchased the Vizio 26\" TV as a second set and I am very pleased with it.  The picture quality is excellent and I would recommend this brand highly.  I don't have it hooked up for HD as I would need another satellite box and don't wish to have one in the bedroom.  Even without HD, the colors and quality are sharp.", "Date": "December 15, 2010"}, {"Title": "good TV, value", "Author": "Kevin Y", "ReviewID": "R16VG8U93Z6SCT", "Overall": "3.0", "Content": "good picture and sound quality. only thing I don't like is picture blanks out occasionally when playing DVD (in AV mode), had to select AV mode on remote to bring the picture back. Overall, good TV and value.", "Date": "December 10, 2010"}, {"Title": "Perfect for our Bedroom", "Author": "Fred Worth \"Fred Worth\"", "ReviewID": "R2L6FD9PKTY6WJ", "Overall": "5.0", "Content": "I agree with all the positive remarks here.  I bought the TV for our bedroom.  The picture is as excellent as the big VISIO I have in the livingroom.  The sound is certainly adequate if the TV is not used for concerts etc.  I first bought another brand of TV and had to return it because the sound quality was so poor.  The other brand TV has the sound coming out the back and in no way is the sound adequate.  That's why I like the VISIO, because it sounds like a normal smaller TV.  My wife had been against me buying a 26\" until I got it home and had it set up.  I thought when I took the other brand back that I should get a smaller one and she said \"It's Perfect!\"  It looks nice and it stays on my dresser firmly, it is not going to fall for most any reason.  You can't go wrong with this TV, but if you want a different brand check out the sound first!  You might not believe how bad some of them can be!  Perfect for what I wanted it for.", "Date": "December 8, 2010"}, {"Title": "great design and picture", "Author": "fgre", "ReviewID": "R2U8YYQSCT8GS9", "Overall": "4.0", "Content": "Bought as a gift for an elderly aunt. She loves the picture and sound quality. Also the closed captioning ,which she uses, is easy to read because of the adjustable sizes.Purchased at Amazon because of best price and free shipping.", "Date": "November 17, 2010"}, {"Title": "Dissapointing", "Author": "M. Harris", "ReviewID": "R143MO52QWZW96", "Overall": "1.0", "Content": "I bought this TV to replace my much too small Coby 19 inch. This was the right size, plenty big. It has a good viewing angle, and the sound quality is good. It is not as bad as people say. For a cheap 26 inch, it's more than fine. I found that the volume control is very loud. On three it is as loud as seven or eight on other TVs. The volume control needs some improvements. When going from 1 to 2, there is a big jump, bigger than on any other numbers, of sounds. That is wierd.But that is just the beginning of problems. The picture quality is my biggest complaint. For the first five minutes of having the TV on, there are waves going from the top to bottom. In 2011, that is not an acceptable thing. They are distracting. Now they seem to be going away, but are still visible. Who knows why? I have not changed any settings. I can't trust this TV. I could trust the Coby. It never had any waves, even when I went up close to it. It also didn't have a buzzing sound when it was on, which this does. That is not a major problem though, even though none of my family's TVs do that, nor do they have waves.This, compared to other TVs, has a poor contrast ratio. A contrast ratio is and I quote, \"The contrast ratio is a property of a display system, defined as the ratio of the luminance of the brightest color (white) to that of the darkest color (black) that the system is capable of producing. A high contrast ratio is a desired aspect of any display.\" That is from Wikipedia, thank you for the explanation. This has a ratio of 20,000:1. The LG I was looking at was  50,000:1. Some are even more than that. So this TV does not have a great ratio. The blacks could be darker. You can try to make them darker, but your whites become too dark. I spent days trying to get a good picture, and I adjusted color and brightness, backlight, Color Enhancement, and whatever else. My picture still is not what the Coby was. The Coby did its job, like a normal TV should. The stand for the TV is angled, which I hate. It is really bad. I had to put something under it, what a bad stand.Now, I am returning it, trading it in for a new LG, or maybe another Vizio, of a different model.", "Date": "May 11, 2011"}, {"Title": "Not what I expected", "Author": "Catherine Johnson \"Scottishlass\"", "ReviewID": "R3F8SWOR4YB3VX", "Overall": "5.0", "Content": "I do like the set enough to give it a 3 star rating, but there are problems that I was not expecting considering that Vizio is supposed to be a great product for a low price.  The problems I have are that the picture is not much better than analog.  Also, it takes about 5 minutes for it to \"warm up\".  What I mean by this is that there is motion in the screen, little light waves that run from the bottom to the top for a few minutes...until the screen has warmed up.  Maybe I just have a \"bad\" set.  I'm going to keep it, but I do wish that I had gone with my usual favorite - Samsung.Follow up:I thought I had posted this already, but don't see it.  I have changed my rating to 5 stars for the following reason:  The problem was not with the TV but with the extent of my lack of knowledge regarding HD products.  I had used an analog cable when I should have used an HDMI.  Once I connected the correct cable, the picture is beautiful. Totally love it.  Plus something I did not mention before, I love how light it is.  Hard for me to understand the technology...but I'll take it.  :)", "Date": "February 25, 2011"}, {"Title": "Baaad Remote Control", "Author": "Rhonda R. Dean", "ReviewID": "R3IZRNWU4Q2GRK", "Overall": "2.0", "Content": "I have had the tv for a little over two months now. The tv itself is okay, adequate. But....the remote control is just awful! Before I bought the tv I read the reviews which warned that the remote was iffy. Well, in truth, its just lousy and it becomes more difficult to use with time. If you choose to use the up/down button rather than punching in the channel number to change channels, over time that button ceases to function properly. You have to press so hard on it, it actually hurts your hand, seriously. Then, because it works so hard and you have to hold it down to make it work, it shuts the tv off. It is just ridiculous! I am now looking at getting a universal remote so I can use my television. Hopefully that will work. I would get in touch with Visio but frankly, I don't need another sub-par remote. I guess its a case of....you get what you pay for. By the way, I have never reviewed anything on line in my life and I hate to be negative, but I have had plenty of other tv remotes (old ones) that worked so much better. I guess I expect more from \"new\" stuff.", "Date": "February 10, 2011"}, {"Title": "Great Deal, excellent TV for the money!!", "Author": "TRC", "ReviewID": "R37OZQCNUGW1HU", "Overall": "5.0", "Content": "I wanted this TV for months, and I waited till Target had it on sale and grabbed one at Walmart with a price match for $198, could never find one in stock at Target! I set it up, plugged it in, and started watching digital TV, it was sooooo... easy and the picture has been fabulous from the beginning. I only have very basic cable, so some stations are not 720p but the majority are eye popping HD perfect color and contrast. I love this TV! It is in my office so it is not our main TV but it is perfect for the small office I have set up. Now, if I can just find the right DVR!", "Date": "February 2, 2011"}, {"Title": "Best purchase yet!!!", "Author": "Rhiana L. Mccarty", "ReviewID": "R4QR0CKMIZZQL", "Overall": "5.0", "Content": "I bought this for my daughter on the day after sale for the best deal i could find anywhere and we opened it on Christmas day and it was even better than i expected the speakers on the t.v are better than i thought its almost like surround sound and the look of the t.v is awesome i so glad i decided on this t.v and for an added bonus its a Vizio brand my favorite.", "Date": "December 28, 2010"}, {"Title": "Good, Not Great", "Author": "Loretta English", "ReviewID": "R2KUK9H8GDN9BV", "Overall": "4.0", "Content": "I bought this TV for our office.  The picture is very good, but the sound is bad. The sound is \"tinny,\" and gets on my nerves.  I will be adding external speakers to get a decent sound.", "Date": "December 21, 2010"}, {"Title": "Happy", "Author": "Darrell C Gilbertson", "ReviewID": "R34V2AICYK14TV", "Overall": "5.0", "Content": "Everything was as described in the reconditioned despcription.Easy out of the box to set up with great picture quality.", "Date": "October 29, 2013"}, {"Title": "Good product at a great price.", "Author": "Richard A Brown", "ReviewID": "R2Z56HBG5WLY9P", "Overall": "5.0", "Content": "Very happy with picture and sound quality. Sees heavy use and has not had a single problem. It's my 2nd Vizio and I've been pleased with both of them, great bang for the buck.", "Date": "August 3, 2013"}, {"Title": "For the price, can you really complain?", "Author": "Matthew R. McLagan", "ReviewID": "R1HFE1EW7DNK41", "Overall": "5.0", "Content": "I must say, this is a great value for what you're actually getting. This is used in a bedroom without an HD box. I still receive a few basic channels in HD from Charter, and they look just as good as any other HDTV...even with just 720p. The sound isn't great for large areas, but what do you expect from a razor thin tv? The sound is decent if it's in a small enclosed space like a bedroom. I'd recommend this tv for anyone looking for a cheap gaming/movie watching option for a bedroom. PS3 games really look great on it. I've had this tv for several years now, and have not had a single problem. Short, to the point review. Hope it helps anyone that is on the fence.It should be noted that I got this tv during a Black Friday sale for $200. 5 stars all the way.", "Date": "July 31, 2013"}, {"Title": "Didn't last. Crummy warranty provisions.", "Author": "dantesnana", "ReviewID": "R26TXCQD2P9SZX", "Overall": "1.0", "Content": "I bought this product in November. We watched it only in the evenings for about two hours of movie viewing. Then, in April, we stopped watching the evening movies. In May, we were going to resume them. Now wouldn't you think a TV set sitting there resting all that time would be only too eager to provide you with a little TV time when you tried to turn it on again? Well, guess what, folks? It died. It rolled over dead on the spot. Kaput.Okay, so we have a manufacturer's warranty. We haul it to the local repair shop, they fix it, and the manufacturer pays the tab, right? WRONG! The guarantee requires that we ship it to the factory! What? They tell us to ship it back in the original box and packing, if we still have it. Okay, pack rat that I am, I HAD saved it. Just in case. They do have very fine print somewhere that says if it is damaged in transit, such damage is just our bad luck. But, hey, they tell me to use the original packing, so I figure all that hard-as-steel Styrofoam encapsulating the TV set like a mummy is impervious to shippers dropping, stomping on, or tossing boxes around. WRONG.I get an email with attached photos that the bezel (Must be French: the frame), is cracked and will not be repaired. They send photos of the box. Guess I'm half blind, because the box looks fine to me, both front and back. So they send me back the damaged TV, which I sent to them following their shipping instructions, and I am told to take it up with UPS. SURE!Am I a happy camper? Not on your life.A TV should last longer than five months. It shouldn't have to be shipped back to the factory for repairs. It should be repaired locally.End of story. Reason for only one star.", "Date": "June 26, 2013"}, {"Title": "This thing is dope", "Author": "Trebin", "ReviewID": "R1ASYM6VFW8XMB", "Overall": "5.0", "Content": "I have had it for a very long time, it's been tossed around and knocked around and it is pretty durable.  Has a lot of options.  I have my computer plugged in through HDMI, xbox through RCA, and even cable in it.  It's HD.  I use it mainly as a computer monitor, but when I lived with roommates in college, we used it as a TV for Netflix and other things.  Not a bad size, and pretty cheap.  Also has audio outs.  Great buy.", "Date": "December 25, 2012"}, {"Title": "Great LED picture", "Author": "Wildcat", "ReviewID": "RBVKSD9945IC0", "Overall": "4.0", "Content": "I bought this tv for my bedroom because we had a large one for the living room. I think Vizio has really improved on the quality and this makes a great bedroom tv. My biggest con is the the stand isn't the most convenient. Also this tv is great for video games and cable/dish, but not the best resolution for computers.Overall if this tv is the best price in your range, and you want a small bedroom tv, good way to go. However there maybe better ones out right now.", "Date": "November 26, 2012"}, {"Title": "pleased", "Author": "Red Cloud", "ReviewID": "RHYT8BYBCVVKX", "Overall": "5.0", "Content": "I purchased this product for my cousin ( she's 91 ). She is very happy with the picture and sound of the TV . A good value for the money", "Date": "October 14, 2012"}, {"Title": "not bad", "Author": "Ted Green", "ReviewID": "R3UZ3T0GAH24M4", "Overall": "4.0", "Content": "honestly have not had any problems with it for over 2 years. no complaints from this guy. Dont waste your time onbrand name tv's", "Date": "September 12, 2012"}, {"Title": "Bought the 32\" Vizio", "Author": "Renee DeShane", "ReviewID": "R2R7JA4THRL2O2", "Overall": "5.0", "Content": "I went with the 32\" M260VA Vizio LCD TV and I love it. Not only does it have a great picture all the time, but the sound is the best of all. The speakers are in the front instead of behind or underneath the TV. One would think other brands would have caught on to that a long time ago. I've had the TV for well over a year now and the Vizio is still the best TV out there.", "Date": "June 8, 2012"}, {"Title": "Works great for the guest room", "Author": "elise", "ReviewID": "R3A1SQY7KM434D", "Overall": "5.0", "Content": "I purchased this television for our guest room a year ago.  It gets used at least once a month.  My mother and my in-laws both really prefer it to the complex home theater setup in our living room.  The picture quality is good.  The sound is good.  It's super slim, so it doesn't take up much room on a console table at the foot of the bed.  Overall, it's been a great purchase.", "Date": "February 6, 2012"}, {"Title": "Sweet little set", "Author": "P.M.L", "ReviewID": "R3K4AD6PVEXVOJ", "Overall": "5.0", "Content": "I bought this on a doorbuster at a local store & could not be happier.  Vizio truly is a quality set!  The colors are great without much tweaking. The sound is very good for a flat panel, especially since the speakers are in the front, not the back.  Good amount of hookups on it.  Computer looks great hooked up to this.  I even had this hooked up on my patio with an antennae to watch a race one night & the picture was so crisp & clear.  I was very pleased.  So if you are looking for a bedroom tv or just an extra one to have, this one is great!", "Date": "February 2, 2012"}, {"Title": "Great video. Poor sound.", "Author": "G. Brewer \"Gene38\"", "ReviewID": "R1AK8OHYUTKA7A", "Overall": "4.0", "Content": "I've had this model for a year. I bought a second one a year ago for a gift and can speak for it also. This model has great video and features. There has not been any technical problems with either set so far. The sound, however, is poor. This is most likely the fault of the small speakers and not the electronics. I got around this by purchasing a set of USB powered computer speakers (this model has a USB port). The sound is now as good as the video. THE USB port can also be used to view photos from a flash drive. Works great.", "Date": "December 23, 2011"}, {"Title": "Good television for Price", "Author": "M. V. Kolar", "ReviewID": "R32BBXOC15EQKS", "Overall": "4.0", "Content": "I finally upgraded from my two-ton old rear projection television.  I am NOT good at putting electronic things together, but after a few attempts (and using google, You-tube and wikipedia), I actually got the dvd player and the vcr connected.  I even managed to get Netflix streaming.  The instruction manual included is very clear and precise.  I am not happy with the sound.  I put my computer speakers onto the television but I think I will get a sound bar.  By itself the sound is quite tinny--like the sound of a computer with no speakers.  The little $15 speakers work well to eliminate the tinny sound.  What is great is all of the various inputs--plenty of room to attach everything that is needed.  I'm very happy with my purchase and would recommend.", "Date": "December 18, 2011"}, {"Title": "Happy with my VIZIO", "Author": "Mandar Paranjpe \"Mandar\"", "ReviewID": "R2AOHZLFP3MG3J", "Overall": "4.0", "Content": "I am very happy with this VIZIO TV. It has been serving us well.  Great picture quality , sound quality. Value for money.", "Date": "November 20, 2011"}, {"Title": "Really good purchase!", "Author": "eLeF", "ReviewID": "R1HVREIFXN367L", "Overall": "5.0", "Content": "I really like this TV, although it was bought as 'previously used', it arrived at my house as a new Tv, in the original box, wrapped and protected by plastic. Only by looking at the box you could see somce signs of previous usage. It is very easy to set up, the screen and sound quality are good and the controls are simple.", "Date": "November 8, 2011"}, {"Title": "Love the Design", "Author": "Dianne K", "ReviewID": "R3Q16O8T2BDTF7", "Overall": "4.0", "Content": "I bought this television for the bedroom and I think the design is fabulous. For under $200, I don't think that you can beat it. Plus, I've become a Vizio fan, I always bought Sony but Vizio's affordability and quality is hard to beat. I recommend this model, just remember that you're not buying a top of the line unit. I'm very satisfied with the sound, remember to customize it for yourself.", "Date": "July 6, 2011"}, {"Title": "perfect!", "Author": "BBF", "ReviewID": "R1JFUESSX2Y6UY", "Overall": "5.0", "Content": "this tv is perfect, bigger than I expected but super thin and light. It also comes with a wide range of inputs so i can connect my game systems, cable, cpu, and even my camera if I wanted all at the same time.", "Date": "July 5, 2011"}, {"Title": "Vizio 26-in, w/white frame", "Author": "marjonci", "ReviewID": "R1EOK10GQD69M9", "Overall": "5.0", "Content": "Super sharp Hi-def picture.  Set up in the family room.  White screen makes the television almost disappear when not in use.  But when it is on, it demands attention because of the crisp pic.", "Date": "June 15, 2011"}, {"Title": "great tv for a great price but is it 720p or 1080i?", "Author": "F. Espudo \"degrassiboi\"", "ReviewID": "R1TBAIGZM7AYBI", "Overall": "4.0", "Content": "I have bought this tv at walmart since the tv I had broke, in walmart their display says that the tv is 720p HD when I got it home and hooked up my blu ray that was still set to 1080i, I connected and saw that the tv was reading the 1080i so thinking that I was going to get a wow factor I never change the setting on the blu ray to 720p. I have been watching movies like this and I have noticed on a few blu rays (manly classic movies like gone with the wind and the wizard of oz) that the picture didn't quite look like right. Some scenes(mostly on the gone with the wind blu ray) the color looked like it was jumping around. You could tell from far away, but  if you got really close to the tv you saw purple out line on objects and people(which is how I noticed since the tv is right next to my computer). So after a few days I changed the setting on the blu ray from 1080i to 720p and that's when i got the wow factor there is no color jumping and no purple outline. So this tv does read 1080i but not very good (it's not recommended) 720p is what the tv needs to be in (it's recommended), so change all your blu ray players game systems and HD cable/sat boxes to 720p.", "Date": "June 9, 2011"}, {"Title": "Does Just What I Needed It To Do", "Author": "G. Clark", "ReviewID": "R3CTQL9N5GH0SN", "Overall": "4.0", "Content": "I was looking for a LCD TV with a white bezel to match the my all white bedroom. This Vizio fit the bill. The picture and sound are not as good as the larger Samsung tv I have in the living room but since it is a secondary set it works.", "Date": "June 6, 2011"}, {"Title": "A freaking steal", "Author": "Ted Ingram \"Ted Ingram\"", "ReviewID": "R2I0214ZC50M5I", "Overall": "4.0", "Content": "This TV has been in my house for 3 days. We bought it to go into a guest bedroom. It is getting a Standard Definition signal from DirecTV. I can honestly say that I am VERY pleased for the price. Is it the best TV on the market? No. But for the $280 I paid knowing it was going in a guest bedroom, getting SD, it is great. Great sound, great looks, just great.", "Date": "May 29, 2011"}, {"Title": "TV Review", "Author": "Ralph", "ReviewID": "RZ7YQ6O4M97E2", "Overall": "5.0", "Content": "This is a great product...I have put it on a boat and the picture is outstanding.  It was delivered exactly how the company stated it would be and my family and I are very happy with the product.", "Date": "May 25, 2011"}, {"Title": "Great :)", "Author": "Bwest", "ReviewID": "R282SW9UJWSLIO", "Overall": "5.0", "Content": "I love this TV. It is even better than I had imagined it! Came packaged very nicely. Would order from this company again! Very happy with my purchase! fast shipping as well", "Date": "April 17, 2011"}, {"Title": "Great deal", "Author": "Anthony Bothe", "ReviewID": "R1FZGNVK1KK7UT", "Overall": "5.0", "Content": "I shopped around for a long time before buying this and I am not disappointed. I was surprised when it accepted the 1080P output from my PS3. It's not something you'll notice much, but it's a nice feature that isn't printed on the box. Someone mentioned that they see waves when the screen is showing black. It is true, but it is easily ignored and does not affect the quality of the picture. I recommend this if you are stuck buying a smaller TV like I was. Great deal!", "Date": "April 4, 2011"}, {"Title": "Vizio Led TV", "Author": "zasupat", "ReviewID": "R2RO7I9MLEFA29", "Overall": "5.0", "Content": "Picture and sound are excellent on this tv.  Delivery was moderate wanted it a little earlier, but it all worked out.  The only problem that I see with this tv is that it didn't come with any extra cords, i.e. hdmi, which I have always received with other tv's I've purchased.All and all for the short amount I have had the tv I am satisfied with it's performance and it's style is beautiful.", "Date": "March 16, 2011"}, {"Title": "Perfect TV for small room", "Author": "M. Lawrence \"mal1981\"", "ReviewID": "R38VZRQL6ITIP9", "Overall": "5.0", "Content": "Vizio TV's have, I believe, always been great quality for great price. This is my second Vizio TV purchase and I'm just as pleased as the first purchase. Granted it's only 26\", but it's a perfect size for my bedroom. I was shocked at how thin this TV is, which is great because it takes up less room on my dresser. Set up was a breeze. Picture quality is very good with standard def cable. The sound quality isn't great, but it's good for the size TV it is. Who needs exceptional sound in a bedroom anyway? Overall, I'm very happy with this purchase and would recommend.", "Date": "March 11, 2011"}, {"Title": "An excellent TV", "Author": "Abiezer Medina", "ReviewID": "R2FTJ060LRK9U", "Overall": "5.0", "Content": "If you are looking for a good and cheap LED TV, this Vizio is all you are looking for. I have a LCD Vizio and the difference between both are notable... On the LED, the HDMI is pretty better, the quality improved enough, this is an awesome tv and obviously reccomend it.", "Date": "March 5, 2011"}, {"Title": "Great tv", "Author": "Ripad2011", "ReviewID": "R2GZLCPA1QR9FM", "Overall": "5.0", "Content": "This TV shipped fast, easy to setup and looks amazing! The LED tv is so thin, less than an inch! Yes the price is kind of expensive but it is worth the $280! Get this TV seriously, Its the perfect size for a bedroom and Vizio is amazing.", "Date": "March 3, 2011"}, {"Title": "Impressed", "Author": "RIphoto", "ReviewID": "R2DD2X81DK94ZM", "Overall": "5.0", "Content": "I'm very pleased with this TV.  If you recognize what it is and what its not and your comfortable with the specs as far as I am concerned it is superb.  A lot of the reviews here note things that you'd would expect from the TV to begin with if you read the specs so in my mind these aren't faults.  The TV is highly energy efficient and draws about a 1/3 of the power of my previous Sony LCD TV.  The sound is excellent and I have no issues with the picture.  The TV is lightweight and the side headphone jack is very useful.  The remote could be better - that would be my only criticism. However I hardly use it so its not much of an issue for me.  If you are looking for a decent size lightweight 720p HD TV this is hard to beat.", "Date": "February 17, 2011"}, {"Title": "TV review", "Author": "BeverlyG", "ReviewID": "R2RSG5FPU27QT", "Overall": "4.0", "Content": "I needed a HDTV with specific dimensions and this one really works for me.  Good quality in a small space.", "Date": "February 15, 2011"}, {"Title": "Excellent Picture and Sound. Coming from a gamer", "Author": "pvigil21", "ReviewID": "R1VYG7YB44PQDZ", "Overall": "5.0", "Content": "At first when i got this TV i had a 22 inch 1080p one so i wasnt sure if i wanted to make the trade to a 720 one. I play a lot of Xbox 360 and watch a lot of movies so picture and sound quality mean a lot to me. I decided to try it out and see what i thought. i bought an hdmi cord for a few bucks and plugged my xbox in and tested numerous games to try it out. I was amazed with the sound and picture dispite what others had said about it. pplus the size of it is great and its so light weight and thin. i love cranking up the sound and playing a game or watching a movie.", "Date": "January 24, 2011"}, {"Title": "vizio 26 inch razor led tv", "Author": "LeAnn Amweg", "ReviewID": "R2SZP3K27M7XJ3", "Overall": "5.0", "Content": "I was so happy with my purchase from Amazon.  I received a 26 inch flat screen tv in mint condition for the same price I would have spent buying one from walmart and it was only a 22 inch flat screen.  Thank you Amazon. I will shop with you again!", "Date": "January 15, 2011"}, {"Title": "The sound is fine but the color is another story", "Author": "Ann", "ReviewID": "R1CDFVH9E21QV9", "Overall": "4.0", "Content": "I purchased this TV model recently, I wanted to replace my old 25 inch tube set so I could have something better to watch blu-ray movies and play video games on, I got this TV at another retailer, and my first impression of this set was a great impression, that impression has changed some, my full review of this VIZIO is as fallowed belowPicture pretty good for 720p TV, sharpness is good, also you can adjust that if you like that's a plus, I had to adjust the sharpness some because when this model is plugged into a new location the sharpness appears dull at first, I currently have my sharpness settings at 14 but that may changeColor is bad, yes you can also adjust the color to fit your preference, but I had to adjust the color several times due to the color being distorted the color appeared very greenish, and it was difficult to fix that issue, it took many tries to get the green out of the picture, YES! I know that most HD models require an HD connection to show a good picture, and color but my LG  HDTV color still looks awesome without an HD connection, that said I have to say the color is badSound is great even if the sound bar is set to a low 6 or 7 it sounds great, so I don't understand why people complain so much about the sound, the sound is the least of the over all issues with this set, taking everything into consideration it's not a bad TV blu-ray movies look great my over all review of this TV on a scale of 1 to 10 is 7.", "Date": "September 1, 2011"}, {"Title": "As Described", "Author": "L. C. Slayton", "ReviewID": "R2VDHNI3JNUSY9", "Overall": "5.0", "Content": "We purchased this TV for our guest room/office. It is great for that room. The price was a bargain for an LED and the size is adequate for what we needed. I love the slim profile of an LED. If you are a \"bigger is better\" TV person, then this is not the one for you. I was a little skeptical just because we had never owned a Vizio before, but I am well satisfied with this one. Our Sony Bravia picture quality is better, but we paid a lot more too. Great as a secondary TV for kids and/or any room where a smaller TV is desired.", "Date": "January 31, 2011"}, {"Title": "Vizio 26\" Razor LED LCD 720P HDTV", "Author": "Oldgeek", "ReviewID": "RDFH8SQE6PZFK", "Overall": "5.0", "Content": "I have had this TV for about a month and I'm very happy with it's performance. I use it as a secondary TV. It has a very good picture and excellent sound for a small TV.", "Date": "January 30, 2011"}, {"Title": "Time Will Tell", "Author": "TawnTawn", "ReviewID": "R1PG924EJJ6WLG", "Overall": "3.0", "Content": "I bought this tv (in white) in late Oct 2010 to replace my 11 year old 32\" Panasonic. I want a 40\" or 42\" but don't want to spend that much yet, but the old tv was driving me crazy, the remote sensor had gone out and the color wasn't working either. So I got this to tide me over. I ordered it in the white from Amazon, because the shipping was cheaper than on Target. The price was $299 for the white one online, then 2 or 3 weeks later, went down to $199 at Target, and they actually had the white ones in the store (which they didn't before)! Rats. Anyway, I thought it was fine at first, I'm not a tv aficionado or anything. The sound, to me, is okay. However it did run through my channels and give me about 20 channels which I don't have. That wastes a lot of time on the remote. Not crazy about the remote either, and when I tried to program my universal remote with the Vizio code, it still wouldn't work. So...other than that, there are two more things (so far) - sometimes the color goes really bright and the picture blurs, then it comes back into focus and normal color. It doesn't seem as though it's going from a dark to a light picture either. Pretty much the same, and it'll just happen. Also, several times when I have been changing the channel with the arrow button, the tv has shut off. It also did this once when I was manually entering the channel #. Doesn't bode well. They don't make 'em like they used to. Do you think I will get 11 years use out of this one?Update: I found the code that works for this tv: 0030. However, my OFA remote doesn't have an HDMI 2 so I need to find a new remote.Update 2: The tv will now sometimes turn off when I am using the up/down arrows on the volume.", "Date": "January 28, 2011"}, {"Title": "A Great Product with Weak Sound", "Author": "Daniel V. Berry \"Vic Berry\"", "ReviewID": "R1WZ0QD0IRBBF3", "Overall": "4.0", "Content": "I have to say that VIZIO will probably be the next leading TV offering. You can't beat the value you get for the price. Moreover, I would put this TV up against any SONY TV on the market in the same size category. However, you would pay half the price. The down side of this TV is the hollow sound. Yes, I had already read about the weak sound quality of this unit, however, I got it for my XBOX 360. For me, the sound is not as critical as the picture is for video games. On top of that, I bought this one for about $200!!! Show me ANY SONY of the same size and quality that could equal this deal. The reason I mention SONY so much is that I am a typical SONY buyer. I recognize their products as the best. Yet, I have to say that SONY is pricing themselves out of the market. So, VIZIO stands ready to step in as a leader. With the quality of the product they offer, they soon will be (as long as they remember a product is only as good as the service that backs it up). Anyway, I recommend this TV to anyone wanting a great TV for their XBOX or for any other use.", "Date": "January 19, 2011"}, {"Title": "Low Price Guarantee", "Author": "John A. Nordin \"Jack N\"", "ReviewID": "R3U2YO1U87L0HT", "Overall": "3.0", "Content": "This is really a review of Amazon's low price guarantee policy.  I found a lower price on Nextag and upon looking for Amazon's procedures for claiming the lower price, I was instructed to go to my order summary and open the lower price link.  I have been unable to find a lower price link relating to my order for a TV.Today is December 23, the same day that I placed my order. This is certainly within Amazon's 14 day policy for claiming a lower price.", "Date": "December 23, 2010"}, {"Title": "screen baby", "Author": "window watcher", "ReviewID": "R334B20IQXMCXL", "Overall": "4.0", "Content": "great product great price. great picture good weight nice contrast. Might consider getting another one for another room if the price gets better.", "Date": "February 20, 2013"}, {"Title": "I'll try anything once", "Author": "I'll try anything once", "ReviewID": "R2H5Y5Q9N31VLK", "Overall": "5.0", "Content": "this is the first item I ever brought thru the internet let me tell you,I have not been disappointed delivery was good and the tele was all what my son said it would be. (so far... so good) thank you", "Date": "January 2, 2013"}, {"Title": "great purchase", "Author": "Sflcolorado We", "ReviewID": "R3HY84YYJSN0C3", "Overall": "5.0", "Content": "everything was received in good order it was a refurbished products I am very happy I purchased that no complaints everything positive", "Date": "September 30, 2011"}, {"Title": "pmonte", "Author": "pmonte", "ReviewID": "R1CRYETZTAXMDR", "Overall": "4.0", "Content": "I received this TV as a xmas gift and am very excited to own it. The quality is great, beautiful picture and fantastic definition. You wouldn't expect a small TV like this to have incredible sound, it is decent for what it is, but i recommend a sound system to go along. As for the connectivity, I was disappointed to find out you cannot connect any usb device for video playback to the TV. Only jpeg files are allowed for viewing. Other than that, I love connecting my macbook to it and watching movies. Great value!", "Date": "September 26, 2011"}, {"Title": "The best looking TV", "Author": "gpc91770", "ReviewID": "R3787VDSV6EKDH", "Overall": "5.0", "Content": "Great design. I bought the white one which looks awesome. Nice built quality. Remote control design and layout is great as well. All the buttons you need are on it. Screen is not glossy which is good. Viewing angle is good. Actually, I purchased this white tv for the design. I returned 1080 26\" tv which was on sale for $299 and got this for $329.", "Date": "September 22, 2011"}, {"Title": "RazorLED", "Author": "Barbara Bradway", "ReviewID": "RU1DKPN718VJD", "Overall": "5.0", "Content": "This product arrived safe and sound. The picture is great, we enjoy the smaller size. Sound quality could definitely be improved. Overall this is just what we wanted for the travel trailer.", "Date": "July 18, 2011"}, {"Title": "good video, but volume adjustment sucks", "Author": "C. Lopez", "ReviewID": "RHZQZ8LWCZ8Q3", "Overall": "4.0", "Content": "I consider this to be a \"it's good enough\" tv if you need something for a bedroom. At this size of tv, 720p is good enough.But there is a problem with the volume adjustment, resulting in the tv being way too loud. As you lower the volume down to 0, it goes from too loud to no sound... there is little in-between.", "Date": "April 29, 2011"}, {"Title": "Great tv for the price", "Author": "M. Wood", "ReviewID": "R2K9PB12U0RN1N", "Overall": "5.0", "Content": "This is a great little tv! I had previously purchased a 26\" Westinghouse LED HDtv, but it had screen issues. I purchased this one next and it's been great!A lot of people have commented that the sound is horrible, but I have to disagree. Mine has wonderful sound quality (not tinny at all).I have noticed the screen refreshing on dark grey or black screens, but it isn't as noticeable or distracting as others make it seem. I don't notice it unless I'm looking really hard for it. I haven't changed any of the factory settings, and I have it on set on \"home\". I actually noticed it more when I set it on \"retail\".Overall, I would recommend this tv. Obviously, there's some chance of getting a dud, but that's what return policies are for!", "Date": "February 27, 2011"}, {"Title": "SATISFIED", "Author": "CHARLIE", "ReviewID": "RVEA0UBT0Z82K", "Overall": "5.0", "Content": "I am very pleased with my Vizio tv and the quick delivery, I have no complaints, everything is as advertised. I only wish i would have not been tight on the money and gone ahead a bought the P1080 Vizio instead, but I got what I asked for", "Date": "February 9, 2011"}, {"Title": "winner among hundreds", "Author": "Jefe'", "ReviewID": "R39WOXN00XUWKS", "Overall": "4.0", "Content": "I was looking everywhere for a good deal for a TV in my college dorm room.  This TV works great for my room and the sound fills it nicely.", "Date": "February 2, 2011"}, {"Title": "A great starter tv", "Author": "Tiph", "ReviewID": "R2W7EL6K86L01X", "Overall": "5.0", "Content": "Great tv, at first I thought it had bad picture quality until I hooked it  up with HD. With it it is amazing just wish I had gotten a 32\".", "Date": "January 16, 2011"}, {"Title": "Great TV!!", "Author": "Greatthings", "ReviewID": "R3I1O8XFAWWRHH", "Overall": "5.0", "Content": "This a great TV for a great price! I thought 26 inches was going to be a bit small but it turned out to be perfect!", "Date": "December 24, 2010"}, {"Title": "Not certain about the warranty service", "Author": "erin alexander", "ReviewID": "RXF4RJAFQ6QDV", "Overall": "5.0", "Content": "When customers pay for items like this, there should already be warranty included. There should not be advertisements to purchase additional warranties. All products of this nature should come with everything needed.", "Date": "May 1, 2011"}, {"Title": "Great LED LCD HDTV!!!!", "Author": "Mr. Petar Kostadinov \"author\"", "ReviewID": "R2QJ7SCV4R5NXZ", "Overall": "5.0", "Content": "This Vizio M26OVA 26-Inch Class RazorLED HDTV is amazing!!! My dad just bought it for me for my bedroom and ever since it came in market I always wanted to get one. So, my father and I and my son and my mom went to Target and looked at the other ones that were much bigger in size and one that was same size as this one but it had 1080p included in the TV. Yet, when I went over at the displays to look at the one I wanted most, I was thrilled and happy they had it still. I know it has 720p, but the size and that is RazorLED and very skinny(thin) looks cool. Plus I love how the speakers are tilted upfront as well the stand is invisible. Very beautifuly thought of idea!!!I have another VIZIO 37\" LCD that I purchased in 2008 which is perfect in the living room. I love Vizio, great company and very beautiful tv's. The sound is superb as well!!!!Great TV, GREAT PRICE!!!! Also, if you are on the budget or just simply want a great small TV, BUY THIS ONE!!!!No matter what you choose in Size!!!! Buy Vizio!!!! You won't regret it.Also, 720p is equal to 1080p.Author Petar Kostadinov of \"The Open Road To Love\", \"Petar And His Amazing Choo-Choo Train Of Books\", \"It is Me Or Superman\", \"Speechless Thunder\" and \"It Looked Like Earth\"", "Date": "March 5, 2011"}, {"Title": "Visio 26\" LED LCD TV", "Author": "Gobbler Hunter \"Hunter\"", "ReviewID": "R33BMII14B1TV", "Overall": "5.0", "Content": "The supplier was outstanding in his reaction to an out of stock condition. The product is superb in all areas and the price was unbeatable. I am \"one happy\" customer...", "Date": "December 28, 2010"}, {"Title": "My 26\" vizioTV", "Author": "Jiyo", "ReviewID": "RS2SPOHK5ID93", "Overall": "4.0", "Content": "Overall it is good. I like it and would recommend it.Pros: it has good sound, clear view, very compact.Cons: it provides limited info about upcoming events and programs, reception is good but could be better.", "Date": "December 21, 2010"}, {"Title": "Okay TV...Terrible remote", "Author": "Tom", "ReviewID": "R1TFYZIMC0QGJN", "Overall": "3.0", "Content": "I bought two of these for bedroom use. The TV is acceptable but the remote is terrible.1) The edges and corners are sharp. I had to use steel wool to smooth the edges.2) Instead of individual buttons where you could feel what to press there is a bar that you cannot tell what you are selecting.3) The channel select is so sensitive you sometimes get a double number entry. Instead of 2 you get 22.4) The CC cannot be turned on or off without going into the menu despite the presence of a CC button on the remote. If it is on in the menu it is on even when you turn it off on the remote and vice versa.5) Also the channel select buttons are on the very bottom portion of the remote making it uncomfortable to hold and change channels.I have another Vizio with a very nice remote.", "Date": "October 31, 2010"}, {"Title": "Great TV. Awsome price", "Author": "JRB", "ReviewID": "R3HMMYU9HHDEDM", "Overall": "5.0", "Content": "=I'm not gonna bore you with explaining this or that, or comparing this or that. I bought this TV a little over a month ago, it arrived early, the box was fugly but I knew that when I bought it. Who cares about the box anyways? Will I buy from Fuglybox.com again? YES, I will. Will I buy a Vizio product again? YES, I will.07.2013 I hope I'm not jinxing the TV... Going on three years now and the TV works w/o problems. When it is time will I buy from Fuglybox.com? Yes, I will. Will I buy a Vizo again? Yes, I will.", "Date": "October 20, 2010"}, {"Title": "Terrible service, and lies", "Author": "thor bohlen", "ReviewID": "R31GZJ0IPHPJ16", "Overall": "1.0", "Content": "I purchased this TV on December 6th, and never received my product. I contacted the people who sold me the monitor on the 26th of December, but all he could do was refund my money. Now that same Monitor went up in price, and I feel that this vendor was dishonest. I ordered a Monitor and never received it from them. So in my words, Don't deal with Amazon when your ordering monitors, because they or the vendor can't live up to their bargain of the deal.Oh yeah I even wrote back, and said I didn't want my money back, but I did want the Monitor I purchased. Deal smashed by the vendor because he said he no longer has it, but yet I see the monitor on Amazon still .... for more $$.", "Date": "January 2, 2011"}, {"Title": "Very Small", "Author": "Teri-ann Phillip \"Teri\"", "ReviewID": "R44PJ2BQAOSLO", "Overall": "1.0", "Content": "OMG the worst this tv is supposed to be 2 inches and it looks like 19 maybe even smaller.... spend the extra and buy the 32 inch.", "Date": "January 29, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "720p HD with Razor LED lighting for brilliant color and contrast\nLess than 2.3\" thin (max depth 5.86\" with stand)\nSRS TruVolume and SRS TruSurround HD audio\nAmbient Light Sensing technology\nExceeds Energy StarTM 4.0 guidelines\nExceeds Energy Star 4.0 guidelines", "Name": "VIZIO M260VA 26-Inch Class RazorLED 720p LCD HDTV, Black (2010 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/41F-nfPwyuL._SY300_.jpg", "ProductID": "B003LL17HK"}}