{"Reviews": [{"Title": "Amazing Quality!!!", "Author": "That Guy", "ReviewID": "R3LP2451LICJLW", "Overall": "5.0", "Content": "When noticed this product was advertised at Fry's for $1499, I had to call and make sure it wasn't a miss print or some kind of administrative error.  To my surprise, it was advertised accurately so I picked it up the same day.  This TV is AMAZING, and the detail that I can see in comparison to my 47inch LCD 120Hz is amazing.  The picture setup is easy, and you'll be watching TV with clarity and detail you have never experienced before. I kept my old TV connected and did a side by side comparison watching the same movie through a Blu-ray player and the difference is very noticable, even my wife points out details that she didn't see before. The sound is spectacular, and the voice clarity system ensures that the music/background noise doesn't drown out voices.I have not tried to use the 3D mode yet due to lack of interest in wearing glasses while watching TV, but if you look at the CNET review for this TV, it says that it has one of the best 2D pictures in TV's reviewed this year.", "Date": "December 27, 2010"}, {"Title": "One Problem After Another", "Author": "IKHyland", "ReviewID": "R1L5XXOPLM2TWC", "Overall": "1.0", "Content": "I have spent many hours reading the reviews of the different LED TV's, and finally purchased the LG 55LX9500.  I was so excited when I received it!! The picture was AWESOME!!  Within a few hours, I noticed a little black spot on the screen near the top right hand corner.  It wasn't a bad pixel, but what looked like a bad backlight LED.  I called LG Customer Support, and reached a call center overseas.  After explaining the problem over, and over to the support rep, he finally determined that a repair technician would need to look at the TV.  The repair tech. was scheduled for an 8:00 am - 12:00 pm appointment window, but never showed.  I finally received a phone call at 5:30 pm, and he said that he would need to order the LED backlight panel.  I was told that the parts should be here in about 1 week.After waiting over 3 weeks, I received a call from LG Customer Service.  The parts are not available, and don't see them being available anytime soon.  LG then offered to replace the TV with a brand new unit.  I was OK with that.  After checking inventory, there were no 55LX9500's anywhere in stock.  LG then offered a refurbished unit as a replacement.  I was a little uneasy with this, but I agreed to take a refurbished unit.  After checking inventory, there were no refurbished 55LX9500's anywhere in stock.  LG then offered a 2011 comparable model replacement.  I got a little excited, but then was let down when I was told that there was no model to replace this TV.  LG finally said that they will give me a refund for the amount I paid for the TV, but not the 3D glasses I purchased that only work with the 2010 LG TV's.  Luckily, the retailer I purchased them form said that they would take them back outside of their normal return policy for in-store credit. (Thank you OneCall, you guys are GREAT!!)LG Customer Service told me that I should be receiving a phone call from their logistics company to pick up the TV.  At this point, the screen started displaying vertical stripes on the right half of the screen.  The TV was still viewable, but it was rather annoying.  After waiting a week, I contacted LG Customer Service again, and was told that I should have been provided with the contact information for the logistics company on the first call I made.  I then contacted the logistics company, and gave them the reference number I had received.  The logistics company couldn't find any reference to me, or my reference number.  I then called LG Customer Service again, and I was told that they hadn't yet entered my return request. (after a week)  I was then assured that they would be entering it by the end of business that day, and should be receiving a call from the logistics company \"Within a few business days\".  That night, the TV has stopped working completely.  It is now 3 day later, and I still haven't heard from the logistics company.  This is the only TV I have in my house, and it doesn't work.  I have to wait for LG to receive the TV in their warehouse, and inspect it before they will issue a refund.I can then order a new TV, and wait for it to be delivered.  After this level of customer service I have received from LG, I will NOT be purchasing another LG product.", "Date": "June 27, 2011"}, {"Title": "Absoluty, Positively best TV on the market right now, 3D or 2D", "Author": "JJSS", "ReviewID": "RFA2M5SD0VU1Q", "Overall": "5.0", "Content": "OK, so I had made my decision to buy a new television and have spent the last 4 months researching televisions, HDMI, 3D, contrast ratios and just about anything else related to television specs. I decided, besides from my research, the only way I'm really going to get to make my decision is by going to the local tv dealers (Best Buy) and deciding there. I made up my mind to go with a 3D LED television, although there isnt alot of 3D options right now and everyone is raving about the Panasonic 3D plasma, I felt like the 3D LED-LCD TV's offer the best contrast ratio. By the way, contrary to popular belief, don't let anyone tell you contrast ratio isnt that important because IT IS. I narrowed my list down to 4 desirable selections: the Samsung UN55C8000, the Sony Bravia KDL55NX810, the Vizio XVT3D554SV, and the LG INFINIA 55LX9500. I went into Best Buy, and they only had three of the TVs I wanted, the LG wasn't on display. According the salesman, the LG was \"too expensive to display\", whatever. So I thought \"ok maybe this is a sign to mark that off the list\". I compared the other three, had the salesman hookup all three to a blu-ray player and then a 3D blu-ray player, and by far the Samsung blew the other two out of the water. So I decided on that one, but I was going to order through Amazon from OneCall (by the way the best place to order online, definately go with them!!!) because they had the same TV $600 cheaper than Best Buy's SALE price. I figured I can go ahead and buy some 3D glasses, 3D BLU-RAY player and a couple of movies with the money I saved. I got home, signed into Amazon and as I was about to click the \"add to cart\" button for the Samsung, a review off to the side of the screen on the LG 55LX9500 caught my eye. I'm thinking \"Ok that's weird\". I read the review, and it was like a preacher preaching the gospel to me, I became a believer (not to be a blasphemist). So I took a HUGE risk and ordered the LG tv, which by the way, Best Buy had the Samsung TV at $2699 instock and the LG TV at $3999 ship to store, and OneCall on Amazon had the Samsung TV at $2085 and the LG at $2099, YOU CANT BEAT THAT PRICE!! When the TV arrived, let me tell, you the first thing that gives you that \"WOW\" effect is the elegant design of the very slim bezel along the border of the TV. It is almost all screen, very sexy! I hooked it up to my PS3 since my 3D Blu-Ray player hadnt made it in yet (another positive of OneCall is fast shipping!) played Avatar, and ladies and gentlemen, I cant even express the sheer beauty of the picture quality OUT OF THE BOX!! IT WAS'T EVEN CALIBRATED YET! I know a guy that professionally calibrates and I had him over and he was even stunned by the picture. At the time I was actually looking for another 55\" TV for my game room, so I ordered the Samsung for the heck of it to see, and when it showed up I hooked it up to the same playstation, all which were plugged into the same panomax power conditioner, and folks it couldn't even compare!! I sent back the Samsung and got another LG for my game room. ALl I can say is I know this is just a review and viewing preference and picture quality is completely subjective and opinionated, but I highy reccomend this TV and if your in the market for a 3D 55\" LED telivision, try it out. Another yet positive about OneCall is if your not completely satisfid with the product,  you can send it back within a certain amount of time. Try it, and I guarentee you won't be disappointed. Panasonic VIERA P54VT25, eat your heart out!!!", "Date": "March 2, 2011"}, {"Title": "THE BEST LED ON THE MARKET!", "Author": "bbsal", "ReviewID": "R1RE2HJ0SJT662", "Overall": "5.0", "Content": "I am a video enthusiest i searched around and around and have personally checked every single tv on the market for quality performance and options, this lg 55 inch beauty is by far the best led tv on the markey for picture quality and for apps games and more all built into it! Another nice feature is the magic remote it comes with included it is a remote that is like a wii remote you can point at the screen and pic what you want like a mouse on the computer it is awsome and works great!A friend of mine just bought the samsung led 8000 series from bestbuy a couple months ago and although its a good tv its picture quality is not even in the same ballpark as this lg lx9500!Some great features include widgets from yahoo weather finace games mlb network and much more, also youtube, netflix,vudo hd videos that you get a free hd movie rental with the tv!!!No i dont work for lg nor am i prasing this tv just cause i own it like i said i did my homework if your going to buy a led tv and have 2000 to spend on one this is the tv to buy and i would never recommend another!Also would like to add the local dimming feature is superb it dims the led bulbs during dark pictures for the deepest blacks i have ever seen on a lcd and very very bright whites, also this tv is 480hz! not 240hz not 120hz but 480hz!! The true motion feature does give it a soap oprea look and either you will like it or you will hate it but either way you can turn off the true motion in the menu setting wich might i add is full of great features.Heres how i have my menu setting setup for calibration maybe it can help a few people who dont know how to do this go to menu setting then expert 1 this is my daytime setup if you like it brightthis is the settings to use for daytime.Profile: Expert 1Backlight 75Contrast 90Brightness 51V/H Sharpness vertical 55 horizonial 60Colour: 50Tint: 0Dynamic contrast: Off but medium looks about the same as off so i leave off high is way to rich!Skin color: OffNoise Reduction OffDigital Noise Reduction OffGamma MediumBlack level LowReal Cinema on for bluray some inputs you cant select this option!Colour gamut StandardEdge enhancer highxvYCC AutoColour filter OffColour Temperature mediumGamma 2.2RGBMethod: 2 pointsPattern: Outer* Red contrast: 0* Green contrast: 0* Blue contrast: 0* Red brightness:0* Green brightness:0* Blue brightness: 0TruMotion Off/OnLED local dimming OnAspect ratio Just scan", "Date": "March 6, 2011"}, {"Title": "Great TV!", "Author": "Value Investor", "ReviewID": "R12X8YOINCW04", "Overall": "5.0", "Content": "I read several negative reviews about the TV before buying, but took a chance since the price was right.  The TV has some quirks in that it gets better after using it for several days.  I think many of the negative reviews are based on testing the TV right out of the box.  The true colors of the TV comes out only after several days of usage.I am very happy with my purchase!", "Date": "January 26, 2011"}, {"Title": "Fantastic picture and incredible service from OneCall", "Author": "Li'l Stinker", "ReviewID": "RSCGOXCI1WK8O", "Overall": "5.0", "Content": "FIrst, the TV -- it lives up to its glowing reviews, plain and simple. I did a ton of research for TVs before taking the plunge with this one, and I have another 55\" HDTV (240hz) from Samsung as a comparison. I like the LG more because of the pristine picture quality and sound. I even tried the 3D and I have to say that although I felt like a dork, the experience was pretty cool ... 3D in my living room! Now for the important part of the review. I found scratches along the top edge of the bezel (clearly, they came from the manufacturing side since the packing was perfect). The scratches were noticeable enough that I called OneCall to replace the set. I was so impressed with their service; they got back to me right away and didn't even hesitate to send another set, picking up the damaged one, even though I know they likely took a big loss on the first set. Bottom line, I highly recommend this set ... and even more highly recommend OneCall. That's what customer service should look like for big purchases like this.", "Date": "April 2, 2011"}, {"Title": "Good purchase", "Author": "NicoleM \"NicoleM\"", "ReviewID": "R199CN2STSHJSK", "Overall": "5.0", "Content": "Saw an LG TV on display at local retailer and liked picture.  Compared 2D THX certified version and standard 3D version.  Later saw that this model was 3D and THX certified and the price was LESS than either of the others.  Had to buy.  Has a great pictures and even SD movies look wonderful with this TV and a blu ray player.  3D is cool and looks good, but even with 55 inch is not like movie theatre b/c you have the frame.  But wow, love that the frame is so narrow.  The glass gets glare in a room with mostly windows, but not enough to make me stop watching and in the dark, the black is so black that there is not even that \"TV glow\".  I would definitely recommend this TV.", "Date": "February 12, 2011"}, {"Title": "Technophobe who is now a believer", "Author": "D. KIM", "ReviewID": "R2751X5QQEAMIB", "Overall": "5.0", "Content": "I am a complete technology luddite who knows nothing about technology but was so drawn by the combination of design aesthetic and advanced technology that I just had to get it.  Lo and behold, when I took it out of the box and had it setup, it exceeded my all my expectations.  The picture quality is amazing, the sound was so good (in the context of my 1BR new development condo)that I almost regretted buying a home theater in a box to pair it with.  The design aesthetic is what really makes this TV so unique.  What can I say other than it is just flat out pretty, i.e. the borderless screen, the sheer thinness of the monitor, and the sharp black color that has no problem either blending in or contrasting your background.  At under $2200k, I think I got it at a great price and for a techno-dummy like me, it's great that I have a TV that is \"set it and forget it\" and pretty as hell to boot.", "Date": "May 11, 2011"}, {"Title": "It has great pros, a few cons...", "Author": "Frankie Grisco", "ReviewID": "R2Y5USWKU4CB2G", "Overall": "4.0", "Content": "Even though I bought this TV based on its features of which I am very pleased with, I am disappointed with its inability to be flush mounted to a wall, tilted downwards using standard tilting wall mounts, or be hooked up directly to a stereo surround sound system using standard RCA plugsThe color and picture quality are really outstanding. When viewing 3D content on this TV with LG's 3D viewing glasses - close up images appear to come out of the screen right into the room and the wide-view angles are truly excellent. It's also nice that the frame around screen allows for fitting it in places where other TV's with the same screen size will not fit.On the downside... You can't really flush-mount this TV to a wall. Another peeve of mine... There's only an optical audio output and no places to plug in standard RCA plugs from the TV to a surround sound system. You should also know - the unit does not come with 3D glasses which is stupid because you can only view 3D content with LG's brand of 3D viewing glasses. But, again, the LG glasses make the images jump out of the screen.", "Date": "April 22, 2011"}, {"Title": "LG LED TV (55LX9500)", "Author": "Ted", "ReviewID": "R3C7AWLS986B2B", "Overall": "5.0", "Content": "It was hard to decide between this TV and the Samsung since in my opinion both are excellent.  There was no intention to use 3D so reputation for poor performance in that area had no influence on the decision. The final decision boiled down to asthetics rather than performance since that seemed to be a wash between the two. I love the very narrow bezel and the support of the LG. This TV has been a real pleasure to watch. The desktop for the PC I use looks awesome and Netflix looks great.", "Date": "April 8, 2011"}, {"Title": "Do Not Buy!!! NOOO", "Author": "Thomas L. Distefano", "ReviewID": "R2Z7IYLSVYNH37", "Overall": "2.0", "Content": "On paper the Tv sounds great and even in the show room you might be impressed but don't be fooled! This TV has some of the worst banding I have ever seen on a TV (meaning that black lines show on the tv when it pans from dark to light sources) and the uniformity is completely horrible. Worst purchase. Ever made and I went through 2 panels so it is not a malfunction it is just the TV. Some people may not care or even notice it that much but if you are looking for a truly flawless picture (and at this price point you do not deserve anything less) than go with Panasonic Plasma. I scrapped the LG 55LX9500 for a Panasonic TC-PVT0 and OMG...night and day and thousands cheaper than what I paid for the LG. Forgeabout this TV and move on.", "Date": "July 14, 2012"}, {"Title": "Closing In On HDTV Perfection", "Author": "John Werner \"JWW\"", "ReviewID": "R376ATMXIMFEN8", "Overall": "5.0", "Content": "When LG introduced the 55LX9500 it was, if memory serves me correctly, around $5K.  It seemed to be one of those items that LG fully intended more as a \"statement product\" than a mass market volume product.  First, the 55LX9500 was a testament to style, it was at the time the thinnest 55\" LCD HDTV available with full-array LED back-lighting-at barely over 1\" thick at it's deepest depth point!  That wasn't all, however, as the TV also had virtually no bezel with a solid, edge-to-edge, glass front with only the slightest recessed black fascia under the glass.  This, very effectively, gave a virtual picture hanging on the wall effect that seemed almost beyond belief.  It gets better...Speaking of the picture, what a picture the 55LX9500 has.  This TV is true reference set still as of late 2011 as it has the crispest video with best contrast (amazing whites and deep blacks that have gobs of detail rendered) I have ever witnessed in my home or any other place.  I can't speak as to the 3D aspect (I'm not interested in something that is still what I consider half-baked no matter who is hawking it), but the 2D is so amazing it has extra depth in perception which makes every DVD I own a must watch again!This HDTV is almost gone, but some do remain to be had.  I urge anyone interested to take the plunge as the current pricing, as well as the price when I purchased it from Amazon back in March, is way less than half of the original introduction price.  Getting back to my early comments regarding this being a statement product...I think it did what LG wanted it to do, that being raise the entire company's cache in the high-end LCD HDTV business.  After showing it off to the press at trade-shows and then selling the number they decided upon at full-price they did what manufacturers often times do:  LG used the \"buzz\" created by this set to sell the mainstream line and got out of this set by drastically reducing the price.  What this should tell anyone is that LG is not just with Sony and Samsung, but can even trump them.  So, if you can find this set it really is very much a \"state-of-the-art\" unit at a now bargain price.  It stands with the last generation of Pioneer plasma sets in its ability to render details and superior blacks at the same time.  I couldn't be more pleased and give LG a big \"high-five\" as I now have a set that even Donald Trump would be proud of.  Donald and me certainly don't enjoy equality on too many levels when it comes to consumer goods, but this one is an affordable luxury marquee product to be sure, highly recommended.", "Date": "October 12, 2011"}, {"Title": "Wow!  55\" LG LX9500 Uber 3D HDTV Picture is Simply Stunning!", "Author": "Tommy J. Yates \"TJY in DFW\"", "ReviewID": "R3FYB2YBBN7VK", "Overall": "5.0", "Content": "Purchased with some trepidation from One Call (Huppins) because of being shipped freight from WV to TX, but package arrived safe and sound with shock tags intact.  Right out of the box this set was just amazing.  The thin bezel and thin profile are certainly a plus, but the picture is among the best we've seen from any of the major manufacturers and the price we got through Amazon just makes it that much sweeter.  I also ordered the internet dongle and 3D glasses from Amazon.  Internet setup was a breeze and we immediately ordered a 3d movie (Alpha & Omega) and sat down with our granddaughter to try out the glasses.  The 3D experience was as good as any theater 3D experience we've had, except maybe at Imax.  The 3D technology worked perfecting as did the internet streaming.  I'm no techno-expert by any means, but I do appreciate great performance and good value, and I think I got both in spades with this purchase.  If there is any negative, I guess it would be why the internet capability is not built into the set and why the remote control does dot have a slide out qwerty keypad.  Other than that, I highly recommend the 55\" LG LX9500 to anyone researching high end 3D LCD-LED sets.  I'm in awe everytime I get a chance to sit down, relax, and watch it.", "Date": "March 23, 2011"}, {"Title": "great picture", "Author": "TheLynx", "ReviewID": "R2HAVZWNL7ZZ8A", "Overall": "4.0", "Content": "Pros:*excelent quality picture with vibrant colors*fast response time while playing Blackops, I noticed a vast increase in kill/death ratio*SPDIF fiberoptic output!!! (unsure if it's surround)*full array LED is FAR better than edge lit when it comes to blooming*Wii style remote is awesome, however still waiting on my harmony remote to support it*the \"seamless\" design should be introduced into all new TVs.  totally love it*very, very thin... I actually regret getting a flat panel standCons:*Full array LED's have a poor placement, when watching some widescreen movies blooming at the top is easily seen where at the bottom it's not existant (depends on which sections are on).*You can't type in the input names yourself (ie. PS3 or XBOX-360 both are HDMI and can only be called 'Game')*wireless internet sold seperatly, seriously screw you LG for this one*the \"dynamic\" backlighting is really annoying when it's cloudy outside.  The backlighting keeps changing.*glare is pretty badPersonal thoughts:*I can not see 3D, wasted alot of money on this and 2 sets of 3D glasses.  Plus you can't buy Avatar in 3D until 2010*pixel testing is very painful and annoying, but once done you know your good*all in all I am still walking into my living room and thinging that I want that TV", "Date": "February 28, 2011"}, {"Title": "Could not be happier", "Author": "Brian G. Carrillo", "ReviewID": "RTN0F4LTKLUP5", "Overall": "5.0", "Content": "We absolutely love this TV and cannot be any happier. Highly recommend. It took a little bit of time to finalize the picture but it was worth it. We have on the TV since August 2010 with no problems.", "Date": "November 29, 2013"}, {"Title": "Nice set but......", "Author": "mrgumbie", "ReviewID": "RORENQOK5WMKC", "Overall": "1.0", "Content": "I purchased this television in February of 2011. I was clearly impressed by the picture quality and colors. The 3D is just amazing and it appeared that this was the best TV ever until.....August of 2012. This television that retails for $4995.00 and that I paid $2200.00 experienced something that is called PIXEL FAILURE. In short I have SEVERAL vertical lines on the television that are visible to anyone willing to take a look in various places on the screen. I purchased a LG Premium Care Warranty thinking that this wouldn't be a problem and they would just fix the TV considering the fact that I only had the set for a year and a half, but, I was told the only cure for this problem was to replace the ENTIRE PANEL in the television that cost $2300 to $2600. That was more than I paid for the television, therefore they refunded me my purchase price MINUS $100 for the technician to come out and diagnose the problem. I'm not totally at a loss because LG knew they couldn't economically fix this set....SO THEY LET ME KEEP IT. I like the fact that I have a 55 inch 3D television at a total cost to me of about $300 dollars, but, I bought 3D glasses, 3D blue ray player and  plenty of other electronics to immerse myself in what I thought would be the ultimate home 3D experience. Turns out that I had to buy another 3D Television (LG 55LM9600)September 2012. I purchased a warranty from Best Buy this time for TOTAL REPLACEMENT within 5 years if something goes wrong this time. Bottomline....do your research and buy warranties carefully. I thought I did!!! I did give LG a second chance by purchasing basically the same TV updated. Any product can have faults, but if the current TV fails, believe me you'll hear about it.", "Date": "February 23, 2013"}, {"Title": "Great Buy for the Price", "Author": "Kevin W. Evans", "ReviewID": "RTOLUFXLL2ZGK", "Overall": "5.0", "Content": "Great Picture, very little setup required, the 480hz processor really pays off with picture quality and refresh rate for 3d, overall a great buy!", "Date": "May 24, 2011"}, {"Title": "Amazing colors, awesome set.", "Author": "G. Mathias", "ReviewID": "R2DFEWLWASLYEI", "Overall": "5.0", "Content": "I got this TV after much investigation and reading online reviews and this set has not disappointed me a single bit. Awesome set for its quality, columns, features and the asthetics.", "Date": "April 16, 2011"}, {"Title": "LG LX9500 55\"", "Author": "Edward", "ReviewID": "R2HR6PZCMVFBDB", "Overall": "5.0", "Content": "I bought this item from AMAZON dealer ONECALL and the reason I selected ONECALL was based on reviews and the 30 day return policy should you have issues with the product.Yes, there are other dealers through AMAZON with a lower price but the 7 day return policy did not sit well with me.. GO ONECALL ELECTRONICS...!!If you wish to buy this TV go with ONECALL ELECTRONICS for their excellent customer service and willing to help with more discount.The LG LX955 55\" I bought after 3 months of research and reviews was the best choice, in terms of picture quality and the Local demming technology combined with the modern glass screen it fits well in any room.My TV is mounted and it will give any visitor the the WOW !! EFFECT in terms of design and the modern look.The remote control is easy to navigate, so is the Magic wand remote control.Each button is well placed and spaced out, the remote has a backlight for use in the dark.The LX9500 is connected to my Samsung 3D BD-C6800 with built in wireless Blueray player and within 5 seconds of powering the unit on, I was on the Internet(Netflix) watching SPARTACUS..my God the picture quality was amazing, the color sequence between each scene. The best I ever saw and it is better than the Samsung C9000 that was my first choice.LG LX9500 is the best LED 3D TV in the market, it is a little heavy with lots of output for any device you have now or in the future. TRUE-MOTION works excellent in action movies so each scene is not missed or dull unlike other high end Televisions. the cross-talk on the 3D is not noticeable at all.. excellent 3D sequence, color, motion and crystal clear picture was amazing.. WOW !!!.. it s truely the one in LED TV.The LG LX9500 has a built in surround sound speakers at the back, its sounds well, but mine is connected to my BOSE home theatre sytem and the sound combined with the look and quality of the movies is AWSOME !!! simply cannot describe the effect.The LG LX9500 \"yes does reflect light to the screen if you have a bright room, but if you place it in a room with curtain or few windows you will not notice the light reflection at all, but sit and enjoy the work of art.it is called the boarderless TV even though it boarder is present but very slim to the glass edge.If reflection would be a problem buy it and work with your environment were you would place it, or simple increase the backlight on the Television to eliminate the reflection..The LG LX9500 55\" I have is the LG Infinia brand the top of the line but the word \"TOP OF THE LINE\" here is true in terms of technology and picture quality.. design and built in content.Yes, its expensive and one of the Best high end 3D televion but its worth the price.", "Date": "January 31, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Wireless 1080p Ready\nTruMotion 480Hz\nNetCastTM Entertainment Access - Netflix, Pandora, YouTube & More", "Name": "LG 55LX9500 55\" 1080p 480Hz 3D LED LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/21BTKf%2B7rzL.jpg", "ProductID": "B003EEYCKI"}}