{"Reviews": [{"Title": "Great TV!", "Author": "L. Bridgman \"technogeek\"", "ReviewID": "R1725XE0JHV1HG", "Overall": "5.0", "Content": "I have had this set for a couple weeks now and I am thrilled with everything about it.  It has special, \"invisible\" speakers that use the bezel as a sound distributor.  It produces sound as crisp and clear as any other set I've owned, but it lacks the low end range that my surround sound has.  No big surprise given the lack of a sub woofer.  The led technology does produce incredibly deep blacks, just as advertised.  HD broadcast, DVD, and blue-Ray all look fantastic.  Sports broadcast in HD are gorgeous, and i haven't noticed any clarity problems with rapid moving images as can be true on some LCD sets.  Standard broadcast stations are  fuzzy, more so than my 50\" Samsung plasma.  I really like the auto-select feature on the screen settings as it makes switching between sports and broadcast movies easy since you don't have to switch the aspect ratio manually like on my Samsung.  Finally, I am enjoying the streaming netflix videos via the Internet connection.  I opted to use a wired connection direct from my airport.  No set up problems with this set at all.  I didn't buy it from Amazon, got it at a local retailer at a better price  listed here.  Oh, and near as I can tell, the image on this page looks exactly like my set, contrary to what the other reviewer claimed.  Maybe they changed the image?  Overall, a great set with which I am very happy!", "Date": "November 7, 2010"}, {"Title": "Light leaking issues", "Author": "AC \"Studmaster5000\"", "ReviewID": "R4NYTCPC4LDQB", "Overall": "2.0", "Content": "I got this set hoping it would have an excellent picture, and it does - if the scene is not dark.  This tv has major issues with light leakage and blooming as a result of the edge lit semi-local dimming.  In dark scenes the edges of the set have a good amount of light leaking in.  As far as the blooming goes, this set activates squares of LEDs behind the sections of screen that have something going on.  The problem is in dark scenes this square of light is painfully obvious.  Imagine a night sky shown on the screen with nothing but a small moon.  The tv recognizes the section of screen that has the moon and activates a square of LED behind it.  The problem is that the 1/16 of the screen that has the moon will be lighter than the rest of the screen (the tv I believe has 16 independent LED sections).  So what you see is a moon in a grey box with black all around.  Very disappointing.  Sending it back.The styling of the tv is nice.  the purple accent is hardly noticeable. The buttons are touch activated as opposed to ones you press in.  Easy set up.", "Date": "December 15, 2010"}, {"Title": "Love My LG!", "Author": "T. Hawkins \"hardcore shopper\"", "ReviewID": "R2FYG9TNX6S7VD", "Overall": "5.0", "Content": "I've had my LG 42LE5500 for a few weeks now and I couldn't be happier!  The picture on this TV is so good that it makes our livingroom TV look really inferior, especially on SD cable stations; so, we ordered an LG 55LE5500 for our living room to replace our 52\" DLP (which we love but don't like having to replace bulbs)! The 55 is supposed to be delivered this weekend and I'll post a review once I've had it for awhile.We have the 42\" in our bedroom and it's perfect! We have it wired to the internet and we have highspeed so I'm not seeing any problems with the streaming quality  - streaming Netflix is far superior on this TV compared to streaming it through my Wii on our living room TV. Vudu HD - OMG, I didn't realize a movie could look so good!  I've not tried the other apps or a blue ray movie yet but hope to soon.Many people complain about the \"soap opera\" effect with the LED/LCDs...yes, I have that on this TV but it doesn't bother me anymore.  It's the price I pay for having such a clear picture.  I know I can probably adjust some screen settings to add more noise or judder but I don't feel the need at this time.Sound - I love the Clear Voice II selection - DH used to have a problem sometimes hearing the dialogue over the action sounds and with Clear Voice on, he doesn't have any problems; and, I don't have to keep answering his \"what'd they say?\" questions.Edge lighting - many people complain about the edge lighting and I just don't get it - yes, I see a tiny bit of light bleed into the dark banding around widescreen shows but, for me personally, it's not that noticable - it looks like a tiny edge of spotlighting across the top of the TV.  And, I don't see it at all in non-widescreen shows/channels/movies.I honestly don't understand the negative reviews for the LG LE5500s - we are very happy.  But, long term will tell.", "Date": "October 27, 2010"}, {"Title": "My first LCD HDTV", "Author": "Robert Lewis", "ReviewID": "R3ON35YK8UX1X3", "Overall": "5.0", "Content": "I had a plasma HDTV which gave out after many great years of service.  I loved the picture and was a little leery of going to LCD.  After a very exhaustive search I decided upon this HDTV.  When I first got it I was not a happy camper as everything looked like a soap opra.  It was strange.  I tried many adjustments with little difference.  I then ran across people having the same issue.  The solution is to turn off the tru motion.  That did it.  Just some tweaking to my preferences after that and I am completely happy with this TV.  Excellent purchase!!  Had over six months now and no change of opinion.  Love it!", "Date": "February 21, 2011"}, {"Title": "Thrilled with my new LG TV", "Author": "CinemaFan", "ReviewID": "R2498ERXLQAMZQ", "Overall": "5.0", "Content": "I have enjoyed my 42 inch LG 5500 for a week now. Comcast provided me with HD service, as my new TV replaced my old 27 inch CRT TV in my living room. Assembled to its stand, the TV is sturdy.  The TV is easy to use and its features are easy to adjust.PICTURE QUALITY on this LED LCD TV is fantastic! Blacks are very black, whites are white, colors are great. The picture is bright. HD TV shows & commercials display way more detail than on my old CRT TV. Viewing angle is excellent. There are no \"flashlight\" effects when I turn off the lights, or any other problem. The matte screen is important to me as I have a lamp facing the TV.SOUND (edited)ranges from very good to not so great depending on what I am watching. The speakers are on the back of the set. In the audio settings, I turned on the Infinite sound.I purchased a sound bar and have turned off the TVs speakers.CONNECTIVITITY is useful. I connected the TV with an Ethernet cable to my Verizon FIOS router and downloaded updates. I connected another 25 foot cable, the HDMI, to the HP Multimedia desktop computer that I purchased in January. The computer has a HDMI port and a graphics card that transmits sound, so my new TV can function as a large computer monitor to show photos & videos on my computer or from my computer's CD/DVD drive.  I can also stream from the Internet anything such as TV shows from Hulu.I love my LG TV!", "Date": "December 14, 2010"}, {"Title": "THE BEST QUALITY PICTURE I'VE EVER SEEN", "Author": "W. Shigley", "ReviewID": "RQQUPBMB3AW3J", "Overall": "5.0", "Content": "I've been to a lot of bussiness looking for the TV with the best quality picture and this is the one I setteled on.  I certainly have not been dissapointed.  The clarity and deep colors and particullarly the sound are without equal.  I'm convenced that all the new TV's with the speakers projecting out the back or side are designed that way to encourage buying a sound system to receive a quality sound. This TV doesn't need an extra sound system even though it projects out the side.I also like the ease of using the menu for a custom selection on any item.  The light weight is very surprising based upon the size. I have it set on a good intertainment stand and have no fear of it tipping over or being knocked over.The TV must also be very durable as the shipping box that it came in when UPS delivered it was crushed on one side very badly.  Very rough handeling but took it out of the box, set it up and it operates exceptionally.I wouldn't trade this for any other TV that I've seen.  The LED/LCD would be my choice again and particullarly the LG model.Hope I'm able to say this a year from now.", "Date": "December 18, 2010"}, {"Title": "LG LE5500 42\" LED", "Author": "EL CHEAPO NORWAD", "ReviewID": "R116BOVF9MSZRG", "Overall": "5.0", "Content": "we have had this TV for three weeks now and have been very pleased. we wall mounted it in the bedroom and hid all wiring and cablebox in the closet behind that wall. i tweaked the adjustments to get it set the way i thought i would like it at night and it lets you save that setting and then in the daytime we go back to the default setting for more brightness. the picture is great, the sound is fine for our use and the setup was quite easy. the complaints of the edge lighting do not bother me. its very rare that we notice it. it seems every type of tv has some weak point in technology but this is no problem. we were originally going to buy a smaller cheaper TV but caught this when it was on sale and do not regret the purchase. i did not want all our tvs to be the same technology. we still have a couple tube tvs and will eventually replace them. our other tv is a 52\" sharp aquos LCD and we have had it 2yrs. the LG is faster ,brighter and more enjoyable to watch. i still enjoy watching our sharp tv but there are some programs that look better brighter and i opt to watch them on the LG. we compared this with the le5400 in a nearby store that had them set up side by side. the 5400 seemed brighter in store than the 5500 but the overall picture quality seemed better on the 5500. it may have been adjusted that way. i will eventually buy the wireless feature for streaming movies.", "Date": "December 10, 2010"}, {"Title": "My first HD TV, and I think I choose wisely  :)", "Author": "RCM106", "ReviewID": "R1C25S9MA06SP3", "Overall": "5.0", "Content": "For the price that I got this at, it is absolutely amazing.  Never could I imagine how much detail I was missing with my previous TV.  My girlfriend and I went back and watched some movies we had on just DVD, and saw detail we had missed before in movies we had seen several times.  The picture quality is great!  At first all I had plugged into it for cable was just the coax line from the wall.  The quality with that was pretty scary, but a trip to T!me W@rner and an HD box later, the signal is excellent and the HD channels are superb!  One thing that I noticed off the bat is that 120mhz made everything seem like it was moving faster, like normal human motions, cameras seemed shakey.  What it really was was the TV showing me all the FPS whatever it was I was watching had.  So basically my eye is just used to blurred images when it comes to fast movements.  I got use to it right away.  I cannot wait to get a blu-ray player for this, (I can wait for the Blu-ray movies to come down in price though)Gaming:  Unbelievable how much more fun gaming is online.  I played COD black ops right as soon as I got it.  I played xbox 360 on a monitor before because my 19\" wide screen had a better quality picture than my 27\" big \"tube\" TV.  The difference between that TV and this one is simply stunning, even size set a side.  I have found nothing but perfection with this TV so far!", "Date": "December 6, 2010"}, {"Title": "GREAT TV", "Author": "August Mccord Sullivan", "ReviewID": "RND0S6LWOXREK", "Overall": "5.0", "Content": "This TV is a great item!When deciding on a new TV i considered either a plasma or an LED. Since my main purpose would be for gaming i decided on LED.  Once I decided on the technology i was debating the size. I though 40 or 42 in would be the best since i will be using it in my bedroom and I wanted it 2 be big enough for splitscreen.  This TV is very thin and very attractive looking. The touch buttons on the front are really handy.  Screen quality is very good for HD content on my xbox 360 but only average on standard sources like cable.  I got a better price on this one compared to the sony and samsung competitors", "Date": "November 11, 2010"}, {"Title": "Nice TV", "Author": "VMo", "ReviewID": "R18ZU61LRII4PO", "Overall": "5.0", "Content": "Searched and searched for a HDTV.  Saw this, went to my local store to take a look at what it looked like... Liked what I saw.  At the time of purchase Amazon had the price beat by $400!!! I know it is not the top of the line, but I/we could not be any happier with the purchase.", "Date": "May 23, 2011"}, {"Title": "Have had it for over a year and still love it..!!!!", "Author": "Jose D. Salas Arce \"Engineer\"", "ReviewID": "RG2585QY28R7B", "Overall": "5.0", "Content": "I've owned this TV for over a year and I can honestly say I like it even more than most TV's out there that have evolved for a year.Great image, great definition and watching 1080p movies in it it's simply amazing, the only thing that's missing is 3D..!! lolDon't think about it anymore and just buy it!!", "Date": "December 1, 2011"}, {"Title": "Elegant Picture & Design!!!", "Author": "blairf", "ReviewID": "R2B3MTJSF94KV0", "Overall": "5.0", "Content": "Pros - Gorgeous purple color tint around exterior frame and table stand. Best remote I've used with an LCD TV. The picture quality is extremely bright and clear.Cons - The sound quality is mediocre with weak-sounding speakers in the rear facing back toward the wall. Not much bass and it sounds pretty empty for a TV that costs this much. You should use external speakers.", "Date": "July 27, 2011"}, {"Title": "The good panel", "Author": "avlisk \"avlisk\"", "ReviewID": "RRJXQ8KLNWR9", "Overall": "5.0", "Content": "If you get the \"good\" panel, which I luckily did, this is a great TV. Purchased 42\" on line for under $800 at Walmart. The sound is very good, as are the blacks, and almost everything else. No light leaks at all.  I use it in a slightly dark living room and bought an LCD/LED screen due to a window directly behind the viewer. No reflections in the screen from the window! The remote needed a bit more thought in design, but the TV itself is beyond good. I use over-the-air broadcast and this tuner brings in twice as many channels as my old digital to analog converter box. I even watched golf over the weekend because the picture was so realistic. Very easy to set up. Love the Netflix and YouTube. Note: this is my first non-CRT TV, but if it's representative of LG LED TVs, go for it.", "Date": "June 22, 2011"}, {"Title": "Perfect!", "Author": "Glen S.", "ReviewID": "R1DJBP10Z1UOMZ", "Overall": "5.0", "Content": "I like everything about this TV.  Everyone who sees it comments on how nice the picture is.  I like the Internet connections too.  It hooked right up to the wireless in my house.I would absolutely recommend this set to anyone who is looking at 42\" TV's.", "Date": "December 28, 2010"}, {"Title": "Excellent Flat Screen Choice!", "Author": "A. S. Beauchamp", "ReviewID": "R3NBB49N0GQ7R4", "Overall": "5.0", "Content": "We waited a long time to purchase a flat screen television (this is our first) and we are so thrilled with our choice. The clarity of the picture is beautiful and crisp. Being internet ready is fabulous for our whole family. The price point could not be beaten elsewhere and we feel we received a great deal for money well spent! Oh...and it also arrived earlier than expected and without a scratch or dent in shipping.", "Date": "December 27, 2010"}, {"Title": "Wow", "Author": "Christian", "ReviewID": "R3LD30CH4M89I", "Overall": "5.0", "Content": "Wow this TV is even better than what I expected it to be.  Even before ordering it I had read all of the descriptions, customer reviews and even third party reviews on the product and all said that it was a great TV but I was still unprepared for how awe inspiring it was to see with my own eyes.  I mostly use it to watch movies and play video games and I must say it is a thing of beauty.  All of the settings are customizable and savable so I can have the best experience with the TV no matter what I'm using it for.  Great buy I would highly recomend to anyone looking for a top of the line TV.", "Date": "December 1, 2010"}, {"Title": "Super buy!", "Author": "Stilts", "ReviewID": "RY8H0156N1X99", "Overall": "5.0", "Content": "This television is a marvelous buy! I had been waiting for my 2004 32-inch HDTV ($3000) to die so I could justify replacing it with a larger model. I wanted an LED TV, but could not justify the cost. When this went on sale for less than $800, I snapped it up and I could not be happier.The picture is terrific, it is extremely slim, and it will show a slide show (or video or music) from a flash drive you can insert in one of the USB ports. The sound is only okay, but the picture more than makes up for it.It also has the ability to network with your router, but you must buy an adapter to do this (I did not).One thing - in some advertising pictures it looks like the set has a wood grain. It does not.", "Date": "November 27, 2010"}, {"Title": "great value at 850", "Author": "pickyeater", "ReviewID": "R25ZUIU7D7JJKP", "Overall": "4.0", "Content": "Web app interface could use improvement. For example, if you are watching a Netflix movie and want to set the sleep timer, you have to exit out of the movie, set the timer, restart netflix, find your movie, and play it. Otherwise, a great TV.", "Date": "December 27, 2010"}, {"Title": "Great TV set, great features and excellent pricing", "Author": "vgare \"vgare\"", "ReviewID": "R2FQ3KGF1M0OLC", "Overall": "4.0", "Content": "In just a few words I'd like to reccomend this TV to budget buyers as it is excellent quality and feature set for a very nice price. I've had it for a month and a half now.", "Date": "January 31, 2011"}, {"Title": "Volume doesn't work", "Author": "JC", "ReviewID": "R4V9I74YRIWIK", "Overall": "2.0", "Content": "Volume on TV sticks at one level and cannot be changed, after you reboot 3-4 times then it works again.  Called LG they had repair service out to fix a connection.  Now it is happening again, called LG back after 45 minute call, repair service is coming out yet again said they will have probably replace the board", "Date": "December 7, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "LED Plus w/ Local Dimming\nNetCast™ Entertainment Access (Wi-Fi Ready)\nWireless 1080p Ready\nTruMotion 120Hz\nFull HD 1080p Resolution.Refresh Rate - 120 Hz", "Name": "LG 42LE5500 42-Inch 1080p 120Hz LED Plus LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/31Oz2xMLBtL._SX300_.jpg", "ProductID": "B0039RV0AU"}}