{"Reviews": [{"Title": "good deal, some limitations", "Author": "Michael L. Earl", "ReviewID": "RKB85RZE540DO", "Overall": "4.0", "Content": "A good TV at a very good price; it does have a couple of issues, which may be no big deal for you, depending on your needs.Good:  The picture is very good, comparable to much more expensive sets, in both standard and high definition.  The 120Hz refresh does make a difference, although if, like me, you're accustomed to the slight jitter of high-speed motion on a 60Hz set the smooth motion will seem a little unnatural at first!It has a good selection of input ports.  No real internet connectivity, but I figure that functionality will be obsolete in a couple of year anyway, so it makes more sense for that to be built into a dedicated component or blue-ray player or something similar in any event.Bad:  Power cord is hardwired into the back of the set, rather than being detachable - that was a real nuisance when I was trying to run the cables.  More importantly, the internal speakers are pretty poor.  Compounding this problem, it has neither analog audio out nor a headphone jack!  If your external speaker system/receiver takes digital optical SPDIF (\"Toslink\"?) connections (most recent ones do), you're good - otherwise you'll need an adapter (Somthing like this: Digital Audio To Analog Audio Converter, although mine is still on order so I can't vouch for it yet.)Still, if you want really good sound, no flat-panel will deliver that, and you could add a $200 soundbar to this to get a system that will have as good a picture and much better sound than more expensive sets.  If you already have a good sound system (especially one with optical inputs), this is a very good option for the money.", "Date": "October 11, 2010"}, {"Title": "Just awsome", "Author": "Brayton M. Sparks \"BIG B\"", "ReviewID": "R3PFFLTNCUGFT0", "Overall": "5.0", "Content": "Just bought this tv 5 days ago and love it. I used to sell tv's and best buy and circuit city. So i know how toshibas are. they might not be the tv with the most features but definitely you can't beat the quality and price. I looked at many different sets and this one is just an awesome value. Are there better tv's out there? yeah of course. But for the price you can't beat it. It's just awesome. The 120hz on this is very good. The black levels are awesome. It's really thin for being a normal lcd thats in a midrange category.", "Date": "July 1, 2010"}, {"Title": "Not one problem, period", "Author": "Gary", "ReviewID": "R131VEWDSEXTSS", "Overall": "5.0", "Content": "I purchased this TV about a month ago and have put it through its paces and I must say that for the price I paid ($599 at a local dealership that matched Fry's weekend price)I am pleasantly surprised.  The picture is superb and running 1080p Blue Ray discs are incredible.  Little loss of signal using high-end HDMI connects however sound is a bit disappointing.  I would tend to agree with other reviewers stating that there's a great deal of sound loss using DVDs or games (PS3 and XBox 360).  As per the norm, this was solved with a good surround sound system and is no longer an issue.  The sound isn't horrible; it just isn't wonderful... it's perfectly adequate for normal TV viewing and only suffers when playing from another source.  Blacks are absolutely deep enough for the average user and shouldn't be a cause for concern in the least.  Response time is good, the 120Hz helps a bit but does have a tendency to make things appear \"soap-opera-ish\" when viewing.  You can turn the 120Hz off if you prefer...it didn't bother me enough to change the settings.  Factory settings are ok- brightness was set appropriately and while I could have left the settings as-is, I had to play with them to get the perfect picture in my mind.  Toshibas tend to shade toward the red side so I simply compensated for this idiosyncrasy through the settings and made it a little \"cooler\" for my preferences.  Set-up was a snap- I had it out of the box, set-up and playing in less than 5 minutes.  In terms of the stand being kind of flimsy, that's true.  But as long as you're not in a position where someone (kids??) could knock the thing over, I don't see this as much of a problem.  If you do have this concern- attach it to your wall and it won't be an issue.  The thing even shows analog programming without much of a problem which is commonly an issue with some manufacturers.  The remote is pretty intuitive with settings easily found, especially if you actually read the owner's manual and learn what you're doing.  I would highly recommend this set and give it an overall 4.5 out of 5.UPDATE:  I have owned this television for about 2 months now and have learned a few things that I would like to share.  First of all, I am still thrilled with the performance of the television and have to look hard to find something to complain about.  In fact, I really have no complaints.  The loss of sound volume when changing sources to either Blue-Ray or any of my gaming systems from the cable source is a bit annoying but can be solved by simply increasing/decreasing the volume on the TV.  Since I'm running a surround-sound system and rarely use the actual TV volume, it's not much of a concern to me personally but could irritate someone using the TV exclusively for sound.  Even with the 120Hz running full-time (it can be switched to a 60Hz setting) I still see ghosting/chopping from certain programs, most notably a golf ball in flight or a long pass in football.  No problems with hockey, surprisingly, nor with basketball.  I have started using the USB hook-up and love it for everything from my IPod to anything else that I can source from a USB hook.  The menu, after careful review, is very user-friendly and in terms of changing settings,etc. offers simplicity at its finest.  The remote is a pleasure to use and is extremely intuitive when it comes to settings changes.  The computer serial-port hook-up is acceptable, but when you use the HDMI input for your computer, it's amazing.  Nothing better than an computer-HDMI hook-up and something like Hulu, TV.com or YouTube on the Toshiba.  Takes my computing experiences to a completely different level... I hardly ever use my monitor anymore. I still wholeheartedly recommend this unit, especially if you can get it on the cheap.", "Date": "October 5, 2010"}, {"Title": "Not up to expectations from Toshiba", "Author": "Jon D. Vanslyke", "ReviewID": "R33JXUQK7DB1SG", "Overall": "3.0", "Content": "I'm a toshiba fan. I own a toshiba laptop and it has been a great computer. However, I was disappointed with toshiba on the quality on this tv. The picture was as good as it gets, couldn't ask for better. The downside was the stand was made of flimsy plastic that felt as if it could break at any moment and the sound was extremely sub par compared to samsungs comparable tv. If picture quality is all you care about then this tv would be a good choice.", "Date": "October 2, 2010"}, {"Title": "Great tv", "Author": "William d Bierbaum", "ReviewID": "R137J654IC5RFR", "Overall": "5.0", "Content": "This is three Toshibas that I own one is a 13 dvd combo 8 yrs old in my camper great little tv. The other a 26 lcd nice unit. This 46 is awesome great picture and decent sound. very stylish and light weight. My sony weighed in at 235lbs what a beast. /took Three big men to get it out of house. This toshiba has plenty of outputs for all your needs. Amazon is the place to get this great service and fast delivery", "Date": "June 16, 2010"}, {"Title": "Great HDTV", "Author": "Holly Amlin", "ReviewID": "R2PAE6WJI0B0CR", "Overall": "5.0", "Content": "I am a first time HDTV buyer, and I ended up getting a great deal on this one. The picture quality is amazing, the sound is great, and it fills up my living room with its awesome HD power! It has just the right amount of extra features. I am very happy with what I got for the price!", "Date": "August 17, 2010"}, {"Title": "Very much worth the price. Great value.", "Author": "Kevin B", "ReviewID": "R2SXWL4352DLDW", "Overall": "4.0", "Content": "My roommate bought this TV, and put it in his bedroom (which is about 12' x 14'), and I helped to set it up.  Personally, I think that 46 inches is bordering on too big, but from across the room HD shows do look FANTASTIC!  SD channels look like the usual crap, varying from show to show, but that is not the TV's fault at all. (Dish network receiver, HDMI connection.)  We also have a DVD player connected via the component input, with dvd's progressive scan option turned on (480p). Looks about what you expect of dvd--watchabe from across the room. With dvd player set to 16x9 output, you must choose \"full\" as the screen size, or else the picture displays as literally 720x480 in the center of the screen.I LOVE the fact that the TV remembers picture settings for each input.  It has some presets for picture (sport, standard, movie, and personal). And switching to a preset does not erase your personal preset settings. One thing tho:  you must Must MUST disable \"Auto Aspect Ratio\".  It 'guesses' wrong the screen size for DVD player (top and bottom of menus are chopped off).  Also, \"Normal\" setting for picture size overscans (zooms in) more than just a little bit on the satellite picture.  \"Native\" is the best fit for Dish Network HDTV.  IF you leave Auto Aspect Ratio on, then Native setting reverts back to Normal for some reason, maybe when the channel is changed to an SD channel.  I have no idea why overscanning should be the Normal setting.  I can't imagine a situation where that is necessary. To me, Native should be the default, and Normal should be re-labeled 'Overscan.'  There are also other scan size presets (\"Theater\" settings), presumably for zooming/stretching letterboxed movies, and/or correctly displaying 4x3 material on DVD---but who knows.The speakers sound better than the speakers in the tv it replaced (an older 27in Sharp CRT), so no complaints there.  And, it has PLENTY of volume.  If shows aren't loud enough for you, you're either def, or have something connected wrong.  There are presets for sound, which resemble EQ presets, but leave those off.  I tried \"Action\" setting while watching Indiana Jones dvd, but the enhanced lows were quite distorted. Best to leave that off so as not to overpower the speakers.  There are several special-effect sound settings listed under 3d sound (Theater, arena, church, etc), but they just make it sound like you're in a cave of various sizes. Q sound is a fake surround selection that is separate from the 3d cave sounds. I have it turned on, but I don't notice much difference.Also, I found the blacks were too crushed, and the whites were too glaring/distorted.  I know everyone is impressed by the blackest blacks, but there is such as thing as shades of grey.  Bringing down contrast level helped a bit with the distorted whites, but then I found that Dynamic Contrast was set to maximum.  Seems it blackens the blacks and whitens the whites to ridiculous levels.  I reset it to low and we're much happier.There are 2 choices for picture Noise Reduction.  The first is pretty standard.  The other promises to reduce artifacts specifically caused by MPEG compression. Since artifacts differ from channel to channel, and even show to show, I've set it to it's lowest setting. Use these sparingly, unless you like video looking like a low-quality jpeg photo.  There are some other settings which I have no clue what to do with. \"Film Stabilization\" is one. Manual says its to help 'eliminate video shaking'.  But what IS video shaking?  I've never had a video shake on me before. I thought 120hz (Clear Frame option) was supposed to fix that...unless it means some sort of vertical shaking?? Oh, and mentioning the manual, it's quite good at explaining all the other settings, with helpful pictures of the various menus.  I only wish they hadn't separated the video picture settings and the advanced picture settings into different chapters (Same for audio and advanced audio).  But that's a very minor complaint. It's a nice little booklet, with both English and French sections. Most manuals suck; this one doesn't suck.Oh, and for those who don't like \"TOSHIBA\" lit up on the front, you can turn that off in a menu.  I think that is very nice of Toshiba to do.  So quit complaining.  And the stand is ok.  Not sure what the bitching is about there.  What do you want?--plastic is plastic. If you want a steel reinforced, jewel-encrusted platinum stand, you're out of luck.  Oh, and the manual has good advice on where to place the monitor, as in, on a STURDY table, and out of kids' reach.  Read it.", "Date": "January 4, 2011"}, {"Title": "GREAT HDTV FROM TOSHIBA", "Author": "Kevin R. Day", "ReviewID": "R2OF21U708VFYV", "Overall": "5.0", "Content": "This TV will take a normal TV show and make it feel like you are actually in the same room with the actors. You can actually see every freckle and detail on the actors faces. Easy Hdmi hook up for computers and it doesn't miss a beat when syncing the audio from a home movie. You can't go wrong with this set. Sure it's not a 3D tv but think how many times do you want to wear those glasses that give you a headache after the movie is over. If your looking for an awesome TV with phenominal sound and resolution at an affordable price this ones a no brainer.", "Date": "November 11, 2010"}, {"Title": "A Great HD TV!", "Author": "Gary Marotta", "ReviewID": "R2DLNBTI8T5362", "Overall": "4.0", "Content": "Actually, I would rate the Toshiba at 5 Stars except for the rather anemic speaker system. 10 watts per channel is marginal for regular broadcasts; inadequate to compensate for the volume loss associated with most DVD & Blu-Ray players. Since most of the TVs I looked at share this problem, I guess the manufacturers assume you will add a surround sound system to your new HD TV. (I added a Toshiba BDX-2700 Blu-Ray Player and a JVC TH-BA1 Soundbar System. Now my entertainment system rocks!)", "Date": "September 10, 2010"}, {"Title": "first hdtv", "Author": "MW", "ReviewID": "R1E7JBJZTI5ML8", "Overall": "5.0", "Content": "This is only the 4th week of me having this TV.  It has proven to be a very good TV.  The colors are vibrant.  The sound is more than adequate.  The Tv is in my family room right off the kitchen and sits on a 45\" stand.  It really brings out the room.  I would definitely recommend this TV to others.", "Date": "November 19, 2010"}, {"Title": "Excellent TV! Highly recommended for people on a budget!", "Author": "Sam", "ReviewID": "R3OX2NG7VTEOTA", "Overall": "5.0", "Content": "I received this TV a few weeks ago and I am impressed. I was a little disappointed initially since the picture quality was not the best.But then I played around with the picture settings and BOY! what a difference!!!I have a Samsung and this can easily be compared to Samsungs. The Black levels are infact SIGNIFICANTLY better than entry level and midrange(upto $1500) Samsungs. The black levels on the toshiba are almost as good as plasmas.PROs:1) Great picture quality2) Multiple HDMIs (Not really a pro since almost all TVs come with 4 HDMI ports)3) Programmable remote4) The best thing is that we can turn of the 120hz refresh rate when you dont need it. This is a feature not available in most TVs. If its a 120 hz tv it will be 120 all the time. This can cause minor picture artifacts while watching movies or regular TV. I think its a very hand setting. I use 120 only for sports, action movies and games for the most part.Cons:1) The remote sensor takes around 20-30s to become responsive at long range2) Sound is not the greatest (It is not bad by any means). But I can bet that NO HDTV in the price range offers impressive sound.3) Not the thinnest TV on the marketThe above Cons were minor and can easily be remedied or ignored.4)It does not have a headphone jack or any other ANALOG audio output. The only way you can hookup to a theater system is through 'digital audio out'. Most sound systems have a digital audio input. but if you have really old sound systems then this will require a $50 digital to analog sound converter.Overall, this is a VERY IMPRESSIVE tv with excellent picture quality. Since picture quality is the most important factor in a TV, I am giving it 5 stars. I probably would give it 4.5 since it does have its minor problems. I got this TV for 40% of the cost of similar samsungs and sonys so I will keep the savings and not whine about the minor inconveniences.", "Date": "March 7, 2011"}, {"Title": "Great Buy", "Author": "JLw7v2", "ReviewID": "RPGE1MFAZ6D31", "Overall": "4.0", "Content": "I bought my Toshiba a few months ago and let me tell you I love it. The picture quality is amazing, and I love the 4 HDMI ports on the back and side. The only flaw of this TV is the sound quality. It's a simple fix thought, I got a Denon Reciever with Boston Acoustic Speakers for my surround sound and let me tell you, with great sound and with the great picture this TV is amazing.", "Date": "February 19, 2011"}, {"Title": "Good TV, but won't save settings", "Author": "jscott004", "ReviewID": "R20TG86YUSB93N", "Overall": "3.0", "Content": "I just got my Toshiba 46G300U3 a week ago. I love the picture and the sound seems just fine to me. However, mine will not keep any settings I choose in the menu and it defaults to antenna every time it is turned on. It's almost like each time I turn it on is the first time it's ever been turned on. I've tried to search online for answers, but have found nothing. If their tech support cannot help me, then I will return the TV and try another.", "Date": "February 5, 2011"}, {"Title": "Glad I spent the extra money.  This one is a keeper.", "Author": "J. Swart \"GaPeach\"", "ReviewID": "REHYHR4LWZWJB", "Overall": "5.0", "Content": "Long story short .. I ordered and returned two other tv's from amazon prior to this one.  The others cost considerably less, partially because they were 42\" and this one is 46\", but also because I was chasing \"value.\"  But is it really a value if I question my decision every time I look at it?  Color and saturation are very important to me.  Fleshtones should be true, blacks should be black and not washed-out, vivids should be vivid, and subdued tones should be subdued.  Not asking too much, I hope.  The other tv's just couldn't get it right.  I became increasingly dissatisfied and finally decided I owed it to myself to see if improvement was possible.I ordered this Toshiba because the brand has served us well in the past.  Took it out of the box, set it up, and I haven't made so much as one adjustment since.  It is perfect.  Colors are right-on.  Crisp picture.  120 MHZ does the trick.  Football games are incredible.  As my husband says, you can see the breathing holes in the jerseys.  I watched the HD nature channel the other day and counted the feathers on the birds (well, almost).  We couldn't ask for more.  Have read through others' comments about the remote, the stand, the various plug-ins, and honestly can say none of this matters to me.  The remote works fine, the stand is MUCH BETTER than what I got with the other tvs, I can hook my computer to it through a hdmi cable just fine, so I'm very content.  Some people talk about flickerings.  I haven't noticed any yet, but did buy a SquareTrade warranty, just in case.  And by the way, the illuminated TOSHIBA on the frame is way cool.My impressions.  Hope they are helpful.", "Date": "January 11, 2011"}, {"Title": "The Best Deal of this Decade!", "Author": "Matthew W. Johnson", "ReviewID": "R2NNY3737DQLOK", "Overall": "5.0", "Content": "I just purchased and have received this mammoth television, in all its wonderful beauty. Honestly this device is an engineering marvel and absolutely hands down one of the best televisions. The picture is outstanding and the 46\" inches make watching it just awesome.At first I was considering the LG 42\" which was featured on Amazon, and I actually ordered it. However when I returned to the homepage I found this television, for a mere 30$ more, at a total of 676$ which is an unreal deal. I immediately cancelled my order and got this one instead.My overall conclusion on this television is, its simply great and there is really nothing wrong with it at all. I will however point out some interesting things, I have discovered after its arrival. Keep in mind these are very minor things and probably completely irrelevant to 99% of the world.I can't seem to find a headphone jack on the television which is funny, because I have never needed one before, ever, on a television. However we recently had a baby, and I've got some great Bose noise cancelling head-phones, so it would come in handy if it existed. Nevertheless, likely not an issue for most people.Next the internet cable, is merely for connecting to a home network via a router, it does NOT connect you to any type of internet including net flicks or any other web based services. Something to consider. In addition to that, I had a difficult time connecting my computer to the TV via the router, although this is not a TV issue and something to do with Windows 7's bizarre way of handling permissions. Even though I'm a graduate student in Computer Science I still haven't figured it out, and concluded figuring it out wasn't worth my time. Ultimately it allows your other computers in the network to behave like USB drives, where the TV can access photos, music of videos. I think the formats are Jpeg, mp3, and mpeg2 and a couple of similar variations. I discovered this by plugging my 250gb external hard drive into the USB port. The only problem, again not with the TV, was all my video files are non-HD and in general pretty low quality/resolution so they look like crap on the giant screen.The menu navigation is the tiniest bit \"different\" and I found it not completely as intuitive as many other menu interfaces. Keep in mind I assure you, it is the tiniest bit. Most people, maybe everyone but me, won't even notice and it really shouldn't affect your decision but if you're truly 50/50 between two TV's... I experienced this menu navigation aspect most when using the USB port and trying to connect the TV to my network.The television is surprisingly light weight, much much lighter than I ever expected. A friend and I easily got it out of the box, attached the stand and got it set up.As far as any other aspects to this television, everything is simply outstanding and better than I could have even imagined. This is probably one of the best purchases I have made in a long time, if not ever, and I don't expect to be disappointed anytime soon.The picture is great, the sound is good, the access to the ports, and the number / variety of ports is great. If you are looking to get a new television for the living room or bedroom, I strongly recommend this one and trust me, you can buy with confidence and pleasure because I promise you, you will be pleased, and glad you made this purchase.", "Date": "January 8, 2011"}, {"Title": "Great bang for the buck", "Author": "Retell", "ReviewID": "R26948B6OT3QQN", "Overall": "4.0", "Content": "Got this to replace my grandparents 2 year old Sony Bravia that went bad, decided early that we weren't getting another Sony. The price point for this was perfect, the least expensive 46in LCD at the time.Pros:Gorgeous display, 120hz is gorgeous!4 Screw base vs 2 screw.4 HDMI with 1 located on the side panel.Buttons on the side.Speakers on the side (very helpful with a wide screen TV)The matte finish is very nice, glare reduction is adequate.The ability to turn off the backlit Toshiba logo is nice.Very thin for a traditional LCD.Nice build quality and finish on the tv.Game mode works very well, Gran Turismo 5 looks incredible.Cons:The IR sensor is in the far left corner, doesn't always pickup remote functions (miss rate is maybe 1/20)On certain sounds, the speaker sounds loose a little bit and can sound raspy, but it isn't enough to say bad sound quality.No ability to customize input labels, they have Laser disc, but not Blu-Ray?It is network connected (DLNA), but extremely limited capability. No apps or anything, just seems underpowered.Not really a con, but we've decided to disable 120hz when watch movies, it can be very distracting and mar cinema style.", "Date": "January 2, 2011"}, {"Title": "Best Purchase", "Author": "Ace996432", "ReviewID": "R2SYUP7BQ07SNK", "Overall": "5.0", "Content": "I did some extensive research when searching for a TV and found this Toshiba 46 inch 1080p 120hz LCD for under $700.  Immediately purchased and couldn't be happier.  Sound quality is amazing, picture is outstanding, very light-weight, all around a great bang for your buck.  It may not have all the amenities a more expensive TV might have(Internet, Youtube, FB, etc) but that's what a laptop is for. If you're looking for amazing picture, sound, and energy efficiency that won't break the bank - look no further.", "Date": "January 2, 2011"}, {"Title": "Good Value", "Author": "Robert Rizzo", "ReviewID": "R667TVRIGMZ6E", "Overall": "4.0", "Content": "My siblings and I bought this set for my parents.  They are thrilled with it.  The picture is clear and crisp.  The setup was easy.  My parents are not please with the remote but that's really not much of an issue anymore as they mostly use the cable remote anyway.A very good value.  We recommend this set to anyone.", "Date": "October 8, 2010"}, {"Title": "Nice picture, nothing else", "Author": "Matty", "ReviewID": "R1DH5IZCZM3QYW", "Overall": "2.0", "Content": "UPDATE 2/14/11: After living with this t.v. for over a month now, I have to drop my rating to 2 stars. Honestly, with this t.v. you're getting picture quality and price, and nothing else (such as: ease of use, sound quality, features, etc....). My four-year old JVC was superior in every way other than picture quality.There are quite a few thing about this set that are extremely annoying, and have hindered my enjoyment thus far, one of the biggest being the captions thing (see #9 below). My primary point of reference is my previous set: a 40\" JVC 720p LCD purchased in late 2006- an excellent t.v. for its time, and still going strong at my mom's house.Annoyances:1. mute button must be pressed 2x to mute the audio (I know this shouldn't be a big deal, but it really bugs me; I don't find the \"1/2 mute\" function useful)2. no remote control shortcut buttons for easily getting into different settings- i.e. for audio settings, for quickly and easily switching between different brightness modes (i.e. \"sports\", \"standard\", \"movie\"), etc... You have to go into the main menu for these simple, frequently-used tasks3. doesn't remember your aspect ratio preferences, so you have to manually change this to your liking every time you switch channels (if for example you switch between a 4:3 broadcast that you want to expand to fill the screen, and then change to a channel that is natively widescreen and you want to view this naturally, you have to manually change the aspect ratio every single time)4. no clock function- even my 20 year-old Zenith could be programmed to keep time5. startup delay of almost 15 seconds is pretty ridiculous; also takes a long-ass time to change channels6. t.v. does not swivel left and right on the stand, you have to turn the entire apparatus7. no analog audio output, thus incompatible with my old-school stereo receiver (when I send analog audio directly from my DVD player to my receiver, and send video directly from DVD to t.v., the sound and picture are noticeably out-of-sync)8. sound/speaker-placement is pretty awful (unable to produce any noticeable bass without distortion)9. captions refuse to go away when the t.v. is muted, even after changing the appropriate settings in the menu; just found out from Toshiba customer service that it is impossible for the user to remedy this; I truly hate this aspect of the t.v.10. can't adjust screen brightness when my laptop is the input11. range and directional sensitivity of remote is quite narrowThe picture is fantastic, and the price is right, but if you want any sort of features (even pretty basic ones), look elsewhere.", "Date": "January 23, 2011"}, {"Title": "great tv!!", "Author": "missouri_mule", "ReviewID": "R1VBCBU2DFBDEV", "Overall": "5.0", "Content": "its a good tv and a good value for the bucki cant find any faults with it so farexcept still having probs hookin up bose sound system....just sumthin im missin im surean audio setting that i havent found yet", "Date": "January 30, 2011"}, {"Title": "I love it!", "Author": "AsfilmSD91", "ReviewID": "R25BKJRXH4SKGB", "Overall": "5.0", "Content": "I bought this TV at the end of Novemeber in 2010, and I absoluetly love it! Great picture, great sound, it just looks great. The ONLY problem is that the remote has to be perfectly lined up with the power light to change anything. But if you're not lazy and don't mind moving a little, then it's no problem at all. Great deal for only $650!!", "Date": "January 28, 2011"}, {"Title": "love it", "Author": "jeffrey roach", "ReviewID": "R32T04AVMUAKVV", "Overall": "5.0", "Content": "I love this TV for the price the picture and quality of Toshiba  I used too sell Toshiba products and I know how well they are built, I installed it on the wall in my basement family room and it looks great.If you are looking for a great TV at a great price I would recommend the 46g300u Toshiba.", "Date": "January 28, 2011"}, {"Title": "Excellent Value", "Author": "Mountain Man", "ReviewID": "R2VXFFO3PVKUHC", "Overall": "4.0", "Content": "The Toshiba 46G300U Toshiba 46G300U 46-Inch 1080p 120 Hz LCD HDTV (Black Gloss) is an excellent HDTV for the price.  I received my Amazon delivery in only four days, and everything was in perfect condition.  The delivery service personnel unpacked the TV in the location where I specified, and they plugged it in and verified that it would at least power on correctly before they left.Some reviewers were very disappointed with the stand; however, I find it adequate for our use.  It is plastic, but it seems substantial enough to support the TV without danger of falling over.  The manual suggests attaching a strap from the back of the TV to the wall to prevent its being pulled over.  Since we have no children in the house, I have not installed a strap; and I plan to wall-mount the TV later.The sound quality has been criticized by several people, and it is not the greatest.  However, it is certainly adequate to provide all the volume that I desire in our living room.  Even though my hearing is not the best, I usually set the volume between \"5\" and \"15\" (\"63\" is maximum) for normal listening.  For truly \"quality\" sound, a surround sound system would be required.The picture quality for HD channels is excellent.  I have made some minor picture control adjustments to slightly improve the picture for my preferences.  The picture quality for non-HD channels is not very good by comparison.  (Although this is my first \"large screen\" HDTV, I am already spoiled after viewing HD programming -- either 1080i or 720p broadcasts.)  From what I understand, this non-HD quality issue is not so much a problem with the TV as it is with the station transmission.I had read about a problem with the picture flickering on this model TV, but thankfully I have not experienced any difficulties with it.  The only negative issue I have experienced relates to the remote control.  When the TV is first powered on, sometimes it will not respond to selections on the remote control unit.  After a couple minutes, this \"non-response\" problem disappers.  I am careful to point the remote toward the lower left corner of the screen, and the problem is independent of the distance from the screen.  I haven't yet been able to isolate the cause of this apparent \"warm up\" problem, and it is more an irritant than anything at this point.  Hopefully it will not become worse, or it may disappear with battery replacement (which I have not tried).Overall, I would highly recommend the Toshiba 46G300U for its value and quality, and the Amazon delivery service is first-rate.UPDATE:  After seven months, this Toshiba TV continues to perform with excellence.  The remote control \"warm up\" issue remains (it has not gotten worse, nor has it improved), but I have learned to live with it.  After power-on, it simply takes a minute or so before the remote control will function normally in all respects.I have \"programmed\" the remote control to operate my Magnavox DVD/VCR player/recorder, so I no longer need to have two remote control units to operate the TV and the DVD/VCR unit.  The Toshiba remote now handles both devices after I figured out which codes to enter from those listed in the Toshiba manual.The plastic stand has proven to be substantial.  I have not yet moved the TV to a wall mount, and I have no concerns regarding the strength of the existing stand.  This continues to be a first-rate HDTV, and I would make the same purchase decision again!", "Date": "January 5, 2011"}, {"Title": "Wonderful value and beautiful picture", "Author": "Sam Hwang", "ReviewID": "R386DE27ST35GF", "Overall": "5.0", "Content": "I compared the picture to Sony and Samsung (comparable price) and found very little if any difference but got a bigger screen for same money.  I paid $704 at local appliance chain on sale and must say I am fully satified with quality-rich colors, black \"blacks\", and easy of use.  Changes channel very quickly and has great tuner.  I don't use the built in speakers but have bought a Samsung sound bar which I like a lot.  Would definitely buy again.", "Date": "December 17, 2010"}, {"Title": "Toshiba pretty happy", "Author": "M. A. Higgins \"Markhig\"", "ReviewID": "R3DIP7T7E8HNM7", "Overall": "4.0", "Content": "I first bought a Samsung from a big box store. The sound quality was so bad I had to take it back. If I compare price,size,picture,and sound quality; I am very happy with the purchase. I have had no problems. The delivery service was a little slow or I would have given it all the stars.", "Date": "November 2, 2010"}, {"Title": "mediocre quality", "Author": "charlie brown", "ReviewID": "RJ4EL8TSS4MGR", "Overall": "3.0", "Content": "the main problem is that it takes a long time to turn the TV on. Once it's on, it takes another 30 seconds for the remote to work properly. It is not easy to adjust the color either", "Date": "January 31, 2011"}, {"Title": "an excellent TV, few compromises, no problems", "Author": "Theophrastus", "ReviewID": "R8YXWKCU5PSDE", "Overall": "5.0", "Content": "This TV is excellent overall, including the picture quality and the built-in over-the-air tuner. A small flat antenna is capable of pulling in many channels at a distance of several miles from the broadcast source.  The only compromise is that the lower frequencies in the sound spectrum are a bit light, but the sound is still of good quality.", "Date": "August 3, 2011"}, {"Title": "An Awesome Unit If You Don't Need External Audio", "Author": "R. L. MILLER", "ReviewID": "RRH2362KS7C0N", "Overall": "3.0", "Content": "This set is not built with the user who wants to go the reliable route of external sound systems that call for component cables--the only audio outpit it has is the TosLink digital output (for optical cable), and these ports sometimes has imperfections that make it impossible to plug the cable all the way in. Regular component jacks on the set would solve that problem. You'd lose the \"superior sound\" that audiophiles and the salespeople rave about, but at least you'd have something that worked. I hesitate to add the phrase \"as God intended\", but home entertainment gear makers are too much into high tech enthusiasm and the slightest flaw and you're out of business unless all you want to do is use the set's own speakers.I finally got the jack far enough in that it works (after a fashion), but I dread doing anything that makes the thing fall out. I give this set three stars rather than one or two, because the set works just fine on its own. But don't go the \"home theater\" route until they've come up with a more dependable TosLink port, or at least add component jacks for us dinosaurs who want to spend our money on stuff that works even if it isn't exactly \"cutting edge\". This issue makes me wish there were still TV repairmen who made house calls.", "Date": "June 2, 2011"}, {"Title": "happy with the purchase", "Author": "I. Kunz", "ReviewID": "R2B52FWSDVXW46", "Overall": "5.0", "Content": "Picture quality is great, remote bit lousy. Networking works ok - everything that runs through DLNA seems to play well. It's a shame that DLNA does not support MKV. Overall this is really nice TV for a great price.", "Date": "March 22, 2011"}, {"Title": "Excellent Choice", "Author": "Ashley Walters", "ReviewID": "R3RT8NTIOWOLI0", "Overall": "5.0", "Content": "This TV has been great. It was easy to set up and has a gorgeous picture. The delivery from Amazon was even faster than I had scheduled!The media player is not very easy to figure out and some of the menus are a little wonky, but once the TV is up and going you would rarely have to deal with them so it is not a big deal. The picture quality you get for the price far outweighs any negatives anyway.There might be better TVs out there, but not at this price point. You will not be disappointed.", "Date": "February 21, 2011"}, {"Title": "Great deal. Horrible remote control.", "Author": "Juliocchox", "ReviewID": "R1YNS0KJ4WJOY5", "Overall": "4.0", "Content": "Bought this tv on deal for 558 w/ fs. Great deal. Good picture/sound. Remote has a range of about 4 feet and you can't use it the first 30 seconds after you turn on the tv. The power cord is attached to the tv which can be a bad thing for people that want to mount it. But asside from that it was a great deal! Under 6 shipped! 5stars for the price.", "Date": "February 20, 2011"}, {"Title": "best value for a tv", "Author": "alexis espinoza", "ReviewID": "R3FFJ1I4UTSKA6", "Overall": "5.0", "Content": "I would like to start off by saying i paid only $548 for this 46inch Toshiba and let me tell you it is amazing. The base for the tv is pretty great the reviewers that complained dont know what the're talking about, sturdy plastic much better than my other tv's (vizio, sony) the picture is so pretty amazing with the 120hz and 1080p while watching blurays , i watched the latest batman flick and it looked like i was looking through a window during the imax scenes throughout the film.  It does however make movies look a tad fake because there is no blur so you can see everything probs, stunt doubles cgi everything! sound is average for the tv. overall great value great price great decision.", "Date": "January 21, 2011"}, {"Title": "Love the TV wish it had a compsite audio output.", "Author": "Heather Long", "ReviewID": "R3MO87YYD8JCBJ", "Overall": "5.0", "Content": "I was very specific about inputs when I was looking at TVs.  This one has a ton of different kind of inputs and has allowed me to attach an amazing array of components to it.  The only thing I didn't worry about was hooking up the surround system to it.  As we all know there is more than one way to skin a cat and we got it done via the cable box but it has a couple seconds delay.  Other than that we love love love this TV. It has a beautiful picture, great sound, and looks darn good hanging up on my wall above the mantle.  I highly recommend this TV.", "Date": "December 27, 2010"}, {"Title": "what you see is what you get", "Author": "miss e", "ReviewID": "RNRW7DD10BMV0", "Overall": "5.0", "Content": "it was exactly what we were looking for!  it arrived quickly & in perfect condition.  couldn't have asked for a better experience with this type of purchase.", "Date": "December 28, 2010"}, {"Title": "Terrible Customer Service and not great product", "Author": "tafister", "ReviewID": "RV6WW8BVCZ3WC", "Overall": "1.0", "Content": "I bought this TV, and have had several problems with it. When there is any bass (like an explosion, music, etc.) the TV speakers vibrate and get very distorted, also the screen on the TV has splotches on it. Toshiba has done a TERRIBLE job of trying to fix it (first trying to just put tape on it to stop the vibration of the speakers which didn't work). But now it's at their shop and parts to fix the TV have been on back order for over a month and a half and the customer service from TOSHIBA has been absolutely TERRIBLE.Do not buy this TV, and I would not recommend buying any TOSHIBA TV because they WILL NOT back up their product. I'm still trying to settle my case with them with no luck and have been out of a TV for a month and a half!", "Date": "March 3, 2011"}, {"Title": "mixed feeling", "Author": "Oliver", "ReviewID": "RD368J736QUQ8", "Overall": "3.0", "Content": "The TV set is decent, especially considering the price I paid. For some reason, I am less impressed by whatever HD quality - maybe I set the expectation too high. One things that really disappoints me is the \"stand\" - if you are wall mounting, hey, lucky you. Like other reviewers mentioned, the stand is so plastic and cheap, it feels like it can break or fall down given a little bit push (not a remote possibility when you have small kid running around). For god's sake, a few buck more Toshiba could make a better stand and complete the picture.", "Date": "December 31, 2010"}, {"Title": "Buy it...", "Author": "Erin D. Murphy \"Erin\"", "ReviewID": "R250NOOBC20GYP", "Overall": "5.0", "Content": "unbelievable, I did my shopping and price cant be beat for these features.  3D is amazing.  Its super slim, lots of features some I will never use.", "Date": "November 27, 2013"}, {"Title": "After two of these failed TVs, I went with a Samsung!", "Author": "MightyMek", "ReviewID": "R19U84XBWQ7Y69", "Overall": "1.0", "Content": "So my wife and I were looking for a new, larger TV.  We didn't have a ton of money to spend, so we were looking to get the most bang for our buck.  After comparing a bunch of TV specs online, we decided to go with either this Toshiba or the equivalent Sony Bravia.  Both looked great, and the Bravia was only $75 more in a local store, but with Amazon's great price, free shipping, and no tax, the Toshiba ultimately won in the end.  We get the TV delivered to us, set it up, and were in large-screen heaven...for a few minutes.  The picture started doing some very fast screen flicker.  I thought maybe it was my cable box or something, but it happened on every input (xbox 360, playstation 3, DVD player, etc).  It would only get corrected by turning the unit off, then on again. We decided to contact Toshiba to see if it just needed a firmware upgrade.  They said based on my description it did not, but there was an internal issue with the TV and I should take it to a repair center.  Since it was only a day old, I decided to exchange it with Amazon for another one.  I was not getting a brand new tv repaired.After about a week, our second new Toshiba arrived.  We set it up and all seemed good.  Until about a week later when our screen started flickering again.  This time, turning it off and then on didn't help.  It just wouldn't stop flickering.  It was extremely annoying and wasn't something we could just deal with, not with a brand new TV.  So we called Amazon for yet another return, and bought a Samsung instead.  We've had the Samsung for over a month now and it really is a dream.  It was only $75 more on Amazon, has more features, much better sound and picture, and best of all the screen doesn't flicker.  So the Toshiba was a great price for the options it came with, if the TV actually worked properly.  So if you want a great priced TV that gives you a headache and vision problems, then go with this piece of junk.", "Date": "January 1, 2011"}, {"Title": "WOW AGAIN!! TOSHIBA 46G300U -WOW!!! I AM DUPLICATING MY RATINGS!", "Author": "HAPPYWOLF \"DISCOJAB\"", "ReviewID": "R1N9PZE7OSFB49", "Overall": "5.0", "Content": "**********STARS!! I AM ADDING TO MY ORIGINAL REVIEW - IT'S BEEN A LITLE OVER A MONTH SINCE I RECEIVED MY NEW TOSHIBA LCD HDTV AND I JUST CAN'T GET OVER THE THRILL OF HOW MUCH ENJOYMENT I HAVE EXPERIENCED SO FAR FROM WATCHING THIS TRULY AMAZING WIDESCREEN TV SET. SURE THERE MAYBE MORE EXPENSIVE SETS IN THE MARKET BUT FOR ANY FIRST TIME LCD HDTV OWNER LIKE MYSELF, THE PRICE & 24 MONTH FINANCING FROM AMAZON FOR QUALIFYING PURCHASES CAN NOT BE BEAT. I STRONGLY RECOMMEND ANY BUYER TO GIVE AMAZON.COM & THIS TOSHIBA HDTV A SERIOUS CONSIDERATION. I AM TRULY HAPPY WITH THE INVESTMENT!!- I JUST RECEIVED MY NEW TOSHIBA 46G300U 46\" LCD HDTV FROM AMAZON.COM AND I JUST CAN'T GET OVER HOW BEAUTIFUL THIS NEW SET IS! IT WAS DELIVERED RIGHT INTO MY LIVING ROOM, I COULD NOT WAIT TO OPEN THE BOX! SO EASY TO INSTALL & HOOK-UP TO MY TOSHIBA SRB2500 BLU-RAY PLAYER WITH HDMI CABLE & TO MY 7.1 HOME TEATHER SYSTEM. SO I NAVIGATED THROUGH THE ON-SCREEN SETTING MENUS TO SET EVERYTHING TO MY PREFERENCES. IN A COUPLE OF HOURS I WAS SITTING DOWN WATCHING MY FAVORITE BLU-RAY & DVD MOVIES! SOUND=EXCELLENT (I LIKE DEEP BASS! PICTURE=EXCELLENT! THE SCREEN DEFINITION SO SHARP THERE'S VIRTUALY NO BLURR & THE COLORS SO RICH! THE DESIGN SO SLIM & EASY TO HANDLE! I SPENT MY WHOLE WEEKEND WATCHING TV & REVISITING MY MOVIE COLLECTION ONE BY ONE! I CAN'T GET OVER HOW AWESOME THIS SET IS! ALSO GREAT PRICE FROM AMAZON & FAST FREE DELIVERY! I LOVE THIS TV SET! WITH GOOD CARE THIS INVESTMENT SHOULD LAST A LONG TIME OF ENTERTAINMENT! WOW!!!Toshiba 46G300U 46-Inch 1080p 120 Hz LCD HDTV (Black Gloss)", "Date": "October 11, 2010"}, {"Title": "Toshiba-Poor picture & sound", "Author": "Nosomuch", "ReviewID": "R1QJP6VWI8J00B", "Overall": "2.0", "Content": "This product is going back.  After spending two weeks trying to get a good picture this one is going back.  Know I know why this set was priced so low. People keep asking why is the color off?  Tried different setting for the picture, different sizes for the screen. And when watching sports you'll wonder if this is really a 120Hz set.  Looks best when it is turned off.", "Date": "January 17, 2011"}, {"Title": "DON'T WASTE YOUR MONEY", "Author": "Terry Wellington \"Rivermann\"", "ReviewID": "R1H2HCDS9OS2MY", "Overall": "1.0", "Content": "Bought this TV on other reviews and price. BIG MISTAKE. It took 2 weeks to get here and then the remote was dead. I called Toshiba Jan. 10. I am still waiting for a new remote. So I decided to get a replacement. It took another  11 days to arrive only after 6 calls to Amazon and the worthless delivery company [GLEN ELLYN STORAGE]. Guess what this did not work either and the doufus from the delivery company had no paperwork for the return. I  now have 2 of these pieces of junk and I am waiting to return them. I will be purchasing a Samsung from Best Buy next week who by the way has better price than Amazon.", "Date": "February 1, 2011"}, {"Title": "Piece of **** broke after 2 hrs of use...", "Author": "tomjonesrocks", "ReviewID": "R2G672LN3HR6TR", "Overall": "1.0", "Content": "Amazon had this TV at a pretty good price--at least briefly--and I jumped all over it needing a nice new 46\" for the living room in our new house.  We were doing a really big remodel on the place so though I plugged it in to test it for a few minutes it didn't get any real use until 6 weeks after I got it from amazon.  As I was in the middle of watching some NFL preseason on the TV--after about 2 hours total time on the unit--it switches off and starts making a buzzing sound.  No lights--no nothing.At this point it was too late to return to Amazon so I call Toshiba up.  As the unit is still at this point under warranty they send a local TV repair place over to my house to haul it away and I get a week estimate to fix it.  I have no idea at this point what's wrong with the TV--but this is clearly the worst TV buying experience I've ever had already so the TV gets a one-star review.  Even after they fix it--what kind of reliability can I expect out of the unit?Also in the 2 hours it worked I discovered the sound on the TV sucked pretty bad.  That might be fine if you're already planning on going with a home theater or soundbar--but if you weren't previously going to complicate your setup with speakers that's another reason to pass on this TV--with this one you will have no choice to make an investment in sound equipment.There's so many TVs out there...just do yourself a favor and forget about this one.", "Date": "August 31, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "46-inch LCD HDTV with Full 1080p HD resolution; ClearFrame 120Hz screen refresh rate for minimizing motion blur in sports and action movies\nDynaLight backlight control adjusts for deeper black levels for higher dynamic contrast and more realistic picture\nPhoto Frame capability for showing off your digital photo slideshows; USB connection for playing MP3 digital audio\nInputs: 4 HDMI, 1 component, 2 composite, 1 PC, 1 USB, 1 Ethernet, 1 optical digital audio output\nIncludes removable stand; measures 44.28 x 30.18 x 13.65 inches with stand", "Name": "Toshiba 46G300U 46-Inch 1080p 120 Hz LCD HDTV (Black Gloss)", "ImgURL": "http://ecx.images-amazon.com/images/I/51PsDBkJ3cL._SY300_.jpg", "ProductID": "B0038JED8K"}}