{"Reviews": [{"Title": "65 inch pan VT25", "Author": "DD2", "ReviewID": "R2DD04YKJ63F8V", "Overall": "5.0", "Content": "The key to selecting tv  is asking what you want this tv for. LCD tv's are lighter, use less energy, costs have come way down, no screen burn in to worry about. However, Plasma tv's are still cheaper, have greater viewing angles, and produce vastly better picture quality. LCD's have come a long way, but they can not reproduce the deep, rich blacks of a plasma.  LCD tv's produce pictures that are bright, crisp, and sharp.  Most often, you'll find LCD's displaying animated films in store demo mode. The reason is b/c animated films are supposed to be sharp and creased and bright, and are good matches for LCD's. I like films, and plasma's do a much better job displaying them. So, why should you buy this model, and not a lower model? What are the main differences? Well, this model is capable of displaying 1080P 24fps(frames per second) at 24hz(the refresh rate of the pic). What this means, is that it is a perfect match for Blu-ray. Most films are shot in 24fps 24hz. If the tv can't display that, it must Change the signal to it's natural resolution to display the film.  Regular tv doesn't run at 1080P 24 fps, only Blu-Ray films. So, this tv is for serious movie buffs only who will be playing plenty of Blu-Ray films. If you only want to watch tv, or dvd, you can easily get a lower model, such as the V10. And also 3d is great and i feel better then other 2 tvs i check out which were sammy 8000 and sony.Right know Tv is down to 3900 with bundle that includes 2-3 pair of glasses 2 movies and bluray player great deal thanks 6th ave ele. Hopefully this tv will last me at least 7yrs. But once again the best tv out for under 4500 hands down.", "Date": "September 15, 2010"}, {"Title": "Look no further for the best home viewing experience available in 2010", "Author": "Shakumdown", "ReviewID": "R2RVHOJ6PRMH80", "Overall": "5.0", "Content": "I recently experienced a household loss of our family's 50 inch HDTV we have used for the past 5 years.  Our LG 50PX4DR-H was struck by lighting and was put to rest.  I paid a hefty price for the LG back 5 years ago and wanted the best features and viewing experience I could get for a reasonable price. Before that, we had the Toshiba widescreen TW20F40 which was a great TV for it's time.  My latest quest lead me to the Panasonic TC-P65VT25 which had the best viewing performance I could find.  I reviewed the latest high-end models with LCD, LED and Plasma technology from Samsung, Sony, Toshiba, LG, Vizo and Hitachi, nothing but the plasmas were able to effectively display high speed motion without blurring.  All has the latest features with widgets and some had a better implementation than others.  Many had better physical dimensions with thin panels and beautiful frames, but I typically do not view content on TVs from the side or outside of the viewing area.  I chose the Panasonic TC-P65VT25 for it's ability to display vibrant images and effective implementation of web-based accessible content...  I was not concern with the 3D functionality, since I have a defect in my right eye which limits my site to peripheral vision.  I did not expect that I could enjoy the technology since shutter glasses require viewing the content with both eyes where two images are displayed, one for the right and one for the left.  As it turns out and to my surprise, I am able to enjoy the 3D content, just not as well as my family....Well, the whole intent to submit my review is that the Panasonic TC-P65VT25 was priced to be close to $5K, but went to one of the local electronics retailers who worked a deal with I got it for $2.6K which was a good deal.  I had to wait a week, since these TVs were selling like crazy.  If you want the best viewing experience with quality design, you can not go wrong with the Panasonic.  It's a great HDTV and with a viewing area of 65 inches, your engulfed in a viewing experience that is so close to theater viewing as it comes, but from a much improved visual perspective.  Check it out for yourself and you'll see....", "Date": "November 12, 2010"}, {"Title": "Picture quality is startling!", "Author": "iconkatz", "ReviewID": "R397U14J245K58", "Overall": "5.0", "Content": "Picture quality the best I have ever seen (including Pioneer). Black levels are incredible; deep, rich, beautiful colors; picture is completely noise free. 3-D works well, but not much content available.We've had our TC-PC65VT25 for 4 months. The \"U2 at the Rose Bowl\" concert Blu-Ray really shows off the black levels and overall video quality. We use the VT25 as a video monitor; audio is through a DTS-HD Master capable surround sound system (Onkyo TX-SR707 receiver, bi-amped PSB Image speaker system). The combined effect of the perfect picture and concert quality sound is amazing. With DirecTV, the HD picture is great - so much better than the old Panasonic plasma we replaced. We find ourselves watching bad movies just because they look so good!3-D picture quality is good, but the content is limited and the 3-D picture doesn't excite me as much as the 2-D performance. 3-D didn't add much to World Cup matches, but college football in 3-D is more compelling than the soccer.", "Date": "October 1, 2010"}, {"Title": "Killer deal  At Video Only, Panasonic 65'' 3D", "Author": "Gingerdanger \"Gingerdanger\"", "ReviewID": "R4SMQM2GH614M", "Overall": "5.0", "Content": "Right now at Video Only You can get this TV with A Panasonic 3D blu-ray player, two extra sets of 3D glasses, Avatar in 3D (Panasonic exclusive) AND they paid the tax on the deal, so the whole package was $3,200 !! Only thing is we have to wait 10 to 14 of the longest days of our lives till they get some in stock. Hurry cause this will be their last shipment of this 2010 model till the new 2011's come out in April. Talk to Brian at South Center!We love you Brian!", "Date": "December 3, 2010"}, {"Title": "Amazing picture quality on 3D HDTV", "Author": "PyrPaw", "ReviewID": "R284DPMWK7I33H", "Overall": "5.0", "Content": "The Panasonic TC-P65VT25 is an amazing product.  The ability to reproduce high definition 1080p images and action sequences is excellent.  Blu-ray movies such as The Dark Knight, The International, and the BBC series Life have incredible clarity and realism on this TV.  Motion and aliasing artifacts are very infrequent on blu-ray, DVDs, or HDTV.  The product rivals the Kuro line by Pioneer.  I spent months looking at LCD and Plasma TVs before settling on the Panasonic P65VT25.  I was an early adopter and have not been disappointed.  The TV is excellent for viewing 2D content in HD, or 3D content on blu-ray.As background, I have the system set up with a home theater PC.  I do not use the available Viera Cast applications much since my computer is networked and I can run Netflix and Media Center applications directly from the PC. However, the Viera Cast applications work well and are predictable.  For those who are interested in exploring the benefits of a home theater PC, the viewing of 3D video requires some home work.  You should purchase a blu-ray player with at least 4X speed or higher in one of the PC disk drive bays.  I am using a gaming system PC with a nVidia GTX460 video card with HMDI output and Cyberlink PowerDVD 10 Mark II to handle the video requirements of 3D blu-ray video.  It can also take some work to get the drivers working, but currently the latest drivers as of this review include the nVidia 3D TV play software required to handled the 3D video signal and automatically sync with the 3D glasses.  The system includes a rebate for Ice Age: Dawn of the Dinosaurs and Coraline to demonstrate the 3D function.  Additionally, the system setup required me to set the display to option 2 under settings in order to avoid cropping of the signal sent from the computer video card.  I have also viewed the Avatar trailer in 3D on the system and it is comparable to the movie theater experience.Alternatively, you can purchase a Blu-ray 3D player by Panasonic for viewing 3D Blu-rays and completely bypass the technical aspects required with a home theater PC.The only minor issues I had were mounting of the TV to the wall and the comfort of the glasses.  The glasses are bulky and not very comfortable.  They are too large for kids, and even some adults.  The image quality is fine, but the comfort is not so great.  (I also do not like the Samsung glasses much better).  I have purchased Xpand Universal X103 3D Glasses from Amazon for 3D viewing on the TV and they work great for adults and kids.  As for the mounting, the TV weighs over 100 lbs.  I purchased a universal mounting bracket for a TV of this size, but the power cord is too close to where the mounting bracket sits on the back.  This limited my ability to center the TV on the wall and is off-center by a couple inches.  Perhaps if I had purchased the Panasonic mounting bracket this issue would not have occurred.  You will of course want to install the mounting supports into studs.  I would not recommend mounting to a concrete wall with concrete screws or mounting to drywall unless the studs are located with a stud finder.Recently, Panasonic is offering a rebate for Avatar 3D blu-ray.Picture Quality: 5/5Customization: 5/5Contrast: 5/5Mounting: 3/5Glasses Comfort: 3/5Manufacturer Website:[...]", "Date": "December 5, 2010"}, {"Title": "Amazing TV", "Author": "Jeff Ronan \"RonanFibers\"", "ReviewID": "RQ1THOA9GBMO3", "Overall": "5.0", "Content": "I got my 65\" VT25 on December 22 and it ran for about 35 minutes and died at 10:30 AM. I had it on a UPS with a Powerline conditioner but with the Yamaha RXA-1000 amp the service waatage of the UPS was exceeded. We had a big storm with lots of voltage fluctions and spikes. So bad news. Good news after failing to get make any progress with the Best Buy folks I turned to the Panasonic Concierge service and got a referral to an authorized service tech at about 1:30 PM. They sent a guy out at 3:30 PM they showed up and diagnosed the problem as a shorted board and left advising they would need to order parts. I called them first thing the next day to get a status on the parts availability and they didn't know. I called Panasonic with my case number and they were able to see that parts had been ordered and then checked the status and the parts had already shipped and would arrive at the servicer's office that day. I called them back and they committed to installing the parts that day which they did. Total down time less than 27 hours. Pretty amazing. But the TV is just off the charts. Had some friends over for the BCS championship game in 3D on ESPN and comments were things like, messmerizing, surreal, incredible, unbelievable and I hate you. As I explore HD content on direct TV I find myself watching shows I might have ignored before because the picture is soooo great. I got mine with the 3D starter kit and Avatar 3D (haven't watched it yet) and two pair of glasses. The starter kit glasses are the 2nd generation. the TV included a pair of 1st gen glasses. The 2nd gen are better. They are more comfortable to wear have a slider on/off switch instead of a button and are rechargeable via a USB connection. I added a Monster HDP 2500 High Def power center and it has two USB charger ports on the front which makes a great way to recharge the glasses. My TV room is about 20' by 20' with 4' by 10' windows on each side with no drapes of any kind and I have not had any issues with glare. settling in to watch TV is almost like going somewhere.", "Date": "January 12, 2011"}, {"Title": "AWESOME , HANDS DOWN BEST TV OF THE YEAR!!", "Author": "Luke311 \"Luke311\"", "ReviewID": "R1FEUUN57A22OU", "Overall": "5.0", "Content": "This is the flagship of the Panasonic line. The 3d is amazing and the 2D is the best picture of any tv out there. Hands down best TV made right now. Even 2D looks like it has a 3D feel to it. I owned a 2 year old panasonic plasma 58 inch and upgraded to this. I loved the old panny but this one is worlds better and in just over a 2 year technology span. If you are looking for the best 3D & 2D experience hands down look no futher. The price justifies the quality. you get what you pay for.", "Date": "December 2, 2010"}, {"Title": "Awesome!!! But Wait It's discontinued?", "Author": "Tex", "ReviewID": "R162CEVLIRDF5V", "Overall": "5.0", "Content": "I think I just bought the last Panasonic TCP65VT25 TV in North America. I was one of very first adopters to the Plasma technology and Flat screen TVs nearly 10+ years ago. I had owned my panasonic 50\" HD Plasma for 8 years before upgrading to the 3D. Panasonic/Pioneer is by far the best Mfg. of plasma TV. Had the new one installed yesterday. Wathed the SuperBowl on it. The results were amazing. The TV is great. The 3D is amazing. Not sure why Panasonic has discontinued this model? Also, I have heard about No-Glasses 3D TVs coming out in the near future. Could be a couple of years away though. I would highly recommend this TV to seriously TV lovers. Priced on the high-end for the causal user. Cheers.", "Date": "February 7, 2011"}, {"Title": "No question about it.  Buy it!", "Author": "M. Vermette", "ReviewID": "R39TT0OG31MNMO", "Overall": "5.0", "Content": "Fantastic picture quality, 3D is exceptional, blacks are phenomenal, no anoying buzzing (typical with Samsung).  Have yet to get calibrated but can the picture really get any better I wonder?  I will update after calibration in February 2011 to let you know but I don't see how the picture quality can get any better than this.  Over the last four years I have had in my living room (all 1080p, HDMI 1.3) a 52\" Mitsubishi DLP, 52\" Sony LCD 60hz, 50\" Panasonic Kuro Plasma, 65\" Panasonic V10 and this is by FAR the best I have ever seen in my home, a friend or family members home or on display at a store.  The only thing that comes close (but still think the VT25 is better) is my Dad's 60\" Pioneer Elite Pro 141fd.  The only thing I do not care for is how Panasonic glasses only work with Panasonic TV's (same as any manufacturer) but get the Xpand 103 universal glasses to solve this (work great and can take to another home and use on any 3D TV out there for less).  Running Playstaion 3 right now for 3D but just picked up Panasonic BMP-BDP100 for my 3D Blu Ray disc needs to take full advantage of lossless audio and from what I have heard better 3D experience than PS3.  Nothing wrong with the 3D from the PS3 but I am a nut about picture and sound quality and thought it was the best move.  Hope you pick up the Panny you won't regret it!", "Date": "January 4, 2011"}, {"Title": "Everything I expected from a 3D TV solution", "Author": "Lance Saleme", "ReviewID": "RLHZFLNHP9UFP", "Overall": "5.0", "Content": "After considerable research I focused in on the shutter-based 3D solution.  The result was extremely satisfying, matching the other reviews and reports from similar customers.  The fixed polarized solutions fail with any head tilt or angle of viewing outside the sweet spot.  The TV arrived in perfect condition, functioned as advertised, and has a wonderful bright, crisp, and balanced picture.  The supplier was prompt, careful in shipping and offered an excellent price.  The TV was part of a combined purchase with the Panasonic TY-EW3D10U 3D Active Shutter glasses and the Panasonic DMP-BDT350 3D Blu-ray player.  All the purchases work together as expected and have met all expectations.", "Date": "December 30, 2010"}, {"Title": "Worth every penny !!!", "Author": "Jacob J. Kniefel", "ReviewID": "R3TSSOTLH0MYRU", "Overall": "5.0", "Content": "I was in the market for a tv and wanted this 65 incher but for my room size i got the 58\"  TC-P58VT25. this tv is so amazing, at first i was sceptical if i wanted a plasma cause a few years ago i know they had a burning problem, but when i told that to my guy at ultamate electrics he agreed and said yes they did but now panasonic has an anti burn feture witch pixels move on screen so they never burn.(you never see it happen). i have had the tv for 3 months now and i have used it for dish tv, computer monitor, watching blue rays, and playing ps3, and its all awsome. Dont worry about burning with this tv, its got an auto off feture that turns off the tv after so long...  my guy at ultamate says you can leave this tv on one picture for ten hrs and when you change it, it will have no ghosting, no burning, no nothing... buy any size of the PV25 series and you'll love it...", "Date": "January 3, 2011"}, {"Title": "Very nice TV", "Author": "John Sweney", "ReviewID": "R1HFSHRXCPEJL4", "Overall": "5.0", "Content": "I'll keep this short:PROS  1) Great vivid picture.  Fast refresh for basketball, etc.  2) Very wide viewing angles.  3) 3D works remarkably well, although is (obviously) dependendent  on great 3D rendering by producers.  4) Extra connections to YouTube, Netflix, etc. are handy.  Home  network hookup was simple.  5) We use external sound, so cannot comment on the sound.CONS  1) Gives off lots of heat.  2) Benefits from [expensive] third-party technician adjustments,  but that's true of most of these TVs out of the box.  3) 3D glasses are fairly fragile [and expensive to replace].", "Date": "November 15, 2011"}], "ProductInfo": {"Price": "$3,199.99", "Features": "One Pair of 3D Eyewear Included\nFULL HD 3D - Full HD 3D puts you inside the action and creates a new world of TV viewing realism\nVIERA CAST WIFI With SKYPE Capabilities - Enjoy great Web entertainment and cutting-edge communication on your HDTV\nINFINITE BLACK PRO PANEL with 5,000,000 - 1 NATIVE CONTRAST - New phosphor technology produces deep blacks and vivid images with minimal reflection\nTHX CERTIFIED DISPLAY - Experience true theater in your own home.", "Name": "Panasonic TC-P65VT25 65\" Class Viera VT25 Series Full HD 3D Ready Plasma HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41Nv-CCRHDL._SY300_.jpg", "ProductID": "B003N3BV90"}}