{"Reviews": [{"Title": "Very good TV for a super cheap price", "Author": "Mak", "ReviewID": "R3E6OP3JY9GFVP", "Overall": "5.0", "Content": "Bought this TV for $320 last week.  The very next day after I purchased it the price went up to $350, but today the price is at $300.  So I'm not sure why the price fluctuates so much but you may want to wait for the price to be at the lower end.  Well anyways I received the TV yesterday so the delivery was a little over a week for a NY to CA shipment.  So far I am very satisfied with the TV.  It looks very nice and in my opinion is nice enough to be a Living Room TV.  I use as a tv in my room mostly for movies and my Xbox 360.  I must say the 720p is sharp and like the other reviewer said this tv can go up to 1080p.  There are a ton of ports for everything HDMI, VGA, etc.  Oh also the sound from just the TV itself is solid.  One complaint I do have however is the power cable length as it is very short about 4 FT maybe.  The question with these cheaper brand TV's is always gonna be longevity and to that I can't speak to yet.  But as of right now I am very satisfied with the TV and highly recommmend it.", "Date": "July 23, 2010"}, {"Title": "Too big of a compromise", "Author": "A simple man", "ReviewID": "R6F04EFKZB3H5", "Overall": "1.0", "Content": "I just returned this and got an LG-32LD350 instead and couldn't be happier. Here's why:1. The tuner was really bad. This is critical for me as I don't use a cable or satellite box.  a. Took about two seconds to switch channels.  b. For the digital channels, it had a hard time with the HD channels. Kept getting pixilated and lost the picture completely for CBS.  c. For the analog channels, the picture was noisier than it was with my old CRT set.2. The lowest volume setting was too loud - could be heard in the other room3. The TV wouldn't always start. Don't know what the problem was, but in the week I had it, we had to disconnect and reconnect the power cord to the wall outlet in order to turn it on.Needless to say the LG doesn't suffer from any of these and my wife thinks the picture quality also improved, but its hard to be sure. Bottom line - there are much better alternatives for roughly the same price.", "Date": "December 9, 2010"}, {"Title": "Excellent for the price", "Author": "Rick", "ReviewID": "R2CTRF6DBP762A", "Overall": "4.0", "Content": "I just purchased this TV for under $300.00 and am very pleased with it. I only have 2 minor complaints. The first one is that the remote control refused to turn off the closed captions. I had to change the settings on the cable box to turn it off. The second complaint is that the HDMI cables that I purchased on ebay would not work with this TV. They work fine with my other 2 flat screen TV's but not this one. I had to buy another one of a different brand and then the TV worked fine.", "Date": "August 2, 2010"}, {"Title": "MAJOR problems", "Author": "Frank M", "ReviewID": "R33ZSGKRPM9CLI", "Overall": "1.0", "Content": "Purchased two of these, one for us and one for our son.  Hook up was simple with no problems.  The speakers were a bit tinny but adjusting the bass helped some. The picture was very good.  I was going to use it in office and it was perfect size. Both my wife and I thought for the price it was a good value.  It was on for the rest of day and evening but when turned on the next day the video came on for about 5 minutes and then went blank. We could not get to respond to anything. If turned off and back on it would last about 5 or 10 seconds and then go off. Only response I got from Colby C/S was to take it back.Before taking it back I decided to check out the other one purchased for our son.  It was WORST!  After about 5 minutes BOTH audio and video went out.  It would not come on using remote or manual controls.  So we ended taking both back.Maybe one could be a fluke, but two I believe indicates a major flaw with the TV'S.  When I took them back to Fry's I asked the person if they had many returns and he replied they did.  When I asked what seemed to be the problem he just said they \"didn't like them\".I purchased these largely on the positive responses here but it certainly did not turn out positive for us.", "Date": "May 7, 2011"}, {"Title": "Great Priice but had problems", "Author": "Roberts", "ReviewID": "R2HIDOKVT0K9B9", "Overall": "2.0", "Content": "I bought this TV for $267 new which is an exeptional price.  I connected it to a Blu-Ray player with internet apps and the picture was great.  I then began watching cable TV channels and noticed that some channels would blink on and off and had intermittent static.  Thinking that the problem was with the Cable TV company I called out a tech.  He tested the cable TV and then stated there was a problem with the tuner in my TV.  I told him that could not be true because my TV was brand new.  I then connected a different TV to the same Cable TV source and I could not replicate the same problem using a different TV.  I went to the COBY web site and found that the TV has a 90 day warranty.  You must pay shipping both to and from COBY.  COBY requires a $30 shipping fee up front.  My best estimate is that it would cost me another $60 and tons of aggrevation to get this TV repaired.  Go ahead and spend the extra bucks to purshase a more expensive set from a local store that provides sales/service.", "Date": "November 24, 2010"}, {"Title": "great price... lousy product", "Author": "C. W. Beck", "ReviewID": "ROF5TZZOTY39E", "Overall": "1.0", "Content": "the price on this widesreen TV was GREAT .... the picture quality when using the dvd player is fantastic... but as soon as you try to play your video games on it the quaity goes to crap. WARNING... if you like to play video games DO NOT purchase a colby TV. when you have any kind of a darker area to play... like a night scene, or a tunnel scene, as in syphon philter does quite often.. it is impossible to see no matter what kind of controls settings you put it in.it is so dark you might as well be blind. enven in the areas I was so familiar with. no matter what you do you are almost blind. I was so happy to get my first widescreen for the living room, and I play a lot of games on it when in the mood, but this purchase just made me mad as hell. do not purchase people, beware!!!!!!!", "Date": "December 9, 2010"}, {"Title": "Terrible sound and color....", "Author": "Mom2Boys", "ReviewID": "RVZTF1NQN3COV", "Overall": "1.0", "Content": "We purchased this TV before Christmas last year (2010).  At first the color was okay, but it quickly diminished and is very dark - even after adjusting the settings.  The sound quality has always been terrible.  Even when it is turned up, you hear some things, but it seems that the background noise (think music, soundtrack, whatever else is going on) is always louder than the actual speech and/or actor voices.  We are very disappointed with this purchase.  We will not buy Coby products again w/o first seeing/testing the product in-person.", "Date": "November 25, 2011"}, {"Title": "Sold like a 720p but actually does 1080p!", "Author": "Rambling Johnny \"John\"", "ReviewID": "R39AKWN76D6TFM", "Overall": "5.0", "Content": "This HDTV is a diamond in the rough. It does 1080p but it advertised and sold at the price of a 720p HDTV. 3 HDMI ports, 2 Component, 1 VGA, 1 S-Video, 2 RCA and 1 antenna in ATSC/NTSC so it DTV ready. I got my ps3, the sat and my desktop plug in this thing and I still have half the ports free for future use. You don't need to be a rocket scientist to figure out the remote and the menu hell I did not open the manual yet. It a great HDTV if you want a cheap and good size model in order to wait for the 3d models to come down to a reasonable price.", "Date": "July 18, 2010"}, {"Title": "Expected more", "Author": "lumberman67", "ReviewID": "RY4MBPHTVMZDY", "Overall": "2.0", "Content": "Purchased this item at a local store because of the great price ($249.99). Unit on display at store had great picture and couldn't pass the 32\" size and features up for the price. Got unit home and set it up without any trouble. Played a Blue-Ray movie on it with great picture. Cable picture was a bit grainy though. The biggest problem we had was that the sound was very tinny from the speakers and when set on the lowest levels was still as loud as if on a much higher setting. Blue power on light, even when shutdown was also very annoying and bright at night in bedroom. Returned this unit to store where purchased and am looking at a different brand and model.", "Date": "March 28, 2011"}, {"Title": "don't buy COBY TFTV3225 ... lousy picture", "Author": "VCTO", "ReviewID": "R36GUR1F74DE71", "Overall": "1.0", "Content": "Well, if you have any high expectation for your next image quality, don't try this COBY thing at all.That purchase was for an older relative and I thought the quality would be always \"good enough\", but frankly, I really have to return this unit.They offer with this set the worse dark and contrast management, there is absolutely no contrast in the dark shades.They completely turn off the pixels on darker shades, so blacks and greys become that black-hole black with absolutely no pixel information.So basically you are looking at only 1/2 of the movie frame, the side that is not black.COBY should be ashamed to sell this unit.Sorry, I came in fairly open-minded about this first-price, but you are better off spending $100 more and enjoy a Korean or Japanese set a lot more.", "Date": "August 13, 2011"}, {"Title": "Great TV for an GREAT price!", "Author": "Stephanie Bledsoe", "ReviewID": "R1SSHGGXZZ935V", "Overall": "5.0", "Content": "I got this TV because I was looking for a flat screen for our bedroom so I didn't want to buy the most expensive, \"best on the market\" for that room but I did of course want a good TV that had good picture and sound and will hopefully last me a few years.  I searched around a LOT and many of the TV's selling this holiday season (in this size/price range) had mediocre to bad reviews on sound, picture quality, life span, etc so I was starting to think I would have to go up a level in price.  However then I saw this Coby.  The reviews were good not only on Amazon site but elsewhere as well.  So I got it (only $300) and I couldn't be happier.  The picture and sound are great, easy to set up and very easy to use.  It's very nice looking as well (doesn't look cheap) and we have been loving it.  Would definitely recommend to anyone looking for just a great TV (without needing all the extra special bells and whistles) to get this TV.", "Date": "January 10, 2011"}, {"Title": "EASY PEASY", "Author": "jimmythesafe", "ReviewID": "RURFDADWQX1O5", "Overall": "4.0", "Content": "This was my first exposure to HDTV and it was nearly painless. I saw the unit in action at a local restaurant and I was impressed enough with the picture clarity and sharpness to inquire about it. On their recommendation, I bought the unit and had it delivered. It was easy to set up initially and just as easy to convert from my standard cable to a High Definition cable box.I'm as impressed with the picture (and sound) quality of the unit in my bedroom as I was in the restaurant. My only gripe is that there's no headphone jack to accomodate quiet viewing when I want to watch late night shows while my wife sleeps (or vice versa). I'm still hoping to find a way to accomplish that.The Amazon price was right and the delivery was timely. I'm not an avid TV viewer, not a gamer or a DVD/movie buff, so 720P was fine for this first Widescreen acquisition. For watching sports, specials and my favorite Cable TV series, I'm quite satisfied with my purchase.", "Date": "January 1, 2011"}, {"Title": "no longer a cheaper brand  phobic.", "Author": "amerindo", "ReviewID": "RP0P9JUM0KP3J", "Overall": "5.0", "Content": "Bought this morning at TOYS R Us for $249.99. Great deal, sharp picture! Not disapponted.!Coby TFTV3225 32-Inch Widescreen TFT LCD 720p HDTV with HDMI Input (Black)", "Date": "November 26, 2010"}, {"Title": "Neadley", "Author": "N. R. Eardley", "ReviewID": "RG0OS2ZV3NOXW", "Overall": "5.0", "Content": "We purchased this TV for our lanai and couldn't be more pleased.  Too much light is a huge issue and after researching on Google, we found a matte finish on the screen was the best solution, short of buying a $2,500 Sun Brite TV.  1 p.m. on a Sunday afternoon with the sun blazing, we were able to watch football from the pool with little to no reflection hindering our viewing pleasure!  :)", "Date": "November 10, 2010"}, {"Title": "DO NOT BUY THIS TV", "Author": "Erica", "ReviewID": "R31U3IV7S7LBWI", "Overall": "1.0", "Content": "I purchased a TV in November and have had to call Coby 4 times already. After a few months the TV WILL STOP WORKING trust me. The blue light still comes on but no picture or sound. I've read on other websites that people are having the same problem as me. Coby said they will ONLY cover the labor for 90 days. After the 90 days (still within the year warranty) Coby will only take care of parts, so you will have to take it to a repair shop for them to do the labor. When I went to the repair shop the man told me that the labor will be more than what I paid for the TV. He told me that I should complain to Coby and try to get them to send me a new TV. After I complained to Coby about the labor being more than the TV they sent me an email to send it back. In the email I learned that I have to pay to ship it to them and also send a $30 money order with it so I can get it back. PLEASE PLEASE PLEASE DON'T BUY THIS TV. I will be writing to Coby and may even contact the news because the TV should be recalled. I've already informed Amazon that they need to think twice about selling it to their customers.", "Date": "June 26, 2013"}, {"Title": "Have so much problems turning it on or off at times", "Author": "Pete", "ReviewID": "R1M51EOJXYMYLF", "Overall": "1.0", "Content": "Purchase this 6 mths ago and frustrated that it couldnt even last a year or 2 without breaking down. Was a good deal I thought under it started taking 5 to 10 minutes to shut off, at times have to just unplug it. Had tough time just trying to turn it on at times til now it wont turn back on at all.Dont Buy this product!", "Date": "May 20, 2013"}, {"Title": "Valueless warranty for COBY TV", "Author": "Glenda", "ReviewID": "R32FLYEQ35L0B1", "Overall": "1.0", "Content": "The picture was OK. The audio was the worst that I ever heard from any TV or radio. The set failed at the end of the warranty period. And that is when I discovered the Coby warranty was worthless. I would have to pay for the shipping both ways, and then for parts. By that time, I would have spent as much money as it would cost to buy another TV. I will never buy a COBY product again.", "Date": "February 6, 2013"}, {"Title": "Junk", "Author": "sherman", "ReviewID": "R174D8D963JHIA", "Overall": "1.0", "Content": "Bought this TV and the Volumn button stopped working on the remote so I purchased 3 remotes from Coby and NONE worked. So I went to the side of the TV where the buttons were located. None of thoses worked.Good luck to all!!", "Date": "January 10, 2012"}, {"Title": "Great Picture Crapola Audio", "Author": "Norfolk_Enchants", "ReviewID": "R2WEU0VVLVDFMZ", "Overall": "3.0", "Content": "As most reviews, we found the price great and the picture quality excellent. However, must have speakers set at 100 (max) to be able to hear anything. The sound is beyond poor, that is why I'm on Amazon...looking for compatible speakers, and it doesn't look as if there are any!", "Date": "August 25, 2011"}, {"Title": "Coby 32'' 720P LCD TV", "Author": "John E", "ReviewID": "R3C6L25M93JVOA", "Overall": "4.0", "Content": "I've been wanting to upgrade to an hdtv for a few years now but I was afraid to go cheap..  but I ordered this tv anyway and it was a good decision.The picture on this thing blew my mind, it is absolutely excellent. It looks just as good as any other 32 inch LCD televisions on the market in my opinion.The other thing that surprised me was that it actually supports 1080p, I put Gran Turismo 5 in my ps3 and was playing it in full 1080p literally 5 minutes after I pulled this thing out of the box and it looked fantastic.The sound is horrible but that was expected, I will get a decent sound bar at some point in the near future and take care of that but overall this is pure quality.Do not doubt this tv, its worth it.", "Date": "March 29, 2011"}, {"Title": "recommend this TV", "Author": "ken", "ReviewID": "R3QYE7BWXX9G8S", "Overall": "5.0", "Content": "I did purchase a 32\" from Best Buy and it failed on quality, picture and sound  so I returned it and then purchased this Coby. Installed easy to Dish, sound and picture are perfect Recommend this product. Plus no sales tax and free shipping.", "Date": "February 11, 2011"}, {"Title": "Great purchase for my needs", "Author": "Tita", "ReviewID": "R1TJBUYZQOBVUY", "Overall": "5.0", "Content": "I'm not a technology person so please keep that in mind when reading my review. I bought this for my outdoor patio after reading another review where the owner was buying one for the same area. The problem is, I installed the TV in my bedroom and I'm so happy with it there that I now need to buy another one for the outdoor patio! The color is vibrant and the picture is crystal clear. The sound is a little tinny but I'm told I can buy speakers to improve that. All in all, I'm very happy with this TV and I'll probably buy another one.", "Date": "January 9, 2011"}, {"Title": "Great LCD TV that works well for me!", "Author": "Hachioji Tex", "ReviewID": "R3GAE7BFSAEHHF", "Overall": "5.0", "Content": "A lot has been said about this Coby TV, including about it not being the best TV for its price, but I have not had any problems with it. I purchased it around November 2010, and have had it for two months now. Well, this Coby LCD has been giving me nothing, but pure joy. The one thing I will say about this TV is that it is more of a TV for gaming and watching files, dvds and blue-rays off a computer or a blu-ray player. For gaming, I have a Xbox 360 and PS2 hooked up to it. For just viewing videos and pictures I have a computer and a dvd player. Some people have said that the TV was too dark of a screen for gaming, but most games have an option that lets you control brightness, so it's not the TV, but just your gaming system. I have not hooked it up to an antenna, dish or cable, so I can't tell anyone on how it works with any of those connections. I do like that it has three HDMI connections, which made this the TV to get.The remote itself does what it's intended to, but you can get a universal one, if you feel that you need something better. For one thing, don't expect this TV to be like your other top of line LCD TVs out there. You can control brightness, contrast and such, but not on game systems, because they control a lot of that for you. Does the TV do 1080p, it does on my Xbox 360, but I don't know about a blu-ray player. Last, heard some people saying that a PS2 doesn't work on it, but mine does, without any problems.", "Date": "January 6, 2011"}, {"Title": "Great Value", "Author": "Al Gravy \"Al\"", "ReviewID": "R3BTD4NBO9EI0E", "Overall": "5.0", "Content": "It has only been a few days since getting my Coby TV but so far so good. I got it for a bedroom and don't have an HD converter box but it is hooked up to coaxil cable. The picture is great without HD. I expected the picture to be stretched or cut but it's auto settings set the best view for each channel. I'm gonna save a few $ and not get the HD box, the picture is that good.The price was also great. It was marked \"Amazon Prime\" which gave me free shipping and 2 day delivery. I think I may buy a few more as gifts.", "Date": "November 11, 2010"}, {"Title": "Coby tv promblems", "Author": "Audley Brown", "ReviewID": "R1GBM1QC67028V", "Overall": "2.0", "Content": "I caint turn off the closed caption on my Coby tv this is very annoying. I recommended this product to a friend and her did the same thing she sold it a 2 weeks later", "Date": "May 24, 2013"}, {"Title": "Don't buy for bedroom", "Author": "K. Reichert", "ReviewID": "R2MOARPHZN5M68", "Overall": "2.0", "Content": "Let's face it. You buy this TV because you can't afford a better one. I think the reason it's so cheap is that it's the only way they can sell it.1--- The only redeaming quality is the picture. It's good most of the time. It does flicker now and then when changing (cable) channels.2--- The sound quality is atrocious. There is absoulutely no mid or low range and there is no audio out connection. So you can't connect it to surround sound.3--- The connections are really difficult to get to. They point down and are flat against the back. Even connecting HDMI was a chore trying to find the slot. You can't see it unless the TV is upside down. So you have to feel your way around it.4--- The HDMI connections are sensitive. Wiggle the cables and you'll lose the signal. Don't use the rotating stand of the TV (one of the cool qualities) or you'll lose the signal.5--- THAT FREAKING BLUE LIGHT!!! You can turn it off when the TV is on but when the TV is off, it comes back on. At night, in bed, it lights up the whole room. I'm not exagerating. Do a Google search for Coby TV Blue Light and you'll find other annoyed owners with the same issue. They say there's a fix. It's not true. At least not for this model. You can cover it up (with tape) but then guess what? The remote won't work. Do not buy this TV for the bedroom.Negative, I know. But honest, too. Looking back, I should have bought a better (smaller) TV than this one. Don't make my mistake.", "Date": "May 5, 2013"}, {"Title": "You get what you pay for", "Author": "K Town", "ReviewID": "R3OLBSJGXYMU1Z", "Overall": "2.0", "Content": "I bought this because there was a great deal on it and many retailers were pushing this TV on Black Friday.  I found out why, the tuner on the TV is horrible and cannot be fixed.  The only way to enjoy this TV is if you have a cable box or if you are watching a DVD.  Every channel is horrible because the channel looses its voice and acts like the cable connection is loose.  I had my cable company come to fix it, but they said they get a lot of complaints from their customers about this TV.  When I called Coby, they could care less.  They wanted me to dismount the TV and ship it to them because they wouldn't pay to have someone come check it out.  Coby obviously does not stand by their prodcuts and it's probably because they are a cheap knockoff of Sony, Phillips or Panasonic.  Spend a little extra money to get something that works with a brand name you can trust.", "Date": "December 7, 2012"}, {"Title": "Tv not working only have had for two months", "Author": "AlexisRoss", "ReviewID": "R2I6T7QTTH9HAG", "Overall": "1.0", "Content": "Can someone plz contact me.  I have had the tv for 2 months and now it is not working at all.  It made a loud buzzing noise and then would not shut off by remote or actual tv on/off button.  I had to unplug it to get the noise to stop.  After I plugged it back in it will not come on.", "Date": "November 6, 2012"}, {"Title": "Buyer Beware!", "Author": "Mark S. Jenks \"Wizard\"", "ReviewID": "R2K56HBPETCF87", "Overall": "4.0", "Content": "I purchased this TV at a local Supermarket (Shoprite) in August 2012 for $199.99 plus tax.  The first one would not turn on, either by remote or manually.  So I exchanged it for the same thing.  This one turns on when it feels like it, often I have to unplug it and plug it back in, to get the switch or remote to work.  I sent an Email to Coby support, and the first email was answered right away.  But all they said was basically to return it to where I bought it or send it in.  Here is where you need to pay attention: Warranty states 90 days for labor, 1 year for parts.  TV's UP TO 32\" MUST BE SENT TO COBY IN GEORGIA, ON YOUR DIME EACH WAY.  TV's over 32\" in size  qualify for \"in home\" repair.  Shoprite has a 30 day return policy.  I then sent a 2nd email to Coby support, asking them if this was a common issue with this model.  They never bothered to reply.  The first one was missing the RCA cables that were supposed to be included.  The second one had the cables, but the all important thumb screw that mounts the stand to the TV was missing.  I found something in my workshop that worked.  Being used as a computer monitor, this set works pretty well.  I don't think a 32\" monitor can be found anywhere else for $200, so I took a gamble and kept it.  Even with a modest video card, my pc puts out a good picture with this TV. I'm using Windows 7 Pro x64 with an inexpensive Radeon HD 6450, the video card has 1GB of DDR3 and it's fanless.  It supports Direct X 11 and puts out 1080p.  I used a VGA x VGA cable at first, then sampled HDMI x HDMI.  After a little time tinkering between the tv settings and the video card software (Catalyst Control Center), the best picture quality is being obtained with a DVI to HDMI adaptor cable.  The fact that one could easily have a dual 32\" monitor setup for around $400 is interesting, but right now I don't have a need for dual monitors.  I don't play games.  I have my fingers crossed with regard to the on/off issue, that it doesn't get to a point where it won't come on at all.  Can't remark on the tuner or speakers, I don't use them, or have not tried yet.  But the 3 HDMI ports are handy, and the composite input could be useful.  CAVEAT EMPTOR!UPDATE: 11/11/12  We just went through Hurricane Sandy.  Our house is on high ground so we did not get flooded, but power and cable was out for a week or so. When it finally came on it was knocked out again by a snowstorm!  We used a small portable generator to run the refrigerator and this TV with an omnidirectional antenna.  It worked surprisingly well, picked up as many channels as the other TV would.  The ON/OFF situation hasn't worsened, it's just a little finicky.  You have to give it a few seconds to work, or try a few times.  Some times it comes on with the first try.  With so much damage to the power and phone and cable TV lines from the high winds, it seemed an awful long time to get power back. You couldn't really go anywhere, and even as the roads were being cleared of debris, it was nearly impossible to find gas.  This TV helped keep us from losing our minds.  The stations out of New York City (45.6 Miles away) all came in perfectly.  The news was all about the storm.  It was very sad to see how many people lost their homes.  We were fortunate not to have any significant damage to ours.  Atlantic City, near where the storm made landfall, is only 50.4 miles South from our home on the Manasquan River.  So I'm glad I kept the TV!", "Date": "October 20, 2012"}, {"Title": "Try not to run in 1080p...", "Author": "S. Mann \"Seth\"", "ReviewID": "R3CZ7MKVD7POYE", "Overall": "3.0", "Content": "I have had this TV for over a year now I had to take the first one I got back to point of purchase for exchange due to power issues, after that all was fine. I didn't even pay attention to it being a 720p TV when I purchased it so I ran it in 1080p for the past year until I hooked up my PC to the TV via HDMI and discovered the TV actually runs in 1856x1024. That's cool, close enough right? Wrong, eventually my Xbox will no longer post I figured HDMI ports were screwy so I did some research discovered my TV is actually 720p. I reset Xbox display settings from 1080p to 1080i and it posts. I don't understand how a resolution can just stop working though nothing can run in 1080p any longer. I now run in 720p, this along with the terribly unpredictable audio levels make me want to kick this TV into the wall. However it being able to display above its specified resolution is nice. Just an irritating experience overall.", "Date": "June 26, 2012"}, {"Title": "You get what you pay for", "Author": "Kevin G. Byrne", "ReviewID": "R3EUFCKZYSO1LO", "Overall": "2.0", "Content": "We bought two, for different rooms. Price was $199 at Herbergers. Remote from one of them doesn't work. We were able to program both from the other remote,  but now looking for universal remote. Also: one of the boxes damaged, but tv is ok.", "Date": "January 2, 2012"}, {"Title": "It's ok", "Author": "D.S. \"Peachblossom\"", "ReviewID": "R3A1GPIV3EPO57", "Overall": "3.0", "Content": "I've had this TV for a few months. For the price that I paid for, it's ok. The picture quality is great but this TV set has a few problems. The volume, no matter how high you turn it is barely audible. The controller isn't sensitive at all, sometimes it works, sometimes it doesn't. There is also no audio jack to install portable speakers.", "Date": "November 16, 2011"}, {"Title": "good but not without it's problems", "Author": "J. Todd \"creeksidemom\"", "ReviewID": "R3MLXEW61VOL48", "Overall": "2.0", "Content": "We have had this TV for a couple of months now.  The picture is nice but the audio is a little tinny like other reviewers have stated.  The biggest issue we have has been a malfunction with the TV which started about 3-4 weeks after purchase.  About once a week, the TV will not turn on and we have to unplug it so it will reset.  I have contacted the manufacturer who said this is a common problem.  The TV has a 1 year warranty so it is covered for parts and labor if we want to pay to ship it there and send an additional $30 for return shipping. I would choose another set if I could return this one, but I'm stuck with it.", "Date": "October 10, 2011"}, {"Title": "Coby", "Author": "tyrone", "ReviewID": "R219BDMWX96VLL", "Overall": "1.0", "Content": "Having problems with the manufacturer (Coby) I'm upset with me bearing the cost of shipping and returning this TV. I received it and it does not work.  The seller \"Adomarama?\" in NY city, wash there hand of the sell (policy that any TV over 20\" you must deal with the manufacturer). I attempted several time to get some assistance from: Adomarama, Amazon, and Coby and only Amazon provide me some credit (future sells.", "Date": "July 25, 2011"}, {"Title": "WOW! Great deal!", "Author": "Cody", "ReviewID": "R1J8NXZ2AUUNA0", "Overall": "5.0", "Content": "I got this Coby HDTV in the mail yesterday and was very surprised how good of quality it is. The sound is very crisp and the picture is very vibrant. I hooked up my laptop using a VGA cord and of course it worked wonders. This is a great HDTV for the price, I paid $280 but it might go up or down in the future just because its cheap does NOT mean its \"cheap\" BUY IT!", "Date": "February 26, 2011"}, {"Title": "Coby 32\" TV", "Author": "jim c.", "ReviewID": "RLAQLODOAKEXG", "Overall": "2.0", "Content": "At first viewing, this Coby 32\" TV looked good.  The picture was pure and clean.  The sound was good also.  But as we began trying to get cable to work on the set, it was apparent that the TV was lacking.  We could only get 6 or 7 channels to work.  The people at the factory could not help us either.  We returned the set and hope to be able to pick a better TV that suits our needs.", "Date": "February 19, 2011"}, {"Title": "Coby Got it widescreen", "Author": "Keith Campo", "ReviewID": "R1QIW6RSPFTEAO", "Overall": "4.0", "Content": "The Coby 32-inch widescreen tv is a nice affordable tv. While there are much better sets out there, still for the amount of money you will spend this is a good tv to have. The remote has easy access to all the features found in the tv. My friend is not a hdmi or blue-ray type of guy so this coby tv worked great for him.", "Date": "February 13, 2011"}, {"Title": "Good Value for the money...", "Author": "dale98377", "ReviewID": "RKJ0KYJY72MIZ", "Overall": "4.0", "Content": "Coby TV, 32 inch was easy to set up and the menus are simple. Picture is great except that it seems to strech the picture a little. Not a big complaint as it is something I can accept. The only problem I would like fixed is the speakers. Not good if you are hard of hearing. They need more volume on some DVD movies. The remote is also excellent and easy to learn. I would buy again for the price. Dale98377.", "Date": "February 7, 2011"}, {"Title": "Great TV, Great Buy", "Author": "Kim Muncy", "ReviewID": "R1VN2HZC3U26KQ", "Overall": "5.0", "Content": "I absolutely LOVE my new TV!!!!  Don't let the low price steer you away.  It is a great bargain for a fabuous TV.  I am a single woman, and I was able to set it up by myself, including my DVR and DVD player.  The picture quality is amazing.  I have a 27 inch TV that cost much more than this TV, and the picture quality is not as good as this TV.  All I can say is, buy this TV you will not regret it!", "Date": "January 27, 2011"}, {"Title": "Good tv for a good price", "Author": "Rob Roy", "ReviewID": "R2SCRRNON383N2", "Overall": "5.0", "Content": "I ordered this tv on Dec.19, never expecting to receive it before Christmas---it came on the 22nd! Excellent service from Amazon, with free shipping, and the price was right. Took it out of the box and got it set up easily, got my dvd player attached and everything works fine. Nice color, sharp picture, sound pretty good (actually the larger than 5 watt speakers featured in most other sets was a real selling point for me.) Satisfied so far.", "Date": "January 19, 2011"}, {"Title": "Great price. Mediocre HDTV", "Author": "CDC \"cdosrun\"", "ReviewID": "R1JGB9SHPXAQE3", "Overall": "3.0", "Content": "TFTV3225 HDTV has a not so good picture. The problem is that the picture is washed out and the TV contrast ratio and black levels are not good. This is my young daughters TV. I bought it cuz I wanted a smaller set than the one she has and didn't want to spend a lot of money.I only paid $249 refurbished but honestly I would return it and get a better set for a little more money. But I bought this from Geeks.com. I am very pleased with their customer support.Last thing is that on comcast.com Coby has NO cable remote codes from Comcast (and apparently satellite TV either.) I searched everywhere else and found nothing. The good news is that if you auto-find the code it will eventually work. And it was faster than I thought. It only took about 5-10 tries before I got the correct one.For the price yopu just can't beat this TV. However, if you are a stickler for video quality then dig deeper in your pockets and buy something else.Overall I gave the TV 3-stars since what can you expect out of a <$300 32\" HDTV.", "Date": "March 15, 2011"}, {"Title": "Looks good", "Author": "Buyer", "ReviewID": "R17XIRANK2PIQL", "Overall": "5.0", "Content": "I bought this TV to go with my wii and even with an RCA cable, the picture quality is great.", "Date": "January 14, 2011"}, {"Title": "Pleasant surprise!", "Author": "Dovebird 220", "ReviewID": "R26L71OBETU663", "Overall": "4.0", "Content": "At first I would never have bought this Coby 3225 TV on my own as I thought Coby did not make good products.Asking around what TV I should buy to replace a 6+ yr. old TV I was surprised to get this TV as a gift!The screen is clear and better than I would have thought for a bargain priced product.Two things I have still to figure out;1. The TV code for my Comcast remote. I have read other posts that I am not the only one looking for the code!2. What cable to buy to hook the TV up to my Sony laptop? Want to use the TV for viewing PowerPoint presentations, etc.Anyway, I haven't had it long, but so far so good. I will now re-think my Coby brand phobia!", "Date": "October 24, 2010"}, {"Title": "WARNING, product recalled", "Author": "Jane Austin \"Jane\"", "ReviewID": "RER3VCH79TVE9", "Overall": "1.0", "Content": "Warning - TV can catch fire.  I bought this TV at PC Richards 10 months ago, and have been very happy with it, but read this warning in my local paper today, for which I also found this link.  http://www.cpsc.gov/en/Recalls/2014/Eight-Retailers-Recall-32-Coby-Flat-Screen-Televisions/", "Date": "January 1, 2014"}, {"Title": "Do not purchase from this company", "Author": "S. Nguyen", "ReviewID": "R3QY9RUULCSYJM", "Overall": "1.0", "Content": "There is NO customer service for this company.  I received a COBY television as a present, however, there was an issue with the sound.  The sound on the tv did not go very high and therefore I wanted to contact customer service to see if there was an upgrade or something I could do to fix it.  I called the number that is listed on their website (877-302-2629) and it is just an automated recording that tells you for customer support, go to the website.  I emailed the \"technical assistance\" and to this day, have STILL not heard back.  I sent another email today and doubt I will get a response.  I also went onto their Facebook page, which specifically had to state that they do not handle any customer service issues.  There is a customer service tab on their FB page that leads to NOTHING.  If you read the ALL of the comments on items that have been posted on FB, it is ALL complaints from people about broken products and non existent customer service.  It is very disappointing that this company is able to treat customers the way they do.", "Date": "September 20, 2013"}, {"Title": "TV started on fire, returned it 10 weeks ago. Still no TV, refund and cant get a hold of anyone on phone", "Author": "Angela", "ReviewID": "R1OG85AKQFSB9N", "Overall": "1.0", "Content": "The TV was 4 weeks old and started on fire when I turned it on. Customer service said to return it so I did and have the signed UPS delivery notice saying they got in 10 weeks ago.  I have not received a new TV or a refund and now their phone #s have been disconnected or advise me to go on line for customer service. I sent an email to them a week ago but haven't gotten a response to that either.I will never buy a coby product again!", "Date": "September 4, 2013"}, {"Title": "wow...no", "Author": "Haylerina", "ReviewID": "R3SWE1WCJVLCL8", "Overall": "2.0", "Content": "the sound on this tv is outrageously bad. everything sounds muffled. When you turn it up it barely even goes. So I mean it will be at 3 volume and then it goes up to 100 and it basically sounds the same (3 is really loud too).", "Date": "August 11, 2013"}, {"Title": "Problems with Sound", "Author": "ERae", "ReviewID": "R2ZYFDO0EHB8KF", "Overall": "1.0", "Content": "On the lowest possible sound setting, the sound is still too loud! Have never had this problem before. Returned and bought a TV from another manufacturer, which worked out great.", "Date": "April 5, 2013"}, {"Title": "COBY ARE NO GOOD", "Author": "JOHNB71", "ReviewID": "RACNY1GCHZ18N", "Overall": "1.0", "Content": "I BOUGHT TWO COBY 32 INCH LCD FLAT SCREEN TV, THE FIRST WENT OUT AFTER SIX MONTHS, NO PICTURE, SOUND OR BLUE INDIDATOR LIGHT. THE SECOND ONE WENT OUT TODAY AFTER 10 MONTHS NO PICTURE, HAS SOUND MENU DOESN'T WORK, I SENT THE FIRST ONE IN TWO MONTHS AGO, NEVER GOT IT BACK YET, PAID $40 TO SHIP AND $30 TO GET IT BACK, DONT KNOW AT THIS POINT IF THEY FIXED IT OR NOT AND WONT KNOW TILL IT GETS HERE, MAYBE NEXT CHRISMAS.  NOTHING BUT JUNK, !!!WARINING!!! DONT BUY ONE OF THESE CRAPPY COBY TVS.", "Date": "February 1, 2013"}, {"Title": "Only used for two days and already wont turn on", "Author": "Edward Hauser", "ReviewID": "R3UTASUX3QCZZ6", "Overall": "3.0", "Content": "Although the picture is good even at 720p, the sound is pretty bad as most have stated. It is bearable and most LCD TV's are not going to have the best sound. I purchased a sound bar and will see if that is better when it arrives.Now, the biggest problem is after two days of use, we couldn't get it to turn on. As soon as you hit the power button, the blue power LED goes out and nothing else happens. The only remedy we found was to unplug it and immediately plug it back in, and it works. Not sure how long the TV would last doing this, there is obviously something wrong with it and could cause it to stop turning on completely in the future.Since it is only a week old, we are returning it to Best Buy and hopefully can get a replacement that works. If it does the same thing, then I will have to reduce the stars I gave the product. Hopefully this is not that common and I just happened to get one of the lemons. I would recommend an extended warranty if you purchase this TV.UPDATE: After a little more troubleshooting, it seems like it is my TiVo Remote that is causing the issue. I programmed it to turn on the Coby TV, and when I use it, it sometimes causes the issue. Haven't had it happen yet using the remote that came with the tv. Might be something to try. I am going to give it a little while longer before returning it.", "Date": "November 26, 2012"}, {"Title": "Coby 32\"", "Author": "Andrew P Pohot", "ReviewID": "RCGVOFNLP5EQH", "Overall": "3.0", "Content": "Picture quality is good but sound not that great. When You turn the volume from low to high there is no difference in volume.", "Date": "November 11, 2012"}, {"Title": "great", "Author": "eyesthatmatter", "ReviewID": "R2UYO7JMOYPB3Q", "Overall": "4.0", "Content": "The tv met all my expectations. It was well packaged. It is clear and clear. It is a good buy for the price", "Date": "October 13, 2012"}, {"Title": "nice purchase", "Author": "Rosalind", "ReviewID": "RFH2E0NW373MP", "Overall": "4.0", "Content": "I purchased this TV from Kmart for $199. A bit skeptical about the price but so far very happy.My son got this as a graduation present and just uses it as. TV no games. Good picture and nice sound.Will see how long it lasts.", "Date": "July 7, 2012"}, {"Title": "Garbage, Garbage, Garbage!", "Author": "Allan", "ReviewID": "R31HV26ZZ3CEHH", "Overall": "1.0", "Content": "This TV worked for a total of three weeks before it died. Unfortunately, I waited three months before I took it out of the box to use it so my solid 90 day warranty was expired by a month. Amazon was gracious enough to return it, but they did get me for a 20% fee. I guess that's better than sending it back to Coby and paying to get it fixed just to have it more than likely break again. For the 3 weeks it did work, the picture was terrible to say the least. Anyways, stay away from this Coby crap and spend a little more on a better TV with a better warranty. Even Vizio makes a much better product and that isn't saying much.", "Date": "June 1, 2012"}, {"Title": "Don't expect much from this one.", "Author": "YUTERU", "ReviewID": "R3A2GBK61NIRKA", "Overall": "2.0", "Content": "I received this tv as a gift. I don't really like it but it's ok for a spare room or bedroom if you are not too concerned with picture quality or volume. This tv is absolutely not for those looking for high quality (or even middling) HD movie or game playing.Pros:- This tv is a very light flat screen lcd. It can easily be carried around to multiple rooms and has a relatively low profile for sitting on a dresser or desk.- It has 3 HDMI and 2 Component for HD sources. The built in tuner works fine for me with an antenna. Depending on your reception and location this can vary.Cons:- The picture quality is passable. In my eyes the colors are not accurate, I see a red push. Blacks are not very deep and combined with a bad viewing angle the picture looks washed out almost everywhere you sit. Movies and games with dark scenes are very hard to watch or play. There are not a lot of options on the set that would help you mitigate any of these problems.- The picture is not very sharp. This is especially evident with console gaming. There is lots of blooming and it reminds me of playing on a traditional SD tube tv. Also this set is not 1080p. It my be able to take a 1080p signal and downconvert it to 720p, but you are not viewing a true 1080p picture.- The volume is incredibly loud. Even on the lowest possible setting this tv will be too loud for discreet viewing if you have spouse or roommate who is trying to sleep. There is no audio out either, so no chance for you to hook this up to a stereo receiver or home theater receiver.- The HDMI ports are recessed behind a plastic cut-out. What's the big deal? The cut-out is very narrow and many HDMI cables have a head larger than the cut out. This ensures that the male end never completely plugs in flush to the female end. Some cables I am not able to complete the connection. With others I have to apply force and wiggle until I finally get picture and sound. The connection is not very secure and sometimes falls out.If you can get this tv relatively cheap it may be worthwhile for you as a backup or second room tv. Anything more than $249 and you should probably save your money. At the writing of this review you can probably find a better alternative for about the same price this set is currently being sold at on Amazon. Movie buffs and serious gamers looking for a good quality picture should save their money and look elsewhere.", "Date": "April 22, 2012"}, {"Title": "The right price", "Author": "Al", "ReviewID": "RTXIYY9PVOAHY", "Overall": "5.0", "Content": "Wanted to upgrade an old 36\" tv.  The Colby was on sale at the right price, and lower than several other places.  I couldn't pass on it!", "Date": "March 8, 2012"}, {"Title": "ok for the price", "Author": "sherrie", "ReviewID": "R13W06KPIBKUQ6", "Overall": "3.0", "Content": "If you want cheap, you get it.  I could not get the sound to go above a whisper using the hdmi cord and had to return it.  Great return policy so I agreed to try a second unit.  Same problem but at least with this one I can hear my dvd's and streaming netflix through the component cords.  Picture is pretty good for a cheap tv.  I am still puzzled why the sound is terrible though the hdmi ports.  And I checked my blu ray player by attaching it to my other tv and it is fine so it has to be this tv.  The sound is ok with the over the air.  Just in case you were wondering, I did spend quite a few hours on the phone with tech support for both the tv and the blu ray player to see if I could resolve it without returning it.", "Date": "March 5, 2012"}, {"Title": "todo bien", "Author": "dirimo ramirez", "ReviewID": "RHTYXN73QOTUA", "Overall": "5.0", "Content": "disculpa la tardanza todo bien el equipo perfecto el vendedor muy cordial y la compra exelente gracias la tv coby es de los mejores televisores que he comprado", "Date": "December 7, 2011"}, {"Title": "easy on the eyes", "Author": "brian", "ReviewID": "R3EAQ3PQ7HB9C", "Overall": "4.0", "Content": "i'm very happy with this tv.i paid 248.00 + tax, on sale at shopko.love it! a great value!", "Date": "August 14, 2011"}, {"Title": "Great purchase for the price", "Author": "Ktornga", "ReviewID": "R2RTY6DCZED32S", "Overall": "4.0", "Content": "Was deciding between two different TVs. I am very happy that just on an impulse, I decided to go with this one. It is super light, super easy to set up and the picture is great.", "Date": "March 13, 2011"}, {"Title": "Bad image", "Author": "ender", "ReviewID": "R3B3BJ3FAKP3QI", "Overall": "2.0", "Content": "I bought the lcd tv coby the 3225 model on 18 January because the price was excellent, but when power on and configure your colors looks very bad tv, the pixels of the display when dark colors are felt too revealing a rather ugly and bad, and however much I try to set the picture does not improve, then buy a cable s video to see if the picture quality improved but still not improved, I was very happy with my purchase but now I'm completely disillusioned purchase.", "Date": "February 25, 2011"}, {"Title": "Very nice tv for the price.", "Author": "Chris", "ReviewID": "R15SPOHLCG9J6", "Overall": "4.0", "Content": "As stated, it does do 1080p, but it looks significantly worse with text than my grandmother's 32 inch LG TV. For TV viewing it is great. The color could be more saturated, though, it looks a little bland. I hook my alienware laptop up to it through HDMI and WoW on it looks awesome. It's a great TV and monitor, and I highly recommend it for the price. Too bad the price dropped right after I bought it for around $325.", "Date": "October 21, 2010"}, {"Title": "Enjoying the set", "Author": "Gerald Smith", "ReviewID": "R3US1LMOIL5X54", "Overall": "5.0", "Content": "The product arrived as advertised. It arrived on time. I truly am enjoying this product and highly recommed the seller.", "Date": "October 3, 2010"}, {"Title": "I will never by a Coby product again", "Author": "Ian", "ReviewID": "R3TLJJ2SWMPB8Y", "Overall": "1.0", "Content": "It came broken. I returned it and got a Toshiba for the same price at Best Buy. So you really don't have to buy from a crap manufacturer like Coby to get a cheap TV.", "Date": "January 21, 2012"}, {"Title": "Excelente Televisor", "Author": "Javier", "ReviewID": "R16GT0RIULPJ8Y", "Overall": "5.0", "Content": "Hola amigos de Amazon, bueno con respecto a este producto puedo decir que me parece muy bueno. Su imagen, sonido y diseño son muy agradables a la vista del que lo usa. Es una conjunción de diseño y tecnología bien percibida. Estoy totalmente satisfecho con mi televisor, lo recomiendo ampliamente.", "Date": "March 20, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0037KLELE"}}