{"Reviews": [{"Title": "Very Impressed", "Author": "JB", "ReviewID": "R15GAX0D5WZ12U", "Overall": "5.0", "Content": "I am extremely happy with the performance of this TV, though I was initiatlly confused because the product is slightly different than the description on Amazon. There is only 1 HDMI port on the back on my model and nothing on the side of the TV. There is a USB but it's on the back. My model is definitely the LN22C450 but I spoke with Samsung and they told me that there is another LN22C450 that has an additional HDMI port on the side. Don't know why they have more than one model with the same name. I contacted Amazon about the issue and they offered me a discount which made me forget about the problem. I was impressed by the customer service dept. with Amazon. I liked the idea of a side HDMI connection, but I don't really need two HDMI ports so it wasn't a big enough deal. It would have been nice to have the USB on the side, for easier access, but I can live with reaching around the back since I'm not wall mounting it.Now on to what I love about the TV:-It has an excellent picture quality for all types of signals. I'm replacing a 15\" Polariod and the quality is light years ahead. The picture is very bright with vivid colors. Regular cable is very clear and smooth, digital 480i cable looks great, and the 720p and 1080i are incredible.-The sound is more than sufficient for a TV this size. It's rich and clear without the \"tinny\" sound of other TV's this size.-The TV has a great digital tuner and picks up \"over the air\" HD stations very well. There's even a diagnostic signal strength meter. I'm able to pick up all my local network stations without any problems. I have a digital box I purchased that could not do this. I was thrilled to pull in HD signals without a separate antenna. I did not expect it to do this.-It is well designed and easy to use. The menus are easy to follow and the setup is simple. Even the remote is great.-It's a great looking TV. The speakers are hidden and it has a slight reddish tint to it near the bottom. It also has a nice low profile. It is about an inch shorter than the C350 even though the screen size is identical. I really liked this since I have it placed on a bookshelf. It's a perfect fit for the room I have it in.Overall, this TV is awesome. I'm thoroughly enjoying march madness in HD!", "Date": "March 31, 2010"}, {"Title": "Good Choice for RV", "Author": "G. Johnson", "ReviewID": "RELPZ5X1X4KUG", "Overall": "5.0", "Content": "Purchased for travel trailer. Replaces original equip. Haier. Receiving an HDTV channel by RV antenna can be difficult but the Haier's tuner did not help make it any easier. Looked at several brands before picking this TV. I liked the great picture and easy menu and remote control, but was sold by signal strength meter function in the antenna menu. I've been playing with TV set-up at home and found this function makes aiming the antenna very simple. The tuner is sensitive and auto channel search is quick. (For reference, we're 40 miles from nearest station.) It finds channels too weak to produce a picture but able to be viewed by adjusting antenna using signal meter. Sound was not to my liking at standard settings. I fixed it by adjusting settings in equailizer menu. I am happy with this TV and would buy it again. Was eligible for Amazon's free shipping and it was delivered in good time and good condition.", "Date": "March 28, 2010"}, {"Title": "Wrong screws for Samsung TV stand", "Author": "Shaun Considine \"Shaun Considine\"", "ReviewID": "R13LU9W4KLW8XX", "Overall": "3.0", "Content": "Assembling TV we found that Samsung had enclosed the wrong screws for TV stand.Hence TV monitor remained unsteady and off-center.  We called their consumer complaintsdepartment. spoke to rep, who asked that we send them the bill of sale, with details of complaint.We did this. All we wanted were the right screws, but instead we received a new TV stand, whichcame with no screws at all.  Called and emailed Samsung again, twice. They have not responded.Upon checking online we discovered that other consumers had the same problem of Wrong Screwswith Samsung TV's.Shaun C.", "Date": "March 13, 2012"}, {"Title": "Outstanding LCD TV", "Author": "Liqmaticus", "ReviewID": "R17JGC0SXVR9JZ", "Overall": "5.0", "Content": "Out of all the flat screen televisions I have purchased this has got to be the best I have purchased yet. A little pricier than most in its size class, but full of features and the image quality is amazing! I did read one review about the screws not fitting properly with the stand and I did not experience this problem. My stand screwed in tight and zero wobble and very stable. Picks up all the local HD channels super clear which I was very impressed with without cable assistance. Excellent internal sound as well. Really worth every penny. Samsung has a winner here.", "Date": "November 29, 2010"}, {"Title": "Screws a problem?? Suggestion", "Author": "E. Guss", "ReviewID": "R2L21J51GRK8S1", "Overall": "5.0", "Content": "The screws are apparently made to be slightly oversized for a tight fit and a good connection with the stand. It is like a lock nut which is designed to HOLD.Try this. Get a moist bar of soap (my favorite lubricant for nuts, bolts & screws). Rub soap on the threads and then apply pressure with your scredriver. The screws go in as designed for a tight fit.Hope this helps someone.", "Date": "April 23, 2011"}, {"Title": "A very good, inexpensive HDTV choice", "Author": "Alan Schwartz", "ReviewID": "RO9BL488XCRHG", "Overall": "4.0", "Content": "A very nice, awesomely priced HDTV we are using in our bedroom.  The picture is great and it is a beautifully designed set.  The only limitation I would say is that the sound is a bit tinny if you are using it for most music purposes--DVDs and such.", "Date": "December 28, 2010"}, {"Title": "Great tuner.", "Author": "Air User", "ReviewID": "R2Q36WC9VC27OI", "Overall": "5.0", "Content": "Bought this more-expensive-than-some-other-brands TV because I read a consumer review about its excellent tuner. I use an antenna & don't have cable, so tuner's important. I now receive several more stations than I did before with a convertor box. Great picture quality. Recognizes both my 4-yr-old Macbook Pro & year-old Macbook Air with HDMI & VGA connections. The only thing I miss is digital program guide - this one gives info on current program & what's coming next, but not whole guide for later programs.", "Date": "December 14, 2010"}, {"Title": "Cheaply Made Stand", "Author": "John Diche \"JD\"", "ReviewID": "RQFFX9B63DPB5", "Overall": "1.0", "Content": "The screws provided to attach the stand to the television are too large.  As a result of the stand not being secured tightly the television wobbles. I am going to attempt to contact Samsung before sending television back.Update 5/5/10: I contacted Samsung's phone customer service and got the run around (I won't go into detail now) which frustrated me.  Next I tried their twitter Customer Service.  After some back and forth @SamsungService asked for my email so they can get the information needed to send me the proper size screws.  We'll see how this goes.Update 5/12/10: Well, a week has passed and I have not received the screws from Samsung yet.  I'll give them a couple more days while keeping Amazon's Return Policy in mind.Update 5/13/10: Finally got the screw.  That's right screw.  Samsung only sent one screw for the 3 screw stand...and to top it off the new screw doesn't fit either.This little Samsung is about to take a road trip.", "Date": "May 4, 2010"}, {"Title": "Great quality but the base was werid to put together and isn't the most stable.", "Author": "Caitlin", "ReviewID": "R3NK0H2TQKVFOG", "Overall": "3.0", "Content": "This was a great buy for me as I use it to plug into my computer as an extra screen and not as a TV. Only downfall is putting the stand together was weird and it isn't the most secure unless I didn't do it right.", "Date": "December 7, 2013"}, {"Title": "SAMSUNG LN22C450", "Author": "E.  Angstadt", "ReviewID": "RBW1X3U091ZHU", "Overall": "4.0", "Content": "Purchased this unit 14 months ago for my parents.  they had a 19 inch and wanted the flat screen equivilant.  This unit has worked out well.  Good picture and sound.  They liked it well enough they purchased a 32 inch Samsung for their living room. They are happy enough with this model that we are getting them another 22 inch for Christmas for their bedroom.", "Date": "November 20, 2011"}, {"Title": "22 inch Samsung TV", "Author": "Midwest Shooter", "ReviewID": "R2498PFPMYWMQD", "Overall": "5.0", "Content": "Ordered this TV for a Bedroom.  Picture is great.  Have three Samsung TVs.  Never a problem.  If I did it again I would have ordered at least a 26 inch  model.", "Date": "August 27, 2011"}, {"Title": "Great Picture", "Author": "Paulette J. Brady", "ReviewID": "R3EJD7LVGF77GA", "Overall": "5.0", "Content": "Lost my T.V. on my patio due to power surges during many storms that are frequent in Fl. This was a replacement for the older style I had out there. Awesome to have the more compact size with a super clear picture! BEST PRICE ANYWHERE!", "Date": "August 4, 2011"}, {"Title": "Great TV - Especially for the price", "Author": "Ken Stenger", "ReviewID": "R1R5IFYLRXGL7H", "Overall": "5.0", "Content": "This TV is fantastic.  It provides a great picture in a nice looking frame.  I was tentative to purchase due to the repetitive negative reviews about the screws.  I can understand why people would write this, but I think it is primarily user error.  When I was installing the stand the first few turns of the screw are very easy, but then it feels like you hit a wall where you cannot go any further.  With just a little bit of force I was able to get the screws in without a problem.  I believe this is intentional as the stand is also used for a wall mount.  The screws are difficult to screw in as a feature (similar to locktite).  Overall a great TV and a great purchase.", "Date": "April 21, 2011"}, {"Title": "SCREWS DO FIT - TURN AUTO VOLUME ON", "Author": "Patricia A. Werhan \"PAW\"", "ReviewID": "RGY39U0NVH6F0", "Overall": "5.0", "Content": "Boy, did we have trouble w/ SCREWS on 450 series - but THEY DO FIT!!  PUSH SCREWDRIVER HARD.  And GO TO MENU AND TURN AUTO VOLUME ON.  These Samsung come with AUTOMATIC VOLUME OFF and it's difficult to hear.  We have 3 of the 350 Series and love them, but turn Automatic Volume ON them also.  LOVE SAMSUNG HDTV. Thanks Amazon and Samsung!!", "Date": "April 13, 2011"}, {"Title": "Pleased", "Author": "Robert Campbell", "ReviewID": "R3EC0CA77TUWPY", "Overall": "5.0", "Content": "So much kvetching in these reviews about the screws to mount the base. They are evidently sheet metal screws intended to cut their own threads.The set performs well and has a good, crisp image. I receive stations over the air; the tuner seems to outperform the Zenith converter box formerly in use.", "Date": "April 12, 2011"}, {"Title": "Mounting stand is not a problem, if you have an Erector Set", "Author": "Elliott S. Mccrory \"profelliott\"", "ReviewID": "RB886PQTT0SNP", "Overall": "4.0", "Content": "There has been much discussion of the seemingly faulty mounting stand screws for this TV.  With that in mind, I was very careful in attaching the stand.I started to drive the screws, and they stopped going in easily at about one full turn--as if it was cutting new threads in the receiving plastic.  This was not enough to attach the stand to the TV.  But being leery of what damage I might be doing, I backed them off and called a meeting with my teenage son.  After careful consideration, he disappeared into the old toy closet.  He came back with a dozen washers from his old Erector Set, e.g.,  Erector Multi Model Construction Set.  We put two washers on each screw.  I drove the screws all the way in, and it was perfect!  (Getting the screws started required the use of needle-nosed pliers.)Long story short: Put two Erector Set washers onto the screws that attach the base to the TV.The picture is stunning!  The setup is a breeze. The sound is so-so (and that is why I give only 4 stars).  But these observations are already well documented.", "Date": "January 12, 2011"}, {"Title": "Poor stand", "Author": "Timburrh", "ReviewID": "R2H2JVKSV0CMFO", "Overall": "3.0", "Content": "Had seen reviews on the internet about the wrong screws and poor stand but thought Samsung would have fixed that by now so I ordered the TV.  Alas, same problem.  Wrong screws.  Tech support sent me a link to watch a video on how to install the base- quite demeaning.  The movie was for an entirely different base or stand than what comes with the set.  Called back and support said they would send new screws to which I replied, forget it and sent the tv back to Amazon and ordered a similar model by Sony for less money.", "Date": "December 30, 2010"}, {"Title": "1 HDMI input, Not 2", "Author": "EeM_amazon", "ReviewID": "R17IKD00VFKF24", "Overall": "1.0", "Content": "The technical details indicate there are 2 HDMI inputs but there is only one. The product description does accurately describe the TV as having 1 HDMI input. The Samsung web site, interestingly enough, says the TV has 2 HDMI inputs. The Amazon customer service rep tried to convince me that 1 HDMI & 1 PC input is the same as 2 HDMI input...idiot. Anyhow, they gave me an additional 20% off, so if you only need 1 HDMI input, buy this TV and then call and complain and you should get at least 20% back.", "Date": "June 24, 2010"}, {"Title": "Wrong screws to attach panel to stand", "Author": "Webb Stacy", "ReviewID": "R2UCWJFNURYSUE", "Overall": "1.0", "Content": "Purchased this product for my son's birthday. Opened the box, began assembling panel to stand. Screws were impossible to insert. Tried many different strategies, even looked at screws for wall mount. Tried some similar sized screws I had laying around. No joy. Given the experiences of other users reported here, decided it would be a lose to contact Samsung support. Returned the TV.", "Date": "June 27, 2010"}, {"Title": "Horrible product, even WORSE customer service", "Author": "D. Joyce", "ReviewID": "R1ZLB929D4BEW7", "Overall": "1.0", "Content": "I'm so upset right now I'm practically shaking. So I'm going to write this in brief bulletpoint form:-bought the TV, noticed the stand didn't fit properly into the tv (provided screws are too wide AND missing a screw)-took back to large retail box store in Canada but were told it was too late to return (bought before christmas so had for longer than 30 days), told to contact Samsung as it was a warranty issue now-contacted Samsung, referred us to a parts supplier for the screws who wanted to charge us to ship them out to us-called Samsung again, got an EXTREMELY RUDE employee who said that we had to contact them within 72 hours if there was an issue and besides, the included stand is NOT part of the Tv. I pointed out to him that there is NO MENTION of this 72 hour policy in their LEGAL WARRANTY and also no mention of any exclusion of the stand (it just states \"product\" which the stand is part of). I asked him where in the warranty is says that the stand is excluded from service and he said \"You tell me where in the warranty is says that it IS covered?\" and it went downhill from there. Very snarky.-spoke to supervisor who apolgized and agreed that their policy makes no logical sense and that samsung should spend the 5 cents plus 50 cents shipping to keep a customer happy (also knowing there were complaints on Amazon, etc. you would think they would want to KNOW this kind of stuff so that they can fix the product for future sales) but that was just the way it is and nothing could be done. I asked him if anybody above him could look it over and contact me back and he said that they never return calls, that it was pointless. Finally, after BEGGING him he agreed he would \"do his best\" to pass it along to a superior instead of filing it away where it will never see the light of day again, but unfortunately \"I can't promise you anything, because I'm an honest person\". he did at least apologize for the employee's rudeness, but I feel like I just got \"yessed\" to death and \"I'm sorry for your inconvenience\" until I just gave up.As I said to the manager, you would think that Samsung would want to know about this issue and would empower employees to think outside the box and the manual and do something to make a customer happy over what would cost them 55 cents, but apparently they would rather bury it in bureaucracy and ignore their customers and treat them like dirt.I can honestly say after this experience, that I WILL NEVER PURCHASE ANOTHER SAMSUNG PRODUCT AS LONG AS I LIVE--and we already have a 55 inch LCD Samsung TV and Bluray player (and laptop, I believe), so I guess they just lost what used to be a loyal customer. CAVEAT EMPTOR!I will be reporting them to the local Provincial Consumer Protection Agency as I have done with another Co. because they are not honouring their legally binding Warranty. I hope they will at least get fined the $50K that the other company did so that a .55 issue becomes a $50,000 one and they learn some kind of lesson (though I doubt it).", "Date": "April 5, 2011"}, {"Title": "misleading description of TV", "Author": "don ruffus", "ReviewID": "R19RHC16KNY4PH", "Overall": "1.0", "Content": "I purchased a  TV that was stated as having \"minor cosmetic box damage. Unit and contents in perfect condition. Never been used\". However, there were NO screws to attach the TV to the stand, we did have screws for a wall mount that was NOT there and there was NO remote control. Bottom line, we can NOT use the TV with what we have. I am extremely disappointed.  This was a Christmas gift for my spouse. I can only hope that I get the necessary help needed to get all the missing items.", "Date": "December 25, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "3Wx2 audio output\nWide Color Enhancer\nConnectShare\n2 HDMI (ver 1.3), HDMI-CEC\nComponent & PC input", "Name": "Samsung LN22C450 22-Inch 720p 60 Hz LCD HDTV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51GV8iMKzgL._SX300_.jpg", "ProductID": "B0036WT3GG"}}