{"Reviews": [{"Title": "Decent entry-level TV", "Author": "E. Merck", "ReviewID": "R1LNRJA0LNVDSI", "Overall": "4.0", "Content": "Last edit: 08 Feb 2011I've waited to post a review for a few days to avoid writing something that just reflects the afterglow of upsizing from a 32 to 42 inch screen. The BF lightning deal price was just AWESOME. Thank you Amazon for saving me from standing in line in the 20-degree rain at Target!The bottom line: while there are a few shortcomings in this TV compared to higher end models, it is a functional entry-level screen.Pros:- Gorgeous color and detail - an immersive experience from 8 feet away. Well-lit scenes are its forte: to my eye as good as any other screen. The first movie we watched was Up, at only 720p through VGA from my laptop but it seemed almost 3D at times compared to our previous 32-inch Vizio (E320VL). Blu-rays look GREAT as well, no problems connecting. Beautiful, beautiful, beautiful.- Menus are well organized and aesthetically well-designed.- Channel tuner works great. Found everything my old tv did, and a few more!- Included remote has all the options you want to be there, and is pretty forgiving about where you point it (30 degree window on either side of straight on). Separate buttons for every input, buttons to shuffle through picture and sound profiles, CC button on the remote (unlike Vizio where you had to dig in menus). Very well-designed remote, and I love how slim it is.- TV speakers are as good as any other I've heard (not real high quality but functional).- Lots of types of inputs.- Matte screen reduces glare.Cons:- As others have mentioned, blacks on 1080i HD channels through the coaxial (antenna) input are REALLY dark sometimes. I should note that this doesn't affect 720 or 480 channels from the antenna, DVD, HDMI or VGA inputs; those black levels are fine, if not as dark as higher end models. I need to play with the picture options more to see if I can fix this...EDIT: I am now much happier with black levels. I have Contrast and Brightness in the 70s, with the other settings still at 50 (I take Sharpness down to 20 for filmed Blurays because of the standard grain issues). This seems to be the ideal compromise. By trying others suggestions and not seeing good results, I wonder if each TV may be a bit different - certainly viewer's eyes are. But the good news: black level problem largely fixed by adjusting the picture!- A bit of over-redness sometimes through the VGA - I deal with it in the short term by setting Color to \"Cool\". This only happened with one movie one time, and I'm not sure why... maybe didn't have the VGA hooked up completely.- Only 2 HDMI inputs may be a con to some.- Menus lack some options in higher end models, but enough to play with.- Unit gets pretty warm - power consumption is 300W (150 is more average for this size in leading brands). But it's only $19/yr. more in energy costs if the TV's on 3 hours a day average (way more than we use). Decided I can live with that.- The connection method of the base won't support side-to-side movement of the monitor very much - gotta be careful to set it down square when you move it.Responses to others' cons:- Like a cheap plastic toy: There are no pieces of extra plastic on the edges of my unit, and it's glossy, smooth, elegant, and solid. The only weak area is the base connection.- Packaging is poor: Other than the box being a little more plain than others, it is packed very securely and well. Not sure what some people were referring to.- Backlight leakage at corners of the screen: I turned off all the lights in the room and do not see this at all... seems fine to me!EDIT: Okay, I've seen the \"corner leakage\" now, but have to have all lights off and be displaying a completely black screen (noticed while watching credits of Jurassic Park)- it's faint in the upper corners. Actually though, I don't think it's backlight leakage, as by changing your viewing angle it moves around a lot, and even inverts to darker black. There is also a light sheen or cloudiness randomly distributed across the screen that shifts as you move around. It seems to be the matte surface of the screen is not completely flat, and in a dark room it becomes apparent as a little bit of light from the LCDs leaks through and catches the matte texture. Something to be aware of, but no noticeable effect on picture quality in almost all viewing conditions. It's least visible when you are watching straight on to the screen.- Bug in remote buttons: The channel changing buttons on the remote are sensitive. It seems to have a quick-scan feature that quickly switches over 2 channels, then two more if you hold it down too long. I don't see this as a bug though, just don't hold down as long and problem solved :-)Additional tidbit: I somehow unlocked the Tint control! It may have had something to do with accidentally unpluggling a VGA cord while TV and computer were running. It's after that I noticed the change. TV still works great in every way. Good news: the default \"0\" setting it was frozen at before is about the best anyway - leaving it there.Owner's manual now online at iSymphony's website: [...]For someone on a budget the $300 price tag was awesome, though I'm not sure I would buy it at the $449 price when you can do much better for just a hundred or two more. I grabbed a 3 year warranty from Squaretrade since this is a totally unproven brand. 40% off with code SLICK. Let's hope it lasts!", "Date": "December 3, 2010"}, {"Title": "Value, Value, Value!", "Author": "Lindyhop", "ReviewID": "R2XS4M8OBZMXOQ", "Overall": "5.0", "Content": "Also purchased this during the Lightning Deal on Black Friday - like many others, I was crossing my fingers since there was little info on this brand, much less the particular TV.  I was looking for VALUE, and boy did I find it.  Paid $4 for shipping with free trial of Amazon Prime, got it less than 24 hours later.  What a deal!  Video quality is great, especially with an HD antenna.  You can't rename inputs, but you can rename channels.  There are only 2 HDMI inputs, not the advertised 3, but it's all I need for now.  Audio and Video Out (Analog, R+L) are also on TV, they weren't advertised.  This makes multiple audio inputs a cinch when routing it to my audio system, at least for stereo.  Otherwise inputs are as advertised.  (Someone explain to me why someone would use a headphone jack on a 42\" TV?!?!)  TV speakers are fine, but I'm not using them.  VGA input works great, I use a wireless keyboard and mouse from a distance.  Each input has separate audio and video settings, which is awesome for tweaking each source as needed.  Separate buttons for each input on the remote, much more efficient to switch than choosing source and scrolling like my last TV.  There are only two aspect options, 16:9 and 4:3, no zoom or letterbox, that's OK with me.  Video quality suffers during dark movies with the lights out because of lower contrast and brightness specs than most, but it's just fine when you turn the lights on; I had already expected decreased quality, but it was better than expected.  LCDs are better in brighter conditions anyway.  Could not tell when I purchased it, but it has a matte screen.  Watch at 9' back, totally immersive at that distance (almost too close... almost).  DVD playback looks great, processor seems to handle VGA, XBox, DVD great.  I'm sure at 1080p it will only improve with Blu-ray.  60hz as advertised (120hz bugs me, ruins FX in CGI movies, makes it look fake).  The only question is long-term quality, I'm a little worried it will go out 13 months from now, after the 1-year factory warranty expires, so I'm getting a 3rd party warranty to make sure I get all the value I can out of it.  Final word: at $300, this is one of the best values I've ever found!", "Date": "November 29, 2010"}, {"Title": "Super Disappointed =(", "Author": "Karla", "ReviewID": "R2MV2CH337NILX", "Overall": "1.0", "Content": "I bought this TV during the Black Friday deals.  I was super excited to be getting an LCD TV so cheap but I was a little worried (like some of the people on here) because there were no reviews for the TV when I purchased it.Once I received my TV, I waited a couple of days for the reviews to start coming in to see if I really wanted to keep it.  Some reviews were positive, some negative.  People complained of picture problems and having to get replacements.  I crossed my fingers when I opened the box yesterday and set it up.  I was taking my chances and hoping the TV would just work and I could sit here and write a great review.The TV worked fine last night...I was annoyed I could not change the tint but it wasn't a big deal. The picture is okay (I think the one on my 720 32\" Insignia looks better) but what was I going to expect for $300.  Overall, I was satisfied...until this morning.  I turned the TV on and was watching for about 30 minutes when the TV went black.  I could still hear the volume but the picture was black.  I turned the TV off then on and the picture came back.  It didn't do it anymore so I thought everything was okay. But an hour later it did it again...and again...and again.  It just kept going black every 2 minutes. My husband unplugged all the cables and plugged them back just incase something was lose but it kept happening. We gave up.  I went online,  filled out the form from Amazon, and UPS will be picking up the TV tomorrow. I don't want an exchange (as some people did for their faulty tv).  I'm worried that even with a replacement the TV will go out in a couple of months.  I will get my refund from Amazon and I will spend another $200-$300 and get a better TV.", "Date": "December 5, 2010"}, {"Title": "Great Value", "Author": "B. Eubanks", "ReviewID": "RS5SNQJ1ZD4DL", "Overall": "4.0", "Content": "I got this during the Black Friday sale for under $300.00.  I didn't know what to expect.  I set up the tv this morning, and the picture was as good as any 42 inch LCD display I've ever seen. The only down side is that there are the lack of inputs. There's only the coaxial, 2 a/v, 1 component and 2 HDMI, but what can you expect wish such a low price?", "Date": "November 27, 2010"}, {"Title": "Not Quite Sure What Everyone Was Expecting...", "Author": "L. Luster", "ReviewID": "R2OZGQCPAF7QH", "Overall": "5.0", "Content": "Like the rest of the reviewers, I purchased this TV as a Black Friday sale item.  As a matter of fact, this is the same brand that Walmart has carried in the past during their Black Friday sales.  I knew what type of television I was getting for the price.  This is not the type of tv that goes in the movie room, living room, or bedroom.  This is the type of tv that you buy for the kids room or to allow them to play video games on.  For me, I have more high end tv's in my bedroom and living room...I bought it to go in the treadmill room.  I don't care about HDMI input/output, how many the advertisement says vs what is actually there, etc.  I needed something to watch while I worked out.  The picture is fine, the sound is fine, it looks fine.  That's about all I would expect and appreciate from this name brand/type of deal.  I've seen this brand at a many Black Friday sales year after year.  As a matter of fact, my last tv I bought from iSymphony lasted until I sold it...about 6 years...and it was a CRT.Bottom line, if the other reviewers were looking for something state of the art with 5 HDMIs, etc...they should've looked at the LG's that were on sale or a more common/high end product like Sony, Sharp, etc.  You shouldn't expect anything outstanding from a 42 inch tv that you paid $300 for.", "Date": "December 2, 2010"}, {"Title": "What a Deal!", "Author": "Dr. John Grgicak \"buddha25\"", "ReviewID": "RGNZF23PCDQM", "Overall": "5.0", "Content": "I still brag to my friends that I was able to get a 42 inch 1080p HDTV for $298!  Amazing!  I've had it up and running for the past 3 weeks now and have had no problems.  I bought this to put literally next to my 42 inch Panasonic 800u plasma and there really is no striking difference in the picture quality.  I've played my PS3 and watched satellite in HD and the picture was great after some minimal tinkering with the settings.  A friend of mine actually offered me $500 for this TV thinking he was getting a great deal (and considering I probably don't need it as much as him anyway), but because I was so satisfied with the purchase (and bragging rights), I just couldn't part ways with it.  I hope this TV lasts for a while!!", "Date": "December 14, 2010"}, {"Title": "4 stars for BF Deal. 3.5 stars for Reg Price", "Author": "secondbushome \"Hot potato!\"", "ReviewID": "R3711HI8L4UZAP", "Overall": "4.0", "Content": "I got this on the Black Friday deal. At the price it's sold for right now, it's not the greatest option in terms of quality and name. But remember, this is a 42 inch being sold at a 32 inch price. And it is noticeably larger than a 32 inch. In fact, it might be too large for my small apartment. It is a very good option if 'size on a budget' is what you're looking for.THE IFFY - *Irrevelant if you're mounting the TV on the wall* The way the stand is attached to the TV is not the most reliable. Four 3/4 inch screws that get screwed directly into the TV's plastic body. It seems incredibly cheap and possibly easy to strip with repetitive screwing. And once that happens, you're screwed unless you mount it on the wall. So far, it works (TV stands up straight and isn't wobbly) but I'd be careful about bumping it too much or taking off the stand too many times. Especially with how big and heavy this TV is, it's a bit shocking that they'd make the stand like that. - Channel-switching is a bit slow. It takes a couple of seconds for a channel to load up, which is an eternity to those impatient couch potatoes. VGA input takes 4-5 seconds to load each time to switch to it. However, the HDMI inputs seem immediate. - Red hues are very pronounced and often overpower other colors. If there's alot of red in the picture, the screen looks like it's bleeding. This is in the standard picture mode and I haven't played with the settings much yet (switching to 'cool' helps a bit). - Dark colors usually are too dark. Night scenes are very dark and don't have much contrast. Black/dark-on black is basically just black. Once again, I haven't played much with the settings to fix this. Standard mode. - Not an Energy Star, so this TV probably uses more power than it should. Doesn't run too hot though. - The remote is super cheap. The buttons are small and flimsy. Sometimes a button will not send and you have to push it again. Makes switching channels a pain. They should of provided a better remote, esp since this TV probably doesn't have known codes for most universal remotes yet. Doesn't seem like it'll hold up to too much button-mashing. Hopefully universal remote support will show up soon. At least it has separate buttons for each input. There's some buttons on there I'm not sure what they're used for. - The \"manual\" is crap. It doesn't even tell you what some of the setup options are. 16 pages, half which are those standard 'warning' shpeels and reiterating the obvious. No remote codes listed. Very, very skimpy. - No 3.5mm audio input. It has a headphone jack but I don't know if anyone's gonna be using headphones with a TV this size. All audio inputs are RCA jacks. - Only ONE component input. Yet they have two RCA video inputs. Why?! Do people even use RCA video inputs anymore? Two HDMIs, which is skimpy for a TV this size. - Last but not least, not much brand record. This is definitely an off/generic brand. Might be a risk down the road and it definitely will not have a good resale value. Kinda like buying a Kia car. But it's priced low and worth the risk if you buy a 3rd-party warranty plan with it. And at least it lists a phone number to call.THE GOOD - The picture is surprisingly good. HD comes out great (minus the color issues above) and is very dynamic and real. Contrast between all other colors besides black and red is very good. Bright images look great. I'm amazed really. *Remember, SD 480 and lo-res picture will not look as good, naturally, but it looks as good as it possibly can be.* - The sound is good. It's 'surround' option is noticeably roomier. I don't know about the complaints about the sound, because mine is very good for onboard speakers. Unfortunately, it doesn't display whether you're getting mono or stereo sound and there's not many options to switch or change besides the \"surround\" and a 3-band equaliser. But the sound quality itself is very good. - Despite the problems with black-on-black images, black colors do come out very dark, which makes its contrast with bright colors very good. In fact, black colors are basically as dark as when the screen is off. - The screen is viewable up to 178 degree angles. No loss of LCD viewability from deep angles, though the screen itself does reflect some light at deep angles, creating some glare. But nothing too bad. - The set itself looks nice. Glossy black. Doesn't look or feel cheap, except for the way the stand is attached. Only thing cheap-looking is the brand name.Essentially, the set has shown itself to be a good-functioning TV with great picture and sound. There aren't any extra features, just the essential options and settings. At its current price, is a viable and recommended option for those looking for a big HDTV on a budget, and doesn't care to only look into name brands. It's ten inches bigger than other TVs in its price range and you aren't losing out on much besides brand appeal and company track record. The issue with red and dark colors aren't bad enough to ruin the overall picture. I'm very happy with the set, as long the stand holds up and the TV doesn't just break. Hopefully universal remote support will crop up soon.Good for: poor people who want a bigger screen HDTV, families, college kids who want to be THE popular one in their dorm, any regular joe who wants a decent HDTV but doesn't want to pay the premium of name brandsBad for: people who'll have to move the TV around alot (heavy and bad stand), people who are very specific with their remotes, people who fear generic brands, people who use alot of AV components (skimpy on the inputs), people who watch ALOT of vampire movies (color issues with red blood and night scenes)UPDATE: - I finally utilised the HDMI with satellite TV. The color issues from using an antenna in TV mode doesn't appear to carry over to the HDMI. The color seems fine. No issues with HDMI besides the slow load time that's apparent from all the inputs. - When you turn the volume up past 30, bassy sounds seem to cause a slight rattling or break-up in the speakers. Not too obvious but it's noticeable and I'd imagine worse if you turn it up higher. Dialogue sounds fine, it mainly affects dramatic soundtracks and explosions. Pretty average for onboard speakers which usually don't handle bass very well. If you watch alot of action movies and like it loud, I'd suggest investing in a speaker system. - There is limited support for the DirecTV remote control. The TV or brand isn't listed and you have to put the code in manually. The best code I've come across is 10812, which allows you to control volume and input selection, but has issues powering off. The OFF button just switches to S-Video and bumps up the volume to 70, which is an unpleasant surprise when you turn the receiver back on and blow your ears out. In the end, you can use the DirecTV remote for basic functions but keep the original remote around for other functions.", "Date": "December 6, 2010"}, {"Title": "Good TV for the price", "Author": "Andy", "ReviewID": "RS0I4JNRMVP1J", "Overall": "4.0", "Content": "I got this on the Black Friday deal and it took quite sometime to get to me (on free shipping). Just set it up and picture and sound seems good. As others had noted, there are limited inputs, but that is what I had expected for the price. HD picture is good and audio is also find..Not too many options to change in the menu too and all imput selection have separate buttons on the remote. This is not to much documentation with the TV or online (This is not listed as a product in the manufacturer's website??)Anyway for people who want to integrate this into their Cable remote, I used the ESA codes and it worked. (After some web searches I found that this model is made by a company called E&S; and their code is listed as ESA). On comcast, the code that worked for me is 10812", "Date": "December 4, 2010"}, {"Title": "Terrible picture, worse customer service", "Author": "kkava", "ReviewID": "R2L8U78HHCIQ3S", "Overall": "1.0", "Content": "I purchased this TV on Black Friday and it was my fault we waited until January to give it to my in-laws as an Anniversary present.  I waited too long to see how terrible the picture was and when I contacted Amazon all they would do was reiterate their return policy.  Anyway, the brightness of the screen fades in and out and the picture flickers while watching normal television or DVDs.  We have tried adjusting the settings and connections and it is clear that it is a defect in the television.  There are also white lines that run vertically across the entire television.  It's embarrassing that we gave this as a gift.  It's honestly not worth the price we paid on Black Friday - my in-laws can't even watch a full 30 minute TV show without the picture going out.", "Date": "February 7, 2011"}, {"Title": "Very good HDTV for the price!", "Author": "Alberto Severino", "ReviewID": "R3TCSE51BTMMO0", "Overall": "4.0", "Content": "Thinking on buying a new HDTV that price is not that high and provides you with full 1080p? Read on:First thing you care about when you unpack your new iSymphony 42 inches TV set is the looks; I have a 2009 manufactured Samsung 32\" 720p HDTV that looks mostly the same, design wise, as this TV, so, judging by the looks you won't be desapointed since it has a fresh design.It has plenty of connections, like two HDMI ports, A/V, Composite A/V, Auricular port, and more.The image quality is certainly better than my old 720p Samsung, which makes me happy with the 1080p upgrade. Inception looks stunning great on Blu-ray with this TV!The on screen menu is very intuitive and easy to set up. The options on it are mostly what you might need and expect from these LCD sets.Now, if we were to mention some details that are not especially great:1. The TV stand won't fit into a hole, instead, you will place it on a side of the TV attached with small screws, it will do the job, of course, but is recommended to pay extra $30 for a wall mount and you'll feel more secured.2. There is not an USB port, not even to make software upgrade. Make sure you get a Blu-ray player with USB enabled port for music, pictures and videos/movies, so you won't miss it here.3. The remote control looks, feels and, defenetely is cheap! Take good care of it.4. The default image graduation will make you think you wasted your money first time you get it on, altough after few adjustments you'll notice a difference.5. Deep and consistent black colors won't fully be found when watching a whole black screen as with others, like Samsung, but I find this way too minor detail after you immerse into the product.6. When turning on, loading time is about 10 seconds, you'd say nothing but after you get tired of the starting logo you will find this a bit, just a bit annoying. Maybe not, though.All in all, I give it 4 stars, all 6 complains I put here are the ones taking one star out. Now, if you have extra hundreds to give for a TV, go with what you know, Samsung, Sony or even LG, that way you won't miss some features this one misses.***Buying form Dominican Republic -- Comprando desde Republica Dominicana????????****Advertidos estan, y deben de saber que, al comprar un HDTV en Estados Unidos al llegar a Aduanas en Santo Domingo este sera retenido para coleccion de impuestos, un 56% de impuestos sobre el precio + manejo y libras a pagar a su compania de gestion. En este caso, cuando compre este iSymphony, lo hice en la oferta Black Friday y me salio por $300.00. Cuando Aduanas calculo los impuestos, al parecer, toma literalmente la factura de Amazon.com donde te pone el precio real (entonces 499.99) menos el Lighting Deal, la cuestion es que aduanas parece que sumo todos los numeros que habia ahi y me lo declaro en 950 dolares para cobrarme un impuesto de $500.00... Pueden imaginarse? de ahi re-envie la factura comercial + el estado de cuenta de la tarjeta sellado por el mismo banco donde se ve claro la fecha, el monto y el establecimiento por un total de $300.00 dolares, aun asi, lo que hicieron fue calcularme impuestos en base a $500.00 dolares... a final de cuentas miren lo que pague:HDTV - $300.00 (Amazon)Imp. Aduanas $275.00 (basados en $500, no en lo que pague)Manejo por envio $210.00TOTAL: $785.00 (RD$29,202.00)Ah! Y otra cosa, el TV estaba en Aduanas el 5 de Diciembre 2010, lo \"soltaron\" el 15 de Enero de 2011.En resumen... Yo, aunque igual pague por un TV de 42\" menos de lo que se paga en el pais, yo, no vuelvo a comprar TVs via internet, ya que Aduanas en Republica Dominicana es un, como buen dominicano, robo.Punto.Saludos!", "Date": "January 26, 2011"}, {"Title": "ok depending on what you paid", "Author": "Steve Gilbert", "ReviewID": "R14AM2XV8NS2FD", "Overall": "4.0", "Content": "Just arrived today. Based on my limited use thus far, I agree with many of the observations that Cart and others have reported.* The remote is definitely junk - wonder how long this will last. Also seem to experience annoying issue when changing channels as it seems to skip over some when pressing +/-. Not sure if I'm just pressing the key to long or if it's something else.* Audio isn't the greatest either, but not a big deal for me* Stand isn't the best - don't care much as I plan to mount to the wall* Tuner was not able to find all OTA channels as my Panasonic Viera 50\" Plasma* I noticed a slight loss of clarity during motion. Didn't seem to notice this compared to the plasma.I got this for $300 w/ free shipping both ways during black Friday sale. To me, not a bad deal for that price. Unsure if I would buy if I had to pay the pre-sale price of $400-$500", "Date": "November 30, 2010"}, {"Title": "no better than 4 years ago, its all about the monies", "Author": "MR Cart \"Cart\"", "ReviewID": "R1EYTEAY674YIF", "Overall": "5.0", "Content": "First off,  packaging is not much, the box was cheap and little protection.*the stands rubber feet had fallen off but lucky enough still able to stick them back on and hope they stay once they heat up.*This set runs HOT! much hotter than my other 42\" LCD.* seems there really is only 2 Hdmi ports, disappointing hopefully I can live with it.* appears that the composite input at the back is an OUTPUT! So just one input..* Remote is a light weight cheesey piece of junk* setup easy, and menu display is fine.*  does not seem to have a back light control on the menu just brightness..  not sure how much this matters.* back light bleed from all four corners, fine when the room is bright* the whites are good .overall for the money and as a second or backup TV it is fine. but for $400 or $500 there are better TVs out there.I have some concerns as to how long it will last, the Build does not scream quality, I had to remove bits of plastic still stuck along the edges, like those cheap kids toys. the stand is short and not adjustable in any way.The tuner found everything my other tuners are finding, but the menu options are very very limited, no BGY control and many other settings are just not there.Head to head to against a four year old Vizio, its close, my Vizio wins on blacks and the Isymphony on whites. The blacks the Symphony suck, there are scenes where details are completely lost. and in a dark room i think the light bleed is going to be a deal killer.I adjusted the picture using color filters with dvd essentials.I will update ..Two years later the TV still works fine  so have given another star", "Date": "November 29, 2010"}, {"Title": "iSymphony 42\" HDTV", "Author": "JAH", "ReviewID": "R1Y4LUYK6XG387", "Overall": "4.0", "Content": "Well, I've had this TV for almost two months now--and so far, so good. It works fine. The picture is good, not excellent, but good. The sound is not the best--even turned up 100% it's not that loud.We have all Plasma and LCDs in our house--all high-end, and this is the only low-end one-we put it in our basement gym room. However, the look of it is nice enough--and nobody has noticed that it's lower end.Overall, I am happy with my purchase and would recommend if you want a cheaper HDTV for your home.Oh, someone else posted this before, and it may be helpful to you:Contrast- 40, Brightness- 45, Color- 58, Sharpness- 40, Color Temp- Normal.  These are some good settings for this tv.I'm updating my review from December, 2010. It's now April, 2011, and the TV is still great, even better actually. The sound problem we thought we were having was actually with our cable box, it has a sound controller on it as well, and it was turned down completely. We learned that we turn the sound up 100% on the cable box, and the sound is perfect on the TV. We also haven't had any problems with the TV yet, and it continues to be one of our best purchases yet.", "Date": "January 18, 2011"}, {"Title": "Black friday's greatest buy!", "Author": "Mr.Lapa", "ReviewID": "R2PDF5QYZBSR8L", "Overall": "5.0", "Content": "Yes, this was my black friday's greatest buy, and the best... I didn't even had to stay in line during that cold night.The TV's image is comparable to my other LG led tv. The only con is the remote, but I don't really care since I use an universal remote control.This TV was going for less than 300 dollars, how can you beat it?", "Date": "December 11, 2010"}, {"Title": "Solid TV at a Great Price", "Author": "Chris Secrest", "ReviewID": "R1FUMNW0CSRF67", "Overall": "4.0", "Content": "As did most, I bought this TV on black friday for $298.  For that amount, the TV is a steal.First, some notes:  the tv is mounted (not on the stand--so I can't say anything about that), I have not tried the antenna at all (use HDMI for DirectTV), I upgraded from a 32\" Samsung 1080p 60Hz.When I first hooked the TV up, I turned on the DirectTV and it looked fantastic.  Our couch is about 14' away from the TV and the pictures looks amazing.  I've had no issues with ghosting or a 'smearing' picture.  The only flaw that I could see is some slight (very slight) leakage in the corners.  I could only notice this when watching at night with the lights off.I have a PS3 and the games and blu-ray look great.  No complaints at all.  I also have a Wii that I run with component cables to run it at 480p and it looks as good as a Wii can look.One thing that I have noticed is that if you switch inputs, the sound will sometimes jump somewhere in the 70's (out of 100).  It seems to happen when I hit the S-Video input (on accident).I haven't used any of the other video inputs or audio outputs.Overall, the TV works fantastic and I would recommended it to a friend.", "Date": "December 8, 2010"}, {"Title": "LUV IT!!!", "Author": "C-DOG", "ReviewID": "R2BXSJJ197N6XJ", "Overall": "5.0", "Content": "NEVER HEARD OF I-SYMPHONY BEFORE BUYING THIS TV BUT FOR THE PRICE AND GREAT REVIEWS IT WAS WELL WORTH THE MONEY.  I AM USING IT AS A 42\" INCH COMPUTER MONITOR WHICH IS PRETTY RIDICULOUS BUT THE PIC LOOKS GREAT.  HAVING 1080P FOR SUCH A MODEST PRICED TV IS GREAT.  WOULD HIGHLY RECOMMEND.  HOPEFULLY IT HOLDS UP ON THE LONG RUN.", "Date": "December 6, 2010"}, {"Title": "Great TV for for the Price I paid!", "Author": "Jason", "ReviewID": "R26USB5V7S3TFV", "Overall": "5.0", "Content": "I bought this TV on Black Friday for just under $300. For that price, this TV is very good. I bought it to replace an old 32\" tube TV in the bedroom. The picture is very good sitting or lying in bed. Up close it is not as good as the Sony Bravia 52\" I have in the living room, but at the price difference, it is expected. I mounted the TV on the wall about 5' up and it is very sturdy on the mount I bought locally.I had to run a video optimizer to get the brightness/contrast/etc set correctly, I used the THX Optimizer found on a DVD I own. The colors and brightness on this TV are very good after I adjusted them. I did not have the bright edge bleeding in the dark that others claimed after I made the adjustments I mentioned.The connectors are pointed down on the back of the TV which makes connecting new devices very easy when this TV is mounted on the wall. When I bought the TV they claimed 3 HDMI, but it only has 2, not an additonal one on the side, but that looks to have been fixed in the decription.Overall, I am very happy with this purchase. I do not have any complaints at all on the TV. I don't know how this complares to other TV's in the $450 price range, but for the $300 I paid, I don't think you can beat it.", "Date": "December 5, 2010"}, {"Title": "WOW", "Author": "Micheal Harris \"Keeper of the Dogtags\"", "ReviewID": "R1NUSYFS9DFTZ8", "Overall": "5.0", "Content": "Ok, for a black friday deal at 300 buckaroos this thing was a steal, no dead pixels, great sound, just enough hookups :)Cons- only 2 hdmi ports *not a huge con*, no side port hdmi like higher price LCD's.Well for a budget tv this exceeded every expectation that i had. Go amazon!", "Date": "December 2, 2010"}, {"Title": "UPDATE - Returned to Amazon Second Time.  Switching to Toshiba", "Author": "J. Swart \"GaPeach\"", "ReviewID": "R2TDN7ZH3WNOY5", "Overall": "2.0", "Content": "Update on Dec 31:  This TV was my first venture into LCD flatland. Initially, I was wowwed by the difference from my old SD big box (see below).  What hasn't been good for me is the color tones.  Over the past 3 weeks, I have tweaked the color every which way possible in an attempt to make flesh tones more natural and lessen the underlying redness.  This has been difficult because the \"tint\" bar is grayed out, meaning you have to get to tint through contrast, brightness, color, color temp, and picture mode.  I tried infinite combinations -- to no avail.  The other problem was this TV would lose over half the volume when playing DVD's, necessitating a setting close to 100, which then distorted the speakers and muffled the voices.  I have been living with these problems because the price was so good, and I didn't reasonably know what to expect from the technology.  Finally, the problems bothered me enough to try to improve the situation.  I ordered a 46\" toshiba, which arrived yesterday.  Straight out of the box, the colors were right-on.  The sound was more than sufficient during DVD play.  The stand is much more substantial.  There are several more inputs.  While both of these TV's are supposed to be 1080, the difference in pictures is striking.  The Toshiba makes the iSymphony look like a 720 or less.  I'm keeping the Toshiba and returning the iSymphony.  True, the Toshiba will cost more upfront, but I'm thinking it will save money in the long run.  It's a TV I can keep for a long time and be satisfied with.  Plus, if I need customer service or warranty work, I'm confident I can get it.  I did not have that same confidence with the iSymphony.  Most importantly, I have a picture I can truly enjoy now.Original Review:  Also bought for $298 on Black Friday.  Arrived the following Tuesday.  Set up was easy, but the tv powered up with multiple horizontal black lines running across the screen, no matter the channel.  They look like \"dead rows\" to me.  Contacted Amazon returns and they arranged for a UPS pickup.  Question now is whether I can get the  replacement at the BF price.  Have to call a \"special number\" tomorrow and ask for the $298 price, since it now is selling at $449.  Wish me luck.Update on December 4:  Good news! Old tv is gone, and new tv is here, in record time.  Amazon even called my home to ask how the swap out went.  New tv is awesome!  This is our first flat panel LCD, so I do not have a Sony, Vizio, LG, Sharp, etc. to compare it against.  We are very, very pleased with the improvement.  TV watching has come alive.  Colors are beautiful.  Sound is much better than our \"big box.\"  We did do some adjusting to the picture (turned down contrast) using some of the suggestions made.  There is some variation in picture quality from channel to channel, which I attribute to inconsistencies in broadcasting.  Some channels fit the whole screen, and some don't.  Am learning the 16:9 world .. been stuck in 4:3 til now.", "Date": "December 1, 2010"}, {"Title": "NIGHTMARE", "Author": "Disappointed", "ReviewID": "RT9WED2QRN5KD", "Overall": "1.0", "Content": "I bought this item as a gift for my husband, and he was so excited to open it, only to learn that the screen had a purple line from top to bottom that divided the screen. I contacted the manufacturer who after giving me the run around with the warranty company for 4 weeks, advised me, I would need to return the item and pay the shipping cost and that once they recieved it they would decide wether to fix it or repair it and to make that decision it would take 2-4 weeks after they have been told by the service center the TV cannot be repaired. Needless to say I would never purchase another isymphony product or recommend their brand.", "Date": "July 28, 2011"}, {"Title": "Best cheap TV I have ever bought", "Author": "Christopher R. Noblett \"cknobman\"", "ReviewID": "RAJ8CDM68S7HJ", "Overall": "5.0", "Content": "I picked this up for $299 at Amazon on black friday and have been one happy camper ever since.The TV was a breeze to setup and came in a very well packed box.It may not be the thinnest LCD out there with the absolutely highest picture quality but I did not buy a budget TV expecting those things either. To get the most out of this TV's picture quality you will most certainly need to calibrate it and DO NOT USE DEFAULT PICTURE SETTINGS.  After some mild adjustments the picture quality is quite nice and when given a 720p or 1080p source to display the picture looks very good.Ive owned this unit for over 4 months now and have never had a single issue with it.", "Date": "May 5, 2011"}, {"Title": "great TV!", "Author": "onionz", "ReviewID": "R13UHXGH19TAE3", "Overall": "4.0", "Content": "This TV is well worth the $330 I paid for it on a gold box deal. It is an excellent TV and I do not see any problems the others are complaining about. ITs a TV that works! The light/dark contrast is great. The sound is great. What more do u want? Highly recommended.", "Date": "March 3, 2011"}, {"Title": "BAD HD tuner!", "Author": "Ioan Ghip \"ioan\"", "ReviewID": "RL7JTQP96I0TH", "Overall": "2.0", "Content": "If you want to use your TV with over the air channels or with HD channels from your basic cable, do not buy this TV. Sometimes takes 30-40 seconds to change a channel if the channels are HD, and sometimes the tuner just gets stuck and you have to turn the tv off and on again to make it work. I also have a Roku connected to one of the HDMI ports... Roku panel (where all the channels are) is in 720p, and if you want to watch something that is 1080p on roku, the tv will go black and you only hear the sound... again, just a turn off-turn on will fix this.I'm returning this TV just because of the tuner.", "Date": "February 28, 2011"}, {"Title": "Awesome TV, Phenomenal Deal!", "Author": "Kayla Reno", "ReviewID": "R1X8O9JFHT5KIY", "Overall": "5.0", "Content": "I bought this TV about a week and a half ago, and just received it today. After setting it up and connecting cables, I turned it on for the first time. I will admit to being a bit skeptical, especially after having seen the not-so-good reviews that some reviewers have posted. I was completely surprised, both by the quality of the TV itself, as well as by the picture. My parents purchased a 46\" Samsung TV during Christmas, and the picture on the iSymphony is comparable, if not just as good.The remote DOES have a cheap feel to it, but that doesn't make much of a difference, since I have TiVo and use that remote anyway. (For those who can't find remote codes for TiVo, the Samsung code 0305 works.) I am completely satisfied with my purchase, and, having got it for $339.99, I can say that this is the best deal that I could have gotten for the price.", "Date": "February 17, 2011"}, {"Title": "This lcd has nothing to envy!!", "Author": "allaces305", "ReviewID": "R3KOMMJ4ZSFAH8", "Overall": "4.0", "Content": "Fist off the price is amazing! $339 for 42\". By the way that includes shipping! O.k. fine the lcd does have its down falls like some bleed from the corners,but it's only noticeable when the corners are black and in a dark room. other than that picture looks great! With a little tweeking of the colors like mentioned in prior reviews this lcd has nothing to envy!! Went to the local Walmart and every lcd with these specs was $200 more and i could not see a noticeable difference. The remote control is just fine specially if you are going to use the Direct TV or Dish Network as your main one. The menu is clean and simple, it's a no frills lcd. Just great picture quality at a good price. When put to an HD source the picture is second to none. Amazon does it again.", "Date": "February 17, 2011"}, {"Title": "Decent", "Author": "Point", "ReviewID": "R1SR10UNIH5VNQ", "Overall": "4.0", "Content": "Excellent deal for the $339 I paid..  good picture after a bit of tweaking, stand is a bit weak, but adequate, but I am wall mounting anyways so not a big deal. Only complaint is slow start up time, takes about 15 seconds from pushing the power button before it displays the HDMI source, and the remote feels incredibly cheap. Great picture, great price, happy here...", "Date": "February 16, 2011"}, {"Title": "You get what you pay for.", "Author": "G-Squared", "ReviewID": "RE74E3HPM4P97", "Overall": "1.0", "Content": "I received the TV today.  It was packed nicely.  Set up was not bad but the stand and bolts seemed very unstable.  The bolts are tiny for a 50lb. tv.  The protective cover was held on using masking tape.  The serial number sticker was almost peeled off as well.  It definitely did not look brand new even though it was supposed to be.  Upon turning on for the first time, there was a huge \"burn-in\" white spot in the middle of the tv.  When the picture is all black, it looks like a cloud of smoke burnt into the screen.  It's quite disappointing. Now I have to lug the tv to a UPS location in hopes that I can get my money back in a month.  Lesson learned.", "Date": "February 15, 2011"}, {"Title": "A very nice buy for my parents", "Author": "jag", "ReviewID": "R2LTLGYW47GGG", "Overall": "4.0", "Content": "I bought this Black Friday 2010.  For $298 and no reviews to base this on, I knew I was gambling.  Minus 1-star: I didn't like the stand because it requires to screw the tv on the base, but with a little help from my dad, we were able to get it done.  It said PC compatible (one of the main reason i bought it) to upgrade my parent's 24\" to this.  They didn't like sitting on the chair, but this setup enabled them to sit on the couch.  Hooked it up by HDMI and got a wireless keyboard with built in track ball.  Parents love it.  I've never seen my mom indepedent on the computer.  She's now checking e-mail and watching shows streaming online and all sorts of stuff I usually babysit her with.  This was a great investment.  $298 was well worth it.  I'm glad I took that gamble.  My sister did notice that you'll need to turn on the computer first before the tv to get the 1080p HD resolution.  I'm not too bothered by it.", "Date": "February 10, 2011"}, {"Title": "Great picture but...", "Author": "P. Rigatti \"~RiGz~\"", "ReviewID": "R2BIX0HZZXLIEH", "Overall": "4.0", "Content": "I am very happy with the picture on the TV and how it looks but it didn't come with the washers it was supposed to come with for the stand and because of that the TV almost fell over and broke. It is a good thing I was right there ti catch the TV and it was a good thing I had washers small enough for the holes on the stand. Overall I am happy with the purchase just a little mad they didn't include what they said they would.", "Date": "January 17, 2011"}, {"Title": "Good price for the product", "Author": "jrheil", "ReviewID": "R2G54092XCNYTS", "Overall": "3.0", "Content": "I initially thought that this TV had 120Hz, but it only has 60Hz, but nonetheless it seems to be a good product for the price. The 1080p picture is sharp and clear. There are two downsides, one being the slower start up to get the picture because of 60 Hz, and the other being that setup is not on the back side, but instead on the back underneath. That is negative because you must hook everything up before setting the TV in its place. If you want to add chords later you will also have to move the TV to the side and look from underneath the TV to see what and where the chords must be plugged into. If I had to do it over again, I would not have bought this brand but instead bought the same size VIZIO TV at Sams Club for just $40 more, but with 120Hz.", "Date": "January 1, 2011"}, {"Title": "Overall Good Deal", "Author": "David Allen \"@DWAinFL\"", "ReviewID": "R2V31C4N1F285R", "Overall": "4.0", "Content": "I purchased this on black friday ($298) as a Christmas gift.  I was a bit worried by a few of the reviews, but the TV is fine for the price paid.  Not sure if I'd pay the current amazon price ($499).  The color and sound are fine and no problems with setup or accessories.  It receives over the air signal fine and hooked it up to a blu-ray and got a good 1080p picture.  If it goes on sale again I'd buy one for the bedroom without hesitation.", "Date": "December 30, 2010"}, {"Title": "Nice TV, but has a few issues", "Author": "J. Schware", "ReviewID": "R2SNVZLCFES3IY", "Overall": "4.0", "Content": "TV has an excellent picture and all the basics you'd expect (and maybe a few more).  We did, however, run into a few issues:1)  The speakers on the TV aren't that strong - the audio is acceptable, not great2)  The TV seems to run into trouble if a digital channel that it previously found is no longer there.  It will lock up for about a minute as you are changing channels as it tries to find the station, and during this time it will not allow you to move on.Bottom line...as an under $300 42\" 1080p TV (on a timed special on Amazon), this was a great deal to us as we were realistic about what to expect.  I don't know if I'd be as happy with it if we had paid regular price.Update (10/2012)....We've now had the TV for about two years and it's still performing well.  We are now using a cable box provided by our Cable Company, so the 2nd issue above is no longer a factor.  I guess we've gotten used to the audio too, as that doesn't really bother us anymore.  We have the TV in a large room, and the volume is more than sufficient unless the vacuum cleaner is in use!The only other thing we have noticed is that the TV does run noticeably hot when it is left on for a while.  Certainly not hot enough to be a fire hazard or burn you if you touch it, but it is noticeable when you are within a couple feet of the back of the TV.All in all, no regrets on this purchase so far!", "Date": "December 28, 2010"}, {"Title": "This TV is legit", "Author": "C. Brandt", "ReviewID": "RSFF7B2F1TY8Z", "Overall": "4.0", "Content": "First off, I'm not an expert on TVs, so I won't go into too much technical detail, as other reviewers have done that, and i've found that the functional descriptions regarding the input connections, stand quality and bulkiness of the TV are accurate.  I'm also using it on the stand, and am not wall mounting it, so I can't comment there either.A 42\" 1080P LCD for $298.  At that price, this TV just needed to turn on to get your money's worth (you know what I mean).  Other reviews are hit and miss with regard to problems right out of the box (amazon's return program is very easy) ... mine was problem free.  The picture quality isn't as good as my 42\" Philips, but I paid $1,100 for that a few years ago.  At $298, I accepted a TV that didn't have the best picture quality around, however the quality is still very good.  If this TV was regularly priced at $298, I would give it 5 stars .. but at $449, I'm only going to give it 4.So for those of you who are on the fence about buying a cheap, non-vetted brand, I'll add my vote to the satisfied column and say my wife and I are both VERY satisfied with this TV.  Depending on various sales at various times of the year, paying $449 for this TV would still be worth it.  My only concern is the 'Test of Time' as this is a newer brand.  Like several others, I will buy an extended Squaretrade warranty and not worry too much about it.  If I do encounter problems, I'll update my review to reflect that.  Hope this helps.", "Date": "December 8, 2010"}, {"Title": "Good Value LCD", "Author": "C. Williamson \"Snowbum\"", "ReviewID": "R2D48ONV899HU0", "Overall": "4.0", "Content": "This is my 8th LCD/Plamsa that I have between 2 homes.  I have a 2 Panasonic 720p plasmas, 3 Sharp 32\" LCD/DVD combos, 1 Toshiba 1080p 32\" LCD, 1 iSypmphonic 24\" 1080p LCD (lighting product as well), and now a 42\" iSymphony 1080p LCD.  I spent $1800.00 on my 50\" Panasonic Plasma about 3 years ago and things are really getting inexpensive today.Im a Panasonic fan, for the most part, and believe in good quality technology.  I was looking to shed the 32\" Titanic Sony WEGA from the bedroom and figured I'd give this product a shot and I was a little sceptical about the brand name.  This is not top quality hardware and isnt built like my Panasonic's or Sharps but I knew that going into the purchase.Out of the box--easy to set up and configure and within 10 minutes I was up and running.  The remote is not well built but I put the code in my Comcast and Im good to go.  I'm not running HD on this 42\" until this weekend but my first impressions is its not bad.  I watched a Pickers and the Jets/Patriots game last and it was what I expected running in SD, which was plenty acceptable. No lip sync issues at all.  Im sure when Comcast installs my HD box on Saturday, it will improve quite a bit.  The sound isnt bad at all and I put it on surround.  If I wasnt upgrading everything in the house to HD (Comcast converting 2 SD boxes to HD boxes), I'd probably stick with my tube TV.  Watching SD on any LCD, LED, or Plasma isnt bad (not the greatest) but once you get the taste of HD, its tough to go backwards.  If your upgrading about 32\" on any LCD/LED/Plasma---you should be running HD on it.  Above 32\" and not running HD, you notice a lot more of the tracing and refresh.  Im tied to the LCD/Plasma industry with my work so I have a pretty good understanding of flat panel technology.  This LCD falls into pure value and bang for the buck.For $298.00, value,  and putting it in a bedroom, I give it a 4 STAR rating.  I probably wouldnt purchase it at the $449.00 price its at today--I'd go get another 42\" Pansonic LCD or plasma or drop to a 32\" LED for around the same price.  The $149.00 price I got on the 24\" 1080p makes both purchases good value.  I wouldnt say its for \"poor people\" as described in another review but I describe my 2 iSypmphony LCD purchase as buying a 42\" LCD and getting the 24\" for free.  Two for $449.00 and thats what you would pay today for this 42\" LCD.", "Date": "December 7, 2010"}, {"Title": "This Stinks!", "Author": "Mark", "ReviewID": "R2N9J8D3BL1K0O", "Overall": "1.0", "Content": "We bought this tv on Black Friday. We needed 2 but were only able to get 1. I also bought a 42\" Hanspree from Buy.com. That tv was 120hz and had a ton more options, connections and blew this tv away in picture quality. I wish after comparing the two I never got the ISymphony and instead bought 2 of the Hansprees. That tv was also only $80 more then the ISymphony. COMPLETELY WORTH THE DIFFERENCE. This tv is junk. But for $300, What do you expect?", "Date": "January 5, 2011"}, {"Title": "Good buy so far", "Author": "Kirk", "ReviewID": "R3C4NYQMT9YT5J", "Overall": "4.0", "Content": "Pro's:-Cost: $298 shipped.-Good sound range: Sound does not drop off dramatically or distort much from 1-100.-Great Picture: Almost as sharp and clear as my Samsung.-No lag while channel surfing.-Easy to navigate menus.Con's(minor):-No third HDMI input as it was advertised.-Tight space for back input panel.  Inputs point down instead of out.-Daylight Savings setting doesn't work on mine.", "Date": "November 30, 2010"}, {"Title": "Cheap price is NOT worth the risk", "Author": "SMR", "ReviewID": "RVPGFQF063AWY", "Overall": "1.0", "Content": "I purchased this television because it was less expensive than the main brand models and it seemed to have decent reviews. They also said there was a warranty and customer service, so I took the risk figuring at worst I could call for help.Bad. Choice.The television is pretty good. I actually really liked it for the little time I had it. There were three weird colored lines, though, from the moment I turned it on. This is probably because the packaging around the TV was nearly nothing. I promptly called to exchange it. The woman who answered was snappy and reluctantly said the returns office would email me. SEVERAL days later, I got an email saying I could exchange it, but I would have to pay the shipping costs, and if it was damaged in the process it was on me. With the shipping cost added in, I could have bought one of the main brand TV's, and maybe a small surround-sound system.It has been almost a month and I still don't have the tv back. All I have are some unhelpful emails, written with the grammar skills of an elementary student who thought they could get away with copying and pasting information to make an argument.Honestly, I'd say I'm a pretty patient person; I'd like to give the benefit of the doubt, but this is just unprofessional. Don't buy these TV's.", "Date": "May 6, 2011"}, {"Title": "WAREHOUSE DEALS", "Author": "jennjust1969", "ReviewID": "R3GHJ7VJC92AQM", "Overall": "1.0", "Content": "Warehouse Deals I am very angry I have been searching for a televsion for quite some time now I received my 42 in L C D televsion  iSYMPHONY today, when opening the package there were very little styrofome in box along with plenty of movement on sides and front of televsion that was not secured nor safe from being damaged shipped from WAREHPOUSE DEALS, also the box was damaged, I do not know if it were caused at WAREHOUSE DEALS or factory or while it were being shipped through U P S for the tv to be damaged.  My fiance is a truck driver and says the box needed to be more secure with no movement at all the packaging was very crappy not securingour television at all. When receiving our product we had to go to the hard ware store to buy screws for the stand even though all pieces were to be included, after putting it together and waisting a hour of our time and gas in our car, we placed it on our entertainment center plugged it in and no volume it had appeared to be broken for it looked like cracked glass  I had also taken out additional warrenty through square trade and since it were damaged befor arriving to my home they too refuse to fix it. There for I have to wait until Saturday and today is thursday befor I can send this back for there is no U P S close to my home and this is when they will be in my area. I am not very positive I will be dealing with any of these companies ever again.. I thought when you purchased a warrenty it would be fixed especially not being capable to view our new tv. I feel like we had been taken advantage of. Even though Amazon gave me 25 dollars toward my next purchase I am still not a happy customer..iSymphony LC42iF56 42-Inch 1080p LCD HDTV, Black", "Date": "March 3, 2011"}, {"Title": "Cheap TV you get what you pay for.", "Author": "NJChris \"njchrisx\"", "ReviewID": "RKSZUX3D9V2XS", "Overall": "1.0", "Content": "First off 3 of the 4 screws do not screw into the base to hold the tv up. Second you can not adjust the color. Even when trying colors go back to the muttled muddy look. Not sharp. Spend the extra cash.", "Date": "February 28, 2011"}, {"Title": "Unbeatable Deal when Purchased (2010)", "Author": "Swan313 \"Fitness and Health\"", "ReviewID": "R2K00AL7T46I81", "Overall": "5.0", "Content": "I purchased this TV on sale for a friend. Really good TV came just in time for the playoffs. Fantastic Deal, can't remember if it was a lightning deal or not but for the price I would definitely have bought another one at time of initial purchase. Still serving him well to this day with no complaints. Which is good because I was originally concerned with the quality of the brand as I was unfamiliar with it.", "Date": "January 1, 2014"}, {"Title": "SLOW... not recommended for switching between channels", "Author": "Naomi Bond", "ReviewID": "R3GRBMDNXB8IM5", "Overall": "3.0", "Content": "This is a great TV if you are going to use it for streaming videos from a computer or if you are only keeping it on one station for cable.  The processor is super slow, though so changing channels takes a ridiculously long amount of time.  It takes upwards of 5 seconds per station, so if you are browsing through, it takes 30 seconds to switch between 6 stations.  Thankfully we mostly stream through Prime and Hulu.  Otherwise it has held up great for the 3 years that we've had it.", "Date": "December 4, 2013"}, {"Title": "Great deal for the price but doesn't last :(", "Author": "Sarah", "ReviewID": "RILBFOE3OI8UC", "Overall": "3.0", "Content": "My husband and I bought this TV while it was in the Black Friday flash deals in 2010 and we were beyond excited when it arrived. Easy enough to set up, great picture, etc. We were disappointed in the sound though- when watching anything on demand or a DVD we could barely hear a thing even with the volume maxed out. We solved that problem when we upgraded to a blue ray system with speakers we could use with the TV as well.About two years after loving the TV and having minimal problems with it, the remote just stopped working. No amount of replacement batteries would bring it back to life. We found it incredibly difficult and expensive to find a replacement or universal remote which would work with it for less than $50. We decided to not be lazy and instead forgo the remote.It's now almost three years since we bought the TV and the sound just stopped working. I tried everything. The picture is still fine- but the TV won't even send sound through the speakers we have synched through the blue ray player. I'm totally bummed. I haven't found an appliance place near me that has even heard of the brand, and to try to fix it will cost as much as the TV cost us when we bought it, at the least.So basically- this is a great TV if you can get it while it's on crazy awesome Black Friday sale. I was hoping to have it for a lot longer than this, but it seems that we may have to suck it up and shell out for a new one soon. We bought it while we were trying to save for our wedding, and it's a great deal for the money. Just difficult to find replacement parts for sure. We will probably go with a more well-known brand next time around. It's worth the extra money if it will last more than 3 years and can be fixed if something goes wrong.", "Date": "October 18, 2013"}, {"Title": "nice", "Author": "sandy", "ReviewID": "R2BR5BVSWDNX9C", "Overall": "4.0", "Content": "this is a nice tv but kind of a hassle it didn't come with the remote or power cord. very strange. it took along time to get these issues taken care of", "Date": "July 12, 2013"}, {"Title": "scary but good", "Author": "Zoel Krieger", "ReviewID": "R2RVBYL83WHU77", "Overall": "5.0", "Content": "always afraid of buying a no-brand, but this one turned out great. i love the screen. like all thin led TVs the speakers suck. mine is hooked up to a home entertainment system, so we just use that instead.", "Date": "June 30, 2013"}, {"Title": "Worked for just over a year-you get what you pay for", "Author": "T. Wyman \"taowyman\"", "ReviewID": "R1K19RPWAICHQU", "Overall": "3.0", "Content": "Bought this Black Friday 2010 and turned it on for the first time 12/25/2010, well today the screen died.  The T.V is just over a year old, how sad!  While it was working, it was ok, the picture quality was fine and the sound quality was lacking.  The T.V I had previously was over 15 years old and still working when we \"upgraded\" to this one.  Oh well, I just it is true what they say, you get what you pay for!", "Date": "March 28, 2012"}, {"Title": "outstanding value for 330 dollars", "Author": "abp", "ReviewID": "R90BNCTM26OMW", "Overall": "5.0", "Content": "I cannot say how this compares in quality or features to other 42 inch LCD TV's.  However, to date I have still not observed anything close in value.  I am extremely satisfied with my purchase.", "Date": "October 22, 2011"}, {"Title": "Owen this item", "Author": "Ronald Gerard", "ReviewID": "R2OWCAERMO6IQ7", "Overall": "5.0", "Content": "Excellent HDTV  has great features 1080 p and many more can be use as a monitor for your computer with a wireless key board and mouse, can use a camcorder for tapeing and watching,can be used with VHS, DVD and other hookups.", "Date": "October 9, 2011"}, {"Title": "Value", "Author": "Ricardo Cordero", "ReviewID": "R16KZP1WO8BR6S", "Overall": "5.0", "Content": "Great tv for the the price. I was happy with it came. I was very well packed and works. I have waited a few months before reviewing to see if I had any problems. Nothing. I am in college and this makes for a great dorm tv. I don't think i would use this in my living room but as a bedroom tv it works perfect.", "Date": "August 18, 2011"}, {"Title": "Great for the price", "Author": "Toku", "ReviewID": "R21S8EU62EVP24", "Overall": "4.0", "Content": "I bought this TV when it was on sale during Black Friday last year, and for the price of $298, I couldn't be happier with it. If I had one complaint on this product, It would have to be the volume. To me at least you have to make the volume go all the way up to get decent sound levels, which is why I ended up buying speakers to use with the TV instead. Other than the volume, I have run into no technical difficulties or bad experiences with this TV, and would consider it to be one of my better sale buys.", "Date": "July 1, 2011"}, {"Title": "Great TV so far...", "Author": "C0D3", "ReviewID": "R3ERN1482I7XXA", "Overall": "5.0", "Content": "Like a lot of others, I got this on black friday. I wanted to replace the 32\" in my bedroom with something a bit larger and it was so nice because I'd gone out shopping and tried to get a Walmart or Best Buy deal earlier and they were all gone...I got back home, having not shopped at amazon for quite some time and decided to give them a look and grabbed this deal along with the 32 inch for my mom to bring her into the 16:9 world.  I also bought the mounting bracket for around 25$. The TV was well packed, and I pulled it out, laid it flat, hooked up a video source, power and checked it out. Mounted the bracket, mounted the TV and it took me about an hour (I don't do this type of stuff much so I thought that was pretty quick).I use my XBox as the primary video source and sometimes use a laptop, so inputs aren't much of a concern to me and for the price, I definately can't complain.  The video is nice, I don't notice any blurring when I play games (granted I don't play FPS on consoles but with games like SFIV, ACB, Prototype, Kinect Sports and Fable2/3 it looks very nice.  Watching netflix and hulu on it is great.over 6 months later and I still love the TV.", "Date": "June 29, 2011"}, {"Title": "My iSymphony LC42iF56 experience", "Author": "ko585", "ReviewID": "R271Q5PU8ZPF00", "Overall": "4.0", "Content": "picked up this HDTV from a guy who buys a few items on Black Friday then lists them on craigslist and tries to make a few bucks on them. Nothing wrong with that! I gave him $420 for it. Still in the box, packed perfectly. There were some 2nd hand on the craigslist, yr or so old, brand name 42s for $400, or a 40 for $350, but I went the extra $20 and went with the box. I didnt want to put a lot of money into this since I was just getting it to hang out on the patio, since Im out there so much anyway. What the hell!The deal took place on thurs jun 16 @ 10:30a at the massive shopping center NE of the city. A place reminiscent of a vibrant consumer mecca, today however, with the many empty storefronts, a reflection of something dying and decaying. After he carefully checked the hundreds for counterfeit, the transport from his vehicle to mine took place. I could clearly see the box had never been opened so in my judgement, there was no reason to open it to see if the merchandise was present. After a brief conversation we both got into our respective vehicles and departed.Upon arriving home with the product, a bit of a struggle to remove it from the back seat was experienced. From there it all went pretty easy. I had an idea what I needed as far as a mounting bracket, and the instruction indicated using 8M x 12mm screws. My first stop was the Home Depot. Depot didnt have what I was looking for nor did they have the screws. But a very cordial and helpful employee instructed me to check the Best Hardware a couple miles up th road. Bingo! Best had the screws and an L shaped bracket that was maleable enough, yet strong enough to hold the unit, that I could bend them into the position I needed. I found a couple of washers to fit the screws and securely tightened the brackets in place with a socket/wratchet set and I was set to hang the unit on the patio enclosure structure. Again, a bit of a struggle at this point since I have an aging injured shoulder and lifting the 50 lbs overhead is difficult. I have to admit the unit looked pretty nice hanging up there. I had covered the patio structure wall with plastic to keep the moisture out before hanging it, and Im going to tie a rainproof tarp on to the othe side of the structure. The next day, the cable company sent a tech over and got a coax run over to the unit's location.At this juncture, the unit is plugged in, the signal reception cable is in and fastened, the batteries are in the remote, and its just a matter of pushing the power button now. Presto! it works! The HD went into scan - and it was as simple as that. Veery easy! Very easy installation and setup. No complaints! The picture? As far as Im concerned - beautiful! perfect! The remote? one of the easiest remotes I've ever worked with. I didnt change anything on the menu. I didnt see a reason to. It's perfect! The picture and sound are very nice, fantastic!  I did notice the screen did get hot. Considering this is a Black Friday special piece of merchandise, manufactured cheap to be sold cheap on that day - thats ok. I didnt put a lot into this cheap indoor HDTV to be used outdoor under a covered patio project, and basically Im hoping to get a couple of years out of it. Today, however, Im exceedingly pleased.", "Date": "June 18, 2011"}, {"Title": "Hey It Works For Me", "Author": "terrance", "ReviewID": "R30O2KQ2WHKUEI", "Overall": "4.0", "Content": "I bought this tv about 6 months ago. Works just fine so far. It comes with a stand or you can mount it, I got it on the wall no problems. My 32\" Magnavoxs' power supply went out so I bought this one. At $339.99 with free shipping it was a great deal for me. HaHaaaaaaa I'm so time sensitive wit it!*Tip* - If you want great deals, check out those time sensitive deal websites.", "Date": "June 2, 2011"}, {"Title": "Much better than expected.", "Author": "SD", "ReviewID": "R3EZUHEXD0NQVC", "Overall": "4.0", "Content": "I didn't expect much at this price level but I was pleasantly surprised at the picture quality and just overall quality of this TV.  Great picture quality even at high contrast levels.  I had never heard of iSymphony before but now that I own one, I would rank this up there with Vizio and LG. It's no Sony or Samsung but at this price, it's a bargain.  The remote control is very lightweight and doesn't have the heft and quality feel of other remotes.", "Date": "April 14, 2011"}, {"Title": "Great deal at $330", "Author": "Chris W. Weatherford", "ReviewID": "RJZ4753O62BJM", "Overall": "4.0", "Content": "Not a perfect TV, but can't be beat when you get 42 inches on sale for $330 shipped. We are very happy with it.  Like others have said, there is some light that \"bleeds\" in the corners, but I don't notice it when watching anything, even dark scenes.  I only see it when the TV is on and there's nothing but black picture.The TV looks great.  The picture is very nice.  The remote is very cheap.  But when you can get a leaning remote for $20 bucks, who cares? Mine has one dead pixel.  I never see it unless I'm looking for it.If the TV lasts 3 years, I'll be completely satisfied with the purchase.", "Date": "April 10, 2011"}, {"Title": "Got What I Wanted", "Author": "Watts", "ReviewID": "RVWSO4A9XLTYQ", "Overall": "5.0", "Content": "I was looking for an upgrade from a 20\" TV from 2002. Main concern for me was screen size, and this was the best option at the time w/ no holidays or deals around the time of purchase. Not sure what all of the bad reviews are about, this thing rules on a college budget! I will say this though, those guys talking about a poor stand design hit the nail on the head, DO NOT move this TV around frequently if you decide to have it on the stand it comes with. There is also some truth to the comments about motion blur issues and dark movie scenes being hard to view, but they are not really that bad, and aside from that I think this TV is a great choice.", "Date": "March 30, 2011"}, {"Title": "Excellent TV", "Author": "Brian Noel", "ReviewID": "R278AWSEA5M9R8", "Overall": "4.0", "Content": "This is my first high-def tv. I wasn't expecting much since I got it for such a low price. I have to say I've been very impressed. Good picture, good sound, easy to use. It doesn't have a lot of \"bells and whistles\" but the tv is nice.  With a little help from Dish, I even found a code for my dish remote! The only negative I can give is that it takes a little time for the picture to come on when the unit is first powered on.  Overall, a very good television. Time will tell how well it last!", "Date": "March 21, 2011"}, {"Title": "Better Than I Expected", "Author": "thomas730", "ReviewID": "R232EZ57RP9QJ8", "Overall": "3.0", "Content": "I was a little weary of this TV because of the brand but so far so good if you want a basic HDTV.  It works fine and shows a  decent picture but the stand and remote are really made cheap.  I paid 345.00 which I consider a great deal.  The picture is decent and I'm using my hdtv cable box.  overall I'm satisfied.Con:  what's up with only 2 HDMI ports?  I wish I knew how to bypass seeing the company logo each time I turn it on.........", "Date": "March 17, 2011"}, {"Title": "Great TV, great price", "Author": "Leslie Telesford", "ReviewID": "RU8N82CHX05GH", "Overall": "5.0", "Content": "This TV has all the great features of any of the popular brands, minus the price tag. Installing the stand was quick and easy, along with the general setup. Picture quality is very good, displaying vibrant colors even without an HD cable box connected. The sound is more than sufficient, considering I have not connected the TV to a receiver or home theater. You are simply not going to find a better TV for the price, I am very happy with my purchase.", "Date": "March 16, 2011"}, {"Title": "Cheap 1080p Tv", "Author": "Sarah Belleau", "ReviewID": "R3KD6CS3TPIRVH", "Overall": "4.0", "Content": "Got this tv for $330 shipped. Perfect for kids bedroom for playing on the Wii.Pros.Good pictureCheapWorksCons.Had one dead pixel but is not a problem.Power consumption is high compared to same size tvs.", "Date": "March 15, 2011"}, {"Title": "Fantastic bargain", "Author": "Mike in W.C. \"Woodworker\"", "ReviewID": "R1YTX0L841GGQ7", "Overall": "4.0", "Content": "This was a Amazon Gold Box deal and was it was an amazing value.  I was looking for an inexpensive TV for a new shop I built.  It was perfect for that use.  I have a Samsung plasma TV in the family room and there is definitely a difference in picture quality, but the iSymphony is really pretty good.  The sound is not great but seems pretty good too.The only down side that I have found is that the TV generates quite a bit of heat.  It does not seem to be energy star rated.  I think it will take a long time for the energy cost to equal the price saving.", "Date": "March 15, 2011"}, {"Title": "Excellent entry lvl hdtv", "Author": "technological nut", "ReviewID": "RX2VOBBJAU8MD", "Overall": "4.0", "Content": "Title says it all.  you cannot ask for more in features, sound, and video for this price point. if your late to the hdtv party, this is not a bad deal.", "Date": "March 15, 2011"}, {"Title": "Decent Picture, BAD sound.", "Author": "mozbrooklyn", "ReviewID": "RSY9N9UV7DVAB", "Overall": "4.0", "Content": "For what I paid, this TV is great. As many other mentioned, it's not going to climb a mountain for you, but it will give a great picture, especially in HD. The remote is a little flimsy and probably won't last forever. The screen seems a bit more touchy than most LCDs, but I don't mind, just had to remind the 4 yr old to keep her hands off the screen. It's been about a week and everything is running smoothly.My only complaint is that the speakers are HORRIBLE. I had to turn the bass down so it wouldn't do a weird rattle thing. When things get too loud it sounds like someone is talking through an old transistor radio. I have a surround sound connected, so it didn't really affect me that much, but for someone without, you will NOT be happy if your unit comes with sound like that.Edit: Almost a year later, the TV still works. It has dimmed significantly though. It also was easily screen-burned by the \"letterbox\" on some channels. Still running though, not a horrible TV yet.", "Date": "March 14, 2011"}, {"Title": "Great TV for low price", "Author": "Nicholas Marowsky", "ReviewID": "R2GAF1I9THPFBY", "Overall": "4.0", "Content": "Although a little on the bulky side this TV has been great. Could ask for more ports on the back and for a flat screen TV it is really heavy. However the picture is great and I have not had any problems with it at all after about a month. I would absolutely recommend this model to anyone looking for a good cheap HDTV.", "Date": "March 10, 2011"}, {"Title": "Very happy with ISymphony 42 inch", "Author": "Richard S. Bradbury", "ReviewID": "R1TXC9U0JSGFA8", "Overall": "5.0", "Content": "I purchased this item when it was on sale , I could not find a 42 inch TV with no taxes and free delivery that came within $100 of the cost . I had my doubts ! When I received the ISymphony was I surprised . Delivery was very fast ,packaging was excellent for an item like this but my biggest surprise was the ease of set up , the good looks of the product and most of all the quality of the picture . Have been using it for almost 60 days and have no complaints only praise.", "Date": "March 7, 2011"}, {"Title": "Great TV if you get a good one.", "Author": "Emanuel", "ReviewID": "R14YBYPQ8CF7RM", "Overall": "4.0", "Content": "I saw on FatWallet a Panasonic Gold Box Deal for 600. I wasn't in the market really for a TV, the Mitsubishi 35 inch I picked up on Craigslist for $100 was doing fine for me because I didn't watch much TV, but I was thinking I have a Blueray with 5.1 I should take advantage of that so I tried to buy it but the deal was sold out :-(I then saw this one as an alternative. I never heard of the name iSymphony but I looked at some of the reviews and they looked decent. I didn't care about the speakers on the TV because I'm hooking this to a 5.1 system. I also was not concerned with the relative lack of HDMI inputs compared to some other sets because a HDMI switch will take care of the problem.So I decided to spend the $330 for the set. Two days later I'm home from work and the UPS driver pulls up and delivers the set to the outside of my garage. I carry it inside where it sat for almost a week because I had a huge 35 inch tube TV to get rid of.So the TV is removed and we carefully unbox my new HDTV. We notice the shipping box is scuffed in areas and there are some holes on the side but the case looks good, the protective plastic looks good and so does the glass. Turning it on all looks good until I notice on the upper right a small area that looks like what you see if you push down too hard on an LCD screen and the liquid is moved. I'm sure many of you have done that to calculator displays. I could only see that problem with a light background but I didn't want to keep it and have it get worse.Other than that problem the set was almost perfect. There was some light escaping on the sides but you only saw it in a totally dark room and it wasn't that annoying (for the money)I went online to report the damage and Amazon had a set to me the next day which was great. I kept it in the box and two days later my friend came to help me set it up.We looked closely at the packaging and saw the bottom was open and there was some damage to this shipping box as well. With trepidation we unboxed it and saw a cracked Styrofoam piece. We carefully re,oved the TV from the box and looked at it. Again the case looked good the screen protection was a foam sheet this time not a sheet of plastic and it looked good and the glass looked good.We crossed our fingers and turned it on and had a perfect screen. We turned it off and went to attach it to the stand and that's when we noticed there was no screws enclosed or owners guide. I'm sure it was a new unit because the remote was sealed and so were the batteries.We used the screws from the one I was sending back to attach it to the stand and watched Wolverine Origins from my On Demand channel. Everything looked perfect. The colors are great it looked too good at times.I am VERY PLEASED overall with this TV (at the price I paid) and while I don't know if I would spend more than 350 on it, I would buy it again.", "Date": "February 26, 2011"}, {"Title": "Bought in Golden Box Deal...Good Buy", "Author": "mbriggs27", "ReviewID": "RUZR5WIQSWZG9", "Overall": "4.0", "Content": "I had a 32' Sharp that broke, so I was looking for a replacement. I came across this deal for $339, and I felt as if it was too good of a deal to pass. I have only had the tv for a couple weeks, so this review does not reflect the longevity of the product. This is also not coming from a person who knows everything about tvs. I would consider my self as the average consumer.I immediately did not like the stand for the tv. It is heavy, but the tv feels unstable. It has never come close to falling, but the thought is still in the back of my mind.The remote is a regular remote. I do not understand the complaints of a remote, as I see it as a minor part of the tv. I can't see a remote being the breaking point for buying a tv.I have also seen a lot of reviews mentioning light seeping from the corners. This is not something that I have noticed. I do not see the point of inspecting the tv to try and find it. If I do not notice it in everyday use, it is not an issue for me.Now, the most important issue: picture quality. The difference between regular channels and HD channels is amazing. I have Comcast Digital. The regular channels are not of superior quality. It is decent, but some scenes might appear a little fuzzy. The picture is still not bad though. HD channels, however, are phenomenal to say the least. The probably have the best quality out of any tv I have owned. It is remarkable how much detail you can see clearly even on sports. You can literally see every bead of sweat on the players. I wish this was true for all channels.Overall, I feel as if this was a great deal for the price. My only real concern will be the longevity, since it is a new brand. iSymphony is under the same company as Samsung. I hope the long term quality will be similar. To be on the safe side, I bought a warranty on SquareTrade(saw another person on here did that). It seems to be a great site with even greater prices. If you buy this tv I would recommend buying a warranty outside of the manufacturer. I bought a 3 yr full warranty on the site for around $30.I hope this review was helpful!!!!!", "Date": "February 26, 2011"}, {"Title": "pleased", "Author": "Frankie Tipton", "ReviewID": "R2UE9GOCYXFIT7", "Overall": "5.0", "Content": "I was skeptical about this TV considering i haven't heard the name before..As soon as we got it home..We read the directions hooked everything up and it is amazingly better than our 32 inch tube television..The picture quality is great...Their customer service was nice and easy to talk to..The only thing we couldn't find to put in our remote is the code so we can use only one remote..Their customer service advised us to use the samsung codes and it worked..Very satisfied with the price also...", "Date": "February 23, 2011"}, {"Title": "Great TV @ an Awesome Price!", "Author": "Amanda Sapp Todd", "ReviewID": "R2D4G7OF4F8OPW", "Overall": "5.0", "Content": "We are recently turning our garage at our lake house into a game room for those rainy days.  We were looking around and comparing prices for 42\" tv when we came across the Amazon's Deal of the Day.  It was this TV for [...] plus free shipping.  I couldn't believe it.  I hadn't ever heard of the brand before but read all the reviews and other stores reviews of the tv and just couldn't pass this deal by.  The tv came in with in 4 days and we hooked it up with in five minutes and was watching tv on it that night.  The color, the contrast, everything is great on the tv.  My son hooked his games to it also.  The remote is so easy to work.  It is very similar to the Element remotes.  It is easy to switch from tv to games!  Love the tv....great deal...great price!", "Date": "February 22, 2011"}, {"Title": "You get what you pay for, maybe a little more", "Author": "Robert A. Mccracken \"Moses\"", "ReviewID": "R1MNYPTU3MK2R5", "Overall": "4.0", "Content": "I bought this TV because I missed a sale on a 42\" Sceptre @ newegg for $399 orig $699. I found this one for $396 orig $499, so natuarllay not as high end as the other at retail prices. However it has a great picture, but you can see why it's cheaper. The mount is falkey, it doesn't insert into the tv, it just screws on, so kind of flimsy. The inputs are pretty limited. The menu options are pretty basic also. The start up time is a slight inconveinence. Yet the picture is good, so I guess that's the important thing. I am satisfied considering the price.", "Date": "February 21, 2011"}, {"Title": "Excellent price- 1st one was replaced", "Author": "J. Fuller", "ReviewID": "R3I4BK6PQ60BAI", "Overall": "4.0", "Content": "Picked this up on the black Friday deal and what a deal from Amazon.  Came UPS and turned on but- get this- would turn itself on unexpectantly.  I thought maybe it was a timer issue but no, it just would turn itself on?  iSymphony service- don't put a lot of faith in them.  Amazon delivers 100 percent.  Despite trying to work through iSymphony (still waiting on that call months later), Amazon came through quickly, and white glove this time around.  Picked up and replaced and so far no problem with the replacement.My concern would be long term service if needed after the Amazon coverage period.  Might be wise to buy some sort of warranty on top.TV is good picture and nice size.", "Date": "February 20, 2011"}, {"Title": "Seems like a great TV to me...", "Author": "Brandon", "ReviewID": "R2YMPUAV3QULAX", "Overall": "5.0", "Content": "I am one of the $339ers, and going from a 4 year old 32\" LCD, I feel great about my purchase.  The first TV arrived with 1 dead pixel, so I made Amazon send me a new one.  The new one arrived a few days ago and I'm perfectly happy with it.  Both of mine didn't have any problems with the stands, seems sturdy enough to me considering it'll never move.  And people are really criticizing the remote?? It's a freaking remote. I push the button, and it does what I want.  I adjusted the settings per the reviews on here and fired up Troy on bluray and it was amazing.  As a casual viewer that appreciates HD, it was crystal clear, colors were great, and I could actually see details from my couch (unlike the 32\").  I just watched Inception on bluray too, it was also amazing. The only negative I can think of is that there seems to be some slight inconsistencies in the backlighting. I can only see it in the dark, during very dark scenes, and it doesn't bother me, but it is definitely there as some cloudiness.  I have read that this type of thing can go away with a little bit of use, so I'm not too worried about it. All in all, I'm very happy with the purchase and would do it again in a second.", "Date": "February 18, 2011"}, {"Title": "No Complaints", "Author": "Just Us", "ReviewID": "R1VA5QJQU5FCPA", "Overall": "5.0", "Content": "Wanted a flat screen to replace my 600 pound gorilla in the basement but I didn't want to \"break the bank\" since it would be used primarily for \"gaming\".Packaging and delivery were terrific.  Setup was a breeze and I have no problem with the stand (what do people expect for a 42-inch under $400 (what I paid)?)The remote-based menu is easy to use and the picture quality is better than I expected.  For the price, in my opinion, this TV is well worth it.", "Date": "February 17, 2011"}, {"Title": "Pretty meh", "Author": "Bill Franklin", "ReviewID": "R32OFW6IX59WAZ", "Overall": "2.0", "Content": "I bought this TV to replace a 42\" plasma I had in my living room that my son had cracked.  I figured at 1080p and LCD it would be a nice improvement.  After using it for a couple days, I ended up going back to the cracked plasma.The TV does have a decent resolution.  But the colors are pretty horrible.  Dark colors look muddy and blend together.  And the contrast ratio seems pretty off.The screen really only looks decent if you view it from straight on.  Any angle and it looks pretty horrible.I ended up using it as a bedroom TV. If you don't need anything fancy, it's decent for the price.  But I wouldn't really recommend this for a Home Theater or anything where quality matters.", "Date": "February 15, 2011"}, {"Title": "Good tv for the money", "Author": "TUM", "ReviewID": "R3IWZEAVK50X4F", "Overall": "4.0", "Content": "To start off if your looking for a good 1080p TV without the extra \"stuff\" and a decent price then this will do fine.  I was looking for a TV to replace my 19 inch and double as a computer screen via hdmi and spend around $300.  This TV was bought at a decent price ($340) and was a little nervous about the very divided reviews.  After receiving the TV on the 12th its been a very excellent TV so far.  I have had it on for almost 8 hrs a day so far due to the use of 4 people.  I use it to play the PS3 (Netflix looks good and COD looks good) and have it hooked up to the tower.  The remote is a remote its not the greatest but it gets the job done.  As far as the on and off screen they are a bright white screen with the logo which isn't very annoying at all.  As far as the set-up, i personally did not have any problems with the base or the screws (took about 10 mins to go from box to living room stand).  Will try to update again after a few weeks.Pros:1. price($340)2. size3. not cheap looking (glossy black and cool looking clear strip at bottom)4. Picture is clear and quality seems very good (no dark sports or bad pixels)Cons:1. had to adjust the settings a lot.  Thanks JAH for the setting ( Contrast- 40, Brightness- 45, Color- 58, Sharpness- 40, Color Temp- Normal)2. does seems a little warm after use3. lack of connections overall (only 2 hdmi :( )", "Date": "February 15, 2011"}, {"Title": "not worth the lower prices", "Author": "P. M. Nesbit", "ReviewID": "RDB53PY6TYM80", "Overall": "2.0", "Content": "i actually got the 32 inch version of this tv, but that model isn't sold anymore on amazon.  anyway, my review is more about the company than the tv itself.  i got the tv for a very good price.  the tv itself is fine, so far the only issue with it is the remote sometimes doesn't work, but if i jiggle the batteries, it's fine.  anyway, the problem is the stand.  it wouldn't screw in.  to make an excessively long story short, the brass fittings that hold the screws to the tv were never installed.  anyway, the customer service is TERRIBLE.  after repeatedly asking the person on the phone the first time i called whether the problem was the screws or the tv, i was assured that they had just given me the wrong screws.  well, after weeks, (forgetting my case entirely, giving me the wrong fax numbers and taking a long time to respond) they sent me the same screws.  i switched to email then to save the aggravation of having to explain the whole thing every time i called.  in the emails they basically said i didn't know how to operate a screw (i'm not joking, they thought i was too stupid to use a screw).  FINALLY they believed me and asked me to look for the brass fittings in the holes.  well that was the problem of course.  so now my choice is to send the tv back and wait, sans television, for 2-4 weeks for a new one, or just keep watching the one i have which is currently leaning against my bedroom wall (oh, and it's my only tv now).  so yeah, decent tv excluding the stand, terrible company.  i guess you get what you paid for.", "Date": "February 14, 2011"}, {"Title": "Looks good", "Author": "rmookie", "ReviewID": "R2S2S2IKBWPRYN", "Overall": "5.0", "Content": "TV looks great for the price.  Had it setup side by side with our RPTV and was definitely on par with it aside from the black levels which plagues all LCDs. From the looks of it the brand has bad quality control and most of the poor reviews on here are from people who got damaged sets.", "Date": "February 13, 2011"}, {"Title": "GREAT TV", "Author": "Olga M. Roth \"carly\"", "ReviewID": "R1SS2AIFSAQF90", "Overall": "5.0", "Content": "This TV is amazing for the price. It was easy to set up and program. Super sharp image and color. You won't fi nd a  better deal.", "Date": "February 12, 2011"}, {"Title": "Great TV for the price", "Author": "Jhunt", "ReviewID": "R3SG245MWY2SOX", "Overall": "4.0", "Content": "I read multiple reviews on this product before I bought it, and was kind of expecting something that was only worth putting in a bedroom or somewhere that does not require a real great picture. To my surprise, I cannot tell the difference in anything between this guy and my more expensive Sony. I cannot comment on longevity, for I have only had this for about 2 weeks, but so far I have not had a problem of any time. The colors are good, the darks are dark, and its is decently bright. The sounds is okay, not great, but i have it running though another system anyways so this is not a big deal for me.Overall, this is great with the price of a TV, and hopefully it will not die after the one year warranty goes out.", "Date": "February 11, 2011"}, {"Title": "Great Value, but requires tweaking.", "Author": "krunk812", "ReviewID": "R1VE1G4HZC3B8U", "Overall": "4.0", "Content": "I bought this TV for my parents on Black Friday and man what a deal ($298.00 and today I see it at $339.99). Initially I was not pleased with the color and brightness of the set. The reds are so strong they are on fire. I was tempted to return the TV until some reviews with tips on correcting the settings started rolling in. I followed these tips and reigned in the reds. If you buy this set make sure you customize the settings, the factory settings are absolute crap. Ultimately, for the price this is a great bedroom/guest-room/game-room/garage set. Don't pass up this TV when it goes on sale!", "Date": "February 10, 2011"}, {"Title": "I love my new 42\" TV", "Author": "Rachel E. Berger \"teacher mom\"", "ReviewID": "R2FOCQIHEZD2PT", "Overall": "5.0", "Content": "This television is amazingly beautiful and so is the picture.  I set it up on the stand that comes with it, so I haven't hung it up on the wall yet.  I've had no problems with this television at all.  The large screen is perfect for our living room, and we love watching movies on it.", "Date": "January 16, 2011"}, {"Title": "42-Inch LCD HDTV", "Author": "Aditya N. Syafruddin", "ReviewID": "R3MXHWYHQ9J9N9", "Overall": "5.0", "Content": "Bought this tv on black friday for $300, beats waiting in line at walmart for 5 hrs.  received it in 2 days, easy to set up, nice picture quality for it's price.. the only downside is most universal remote would not recognize the brand, so you have to search on your own...", "Date": "January 15, 2011"}, {"Title": "Good TV for the price!", "Author": "Celeste", "ReviewID": "R23GS02RX5GZ11", "Overall": "4.0", "Content": "If you're looking for a TV with all the bells and whistles, you should probably look somewhere else; otherwise, I feel this was a great deal. I bought this for $298 (Black Friday) for my brother and his fam. They needed a TV (since theirs was VERY old and ready to go out), so when I saw this, I jumped on it. Pretty much ANYTHING was better than what they had, so I wasn't too concerned with the brand or all the \"extras\" that other people seem to want.This TV works great! And the clarity of nice as well. I'm not comparing it to others because we don't have a side-by-side thing going, but as far as an LCD HDTV goes, it gets the job done nicely. It also looks good too. It's mostly used for watching satellite TV and gaming. I only gave it 4 stars because when I bought it, the description said 3 HDMI, but there are only 2, and my bro has a few gaming systems and other things that could have used the extra slot.As far as how long it'll last, only time will tell. I guess it was worth a xmas present this year, and lasts until at least next xmas, but hopefully it lasts longer.I probably would not have paid the full price for this brand TV though. I probably would have looked at a more \"reliable\" brand if I had to pay $500 for one. But at under $300 SHIPPED (gotta love Amazon!), I don't think I could have found a better deal than that!", "Date": "January 9, 2011"}, {"Title": "Great Deal", "Author": "AJ", "ReviewID": "R23CIHP94S6C8W", "Overall": "4.0", "Content": "This TV replaced my 32 inch Vizo, and the picture quality is much better on the iSymphony.The only cons I have would be the cheap base, which is no longer an issue since I have mounted the TV. Also the TV does not have the audio return channel feature.", "Date": "January 9, 2011"}, {"Title": "Great for the lighting price, not full price", "Author": "Dredly", "ReviewID": "R3SHWH28AOKQML", "Overall": "3.0", "Content": "Currently this set is used in my bedroom for some minor TV watching, football and cartoons. It works for all these as long as you aren't expecting a great picture or sound.Pros:Great price at sub 300 for a 42\" tv.Amazon shipping was fast and cheap as alwaysCons:Very limited menu options for customizing picture, Reds are extremely bright, blacks are very dark w/ low detaillow number of available inputsSound is acceptable but nothing greatThe plastic base is garbage.The \"fit and finish\" doesn't look like it was really finishedThe remote has some good functionality (Sleep mode!) but feels cheap and poorly laid outOverall at the 300 price I would buy another one and would give this a \"Buy\" rating. at anything over 350 I would pass on this purchase and spend a few more dollars on a higher quality set.", "Date": "January 8, 2011"}, {"Title": "Great for Price !", "Author": "shannon workman", "ReviewID": "R11024NN5R9DWR", "Overall": "4.0", "Content": "Bought this on Lighting deal for grandma for Christmas with a pitch in from a bunch of family members.  Got this on the lightning deal for 298.00 and its been good so far.", "Date": "December 28, 2010"}, {"Title": "Nice TV", "Author": "B. Wade \"bwade\"", "ReviewID": "R3HEBZABG6055P", "Overall": "5.0", "Content": "I was not familiar with this brand, but I got a deal on it on Black Friday.  I have had it a month and we are very pleased.  Has a tuner that picked up the cable's HD channels that are local broadcast and the picture is good too.  For the money, it is hard to go wrong with this TV.", "Date": "December 28, 2010"}, {"Title": "GREAT TV", "Author": "MRL", "ReviewID": "R2232SIRW3CJ7O", "Overall": "5.0", "Content": "GREAT TV FOR THE PRICE! WISH I WOULD OF BOUGHT TWO WHEN THE PRICE WAS SO CHEAP. UNDER $300 FOR A 42\" 1080P LCD TV.", "Date": "December 28, 2010"}, {"Title": "Great TV", "Author": "Mike", "ReviewID": "R11WZJLBHCBHXK", "Overall": "5.0", "Content": "This was purchased for my son. He loves it, says it has a great picture, is very pleased with the product.", "Date": "December 28, 2010"}, {"Title": "Was Pleasantly Surprised", "Author": "Brad", "ReviewID": "R3TSEY7FSAFZ3D", "Overall": "4.0", "Content": "Was slightly leery about getting an \"off-brand\" LCD like this, but the Black Friday price of $298 was just too good to pass up.  Arrived at my house 3 days after i ordered it, despite being a Prime member and having 2-day shipping (but i wont blame Amazon they probably got a few more orders than normal.As for the TV itself, good picture, sound quality is quite decent, and NO dead pixels!!  The colors took a little adjusting at first, the factory settings seemed to wash out all light colors and when you used the darker preset skintones seemed orange in color.  After about 10 min of playing with the colors and the contrast/brightness it looks nice (not near what my Samsung DLP does, but what can i expect for a $298 LCD)Overall I'd definitely recommend this TV for use in the bedroom or a kids bedroom.", "Date": "December 28, 2010"}, {"Title": "\"Get What You Pay For...\" and then less", "Author": "Professor Chaos", "ReviewID": "RWZ6XZQVDX3UJ", "Overall": "2.0", "Content": "My set came with a remote that doesn't work so I called their customer service. They said they would send out a new one. Never came, never answered my e-mails, waited hrs. trying to talk to another customer service representative again 2 different times only to talk to nobody (...must have been lucky the first time I called). Also the TV screen has a green dot that appears when the set is in use, in the middle-right. It's very annoying and only goes away if something white appears where it is and if any other color replaces the white the neon green dot is back. I will never buy from this company again.", "Date": "December 20, 2010"}, {"Title": "You pay what you get", "Author": "Ya-ting Yang", "ReviewID": "R1E0HHS3YD4I12", "Overall": "3.0", "Content": "I got this on the black Friday lightening deal for $299. It was a very good deal when you consider the price and the size of this tv. This is my first HDTV and I think the quality is good for the price I pay. However, I have some issue with my AV input. The AV1 doesn't work from the beginning. The AV2 was working fine until last week that it only gives sound and no image. I tested my DVD player on another TV and there was no problem. So it all goes back to the AV input on this TV. I didn't get a chance to test my other input such as HDMI (because I don't have any HDMI device yet), but I would suggest that if you already got this TV test every input in the back make sure it is working properly.I contact Amazon about my AV input issue and they said they will take the TV back and give me a full refund.", "Date": "December 18, 2010"}, {"Title": "iSymphony 42inch", "Author": "Shawn L. Huber \"Shifty\"", "ReviewID": "R1OR69Q1TLQI1Z", "Overall": "4.0", "Content": "So far I am impressed with this TV. I have never heard of this brand before, but it was a great deal on Black Friday so I purchased it. My only disappointment is the description said it had three HDMI ports but when I opened the box and looked there were only two. The description has since been updated and now says two. Other then that a great TV.", "Date": "December 10, 2010"}, {"Title": "Great black friday deal!", "Author": "Joy", "ReviewID": "R22KTCKSYD4DDU", "Overall": "4.0", "Content": "I bought this tv on Black Friday during the lightening deal.  I was a bit nervous buying a TV online not really knowing alot about the brand.  We are not electronic gurus but do like a nice big tv.  This tv has been a great I got it with in few days thanks to my Prime membership, my hubby had it set up within a few minutes and it has been great.  Only drawback hubby noted was there was no HDMI hookup on the side of the tv to plug other devices in like our Flip video camera.", "Date": "December 10, 2010"}, {"Title": "Don't Hesitate - Good for the Money", "Author": "DEL H \"DEL H\"", "ReviewID": "R1BC5ROFF2W9LE", "Overall": "4.0", "Content": "I needed a TV for my bedroom and I took a chance on this TV. The TV has really good picture when connected to a HD source. Its not as good as the new LED's but its good enough for a bedroom or basement.Pro'sGood PictureGreat Price (I paid 298 @ the black friday event)Crisp contrastCon'sRemote sucks but my universal cable remote works with the TV (BTW...use the Viore code if you can't locate the one for ISymphony)Runs a little hot at timesSo far so good.", "Date": "December 10, 2010"}, {"Title": "great tv for the money", "Author": "byoung", "ReviewID": "R139BY02I7HT3C", "Overall": "5.0", "Content": "I purchased this tv for $299 during the cyber week promotions just to set it up in the basement for the kids to play their video games (so I can watch sports on my tv upstairs).  For the money I can't be any happier.  The first tv that came in had a broken screen due to rough handling during shipping.  Return was almost too easy, UPS came back to my house and picked up the tv and the very next day a new tv was on my porch.  Set up was way easy and picture was better than I expected.  The kids love playing games and having it hooked up to a computer.  More adapters / connections on the back than I need but it's nice to know they are there.  Bottom line is for the money it's a great TV.  If I had to pay the $450 they are usually asking, I might just cough up a few extra bucks and go with a name I'm familiar with.  I would buy a couple more at the $299.  Again, can't say enough on how easy and well the return / replacement process was handled.", "Date": "December 4, 2010"}, {"Title": "Affordalbe Quality", "Author": "Samuel L. Smith \"TECHMAN\"", "ReviewID": "R3EV51R3U0MC2J", "Overall": "5.0", "Content": "I got this HD tv black friday on the lighting deal and Im Very satisfyed with the set,beautiful picture easy to setup and I have zero issues with it so farI will update in a month.", "Date": "December 3, 2010"}, {"Title": "Great TV for $298", "Author": "J. Korb", "ReviewID": "R2923G98R25J3V", "Overall": "5.0", "Content": "I have never been more pleased with a purchase in my life that I am with this television. I was a bit concerned that once the TV arrived, it would have some of the issues that plagued other purchasers, but that hasn't been the case for me. This unit is bright and beautiful, with no light-leakage around the corners. Sure the stand isn't incredible durable and the remote is light, but I don't plan on moving the TV much and I don't understand why a light remote is a big problem. Once adjusted, the colors are warm and nice, especially the whites. The blacks aren't perfect (like on a good plasma), but one must remember this is an LCD (and an affordable one). I was also very impressed by the speakers on this TV, as they didn't distort the sound between 0-90%. Sure, the sound isn't anything compared to even an affordable surround system, but it's better than most high-end TV's alone. The matte screen provides a beautiful picture and resists glare effectively, and serves as a nice contrast to the gloss-black perimeter. Hopefully this unit lasts past its one year warranty.", "Date": "December 3, 2010"}, {"Title": "A Great Value TV", "Author": "Wade Drummonds", "ReviewID": "R30TH9X9ZM5DDD", "Overall": "4.0", "Content": "I did not know what to expect with a $298 42\" 1080P TV, but I am very pleased overall (especially considering the price paid). I was pleasantly surprised with the picture quality, especially the vibrant whites. The darks from my coaxial input aren't that great, but I get my HDMI cable from Amazon tomorrow, so I'll see how that turns out.The sound is not so great, however, and sounds muffled compared to my old set (I guess Santa will have to shell out for a sound system next year!). Also, the inputs are not as intuitive as other sets, but they work well once you full with it and figure them out.I don't know how many other people get their TV from an antenna like me, but the digital receiver did a great job at finding the channels; it found around 8 more than my old receiver (using the same antenna position and weather condition). More free channels definitely added value for me!Overall, this is a great TV for the money, quality comparable to any other entry-level HDTV. If you're looking for something that is going to blow you away, you're certainty looking in the wrong price range!", "Date": "December 2, 2010"}, {"Title": "Missing AC Power Cord", "Author": "Danny \"Danny Boy\"", "ReviewID": "RSVC0SLXPEB1O", "Overall": "3.0", "Content": "Well, I got the TV. I set up the stand with no problem. However, the AC adapter is missing. So iSymphony is going to send me an AC power cord. The customer service was nice. The test will be whether they actually send me the AC adapter. Then I'll be able to judge the TV. So I will be updating this review once I get the AC power cord.I noticed like every one else that there is only 2 HDMI ports. I noticed they fixed the information on the Amazon website. It's a good thing I didn't make any plans based off of that information.", "Date": "December 2, 2010"}, {"Title": "If you like Cheap and Big and Bad Screen Quality", "Author": "Timothy S Thrash", "ReviewID": "R3JFK9BWD7VUIZ", "Overall": "1.0", "Content": "I have not written a review before this one, but I felt I just needed to let people know. I have a 32\" and a 37\" Vizio HDTV that I love. I wanted to go bigger (of course) so I decided to purchase this on the Black Friday deal for under $300.  Even for the price I paid for it I am greatly dissatisfied. The quality of resolution is terrible. Very pixelated. Sports are impossible to bear. I was so disappointed in this tv I moved it into my bedroom and brought back out the 37\" Vizio to watch instead. Then I decided to go get a 47\" Vizio 120hz tv and WOW! Night and day. Tv shows look like they are being performed live right inside my TV it is THAT CLEAR. Sports are amazing. BEst purchase ever even though I spent about $400 more. If this is your first TV purchase from your standard definition box then you might like it. If you know anything about what HD should look like then definitely steer away.", "Date": "December 6, 2010"}, {"Title": "Reviewing a iSymphony", "Author": "Hitman454545", "ReviewID": "R1NIR85NNOK00F", "Overall": "4.0", "Content": "Well when i first got the tv i was very unhappy because i'm going from a LG Plasma to a LCD which i already seen LCDs that look just as good as a plasma. As like MR Cart said i agree with him 100% and i did use the same thing he did to Digital Video Essentials for the calibration which before this cd i was very unhappy with the picture. I'm going to post my settings maybe should help but this is my first time useing this dvd so after a lot of research i'm happy with the results...... but i'm not perfect........  Contrast- 40, Brightness- 45, Color- 58, Sharpness- 40, Color Temp- Normal.  Now don't hate on me if it's not a 100% but it's a starting point they say to give at least a week before u adjust again so hopefully MR Cart repost his Settings..... i Got the Digital Video Essentials: HD Basics [Blu-ray].... Gaming with these settings are amazing to me looks way better then i did it with my naked eye......", "Date": "December 1, 2010"}, {"Title": "SEVERAL stuck pixels! Save your time and frustrations!", "Author": "Waggles", "ReviewID": "R3LRM8C5XNWC5W", "Overall": "2.0", "Content": "Bought this TV for the gold box deal a few days ago thinking it was a great deal. TV arrived promptly (Amazon rocks!), set up was pretty easy. Comes with a cheap remote, and some instructions. Went to plug in the TV and realized the power cord is VERY short! Hope you have an outlet right by your TV! Anyways, the TV looked nice sitting on my stand. I fired it up only to find SEVERAL stuck pixels scattered around the center of the screen. I was hoping I could massage them out, or use some of the software online to try to get them unstuck, but nothing worked. It is extremely annoying to watch TV with stuck pixels so I scheduled for the TV to be picked up for return. I will gladly fork over an extra hundred dollars to get a name brand. Save your time and energy and buy something from a reputable company.I found it hilarious because inside the manual it says something like \"stuck pixels may occur but will not effect the performance of the product\".......how does this make any sense?In the end, the picture was mediocre at best, and with the stuck pixels it was just horrible.Please, if you're considering purchasing this TV, don't. Learn from everyone's negative reviews and pass!", "Date": "February 17, 2011"}, {"Title": "Good TV, Poor customer service", "Author": "allison 1022", "ReviewID": "R3BUX5ENUENGM6", "Overall": "3.0", "Content": "I also, purchased this TV as a lighnting deal for $299. The TV is good overall, but came with a defective power cord. I called isymphony customer service, they sent a replacement a week later. The replacement was the wrong cord for the TV, so I called them back. And...weeks later, still no cord! No one will call back, answer emails, everytime I call they say the person in the department I need is \"on break\". They say my request is sitting in an email inbox waiting to be looked in to. We finally just got our own cord, but it is so frustrating! The TV has a great picture and sound, I just wish they had better customer service.", "Date": "December 30, 2010"}, {"Title": "Overall very pleased with my purchase", "Author": "Dennis G. Miller \"soccerstar05\"", "ReviewID": "R3P5KZFE0XVT00", "Overall": "5.0", "Content": "The delivery of my HDTV turned from excitement to a little bit of dissapointment when the screws were missing for the TV base, along with the manual but that is the only negative so far. I purchased new screws at a hardware store for a few dollars.iSymphony offered to mail me replacement screws when I contacted them via e-mail.A few observations:Issue: Too much rednessSolution: Adjusted Color by lowering to setting of 30 and increased contrast to about 70.** Standard setting has all options set to the middle with a setting of 50.*** I am currently only using Att Uverse standard service and not HDTVSports: Watching sports on this iSymphony TV gives you an overall excellent viewing experience. You will get some HDTV blur activity but I think that comes with a lot of LCDs.All other viewing displays excellent color, crisp images and has proven to me that my purchase was well worth the $298. I would say 99% of the time viewing will be perfect with the exception of some blur images when camera shots move too quickly but I don't think it is unlike other HDTVs.Price: $298 Absolute steal!!Picture Quality: Very Good!Customer Service: With iSymphony, you are not going to get 24 hour support. They appear to be a small company that is dedicated to producing a quality product at an affordable price and I am happy to be able to benefit getting good quality for an unbeatable price.If you want the best of the best, then iSymphony may not be for you but if you want an affordable HDTV that will satisfy your TV viewing experience by giving you everything you need, then the iSymphony is a great choice!!", "Date": "December 1, 2010"}, {"Title": "Time warner programming???", "Author": "jayrat86", "ReviewID": "R2LJKSZ53YL29Z", "Overall": "4.0", "Content": "First off, this is a great tv for the $298 that I paid as a lightning deal.  Its got a great picture that is right up there with brand names.  Blacks and whites look good and the only negative is slight delay on action scenes.  Not terrible though.  Sound is good and while the inputs are limited 2hdmi, 2 composite, 1 S-vid, 1 component its plenty for my cable box, dvd, and Wii.  Took about 10 minutes to get it up and running.My main issue, what is the tv code for Time warner.  Called the customer service for TW and they don't know.  Supposed to be sending me a new remote that works for this tv but I looked up that remote and Isymphony isn't listed there either.  Anyone get it to work with a Time warner remote?  What code/manufacutrer did you use?", "Date": "December 1, 2010"}, {"Title": "Mediocrity at Its Finest", "Author": "Rizzy", "ReviewID": "R217SJDD6EEDBV", "Overall": "3.0", "Content": "Got this set on Black Friday.The Good:-Love the size. Perfect for our 15'x15' game room.-Bright scenes look AMAZING. Better than all of my old 720p name brands.-Tuner picks up more channels than our old TV (with the same antenna).The Bad:-Inputs are lacking.-Menu settings are very bare bones.-Support/documentation for this product is very limited.-Picture quality on 'standard' is terrible. Make sure to fine tune.-The blacks are pretty bad. A lot of detail lost in dark areas.The Ugly:-Watching HD TV through the coaxial input is atrocious. Anything remotely dark shows up as pitch black. This isn't a problem with any of the other inputs. Blue-rays and videogames merely show a minimal loss in detail in dark areas. At first I thought it may have been an antenna issue, but we got the same problem when we hooked it up directly to the cable. Also, it's only an issue for HD channels. Standard definition channels look acceptable. I tried all sorts of picture settings and nothing helps. If anybody knows a way to fix this, please let me know!-Every other time I'm navigating the menu, it randomly disappears and 'MTS: English' pops up on the bottom of the screen. Not only is it extremely annoying when you're trying to fine tune the picture settings, but it makes me worry about future glitches (the kind you discover the day after your warranty expires).Conclusion:Will probably return it if I can't find a resolution for the TV issue. A shame considering how cheap it was.", "Date": "December 1, 2010"}, {"Title": "I Symphony 42\" LCD Tv", "Author": "Eric Wilson", "ReviewID": "R3S3QVPXR5GGZJ", "Overall": "5.0", "Content": "The isymphony 42\" Tv is a really nice prodct especially for the money.  Just as good of quality of the higher end Tvs.  It also looks Nice mounted on the wall.  The controls and features are easy to navigate through.  Very nice prodct Would buy again and do not regret buying it.", "Date": "May 30, 2011"}, {"Title": "Incredible quality", "Author": "A. Metta", "ReviewID": "R31RNF81G7J04V", "Overall": "4.0", "Content": "First of all, I would like to start by describing the freight service from amazon, which is very good and reliable.  The company sent a person which brought the tv to my place and test it to avoid troubles.Now concerning to the TV, the set is really astouning for the price, the signal quality is really good and very crisp.  Of course the image depends on the source, im using a PS3 system as the player for the DVDs and Blurays'.  But in resume I recommend this product.", "Date": "April 10, 2011"}, {"Title": "Wow!  a great TV for the price", "Author": "marqr494", "ReviewID": "R11LLZ223N7NGD", "Overall": "5.0", "Content": "This HDTV exceeded my expectations, great clarity, color, sound, and brilliance for the price. It's on par with my Sony for picture quality. The only problem I have experienced, is the remote may not work with your Verizon Fios box.. That's ok, you'll survive. I will purchase another ISymphony HDTV when I need another TV.", "Date": "April 8, 2011"}, {"Title": "Isymphony LCD TV", "Author": "D. Bonadona", "ReviewID": "R1HUR13JFANFYG", "Overall": "4.0", "Content": "Great 42\" LCD TV for the money.Great picture with a very fast response time for 60Hz refresh rate. No shadowing or distortion. Easy setup & lots of nice features.", "Date": "April 5, 2011"}, {"Title": "iSym phony LC42if56 42 inch LCD HDTV,BLACK", "Author": "MONYWAYNE", "ReviewID": "R39K66XK65DTQP", "Overall": "3.0", "Content": "iSymphony LC42iF56 42inch 1080p LCD HDTV,BLACK IS OK FOR THE PRICE THE SHIPPINF WAS FREE,BUT THE SETTINGS DON'T FUNCTION LIKE THEY ARE SUPPOSED TO WHEN YOU PROGRAM THE TV,PICTURE IS SKETCHY NOT REAL CLEAR EVEN ON THE HD CHANNELS... I WOULD NOT RECOMMEND THIS TV TO OTHERS ........", "Date": "February 18, 2011"}, {"Title": "You get what you pay for I guess...", "Author": "Adam Long", "ReviewID": "R11XY1N5K566GT", "Overall": "2.0", "Content": "I bought this TV for $340 and figured that I could deal with the reportedly crummy picture for the price (not our main TV).Observations:- installing the stand is a pain--just a poorly-engineered design- everything feels fairly cheap (remote, buttons, etc.)- the colors really are not very good (and I'm no videophile)Issues:- several dead pixels toward the center of the screen- controls don't work right--sometimes when pushing a button (volume up, for example) on the remote or the on-tv controls, it acts like the button is continuously held down and will run the volume all the way up.  Did the same on all settings.Result: TV is going back.", "Date": "February 14, 2011"}, {"Title": "Good TV Value", "Author": "Chris A.", "ReviewID": "R1CS5XKV5TS9YG", "Overall": "5.0", "Content": "I got a great deal on this TV through Amazon.  For the price, its hard to beat the value -- 1080p picture and decent sound from its built-in speakers.  The set has its limitations -- only 2 HDMI inputs and sparse picture adjustments.  But the picture is sharp and high resolution using HD material.  42 inches is a good size for a fairly large room with seating in the 8 foot distance range.  Hard to find much else wrong with it.  No need to pay for the a big name when you can get this kind of TV for the right price.", "Date": "January 12, 2011"}, {"Title": "Good for the Price", "Author": "BH", "ReviewID": "RU3H9F9YIESGH", "Overall": "4.0", "Content": "I got this TV on black Friday deal overall I am happy with the price; but the quality of the TV is not so great.Cons:The remote and the TV stand is very cheapBlacks on the TV doesn't look goodProsPrice  ($300)", "Date": "December 9, 2010"}, {"Title": "You get what you pay for", "Author": "Matraa", "ReviewID": "R33PBQE2KEPJFC", "Overall": "3.0", "Content": "Quality was absolute junk on DirecTV for me, I finally found settings I was happy with. Contrast WAAAY down (like 15) Brightness 85, color 40.Its a bit muted, but if set outside these settings image quality was JUNK.I almost sent it back, till I finally found what looked passible.Its a good bargain at the $300 price point, but I would not have paid $450 for it.My 720p Sony VPL-AW15 projector looks more refined at \"119 than this thing does at \"42Remote is junk, but everything else seems of OK quality.Sound is pure crap, I plugged in an ancient 2.1 PC speaker set into the provided jack. problem solved.Final comment, for those on a budget, and when the TV is on sale, go for it. otherwise, stick with the brand you know.", "Date": "December 2, 2010"}, {"Title": "Good value, mediocre picture quality", "Author": "Chad Weldon", "ReviewID": "R5CX4YL46MZ7E", "Overall": "3.0", "Content": "At $298 this is a steal, but like the other reviews I agree you get what you pay for.  The picture quality seems to go in and out.  For example, On an HD football game the close ups look spectacular, but the furthter out shots look grainy.  I have DirecTV and the letters on the guide even look fuzzy.  This is highly variable with the settings.  I have some doubts this really is a 1080P.  When you push \"TV Display\" on the remote it notes 1080i at 60HZ.  The box does say 1080P.  On a side by side comparison of my other 1080P set (a Vizio) there is absolutely no comparison, the Vizio wins hands down.  To me this set looks very similiar picture quality to some of the first HDTVs.Other issues... I had major clouding (blacklight bleed?) at first in the center of the screen.  I was able to physically push (gently) this to the corners and it looks better.  This may have been a result of laying the set down on the floor to install the base.  I was just about to pack it back in the box to return it.  My set is not level, it is 1/2\" lower at one side and I dont see any way to adjust other than propping something under one side, but that would probably look even more akward.  The rubber pads on the bottom of the stand fall off easily.  I had to search inside the box for one that fell off and got stuck.Overall this is a good deall a under $300.  At the higher price you would probably be better served to spend a few more dollars.", "Date": "December 2, 2010"}, {"Title": "2nd one better than the first", "Author": "Angil Tarach", "ReviewID": "R3DXFFTZA7W75G", "Overall": "3.0", "Content": "The first TV showed up and did not work at all, the picture came in and out whenever you touched the TV, an obvious short somewhere in the electrical system to the back light. The second one came in and does work fine, picture is not bad but like many of the other reviews, one disappointing factor is that it is advertised as three (3) HDMI ports when in all actuality it only has two (2). But for the price I guess you can't complain, bought it on the black Friday deal!Amazon return policy however should get a 5 star rating, I filled out the return online at 2:00PM in the afternoon and the replacement TV was here before 8:00AM the next morning. Very impressive....THANK YOU AMAZON!!!!", "Date": "December 2, 2010"}, {"Title": "GREAT TELEVISION! GREAT PRICE!! BUY THIS ONE REALLY!!", "Author": "David Pepper", "ReviewID": "R3GBP943IXCF53", "Overall": "5.0", "Content": "I SAW THIS iSYMPHONY AND READ ALL OF THE REVIEWS, EVEN THE BAD ONES.I DIDN'T  REALIZE IT WAS A SAMSUNG!I USED TO SELL BIG SCREEN TVs SO I KNOW WHAT IS THE BEST AS FAR AS REVIEWS AND CUSTOMER SATISFACTION. I HAVE HAD THIS TV SINCE DECEMBER 2 AND THERE ARE NO PROBLEMS AT ALL. THE PICTURE IS CLEAR AND THE SOUND IS GREAT. IF YOU ARE TRYING TO DECIDE ON A TV BRAND THIS IS TOP OF THE LINE. I LOOKED FOR MANY  MONTHS AND THIS WAS THE BEST TV FOR THE BEST PRICE. THERE WAS ONE NEGATIVE REVIEW AND I DON'T SEE ANY OF WHAT THEY WERE TALKING ABOUT? THE LIGHT DOES NOT BLEED OUT OF THE BACK AND THE REMOTE IS JUST FINE. I GUESS SOME PEOPLE JUST NEED TO SAY NEGATIVE THINGS?THANK YOU AMAZON AND SAMSUNG!!", "Date": "January 29, 2011"}, {"Title": "Price Check", "Author": "New Yorker", "ReviewID": "R7GQKGJ4UME2Q", "Overall": "3.0", "Content": "If you will notice, many of these posts state that they bought this TV for $300 on (some on Black Friday).  That makes me question whether or not the current price is too high.", "Date": "March 7, 2011"}, {"Title": "I would not pay more than $250 for this TV", "Author": "Z. Greenwood", "ReviewID": "RHCSA1NYI2DSW", "Overall": "3.0", "Content": "I was lucky enough to be invited into the members only Amazon Prime Gold Friday group where I was able to pick this TV up for $249.99 with shipping which is a an incredible deal.  The TV itself isn't great, the picture is not too sharp and the colors require you to play around with them a lot.  Every connection (HDMI, SVGA, COAX) required custom color and picture set ups which is a real pain.  The TV stand is junk and requires 2 people to assemble unless you do some creative problem solving and lay it flat on an elevated small surface.  The remote is pretty junky but I use my logitec remote.  I ended up moving this TV to my home office where I use it for my financial news.  For the full price I would go with a TCL if you are looking for a discount TV, I have one of those in my bathroom and it's a better quality TV.", "Date": "December 9, 2010"}, {"Title": "ok for the price $339", "Author": "Cat", "ReviewID": "R2189H0G8DQ4ZH", "Overall": "3.0", "Content": "Pro:cheapCon:1.default(recommended) resolution is not 1080P if connected to a computer2.very limited options(not really a lot I can tune up)3.too bright(can not be used as a monitor, you cant see the text in browser address bar...)4.heavy5.not really a lot of stuff on company's website(they just build that website a while ago I believe)6.Overscan/ Underscan (on both Nvidia and AMD, VGA or HDMI)7.hot8.power consumptionI returned it and don't want to try this kind of no brand TV any more.", "Date": "March 18, 2011"}, {"Title": "too high for lower end class tv", "Author": "Keith Lemons", "ReviewID": "R22GHDN4KPAPDL", "Overall": "3.0", "Content": "The price was $386.00, then they marked it up to $449.00.In my opinion, you could get a much better brand for this price...", "Date": "February 11, 2011"}, {"Title": "good product", "Author": "mamalou \"atemalou\"", "ReviewID": "RMF0OVSVAJHWI", "Overall": "4.0", "Content": "I purchased this Tv as Xmas gift to my kids in Philippines, such a great deal & good product. I recommend this.", "Date": "December 7, 2010"}, {"Title": "Poor LCD, even for $298", "Author": "Michael Polzin", "ReviewID": "R3E5UZ6KHKGV0L", "Overall": "2.0", "Content": "So this finally arrived yesterday and I had a chance to set it up today. There is a small cloud in the center of the LCD and a larger one down in the lower left corner. There is also what looks like \"tractor tracks\" in form of a cross in the lower left corner. I am no technophile, but even at $298 with the way the screen looks this is unworkable. I'll be calling Amazon to see if they can exchange for another one that perhaps may not have this problem or be returning it. But after reading other reviews it appears that I am not the only one seeing the clouds in the LCD.As others remarked the remote feels cheap, but is workable. The stand isn't a very sturdy design so you can move the TV left to right on the stand. The design of the TV is nice and the design looks good, if only the picture matched. For the current price, of $450 I would not buy this unit. If it didn't have the problems with the LCD is is worth the Black Friday deal, maybe even the $350 - $399 range.", "Date": "December 3, 2010"}, {"Title": "Channels Found: 0", "Author": "Carl Howard", "ReviewID": "RF8GTZOL6499S", "Overall": "1.0", "Content": "I just purchased the iSymphony LC42iF56 as a second TV to use with over the air DTV signals, but quickly ran into issues.The built in ATSC/NTSC tuner fails to find ANY channels. I have tried scanning with both air and cable settings to no avail. The same exact cable when connected to my other TV and even a cheap $40 DTV box both pull in a dozen crystal clear stations.Disappointed with the tuner's total failure, I thought I'd see how it fared as a computer monitor since it boasts 1920x1080 resolution. I have been using a Westinghouse 42\" as the display for my living-room computer using an HDMI connection, so I just swapped the monitor connection to the new iSymphony's input, keeping the 1920x1080 resolution I had already been using. Even though the signal is digital, the iSymphony fails to display the full 1920x1080 and chops off the edges as though it was an analog signal with overscan.As impossible as it may seem, the digital input at the native resolution is being internally scaled!  In my opinion, this is criminally bad design and results in noticeable aliasing. I tested with both HDMI inputs just to make sure this wasn't a fluke.What's even more bizarre is that the analog VGA input at the same resolution syncs perfectly and displays a pixel-for-pixel native image at 1920x1080!  I'm debating whether I can even justify keeping this thing for use as a VGA monitor.  And while the VGA will sync at the native resolution, it won't even display a standard PC boot screen, so if you happen to have a PC with a boot menu, you're out of luck.The bottom line is that this TV's digital inputs are far worse than the analog: a native 1080 digital signal is going to be rescaled causing an additional blurring of the any image. That combined with the tuner pulling in zero stations and not being able to use with a PC except at certain frequencies, earns this product one star from me.", "Date": "December 6, 2010"}, {"Title": "Big dissapointment", "Author": "Diver", "ReviewID": "R38BKVJ261IPCM", "Overall": "2.0", "Content": "I was a little secptical at the start...The tv was a great price but you get what you pay for and I got my $300.00...The picture is terrible and the sound was just awfull...It was like watching an old Kung Foo movie...The voices did not match with the video....Sending it back and Buying a different TV...", "Date": "December 4, 2010"}, {"Title": "The TV is bad and worthless", "Author": "Ruben G.", "ReviewID": "R2W6AFAWO3LSQI", "Overall": "1.0", "Content": "My TV arrive bad, and have an manufacture wrong...after one minute of put on, the image was in complete black, but the audio continues.I was trying of check the conections of the TV, but all it`s ok, there is manufacture wrong.I am very dissapointed with this TV, because they sell me an item bad...Don't buy this TV, don't risk you", "Date": "December 17, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "42\" screen with 16:9 aspect ratio\nIntegrated ATSC TV tuner for HDTV broadcast reception\n1920 x 1080 native resolution for Full HD 1080p performance\nBeautiful color depth with a dynamic contrast ratio of 10000:1\nDual HDMI inputs for true digital experience", "Name": "iSymphony LC42iF56 42-Inch 1080p LCD HDTV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41cdbCsSRVL._SX300_.jpg", "ProductID": "B003XU7AQ6"}}