{"Reviews": [{"Title": "Samsung C6400/C6300 vs Samsung C6900/C6800 vs Bravia EX710/EX711", "Author": "Matt P", "ReviewID": "R1U7B7CPBOECEU", "Overall": "4.0", "Content": "I spent weeks researching and testing various LCD/LED flat screens.  In the end I purchased the Samsung 55 inch C6400.  The C6400 model is the same screen as the C6300 model except the C6400 has Samsung's built-in internet apps whereas the C6300 does not.  In the process, I purchased two Samsungs (C6400 and C6900) and one Sony Bravia (EX711).  Here is what I learned: * All of the review websites \"calibrate\" their screens before performing a review.  During calibration the screen's default settings are changed to supposedly make them more accurate.  Nifty features that are built into the screen like \"Mega Dynamic Contrast Ratio\" are frequently disabled during calibration because they can affect the accuracy of the image.  In my opinion, if a nifty feature in your television can make it appear brighter or more colorful, go for it.  Color accuracy is overrated.  What matters is whether *you* like the picture or not. * Edge-lit screens like the Samsungs and Bravia I reviewed are thinner, lighter, and more eco-friendly than the full-array screens.  In theory full-array screens give better contrast ratios, and require less picture manipulation to achieve said contrast ratios.  To my untrained eyes, it's hard to see a difference. * Dynamic edge-lit on the C6900 sounds like a good idea, but in my testing it created some weird affects that my wife, in particular, didn't care for where some parts of a dark image were pitch black and other parts of the same dark image were a brighter black, giving the appearance that someone turned on a spotlight down part of the screen. * The blacks were darker on the C6400 than the C6900.  Go figure. * Edge-lit screens tend to hide the speakers on the back of the set.  This produces a \"reflected\" sound that is decent, but not the best.  We planned to purchase a theater system with our television so this didn't really matter to us. * The Samsungs and Bravia screens came with a swivel stand.  This was important for our living room set up. * None of the Samsungs supported HDMI Auto Return Channel.  Without ARC I have to power on the screen *and* the theater system to watch video from external devices like a blue ray player or game console.  Not a big deal but it occasionally frustrates.  The Bravia fully supported HDMI Audio Return Channel. * When using motion blur reduction, the Samsungs have A/V sync issues in combination with our theater system.  I have addressed this by increasing the audio delay in our theater system.  It's not exactly perfect but it gets lip sync close enough that no one (except myself of course) ever notices it. * All of the Samsung screens exhibited corner lighting and flashlighting to some degree.  Each Samsung screen was slightly different.  To see this, put the screen in Movie mode and view a uniform dark image in a pitch black room.  You should see that the screen is slightly brighter in the corners and certain areas of the screen are also brighter (flashlighting).  At first this really bothered me, but then I got used to it.  There's simply no way you're going to notice this where it matters most: where the movie picture is playing.  You'll only ever see it in a darkened room between scenes and around the edges where the movie isn't playing. * Amazingly the Bravia didn't have *any* corner lighting or flashlighting.  I don't know how Sony pulled that off, but I was impressed.  Samsung should license Sony's edge lighting technology. * The Samsungs all have a reflective screen which produces a really sharp and bright image that seems to pop off the screen.  The Bravia uses a matte screen.  I was baffled to observe that the Samsungs all handled reflections much better than the Bravia.  There is a window directly behind our viewing sofa.  With the Samsungs you were hard pressed to even see a reflection at all during daytime viewing.  With the Bravia, the television was almost unwatchable during daylight hours.  Reflections caused a blooming halo affect that was really dramatic.  Score one for Samsung's \"Ultra Clear Panel\" technology. * All the Samsungs handled SD content really well.  SD content on the Bravia looked bad in comparison. * The Bravia screen frequently exhibited really noisy colors, particularly with skin tones.  This was much less of an issue with 1080p content, but was really annoying at times.  The Samsungs never had this problem. * The Samsungs use a remote control that is relatively simple and is backlit.  My wife and kids had no issues picking it up and using it right away.  The Bravia remote control was significantly more complicated and was not backlit. * All the Samsungs employ mediocre motion blur reduction.  Motion blur reduction helps minimize the stuttering affect during movement - especially panning shots.  The problem is that unless it is set to Off or Clear, the Samsungs occasionally stuttered.  In practice this isn't a problem as I actually prefer the Clear setting, but sometimes I want to dial this setting up for animated feature films (Cars, Toy Story, etc.) and it often doesn't work out well. * The Bravia had kick-but motion blur reduction.  I was really impressed.  Everything was smooth and fluid.  This may have been in part due to Sony's \"True Cinema\" technology. * When I originally started out, I really wanted our new television to provide Netflix playback and DLNA media streaming.  Despite what is advertised, Samsung's Netflix and DLNA support is poor.  On both Samsungs, Netflix was constantly switching bitrates (about once a minute) and each time the picture disappear to black for about a quarter of a second.  Audio was unaffected.  I repeatedly took the exact same network cable and plugged it into other devices (PS3, Roku, Laptop) and Netflix playback was flawless HD.  Samsung reportedly insists the problem is the user's internet service. * None of the Samsungs or the Bravia I tested would connect to my DLNA server.  I have approximately five streaming devices (Logitech music box, No-name streaming box, iPad, PS3, etc.) spread throughout my home and none have had any issue connecting to my DLNA server. * The Bravia did have better Netflix support, however overall bitrate was still less than other devices (PS3, Roku, Laptop).  A few video stalls (buffering) were experienced on the Bravia. * In my opinion, the C6400 isn't worth the extra cost over the C6300.  In my case I got a super deal on the C6400 so it wasn't an issue.  Perhaps in another few years, these issues will get ironed out.", "Date": "January 9, 2011"}, {"Title": "SamSung 55\" 120Hz LED INTERNET TV-THE GREATEST PICTURE EVER", "Author": "Martin Miwa", "ReviewID": "R1ETRL0A0JEM0V", "Overall": "5.0", "Content": "I purchased this 55\" Inch Samsung LED 120 Hz Flat screen Television at Costco for $1,999.00 at Costco. I received a $200 discount when I purchased it. I plugged in this LED Tv in a what a CLEAR PICTURE! It almost looks like a 3-D picture,since its so clear. It is Bright and the color is Fantastic. Very Easy to use with the standard remote. My daughter used her Apple Laptop with it and it worked great. She also had the internet going on this Tv as well....Very simple and east to use. The only draw back is that you need to buy a Samsung Wireless LAN USB dongle. If you want to hook up to the internet going wireless. You can run a DSL CAT wire to the Tv. If you don't want to go wireless. But why run extra wires to the Tv....? I usually buy SONY \"THE ONE AND ONLY\" Products. But this TV rates on the same level as Sony. You also need to purchase a \"ULTRA FAST' HDMI cable that will support 1080p @ 120 and 240 Hz. (If you want either the 120Hz or 240 progressive scan to work at its top peak) These High output HDMI cables are very expensive>>>> Real Bummer but you have to buy them. So your TV is performing at its best. Plus if your hiding these cables in the wall you don't want cheap HDMI cables. I purchased MONSTER and Pro-Logic HDMI cables>>>Almost the cost of a 40\"inch LCD panel>>>It sucks huh? Last thing that really made my day....I went back to Costco the very next week. I saw my Samsung 55\" LED TV listed with a new price....I got an extra $500.00 off. I was blown away! I got this Fabulous LED TV for $1,499.99. I saw a pallet of these TV's disappear within an hour. Costco is all sold out of these great televisions. I took my old receipt back and they credited me $500 dollars back. What a great day! I hope this helps some of you buyers out there....Enjoy a great LED by Samsung! I don't think you can beat that price.....MartyWestside", "Date": "December 2, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Web applications enabled\nSync media from multiple devices with AllShare\nLED Picture Quality, reduces blur with Auto Motion Plus 120Hz\nSamsung Auto Motion Plus 120Hz\nImages pop with Mega Dynamic Contrast Ratio", "Name": "Samsung UN55C6400 55\" Class 1080p LED HDTV 2010 Model Internet Ready", "ImgURL": "http://ecx.images-amazon.com/images/I/41iBnhrPXzL._SY300_.jpg", "ProductID": "B003Y7WXYW"}}