{"Reviews": [{"Title": "Great TV!", "Author": "DB BluBlock Productions", "ReviewID": "RW4EILGXEUNQI", "Overall": "5.0", "Content": "I've had many types of televisions, and I think that this Element compares to every top manufacturer out there.  It is easy to use, simple to install, has an incredible picture, and has plenty of ports for gaming systems and such.  The price was significantly cheaper than any other premium manufacturer, and this is clearly a superior television.  For once I am glad that I went with something I didn't know much about..UPDATE:  It has been one year, and it still works like a champ!  I get compliments on its picture on a regular basis from friends, and wouldn't hesitate to buy another Element television!  The buttons on the side are solid and mint still, the batteries have only been replaced in the remote once (which is awesome), and it still has a flawless picture.UPDATE:  Well, almost three years of use and still like brand new.  Not much to add except that the dang numbers on the remote still don't even show any signs of wear!  I'm beginning to question whether or not some sort of witchcraft is being used here!  Also, as another amazon member mentioned... Element products are made in the United States (Detroit).  Well done Element.. well done..", "Date": "April 25, 2011"}, {"Title": "Defective product, terrible warranty, awful customer service", "Author": "Squid Loyal \"Squid Loyal\"", "ReviewID": "R88UNRALUUGE5", "Overall": "1.0", "Content": "I purchased an Element television and have regretted it since. It did not work properly and there were many calls and emails trying to get it resolved and now I'm out over $100 in shipping costs trying to get a functioning television. I absolutely do NOT recommend ever purchasing from Element.", "Date": "April 30, 2013"}, {"Title": "Bad Quality, Very disappointed", "Author": "Spartan300", "ReviewID": "R3DAYTK9P32RH", "Overall": "1.0", "Content": "For the first few days the picture was quite impressive. As the days went by the television developed very bad shawdowing/fogging on one side. The colors never looked right and the fogging got worse by the day. Bought a new vizio and it is stunning in comparison!", "Date": "February 23, 2013"}, {"Title": "stop knocking it", "Author": "George Brow", "ReviewID": "R3JSEIZ16MCHJ1", "Overall": "4.0", "Content": "average TV do not put the tv in power save mode/home mode when selecting set up wizard. it will mess it up who would want to watch tv for 30 minutes and have it shut off. read the manual . Go to menu then the display mode and change it to standard . or when first operating choose standard tv mode also the tv comes in wide screen choose cinema on menu . This is the reason why thiers a so called recall just on the operating sytstem element made to save power they need to get rid off it so people dont bother with the option. Make my tv solar powered if you want to save us customers energy lol.", "Date": "January 16, 2014"}, {"Title": "Great TV for the price", "Author": "rdogwarrior", "ReviewID": "R1NNV7IBK83JQH", "Overall": "5.0", "Content": "I bought this TV for $149.00 from Tiger direct, shipping was 13.00, it has been awesome, in every way, picture is clear, colors are vibrate, sound is good. I would but another if needed. It was the best deal I could find on the net! So happy with this TV.", "Date": "December 21, 2013"}, {"Title": "Great Value", "Author": "Pravin Pathak \"Pravin Pathak\"", "ReviewID": "R2SJYCK5FCBM06", "Overall": "4.0", "Content": "I bought this for 280$ through Amazon. It is a good TV. Working well for me so far. Remote menus are easy to operate.", "Date": "April 17, 2010"}, {"Title": "Try to avoid this company at all costs!", "Author": "Trexa's Mom \"Trexa's Mom\"", "ReviewID": "R1VFMM36BYMCNY", "Overall": "1.0", "Content": "I purchased theTV on 6-18-12. The model # is ELCFW327. By October 22, 2012 the tv had  vertical lines thatbegan on the right side but then worked its way to the left side having vertical lines aswell. It was difficult to take a photo that shows the lines well. I faxed my receipt to the # I was given and took photos of the product to show the problems I was having. The customer service department was lazy and they did not notify the postal service to redeliver the product until I contacted the postal service. They would have let the item come back to me. Avoid buying anything from ELEMENT... You will surely be sorry as so many people are already!", "Date": "February 26, 2013"}, {"Title": "Would rather have a Pet Rock", "Author": "Bones", "ReviewID": "RK64XDCF8CCRK", "Overall": "1.0", "Content": "I won one of these in a raffle. Didn't open the box for 3 months and when I finally did, this TV just didn't work. No pic, no sound, no nothing. Come to find out it only has a 60 day warranty. Don't waste your money.", "Date": "August 13, 2013"}, {"Title": "it wasn't what I expected", "Author": "MINERVA B.", "ReviewID": "R26PDLV27ZVZFA", "Overall": "3.0", "Content": "I gave it a 3 star because it was not what I expected. When it says used I didn't think damaged. I bought the TV for my husband n when it arrived it had a dent than when we turned it on the screen had a line on it ofcourse he didn't want me to even call cause it he didn't want the hassle but its ok for the most part it was cheap n I think it was the packaging problem.. u should put more than just bubble wrap in a box.", "Date": "April 27, 2013"}], "ProductInfo": {"Price": "$399.99", "Features": "Vertical Resolution (Digital Compatibility): 720p\nScreen Size: 31.5\"\nAspect Ratio: 16:9\nMaximum Resolution: 1366 x 768\nContrast Ratio: 3,000", "Name": "Element ELCHW321 32-Inch Class 720p 60Hz HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/31Ci6r6ofdL._SX300_.jpg", "ProductID": "B003EYOBTU"}}