{"Reviews": [{"Title": "Excellent Picture", "Author": "Hunter Blackstone", "ReviewID": "R27HORF6MRS74B", "Overall": "5.0", "Content": "We have had this TV for three weeks. It replaces a Vizio 50\" Plasma purchased 4 years ago that died.- Picture quality is outstanding. Very dark black with no visible back-lighting. NFL games and fast-action video work great. Side-angle viewing is good with this TV.- Tons of inputs.- Vizio Support answers the phone promptly. They're helpful and courteous.- Excellent matte screen surface with little to no glare from lamps, windows, and doors. Because of the matte finish, we opted to move our TV location perpendicular to a an 8ft sliding glass door out to the pool. We have had no problems with light or glare degrading picture quality. In contrast, this door would have caused extreme glare on the slick surface of the plasma, while also washing out the picture.- Internet Aps are handy. Neflix is the one we use primarily. Because the TV is now the sound source, an Optical Cable is needed for connection to the Receiver. Once setup, sound and picture quality are outstanding. Getting to a list of movies with the VIA button on the remote takes only a couple of clicks. The NetFlix ap works so well, we barely use our media computer hooked up to the system.- Remote Control and TV Setup menus on the unit are intuitive, easy to use, and graphically well done. The TV picture quality was great for us out of the box, requiring no adjustments. Remote control setup via the on-screen configuration automatically tries codes and only requires the user to click \"worked\" / \"didn't work\" in order to cycle through and find the right code. Best remote setup I've ever seen.- Remote Control itself is nearly perfect. Well-spaced buttons that are easy to read and arranged logically and in similar locations to other DVR's. Physical size is ideal, Not too long like many remotes. Keyboard flip out is a fantastic addition.- TV mounts to a wall without any problems. (We used the Vizio XMA 1200--worst user manual I've ever encountered) The unit is surprisingly light, given the TV's size. Still best to have two people when hanging the unit on the wall.- Because our previous Vizio died after only 4 years, we bought a 4-year Square Trade warranty from Amazon (STAY AWAY FROM ALL WARRANTIES BY THE COMPANY \"NEW\"). Our Sams Club warranty was through NEW. A month of being hassled resulted in our TV being picked up and taken to a local shop. After another 10 days NEW gave us an undetermined ETA on Parts for the repair. We called SAMS CLUB and explained our warranty nightmare. Sams Club Manager told me to bring in the TV. NEW Refused to give the TV back. I found a phone number to the shop they contracted out and was able to get a address, then go pickup the TV myself. Sams Club gave us a full-refund! Avoid NEW (read reviews here on Amazon of New Warranties). Vizio also offers a similarly priced warranty extension. There is paperwork in the box for purchasing this product from Vizio.- We're very happy with the TV.Update 3/16/2011We've had this TV now for approximately 6 months and are still happy with it. However, one complaint: I notice on very black screens where there is a an object that is brightly colored, you will see haloing. For example, credits on a movie where the screen is black and the text is white will show haloing around the text. Another example, the moon against a black background will have haloing. Seems to be a panel lighting issue. This issue can detract from your viewing experience in these high contrast scenarios.", "Date": "September 29, 2010"}, {"Title": "Excellent Picture Quality, Features, and Customer Service!!!", "Author": "Amazon Customer", "ReviewID": "R1Y68XNWKQPA6N", "Overall": "5.0", "Content": "First of all my review is solely for the TV itself, and not Amazon, since we purchased this TV at Wal Mart. - Start up and Set up -With so many features offered I thought this TV might be overwhelming to set up out of the box - it ISN'T.  It walks you through step-by-step on things such as synching up the remote with your cable/satellite box, receiver, setting up the network to use the \"WIDGETS\" (or apps), etc.  I was up and running literally within 10 minutes. - Picture Quality -The picture qualioty is AMAZING.  I Googled \"XVT553SV picture settings\" and used the settings found on a CNET discussion board [...], but added my own tweaks such as I turn the back light up some, and for my XBOX 360 input I turn color enhancement on \"normal.\"  The colors are very rich, the black levels are AMAZING so long as you've got the Smart Dimming turned on, and there is little, if any, \"blocking\" or pixelation when there is fast moving scenes like waterfalls, or explosions on movies. - \"Smart Dimming\" local dimming -While the picture is certainly great, it has some flaws.  There is some \"blooming\" or whitish halos around white objects that are against black backgrounds.  I only see this on slow, or fixed screens such as when changing inputs and there is an all black screen with a \"No Input Selected\" white message in the middle of the screen.  It is also more evident as the viewing angles get wider.  Evidently this is a by product of local dimming (Smart Dimming) but in all honesty I NEVER notice this when watching TV, playing video games, or watching movies.  You quickly notice how BLACK the screen can be.  I have an LCD 1080p TV and a DLP 720p TV and neither come close to the black levels on this Vizio with its Smart Dimming turned on.  When the screen goes black it looks like the TV is OFF!  Not so with the Smart Dimming turned off. - Smooth Motion Feature -With ANY 120hz TVs (this is truly a 120hz TV with a scanning back light creating a \"240hz\" like affect) the \"smooth motion\" feature can make cinematic shows/movies look strange.  It has been described widely as \"The Soap Opera\" effect, and it makes even wonderfully filmed/edited shows/movies look as if filmed with a camcorder.  Camera panning looks wobbly, peoples' movements are super smooth, but it really looks like you are there while filming, which is NOT good.  Simply turn off the Smooth Motion feature if watching anything such as movies, or movie-like TV shows that are not reality TV, etc.  Sports look AMAZING with Smooth Motion turned on high.  Animation and CGI animated shows/movies look AMAZING with Smooth Motion turned on. - Gaming on the Vizio -I play an XBOX 360 console, and with some types of TVs delay can be evident when playing.  Not with this Vizio.  I play lots of first person shooter games, music type games requiring perfect timing for inputs from musical instrument type controllers, and motion-based Kinect games which also require perfect timing.  Everything runs smoothly on this TV.  The picture quality is the best I have EVER seen when playing XBOX 360 of any TV I've seen/owned. - Sound -Surprisingly such a thin set of speakers sound pretty darned good.  I personally turned my speakers off, and I use the Vizio remote (I'll get to the remote itself) to adjust the volume on my receiver and use the larger speakers.  This not only gives me better quality, but it saves me from blowing out the small Vizio speakers down the road like one of my other flat panel TVs has in the past. - Inputs -Inputs are abundant with this Vizio, with HDMIs dominating.  I know component cables are on their way out, but only having ONE component in (the 5 wire input with red/green/blue video and white/red audio) might require one to buy a switching device that takes one component in and turns it into three such as the one in this link [...]which can be $45.00 or more depending on quality.The ability to custom name inputs (rather than having generic \"game\" or \"cable\") is a nice touch.  You can have \"Cable Box\" or \"Direct TV\" or \"XBOX360\" or \"PS3\" etc. etc.  For those that have literally 5 HDMI devices plugged in it keeps things much more organized in the menus. - Remote Control -This might be a polarizing topic for this TV.  I LOVE the remote.  It does feel slightly \"cheap\" due to the slide-out portion not really staying 100% solid when not in use, but it doesn't bother me.  The remote being bluetooh enables one to control the TV without pointing anywhnere near the TV, in fact, I can control the TV in another room altogether if desired.  The remote also linked to my cable box and stereo receiver in a very simple menu that asks \"what model\" you have, then it auto scans and asks you to perform a funtion for the device, then click \"yes it worked\" or \"try next code\" and mine both worked on the first try.The slide out QWERTY keyboard is not PERFECT, but it's great.  The top row of buttons can be obstructed by the fixed portion of the remote, but it's better than not having a QWERTY keyboard at all.  It seems like a NECESSITY when using WIDGETS/apps such as Facebook, Twitter, Netflix (makes searching easier) etc. - Widgets/Internet Apps -What can I say?  I don't know how we did without these before.  Right out of the box we have Yahoo! news, weather, sports, fantasy football (updates stats real-time while watching TV), Pandora internet radio, Blockbuster on Demand, Hulu Plus, Facebook, Twitter, Amazon movies on demand, and TONS more.  I can check my local weather, or any number of custom-set cities around the world.  It's funny to ask XBOX friends in England how they're enjoying their current conditions when we chat.After another firmware update (second one since Christmas) we not only have MORE Widgets, but the interface for existing ones (Netflix for one) has been improved upon.  It's nice to know that they aren't resting on their laurels when it comes to the apps.The wireless connection is STRONG.  It auto detected our wireless network, and it works so well I've not yet climbed in the attic to run a dedicated ethernet cable to the TV as I'd planned to.  I can stream Netflix as smoothly (maybe better?) then I can with my ethernet-wired XBOX 360!!!  I have not had it slow/pause a movie/playback due to internet/connection speed yet!  This is also on a wireless G router too, and not the fancier N router.***WARNING ABOUT THIRD PARTY/INDEPENDENT APPS!!!***I have discovered that at least one third party, independent app was causing my TV to shut itself off and cause it to go in a \"standby\" mode.  The entire issue is explained in the next section.  I would steer clear of any apps not made by big companies.  The exact app name is \"1337 Pwn\" and it's published by a company called BrickSimple. - Problems and Vizio's customer service -With all of the great things I've said about this TV, it did have a few bugs to work out.  First of all the TV would shut itself off after 10:00pm (hey that's what it did!) and then the Vizio logo would flash orange/white just as it does when it receives a firmware update.  After a few days of this I was about to exchange the TV for another just like it, but decided to contact Vizio customer support first.  Through a series of messages with a REAL PERSON in a real time chat on Vizio's website, we set up a phone call with a \"Level 3\" tech to see if we could fix the issue.  We did a \"memory clear\" procedure and the problem was FIXED.  A real human being in AMERICA that spoke perfect English helped me not only fix the issue, but also walked me through resetting all my settings AND told me about some features I didn't know about.***UPDATE***I believe I have found the true source of my shutting down problems - BAD THIRD PARTY APP!!!It was only AFTER I added a third party app for monitoring XBox Live friends (The exact app name is \"1337 Pwn\" and it's published by a company called BrickSimple) did the TV have the shutting off issues.  I was able to figure this out when I finally re-added this exact app to the TV (I never added it after \"fixing\" the TV with Vizio Tech on the phone) this week, and what do you know?  Random shutting off with the flashing Vizio logo!  I deleted the app, and once again TV works perfectly as it should.  When Vizio Tech walked me through the rest it deleted any apps not already on the TV, the XBox one included.  THAT is why it \"fixed\" the TV! - OVERALL -I could not be happier with this purchase.  I know nobody likes to spend lots of money only to say how crappy the product was, but if I were not 100% satisfied with this Vizio XVT553SV I would have easily exchanged it for something else.  The fact is I cannot think of any other TV that offers the same features, picture quality, etc. for the price.  Some top level plasmas might do the trick, but they put off more heat, and suck much more power.  If this Vizio lasts for YEARS without issues I could call it the PERFECT TV, and would absolutely buy more Vizio TVs in the future.", "Date": "January 8, 2011"}, {"Title": "This thing rocks!!!", "Author": "D. Lindsey", "ReviewID": "RJVN97C5HB6G0", "Overall": "5.0", "Content": "This TV is amazing. The only thing more incredible is the bargain. I have been shopping flat screens for about a year now. I almost pulled the trigger on a Samsung C8000 until I came across this TV. You get everything Samsung has to offer minus the 3D which, for me, is still too new to invest in. This model boasts a 10,000,000 to 1 Dynamic Contrast ratio compared to Samsung's 8,000,0000. Blu-Ray (Sony BDP-570) looks and sounds spectacular. DirecTV HD shines as well. The set-up was a breeze. The only problem I encountered was the actual wait-time to get this thing. It took about three weeks since it was on pre-sell. However, once it was released, the shipper contacted me and I had this thing in my house three days later. If you want a TV packed full of features that you can actually enjoy but don't want to drop $3,000....this is your set. Pair this thing up with a decent home theater (I have the Sony HTSS370-It blows us out of the living room.) and you will truly be able to enjoy movie night at the house! I can't wait for College/NFL football to crank up! Vizio has stepped it up big time with the new XVT series!!!", "Date": "August 9, 2010"}, {"Title": "*Update* It is being shipped back!!!", "Author": "A/V Man", "ReviewID": "RGLGA8S62QDLF", "Overall": "3.0", "Content": "This TV is very nice. The picture quality is outstanding. The features are amazing and overall the quality and feature set of this set rivals many of the bigger TV manufactures (Sony, Samsung, LG, and Panasonic). I have a very bright room and the anti-reflective coating really does stop the glare. I am super happy with the purchase and Amazon rocks. The guys who delivered the set were a bit sloppy, but everything arrived on time and in good working order. My only complaints about the set are the lack of an LCD screen on the remote (so you know which source it selected) and I wish the lighted logo could be turned on or off. Otherwise it is a great set with tons of features!!!*Update 1*I do love the set but it is going back. 1st being that is freezes constantly. I had it freeze 5 times in 5 days. Not good. each time requires me to unplug the unit for 1 min. Plug it back in and wait another minute while it re-boots. This is not good because it is in a TV console and is difficult to reach around to remove the power as the stand doesn't rotate. 2nd, I noticed a pink outline around 10-15 pixels wide and 2-4 pixels high that will not go away. It can be seen up close or is really dark scenes. Knocking the set down 2 stars for this. I am so bummed as I really love this set. I may wait for a newer production unit or pick up a CCFL LG. Amazon is currently out of stock. Sorry Vizio, I tried...*Update 2*Picked up a LG 55LD520 and love it. I really was not sold on LED back-lit sets yet. I think the nano led back-lit TVs will be much better. This CCFL LG has an incredible image and much better screen uniformity. No blooming whatsoever. The colors are spot on. I will miss some of the features of the Vizio, but the LG turns on fast and doesn't freeze. I am really impressed with the image quality of the LG. I saved hundreds of $$$ over the Vizio as well. Thanks and I hope this helps.", "Date": "September 20, 2010"}, {"Title": "What a steal!!!", "Author": "wayne", "ReviewID": "R3ZCY9PT3296V", "Overall": "5.0", "Content": "This picture is incredible, looked great in the store and even better once I started watching football.  News channels like fox news and cnn look great on this set as well.  I love all the features you can use from the wi-fi capibility.  You can download different games and other widgets including streaming netflix directly to your set and the quility is very good (I have xfinity from comcast, you probably need a high speed connection to make use of this).  The remote control for this tv has to be one of the best designed remotes out there.  You can easily program all your devices just from selecting the brand of each (no need for entering codes).  Plenty of HDMI outlets for all my toys.  My PS3 looks AWESOME on this screen.  I'm not big into surround sound, the built in speakers seem fine to me, but I'm not an expert on sound as its not that important to me, since i live in a condo.  I shopped around everywhere and this model was easily the best bang for your buck, other with 55\" 240hz and 1080P were all about 800-1000 dollars more.  I bought mine at BJ's which had the best price around.  I can't imagine this TV getting a bad review unless it was a defect.", "Date": "September 1, 2010"}, {"Title": "The Perfect LED TV", "Author": "Pritch", "ReviewID": "R2Q8XIOFS3WE15", "Overall": "5.0", "Content": "Yes, I am a crazy researcher who delved into every review and every rating for the best LED HDTV on the market. We visited retail stores to look at many TVs and to ask hundreds of questions about every detail regarding bright room viewing. We placed this Vizio in our family room that has skylights and wrap around windows. The picture is amazing in full sunlight. The matte screen prevents any glare. This is the best picture I have seen in any venue, whether home theater setting or brightly lit home setting. I set the TV up myself within twenty minutes. The setup guide comes right through the TV. Just plug it in and follow instructions.This model lives up to the top ratings given by Cnet and other reviewing sites. There are many picture settings available, but I found that the presets for any sports are perfect. I watch every sport and this model has presets that really enhance football, basketball, golf and baseball. We have had the set for about a month and the internet connectivity has been a real plus. We use Vudu and Amazon for HD downloads and probably will not buy a blueray player since we can get blueray over the internet through the apps that come preloaded on the TV.If you are looking for the best fully backlit LED TV on the market, you could pay thousands more for a Samsung or LG that is only comparable to the Vizio. Thank you for American technology, Vizio. We can still compete with the Asians. And thanks to Amazon for the best pricing available.", "Date": "December 10, 2010"}, {"Title": "Don't be snubbed by snobs", "Author": "Lazyboy", "ReviewID": "R3RT49XCW0R085", "Overall": "5.0", "Content": "I spent a good bit of time researching what I wanted to replace an 11 yr. old projection LCD. I read plenty of reviews and details on the technology and I had decided was important to me.I looked at multiple publications and finally looked at the picture compared side by side with others in a retail store.Here is the short version- great picture regardless of my source (some tweaking done but even out of the box this was still true.)Easy set-up. Didn't even open the manual until a few days later to see what else this unit had that I could use.Internet set-up was easy and the apps were those I was most interested in having access to.Great remote with bluetooth (back lighting would have made it a perfect remote)Plays well with my other toys.You can spend much more but unless you are are a video freak or just simply a brand fanatic, you will over-spend.I haven't owned it long enough to comment on reliability but I've had no problems and am very satisfied that I made the right decision.", "Date": "November 3, 2010"}, {"Title": "Love this TV", "Author": "Hador_NYC \"Mike\"", "ReviewID": "R1252OPN430UKH", "Overall": "5.0", "Content": "I had been studying TVs for a bit less than a year.  I finally pulled the trigger on this one, about 2 weeks ago.  It arrived today.  I tuned it with settings I found online.  This thing, besides being huge, looks great.  I replaced my LVM-42w2 with this one; the old 42 is relegated to my bedroom.  CNET, and a few other sites, called this one the current (11/12/2010) best picture quality.  I have spent a lot of time in my local (NYC) electronics stores looking at Sharps, LGs, Samsungs, and Sony tvs.  None have a better picture quality.  I'll agree that all the others look better on the outside, but the screen is great.Better than those others, this one's screen has a matte finish.  The matte finish reflects a lot less light, and less clearly, than the other brands I mentioned.  The others looked like mirrors, whereas this one reflects images much more blurredly.  Reflections are weak and not clear.Widgets are good and work snappily.  Netflix, using the wired connection, looks better than on the Wii; the Wii uses Wifi, and is connected to my TV via component video; so the direct Netflix Ethernet connection should be faster for both types of reasons.Overall, I am very happy with this new giant monster in my living room.  I can't wait to watch sports on it this weekend.Bought it here at Amazon.  Shipping took about 9 days from order date.  Box was well handled, and in good shape.  As you might guess, the TV inside the box was undamaged.", "Date": "November 12, 2010"}, {"Title": "Amazing new Vizio LED TV", "Author": "Ben L.", "ReviewID": "RNUIRBN4GQKI1", "Overall": "5.0", "Content": "This is the third Vizio I have bought in the past 3-4 years and there is a reason I keep buying from Vizio - great quality for a great price.  I remember doing months worth of research on various TV's and comparing prices from all over before finally deciding to buy a \"37 Vizio LCD back in 2007.  This TV was the same - lots of research and finally deciding to buy this one.  I couldn't be happier.  Having never owned an LED TV I was a little nervous but was pleased as always with my new Vizio purchase.  The delivery was not the fastest (courtesy of Pilot) but they were very friendly and helped me set it up on a stand and check that it was functioning properly.The TV itself is surprisingly light for the overall size.  The picture is phenominal - crisp and clear for my 1080 HD TV and Blu-Ray player.  I was also impressed by the sound quality from the TV itself.  It isn't superb but for the size of TV and the room it is in (22' x 18') it fills the room nicely.  The remote itself is OK - the pull out keypad is nice but frankly I don't use the Internet on the TV.  It would be nice if it was backlit but such is life.  The TV has quite a few input jacks and I can't think of anything it is missing feature-wise.  I wish I would have waited a few weeks because Amazon dropped the price by close to $200 from when I ordered it but I am completely satisfied with the TV itself.", "Date": "October 15, 2010"}, {"Title": "Awesome TV, a few bugs to be ironed out", "Author": "patemery", "ReviewID": "RRCQ3ZOEAZ5IP", "Overall": "4.0", "Content": "I've had this TV for nearly a month. I had the issue that others have noted where the TV would freeze up. When the TV was on it would have picture and sound but could not be changed AT ALL. Couldn't change channels, input, volume or even turn it off. Not even using the button on the set. Had to unplug. I contacted customer support and their level 3 technician walked me through a set of steps that involved 1 finger in my left ear and my right foot on black while holding three fingers on my right hand up to the sky ...... This cleared up the problem and the tech said that it shouldn't re-occur. I have not had the problem again. I've had some issues with the wireless-N wifi as well. I got tired of fussing with it so I just hard-wired it to the switch. I am now very happy. I would recommend this set to others as it has an awesome feature set and picture quality at a cost much lower than other brands. This is a brand new set just released from the manufacturer within the past couple of months. I wonder if newer production sets might have some kinks worked out so waiting a couple months might avoid some headaches.", "Date": "October 29, 2010"}, {"Title": "Cautiously Hopeful", "Author": "Bruce Clark \"Long Valley, NJ\"", "ReviewID": "R123ICTROV4ODQ", "Overall": "4.0", "Content": "My wife and I were impressed with the features and price-value, but had no experience with the Vizio brand.  The positive review in Consumer Reports gave us the final \"push\" to make the decision, and we also purchased the SquareTrade coverage as insurance.  The TV arrived in record time, was a snap to set up, and we couldn't have been more pleased with the picture quality, viewing angles and on-board sound.  2 weeks into use, however, the TV went into an endless bootup sequence and wouldn't work.  Our first call was to Vizio Tech Support.  They were friendly and  indicated they would need to dispatch a technician to inspect the unit, although they were somewhat vague on when that would occur.  To make sure all the bases were covered, we also called SquareTrade and were surprised to hear that even though we had a four-year policy, there was nothing they could do to get us back in business.  \"You must work this out with the manufacturer as long as the unit is under warranty\" (so why is it that they say that coverage starts on Day 1?).  Our final call was to Amazon customer service, who immediately shipped a replacement unit at no cost.  The new unit arrived before the Vizio tech would have even come out for the initial inspection.  My wife and I are hopeful we experienced a once-in-a-blue-moon failure and that the basic unit is well engineered and reliable -- time will tell.  What I would like to emphasize to fellow purchasers is the EXCEPTIONAL way that Amazon handled the situation. No finger pointing or fine-print mumbo-jumbo -- just top-notch customer service.  They really have their act together.", "Date": "May 30, 2011"}, {"Title": "UPDATED:  I wanted to believe in Vizio, but they lost my business", "Author": "Jeff from B-More", "ReviewID": "R3NMLRVV06BFTM", "Overall": "1.0", "Content": "After weeks of research I decided to purchase the Vizio XVT55SV TV because it was the CNET.com Editors Choice LCD TV of the Year.  They don't rate the warranty or tech support on their though.  I ordered this TV from Amazon.com on 12/3/2010 and it was delivered on 12/8/2010.  I unpacked it and let it sit at room temperature for about 3 hours before turning it on for the first time.  The picture quality is fantastic and the WiFi hookup is simple and quick.  I was streaming Netflix in about 5 minutes.  Don't get your hopes up for the picture quality of Netflix though.  It's \"okay\", but not HD.After about 2 days, each time I turned the TV on for the first time of the day I noticed screen pixilation and there was no sound for the first minute or two.  After that minute or two the picture would get back to normal then the sound would crackle then finally get to normal.  I tested the next morning by turning on the TV and using a different component(Blu Ray Player) in a different HDMI input.  Same result.  About a week later I got the first \"freeze then shutdown\".  Yes, the screen literally froze in the middle of a football game, then went black, then the Vizio light blinked on and off about 6 or 7 times then the TV turned off.  It was annoying.Randomly there was a pink hue on the screen as well when first turned on.  After seeing the pink I did the power cycle(unplug for 30-60 minutes) and I haven't seen the pink screen since, but the initial daily picture and sound are still messed up, plus it froze and shutdown again last night and today.4 days ago I called Vizio Tech Support.  They opened a case and asked me for details and I asked what the next steps were.  They said they would send this to second level support.  After hearing nothing back for 2 days I called them and they asked me to fax my proof of purchase so they could proceed with service.  They got that and I asked what the next steps were AGAIN and NOW they said I needed to take a picture of the issue on the screen and email it to them.This is where I am right now.  At this point it's getting a little annoying.  I don't like jumping through hoops after spending this much money.  The people at Vizio are always nice, but so far I am completely unimpressed with how they respond to THEIR TV not working properly.  I am giving them one week to get someone out to fix it or send me a replacement before I lose my patience and just return to Amazon.  It's not Amazon's fault this TV is faultyI truly want to believe in Vizio products and support so I can recommend them to everyone, but they are making it difficult at the moment.  I will update once I hear back from Vizio.UPDATE 12/23/2010:  I got an email confirming they received my pictures.  They gave me a few things to do to see if it would work.  After doing a \"Clean Storage\" reset then reprogramming the TV the issue was still not fixed.  I called Vizio back and the first-level support guy talked to the third-level support guy and guess what they wanted.....MORE pictures.  At this point I told the poor guy how I felt about their support.  I asked him point blank how he would feel if he just spent $1500 on a TV that wasn't working correctly and had to call their tech support over 8 times in 4 days JUST to be told I had to send MORE pictures to prove what I have told them since day 1?  The poor kid said, \"Yeah, that would suck.\"  I asked him to have a manager call me back so I could talk to them.  Within 30 minutes a manager called me and said after reviewing the notes on the case I was put through more grief than I should have been.  At this point I told him I wasn't mad.  I was disappointed that I couldn't go to bat for Vizio.  I was counting on them to fix THEIR product, but in the end I couldn't take anymore hoop-jumping.  I called Amazon to ask them to send someone to pick up the TV.  I could have gotten a replacement, but I will not go through this again.  Case closed.  I am not bitter.  I truly wanted to write a good review about this TV and Vizio as a company.  I cannot recommend buying anything from Vizio because if something goes wrong they will not take the effort to make it right.For the love of God.  Please don't put yourself through this just to save a few bucks.  There is a reason these TV's are as inexpensive as they are and I had to find out the hard way.UPDATE 12/30/2010:  I bought a replacement Samsung PN58C550 58\" Plasma $200 cheaper than the Vizio 55\" LED and LOVE IT!  There is absolutely no pixilation like the Vizio, no pink screen like the Vizio, no need to call Vizio tech support ever again, and most of all it has a fantastic picture so I am VERY happy!", "Date": "December 23, 2010"}, {"Title": "1 minor issue, 1 moderate, good tech support UPDATED!", "Author": "Amazon Customer", "ReviewID": "R2UMOKTOKCBXRP", "Overall": "4.0", "Content": "I first saw the set XVT553SV at Sams (for $150 less than Amazon) I started researching. I read many great reviews here, at Sams.com, cnet.com, and a couple of others. I also read ALL the bad reviews & considered everything carefully. I got it from Sams, and quickly ran into a setup issue. The setup wizard asked what my cable source is: cable box or straight from wall. Mine is from a box, via coax, so I said box. Then it wanted me to specify the input, but the coax/rf input wasn't an option. I tried everything I could think of, then turned it off & waited for regular business hours to call Vizio. A friendly guy named Harley (speaking standard American English) walked me through the setup and all was well. The procedure, by the way, was complex enough I already forgot the steps! Minor issue, good support, satisfactory outcome.The next issue a week later was setting up a new Sony AV receiver, STRDH820. I picked this in part because it has ACR (audio channel return) meaning the TV can send audio back along the HDMI cable & you can use the receiver to get surround sound for the TV with only the HDMI cable. I am doing my best to eliminate as many wires as possible. I even ordered all new HDMIv1.4 cables that support Ethernet, 3D, and audio return. I wanted to make sure the cables are interchangeable in case I swap the cables around. I CHECKED ON VIZIO.COM TO MAKE SURE THE TV WILL SUPPORT ARC. It says ARC is supported on HDMI 1 only, you can verify this at \"[..] plus I saw it in at least one review.I spent a very long time trying to make this work, but finally called Vizio. They said no way, this TV doesn't output anything from the HDMI port, it's for incoming traffic only. (the reference to ARC on their website is a mistake, or so they say) They said use the RCA stereo out or Toslink optical to send the signal to the receiver. Back to Wally World to spend another $19 for fiber optic cable. I hooked it up, the AV receiver now runs the TV sound through the surround sound speakers. Guess what - the overall sound isn't as satisfying as the fake surround the TV creates through its own speakers, at least for the one sitcom I tried it on. I'll try tweaking things through the receiver when I have time. Moderate issue, OK support, marginally satisfactory outcome.Overall, the TV is great. the picture is beautiful. I still haven't tried it out with the Wii, I tested the Internet Apps and can't see any reason to get excited, but movies are great & TV is mostly great. ABC is on channel 3, the channel my cable box tunes through, and has some odd horizontal banding, but I'm 99% sure this is a cable system issue. Charter has always had goofy sound issues on FOX, and I think this is their fault also. It's so minor I don't know if it's worth the time to try & fix it.UPDATE - next afternoonAfter posting, I finished reading every single review here, and someone mentioned the Audio Return Channel issue, but said she solved it by adjusting the CEC settings. I looked at Vizios' info some more, and at other online resources, but saw nothing about it, so I entered the Vizio \"MENU\", then \"TV Settings\". The bottom choice is \"CEC\". Then I set \"CEC Function\" to \"ON\" and \"System Audio Control\" to \"ON\". The last item here was \"Device Discover\". When I entered this item the TV found my Sony AV receiver and Blu-Ray player, even though they were off. I turned the receiver on, then went through to the back of the TV & unplugged the Toslink optical cord, and in the menu I turned OFF the TV speakers. The sound is now coming through my surround sound system WITHOUT a separate audio channel, just like audio return is supposed to work. Mind you, Vizio swore this won't work with this TV, but what the heck.Too bad I already bought the optical cable. I'll put it in a box with my multiple RCA audio & video cables and my digital coax, and a couple hundred bucks worth of other adapters I bought when they seemed really important.", "Date": "April 22, 2011"}, {"Title": "So nice I bought two", "Author": "teddybarelover \"teddy\"", "ReviewID": "R1I9KT5PMSDIG2", "Overall": "5.0", "Content": "First I am not rich so let me tell you how I came out purchasing two of these tvs. My mom 75 birthday was on Thanksgiving Day. I wanted to provide her a nice tv for her birthday and really wanted to make it special since this was the first HD TV for her home. All of the family was over for the holidays and all the comments about this TV was very positive. The picture is awesome. Setup was easy and the price for this type of tv I thought was a deal compare to others on the market. I had a older model 60 inch 1080I that I was looking to replace with another 60 inch or larger. But after vieiwng this TV I stop the search for anything else. Initially I kinda moan. You know bigger is better....but after a couple of days in my house. The only moaning I am doing is due to the beauty of this set. This is really a no brainer. Save youself sometime and go for it.", "Date": "December 10, 2010"}, {"Title": "VIZIO XVT553SV 55-Inch", "Author": "scottcollins", "ReviewID": "R2SI8RP55GPLKW", "Overall": "5.0", "Content": "I am not a videophile. I use a TV to watch sports and some reality shows, and to play some DVDs for the kids. So take my opinions for what they're worth.This was my first HDTV purchase so I relied on reviews and recommendations from CNET, Amazon and Consumer Reports. CNET sold me on this TV and the one gripe they had (viewing angle) turned out to not be a problem for me. Ironically, Consumer Reports gave this TV a \"Very Good\" on viewing angle and I tend to agree.I never saw this TV until we uncrated it in our living room. I didn't want to be persuaded by the retail store conditions that tend to make everything look great.I have a large room with ceiling-to-floor windows across the entire west wall (ton of sun), opposite the TV location, and worried about reflection. The matte screen negates this effect almost entirely during the brightest of times of day. If I concentrate, I can make out a window or a lamp (at night). At all other times, there is no reflection at all.Set up was a breeze, even with connection to internet. Another reviewer said his didn't support WEP, but I had no trouble using WEP. Check your router.The picture is great from all angles and distances. We have a morning room that is offset by about 45 degress and twice the distance of regular viewing, and the picture looks just as good. Audio is what I would expect from a TV. I have an A/V tech coming today to mount on the wall and hook up all of my components - Devon receiver, Bose surround, LG Bluray and Wii - so audio options will increase.Some generic reviews about LCDs warn of bluing of the blacks, and of \"blooming.\" First, the blacks on this set are truly black - period. Secondly, there is a slight blooming during the credits of some movies, but I seem to only notice this when I am in the corner at about 45 degrees. The \"Smart dimming\" feature makes this a non issue for most settings.I didn't buy this TV for the internet apps, but found they are easy to access, limited in function. For example, yes, it has Facebook - no, you can't do everything you can online - pretty much limited to your Wall. Headline news/sports is nice for a quick check, and because we have a full home sound system, we use the internet radio and Rhapsody (subscription required) apps daily. With the combination of wireless components I can get pretty much everything I want from my TV. If I need something else, my laptop is 5 feet away.The remote is not intuitive and has no backlighting. I'm sure some of this comes from me using the same cable universal remote for years. For one thing, it feels like youre holding it upside down, and when you look, the logo is at the bottom, not the top. This usually results in me changing the channel when I am trying to adjust the volume. Another problem is that while it does operate the cable box (setup's a breeze) it doesn't allow access to the full program description. The QWERTY keyboard is nice, but in the hands of a fidgeting 8 year old, I fear it won't be long for this world. We use the cable remote for daily watching and leave the Vizio remote on table for VIA access and input changes.When pricing this TV, I didn't want to spend $1,000 to get \"almost\" everything I wanted when I could spend $1,498 and get \"exactly\" what I wanted. I don't know if this means I got a \"good deal\" or not, but I am satisfied with what I got for what I paid. While Sam's Club still lists this price, good luck finding one at a club. They're out, or have a floor model available.Finally, we've had many friends over since the purchase and they are all amazed at the picture. Even my techie friend with the Sony plasma was pointing out all the things he liked. When I go to the stores and look at TVs in the optimal settings, I still think my Vizio looks better than most at any price.", "Date": "December 22, 2010"}, {"Title": "Amazing picture out of the box", "Author": "Aprelak", "ReviewID": "R1BJPD0499JPYC", "Overall": "5.0", "Content": "VIZIO  XVT553SV 55-Inch 240 Hz TruLED LCD HDTV with VIZIO Internet Application, BlackThis led is truly amazing directly out of the box. I've researched Samsung and LG and decided on the Vizio after viewing at my local Costco store.Purchased through Amazon as they offer free shipping. The delivery went perfect and they not only delivered the set timely but offered to unbox and place the tv for me so I wouldn't have to lift it.The experience was more then I expected. I would however not purchased the square trade warranty. The 3 year warranty only covers 2 years as the first year is warrantied by Vizio. Purchase instead the warranty directly from the manufacturer as thier warranty begins after the 1st years warranty expires.Hope I've helped.Aaron Prelak", "Date": "November 5, 2010"}, {"Title": "Vizio 55\" XVT553", "Author": "Me2", "ReviewID": "R2YAWN1QDYH85A", "Overall": "5.0", "Content": "I received my Vizio XVT 553 55inch last week.So far so good. Good color.Shipping was fast CEVA is great.Good price, costco and sams has older 550 and 551 model for similar money.Worth getting the 553 over the 552, much better looking and thinner.Its 12/28/10 this tv is awesome, brilliant. No issues. Lots of use. :)", "Date": "August 13, 2010"}, {"Title": "JUNK: Purchased Two, Returned Two", "Author": "Just Me \"Customer\"", "ReviewID": "R2KGKC415HEODV", "Overall": "1.0", "Content": "Pros:-Low Price for backlit LED-A lot of hookups for anything you can imagine-Widgets & All kind of cool features.Cons:-That I have had two and both went back to the store-Freezes Up Constantly-Screen scrambles on cold starts-MAJOR BLOOMING even when sitting directly in front of the tv 12 feet away.Summary: It takes a lot of bad for me to give a one star review. I know that electronics can be faulty. I know that with every major electronics buy that you have roughly a 3% chance of the product being faulty in one way or another. So I will tell you my story. 6 Days ago I went to my Local Sams and purchased the Vizio XVT553SV. I've been wanting a new tv and did some internet reviews for weeks and finally decided to go with the Vizio. The reason I bought the tv is because every time I looked at what I wanted on reviews I always came back to this tv, and with the great reviews from Amazon & CNet I decided that I would roll the dice.So I buy the tv bring it home take it to my man cave(finished basement)Plug it in and go through all the steps and hook it up to my PS3 via HDMI hookups.TV looks pretty amazing. I watched SPEED RACER on bluray and wow I was stunned at the clarity. Went to bed.Next morning went downstairs to see my new baby (the tv) turned it on and fired up the PS3.WOE! Scrambling all over the place of picture..lights flashing all kinds of crazy stuff going on with the screen. I checked all the HDMI inputs wondering if I just had one that went bad overnight or something and that wasn't the problem..though hmmm wonder if my HDMI cable went bad so took the PS3 and hooked it up to my 40\" SAMMY LCD 650 series and it worked flawlessly...hmm not the HDMI cable.Went back downstairs plugged PS3 back in to tv..same thing..distortion everywhere. I'm not talking light fuzz..I'm talking scrambled picture like when you're a teenager trying to tune in a cable channel that you don't get so you can see a glimpse of skin bad....actually worst.Weird thing is...3-5 minutes later the picture would slowly unscramble and tune in and picture looked perfect...so I thought ..hmmm what the crap?My nerves calmed and I decided to throw in Inception (bluray)....OMG what happened? I didn't the major blooming on Speed RACER because that movie is such a bright movie. But watching Inception It is the worst case of blooming I've ever seen. I said that was it..I went to turn the TV off and BAM I can't. TV just froze on me solid. I actually had to hold the power button down on the side for 30 seconds to get the tv to turn off. So I thought to myself...wow, I must have just got a lemon. I called the Sams I bought it from, told them what was happening and they said that I could return it and get another one but they were out of stock so the next closest Sams that had it in stock was 74 miles away.FINE.Took the TV back exchanged it for another brand new one.got it home took it out of the box and OMG scrambled to hell again..then tv eventually warmed up and picture came in...but the new tv still had MAJOR Blooming...I'm not talking light blooming either I'm talking halo angel like effect in dark scenes.Needless to say I took the tv back.Now here is the deal. I've had two brand new TVs from two totally different sams club areas. Both were majorly messed up. I think that is pretty high odds. I don't know if they changed the electronics in these things or Vizio is playing panel lottery butI wasn't a happy customer.I did go to AVS forums and in the last 30 or so pages is starting to become a major recurring problem with these TV's. I think it's only a matter of time before CNET starts getting emailed telling them that this in no way can be a Editors Choice for 2010.I will tell you this..some have taken pictures and put them on the site and are not having the blooming problems nor the startup problems that others are having. And believe me I'm pretty technical. I've tried everything...changing HDMI cables from 1.3 to 1.4, trying other electronics instead of the PS3 for startup. Tweaked calibrations...even freaking doing crazy things like messaging the screen like some have did for other TVs to help with blooming. What it boils down to is nothing worked...Now that you have read my entire review I would like to summarize my why I wouldn't buy this tv again:Because it is piece of faulty JUNK.", "Date": "January 19, 2011"}, {"Title": "VIZIO XVT553SV 55-Inch 240 Hz TruLED LCD HDTV with VIZIO Internet Application, Black", "Author": "Edward E. Stilwell Jr. \"Jay Stilwell\"", "ReviewID": "R1K7E6MRYFSMZ7", "Overall": "5.0", "Content": "Have had my set now for 2 days, CEVA was outstanding not a single complaint from me.The HDTV is just incredible did some adjusting on color brightness and few other tweaksvery easy to set up walks you throught the initial setup. You can't go wrong with this set.Have been watching the US Open tennis and the NFL thursday night awsome sports viewing.Buy it you won't be sorry.", "Date": "September 9, 2010"}, {"Title": "It worked for 1 hour only!", "Author": "Mia", "ReviewID": "R3NRA5UX6DT06", "Overall": "1.0", "Content": "I ordered a Vizio from Amazon.com.  It was delivered today.  It had a great picture for about 1 hour, then the screen flickered and it went black.  I had read about some issues of freezing up, so I unplugged it and waited a minute, then tried to reset.  Nothing.  I called Vizio, who ran me through the same attempt of a reset.  They finally offered to send a service technician.  I had had the TV for less than 2 hours!  From what I could tell in a brief time of it working, it had a great picture (though not as bright as a previous Samsung, which suffered from horrible reflections of lights in the room).  The Vizio internet apps were nice and easy to use.  After a few hours of non-use, I turned on the TV to a great picture, that lasted for about an hour, then the flicker and back to the black screen.  When I turn it on, the white Vizio lights up and the sound is there, but no picture.  Never even see the VIA logo at the beginning.  I liked it and had planned to get a replacement, however, after seeing all the comments on the web indicating this is a fairly common problem, I am planning to return and try another brand.  I would hate to have this happen after it was out of warranty.  A TV should last many years, more than a couple, and certainly more than 1 hour out of the box.", "Date": "January 16, 2011"}, {"Title": "Buy this TV only if you're cool with it shutting off unexpectedly once a week", "Author": "David Amerikaner", "ReviewID": "RBD7RKNYI3MGN", "Overall": "1.0", "Content": "TV is huge, picture quality is great, has all the internet-enabled stuff, etc.However...Due to a design flaw of which Vizio is aware, the television shuts itself off, once a week or so, to \"re-boot.\"  It does this while you're watching TV.  All of a sudden, the TV is off, and you can't turn it back on for a minute or so.  You could be watching your favorite show, or a big game, and then POOF - the TV is off.  For a solid minute.  Without warning.  And you can't stop the TV from doing it.I called Vizio about the problem and was told they're aware and they'll be releasing a firmware update \"soon\" to resolve the problem.  I searched some other web sites and found other reviews going back as far as March 2011, saying that customers were told the same thing.  So the update is likely never coming.So go ahead and buy this TV if you're cool with completely unexpected shutdowns every week or so.  If you want a TV that reliably stays on and works, buy another TV.  If I'd known this about this TV, I would definitely have bought something else.", "Date": "October 27, 2011"}, {"Title": "Excellent but...", "Author": "Cool Down", "ReviewID": "R2MMDTZ26ZE4E9", "Overall": "5.0", "Content": "I have had no issues with this TV, just a bit of a surprise.I specifically got it because it boasted PIP, which is the major requirement I needed because this was replacing my computer monitor as well as being plugged into a gaming system and a Roku box.Unfortunately, the manual and the TV seem to differ slightly.  It says that you should be able to use PIP/POP with any combination of inputs, but you can only do it with HDMI/any other input.  So if you had a composite and component, you could not use PIP/POP, but if you had HDMI and composite/component, you can use it.  This is not a major issue since the game system I'm using will eventually be upgraded to an HDMI cable and the Roku does have an HDMI, but this might be something for people to consider.It was shipped already assembled to its base, which was very convenient for me since I had to unpack it by myself.  The LG TV we bought at the end of 2010 required base assembly, which is difficult to do by yourself with such a heavy TV.The widgets that this TV has are very nice.  It has a wide variety of things such as Twitter, Netflix, Pandora, TV Guide, Vudu, Rhapsody, and even a map widget which uses Yahoo! Maps.  In addition to these, it has a few weather widgets and TV channel widgets.Another very nice feature of this TV is the remote, which has a slide-out qwerty keyboard.  The buttons are a little small, but when using Netflix or anything else where you have to type in a search box, it is extremely helpful.All in all, I would highly recommend this TV to anybody, but I would point out that it only has one component and one composite connection, so if you have a lot of older components you might have to consider getting some sort of switch to connect all of them to this TV.  Other than that and the PIP/POP issues, this TV is excellent.", "Date": "April 20, 2011"}, {"Title": "Love it, and Great Customer Support", "Author": "Charles D.", "ReviewID": "R27UEFJQ339FZF", "Overall": "5.0", "Content": "I have had it for 2+ months. I love it and so does the entire family. I shopped for over a year for just the right tv. This is it. I didn't want the plasma \"reflection\" \"glare\" issues that I saw. Also wanted a decent / fair price.I went to every store that sells these type tv's and settled on Costco. One for the price, 2 for the 2 year guarantee they offered, 1 yr manufacturer, 2nd year Costco. And we had a coupon that saved a couple hundred.In Costco, the Sony equivalent was set up side by side with the Vizio. The difference was stark and jumped out at me from every angle. Vizio, hands down, and it was a couple hundred less that the Sony.Only had one problem, the remote stopped working. I called customer service and the first girl was ready to send \"repair\". Then the tier 2 guy saw the ticket and called me. We went through a few steps, re-programmed the tv, and it uploaded some software updates and have not had a problem since. Just know if yours does this ask for the tier 2 dude.It is a great tv for the price. From the time I slid it into the tv room, to the time I had it all hooked up and was watching tv was less that 20 minutes and I did it with just me and my son.The picture is EXCELLENT and the sound. I also have it hooked to my Yamaha Tuner/AMP, which push a set of Bose acousta-mass speakers and a pair of Cerwin-Vega RE-38's. I can shake the dishes out of the kitchen with them.Also have an LG Blu-Ray.......Wow. You don't know what you are missing until you have the big screen, Blu-Ray, and sound system......Closest thing to being there you can get.", "Date": "November 25, 2010"}, {"Title": "Completely satisfied", "Author": "Al R \"Al\"", "ReviewID": "RZ9CILX1FH86P", "Overall": "5.0", "Content": "Bought the set from Amazon on Thursday and it arrived the following Monday.  Took it out of the box, with help from the 2 guys that delivered it, set it in place, connected power and HDMI from satellite box and WHAA LA, up and running. Awesome picture and sound. Features and settings galore. Several days later had a settings glitch. Called the Vizio customer service phone, the number is provided in the manual, got someone in Utah on the phone immediately. After describing the problem she transferred me to a service tech in S. Dakota who answered immediately. Talked me thru the settings procedure, where I had made a bad choice and solved the problem, total time spent less than 15 minutes. I do a lot of research before making a buying decision, especially on big ticket items and I couldn't have made a better choice as to product and where to buy.", "Date": "October 11, 2010"}, {"Title": "Vizio  XVT553SV Looks Great", "Author": "VICTOR A GALANTE", "ReviewID": "R3VT688W026HGX", "Overall": "4.0", "Content": "I purchased this Vizio LED HDTV on September 14th.  It left Amazon's PA shipping location that same day and was delivered to me in FL on September 21st.  No problems there.  The TV set up just fine right out of the box with minimal adjustments.  Wonderful picture -- everything that the Vizio site advertised.  The mat finish did away with any glare problems I had with previous TVs and the 240Hz refresh rate puts this unit above the competition. I only wish they offered a 60\".  The built-in WiFi works great and watching free web videos is an added bonus.  I have DishTV with the HD package connected via HDMI and love the picture.  I even watched a 12-hour ESPN3.com program by connecting my wireless notebook PC to the Vizio side HDMI connection for a crisp full screen HD experience.  Very nice!The only criticism I have is compatibility with my Nintendo Wii.  I'm using the AV connection and even have the Vizio on \"Game Mode\", but response time is slightly delayed.  Playing such Wii games as Wii Play's SHOOTING RANGE and you'll notice that the crosshairs lag your Wii controller enough to make some of the games unplayable.  Very frustrating.  There must be significant processing going on with the Vizio LED-LCD that a delay is noticeable.To give you some idea of pricing I paid [...] on 9/14/10.  I see it's already dropped a bit since then.  I also added the 4-year warranty from SquareTrade -- something you may want to consider.", "Date": "October 2, 2010"}, {"Title": "Vizio XVT3SV 55\" - Wonderful TV", "Author": "Jackel", "ReviewID": "R1ZZANGWTFLC24", "Overall": "4.0", "Content": "I replaced my old Sony 55\" DLP with the new Vizio XVT3SV 55\" display.  I searched Amazon a number of times and, although they were close, the price was just not as good as Sam's Club.  I purchased for $1,498 at a Sam's Club in Dallas on Black Friday.  I would have preferred going through Amazon as I purchase most items through them, but I wanted it right away and saved a few bucks too.Now, I am a big Samsung TV fan.  When comparing features, picture quality, audio quality, connection ports and other items they are very similar.  I still feel Samsung has has a better picture, but who can justify the huge increase in cost?  Vizio outshines most all other TV's in every category except the picture is just slightly less impressive.  I'm ok with saving $500 - $700 and living with a picture that is only slightly different.PROS:Built-in dual band WiFi \"N\"Bluetooth remote with slight out keyboard (takes some getting used to)Vizio Internet Apps (love VUDU service!!)Easy setupEasy to navigate menusCONS:Halo effect when viewing at an angle (minor item)Remote has no back lit buttonsComponent cables cannot be used in low profile mount installation even though they are recessedHard to \"hide\" power cord and HDMI cables (could use a hook centered at the lower portion/back side of TV)Overall, I am very impressed with this TV.  The Pros far outweigh any short-comings and you cannot beat the value.  I would highly recommend this to anyone who wants a really nice TV at a great price.", "Date": "January 17, 2011"}, {"Title": "Good value - features and performance vs. price", "Author": "Delray2002 \"Delray2002\"", "ReviewID": "R3OHI6WRX9QBFT", "Overall": "4.0", "Content": "Replaced a Samsung 52\" LCD with the Vizio 55\". Based on full array backlit LED and claimed 10,000,000:1 contrast ratio of Vizio vs. 50,000:1 contrast ratio of Samsung, I expected an even crisper and more vivid picture. Not seeing it. Picture isn't worse than Samsung, but not discernably better either. There are a variety of picture settings in the TV control panel ... for shows with lots of color like CSI Miami, the \"Vivid\" format looks almost surreally colorful .... kind of nice. I watched a football game in \"football\" setting the other day and forgot to change it back to \"standard.\" Wondered for a few days why colors seemed washed out.Setup was easy. I was able to link to my wireless router and can access Netflix, Facebook, and other on-line services if I want them. I like the one-button access to the TVs settings thru the Vizio remote. The keyboard on the Vizio remote is sized for elves, not people, but it does make it possible to type in names for HDMI inputs, router addresses, and the like. That's handy.My Samsung has an aspect ratio control that lets me set screen format for 4:3. I use this to play travel video DVDs. The Vizio has a \"wide\" setting control, but doesn't offer a 4:3 format, so those DVDs look distorted. Seems like an odd omission.All-in-all happy with the product, but not blown away by it. Certainly a good value for the price.", "Date": "December 8, 2010"}, {"Title": "Great Picture !", "Author": "hemingrey", "ReviewID": "R2CSJD08P5AGMK", "Overall": "5.0", "Content": "This is a great TV!The TV came right to my house and the delivery people even brought the box into my living room and explained how to best unbox it.I mounted it on a wall using a PDR Mounts Fixed Wall Mount (also from Amazon) which worked great.The TV was easy to operate.  I just plugged it in, put batteries (included) in the remote and turned it on.  There is an initial setup routine that runs the first time you power it up. It walked me through everything in a few minutes and I was watching TV within 10 minutes.  This set has lots of adjustments available to fine tune the picture and sound, however It came set up close to what I needed.  I found some recommended settings from a C-NET review on the internet which I used to fine tune the picture to my liking.  The picture is crystal clear and the colors are vibrant and accurate.  I watched Avatar on DVD and the effect was almost like the 3-D experience in the theater. (This is NOT a 3-D TV)I got this TV from Amazon because they offered free delivery and a competitive price. The big box discounters cost more after adding taxes and delivery to the seemingly lower initial price.This TV has a number of internet apps and can be connected by wireless to a local area network. It all worked flawlessly.This TV is rated in the top 5 this year in picture quality and costs hundreds to thousands less than competitors. If you want the best TV for your money GET IT.", "Date": "October 5, 2010"}, {"Title": "Great TV", "Author": "ldub", "ReviewID": "R3K8RLOP11NIIL", "Overall": "5.0", "Content": "I was a little unsure about buying a Vizio TV. Not that I've heard back things or had bad experiences, but I normally stick to the tried and true brands.My fears were unfounded as the picture quality is great. The LED set is much brighter and more colorful than my 3 year old Sharp LCD, which is a great TV in its own right. Have yet to notice any artifacting. The 240Hz is great, especially for action sequences and sports.The extra features are also great. The wifi was extremely simple to set up and playing with all the various online widgets available is fun. I've had the TV now for a few weeks and remain thoroughly impressed.", "Date": "November 4, 2010"}, {"Title": "Avoid this TV!", "Author": "Yoshi", "ReviewID": "R20IH2ACYAGENG", "Overall": "1.0", "Content": "This TV was great out of the box, and performed perfectly for about 7 weeks.  Then... it started turning itself off, at first randomly, and now, like clockwork, every 5 and a half minutes it freeze for about 10 seconds, then turn itself off.  Every five and a half minutes.  The first tech support agent said the TV is just signaling (to whom?) that it needs a firmware update, so just wait a bit and the issue will resolve itself.  Two days later (every 5 and a half minutes...) the next tech support agent said to email a copy of the product receipt and they will schedule a service call, so I sent the receipt.  The next day (4 days of turning off every 5 and a half minutes) the next tech support agent said (1) it's a known issue with this model; (2) it is not reparable with a service call; (3) they are \"working on\" a firmware update that will be sent out to all these TVs \"in the near future\"; and (4) they don't know what \"near future\" means.  So if you have a very short attention span (say, 5 and a half minutes or less) or don't mind buying today a TV that will work \"in the near future\", go ahead and get this one.  The first 5 minutes and 20 seconds are great, every time.", "Date": "March 9, 2011"}, {"Title": "Look elsewhere - dont waste your money!", "Author": "WalterC", "ReviewID": "R1SOOIU4ZWQI31", "Overall": "1.0", "Content": "Bought my XVT553SV 18 months ago and it is now heading for the landfill - does not work and has had repeated problems with power.  Spend a little more and get name brand electronics.  VIZIO has not been a good choice in my experience.", "Date": "January 9, 2012"}, {"Title": "Vizio SVT553", "Author": "swan", "ReviewID": "R3BQZQQ9YTRY11", "Overall": "5.0", "Content": "Time in service:  30 days (I think that it's safe to get rid of the shipping box)Setup:  Simple and fast.Internet: Wireless access was easy to set up and has been flawless.  Netflix is the most used internet app to date.Screen: Matt finish eliminated the relection problem of our previous Sony.Display: Sharp with no halos or other defects.  Brightness of the display easily compensates for our wall of windows.Overall, we are very satisfied with the performance and price.  Note that we found a better price at a competitor site and Amazon promply honored their 30 day price guarantee and credited our account.", "Date": "April 13, 2011"}, {"Title": "Amazing TV", "Author": "Terrence L. Williams", "ReviewID": "RVXOVBGQ429XY", "Overall": "5.0", "Content": "I purchased this TV to replace a 42 inch Philips plasma that is still holding up great after about 4 years.  That TV has been retired to our bedroom now, as this new TV commands the living room.  Lets start with why I purchased it.  I am a frequent visitor to the review section on cnet.com.  They raved about this tv.  From that point, it remained on my wish list for months.  I finally pulled the trigger a week ago, and let me tell you that I could not be happier with my purchase.  The picture is amazing.  Cartoons pop off the screen, games look amazing, blu rays scream off the screen....its a truly wonderful tv.  Once you integrate you Netflix, Amazon Prime streaming, Hulu Plus.....Blockbuster....you honestly can get away without having cable TV.  Lastly, the box it came in was HUGE!!!", "Date": "March 18, 2011"}, {"Title": "What more can you ask for?", "Author": "mapes23", "ReviewID": "R2QNSE68X11ZC3", "Overall": "5.0", "Content": "The best bang for the buck! This TV has a fantastic feature with plenty of adjustment options. The internet apps and WiFi capability make the TV extremely versatile. Most major retailers do not carry the Vizio only big names like Samsung and Sony. Comparable Sony and Samsung models with 240Hz, Wireless N, internet apps run hundreds of dollars more with no additional benefit. When looking at LED backlit LCD give Vizio a serious look. You will not be disappointed, in fact you will be pleased - I am.", "Date": "February 21, 2011"}, {"Title": "Even better than expected", "Author": "chabal", "ReviewID": "R16Z12M0C8NFXT", "Overall": "5.0", "Content": "Shopped for about 6 mo while my 50\" DLP was dying. Price jumped around a lot but on day my DLP went to where they go the Vizio was back on sale for $1498 by Amazon. Ordered it and was delivered in about 7 days.  Driver was by himself so I helped bring it in. Set up and hooked to internet with no problems. Pictue has to be seen to be appreciated. I then ordered the Cheatah wall mount. Cheap price but well built and very easy to wall mount and hook up. No problems with cables since had 10' HDMI cables for Direct TV and my DVR and also 10 ft for my old VHS.  Hooked it to my surround system with optical cable  and worked very well. These were all the Amazon branded cables and were cheap but the electrons did no know difference and worked very well. After about 2 weeks am still amazed at the picture quality. Also has a lip sync feature which allow you to compensate the delay between video and audio on some channels. Very neat! I also bought the 4 year warrenty from Vizio (which is a true 4 year add on to the 1 year as bought, so am covered till 2015 for less money than the ones that Amazon sells. Have no problems recomending this tv to anyone looking for a great picture and multiple inputs and outputs. The internet access also works very well. Default is DHCP but can be set for manual address if needed.  Suprised that Blockbuster is not listed and I called Blockbuster and they have no plans as of Dec to supply a widget. Bad call on their part but might be why they had to file bankruptcy.", "Date": "January 2, 2011"}, {"Title": "great tv", "Author": "Steven D. Davis \"Steven\"", "ReviewID": "R3SJMTISOQM4Q8", "Overall": "5.0", "Content": "Perfect tv at a very fair price.  Excellent transaction with Amazon and delivery was exactly as planned.  This series of Visio should be seriously considered.  I also own Sony and LG HD tvs.  This is my best tv.", "Date": "December 2, 2010"}, {"Title": "Great HDTV at a great price!", "Author": "James", "ReviewID": "R2CW5OLDPJGWU6", "Overall": "4.0", "Content": "I've had the TV for about three weeks now. Very happy with the picture and overall quality. Weekend football games are awesome! I would have given the full 5 stars for features except for the fact that the USB ports are inactive and there is (so far) no DLNA support (although promised in a future firmware update as I understand it).", "Date": "November 18, 2010"}, {"Title": "The Amazing Vizio XVT553SV", "Author": "Kielly L MacKenzie", "ReviewID": "RQBFDMK2L6FT", "Overall": "5.0", "Content": "This backlit LED TV was soooo worth it. We love this TV it. Amazone was the only one selling it when nobody else was. I think I bought one of the first. The menu is so easy to use it basically sets up it self. The apps are great and FaceBook is fast and easy. It set up the wireless connection with no issues. We have huge windows in front of it and it is so bright we don't have an issue with glare like we used to with our old Sony. There is one thing I would change, the QWERTY keyboard that slides out from the remote needs some work on the buttons. But it does work quite well. If you compare this TV to any other 240hz TV you can not go wrong. And the 10 Million to 1 aspect ratio shows. It is truely amazing.", "Date": "October 26, 2010"}, {"Title": "my new  visio TV-55\"led,240htz,via enabled,", "Author": "mickey", "ReviewID": "R3JBSWLT5NM703", "Overall": "5.0", "Content": "WOW  no let me say trhat again WOWWWWW....I have always owned mitsubishi's always the biggest and best...not one of them could stay in the same room with this visio.  To be fair to the mitsubishi folks thier new tv's are also great...but not great like this- almost comparable...just not quite there yet...I dont even know how to set the dam thing up..I'll probably have to hire an expert as one needs a degree in mechanical & electrical engineering. but so far this is the bomb.  its like being in heaven...and yeah I know its not politically correct to have watching tv for a hobby but this tv has set me free, to hell with the pc haters out there if they had this tv they would be watching it instead of hating.  I may very well be buried with this television in case the lord calls I'll have it with me... The picture is so vivid and true that I want to rewatch all the movies and series I have ever seen again, to get the full effect that was intende by the directors...and sports ...get outtah town, the 240 mega-hertz does not let you miss a single detail I love college football(go USC) and basketball...what a difference this set makes in the viewing of sports..I'll bet even golf is watchable with this set.  can you imiagine being able to follow the ball from tee to landing on the fairway...cant wait to see...amazing remote I hope to use this tv as a gaint monitor for the internet I hope it can do that...no need for a computer if it can well I have said my piece...get one", "Date": "November 10, 2010"}, {"Title": "Nice Product but...", "Author": "S. Langerud", "ReviewID": "RHBN2MQVR6YKP", "Overall": "3.0", "Content": "VIZIO XVT553SV 55-Inch Class Full Array TruLED with Smart Dimming LCD HDTV 240 Hz SPS with VIZIO Internet Apps I received this TV quickly and in great shape. There was no wear or tear damages as one could expect in shipping a item this size. The TV has a excellent picture with decent apps and I would have been perfectly happy and content with the purchase except for 3 things.1) The sound would fluctuate on it's own and that drove me and my wife crazy while watching what was a great TV picture.2) A related issue for me was to grab the remote to turn the sound down and not being able to find the sound adjustment button in a darkened room. There is no back-light on the remote so I had to turn on a light to see what I was doing. All remotes should have a back-light in my opinion.3) During the week or so that I had the TV it cut off 3 different times on it's own for no apparent reason. If I hadn't experienced those issues I probably would have kept the TV.", "Date": "November 25, 2011"}, {"Title": "Huge bang for the buck", "Author": "Jay Brandt", "ReviewID": "RJ8VOGJAID5QP", "Overall": "5.0", "Content": "I bought this TV as a replacement for a 47\" Vizio I've had for a number of years and wanted to move into the bedroom. This is my third Vizio (I also have a 37\") and it appears to be of the same high quality as my previous sets.Pros:- Great picture. Deep blacks, bright colors, no tearing or other artifacts with high-speed action sequences. 1080p looks killer, but everything down to 480p looks better than it did on my older set (which wasn't bad).- Full LED variable backlight. Completely gets rid of grey blacks in dark scenes - black are blacks, whites are bright, even when next to each other in a frame.- Internet Apps. I wasn't sure how much I'd use these - I already had Netflix, so I figured I'd use that a little, but that was about it. However, I find myself using them quite a bit. As an Amazon prime customer, I also get some of Amazons streaming and this set supports that too, but it also has apps for a number of other interesting feeds, including Revision3 and TWiT, both of which I enjoy. I find myself going to the internet apps more and more. Also, I've noticed that Netflix via the app on the TV looks significantly better than the computer-based viewer from my HTPC - I suspect the TV app supports Netflix HD format much better than the Silverlight-based PC solution.- Bluetooth remote. I really like it that I never have to aim the remote at the TV. Great when I'm at the dining room table and the couch blocks IR beams. Also, the remote, with the full QWERTY foldout keyboard is pretty nifty and pretty well laid out.- Audio pass-through on *all* HDMI inputs. The TV will pass audio from any HDMI input out via optical to my amp. No longer do I have to change amp inputs to sync it with the video being displayed. This one was a huge deal for me, since my amp is pre-HDMI and can't act as my switch. This ultimately caused issues with my HTPC, which I resolved. See my reviews on the Cables Unlimited DVI and Digital Audio to HDMI and Evga GeForce GT 430 Graphics Card for that little adventure.- Easy to use setup. The first time you turn on the TV, it steps you through setup that's pretty painless. It takes about 15-20 minutes, but when you're done, most folks will never have touch the settings again.- Light. The whole thing only weighs about 80 pounds. If it weren't for the fact that it's so large, it would easily be a one person job to move it around and set it up.- Matte finish screen. So many manufactures are going over to glossy screens, which look snazzy in the store, but as soon as you get them home and turn on a lamp behind you or next to you, you realize you just lost part of your picture to glare. Vizio understand this and uses a matte screen so even if you get a little glare, it's diffuse enough that it doesn't ruin the view completely as the glossy screens do.- Network setup. I use a wired setup, so I can't talk about the wireless, but the wired was dead simple. I just plugged in a cat5e cable to the back of the TV, the other end to the switch behind the TV and the TV got out the internet first try - no configuration needed.Cons:- It's big when setting up. You're going to want 2 people to set it in place. It's not very heavy, but it is cumbersome to try and deal with by yourself.- Bluetooth remote. This is one of those good-news/bad news features. While I love that I don't have to point the remote at the TV to make things happen, the fact that Vizio chose bluetooth means that you can only control it via IR with third party remotes like a Logitech Harmony. Why didn't Vizio go with a standard RF frequency? Then I could have used the high-end Harmony remotes and gotten down to 1 remote. As it is, I'm stuck with 2 - one for the TV and 1 for all the other devices (which all use RF). I could go all IR, but that kinda defeats the purpose...- Boot up. When I was a kid back in the 60's, you turned on the TV and then waited for it to warm up before you saw anything. Then, somewhere in the 70's TVs became \"instant on\". Well, welcome back to the good old days. New TVs aren't TVs, they're computers and as such, they have to boot. So, when you turn it on, you're looking at a nice \"V\" logo for about 15 seconds while the system boots up, loads the apps, etc. Yeah, it's only 15 seconds, but it's still strange to be back to this point again.- Old firmware. My set shipped with what must have been old firmware. The day after I set it up, I got a message when I turned it on that it was loading up new firmware. I think it's cool that the TV can be updated as new stuff becomes available, but I would have preferred if, as part of the initial setup, it would have done this. I spent 30 minutes the first day trying to figure out how to get the free streaming video from Amazon (as a prime member), only to discover the next day that it needed new firmware to manage it. Also, there was no notification as to what was new - I stumbled over a new feature called \"CEC\" that isn't even in the manual I downloaded from Vizio. Turns out I can't use it, but still, would have saved me 15 minutes on Google finding out what it was.Overall, I'm thrilled with TV. Vizio continues to make a high-quality product at a very aggressive price. I was at a \"big box\" store the other day and told one of the blue shirts what I paid for the TV and what it's features were and he muttered that even with his employee discount he couldn't get a 55\" set with the features of this one for close to that price.Great picture, great price, great features.", "Date": "April 18, 2011"}, {"Title": "Amazon.com is worth it.", "Author": "Aj", "ReviewID": "R3JMKKGTZPUAJG", "Overall": "5.0", "Content": "This product is great.  Blooming is the only issue worth noting, but multiple adjustments in the settings will minimize this effect for when watching darker movies.  Amazon.com was the best place to make our purchase.  The 30 day return policy was used twice for this purchase because our first two Vizio TV's has defects.  The first set had scratches on the screen, and the replacement set had defective crystals that wouldn't turn black.  However, the third and final set is great.  Amazon was great with helping to keep us happy!  No regrets with our purchase of the VIZIO XVT553SV 55-Inch Class Full Array TruLED with Smart Dimming LCD HDTV 240 Hz SPS with VIZIO Internet Apps.  This TV is stunning!", "Date": "March 28, 2011"}, {"Title": "Vizio XVT553SV 55\" LCD TV, full Array TruLED", "Author": "Case", "ReviewID": "R1KN2ZY6TPQJ8Z", "Overall": "5.0", "Content": "This TV has the best picture of any TV we have ever had. It has a ton of extra features. The sun, or any surrounding light has no affect on the picture, also I can easily and clearly see the picture from any angle. It has great sound too.The only problem we have had with this purchase is getting one that works properly. This our third Vizio TV, same model, all from Amazon. The first two had serious, unacceptable problems, the first one didn't work at all, the second one had audio problems. So far the third TV seems to work fine. When it first starts up there is some breaking and popping sounds, but it quickly clears up ... hopefully it remains working good. Concerning Amazon's response to the problem TVs ... GREAT! Amazon customer service responded quickly and graciously. I have no problem with Amazon and/or their cutomer service.", "Date": "March 20, 2011"}, {"Title": "Vizio XVT553SV", "Author": "Eric Winslette", "ReviewID": "R2MCFNB6J0G8D5", "Overall": "5.0", "Content": "I am writing this review coming from a 5 year old 32\" 720P LCD to the Vizio XVT553SV. Follow other reviewer's advice and turn off the light sensor as well as the dejudder. I kept smart local dimming on, it truly helps with black levels. There is some blooming if there is white text on a black background, but the effect is small and insubstantial, in my opinion. Others have also mentioned the annoying Vizio white logo, but to be honest, I am more distracted by 55\" action than I am a 1\"x4\" glowing logo at the bottom. I really liked the Vizio box, and the ease of opening it and taking the TV out. I would give this TV 4.5 stars, half a star deduction because if I turn on my receiver before the TV, the TV doesn't recognize the input and I have to turn the stereo off, then back on.", "Date": "February 20, 2011"}, {"Title": "So far, I love it.", "Author": "Heirloom Tomato", "ReviewID": "RK0CP45YGFNF0", "Overall": "5.0", "Content": "The picture looked great right out of the box. It was easy to set up the Netflix wireless streaming feature. The sound seems pretty good - I feel no need to upgrade the sound at this time. The TV updated itself automatically the first time I used it. Great black levels and beautiful color. It has tons of features I haven't explored yet. I bought it on Amazon at a great price. It took quite a while to arrive, but I wasn't in a big hurry. The delivery man didn't want to take it out of the box but I talked him into it, and he lifted it onto the console for me too. The TV ships already mounted on its stand. The box is well designed and there was no shipping damage. This is the largest, most expensive Amazon purchase I've made. It worked out fine.", "Date": "January 31, 2011"}, {"Title": "All I can say is: Wow.", "Author": "Carole J. Ward", "ReviewID": "R1EAWGT6OM3KGA", "Overall": "5.0", "Content": "We are upgrading from a Panasonic 27 inch CRT TV that is 15 years old so, really, any HDTV is going to look amazing.  That being said, this VIZIO TV looks superb hanging on the family room wall. The colors are rich, the picture amazingly sharp, the sound is very nice.  Easy setup and a very cool bluetooth remote. We have DISH Network HD and the HD channels look great.  You don't really realize how poor standard definition is until you view things in HD. There is no going back, that's for sure!The box arrived from Amazon in great shape. The delivery guys brought it in, unboxed it and fired it up to insure it was in working order.  We mounted it with a Bell'o articulating arm mount which is a fine item itself.  I will be reviewing it next.  We are very happy with this purchase.", "Date": "January 21, 2011"}, {"Title": "Pleased With Vizio 55\" Tru LED LCD TV", "Author": "FloridaTim", "ReviewID": "RTZCRNGKL8B7A", "Overall": "4.0", "Content": "I purchased the XVT553SV 55\" LCD Tru LED TV about a month ago.  My family and I so far love it.  Its picture is as good as our panasonic plasma tv, including contrast and color and its sound is much better.  No need for external speakers.The remote control is a bit awkward.  The keyboard is not as effective as I thought it would be but that is not why I bought this TV (I just don't do that much typing).  The keys on it are too small for a man's hands.  With the keyboard sliding beneath the main controls it is a bit thick in the hands and there's a tendancy to play with it by sliding it out and back in.The connections offered clearly favor HDMI equipment with only one red white yellow connection available.  We have older equipment, including a Wii, which doesn't have a hdmi connection and we would have appreciated another AV type connection.I note that it came with the stand attached and was very easy to get out of the box and running.  Only negative note would be that we could smell a plastic scent coming from the TV and I think I can still smell it.  Yes, we took all the wrapping off.  Other family members say its gone away.  Also it would be nice to be able to turn off the VIZIO label light at the bottom.Overall very happy with this great TV!", "Date": "January 19, 2011"}, {"Title": "Best TV ever and best remote", "Author": "Amazon Customer \"Tony Tiger\"", "ReviewID": "R15EXIML2WBPNJ", "Overall": "5.0", "Content": "I was shopping for a couple of months for a large HD tv before I found this one. I got it at a price about $500 below most tvs in this category ($1447) and it has every feature I would want besides 3D, which I'm not sold on yet. Picture was great right out of the box and looked slightly better when I put in setting found in a C-NET review. I love the dull mat finish of the screen because it doesn't show reflections. The picture is still bright and clear so a shiny glass screen isn't needed. Some people complain about the sound but I think it is good enough that I rarely turn on my surround sound system anymore. The built in internet aps are great for doing a quick check of the weather in all your favorite cities with just a few button pushes on the remote. It does this split screen so you don't have to miss anything in the show your watching. There are codes for the remote to allow it to work great with my TIVO HD so I don't have to juggle several at one time. I also like the you-tube ap for sharing a favorite funny video. I turned off the motion flow feature like most people do because it seems to cause jittering instead of eliminating it and the picture movement is smooth and great without it. I haven't seen any of the flaring of bright white areas against black that some people mention so maybe they just had the contrast turned up to the max and the off angle viewing is very good. You might want to monitor the price for a few weeks because Amazon automatically matches other web sites offers but only while the other price is current. With in an hour after purchase the stated price shot back up by $500 so buy at the right time. The delivery service included with the purchase was great because they carried it right into the living room from the truck. The TV weighs about half what the 36in tube TV it replaced did. I couldn't be happier with my purchase!", "Date": "January 1, 2011"}, {"Title": "Great TV with Great Extras", "Author": "M. Dougherty \"tech girl\"", "ReviewID": "RY5PS95384UVC", "Overall": "4.0", "Content": "My XVT55SV finally arrived and I am definitely impressed by the picture quality and the Vizio internet apps once everything was set up.  It definitely takes some time to get the TV set up, about 10 minutes to get everything completely set up including the wireless network connection and the general TV set-up.  I used a Cheetah Mounts APTMM2B Flat Screen TV Wall Mount Bracket, uses Universal Tilt Mount 32-55\" - Plasma, LED, LCD TV Wall Mounts Mounting Brackets which also worked great except I had to purchase some slightly shorter screws (M8 20mm metric machine screws) from the local hardware store because the ones that came with the mount were slightly too long and didn't secure flush to the TV part of the mount.  So far so good and we're enjoying over the air DTV using the Antennas Direct DB4 Multi-Directional HDTV Antenna.  This TV may not be as thin or sexy as some other brands but the picture is great and I love the remote with the built in keyboard!  Overall, I'm very happy with this purchase.", "Date": "December 11, 2010"}, {"Title": "GREAT TV!!!", "Author": "Leidi Ponce", "ReviewID": "R1P3QVS4FXR6MF", "Overall": "5.0", "Content": "this is a great tv, free shipping was good. easy setup. watched avatar once i got it, it looked amazing, standard tv. doesnt look bad. only 1 issue, lip sync is a little off, couldnt fix it. it doesnt happen all the time, it comes and goes. it only happen with satellite input, could be the connection. gamimg is great, played mw2 and its incredible. was a little hard to play, not used to playing on a tv this big, no lag. blu ray is amazing, have cheap wal-mart speakers, but going to buy better ones to go with the amazing picture. dont use via because i alreading have internet on my ps3. great tv overall. upload pictures later.", "Date": "November 10, 2010"}, {"Title": "Poor Quality, Worse Service", "Author": "Jeff Bridges", "ReviewID": "R2NPRQWA4J7AJH", "Overall": "1.0", "Content": "I paid about $1,800 for my 55\" Visio TV. It worked great for 15 months -- no issues. Then the picture went -- the sound stayed on -- and you couldn't turn it off -- except by unplugging it.I called Visio customer service. They had me perform some tests -- and then concluded it was broken. They asked me to scan my receipt and send it to them -- so they could arrange a repair. I did that -- and then they said, sorry -- but there is nothing we can do for you -- your warranty was only 1 year. I said that it seemed unreasonable that my $1,800 tv was viewed as disposible -- and that this was not a user problem (no abuse, no dropping it, spilling on it, etc.). They said that I should understand that this is a sophisticated piece of electronics -- and I needed to buy an extended warranty. Personally, I said that my expectation is that an $1,800 tv will work for more than 15 months. I asked for a Supervisor and for 5 minuets was told there was nothing a Supervisor could do -- and I should call someone to get it repaired. When I finally persuaded the Customer Service Rep to get a Supervisor regardless, he offered to pay for the defective part if I paid labor -- and all I said was hello. Any way, they sent me a \"rude\" release form -- stating that the labor was $165 -- that this was my last accomodation -- and that the repair would only be warranted for 90 days. Again, call me crazy, but if I pay $165 to pay for their defective tv -- the repair should last for more than 90 days. They think I should be grateful. So my advice to you is not to buy an extended warranty -- but to buy another brand. I'm out $2,000 -- and my tv has perhaps 90 days of more life to it...seriously, I expect more...", "Date": "December 26, 2011"}, {"Title": "i would buy another one today", "Author": "Edmond Hatfield \"ReelTime\"", "ReviewID": "RZESMJP0T1EE0", "Overall": "5.0", "Content": "I have had this tv for 3 months now and it has been flawless. Everybody that comes over loves it. Glare is no problem and it is set right across from a large bay window.My Apple TV dose better with Flickr than the built in internet assess. The remote is a little funky.That is the only complaints I can come up with. I did have reservations when I bought this one but after having it for three months now I would buy another one today with no reservations.", "Date": "September 30, 2010"}, {"Title": "Great Value for the money, even though its $150 less than what I paid 3 weeks ago!", "Author": "n2Dzine", "ReviewID": "R3IDPSXO924JGR", "Overall": "5.0", "Content": "Incredible picture in high definition, bright colors, love the internet apps. This is my second Vizio and I have no problems with it so far. No regrets, except I wished I waited on purchasing it. The price dropped by $50 the day after I placed the order and now it's dropped further by $150.", "Date": "September 30, 2010"}, {"Title": "Vizio LED LCD TV is Awesome and Amazing!", "Author": "Tom in Charleston", "ReviewID": "R2U7CE3TRW539E", "Overall": "5.0", "Content": "WOW!  Those 3 letters do not begin to convey the excitement you'll feel when you experience TV on this amazing Vizio set!  From a picture so crisp you'll swear the actors are in your living room to the built in sound that you'll swear comes from a 5.1 system, you won't be disappointed.  The non-glossy screen really helps reduce glare, even during the brightest part of the day.  We won't be using the internet-connection part of the unit anytime soon, so I'm not sure how much use the cool remote with the slide-out keyboard will be, but that's not what we bought the TV for anyway.  We bought it for the picture and let me tell you, it doesn't disappoint!As for details, starting with the setup of this set -- it couldn't be easier.  One minor problem I experienced was with the initial step-by-step setup.  It happened so fast I missed it.  Be prepared, as soon as you plug this bad boy in things will start happening.  But even having missed this supposed easier install, I was able to attach a satelite dish, a DVD player, and a VCR with few issues.  The connections are clearly marked and easy to use, and after just a couple of minutes I had the satelite dish connected via HDMI and was recieving a great picture.  I couldn't get it to fill the screen initially, but after a few minutes with the clearly-written manual, I was able to determine that the fault was with the setup of the dish, not the TV. (For people migrating from standard-def TV to HDTV, be prepared to reset your aspect ratio.)  A few clicks of my dish remote and I had an amazing 55\" picture in front of me.  At this point I took a 15 minute break while I went from HD channel to HD channel just gazing at the beautiful picture.I attached the DVD player next, and even though it's an older unit and I connected it up via the composite (yellow/red/white) connection, playing a movie was a wonderful experience.  I was ablt to easily set the TV into wide-screen mode so the picture was as wide as the set, and it was just like being in a theatre!  I again took another break to partially watch several disks and gawk at the great picture.The hardest unit to set up was the VCR, because I had to revert to using the RF (coax or antennae) connection.  Be prepared, as there are only 2 of the older connection types available -- 1 composite and 1 RF.  Not that you'll want to use these older ones long anyway, as the picture quality is not nearly as good with them, so know up front that HDMI is the way to go with this set.  Easy to set up and there are 5 of them!  Anyway, once I did the RF setup on the TV (you know, letting it \"look\" for channels), I could put it on channel 3 and view a movie from the VCR.  Again, not the greatest picture, but when you consider you're using 1980's technology, not bad.I couldn't set up our WII video game at this point because I didn't have a component (Red/Green/Blue + Red/White) cable -- the WII only comes with a composite cabe, but we're already looking for a new one -- but I am confident that it will look just as amazing.Overall, I'd give this set an 11 out of 10 just on the viewing experience alone.  Be prepared for the limited number of older style connections -- or just go all HDMI -- but setting the unit up and adding additional components is extremely easy, and I just can't say enough about the picture itself.  Tape your socks on, otherwise they will be knocked right off!The only real problem I had was with delivery.  The box the TV comes in is huge, so a company like UPS won't deliver it.  We don't live in a big city, so not only did the delivery company not help me with the setup, but I had issues with the local delivery guys not calling the correct number and not being able to find us on a map, and I think that cost us a day.  Considering that the delivery was free though, I guess I can't really complain too much.If you've been waiting for flat-screens TV's to come down in price or have certain features, the time is right.  I would highly recommend this Vizio not only for it's eye-popping picture and ear-pleasing sound, but for it's ease of set up and it's appearence as well.  It truly looks good off as well as on, and the only way it could get better is if they lower the price even more!", "Date": "November 11, 2010"}, {"Title": "Very pleased", "Author": "Dave S.", "ReviewID": "R2GQ5WPGD01QNA", "Overall": "5.0", "Content": "Just to put this review in perspective, this is my first HDTV.  I've had it for around one month now.  I was about to purchase the older 552XVT model but just happened to notice the 553SV.  From a specs standpoint, the 553SV is improved over the 552XVT.  It has a higher contrast ratio and more zones in its full array LED package (I had a strong preference for a full array vs. edge lit LED).  The 553SV also looks sharper and is a couple of inches thinner than the 552XVT.  I purchased the 553SV from Amazon.  Delivery was on time and the delivery guy brought in the TV, unpacked it, and made sure it was working.  That was nice.  Setup and connections were no problem.  The remote is somewhat chunky but it's solid and easy to use.  The slide out keyboard is a nice feature (this feature is on earlier models as well).  Connecting the TV to our wireless network was easy and was accomplished in seconds.  We get a strong connection.  We've successfully streamed a movie from Amazon VOD without any pausing or buffering.  I am very, very impressed with the picture quality of the Vizio.  I use the calibration settings from CNET but I left the ambient light sensor on because our room's light level is constantly changing during the day.  If you're picky, it's easy to change the picture settings through the TV's on-screen menu.  Our TV signal is through FIOS (connected through HDMI) and the HD channels are nothing short of outstanding in terms of PQ.  HD movies and sports are great to watch.  The audio is also surprisingly good.  I'm not a video gamer so I can't comment on that.  I also don't have a blu-ray player yet.  Watching SD channels is ok but obviously not as nice as the HD stuff.  I don't even bother watching SD anymore unless it's programming for our kids.Not much negative to report yet.  If you have older peripherals, you may miss the S-Video port.  That's what I was using to connect my DVD player to my previous CRT.  Now I connect using component cables.  I would also like to see the Blockbuster widget.  According to press releases earlier in the year, Vizio reached an agreement to put the Blockbuster widget on their internet TVs so hopefully it will get added soon.All in all, this is a great TV.  The picture quality is really impressive.  I'm not a true videophile, but if you check other reviews from the more professional sites, you'll also find very positive comments.  I highly recommend the 553SV.", "Date": "September 18, 2010"}, {"Title": "Main Board quit after 16 months", "Author": "Amotd", "ReviewID": "R1JGRP9QN4J3QS", "Overall": "1.0", "Content": "The screen went black after 16 months but still had sound.  I called tech support where the support tech told me what a great tv I had bought and how it was one of his favorites.  His toon quickly changed when his only suggestion was to to do a reset and the problem did not go away.  At that point he very quickly pointed out it only came with a 12 month warranty and gave me the number of a repair service company.  While he was correct that I was four months out of warranty he offered nothing but an \"oh well\" when I said I expected their wonderful tv that he had been praising a few minutes earlier to last a bit longer.  Luckily before I threw the thing out the door I realized I had bought on my American Express and had an extra year of warranty coverage.  Main board was bad and is being replaced and fully covered by the warranty extension.This was my first and last purchase of a Vizio product.  For $1,500+ I expect a product to still be working after 16 months.  An offer to split the cost of repair would have been a nice customer service gesture when I asked if there was anything he could do and would have shown that Vizio stood behind their products.  In hindsight it was not needed but given a crappy product and not much customer support I'm done with Vizio.", "Date": "September 17, 2012"}, {"Title": "Excellent... the third time around", "Author": "Amazon Customer", "ReviewID": "R12AQE7NV7FT0N", "Overall": "3.0", "Content": "I really struggled with an appropriate rating to give this TV.  When you finally get a working one, it's the best I've ever seen.I ordered this TV a little over a month ago.  It was delivered a week later, I set it up and watched Avatar on Blu-Ray.  The picture was absolutely magnificent.  Later that night, my wife was watching a DVD and the screen went blank.  Much fiddling and still a blank screen.  No menus, no nothing.  A call to Vizio support the next morning determined it needed to be replaced.  They said they could do it or I could have it replaced through Amazon, so I sent it back to Amazon and had them send me another one.Second one arrived a week later.  Hooked it up and went through the set-up then left for work without really watching anything on it.  That night, while watching a DVD, the wife and I noticed dark splotches in several areas of the screen.  Switching to different inputs/sources, movies, etc didn't change anything.  These areas always appeared darker than the rest of the screen.  (I think the local dimming controller had issues).  Called Vizio support again and once more determined that the set needed to be replaced.  I opted to do it through Vizio this time as they said their delivery agency would bring it in, hook it up and make sure all was well before leaving.One week later (yesterday) the third TV arrived.  The delivery guy brought it in, set it up, turned it on, and all was well with the world.  It's been 24+ hours now and still no issues.I would recommend the TV to anyone, with the caveat that they should find a dealer locally to buy it from.  A place where they can go have the dealer plug in the specific TV they are going to buy so they can check it out before they take it home.I finally settled on three stars due to the apparent quality control issue Vizio has and the hassles I went through to get a functional set.  Honestly, though, the final set I got I consider to be 5 star in all categories.", "Date": "June 15, 2011"}, {"Title": "Excellent!!! 5/5", "Author": "Kurt", "ReviewID": "R162CZUFMJ6W1D", "Overall": "5.0", "Content": "This Vizio 55\" LED is a Great buy, had it around 7 months. Excellent picture,great for playing games! Love it 5/5", "Date": "May 30, 2011"}, {"Title": "Vizio 55 Inch LED LCD HDTV", "Author": "moviefan", "ReviewID": "R4SAJ8DB3DCL7", "Overall": "5.0", "Content": "This 55 inch class HDTV has outstanding picture quality.  I have already watched several movies and lots of sporting events in the few short weeks I have had this unit and I am quite impressed.  Viewing angles are excellent, as is the brightness and color.  The internet ready capability is very easy to use.  This model comes already preloaded with applications called Widgets for accessing the most popular internet web sites.  Even the audio speakers that are built in have decent sound quality.  I can heartily recommend this unit to anyone considering a large HDTV.", "Date": "February 21, 2011"}, {"Title": "Excellent picture quality and ease of use.", "Author": "daniel", "ReviewID": "RGER9BO19T4PU", "Overall": "5.0", "Content": "Delivery by Amazon was prompt with TV placed in bedroom, removed from packing and function checked before delivery people left.  The set has amazing picture quality and was hooked up to surround and wireless in about five minutes.  The built in program takes you thru all the steps to set up all the components you may wish to add as well as programing the proper remote codes into the slide out Vizio remote.  This is the first Vizio product I have purchased but it is at least the same quality if not better than the Pioneer it replaced.  Good value for the money.", "Date": "February 1, 2011"}, {"Title": "Audio return channel. Yes!!!", "Author": "JG", "ReviewID": "R1QJX987WS0D62", "Overall": "5.0", "Content": "This television definitely met expectations. Great picture with easy controls for internet applications and tv settings. The manual has pictures that is a plus. Television even had 4 well placed threaded holes to hang on the wall to a wall mount. The one thing this television does not tell you is that HDMI connection 1 has audio return capability and how to activate it (use CEC settings). I did figure it out and it worked great with my surround sound system. It eliminated the use of an optical cable. Very useful when watching streaming HD movies through the internet and you want the sound sent to your surround sound system from your tv where it can be broadcast in HD sound.", "Date": "January 29, 2011"}, {"Title": "Amazing picture", "Author": "ambientech", "ReviewID": "R36YNUGZ8959KG", "Overall": "5.0", "Content": "I normally don't write reviews but I am simply blown away from the picture the 553 has. The black levels just can't be touched by any other LCD. Setup very easy and loved it walked you through programming the remote to control all of your devices. Nothing I found can touch it for picture quality or price.", "Date": "January 29, 2011"}, {"Title": "Amazing Value", "Author": "Wanax", "ReviewID": "R18RGO8HCLGQG8", "Overall": "5.0", "Content": "Stunning picture with easy set-up. Blu Ray movies look spectacular. Full-featured, if blocky, remote control.  Internet connectivity is better and faster than my XBox and our internet-ready LG Blu Ray player - a delightful surprise.  Fast and intuitive, the included applications open up a whole new array of content options.The Netflix app is especially cool as it allows for some basic browsing (heretofore only available online) of Netflix library offerings outside of one's queue. Accordingly, we view our Netflix movies directly on this glorious display without powering up either the XBox or the DVD player.", "Date": "January 16, 2011"}, {"Title": "CNET review is accurate", "Author": "duff57", "ReviewID": "R14GPEAN2VBUY2", "Overall": "5.0", "Content": "CNET reviewed this as the top LCD model, and everything we have experienced is exactly as they reviewed this model of TV.  The color is sharp and vibrant, the HDTV settings are incredible.  It is a fantastic set to watch the NFL playoffs.Blue Ray movies make you feel like you are in a theater.  The size is perfect for any room with 8-10 feet viewing distance away from the set.", "Date": "January 16, 2011"}, {"Title": "No Need To Ever Go To Another Sporting Event", "Author": "Jim Love", "ReviewID": "R1WABBP3U4ULYG", "Overall": "5.0", "Content": "Just received the Vizio 553 this past Friday (day before the second round of NFL playoff games).  I had gotten a message on Thursday from the delivery service saying they would not be able to get the TV to me until Monday.  I called them back that afternoon, and explained the dire situation of Playoff weekend without the new Vizio.  The guy understood completely, and got the TV to me on Friday.It took longer than expected to get everything up and running since we were connecting the new TV, a new PS3 Move and the Pioneer receiver for the home theater.  Better instructions for getting everything to work together would help, plus we will need to go through setup again when the Harmony One remote arrives to try and make operation of all the components easier for my wife (and me).Now the really good...this is without the best picture I have ever seen, and everyone looking at it with me agrees.  My brother-in-law who helped me set up the system is still in awe of the picture quality, and the ability to be connected with WiFi.  He owns three HDTV's, and will probably get in trouble with his wife when he just has to order this TV, too.  The two games we watched were just like being there!One other thing...after getting everything set up, the TV had a very annoying white line running across the top of the picture.  My first thought was there was a flaw in the set, and someone was going to have to come out to fix it.  I called Vizio, and they were very helpful in getting the problem fixed on the spot...the picture just needed to be adjusted vertically slightly.Overall I can't be more happy with the Vizio.  Will review again after having the set longer.", "Date": "January 16, 2011"}, {"Title": "Picture quality is mind blowing..beats any sammy I've seen, but without the thin form factor", "Author": "modz \"Play it Sam\"", "ReviewID": "R3M8JAK2TF34AS", "Overall": "5.0", "Content": "I purchased this over the thanksgiving weekend from Costco and got a great deal before they stopped stocking it. I had some initial reservations about it, but after some tinkering and fine tuning the settings the picture is now AMAZING! I dont watch much TV, but this TV is making me watch more.. Audio is great as well, but I use my surround speakers for any movie watching.. so dont really need TV output audio as much.Cons: The thickness and weight of this unit.. I would have liked a thin form factor like a sammy, but I think the downside to that would be that edge lit picture quality doesnt come anywhere close to this unit.- Component connectors.. given the thickness of the TV, I would have liked the connectors to be a little more recessed into the TV so that I could mount it closer to the wall with a thin profile mount. There's a little bit of a recess, but not enough.- Power cable - I dont know why companies dont all just make power cables with low profile plugs like some refrigerator companies do. The power cable has a HUGE plug that plugs into your power socket and again makes it hard to mount on the wall without a significant gap behind the TV. I replaced this cable with a different one to get closer to the wall. I had rewired my power socket such that it was concealed behind the TV. I dont want to see the power cable dangling out when everything else is hidden.Advice: dont get expensive \"Monster\" cables.. go with monoprice instead.", "Date": "January 4, 2011"}, {"Title": "VERY happy with this AWESOME television!", "Author": "W. O'Meara \"Bill in NY\"", "ReviewID": "R2O1G8S9I9ANSR", "Overall": "5.0", "Content": "I have had this VIZIO for about a month now and I don't think I could be much happier.  I am not a \"techno-geek\", so I'll try to stick to issues the average viewer will care about.The picture quality is first rate.  Watching football on this giant, clear screen is just unbelievable. No wonder Vizio is the official HDTV of the NFL!  Just be sure to use the \"Football\" picture settings.I thought the picture looked great right out of the box.  However, I do think you should tweak it a bit to suit your individual taste.  I tried the suggested \"Movie\" settings that others have posted in their reviews, and I do find them even more pleasing to my eye.  Whether you like the picture brighter, or your colors extra vibrant...or more natural...you will be able to adjust this set perfectly.Setup and connection to my home Network (does work with WEP) was a snap and took just a few minutes.  The Vizio Apps feature was a big reason I bought this tv....I wanted to be able to access my Netflix account.  It works great...even though the speed of my DSL line leaves a bit to be desired. The Netflix movies play perfectly..although my connection is not fast enough to play HDX quality on VUDU without a lot of buffering.  In any event, the movies look fine.  In fact, I think this tv does a great job with non-HD programming...much better than my older JVC HD-ILA projection set.  I use DirecTV, by the way, and it looks really good.  It is true that you can't surf the web on this model...but Vizio never advertised that you could...so I don't understand that complaint.Linking the clever remote control to my DirecTV HD-DVR and my Sony Blu-Ray was also a snap...and it controls all of my devices completely and easily.  I don't fully understand how it does that via Bluetooth, since those sources are not so-equipped, but it all works fine and that's all that matters.  As several other reviewers have stated, it would be nice if the remote was backlit, but I think the slide-out keyboard and not having to aim it at the tv or other inputs more than makes up for that minor shortcoming.Other quick points...glare is minimal due to the matte screen.  You can't turn off the VIZIO logo under the screen...but I really don't find it distracting as some others have said.  Delivery via Pilot was right on time as I had scheduled on the Amazon order screen.  It was cold outside when delivered, so I just had them unbox it to check for damage and let it warm up before I plugged it in...as they recommend.I have had none of the problems mentioned by others...no pink screen...no freezing...no popping noises...maybe I am just lucky, I don't know....so I have not had to contact Vizio...therefore I can't comment on their customer support yet.  But I got a great price (and free shipping) on Amazon...less than the Club stores...and my whole order went fine.  So now you know why I am happy.", "Date": "December 28, 2010"}, {"Title": "Great TV even in direct sun light.", "Author": "Dave Fronk", "ReviewID": "R2FR36GJACZ1M2", "Overall": "5.0", "Content": "What a great picture on this bad boy.  This TV is placed in a room that has a wall of windows.  On Saturday/Sunday afternoon watching football games the sun directly hits the TV.  I was worried that the picture would degrade with all of this sun light.  But to my amazement the picture remained fantastic.  I can not say enough positive things about this TV.  The only negative would be the set up.  There are so many options it would be difficult for a novice to set all of the options and internet apps that are available on this TV.  I've seen the new Vizio 3D TV's but this 3D screen is more glossy and I really question the ability to do well in direct sun light.", "Date": "December 10, 2010"}, {"Title": "What a value", "Author": "scaryd", "ReviewID": "R3H0Y2F6X6Y8QV", "Overall": "5.0", "Content": "Not a whole lot more to say than what has already been said.  First of all, I ordered it and it was in my home all within 5 days.  Cannot beat that.  And most importantly, my wife was the once who was home when they made the delivery and she is used to some pretty rough delivery folks.  She had nothing but praise to say about the folks that delivered this TV.  TV is easy to set up, looks incredible and the internet connections are 2nd to none.  For half the price of similar TV's, you cannot beat this deal.", "Date": "September 25, 2010"}, {"Title": "Good Value - Quality Lacking", "Author": "Rodney Kraus Jr.", "ReviewID": "R1UPVS3ILLQQKN", "Overall": "3.0", "Content": "Purchased December 2010This Vizio has the value and the features, but the quality seems to be lacking.  Yes, this tv has a lot of great extras/options and appears a really good value for what you get.  We have had this Vizio for 6 weeks and have had to exchange it twice.  The first one had faulty HDMI inputs according to Vizio which caused constant video and audio issues with both cable and Blu-Ray.  The second one was better with the exception of a 4\" spot where the LEDs were not working and it left a constant shadow on the screen.  I really want to like this tv and I haven't seen any other brands that can touch the price for what you get.  Aside from the issues mentioned, the picture is great!  The WIFI works really well.  The audio is okay, not the best or the worst I've heard.  We are now on the third one without issue thus far; knock on wood.  If you want to give this tv a shot, know the exchange/return policy where you purchase it from.  After 30 days, you may have to go through Vizio direct and wait for an available tech.", "Date": "January 12, 2011"}, {"Title": "A bad television", "Author": "rxinfla", "ReviewID": "R2FKZXO4SB01JM", "Overall": "1.0", "Content": "DO NOT BUY THIS SET UNDER ANY CIRCUMSTANCES ---- After one month, the TV picture started  to fail but then came back.. Then after 5 months it failed altogether....  I called Vizio , after Amazon told me I must go through the manufacturer. VIZIO said it is not under warrantee, because Amazon bought it first!!!  WTF....  So I get a company that due to \"their\" technicality, WIll Not stand behind their product. , I was never made aware of the warrantee being voided upon purchase from Amazon  Nowhere is there a warning on the purchase agreement that there is no warrantee on this set!!!  Not even in fine Print!!  If I knew I would have never bought such an item.  IF your judgement is that you must buy this inferior set to Sony or Samsung  Buy it at a retail outlet that will stand behind their product...  Once again VIZIO WILL NOT STAND BEHIND THEIR PRODUCTS!!!!!  5 MONTHS AND BROKEN>>>>  ... So now I am stuck with a 55 inch radio!!!!  SHAME ON VIZIO--- And never again!!!", "Date": "December 13, 2011"}, {"Title": "Vizio an amazing TV for the price!", "Author": "Kris \"Mountain Wizard\"", "ReviewID": "R3IEWCQ6S9LMVF", "Overall": "5.0", "Content": "I just got mine a few days ago and the display is amazing, I use mine as my computer monitor I upgraded to this from a 18 month old Vizio 47\" with the 120hz. This is so much better it is hard to believe, mine cost just under $2000 with tax, Washington. I wanted to buy the Samsung LED TV yet was not willing to spend several hundred more for a slightly better picture.I love the new remote and the black on black look of the is Vizio.I also expect to save $200 a year in electric costs as this bigger Vizio uses less than 1/2 that the older 47\" model does, 150 vs 400 watts.If you can afford over $2500 buy the Samsung, it does come with the 3D glasses, if not buy this.RE 3D I am waiting for the no glasses versions and plenty of programing models that are yet to be built.", "Date": "September 16, 2010"}, {"Title": "Great when it works", "Author": "Jonathan E. Beerhalter \"Johnny B\"", "ReviewID": "R16NFIHKLK38BV", "Overall": "1.0", "Content": "I bought this TV about three weeks ago and it's been nothing but trouble. I've spent at least 20 hours on the phone with Vizio, and now they want to send someone out to take a look at the TV. The TV freezes all the time and I get crazy colored lines across the screen for the first ten minutes its on. I'm very close to simply returning the TV and purchasing something that works better.Update-----The support people from Vizio were extremely helpful and we went through darn near everything to fix my TV. So if there was a separate rating for service related to this product, it would have gotten five stars. In then end, the service people on the phone couldn't figure it out, so they sent out a repair tech person with a new motherboard, and since that point my TV has performed great. So there were some hassles, but at the end of the day, I have a great TV at a great price, backed by great service.", "Date": "January 18, 2011"}, {"Title": "Do not purchase!", "Author": "Brian Wojciechowski", "ReviewID": "R1I9MZIEK90IRB", "Overall": "1.0", "Content": "Picture went out after 2 years. Garbage! Well known problem with the main board and power boards and Vizio will not stand behind their product", "Date": "August 31, 2013"}, {"Title": "Highly Recommended Must Buy", "Author": "Chris N", "ReviewID": "R1AFBLC814NM8D", "Overall": "5.0", "Content": "Long before I purchased this HDTV I had be dreaming of a way to have a internet connected TV. When I learned about this model and at the time the lesser-known company Vizio I knew that I had to take a chance to finally make my dream come true of a internet connected TV and I purchased this model when it first came out even before it was in stores to see first hand. To this day I have never looked back on making that decision!First the design is great and will work in any setting. This model offers plenty of inputs for all your entertainment needs (4 HDMI, I even charge my Iphone to one of the 3 HDMI ports). And the picture quality is the best I’ve seen on any HDTV, watching sports is even better then being there. I still get compliments from friends asking, how is your picture quality that amazing, my HDTV doesn’t look that good? Now the internet apps, I use Netflix, VUDU, Amazon Instant Video and Yahoo Fantasy Football the most. All the other apps are pretty disappointing and I would like to see more development in this area. I connect my MAC through HDMI to truly offer the internet connected TV experience that I was looking for (mainly surfing the web or playing Itunes). The only major disappointment I have for this TV was the remote. It does have a slide out keyboard which is handy with the apps, however it is bulky. Additionally it is not backlit which makes it impossible to use in the dark while watching a movie.Finally Vizio’s Customer Service is hands down the best! They are friendly and respectful while concentrating on answering questions or problems. I experienced a hardware issue that caused horizontal black lines on my screen. Customer Service first attempted troubleshooting with me over the phone. After recognizing that did not fix the problem, Vizio sent out and setup up a new TV. No hassle or endless calls to customer service, they simply rectified the problem by doing the right thing and with class.Thank You Vizio... I can’t wait to purchase my next TV from you!", "Date": "February 17, 2013"}, {"Title": "Avoid at All Costs", "Author": "Jacob Buurma", "ReviewID": "R31HHRZGENUUGL", "Overall": "1.0", "Content": "Like many other people, my television's backlight unit failed just after the Vizio warranty period.  As a result, I can get audio but no video.  If you insist on getting this television, I strongly suggest that you purchase an extended warranty (I used Squaretrade).Next time I am just going to go with Panasonic or Samsung.", "Date": "June 19, 2012"}, {"Title": "Not Happy", "Author": "cowgirl", "ReviewID": "R36JSMTF5DCECJ", "Overall": "1.0", "Content": "We bought this TV and were satisfied with it's performance...for 1 year!  It started going black just after the 1 year warranty ran out and getting information on the problem was long and convoluted.  It seems that a $1600 TV should last more than a year.  I am not happy and would not recommend a Vizio TV to anyone.  Getting it repaired cost more than buying a new one.  Guess I'll be replacing it and scratch Vizio off my list of products to buy.", "Date": "March 26, 2012"}, {"Title": "Owned it for 9 months, LOVE THIS TV!", "Author": "D & L", "ReviewID": "R17OJIW9G8GLYR", "Overall": "5.0", "Content": "I purchased this TV from Amazon approximately 9 months ago. The TV performs flawlessly, the picture is crisp and clear, the speakers produce high-quality sound (comparable to other flat panel TVs) and the purchasing, delivery, and setup provided by Amazon and their 3rd-party delivery service were all excellent.The TV was delivered within a week of placing the order. The delivery contractor was helpful to work around my schedule and delivered after normal business hours. He assisted in attaching the TV to the wall mount (I had already installed this) and stuck around until I tested all functions of the TV.After first purchasing this set, the TV did randomly power-cycle itself a handful of times. After contacting Vizio, we the app responsible for the issue, downloaded a firmware update, and the issue has not occurred since. I researched this and comparable sets for two months, and decided upon this one based on the specs and the relatively affordable price. I have owned several Vizio TVs and have been nothing but satisfied in the past, but this set is truly perfect.", "Date": "March 5, 2012"}, {"Title": "Blown away by this TV!", "Author": "Kim Kiddo", "ReviewID": "R1NLAWKZE2144Y", "Overall": "5.0", "Content": "I replaced an older Panasonic plasma set with this TV and couldn't be happier!I use a 1'st generation (fat) PS3 for Blu-Ray, DVD and Netflix, but the built-in Netflix app on this TV looks just as good as the Netflix App on the PS3. I also use it as a second monitor for my iMac computer. Fantastic!I live in a 10 foot by 10 foot room in an assisted living home and this TV in my small room is just like having my own personal theatre.On bright sunny days, this set can be made bright enough to overcome the light from the windows, and unlike the plasma it replaced, has almost no reflections. In the evening and at night, using the settings I found on-line, it looks so \"real\" it is way more enjoyable than the old TV (which was almost un-watchable in the daytime.)While yes, my room is very small, I have no complaints at all about the sound from this set. It is clear, dynamic and very immersive. More than enough to overcome the noise from my oxygen making machine and other house noises. I only wish I could plug a set of headphones into it for late night viewing.Another resident here has a 47inch TV that cost about the same as I paid for this and there is no comparison. For about the same money, my TV is not only larger, but the picture quality, smoothness and detail make the other set look pale, washed out and lacking in detail.Even though buying this TV was a real financial stretch for me, It's one of the few things I ever bought that I have absolutely no regrets about buying (my iMac is the only other nice thing I own)For someone like me who is confined to bed about 95% of the time, and who watches a LOT of movies, I am 110% satisfied and love it so much I couldn't care less how much it cost.", "Date": "February 4, 2012"}, {"Title": "Great TV", "Author": "R. Owings", "ReviewID": "R3L5LI2FNZC1TW", "Overall": "5.0", "Content": "It took 3 weeks for us to get this TV but as we expected we just love it.  It was very easy to set up and connect to our wireless network.  I mounted it on the wall but it came with a pedestal stand that seemed pretty nice, maybe I'll find another use for that.  The price was reasonable and shipping was free although slow as molasses.  The picture on this TV is brilliant and the HD programming utilizes it well however even non HD programming is great.  Overall I think it was a very good purchase and we are very happy with it.", "Date": "January 31, 2012"}, {"Title": "COULDN'T BE HAPPIER", "Author": "JMART", "ReviewID": "R1T1UTXO8WAAJA", "Overall": "5.0", "Content": "I have had the TV 3 weeks now and couldn't be happier. Purchased through Amazon/Frugal Buys on 12/21/2011 and delivered on 12/23/2011. The delivery service called the day prior to delivery and the morning of delivery to confirm delivery time. The delivery person unpacked the TV and inspected it with me for any damage. With the help of my son, I set the TV up (comes with the the TV stand already attached) on a TV entertainment center, ran the HDMI cables and completed the TV start up menu and apps set up all within 1 hour. I am not a technically inclined so I won't give you any specification details, but the color on the TV is vivid and outstanding, with guests saying the same thing. Sound is above average. App functions are easy to navigate and the remote with the keyboard is simple to use. Previous reviews I read stated that the TV will freeze up, which requires a start up/reboot. I personally have had a couple of instances where the TV and/or signal has had a very slight freeze (about 1 or 2 seconds) but not where it completely freezes and requires a reboot. Overall, based on the value, service, picture quality and outstanding color I consider this a great buy.", "Date": "January 9, 2012"}, {"Title": "Watching sports is unbelievable", "Author": "Impressed", "ReviewID": "R2QZY225REGESX", "Overall": "5.0", "Content": "The HD picture on the tv is much better than I could ever had imagined. The picture for football and hockey is beyond belief. I've become hooked on NatGeo, love Alaska State Troopers, because the scenery is so vivid. The HD picture is better than a buddy of mine who bought the Samsung 6400. Perhaps it's because it's full LED and not just edge-lit. A couple of downsides: It's not as thin as some of the other LED tv's and when watching a non-HD station, such as King of Queens on TVLand, there are some lights along the top of the picture that flash like a string of lights. Not a biggie to me, but it might bother others. For what I paid and how I use the tv, sports, movies, and primarily HD programming, the picture is out-of-this-world. If anyone knows how to get rid of the lights at the top of some non-HD programming, it's only a couple of stations that do it, let me know. Also, we've had the tv a month and I just used the out of box settings. Before I bought the tv I read recommended settings; just can't see how it could get any better. Even my wife, who didn't give two cents about replacing our old tv, can't believe how much more she enjoys watching tv b/c of the picture quality.", "Date": "December 14, 2011"}, {"Title": "$1298", "Author": "Sam Club", "ReviewID": "RTWCDB2PREC97", "Overall": "5.0", "Content": "You can get this tv for $1298 at the local wholesale club. With a 3 year warranty for 179.99. The location is in my name.", "Date": "November 21, 2011"}, {"Title": "Great TV so far", "Author": "Tampart1 \"Tampart1\"", "ReviewID": "R2Y6LWZTFY6SSP", "Overall": "4.0", "Content": "I have only had this TV for 3 days, and I love it.  Great picture quality and the sound is OK, but then I am spoiled with a 7.1 surround sound system. This replaces a 47 in Vizio, which still works great--just moved it to another room.  I had a difficult time linking my new 55 in TV to my Vizio router, but a great tech service rep at Vizio walked me through a long procedure to fix the problem. The Vizio aps would not recognize my router(and it is a Vizio router); if this happens to you, give Vizio a call and they will walk you through it---very complicated, but it worked.UPDATE: 10-31-11The next problem I had was that I could not listen to the sound through my Onkyo surround sound system, only through the TV speakers.  Another call to Vizio told me what to do: you have to use a HDMI 1.4 cable, and mine was a 1.3.  She also said that the receiver had to be ARC capable, whatever that means.  I called Onkyo today, and the rep said that my receiver was ARC, and there were some settings that had to be changed--which he walked me through.  He also said that I had to hook up the HDMI 1.4 cable to a special HDMI outlet on the Vizio tv that said \"ARC\".  Actually there is no \"ARC\" on the Vizio; the regular input HDMI is ARC, but it is not marked as such.I do not know why Amazon raised the price of this TV from $1400 last week to $1674 this week, especially since Sams sells it for $1400.  I think Amazon will be competitive but do not know that for sure.  Anyway, do not pay $300 more just to get it here.I got my 1.4 HDMI cable and hooked it up, and I am now able to listen to the TV thru my Onkyo surround system, and my TV speakers, or either separately.  The trick is to turn OFF the CEC functions on your Vizio: go to \"TV settings\" via the Vizio apps, then scroll down to \"CEC settings\", and make sure the CEC function and system audio control are turned off. If you do not do this, then you will not be able to listen to your surround sound speakers.  Personally I prefer to listen to 9 speakers, rather than 7.The next problem that I discovered is that you CANNOT listen to your surround sound system if you access Netflix, or Pandora, or other internet apps through your Vizio TV.  You can only listen to these apps through your TV speakers.  I first thought this was an Onkyo problem, but found out it is a Vizio problem.  For some reason, the Vizio apps software will not work with a surround system; I confirmed this yesterday with a Vizio tech rep.  So if you are planning to listen to Netflix or any other Vizio apps through your surround sound system, you are out of luck.  I do not know if this is so if you have a Vizio sound bar, but it sure is with an Onkyo system. (SEE LATEST UPDATE BELOW ON HOW TO GET AROUND THIS PROBLEM)The way I got around this problem is to spend another $100 and buy a Roku player, and access Netflix, Pandora, and hundreds of other apps through the Roku box rather than through the Vizio apps on your TV.  Actually, the Roku gives you almost 300 apps, whereas the Vizio only gives you about a dozen.  Had I known all this in advance, I probably would have gotten another TV, because I paid for stuff that I will never use.  Another option is to get a Bluray player that has internet apps and hook it up to your surround sound system, but the Roku will cost you about $100 on Amazon, and Bluray players are more expensive.The Vizio rep I talked with said I should contact Vizio and complain about this problem, and I intend to do that today.UPDATE NOV 1, 2011: My Onkyo is a TX-SR 608.  I do use an optical cable to route to my receiver, and the ARC on the Onkyo is turned on.  When I turn on the CEC setting on the TV, and the SAC, and when I turn the Onkyo on,  then I can listen to the Onkyo speakers only; the TV speakers do not work. If I turn the Onkyo off, then I can listen to the TV speakers.  With the Onkyo on, I can control the volume of the Onkyo speakers with either the TV remote or the Onkyo remote, but I cannot mute the sound using the Onkyo remote; I have to use the TV remote to mute the sound. This works watching the TV and also using the VIA to watch Netflix.With the CEC and SAC settings on the TV turned to \"off\", and the Onkyo receiver on, then I can listen to TV using the both the sound with the TV speakers and the Onkyo speakers, and I can control either separately using the Onkyo remote and the TV remote. Using this setup, the mute on the Onkyo receiver works.  However, using this same setup, if I turn on Netflix using the VIA apps on the Vizio TV, then I can listen to the sound only through the TV speakers.  So the bottom line is that if you want to listen to Netflix using the VIA apps, and hear the sound through the surround sound speakers, then both the CEC and SAC settings should be turned \"on\".  If this sounds confusing, it is, but that is the only way I have found that it works.", "Date": "October 10, 2011"}, {"Title": "Excellent performance in daylight lit room!", "Author": "Honest Abe", "ReviewID": "RXY6ZVROY95JB", "Overall": "5.0", "Content": "Had Vizio XVT553SV for about month now.  Key features for us were the matte screen (it is directly opposite a picture window in our family room), the full array backlight (not edge lit) local dimming, and the internet connectivity.  We deliberately decided that 3D was not an important item for us since there is very little 3D content around and we felt silly watching TV with 3D glasses on.The performance of this set has been excellent.  Between the matte screen and the full array local dimming we are able to watch in a fully lit room with minimal reflections and good contrast.We have Verizon FIOS with a Motorola STB and the hook up went flawlessly.  The internet apps seem to work fine and we have streamed content over our wireless lan successfully.  The remote control has a built in keyboard, which is useful, but there is nothing else particularly special or easy to use about the remote.", "Date": "September 2, 2011"}, {"Title": "Adult review...this is a great product at a super price", "Author": "MAXVOLT \"Libs suck\"", "ReviewID": "R4WRKBYYV195R", "Overall": "5.0", "Content": "I have both the Vision xvt 55 and the Samsung UN55D8000 HDTVs. Both have exceptional clarity, quality and brightness to their screens. Mine are both on FIOS connections. The Visio is larger in thickness and length and width, but with that comes superior audio capability right out of the box, since the Visio has front facing speakers designed into its chassis. The Visio remote is superior to the Samsung remote in that it has a slide out full QWERTY keyboard, the Samsung is on the opposite side and is a bit cumbersome in comparison to the Visio application. The price of the Vizio was $600 less than the Samsung...but the Samsung is definitelymore stylish. So if function and quality are your preference..at a real great price go with the Vizio...if style is st the top of your list and paying a lot isn't an issue, go with the Samsung...both are great HDTVs", "Date": "August 27, 2011"}, {"Title": "Amazing TV, SIX MONTHS OLD and it still amazes me", "Author": "M. Pasos", "ReviewID": "R21WCXO8QD688R", "Overall": "5.0", "Content": "The price has stayed the same for the past six months!!!!  I believe thats a greater testament to the TVs quality than any spec.  While other TVs have dropped in price by hundreds of dollars this TV is still worth every penny.  I like to visit Amazon just to check the latest reviews, all of them are good with a few 3Star ratings here and there but overall just an amazing TV.I spent a lot of time reviewing LED tvs from Samsung, LG, Sony.  I also looked into the Phillips G20 Plasma.  After much time spent looking into them I bought this TV in February.  Since then I could not be happier.  In my opinion its the best TV you can get at this price and the picture quality is AMAZING.  This is truly a gem of a TV.", "Date": "August 26, 2011"}, {"Title": "Happy customer", "Author": "Cheryl", "ReviewID": "R3O1S8CYNMHNLJ", "Overall": "5.0", "Content": "Looked at many reviews, researched many forums and contemplated many models before pulling the trigger to buy this TV - the one I was most interested in from the start.  I can't say how nice this TV is and set up was fairly easy.  Glad addition to my large family room that is full of light.  This TV pretty much takes the glare out of the equation.  I'm also happy with the view from a slight angle.  For the price, this TV rocks!!!!", "Date": "August 1, 2011"}, {"Title": "Check your Firewall protection if you have problems", "Author": "Sand", "ReviewID": "ROBSDEF2O6SQX", "Overall": "5.0", "Content": "This is our second shipment of this TV and it works great.  We discovered the problem we were having with the first TV was because our firewall was blocking the communication from the TV to its home base.  The first TV would turn itself back on after we turned it off.  A repair crew came out to replace the board and told us if it happened again to send the TV back because something else was causing the problem.  It worked fine for a few days, but the same problem kept happening.The second TV arrived and we had the same problem, so we wondered what the odds were of having a problem for the second time no one else had heard of.  It finally occurred to us to check if our firewall was blocking some communication.  We turned off the firewall and we saw a massive download come through from the manufacturer to the TV dated December, 2010.  It solved our problem.  The TV works great now.I wish someone from the manufacturer would have alerted their repair people to ask new owners if they have strong firewall protection because they had fixed a big software \"issue\" with an automatic download. It would have saved us and Amazon a lot of grief.Amazon was wonderful with the return and new shipment.", "Date": "July 30, 2011"}, {"Title": "Excellent TV", "Author": "TJ", "ReviewID": "R18DH5JWWGYNLL", "Overall": "5.0", "Content": "I've had this TV for 6 months. It is a great TV so far. The picture quality is excellent and the extras are plentiful. There are new apps available all of the time. It's awesome when you are watching a show and you just want to check Facebook and it's right there for you. I would recommend this TV for anyone. Vizio has come a long way over the last 5 years to where they are equal to Samsung and some of the other name brands. I wouldn't have purchased a Vizio 5 years ago but I am happy I have one now. Quality TV without the brand name price.", "Date": "July 11, 2011"}, {"Title": "Great Product at at Great Price--5 months later, still 5*", "Author": "David C. Stevens", "ReviewID": "R26SBEMYQG6RYG", "Overall": "5.0", "Content": "I researched the heck out of this purchase and, frankly, was hesitant to buy a Vizio product based on past reputation. (A restaurant/bar I visit had a dead Vizio panel hanging on the wall for quite a while. Not a good advertisement, huh.) Rather than purchasing from Walmart (and having to figure out a way to haul it home) I ordered it--along with a Sanus Full Motion Wall Mount--from Amazon. It took two weeks to receive, but the delivery company was very good about keeping in touch during the process. Mounting this beast to the wall is not easy so make sure you have help! The onscreen setup worked flawlessly, integrating perfectly into my wifi, 5.1 Sony home theater setup, and bluRay player. I did have an unexpected problem arise: some of the channels we tuned to through the cable box had very pronounced lip sync issues. Almost unwatchable and very annoying. Two long calls to Vizio support gave me answers I didn't want to hear. The suggested solution: running separate audio cables and an HDMI cable from the back of the TV (from the audio out) down the wall to the amplifier audio in. This really ticked me off, since I had installed an HDMI outlet in the wall that worked fine with our other flat panel. The technician said, no, that the recommended way to do it was this rinky-dink setup. He said it was the cable (Verizon FIOS) company's box that was causing the audio sync issue. He also suggested I get an optical cable for optimum sound. After spending $18 on the optical cable and messing up my clean setup everything works fine. No lip sync issue. Yesterday I was looking at the Sony amp instruction manual and found an AV Sync setup paragraph buried on page 44. I changed the setting; hooked my HDMI cables back up the way I had them with the old set; and now everything works fine! Okay, how do I like the set. The picture is fantastic. The VIA (internet widgets) seem like a lot of fun, but I haven't used them much (I've had the TV a week). The lit VIZIO logo below the screen doesn't seem to bother me. I can't speak about reliability yet. My old Westinghouse 32-inch is still humming along after 4 years, so I hope I get this kind of life out of this unit. I seriously thought--and almost purchased--a SONY for $1,000 more.UPDATE: It's been five months since I purchased this television and everything is still a-okay. Amazing picture and so far, very reliable. During the first month it turned itself off a couple of times, but nothing since then.", "Date": "June 9, 2011"}, {"Title": "Some gambles pay off!", "Author": "An Amazon Customer", "ReviewID": "R1L30SNBGY0D3", "Overall": "4.0", "Content": "Took a chance buying this open box TV, but everything turned out great. Have not seen this TV or comparable for less than $1800, got this one for less than $950, no tax, no shipping.TV is the best I ever owned. Great  picture, great apps, easy to use. While it's not 3D, which I didn't want anyway, it's darn close. Dropped all movie channels on my cable service and went to NetFlix. Wi-Fi works seamlessly.Did experience a little difficulty with delivery, and the packing or repacking of the TV was awful, so I had concerns of cosmetic and function damage, but other than one tiny scratch on the screen, which I was able to remedy, everything is fine. Did purchase a warranty, thru SquareTrade, just in case. Would recommend this Vizio to anyone. Only downside is lack of swivel base.", "Date": "June 4, 2011"}, {"Title": "VIZIO XVT the best", "Author": "E. Brown", "ReviewID": "R1JUHI3QI2IMCE", "Overall": "5.0", "Content": "The set up was very easy.  Just follow the steps, you cannot miss. Picture quality is super. All the reviews I could find on this tv were 5star and it held up to the task.  would highly reccomend this tv over all the others in the 55inch viewing.", "Date": "March 21, 2011"}, {"Title": "Vizio 55\" ROCKS", "Author": "J. G. Thebado \"tibb\"", "ReviewID": "RRLRLQN7QIPBP", "Overall": "5.0", "Content": "This TV was a replacement for a 10-year-old 50\" rear projection Toshiba. After extensive research, we settled on the Vizio XVT55SV, and it has more than lived up to expectations.We've tried all of the \"Picture\" settings, and have found that the Standard is perfect for movies, sports, regular TV. HD programming is so crystal clear that it looks like you're seeing better than 20-20.I would definitely recommend this TV for anyone looking at LEDs.*** UPDATE: I bought my 55\" LED TV about 2.5 years ago, and loved it. About a week ago, the screen just went black, still had sound, no picture.We called your tech support number, and was told that our backlight, motherboard and most likely powerboard went out. As it was outside of warranty, we were given the number to call for a recommended technician.Now, we're looking at almost $500 to get this TV back up and running.NOT AT ALL IMPRESSED WITH VIZIO. Our next TV will definitely not be a Vizio product.", "Date": "February 17, 2011"}, {"Title": "LED TV Review", "Author": "Jesse \"Jesse L. Coffman\"", "ReviewID": "R2D6WSOBK8GP0A", "Overall": "4.0", "Content": "So far so good. The Vizio XVT553SV is an awesome 2D TV. Setup was a snap and the internet apps are awesome! The speakers are better than I thought they would be. Plenty of sound and bass. Wonderful picture quality and vivid colors. Great buy!My only negative is the free shipping. I didn't receive the set for 15 days after I purchased it (and was charged for it that day by the way). I actually received the set 5 days after it was promised to me from Amazon. So, I give the shipping an F-. So far, I give the TV a 9 out of 10. Good luck buying! Dirk", "Date": "February 15, 2011"}, {"Title": "Great TV and Value :)", "Author": "VP", "ReviewID": "RMHS5HAN04U78", "Overall": "5.0", "Content": "After careful research, i decided to purchase this HDTV. It has an abundant amount of ports, Features, Internet applications (although many require subscriptions)and a Querty bluetooth Remote. The LED backlit is great for a stunning picture and high enrgy star rating. Thickness wise this tv is a bit on the thick side and it would be nice if it had an internet browser option or atleast widgets to view some of the free streaming video web sites. I guess this TV like the many other internet TV's highlight the paid streaming web sites. Streaming however worked effortlessly and I was able to view fluent clear streaming in HD mode. All in all Great TV for the Value.", "Date": "February 4, 2011"}, {"Title": "Best value for your hdtv money.", "Author": "Ana M. Vasquez \"jvavbv\"", "ReviewID": "R3A1G8PXOZIIJT", "Overall": "5.0", "Content": "I had been looking to purchase the XVT553SV for some time and got the best deal on Amazon.  I am quite impressed with this sets picture quality and even its audio which has seen a significant improvement over previous models.  The sets picture adjustments will suit the most demanding videophile and given this sets pricepoint it represents the best value for your money.  Many highend features but at an attractive price.  Great set and highly recommended.", "Date": "January 26, 2011"}, {"Title": "AMAZING TV", "Author": "Kristal", "ReviewID": "R2GPB4RG3OM4L5", "Overall": "5.0", "Content": "This television does everything you could want it to do.  It is like having a 55\" computer at your fingertips.  The remote control is awesome.  It has a texting slide out keyboard.  The picture still fascinates me and I have this since before Christmas.  It is the closest thing to 3D I have ever seen, without actually being 3D.  I watched It's a Wonderful Life over the holiday and it looked like a new dvd.  I cannot say enough about the quality of the picture.My husband set the tv up in no time and that is not an easy feat considering his surround sound and xbox and all the other components he hooks up.  It is very user friendly!!!!", "Date": "January 16, 2011"}, {"Title": "Great deal - UPDATED", "Author": "4America \"4america\"", "ReviewID": "R6HE83S50Z6AF", "Overall": "5.0", "Content": "I actually bought this tv at Sam's for $1348 - it was an in store deal. Unfortunately, you can't find them in any of the stores any more - at least not the ones with the deal. I don't think you can find a better value than this set. It pretty much has everything you could ever want in a tv at a substaintial savings from similarly equipped sets. I am very disappointed in having to buy a set from China but almost all the sets are either from there or Mexico (have your choice of a corrupt government).Picture quality is excellent. Great features. This is my first tv with web apps so I don't have much to compare it to but I think they are done very well. Netflix is the big one and the interface is great - much better than my Sony Blu Ray. I guess my only complaint so far is that the remote does not have a lit keypad. Not a huge issue but you have to assume that most tv viewing is done in low light and it is very hard to read the keys.I would definitely recommend this set.==========================Now that I've had the set for about two months I'm finding that I have a similar problem with audio that others have reported. When I turn the tv on there is little to no sound. If you go to the base channels ABC, CBS, NBC it is better but you get no audio in HD. If you wait awhile it will eventually work itself out; albeit, in a very annoying cracking manner. I'm going to start a tech issue to see what that experience is like.", "Date": "January 11, 2011"}, {"Title": "Fantastic TV, Great Value", "Author": "bruce_dude", "ReviewID": "R1T1RBJUO07DC8", "Overall": "5.0", "Content": "This TV is absolutely fantastic.  BluRay really shines, especially with fast moving and dark scenes.  Netflix in HD is incredible.I went to several stores that carry Vizios and compared them side-by-side to Sony, Samsung, Toshiba, and the difference between them was minuscule.  In fact, I thought Vizio was better in bright light situations.", "Date": "January 10, 2011"}, {"Title": "Great TV", "Author": "jcuder", "ReviewID": "RSIYUU41LPKNV", "Overall": "5.0", "Content": "Pros: Truly amazing HD picture, handy apps (the netflix app is quite nice), lots of inputs, remote has full keyboardCons: I have a horizontal line of pixels across the very top when viewing non-HD channels (this is probably my satellite dish receiver).  More advanced audio control would also be a plus.All in all, a very positive experience.  Amazon's delivery was also quite good -- no problems whatsoever.", "Date": "January 10, 2011"}, {"Title": "Completely satisfied and overwhelmed by picture quality. A steal at that price...", "Author": "Gman", "ReviewID": "R3AXSSH7VQCDHA", "Overall": "5.0", "Content": "Ordered 12/23/10 this from Amazon and received it in about a week. Setup was straight forward with on-screen guides upon powerup. Never needed to reference the included docs whatsoever. Was up and running in 15 minutes including internet setup and apps. Picture is awesome even when compared to my Pioneer 60\" Kuro Plasma. What impressed me the most was that this unit approached the black levels of even the Kuro and dare I say even beat it in color rendition. Tweaking the motion/smoothness settings a bit specifically for movies versus documentaries proved that this is a superior unit than most others LEDs out there.Without a doubt a great value given all the picture and superior picture quality. Glad I stayed away from the Samsung (would have been a big waste). So impressed I'm speechless...just wish price comes down again so family members can join in the fun. Kudos to Vizio for engineering such a great product!", "Date": "January 6, 2011"}, {"Title": "Great TV for the money", "Author": "David J. Newton", "ReviewID": "RZW8WTYTSHDAM", "Overall": "5.0", "Content": "I picked this Vizio based on a popular HDTV podcast review, and patiently waited until the right price hit Amazon.  Free shipping, too.  Haven't explored everything yet, but we love this TV so far.I installed it in our master bedroom; the distance from screen to our eyes is 12 feet.  At that range, and with a hi-def signal, football games take on a whole new perspective.  I find that the picture is so huge at my viewing distance that I can move my eyes around the screen during a play and pick out things I'd never seen before on lesser TVs.Hooked the TV up to an Ethernet switch and fed HDMI cables into it from my cable box and blu-ray player.  The internet apps run briskly with the hard-wired configuration.Pros:- Screen size and picture detail.  I still haven't calibrated the screen, but it still looks very good.- Remote.  Slide out keyboard!- Apps.  Netflix is pretty addicting when it's right on your TV.  Vizio did a good job with their apps presentation.- Setup was easy; the TV found and set up remote settings for the cable box and blu-ray, so the majority of functions are controlled with the one remote.Cons:- The TV is kind of chunky, but, it's a back-lit LED, so about what you would expect.- Remote.  Needs a backlight.  Also, a subtle, but slightly annoying click, which gets old when going through Netflix menus.Overall, I'm very happy with the purchase.", "Date": "January 6, 2011"}, {"Title": "Vizio HD TV Review", "Author": "Paul R. Cote \"Paul\"", "ReviewID": "R1XBAJM7EC9RNW", "Overall": "5.0", "Content": "After much research on the web and in stores, I settled on this Vizio TV.  I was not disappointed.  The set up was seamless, the picture was excellent but the audio was less than expected, especially when watching sporting events.  The announcer's voices were almost hidden in all of the background sounds.  My older surround sound system does not support HDMI inputs, but I was able to use only the AV audio to replace the TV speakers and all is well.  I have a plan to purchase a more modern Surround Sound system in the future.  The internet ready capability was not a desired feature at first, but I am pleased with the available internet widgets.  I am still exploring the many capabilities that this set possesses.  I couldn't be happier with my TV choice.", "Date": "January 6, 2011"}, {"Title": "Mostly great TV", "Author": "craigc", "ReviewID": "RM35S1K9MF75I", "Overall": "4.0", "Content": "This review will be pretty short and sweet:I've had this TV for about a month now.Pros:The picture is excellent.  Darks are very dark.Setup was very easy.Remote is solid and reasonably well laid out.  The keyboard was useful for setup, although I don't expect to use it much now that things are up and running.The sound is surprisingly good.  I have a 46\" Samsung that is an otherwise excellent TV, but the speakers point downward so the sound is terrible.  I recommend getting a good home-theater-in-a-box anyway (I got the Samsung HT-C6500 from walmart.com), but at least the Vizio is usable without one.No dead pixels as far as I can tell.Cons:It's a solid TV, so I have no real complaints.  I will say I don't have much use for the apps.  Updating facebook on the TV doesn't really appeal to me.---------------------------------Update:I've now had this TV for a few months and do have one complaint.  The TV will sometimes turn itself off.  I've seen other complaints online about this and spent some time with Vizio technical support to try to figure it out.  In general, the tech support people are friendly and knowledgeable.  But I do have some advice for you if you contact them.  For any problem that's not obviously bad hardware (such as dead pixels), you'll want to do the following:1) Make sure the TV can get to the internet so it can update its firmwareIf that doesn't resolve things, then2) turn the TV off, unplug it for 30 seconds or so, plug it back in, and turn it back onAnd if that doesn't resolve the problem, then3) press the power button (on the lower left hand side of the TV) and hold it for 30 seconds.  This does a more comprehensive reset of the TV (and probably loses any sound/picture settings you've changed).These are all things the tech support people will ask you to do anyway, so you may as well try it before you call in.I had thought I only saw this behavior as I was using the remote control for another device.  The Vizio tech support person said that sometimes a remote's hex codes can confuse the TV if they're similar enough to its own codes.  But I am now sure that it happens spontaneously, with nobody touching any remote controls.  For that reason, I've lowered my review from 5 to 4 stars.", "Date": "January 5, 2011"}, {"Title": "Love it!!!", "Author": "Norman Nelson", "ReviewID": "R1SRMLUMVLJ9LN", "Overall": "5.0", "Content": "We were pleased with the price and the delivery. The set up was very easy, and the remote is the easiest to use that we have had. I don't see any draw-backs to our purchase.", "Date": "January 4, 2011"}, {"Title": "Incredible Picture -- seriously flawed hardware", "Author": "bighoffa", "ReviewID": "R3DKXOTFF4YYIO", "Overall": "1.0", "Content": "After spending months researching TVs, despite my reservations about purchasing a Vizio TV, I picked this up during one of the holiday sales.  I could not be happier.  The picture is amazing, very close to my plasma in the basement. I have the tv opposite a sliding glass door so I could not get a plasma or any other tv with a glossy screen.  The matte screen almost completely eliminates glare.The VIA apps did not work for a few days while I was waiting for the firmware upgrade to be installed.  Would be nice if there was a way to manually perform a firmware upgrade.  DLNA compatibility to view my videos over the network from my computer would be a nice addition, but not a show stopper.The only other thing is that you have to adjust the picture settings for Amazon, Vudu, Netflix and each input separately without a way to quickly copy them from one to another.  The default settings for Netflix and Amazon make the movie look like it was shot with a camcorder.  Once they are tuned, the picture looks amazing.****UPDATE 4/12/2013****There is a known issue that is discussed all over the web with the TV rebooting or freezing suddenly.  It used to happen once a month or so.  Now it happens almost daily.  The only fix is to unplug it and allow it to restart.  It has become super annoying.  It has become a family joke about how I bought a blue light special and it is showing.The picture is so good that I hate to do it, but I am going to have to buy a new TV to replace it.", "Date": "January 4, 2011"}, {"Title": "Great TV, great price ... one small glitch", "Author": "Hayagreeva", "ReviewID": "R2BC0L27YZ3MA7", "Overall": "4.0", "Content": "This TV is a great value. Picture quality is stupendous. I managed to place the order when, just for a few hours, Amazon had it on sale for $1500. The \"glitch\" which seems unique to my set is that it shuts down on it own occasionally. When I first powered it, it would freeze and shut down under 15 seconds, repeatedly. Called Vizio customer service and it took 15 minutes to convince the guy that I knew what I was talking about. Then the problem suddenly resolved itself and the set began to work normally. But still keeps freezing up once in a few days. I just have to power it off and on again. Other than that everything else would get it *****", "Date": "January 2, 2011"}, {"Title": "Better than expected", "Author": "Gerry", "ReviewID": "R1IIUXDBMZMRJZ", "Overall": "5.0", "Content": "I purchased the Visio XVT55\" tv upon researching for the BEST LED-LCD televisions. This was rated as the best 55\" over all the others. It was delivered and unpacked, then set up by the trucking company. I had a little problem with a white line on the top of the picture during some local programing, but Visio customer service was very knowledgeable and walked me through the adjustments of the picture. The customer service people were from Utah, and I could understand them, unlike other outsourced companies, which I really disliked every time it happens. The picture is the best I have seen-equal to, or better than my Plazma. I would recommend this product and also Amazon to anyone buying a television.", "Date": "December 30, 2010"}, {"Title": "Should have shipped back", "Author": "M. Duhamel", "ReviewID": "R2O64M6EINKGDJ", "Overall": "1.0", "Content": "I purchased this tv about 3 weeks ago.(Nov 2011) During the first week it started making loud popping/cracking noise when I switched from standard defintion to high defintion. It sounded as if something shorted out. It has not did this in the last week. The picture has froze 3 times in 3 weeks. Most annoying is I get white lines on the top of a lot of pictures. I have not read anything about this white noise lines. Any comments would be appreciated. Going to call Vizio today.Update 5FEB12. Should have shipped it back because I am now having the problems that everyone else is having. Picture freezes. Reboots. Remote control will not work and the only way to get the tv to work again is to uplug it and wait for it to reboot. I expect it to go out completely soon. The popping noise I heard was the capicators blowing out. I called Vizio about this when I got the TV and they denied it was a problem. Should have shipped it back.", "Date": "December 28, 2010"}, {"Title": "Great TV with bad remote !!", "Author": "Ravi \"RR\"", "ReviewID": "R1LLP6CWDX1UI1", "Overall": "5.0", "Content": "One of the best TV in the market for the given price. I don't like remote, other than that everything looks perfect and awesome picture quality and features.", "Date": "December 26, 2010"}, {"Title": "Amazing Picture for Bright Room", "Author": "Jeff Reisman", "ReviewID": "R1GWFTF8Y6W87A", "Overall": "5.0", "Content": "Amazing picture - the matte finish is perfect for bright rooms; there is almost no reflection off the screen, maybe a slight dull glow at night from bright lights directly behind the couch. Full-array local dimming LEDs give the truest blacks. Football picture mode makes the gridiron unbelievably sharp - you can see every blade of astroturf.Turn off all extra processing for TV and movies - too much smoothing turns scenes a little too \"video camera-like.\" Try it and you'll see.Wireless internet connection was easy, but you have to be on WPA security or higher. WEP doesn't work.Widgits are cool, I'd just like a few more from the VIA market.My only real gripe is the remote - the full keyboard is cool but not very easy to hold. Also, there is no infrared command to launch the setting and widgets, only bluetooth, so my inexpensive ($20)Universal Remote AVEX RC06 that works with everything and can learn functions can't pick up this one vital feature. Firmware fix?(But I can still use it for most things, just have to keep the Vizio remote handy.)", "Date": "December 20, 2010"}, {"Title": "I like this HDTV but need extra suport for blue tooth", "Author": "LS", "ReviewID": "RR4UCB2PUIDND", "Overall": "4.0", "Content": "I have set up this 55\" Vizio, 240Hz, without much problems. The screen is beautiful, bright and crisp. The hi-tech version is nice compared with the old fashioned CRT TV or LCD. The sound is OK, though not terrific. The price is very good. I have bought many sets of Sonysin the past 40 years. But Sony is not as good as it use to be. Therefore, no more Sony. Vizio is the one to buy. And I would recommand to my friends and relatives to show my support.I have one thing that is not good enough. I have a Sony bluetooth headset,DRBT100CX. It is supposed to be able to hookup to this TV set as described on its INFO. But when I try to pair up with the VIZIO bluetooth, it got rejected. But, I attached it with my iPAD easily and could turn on/off scan music titles without any problems. I am reluctant to buy a Vizio head phone XVTHB100, which is twice as much as the Sony.Anyway, the Vizio 55\" XVT553SV is very good. It worth every penny I spend.", "Date": "December 12, 2010"}, {"Title": "I love this TV", "Author": "McLovin", "ReviewID": "R3H1HRVPJCHHHP", "Overall": "5.0", "Content": "I've had this TV for about 6 weeks and I'm one very happy camper. The delivery company arrived on schedule, set up the TV and got it working for me. They were great.The picture is beautiful. I have noticed no picture defects whatsoever. Also, I've noticed no problems with off-angle viewing. I can stand at almost 90 degrees from the screen and it still looks bright and clear.I've used the following \"internet apps\" that come built-in to the TV: Pandora, Rhapsody and Netflix. They all work great and are quite convenient.I use the TV's built-in wireless to connect to my home network. The TV set connected to the network with no problem, but I do not use wireless encryption; I use MAC address filtering instead. I don't know whether there would be any difficulty if you are on an encrypted wireless network.The remote's built-in QWERTY keyboard is very convenient for entering text into the internet apps when needed.A few days after I received the set it locked up and I had to cold boot it, meaning I had to pull the plug out of the wall and then plug it back in. I have had no incidents since then and I've used the TV daily for 6 weeks.The only tiny quibble I have is that the audio output has low gain, so you need to crank up the volume on your stereo a fair amount to get adequate volume. That is a small complaint indeed compared how great this product is.Highly recommended.", "Date": "December 9, 2010"}, {"Title": "Pleasantly Pleased", "Author": "R. Hansen \"Hokie Pokie\"", "ReviewID": "RS2Z8WTHBP78D", "Overall": "4.0", "Content": "I'm very happy! The picture quality is amazing. The difference between the 120Hz and 240Hz is minimal and I would not let that be my only deciding factor. I'm using the wireless connection and can easily browse Facebook from my TV! The set-up App is excellent -- all components are working the way they're supposed to. LOVE my TV.My only complaint is that the sound is not great and when watching a movie from my Blu-Ray player, it seems that the sound keeps getting quieter and I have to keep turning it up. Easy fix by hooking it up to my surround sound system and bypassing the TV audio altogether. Very happy and I'd do it again.I replaced a 73\" DLP 1080p in my living room with this TV. I have 3 other HD TVs in my house, including 2 Samsung 1080p and 1 off-brand 720. I was wanting a Samsung for my LR, but in my price range I could get a bigger screen plus all of the additional features by going with the VIZIO. Also, the product actually had better reviews than the Samsung of the same size!With my Prime membership, shipping was free. Plus, I paid no sales tax! So, I came out spending significantly less money by ordering online thru Amazon versus going to the big box stores, even though the actual product price was comparable!!! AND the TV was delivered to my home! Can't beat that!", "Date": "December 8, 2010"}, {"Title": "Exceeded my expectations for a Vizio", "Author": "jagro", "ReviewID": "R3NGX2ZCJF4NP2", "Overall": "5.0", "Content": "I have owned this TV for only 2 weeks and the more I use it, the more I am impressed with it's technology, picture quality and overall media capabilities.  I would recommend this TV to anyone who is shopping around for a 55\" LED/LCD.  I priced simliar Samsung and Sony LED's but this TV by far blew them all away with price vs value.  For what you would spend in a 120HZ TV, you get a 240HZ internet television with wifi already built in... To sum it up, the Vizio is the best value for the money, you will NOT be dissapointed with this television!", "Date": "December 6, 2010"}, {"Title": "Best deal and quality for the price!!", "Author": "Charles R Patrick", "ReviewID": "R31YT4RTMZOHCM", "Overall": "5.0", "Content": "I did a LOT of research for a new TV and this Vizio was the best out there for under 2k. Great reviews for it across the board. Check out CNET.com for a good review. Just got the TV and it is everything as promised! The picture is amazing in HD and Blu-Ray!!! Netflix worked great in the apps--excellent picture quality. My verdict will have to wait on the other apps though. I have an IPhone and an Ipad, so the apps are mostly redundant. You won't be checking Facebook or Twitter while you watch with your family.", "Date": "November 16, 2010"}, {"Title": "Amazing TV", "Author": "Brett A. Haberle", "ReviewID": "R1VRE961RDOLM9", "Overall": "5.0", "Content": "I just recently graduated college and I bought this TV and secretly mounted it up as a thank you to my father for raising me.  (aww)This TV looks beautiful.  Vizio has been gaining a reputation for being high quality and affordable.  This TV worked perfectly.Visually, this TV is absolutely stunning.  It has dynamic back-lighting with very little blooming. The darks and the lights are displayed perfectly.  The picture is sharp, and vibrant.  The remote has a slideout keyboard which could be a little more responsive, but it still worked well.  Because the remote uses bluetooth, you will not need to have a direct line-of-sight vision with the TV.  The Internet Applications are easy to use and are intuitive.  All updates are automatic, as long as the TV is receiving internet it will download and install them while the TV is in standby.This TV is a lot less than alternatives such as Samsung.  You will find other TVs that weigh less and are skinnier, but those TVs use Edge Lighting. Edge Lighting does not provide sufficient lighting for the TV and can hurt the quality of the picture.The speakers that the TV comes with perform quite well actually. For a moment we thought we had surround sound turned on.Don't worry that this TV is a Vizio.  Is is one of the greatest TVs made in 2010. We just watched the Superbowl on it yesterday, and it was great.", "Date": "February 7, 2011"}, {"Title": "Amazing  -- Here's What's Wrong", "Author": "biggestbamboo", "ReviewID": "RT6K46HI92C1B", "Overall": "5.0", "Content": "So close to perfect, that I am just going to tell you what I don't like.  The remote won't operate my audio receiver other than volume.  The frame is high gloss and reflects light; it should be flat or matte.  The USB ports aren't activated yet (a firmware upgrade is promised that will play/show files on portable drives, etc.).  The stand should be sturdier, I don't trust it; use the provided wall cable in an unprotected location.", "Date": "December 11, 2010"}, {"Title": "Stay away from Vizio - Terrible TV and terrible service", "Author": "Cindy Backstein", "ReviewID": "R2Q3358O2AUJRG", "Overall": "1.0", "Content": "We got this TV for a great price the day after Thanksgiving but have had nothing but problems ever since.  I am now on my second TV and it didn't even last 10 minutes.From day one on the original TV the picture would freeze up within a few seconds after turning on the TV.  During that time you could not do anything with the TV.  After 1 1/2 minutes the TV would shut itself off for about 1 1/2 minutes then turn itself back on and things would be fine until the next time you turn the TV on and the whole freeze up thing would happen again.  After many calls to Vizio (at least 1 hour each call) Vizio finally acknowledged they couldn't figure out why this was happening and they would send someone out to repair it.So we just lived with it this way until the repair person could come.  They came out 3 weeks ago and put in a new motherboard.  I set the TV and the DVD recorder and VCR up (for like the 10th time now) and was happy to have a working TV.  But 4 hours later when I went to shut the TV off, it would not shut off and stay off.  Within seconds of turning it off it would turn itself back on.  More hours on the phone with Vizio.So Vizio agreed this one must be lemon and they would replace it BUT IT TAKES 3 WEEKS FOR THE REPLACEMENT TO BE DELIVERED!So for 3 weeks we unplugged our TV every time just to shut it off.The new replacement came today and within seconds of getting things hooked up and trying to set it up the video picture would blink on and off.  By the time it made it through setup and I actually got a TV show on the screen, the picture went black for the last time and never came back on.Another hour or longer on the phone with Vizio and they can't figure out what to do so they will send a repair person out...NEXT FRIDAY... A WHOLE WEEK AWAY!  So now I sit here with NO television for a week and Vizio could care less.I'd take it back and get my money back but the Christmas sales are all over with and this puppy is hung on my wall.  What a pain to try and find an equivalent feature TV for an after Thanksgiving price to put in its place.STAY AWAY FROM VIZIO IF YOU EXPECT GOOD QUALITY AND GOOD CUSTOMER SERVICE.", "Date": "January 28, 2011"}, {"Title": "DONT buy from DELL !!!", "Author": "John Zairo \"flht3\"", "ReviewID": "RZ8HX1GMPU3G6", "Overall": "5.0", "Content": "just wanted to save others from making the same mistake i made..dell will keep moving up delivery dates..if they told you it would take a month to receive your tv, you wouldnt order from them..i found THOUSANDS of people this has happened too...  as for the tv...amazing..i watched it at a friends house for a couple of hours..they dont have wifi yet, so i cant comment on that function,but the picture is outstanding..i couldnt see any blooming,didnt notice any motion artifacts..one thing i did notice was...i keep saying \"this thing is awesome\"  i will update when my tv arrives in a coupe of days from AMAZON..update..got tv..its up and running..very simple to set up..the initial tv \"set up\" is very good, then i used cnet setting and its even better..i originally thought the picture was great, then put on my glasses and was WOWED all over again!honestly i cant find fault in anything..the aps are fast..picture is awesome..and the packaging is top notch..its a rare thing to find a product that is competitivelypriced and isnt compromised ..A+ to vizio!!just wanted to comment on this tv after a couple of days of use and some nfl football....generally the \"wow\" factor wears off in a couple of days...not so with this bad boy!!the only downside of this tv is, i watch too much tv now..i have dish network that has a ton of HD channels..this isnt my first hdtv i have a 50\"samsung plasma in my rec room and this tv blows it away!!!!! interesting side note: i wear glasses and on the \"vivid\"mode w/a couple tweeks i dont need my glasses..however the cnet setting are more accurate and the best set up for people that are not visually challengedstill going.. and after a couple of months still extremely happy! one thing i want to say..this tv has exceptional picture BUT it doesnt produce that \"carton effect\" as some others due..personally that effect catches your eye at the mall but gets old for everyday viewing..just my .02", "Date": "September 9, 2010"}, {"Title": "vizio 55\" lcd", "Author": "roy", "ReviewID": "R8PJZ4LRSIU21", "Overall": "1.0", "Content": "I bought vizio 55\" lcd tv from amazon.com in nov 2010 it was working great for 6months after that the tv started turning off itself and then you have to turn on after a minute so I called vizio about this issue and they told me that my tv's programming needs to updated and I should unplug my hdmi cable which is connected from cable box to tv for 24 hours so the tv can be updated so I did, a week later the problem still there and the strange thing is I notified vizio before my 1 year warranty expired and vizio and vizio told me they will honor the warranty if this problem happens again now they are saying it is out of warranty.Please do your homework before buying vizio tv because I will not and my family and friends will never buy any vizio products.", "Date": "December 7, 2011"}, {"Title": "MOST EXCELLENT", "Author": "RC", "ReviewID": "R2ZQGQJW0BXSL5", "Overall": "5.0", "Content": "I wanted a good Internet TV and didn't want to spend too much, have used a Panasonic plasma for 5 years, used a PC since 1989 and know what is good. This Vizio is beyond good and they should charge more. Wire it directly to your new Vizio wireless Router and the TV will suck in any Internet app like a dry sponge in the desert. Play a DVD in any old player you got and the TV will turn it into a theater experience with great picture and sound. Use BluRay and you are in the movie. It does what it should when it should and does its thing flawlessly. It is a computer first so it is the boss when it comes to doing things the exact way it wants to. Go with the flow, buy it and enjoy. You will feel like you stole it. (Don't tell Amazon or Vizio but this is a 2500 dollar TV)", "Date": "October 27, 2010"}, {"Title": "great picture when it works", "Author": "helicopter mech", "ReviewID": "R38NX0FP0O42U6", "Overall": "1.0", "Content": "I have had this TV repaired twice. It has issues again.I will not buy another vizio. The picture is nice but Iam very disappointed in the quality.", "Date": "July 29, 2012"}, {"Title": "Excellent picture quality", "Author": "Brian Banville \"Bird\"", "ReviewID": "R2OP158YMP4B9G", "Overall": "5.0", "Content": "The picture quality of this TV is excellent and setup is easy as well. I don't see the need to spend more on a LED LCD.", "Date": "April 14, 2011"}, {"Title": "Third time's the charm", "Author": "ellenk", "ReviewID": "R2LLINJSX5N122", "Overall": "4.0", "Content": "The first TV was fabulous for four hours; then the picture went black although the audio was fine. Vizio advised it was not repairable. Requested a replacement and without problem the swap was made. TV number two was also wonderful except for a dime sized dark spot which Vizio said was a burned out pixel - non-repairable. Decided to give it one more try and a third unit was delivered. After a week, it is on the wall and fine. Picture is wonderful and non-glare screen is incomparable (it is adjacent to sliding glass doors in Florida). Audio is surprisingly good but will be adding the Bose HE system.Customer service at Amazon was great; Vizio tech help also very responsive.", "Date": "February 17, 2011"}, {"Title": "Great TV", "Author": "Richard Nash", "ReviewID": "R1PCOGZY0RB1CI", "Overall": "5.0", "Content": "We've had the TV ~1 month. Picture quality is great. Works well in a room with indirect sunlight.No issues w/ the TV.We have a projector setup in the same room. I find we are not using it since the TV quality is so good. TV screen is not as big as the projector screen but the picture quality is sooooo much better than the projector screen.Easy to setup. Had is working in less than 30 minutes.Enjoy it!!", "Date": "December 17, 2010"}, {"Title": "Great buy", "Author": "dog", "ReviewID": "R3A9UAULR487UY", "Overall": "5.0", "Content": "Have a bright room and wanted a mat screen to cut down on glare.  TV does the trick... much better then the traditional screen it replaced.  Very happy with purchase and would recommend to others", "Date": "December 9, 2010"}, {"Title": "Excellent LED tv...Samsung better watch out", "Author": "N. Joseph", "ReviewID": "R22WLDC4U10G11", "Overall": "5.0", "Content": "I purchased it from walmart because of quicker shipping compared to other places.  First off this remote is the best ever!  with it's slide out keyboard.  Makes navigating the net super easy.  3 inches in depth not too bad.  Picture is great.  If you turn off the Ambient sensor the picture is super bright and clear, but it might hurt your eyes after some time.  I use my Sony PS3 as a blu-ray player, but yet to try it on this TV.  I've played a few games on the Vizio and the picture is perfect.No complaints...great TV.  Vizio has definitely stepped their game upI've only had the TV for 8 days so I'll update with more details as things come upUPDATE: 11/4/11I've had this TV for over a year now and it's still deserves it's full 5 stars.  I have local HD and live near downtown Chicago and the picture is unbelievable clearly.  I use the Vivid picture setting pretty much all the time.  Blu-rays on my PS3 are crystal clear.  No technical issues with the TV so far.  This is exactly why I never buy an extended warranty.  The only minor flaw I see with the TV is when there is a completely dark or black background and you have white font moving or small white objects on the screen there is a halo affect.  Colors are very strong and vibrant.Love the wifi netflix app.", "Date": "September 22, 2010"}, {"Title": "Vizio 55\"", "Author": "Steve Katz", "ReviewID": "RDVANW6T7KENQ", "Overall": "2.0", "Content": "While the TV is great with great picture quality, the remote stopped working. Visio in not a great customer service company. I was lucky to find a generic Visio remote online for $8 as compared to the $40+ replacement remote that has a keyboard built into it. I do not use it for Netflix or anything. But I did need a remote to switch inputs and set the sleep timer. So Samsung. Prices are dropping.", "Date": "February 17, 2014"}, {"Title": "Vizio 55\" is the best TV", "Author": "L Lynn LaClair", "ReviewID": "R1OCQAD6O7ZUO0", "Overall": "5.0", "Content": "I've waited to see if I had any of the issues that other commenters had, like blurring lines around edge of TV, and bad reflection. Well, I'm glad to say that I don't have any of those problems. It has super resolution, and it isn't totally glossy - has a subtle matt finish, so all I get from a light nearby is a rainbow reflection when the TV is off. I turn my lights out when I watch TV, so I have no problem with any interference. Haven't used the 3-D glasses (you get 8 pair) as I don't have the 3-D blue ray yet, but one of these days...I'm a Vizio lover and this is our 4th Vizio set - we even have a 42\" up at our camp in the middle of nowhere and we get HD without a box, just an antennae.", "Date": "February 13, 2014"}, {"Title": "Vizio TV", "Author": "Lynette", "ReviewID": "R9N4Y6X0AZIAF", "Overall": "5.0", "Content": "I love this TV.  It is clear, sharp, and the colors are magical.  I've had this for about 3 years now and have never had a problem with it at all.  Some day, my next Vizio will be a lot larger!", "Date": "December 18, 2013"}, {"Title": "2 years and still going strong", "Author": "Philantrop", "ReviewID": "R1KRGAJQJ7ULDC", "Overall": "4.0", "Content": "The VIZIO XVT553SV 55-Inch Class is a good monitor, had it for about 2 years and its working fine. I am running a 1080p cable box, XBox, and a HTPC. Color look great, default sound was ok but I am running external speakers since no one serious about audio uses the built in speakers. Tons of options to screw around with, I found the settings I like with minimum tinkering. Wifi was super easy to config and works great. Only one problem but its an annoying one, once in a great while the Vizio TV will \"reboot\" itself - shuts off for a minute, then comes flashes the logo page, then goes back to normal. This only happened a few times but two of them were in the middle of some serious online shooter gaming!!!", "Date": "April 30, 2013"}, {"Title": "Best choice", "Author": "C. Troutman", "ReviewID": "R1DCIGDPGYEVMJ", "Overall": "5.0", "Content": "Very well-reviewed by Consumer Reports, this TV is great.  Internet-connected it gives you access to Amazon, Hulu, Flickr, YouTube, and Netflix among others, in addition to whatever cable/satellite program you have.  Maybe the only downside is the couple seconds it takes for the TV to start once you press the power button.  It's definitely worth your money to get 55 inches... every other TV looks small in comparison.  You will have to arrange custom shipping to get this TV home.", "Date": "January 7, 2013"}, {"Title": "Excellent TV for the price.", "Author": "Gary Smith", "ReviewID": "R2OUURJ6A3YHZS", "Overall": "5.0", "Content": "This is a quality television for the price.  It is easy to operate, right out of the box. I have had the unit for several months now.......no problems.", "Date": "January 7, 2013"}, {"Title": "A Few Flaws But Incredible Picture and Features", "Author": "Thomas E. Hudson \"THudPHud\"", "ReviewID": "R1X5VTZ02ANSCE", "Overall": "4.0", "Content": "We have had this TV for 19 months as I write this review. During that time we had to have it serviced once to replace the main computer board. It was under original warranty and took only two days for the tech to come. It had not had the same problem since (would just turn off after three hours or so and you had to unplug it for a half hour to get it to come back.)The only little ongoing issue we have is that about once every three months the screen goes black for 20 seconds and then it comes back on as if it had turned itself off. Since we have a DVR we just back up and watch what we missed, so for us it is no big deal. We believe we have traced this ongoing issue to a power fluctuation. It seems to happen a few days after we have a house-wide power dip and those happen about 4 or 5 times a year around here.We haven't and won't use all of the bells and whistles and applications of the set, but having immediate access to Netflix and Amazon Prime video on demand is awesome. Of course, during high usage times of day we sometimes experience video delays but I can't put that to the set, it is a network issue. Speaking of which, prepare to spend 15-20 minutes doing the initial setup and registration with your network. This is not a ply out of the box set. But, once done, it is done!As for the picture, even in 480i mode, the colors are brilliant and the picture is sharp. 720p is phenomenal. You can spot individual blades of grass on a football field. You can see the hairs on Kathy Lee Gifford's chin on the Today show. You can see how badly news anchors put on makeup by troweling or spray-[painting it on themselves.But, most of all, even in daytime and in a moderately bright room, you see an amazing picture. And, from a very wide angle without distortion.Bottom line is that we bought the extended three-year warranty just in case and I would definitely suggest you do the same. This is really a complicated computer with a flat screen monitor, and with only four replacement parts, all expensive out of warranty, you don't want to be left holding the bag if there is a problem after the 1-year warranty!", "Date": "January 3, 2013"}, {"Title": "Great Picture", "Author": "Yumalee", "ReviewID": "R3MC4F05JXN55T", "Overall": "4.0", "Content": "I like the picture and all other features.  But, I'm glad I got an extended warranty.  The picture just quit a few months ago.  Warranty fixed and saved me about $500 in repair bill.  It's doing it again and I have a repair request in, again.An update on the TV includes the return of loss of picture for the THIRD time.  Same repair tried for the third time, too, but it didn't work this time.  Cost of TV was refunded by warranty company.  I switched brands.  Aside from the issue mentioned here, I loved the Vizio but chose to avoid possible repeat problem with another one.Amazon sells SquareTrade.  Get it!", "Date": "December 15, 2012"}, {"Title": "Beauty is the Beast!", "Author": "lord p", "ReviewID": "RC2DZZWY5VDQN", "Overall": "5.0", "Content": "What an unbelievable machine, beautiful cant describe this hdtv. I had it for two months, purchased for 500 bucks, brought a squaretrade warranty for 130. Refuse to hook it up to The internet because vizio does automatic updates and might attempt to fry my set, brought. Roku box for internet nd im safe. Get one on ebay and be thrilled by greatness... blooming sucks but position set right nd your cool, no sweat for me.", "Date": "December 14, 2012"}, {"Title": "Love it", "Author": "Tallinxxx", "ReviewID": "R2UYZJ3KT9DEJG", "Overall": "5.0", "Content": "Bought this as our Christmas Gift last year and have loved it ever since. The picture is great.  We have a long rectangular living room that attaches to the dining room and my wife loves watching GMA in the morning from the dining room table.  The guys love hanging out around the dining and kitchen area but can still watch the games clearly. I didn't care much for the remote as it didn't seem to want to sync with my sony sound system or any of my other components...we just use the sound systems remote as it did sync with he TV.T. Arkansas", "Date": "October 11, 2012"}, {"Title": "This TV is great!!", "Author": "ToughCustomer", "ReviewID": "R2N0JYHMIQDPLJ", "Overall": "5.0", "Content": "I have had this TV for over a year and have been amazed with the picture quality, sound, and durability given this unit is on probably 18 or more hours a day.  The sound in particular is amazing - sometimes we have to mute the sound to see if it coming from the TV or real life!!  I don't even consider getting surround sound because I live in an apartment building and it probably wouldn't make any difference anyway.  This unit was state of the art when I bought it and I would buy it again...", "Date": "July 29, 2012"}, {"Title": "Excellent TV..Excellent Value", "Author": "Jennifer Swain", "ReviewID": "RS5VVNLPBCNS7", "Overall": "4.0", "Content": "TV has been absolutely great.  Its in our living room and serves as the family's main viewing medium.  We have a projector media room which this TV doesn't compare to for watching movies, but for the value, the living area and the need it has exceeded my expectations.  The wireless connection and the available applications have to proven to be nice accessories to the TV.What I would like more of is worth while applications.  Pandora, yahoo Fantasy Football and Neflix are great, but there are far more that can be done.", "Date": "June 18, 2012"}, {"Title": "Very Poor Build Quality", "Author": "Rajkumar Ragupathi", "ReviewID": "R27PN6GUS6Y4BR", "Overall": "2.0", "Content": "I had purchased this TV about 1 1/2 years ago and the TV is not powering ON and i got of their tech support - that i need replacement. It is a shame that Vizio has such a poor build quality. I had a sony before that for 7 years and had no issue and hence i forgot to buy Vizio's extended warranty. so if anyone is interested in buying this TV, please consider buying extended warranty - my 2 cents", "Date": "June 5, 2012"}, {"Title": "Vizio firmware messed mine up!", "Author": "Jesse W. Skeen", "ReviewID": "R3HLD0V4PGAAM3", "Overall": "2.0", "Content": "I was mostly pleased with this TV until this January when the new firmware update went out. The way these TVs work is Vizio periodically sends out firmware updates, and the TV automatically installs them when this happens. There is no way to manually change the firmware back to a previous version should something happen to go wrong. Since the latest update, my TV has been occasionally displaying a jittery frame rate during filmed material. It looks sort of like the slow-motion effect that is intentionally used sometimes, but this is being done by the TV's video processing. It happens on all inputs and on over the air stations. If you pause a disc when it is doing this and then start it again, the problem usually goes away, which proves that this is not related to the material itself. Another problem that came up was that when playing PAL material (I have an all-region DVD player and a multi-standard VHS machine) the TV now automatically applies the \"smooth-motion feature\", which essentially makes filmed material look like video. (One reason I chose a Vizio was its ability to display PAL, as not all US TVs can.) Although one Vizio representative has said this would not be caused by a firmware update, I remain suspicious since these problems were NOT there before the update.Vizio's tech support was extremely unhelpful with this. Most of their people are courteous, but they simply don't have enough knowledge about their products or how they work. One even suggested that this was being caused by my having so many components hooked up to it! Luckily I bought the extended warranty, but the service people they sent over weren't very bright. I had the main control board replaced TWICE, neither time did it fix the frame rate problem. The first guy insisted that it wasn't a problem with the TV (then why did he bother to replace the board in the first place?) and the second just said \"Uh, I don't know if that can be fixed\", said his company would call me back later with what to do next, then never called back. After this there were several days of \"negotiating\" between Vizio and the warranty company before they agreed to do anything else for me- I was finally given the choice of a \"recertified\" Vizio with 3D or a check for a few hundred dollars less than what I paid for the TV. Although the replacement TV would have been nice, I opted for the check because I had heard the 3D model still has this problem, and Vizio's support had been so awful I was tired of dealing with them at this point.It's possible a future firmware update could be sent out that corrects this problem, but it's gone on for 3 months so far and Vizio's \"support\" people obviously don't communicate with the people who actually design and program these TVs. If they had just told me \"We're aware of the problem and will issue a fix as soon as possible\" that would have been fine, but instead they denied there even was a problem and attempted fixes that did nothing and caused my TV to be taken apart unnecessarily.The funniest thing about all this is that I got this TV early through a \"VIP Program\" Vizio was doing, where they had supposedly selected a few people to get this TV early and give them feedback on it. I gave them plenty of feedback, but I don't know if it was ever listened to. At any rate, I would have expected a better line of communication with Vizio than what I got when this problem came up.I am searching for another brand right now. The thing I will miss most about the Vizio is its easily adjustable overscan settings, which allow you to zoom, stretch or crop the picture any way you see fit. I have one setting with absolute zero overscan, another which zooms in slightly to hide the black borders around the screen when my computer is being used, and another to zoom in on older 4x3 letterboxed movie transfers which display as a box in the middle of the screen on 16x9 TVs. I can also correct the picture if a DVD or online video is improperly stretched or squeezed.This was one of the first TVs to have internet apps, at first they were rather glitchy but most work quite well now. Vudu is the best, having close to DVD picture quality with Dolby 5.1 sound- although I was quite angered when Wal-Mart bought Vudu shortly after I got the TV and removed all the adult movies and other stuff that didn't conform with their \"values\". Netflix quality isn't the best, but it's a great value (much more so than cable) and has many older films that haven't been issued on disc before. Tune-In Radio is also great, you can listen to almost every online radio station on the planet. This includes Amazon VOD as well, but sadly my internet service isn't fast enough for it to work in \"HD\" mode. It only delivers 2-channel sound in the lower-quality modes. I'll have to see how it works with whatever TV I get to replace this one.", "Date": "April 15, 2012"}, {"Title": "Like so many others....  backlight went out.....", "Author": "McDade TX", "ReviewID": "R3C809RMZC10WR", "Overall": "2.0", "Content": "Purchased this TV from Amazon on 5-2-11, along with the 4-yr Square Trade warranty.  I did complete the warranty registration with Vizio on 5-10-11.  From the start, I had periodic mystery shutdowns (every couple of weeks) and sound cutoff for a few seconds (every couple of hours).  I made the assumption it was due to the Onkyo HT-S53300.  Then, on 4-4-12, like many others, the backlight problem hit.  On Saturday 4-7, spent time with their Tech Support who agreed this was a warranty item and then emailed my Amazon receipt to them.  After reading other reviews about getting warranty service, I took all the pictures to have ready to send.  On 4-14 I called back to followup on the case number, and to my surprise, they said they had what they needed and scheduled it for repair (didn't have to send in pictures).  I was expecting the worst, and got the best - - don't know if calling on a Saturday or completing the warranty registration at time of purchase made the difference, but I'm not complaining about their response THUS far.As far as the TV's performance, generally I was satisfied and willing to tolerate the minor glitches.  Picture was great, and enjoyed Amazon VOD under my prime membership.  Some of the Vizio apps crashed when I tried them, but I just deleted them as options because I was only using Amazons.Based on all the reviews citing quality problems, I have a feeling that as soon as my extended Square Trade warranty run outs, I'll have to replace it.  So, in the end, due to the price I paid, I am not please with my selection.  I expected to be using this TV for another 10 years.......", "Date": "April 15, 2012"}, {"Title": "Got a Good One", "Author": "Tom Gritton", "ReviewID": "R30XSP1B900HBC", "Overall": "5.0", "Content": "I was nervous about ordering this LARGE product (that seemed like half the reviews were 1 star and half were 5 stars) online, and even more nervous when I realized it would be delivered by a furniture company.  I told my wife I figured we had a 50/50 chance on getting a good unit, and would just have to deal with it if we didn't...Well, its been 6 months now and (still knocking on wood) I feel like we got a very nice large screen TV for a really good price.Love the built in wireless, sound and picture are good.  I HAVE freaked it out a few times where it rebooted without me intending to do anything but turn it on, but so far, no hard done....I'm pleased to see Visio TVs in many public spaces.Assuming they stay comparably low priced, I'll definately be looking at Visio first for our next purchase.To be fair to those that have written negative reviews, it looked like most of them were more on customer service than so much on the unit itself, and I haven't had to contact them for anything.", "Date": "April 8, 2012"}, {"Title": "IT'S COMPLETELY USER-FRIENDLY!", "Author": "OLD-ISH & TECH-CHALLENGED", "ReviewID": "R3IEF9EW42KY14", "Overall": "5.0", "Content": "Owner/user is over 60 y/o. The Vizio XVT553SV-55\" upgrades from a 32\" HD-Panasonic(6 y/o regular-dumb teevee?...I'd thought was superb) Just mentioning so you'll know relative pov.Can't discuss or improve on other reviews whose topics are the jazzy thingsthis television does, just wanted to state......I waited years to purchasea 'smart/internet-tv' because I don't enjoy having to become a 'technician' to use tech.Am a 'remote user' 30 miles at sea, so potential 'product returns' are a concern andI was not at all familiar with the 'Vizio' company or the reliability of their products.Have enjoyed this tv for a month now, re-phrase - have been thrilled BEYOND EXPECTATION sincethe delivery men carefully installed and setup the tv, showed me the 'important' buttonson the remote [including where to change 'inputs' etc.] and linked my TiVo & speakers to alsowork with it.This tv is 'intuitive' to the point it makes you feel proud having purchased it, fearlessusing it. I don't know and don't wish to learn all the fleeting current techno-flap, justwanted a product to reflect the value of my money, save me from the usual - connections/switchesdownloads/error messages/'can't do this from here' type insanity......so, if you relate towhat's important to me......BUY THE TV. It's 'smart' so you don't have to be!Still not convinced?  I use four pairs of glasses as clear/crisp vision is a priority with me.I haven't touched a setting, needed to 'tweak' anything, and if you like watching the labelof a golf ball turn as it approaches the cup - BUY THE TV.  I'm reporting on my experiencewith the tee-vee 'right outta the box.' And 'the boxes, wrapping/padding'....all thepacking, etc. - the delivery men offered to and took all the rubbish with them.All I 'had-to-do' was sit on the couch and press the 'power-on' button. Hope you get the messageI'm thrilled with my purchase. This is the only product review I've ever offered - the tv mademe to it :>)  Did you ask about price? I'd 'googled' for lowest price, then thinking I wantedto learn about the product manufacturer - Vizio (a new name to me), I visited their websiteand ordered the tv there since their price was $169 'less than' lowest 'googled' price..same tv.No, $169 wouldn't make-or-break a decision of mine, just call it 'another nice surprise' in favorof the money-paying customer. Lastly, believe it may be important to note - I'm used to having topay significant premiums in order to be impressed with a product - not so with Vizio. I firmlybelieve I could easily have expended significantly more money - and not been as favorably impressedas I have been in this first month of ownership. I encourage you to strongly consider this tv ifyou'd like the 'benefits of technology'...without its oft-related difficulties.", "Date": "April 7, 2012"}, {"Title": "great tv", "Author": "jonsr", "ReviewID": "R2HQKWY9AP8OQP", "Overall": "4.0", "Content": "i took a chance this tv never having seen it before(although i had and still do a vizio 42 incher which i was alwasy happy with, i decided i wante a biggerst et hence i got this on on here from amazon , the reviews here were mostly favorable so i took a chance even after reading some horrible reviewsive now had the set for 3 months and really couldnt be much happier, setup was easy, even connecting to my wireless router inch went directsfter realizing the tv was close enough to go direct i always choose direct over wireless given the choice but initially i went wirelessand it set up and worked fine, i just prefer wired over wireless because in my experience wired is more reliable and faster so when streaming content wired is going to be better. other pros 4 hdmi ports including one on the side which made it easy to hook up my netgear push 2tv box. this allows me to look at and hear content from my laptopon the tvwhich i must say looks and sounds much better,my only complaint is, once in a while it reset itself and viaio logo will flas then after a few minutes it cime back on, i hope this dosent become a problem more often. i will add zizio uses american at their call centers which im glad becausther is never a language issue and their cs staff are curteous and will stay on the phone as long as necessary.'''", "Date": "March 26, 2012"}, {"Title": "My sentiments exactly...", "Author": "DuBear61", "ReviewID": "R33RTW4KWVX3UO", "Overall": "5.0", "Content": "I am going to keep my writeup relatively short because it would mirror almost exactly what others have said (especially the excellent and comprehensive review by Dana R. Hornsby). So, take this as a bonafide 5-star endorsement and read on only if your curious.Long story short...This TV has outstanding performance.  Great HD TV, excellent for gaming with customizable settings including volume between modes(I also play XBOX on it), and convenient apps.  The side-viewing and anti-glare are fabulous and make an already pleasant viewing experience that much better.  I also echo positive review of ease of setup. I have never had any problems with 3rd party apps, but then again I haven't installed any either.  The installed apps; facebook, netflix, etc work great.  HULU Plus is our favorite!!!One thing bad to say, mostly because I didn't initially understand, thus it aggravated me at 1st, was the going to standby for firmware updates.  The 1st month or so, we received a number of updates.  These would occur mostly late at night (when I am gaming).  I think VIZIO should program the updates when the TV is not on, not when you're using?! Recently, I haven't had any updates during \"my\" primetime.Lastly, we bought this on Amazon.  The price was incredible based on my month long comparison shopping, the delivery was reasonable, and fast.  The best part, I have to mention is the two wonderful gentleman that expeditiously and courteously unpacked and set up my TV.  They were icing on the cake.", "Date": "March 23, 2012"}, {"Title": "It doesn't work", "Author": "chewaw9154", "ReviewID": "R400EFI8JPAD", "Overall": "1.0", "Content": "Product arrived on time, does not function.  Contact with Vizio Technical Support has been completely unsatisfactory.  Vizio requires the customer to take photos of the product and e-mail them before they'll consider providing any warranty support.  We had to take and e-mail photos of the product, the serial number on the product, and our receipt to authenticate that we purchased it from an authorized dealer.  It will take several days before we get any response as to whether a replacement will be sent or warranty will be honored.  Vizio sold us a product, the product failed, then Vizio demanded we authenticate ourselves as if we were trying to scam them. Who is scamming who? We now own a 75-pound, $1,500 door stop.  Do not buy this or any other large-ticket, electronic product on-line anywhere.  If there are any problems, you are SOL.", "Date": "March 17, 2012"}, {"Title": "Great TV", "Author": "Leo", "ReviewID": "R2B69UJJL5M814", "Overall": "4.0", "Content": "I researched 50\"+ HD TVs on Consumer Reports, and this earned their top rating.  It was delivered a couple weeks later, which saved the hassle of finding or renting a vehicle big enough to bring it home.  The picture is amazing, the 5.1 sound through Optical is great, Pandora App is graphically appealing but does not let you browse by Genre, and the Blockbuster app won't connect at all, but NetFlix and Amazon apps work great for movies.  The remote with QWERTY keyboard sounded like an import feature, but the TV does not have Google, so you don't need a keyboard too often.", "Date": "March 16, 2012"}, {"Title": "Great TV", "Author": "John", "ReviewID": "R22MAH6D8NJBZX", "Overall": "5.0", "Content": "THis is a great tv. I was a little worried about spending a lot of money on it at first but I am happy I did. The picture is amazing and the apps are a great thing to have. I have mine hooked up wi-fi and everything has worked great since I have gotten it. I have had it for about 2 months now. YOu wont be disappointed.", "Date": "February 25, 2012"}, {"Title": "Brilliant picture. Almost looks like 3D !", "Author": "Dapple", "ReviewID": "RC6H0WFGHNL6Z", "Overall": "5.0", "Content": "Very pleased with color and clarity.Definitely meets Consumer Reports top rating.Sharp and crystal clear picture.Easy on screen set up!", "Date": "February 18, 2012"}, {"Title": "Problem TV and Support", "Author": "Tor", "ReviewID": "RDONZHYKFBPS5", "Overall": "2.0", "Content": "Soon after purchasing this TV, it began freezing when it started up. After a long self-reboot sequence, the TV would work fine. After several bouts with tech support (whom were very nice whether online or on the phone), the problem was not cured. They determined it needed warranty repair, then decided not to honor the warranty because the unit wasn't purchased from an \"authorized reseller.\" I purchased the unit new, not refurbed. During the time I was battling with that issue, the TV developed the habit of rebuffering while watching Netflix streaming, then freezing and rebooting itself instead of finishing the buffering. I bought this TV because of its good review in Consumer Reports. Though the picture looks great, I cannot recommend this model or brand. I see that others have had the same issues with the XVT553sv. Seems to be a gamble. As soon as I can dump this unit, I wil purchase a more reputable brand than Vizio.", "Date": "January 26, 2012"}, {"Title": "Excellent.  As Expected", "Author": "ZackinBama", "ReviewID": "R1KU4YJEWW7H4X", "Overall": "4.0", "Content": "I researched These TV's for way too long before deciding on the XVT553SV.  I love it.  Amazon Free Shipping was awesome, delivered on time with no issues.  Very simple to set up and the picture is AMAZING.  Sports are incredible on it, and the sound isn't all that bad, although we have it hooked to our surround system.  Stop Looking and buy it, you won't regret it.", "Date": "January 26, 2012"}, {"Title": "Works just fine", "Author": "Tom \"Tom\"", "ReviewID": "R2HIRCRJHMRJAW", "Overall": "5.0", "Content": "Had ours for 7 months now without a problem.  Like other users have mentioned, the matte screen looks great and does not pick up excessive reflections from the overhead lighting in adjacent rooms, or sunlight from windows.  There has been times when the TV rebooted, but usually we are rewarded with a new app, or feature, that was pushed out OTA.  We wired ours in, but have found the wireless connectivity so good that we leave our receiver and cable box off, enjoying programming from NetFlix, YouTube and internet commercial free.  The remote with a keyboard is sure a nice feature for controlling the applications.  It has great range and has survived out two year old child's best efforts at deconstructing it, or beating it in two.The picture is very good.  Astonishing at times.  Overall, I think the plasma TV's still have the best LED's beat, but for us the power (and heat) savings pushed us in favor of the LED.  This uses about 25% of the power of the TV it replaced.  (Looking forward to AMOLED someday  :))We are very happy with this purchase.  Amazon's deliverer was slow and would not let us pick up the TV from their facility.  We gave up on Amazon after the TV sat 15 miles from our house for two weeks awaiting a truck to come our direction.  But other deliveries from Amazon have been fine.", "Date": "January 23, 2012"}, {"Title": "It was great for 7 months.", "Author": "ggguy77", "ReviewID": "R1CK76E6H6LRLD", "Overall": "1.0", "Content": "This TV was awesome for 7 months. However, an hour before I had company coming over for dinner and football, I got the black screen and the flashing VIZIO logo of death. Hard to trust VIZIO from now on with their track record that is visible in the reviews. I am sick to my stomach that I spent $1500 on this. I hope AMAZON or VIZIO make it right.", "Date": "January 14, 2012"}, {"Title": "Love it!", "Author": "Frank Docter \"Grampa\"", "ReviewID": "R23Q6NCYOUO1Q2", "Overall": "5.0", "Content": "We researched this TV before we bought it, Consumer Affairs was right .... it is the best for picture avoiding light glare, the colors are vibrant & on some shows they feel like 3D. Couldn't be more happy.", "Date": "December 13, 2011"}, {"Title": "Great TV", "Author": "Kevin P. Conley", "ReviewID": "R1C72U4W6LSWYL", "Overall": "5.0", "Content": "I'm not a tech geek so this wont be an extensive review. Actually I've only ever written one other review. However, I am writing this one because I am so happy with this tv. The picture is truly remarkable. I could stop here because to me it's all about the picture. I probably dont use half the functions on this tv but I know a good picture and this is the best I've ever seen. You can google picture settings for this model and get expert settings. I used them and it worked great. Or you can pay Best Buy's Geek Squad $300 to do the same thing.Setup was very easy and I liked the option to give a custom name to your different devices. The slide out keyboard is cool. I dont use it but my 13 year old loves it. Earlier I said it's all about the picture but it is also all about the value. I shopped very hard for this tv and even knowing that Black Friday was coming in about two months I couldnt wait because I knew this was the tv I wanted. I paid $1399 on Amazon and I just cant believe you can buy a tv with a picture like this for under $3000. I do notice that the current price on Amazon is $2399 and it seems to swing wildly.Finally, I get a tremendous amount of sunlight that beats directly down on my tv thru high trapezoid windows in a vaulted ceiling. It made watching tv on my 50\" Sony LCD unbearable. On this Vizio it's hardly noticeable- it's amazing. Dont pay $2400 for it, but do buy this tv.", "Date": "November 21, 2011"}, {"Title": "Great Performance at a Reasonable Price Point", "Author": "Jeff Burns", "ReviewID": "RR9GAHKN3ALVT", "Overall": "5.0", "Content": "This TV offers the most features and best visual performance. The VIZIO name may have started off as a cheap third party producer of TV's or at least that is what I thought. I avoided them until I started reading some of their reviews. When my 8 year old 50\" Pioneer Elite Plasma died for the third time, I decided it was time to update. This TV offered fantastic features such as internet access over wireless and automatic volume adjusting to tame the annoying commercials that blast you with over loud volume. The true LED back lit is a great performance enhancer. The edge led lighting models while good, just don't get the true black that back lighting can in a dark theater viewing room. I love the flip out full keyboard to manipulate the numerous Internet apps that are available. I have been extremely happy with the TV except for one obvious, in your face weakness. The sound from the TV speakers is completely lacking or it appears to at least. I say this because the TV just so out performs in all other areas that the TV sound is just sufficient. This makes it stand out and give me the only reason to wish VIZIO notices this short fall and puts some better sound on their next designs. If they did, their TV would be perfect. I can live without it though, especially in light of how much I enjoy the rest of the TV. I wouldn't not buy it for the mediocre sound. Thank You VIZIO for a product well done. On a side note, the freight company that Amazon used to delive rthe TV was 5 star!! Very careful, professional and they set up the TV and verified it functional before offering to collect and dispose of the packaging materials. Over all it was a very pleasant experience through Amazon.", "Date": "November 15, 2011"}, {"Title": "Unbelievable Image!!!  A really awesome TV. Blooming is a problem.", "Author": "Daniel Lenzmeier \"psykohed\"", "ReviewID": "R127BWA56NAJG1", "Overall": "4.0", "Content": "The picture  truly is a thing to behold. Everything looks simply amazing. I'm coming from a very nice 5 year old 60Hz Samsung 46\" andI always thought the picture was great. WRONG! Everything I watch is just SO MUCH better. I can't say enough about how brilliant the picture is to watch. Blacks are black! Clarity is unreal.  Things have come a long way. FYI, The 3D version of this TV says it's 480Hz, but the non 3D content plays at 240Hz, so unless you plan on watching a ton of 3D it's not worth it. I got this TV for $800 refurbished. No problems. A No Brainer really. You won't find a better picture at three times the price.The super bright Vizio logo that I had to put a piece of black tape over is LAME!Apps are nothing special and I don't use them. I have an iPad and an Apple TV for that. Don't use the sound either. If you have a TV this big and beautiful you better have a Surround Sound system anyway.This thing does one thing exceptionally well. Display INCREDIBLE images!UPDATE: After watching a few darker movies I've found the blooming is pretty bad on this TV. You'll only notice it during credits or really dark scenes. As an example, Harry Potter looked pretty bad on this TV, while Avatar looked stellar. Still 90% of the time the image is spectacular. If I had to do it all over again though I would of gotten a plasma. There is still nothing that can complete with a Plasma picture.", "Date": "November 10, 2011"}, {"Title": "Awesome purchase", "Author": "Cruzzer666", "ReviewID": "R3QX02X8U0FR6Y", "Overall": "5.0", "Content": "I was skeptical to purchase a T.V. without physically seeing it, but with all the great reviews I had to try. I've had this T.V. for a month and truly fell in love. I haven't had any issues. I still need to play around with all the features but would recommend this T.V. to anyone who wants quality for a great price.VIZIO XVT553SV 55-Inch Class Full Array TruLED with Smart Dimming LCD HDTV 240 Hz SPS with VIZIO Internet Apps", "Date": "October 31, 2011"}, {"Title": "vizio XVT553SV 55-INCH tv", "Author": "Catherine Walton", "ReviewID": "RCV8NKDI87YC0", "Overall": "4.0", "Content": "We love our newest Vizio TV.  The picture is crisp as you would expect on an 1080 HDtv.  The vizio apps are easy to use, as are the directions for setting it up to a wireless router.  My only complaint is the small amount of available apps.", "Date": "October 29, 2011"}, {"Title": "great tv", "Author": "jaybird", "ReviewID": "R2UOG1071N3WHZ", "Overall": "5.0", "Content": "great TV. easy to set up and a really good picture. third vizio I have gotten and would buy a fourth if ever needed.", "Date": "October 26, 2011"}, {"Title": "Not quite ready to use", "Author": "Ed the Infidel \"Old Bachelor\"", "ReviewID": "R2LITHX1W717R0", "Overall": "5.0", "Content": "This TV arrived safe and sound and on time.  However, following the on-screen setup guide caused some frustration.  It stayed locked on page one of the guide, forcing me to call Vizio for technical assistance.  It didn't take long to connect and I had a very knowledgeable and patient lady, who talked me through a long and complicated process of button pushing, in order to make the device playable.The picture quality is excellent, and I have the option of connecting it to the internet, something I'm not now interested in doing.  The lady at Vizio seemed surprised at the low price I paid, $1400.  I would recommend this TV to anyone.", "Date": "October 10, 2011"}, {"Title": "Excellent TV", "Author": "abrown", "ReviewID": "R3RFC12GHYR8HQ", "Overall": "5.0", "Content": "After using the suggested settings from multiple highly recommend sources, I finally got the picture dialed in. I saw the halo effect and hated it. The easy fix is turn off smart dimming and play with the backlight and brightness settings. Blacks still looked fantastic. I'm very happy with this tv.", "Date": "October 5, 2011"}, {"Title": "WOW! What a picture.", "Author": "George", "ReviewID": "R3EH1EMWLCGAAH", "Overall": "5.0", "Content": "The delivery was great and the driver took the LCD out and plugged it in so I could see that it was working. The base was already on the LCD so all I had to do was put it on its stand. Setup started automatically after turning on the LCD - fast and easy. The only problem was that the remote would use up the batteries every 3 days. Called Vizio support and they're sending a replacement remote.", "Date": "October 5, 2011"}, {"Title": "VIZIO....55\" HDTV....a month later", "Author": "Amazon Customer", "ReviewID": "R3HJWAH7IK3OM2", "Overall": "4.0", "Content": "We are quite pleased thus far...we would be happier if we could use the set's remote, but since we have Verizon FIOS, we apparently must use their remote to control Set Top Box....otherwise, all is good.", "Date": "October 3, 2011"}, {"Title": "Great TV, Excellent service", "Author": "Jim D", "ReviewID": "RGTGLK5E52ZSK", "Overall": "5.0", "Content": "If something breaks, I normally do not give it an excellent rating but with VIZIO I will make an exception. Delivery by amazon was of the utmost of convenience.  The TV is great.  Excellent picture.I purchased it about 6 months ago and the picture went out on a Sunday.  I called them (ON A SUNDAY)and I got a Vizio tech in Idaho (USA)who helped me troubleshooting without the condecending \"is it plugged in\".  After a painless confirming emails and one other phone call (in the continental US) without waiting in a queue I was set up for an appointment.  Two technicians showed up early, fixed it in short order and left without issue.  Just Greaaaat!  This hasn't happened to me in years.  Of course, dealing with Amazon was great as usual!", "Date": "September 28, 2011"}, {"Title": "Love it. Was skeptical about Vizio at first.", "Author": "Joe Stevensen", "ReviewID": "R2I8NJFXW439IR", "Overall": "5.0", "Content": "Vizio makes discount TVs, or so I thought. This is part of their \"elite\" line.The apps are nice. Better than TiVo apps, better than my Blu-Ray's apps.240Hz is nice! (weird at first)Remote is bluetooth, so you don't have to point it at TV.Full LED backlighting, not edge only like Samsungs.Happy with this purchase.", "Date": "September 9, 2011"}, {"Title": "aswesome tv", "Author": "Steve Hockaday", "ReviewID": "RDJ9L7U3WN07M", "Overall": "5.0", "Content": "before buying TV i did a lot of research online for led TV, cnet has the most accurate review,consumer report has it as best buy .lot of review on amazon the good and bad. the TV has the best picture i have seen Internet feature are great, love the matte screen ,because i have windows next to TV no glare from them, even at night when lamp is turned on.  the remote is cool with the slide out keyboard,sound is good , but did hook up to surround sound,back to amazon reviews,some talked about having trouble TV reliability 1-4 weeks after buying i have had none,I have had it 7 weeks this TV has been awesome, i did buy the extended warranty just in case from square trade.got a good price on TV from amazon with free ship and no sale tax ,so what i saved paid for the warranty. so i would recommend this TV for anyone looking for great TV at a great value", "Date": "August 18, 2011"}, {"Title": "so far, so good, and even better", "Author": "konstantin goykhberg", "ReviewID": "RL6UX2WAEN5MK", "Overall": "4.0", "Content": "Bought at Costco in February 2011. So far - great performance and picture quality. An internet app - is almost useless. Love remote control - no need to point at the TV for control.4 stars because of the internet app. Other than that it would have been 5 stars.", "Date": "August 10, 2011"}, {"Title": "VIZIO TV  XVT553SV", "Author": "SLY", "ReviewID": "R1P2ESWXTWH10V", "Overall": "5.0", "Content": "It was everything we expected it to be for what we thought to be a reasonable price for a backlight TruLED 55\" 240Hz TV.  The only thing that was hard getting use to were the SMALL buttons on the control device. The picture set up was easy to do and the picture quality is excellent.  Our DVDs show as if they are mini movies and the sound is quite good also.  We are not electronic geeks, so we even like the old black and white moveies.  It was a fine investment that we hope to enjoy for many years. It replaced a 42\" plasma TV that was showing its age(7 years).  Again, for the first 60 days of use we have enjoyed the quality of the display. The future and the Apps will be all new to us, but it looks to be a whole new world of experimenting.", "Date": "July 27, 2011"}, {"Title": "Most Awesome TV", "Author": "george", "ReviewID": "R2IOV5WA8I1YVQ", "Overall": "5.0", "Content": "Before buying I did a lot of research and C Net was right on as to its rating of one of the best rated TV's. Also Consumer Reports Magazine was right on with its rating as one of the best buys. Amazon had the lowest price with free shipping. Delivery was on time and they took it out of the box so I could check it. Then they helped to put it up on the stand and helped to connect the inputs to see if it worked. Directions and set up was very easy. The remote is easy to understand and use. Picture is fantastic and the steaming of the apps is crystal clear quality and easy to set up with loads of choices. This TV can be streamed directly to your router without an adapter. Only downfall is that the sound could be a little better, but a soundbar can correct it if you like and lastly I now have to go and buy a Blu Ray player for even better viewing of DVD's.  Love it and highly recommend it.", "Date": "July 23, 2011"}, {"Title": "Delivers as expected", "Author": "V. Stansell", "ReviewID": "R2552UUQXU058V", "Overall": "4.0", "Content": "I did a lot of research on this model since one of my son's had previous problems with a smaller Vizio.  Consumer Reports, CNet & Amazon's owns reviews were all favorable.  The product was very easy to setup (and I'm NOT a tech pro)and has provided a clear picture so far.  I'd recommend to anyone seriously consider the 55\" version.Also - the vendor that delivered the set was very good (called before delivery, showed up when promised) and setup the product efficiently.", "Date": "July 17, 2011"}, {"Title": "Excellent product and value.", "Author": "LouB", "ReviewID": "R3R1GUFVH2OFRX", "Overall": "5.0", "Content": "Purchased it about four weeks ago.  Thus far my exeprience has been excellent.  Set up was was easy and the WiFi access is great.  No complaints.", "Date": "July 17, 2011"}, {"Title": "Vizio XVT553SV 55-inch", "Author": "Happy Buyer!", "ReviewID": "R310H29XCTEAG7", "Overall": "5.0", "Content": "I absolutely love this TV... the picture is phenomenal and the price of the TV beats anything else on the market. I was a little leery at first because of the poor reviews concerning the reliability but I haven't had any issues with my set and couldn't be happier.I would highly encourage anyone looking to buy a new TV to get the Vizio!", "Date": "July 15, 2011"}, {"Title": "Vizio has done it again!", "Author": "Anthony", "ReviewID": "R3OOOVAP6WLCHJ", "Overall": "5.0", "Content": "I just purchased my very own  VIZIO XVT553SV 55-Inch Class Full Array TruLED with Smart Dimming LCD HDTV 240 Hz SPS with VIZIO Internet Apps.  This is some awesome television!  This technical work of art is more than words can explain.  Set-up was very quick and easy.  The picture and sound quality are next to none.  I was surprised at how easy it was to use the internet applications.  Even my wife was not expecting the video and sound quality to be so crisp and clean.  The 240 Hz refresh rate and full array truLED is really outstanding.  The remote has a built-in/slide-out QUERTY keyboard that qualifies it as a really \"smart\" remote. The price/value of the XVT553SV is outstanding.  My purchase on Amazon.com was far below the suggested retail. This is an awesome piece of electronics.  Words cannot describe my high level of satisfaction with this purchase.  I highly recommend this Vizio 55-Inch Class TV to anyone who feels the need to own the best in widescreen viewing. Your friends and relatives will be jealous and you will be ecstatic!VIZIO XVT553SV 55-Inch Class Full Array TruLED with Smart Dimming LCD HDTV 240 Hz SPS with VIZIO Internet Apps", "Date": "July 14, 2011"}, {"Title": "Turn off the smoothing in the settings before judging your tv.", "Author": "Joneser", "ReviewID": "RKL6DH4IYIGCV", "Overall": "5.0", "Content": "Like so many reviews I read before making the decision to buy this tv, I am really impressed.  At first movies looked strange to me, almost as if they were filmed with a hand held camera.  They were too real looking and C.G. in movies was easily diserned from real footage.  It was driving me crazy until I turned off the smoothing these new tv's can do in the settings.  Its like it removed the hollywood effects from movies and I could not stand it.  The picture is really awesome.The only thing that I have noticed is sometimes I hear a random glitch in the sound of the tv, I use it as a monitor for a home theatre pc so it may be noise from my pc or even noise from possibly a dirty ac line.  It is very small only noticed when there is little or no volume.Also the sliding remote is pretty impressive, I did notice the top characters are difficult to press because the are too close to the top half of the remote but hey what can you ask for in a remote.  No big deal to me though since I have a full keyboard a do Netflix with a pc.  The apps seem interesting however they can not match a pc so I do not use them at all.", "Date": "July 14, 2011"}, {"Title": "6 Weeks with the Vizio", "Author": "SCMike", "ReviewID": "R2JZ2BZKECBJU9", "Overall": "5.0", "Content": "I thought long and hard before ordering the Vizio 55-incher, read through all the reviews, noted the negative comments, but decided to go ahead anyway.  Six weeks of viewing later, I could not be more delighted - this is a fabulous HDTV.  The picture quality is marvelous - the HDTV is in a room with a wall of windows, but there is no reflected glare off the matte screen surface even in bright daylight.  The picture is still clearly visible at extreme angles off the perpendicular to the screen. The set-up was trivially simple right out of the box - basically just plug the set into the power, and then follow the simple instructions in the on-screen menu. The handshake with my Wi-Fi router box was similarly trivial to accomplish. The second time that I turned on the HDTV, it paused briefly for a Wi-Fi update of the set's firmware - that gave me the latest Netflix interface with convenient access to all the contents of Ali Baba's cave. Hooking up the Blu-Ray player took not much longer than connecting the power and cables, and checking off the item from the on-screen menu for input sources.  I haven't the foggiest idea what the problems with all those negative reviews were about - was that for the same HDTV?  Has the product been secretly improved recently?  I would unhesitatingly recommend this HDTV to anyone.", "Date": "July 9, 2011"}, {"Title": "Vizio XVT553 Rocks!!!", "Author": "Vasanth Nanjundeswaran", "ReviewID": "R1KL0SV6TGRT68", "Overall": "5.0", "Content": "I bought this TV around Christmas of last year (2010). I researched similar resolution LED LCD TVs from other vendors but none matched the price or bang for the buck that Vizio delivered with this product. The set-up was easy and the extra features were easy to use. I was able to connect to my Netflix account through my wi-fi network within minutes.The only challenging aspect of the setup is to figure out the right settings for your room. After a week of playing around with the display settings i was able to get the picture to look perfect. There are plenty of online pointers in HDTV forums to program the correct display settings for your TV and viewing needs. The only negative is the clunky remote but i use my universal/satellite remote most times anyway.I would highly recommend buying Vizio to people looking for a relatively inexpensive option to the big name brands out there.", "Date": "July 9, 2011"}, {"Title": "Great Delivery, service and picture", "Author": "DougW", "ReviewID": "R2AOB558KDQU8Y", "Overall": "5.0", "Content": "TV was delivered as promised (although it was a 4 hour window, would have liked a 2 hr window). They took it downstairs, unpacked it and plugged it in. TV looks awesome and worked fantastic. Haven't tried internet features yet.", "Date": "July 6, 2011"}, {"Title": "Awesome Tv with great features, great color, buy it!", "Author": "Tonyzany \"tonyzany\"", "ReviewID": "R39EUFDM22CN1A", "Overall": "5.0", "Content": "Tonyzany says:First off, I purchased the vizio xvt552 The model previous to the xvt553vu from SAMs Club for $1700.00. I also purchased the Vizio extended warranty for $200.00. For five year total warranty. The television has incredible, color, features, Internet apps etc. Almost one year to the day the tv started getting a yellow color in some of the white areas started to appear. I called Vizio customer service and they were extremely helpful, they scheduled a tv tech from ITI (vizios diagnostic service) and within a week they came out and looked at the issue and told me I would here from them within 48 hours. At the 4 day mark I called them back and ITI told me a decision from the warranty company was made, I first thought to my self Oh boy here it comes, I was waiting for them to tell me how much I would have to pay out of pocket, but Huge surprise! They offered me a $1250.00 cash buy out or send me the xvt553vu brand new for free with free shipping. My xvt552 still has a beautiful picture on it but they said the LCD panel was going out.I have read a huge amount of reviews on Amazon for all kinds of products and when you read the bad ratings, it seems to me those particular people are not very tech savvy and don't understand it's usually a simple solution. if they contact c/s they probably are the type to argue and try to pull one over on the product manufacturer. If you buy from Amazon there c/s is number one. They usually send a replacement out before you have to send in the product.Here's the bottom line: with a 0 to 5 star rating that anyone can write on Amazon, and when you see a big majority of the rating 4 to 5 stars and people who give a zero or one star rating are suspect, and I read those ratings carefully and you can usually tell what kind of person is writing them.VIZIO VF552XVT 55-Inch Class XVT Series TRULED 240Hz sps LED LCD VIZIO Internet Apps HDTVVIZIO XVT553SV 55-Inch Class Full Array TruLED with Smart Dimming LCD HDTV 240 Hz SPS with VIZIO Internet Apps", "Date": "June 26, 2011"}, {"Title": "An outstanding led-lcd television for the money", "Author": "Larry0623", "ReviewID": "R2PAY7JYORPVYI", "Overall": "5.0", "Content": "Vizio has made an outstanding television with features that only exist on much higher priced televisions in this class.  After much research, this television offers the most bang for the buck.  The Vizio XVT553SV is easy to set up and has an awesome picture.  Don't be fooled by the lack of brand recognition.  this is a winner in all aspects.", "Date": "June 26, 2011"}, {"Title": "VIZIO XVT553SV 55-Inch Class Full Array TruLED with Smart Dimming LCD HDTV 240 Hz SPS with VIZIO Internet Apps", "Author": "Arbo", "ReviewID": "R2KGNR57IT0OZE", "Overall": "5.0", "Content": "Awesome HDTV with outstanding picture.  Set-up was a breeze and the TV connected wirelessly to the internet with ease.", "Date": "June 24, 2011"}, {"Title": "Awesome picture!", "Author": "Kimonte", "ReviewID": "RMIMUGWGW9FG9", "Overall": "5.0", "Content": "I have had this tv for about a month.  My husband and I are in love with it.  It has a beautiful picture.  And the sound quality is just for for us.  I know some have complained about the sound, but we are not sound technicians and are perfectly happy with the tv.  Perhaps in the future we may consider getting a sound bar.  I especially like being able to get on Facebook from the tv, the weather channel, NetFlix, etc.  We have not had any problems with the set thus far.  This is our second Vizio.  Our first was a 22 inch.  We bought it three years ago and it still has a great picture.  So we figured why pay Sony prices when we can get the same quality and pay less money.  If you're considering Vizio, don't hesitate because it's a good product.I was very disappointed with Amazon and the length of time it took to get the tv.  Almost two weeks!!! Yikes!  Don't know what the problem was but we missed the NCAA final game.  Other than that, I still like Amazon for price.", "Date": "May 6, 2011"}, {"Title": "LED Vizio TV", "Author": "Donald E. Wegner \"DW\"", "ReviewID": "R2KVD8P6WVPBI6", "Overall": "5.0", "Content": "Easy setup and excellent picture quality right from the get go. The person that delivered the TV was very friendly and stayed until the set was unpacked and power hooked to it.", "Date": "May 5, 2011"}, {"Title": "Awesome LED TV", "Author": "pullmymail", "ReviewID": "R3A4I5QYR0VUH0", "Overall": "5.0", "Content": "This is an awesome TV and I haven't had any issues for the first 30 days.  Shipped fast and received the white glove delivery.  The shipper unpacked and powered up to ensure the TV worked.  Since the TV is internet capabable I even received an automatic update which improved performance.  I checked out Hitachi, Samsung, Sharp, Panasonic, etc, etc and value for the dollar was Vizio especially, with this high end xVT55SV model with 10,000,000:1 contrast.  There are different models in other stores, so ensure you get the right one.  Now, I am thinking about getting the new Vizio 5.1 Dolby Surround Sound woofer and bar.Good Luck with you TV searches and I am definitely glad I purchased this TV after 16 years with my 35 inch Sony glass tube model that weighed 170 pounds...so sad to see it go to the dump, NOT! :-)", "Date": "May 1, 2011"}, {"Title": "Refurbished.....BEWARE", "Author": "Amazon Customer", "ReviewID": "R10BYJYR99I5PW", "Overall": "3.0", "Content": "GET THE EXTENDED WARRANTY!!!! It will pay for itself...I purchased this refurbished Vizio XVT553SV through Tigerdirect.com. Thinking this system had been double checked I would be safe from defects. The TV arrived in EXCELLENT shape. It was packed and looked as if no one had touched it. A few months after having the TV it started to scramble the picture (little boxes all over). I unplugged the tv...waited a few minutes and plugged it back in. The TV cleared up and the problem was gone. Well...5 months later the TV started to just go black. You could hear sound, but no screen. This happened off and on for about a week. And, again, I unplugged it, waited, then turned it back on. I could sometimes get through a whole movie. Then, after a while, the TV would just start up black...no VIZIO logo...and stay black.FORTUNATELY I had purchased an \"Extended Warranty\". I never purchase warranties. This is only the 2nd one in 30 years and they BOTH paid off.I did not realize that the maufactures warranty was VOID as the red stamp stated in the Warranty section of their manual due to it being refurbished, and TigerDirect has only a 90 day return policy. I contacted the warranty company and they had someone out in about a week. He replaced EVERY motherboard in my system. The TV is running great so far. This TV is everything that I had researched for: Full array back lighting, 240hz, LCD-LED, matte screen and much more. I am very satified with the product and the \"ITI\" warranty company.", "Date": "April 13, 2011"}, {"Title": "I'm a convert...", "Author": "Deanna Oliver", "ReviewID": "R26TUZOWARXBB8", "Overall": "5.0", "Content": "I have to admit....I've only owned Sony TV's my entire life because I was convinced that they were THE BEST brand out there.  When I started looking for a big 55\" TV, I really wanted to get another Sony.  Once I began asking and and researching, the brand 'Vizio' kept popping up.  I dismissed it, thinking....\"I wouldn't want a knock-off brand TV\" and turned my nose up.  However, after extensive research, I was surprised to discover that the Vizio equalled, and in some areas, surpassed the Sony with the same features and specs.  The biggest price difference was obvious - the price!  The picture was the 2nd factor that helped me make up my mind.  Friends and family kept repeating...what a good picture...over & over again as we watched it.  The set-up was extremely easy and intuitive.  Even a non-techie type person could navigate thru it with no problem.  The on-screen menu almost tells you what to do and when to do it.  The sound is fine for me.  I don't like extremely loud volume on my TV, so maybe someone who wants to be blown out of the room would want to invest in something additional.  But just to watch a normal TV show and/or game, it's perfectly adequate.  Just turn it up!  The internet connectivity is the coolest thing ever.  My husband and I have had a blast with the Netflix app.  The only complaint I have about this entire processs isn't with the TV at all, but the delivery process.  When I ordered on-line, I signed up for the text alert when it was out for delivery.  As I would check the tracking status, I kept noticing messages saying the shipper had tried to contact me, but they couldn't get an answer.  I wasn't getting any calls from the delivery company and had to call Amazon customer service.  They checked and found out that the default phone listed on my account was an old number that had been disconnected since we had gotten rid of our house phone & only use our cell phones now.  Supposedly they fixed that problem in the records, but it did happen one more time.  Not sure why the shipper would have an old house number, especially when I had entered my cell phone # into the proper place when I signed up for the text messaging notification.....  Anyway, it all worked out & the TV was delivered quickly once we connected.  The delivery guys were helpful and helped us unbox and move the TV to the media console.  Did finally get a text message the day AFTER the TV had been delivered saying:  \"Your item has been delivered\"  ;-}", "Date": "January 12, 2011"}, {"Title": "Great TV, unbeatable price!", "Author": "J. Mitchell", "ReviewID": "R335E366LXFYP6", "Overall": "5.0", "Content": "So far an excellent TV!  Vizio internet apps are a great feature! Occasional get the \"Soap Opera Effect\" but this expected with all LED LCD TV's.  Very pleased with the purchase overall.", "Date": "December 7, 2010"}, {"Title": "Great TV", "Author": "CF", "ReviewID": "RVR7RN0EUGL4C", "Overall": "5.0", "Content": "TV picture quality is absolutely terrific. In terms of 2D viewing, I honestly don't know if there's a better LEC/LCD TV out there. Comparable models, even at a discount, would typically cost about a thousand dollars more.Although I was hesitant to buy a Vizio at first, this model convinced me otherwise. I think the manufacturer has come a long way, and it truly might not be long before people stop thinking of Vizios as budget TVs. Reliability is a concern, but there have surprisingly been less complaints (so far) about this one than the Sony and Samsung TVs I was looking at. Since it's Vizio's flagship model, I'm assuming they spent a good amount of time making sure the TV was made to last. If I have any problems, I'll update this review. But so far, so good.", "Date": "December 4, 2010"}, {"Title": "Great Value", "Author": "Tom  B.", "ReviewID": "R1VXKJSWUKH54I", "Overall": "4.0", "Content": "Great value.  Picture Quality is great.  Internet connection with widgets is cool.  Onlycomplaint is occassionally TV will lock up, but very rare.  Hopefully firmware updates will eventuallyfix this", "Date": "December 3, 2010"}, {"Title": "Great set, from straight on.", "Author": "John Raustadt", "ReviewID": "R3RA4SQ45KD62Z", "Overall": "3.0", "Content": "I've been tinkering with the set's picture setup menus for a few days and still can't get the excessive blooming to subside. Straight on, the picture is astounding but it does wash out, as I believe CNET pointed out, as you move to the side. I can live with that however there's a blooming effect that I just can't get resolved. In darker scenes, actors' faces tend to have a \"halo\" around them and it follows them througout the screen, almost in a jittery fashion if they move. I've tried setting this up according to CNET's recommendations but the picture becomes worse. Maybe I have a defective set (and I bought the Square Trade warranty) that needs service from the get-go.I'm running it through an Onkyo TX-SR608 receiver with a Panasonic BD85 blu ray player and a Dish Network 722 DVR satellite receiver. The one thing I haven't swapped out yet is doing a direct connect with the HDMI cable to the input source and that's next up. That's a 25-foot CMPLE cable.If anyone has experienced similar issues and was able to resolve, please post your current settings.On the \"bright side,\" this set is absolutely amazing with bright action-oriented contenct. It shines with sports, such as football, and I suspect the same will hold true for hockey and other sports.Overall, I'm not overly thrilled with this set yet but won't be returning it. There's something amiss here and it could be as simple as a bad cable although I'm having a hard time believing that's the issue.", "Date": "September 29, 2010"}, {"Title": "Apps Kept \"Crashing\" my TV", "Author": "Chris Albrecht", "ReviewID": "R3E7AFABUKCL71", "Overall": "2.0", "Content": "I've had this TV up and running for one week and one day. In that time, the internet widgets have \"crashed\" the TV on FOUR separate occasions.Two times using the Amazon VOD app.One time using Vudu.One time using Netflix.By crash, I mean the screen went dark and unresponsive, and I had to power cycle it. Vizio tech support told me that if it keeps happening, I have to manually go in and reset it to the factory settings.The TV was hardwired to a 50Mbps connection, so it wasn't using wireless and connectivity was not the problem.I was very excited to purchase, unbox and use this TV. I'd been saving up for a long time and hunting for the perfect set even longer.The picture quality was fine, but the stupid Yahoo app platform was slow and, crashy.Long story short, this smart TV is dumb. I'm returning to buy a different brand.", "Date": "January 15, 2011"}, {"Title": "Excellet TV!", "Author": "catnut", "ReviewID": "R2WINO52MMNFJC", "Overall": "5.0", "Content": "WOW! This TV is top quality....picture is amazing...clear and color is excellent! I will probably stick with Vizio on my next purchase and I will always buy from Amazon!", "Date": "December 11, 2011"}, {"Title": "Awesome LED TV!", "Author": "Paige Farr \"farrcrest\"", "ReviewID": "RAQ7KSJSZFD5G", "Overall": "5.0", "Content": "I couldn't be happier with my selection of this TV.  Awesome video and all the bells and whistles to connect to the internet, and the price is right!", "Date": "December 7, 2011"}, {"Title": "Tuner is essentially defective", "Author": "W. Darling \"(brainiac)\"", "ReviewID": "R3FTQDQMH12QYR", "Overall": "2.0", "Content": "I have had the TV for 4 months and was pleased with the TV. The problem came when my cable company shifted the digital channels from the ch700 range to the ch1000 range. The television only allows you to direct input channels with three digits. This is not an issue with my smaller, older Vizio TV which allows entry of 4 digits. I called support and they said it is a limitation of the tuner in my nearly brand new 55 inch TV. The solution is essentially to direct input a channel as close to 1000 as possible and then hit the up channel through all of the channels above 999 until you get to the one you want. This also means no jump/last feature to switch between two channels. Support was quick and polite could not offer any solution and said that there was no possibility of a firmware update to fix the problem. You might be okay if you use some other method of changing channels like a cable box and use the TV as a monitor for that device.In my opinion, my big new TV should be at least as capable as my older, smaller TV from the same company. This is a fundamental flaw and I am going to attempt to return the TV.", "Date": "November 30, 2011"}, {"Title": "Great TV.", "Author": "Ronald Davis", "ReviewID": "RUH5BX867FVYK", "Overall": "5.0", "Content": "I did a lot of research on this TV and I am VERY satisfied. Could not ask for a better picture or the extra features of the VIA through the internet. Also very pleased with Amazon's shipping and delivery. Was very easy to set up.", "Date": "May 26, 2011"}, {"Title": "Great quality.  Right price point", "Author": "S. Kolla \"srinu_ny\"", "ReviewID": "R16BHS2QERJ0MM", "Overall": "4.0", "Content": "Setup with wifi (airport extreme) was not automatic.  It required reboot of the tv with 30 sec power button reset (with support guidance).  It now works like a charm.  The picture quality blew me away.  I'm now watching youtube hd videos via apple tv.  Bliss!  My upscaling dvd player and hd cable box feed well into the tv.  There are enough inputs to satisfy most people.  The sound and video quality is much better than my other tv which is a Sony Bravia. I'm not even going to bother with a receiver and speakers. Construction feels solid.  Vizio internet apps are ok and nothing spectacular.  For better net content, you might need a dedicated set top box.  Overall I'm really satisfied with the purchase.Used cnet and amazon reviews before buying.", "Date": "April 17, 2011"}, {"Title": "Vizio 55 Inch", "Author": "ntim", "ReviewID": "R2G7LBT2X6LXMA", "Overall": "5.0", "Content": "This is a great TV for the money. I've been very impressed with the quality of the picture. I've also used the instant download movie feature and it works very well. I would recommend this TV to anyone.", "Date": "April 13, 2011"}, {"Title": "Great TV", "Author": "Miksa", "ReviewID": "R3KJMP88RUP6OK", "Overall": "5.0", "Content": "I was little suspicious how this TV will manage in my use, but I was amazed when I saw it first time after calibration. The picture quality is absolutely the best what I have ever seen. Price was also incredibly low because I bought the TV used. Still it looked like new and never used. Extra features are very nice and they work pretty well and TV have lots of them. Set up was easy and you can find good settings for this TV from internet. Only question is reliability and that can be seen after few years.", "Date": "April 8, 2011"}, {"Title": "VIZIO XVT553SV 55-Inch LED TV", "Author": "Vince", "ReviewID": "RIDPQVU800EZK", "Overall": "4.0", "Content": "I love the Picture!!  cant beat this TV for the price.  Have not used the Apps. enough  Remote is very nice. I would have given a 5*  if not for the sound.  If you don't turn off all sound enhancements, when watching sports the announcers voice fluctuates which to me is very annoying.  Won't be a problem if you listen to your setup using a surround system.  I would recommend this TV.  Unless your willing to pay Top price for High End products.", "Date": "February 7, 2011"}, {"Title": "Great Non-3D TV", "Author": "Thad Yates", "ReviewID": "R34S6IWZNZN4TW", "Overall": "5.0", "Content": "Great TV with all the features except for 3d. I was not interested in 3d TV's after learning that it requires 3d glasses and the cost of the 3d glasses. Vizio has the closest picture quality to Sony just without the big price tag. A+++", "Date": "February 7, 2011"}, {"Title": "Very happy", "Author": "schwartzonline", "ReviewID": "RR6OV49W5UWWT", "Overall": "5.0", "Content": "I'm very happy with this TV. I researched TV's for several months and then found this as an alternative to the Samsung. It spec'd out better and had great reviews. Lots of inputs. Decent widgets. Picture is great except in very bright light. Keyboard on remote is a nice feature if you use the apps. Unit takes a little long to start up. Delivery was fast. I've recommended this TV to other people.", "Date": "February 4, 2011"}, {"Title": "Vizio LED 1080 240 HTZ", "Author": "Largemouth78", "ReviewID": "R10O9DRGNNGVWI", "Overall": "5.0", "Content": "Love this TV.  Great picture.  I have not had any problems with it.  I recommend it for sure!!", "Date": "January 31, 2011"}, {"Title": "Wi-Fi doesn't work", "Author": "Idfw2003", "ReviewID": "R30NXI3CKPKXF7", "Overall": "5.0", "Content": "I purchased this TV Dec 5 and have had problem with the Wi-fi since day one. Initially I thought I had the wrong password but it checked out. After spending hours and multiple phone calls with Vizio tech support (Including making an open network, power cycling the TV power, modem, my existing N router, even trying it out with a brand new N router), they finally determined that the TV is defective. I got a replacement TV Jan 3rd and guess what, the Wifi on this one didn't work either! I'm really disappointed. Instead of messing with Vizio again, i decided to call Amazon up to request an exchange. The 3rd TV should arrive next Tuesday.1/11/11. 3rd time is not a charm for me. Received the TV but the backlight died on me 4 hours later. Very aggravating! Decided to take another risk and request another exchange.1/22/11. 3 TV's later (2 busted Wifi and 1 busted panel), finally the 4th one works great! Wifi hooked up with no issues and panel performs as it should. Been 4 days since i received the TV and so far so good!4/11/11 Update. Have been really pleased with the TV. Only one incident of random reboot. The picture quality is awesome with over the air programming for 1080i/720p. I have yet to test this TV on a Blu-Ray movie but I'm sure it won't disappoint me there! I took out a 3 year square trade warranty when it went on sale since it's still a fairly new technology. One complaint though.....when is YouTube and Hulu going to be added in the apps?!!10/21/11. Still no Hulu or youtube apps but the TV has been awesome so far so I'm giving it another star upgrade.", "Date": "January 7, 2011"}, {"Title": "great product horrible delivery", "Author": "Gary", "ReviewID": "R3DL6RDNI32JD", "Overall": "3.0", "Content": "The tv is awesome but the company used to deliver it was awful. It arrived about a week late. The company was called Seko. The tracking said they contacted me when they never called or emailed. If I did not take the intiative I feel like I would have never received my tv.", "Date": "February 27, 2012"}, {"Title": "new TV", "Author": "Joe", "ReviewID": "R3QDT1BGB0FRID", "Overall": "4.0", "Content": "I purchased a new visio HD telelvision through amazon. All aspects of the purchase went very well, and the TV itself is GREAT!", "Date": "November 14, 2011"}, {"Title": "Phenominal, I am still in awe!", "Author": "crj341", "ReviewID": "R1TYQMJJ37WV3J", "Overall": "5.0", "Content": "Incredible picture quality...I would put it up against any TV at any price, it is that good.  You simply will not find better black levels.  There is a tiny bit of light bleeding due to the local dimming feature but you can only see this when the room is pitch black.  Thankfully, it has a matte screen which cuts down on reflections, yet still manages to be crystal clear.  Everyone who has come over to watch a movie on this TV were stunned and could not stop commenting on the picture.  Smooth motion works well but I have noticed occsional pixelation noise during fast moving images, but it is much better than I have seen from other brands.  Sound quality is better than most flat panels.  The remote control is ingenious and further adds to the experience with its slide out keyboard.  I stream a lot of material from netflix over the WIFI connection and it has worked flawlessly.  The only gripe I had was that it took about 3 weeks for me to receive the TV, but that was probably because I opted for free shipping option and do not live in a major city.  You will not be disappointed with this TV!", "Date": "October 21, 2011"}, {"Title": "Nice TV - when it works...", "Author": "Robert", "ReviewID": "R37O8VRGSTC2LS", "Overall": "3.0", "Content": "The first unit I received was a lemon. It worked for about 3 weeks before developing a flickering display. An onsite visit, 5-6 business days later after the spares were shipped to the engineer, cured that issue for about 24 hours. Then all the HDMI inputs failed, so another 5 business day wait while new parts were again shipped. The replacement parts themselves were DOA, so to their credit Vizio arranged for a completely new replacement TV. So my fingers are now firmly crossed that this unit will last.Having been though the set-up procedure 3 times now I find it fairly easy and straight forward. The picture quality from the LG IPS panel is very good. The ability to drive a set of bluetooth headphones for quiet nighttime listening is a nice extra.", "Date": "June 26, 2011"}, {"Title": "Very \"fuzzy\" picture on three different units", "Author": "strattt65", "ReviewID": "R3SR4JBZKOXO6S", "Overall": "2.0", "Content": "I purchased this TV because of the Consumer Reports review.  I've purchased three other TV's over the last 15 years based on Consumer Reports and been very satisfied.  While the Vizio has great audio and a very wide viewing angle, the picture quality is terribly \"fuzzy\".  I'm not talking about motion blur.  Even the widget icons and my U-Verse guide text is extremely fuzzy.  I thought I had a defective unit, but I exchanged it for another and the results were the same.  I thought maybe the retail store had gotten in some bad panels so I purchased a third from another retailer and it was the same.I am stunned that no one else has noticed how \"fuzzy\" images and text are displayed.  I was so expecting to love the TV because of my past success with Consumer Reports.  I'm not trying to bash Vizio, I have a 20\" in my bedroom that I love.Three days ago I purchased a Samsung UN55D6000 and an HDMI splitter box and compared both sets at home, side-by-side.  There is no comparison in terms of picture clarity, the Samsung is crystal clear while the Vizio is very, very fuzzy.  Again, I'm not talking motion blur.  Still images, text, all appear very fuzzy on the Vizio.  The Vizio does have a matte finish, whereas the Samsung has a clear finish.  Perhaps this is why everything looks fuzzy on the Vizio (not sure).Needless to say, I'm very disappointed. This is the first time in 15 years Consumer Reports has let me down.", "Date": "February 3, 2012"}, {"Title": "Great buy", "Author": "JKK2010", "ReviewID": "R1Y9IKJ5D8M2RP", "Overall": "5.0", "Content": "This is a great buy the easy set up and picture are one of the best paying more is a waste of money . You get what your paying for and more . Happy and enjoying it use my verizon remote and it works well .", "Date": "October 10, 2010"}, {"Title": "Vizio tv 55 inch model xvt553sv", "Author": "Chan", "ReviewID": "R3DXCH9T2PRYV3", "Overall": "4.0", "Content": "What is external size of this tv to check if this tv will fitIn our tv cabinetNeed external width length and height and depthThanks", "Date": "February 26, 2012"}, {"Title": "EXPENSIVE PAPER WEIGHT", "Author": "Baron \"creedence\"", "ReviewID": "R1V9MR4A63JDNY", "Overall": "1.0", "Content": "If you want to continously buy a new t v, like every 2 to 3 years, this is the one for you.  Look at Consumers Affairs.  This is the worst piece of JUNK on the market.  In fact if you really check, the distributer has gone out of business.", "Date": "October 29, 2011"}, {"Title": "Good Value with some annoying bugs", "Author": "still learning and looking \"WW\"", "ReviewID": "RTNGIDN5TFV1U", "Overall": "4.0", "Content": "So far no dramatic failures as I read of some of the other reviews.  The colors and quality of images seemed a bit off but because this is my very first 55\", I have nothing to compare to.  I did try to compare colors and image quality against my 2 year old 32\" Panasonic when I was watching \"The Great Migration\" off NGC, but the effort was not really paid off when I was kind of running between two rooms.The biggest complaint I have so far is the fact that this TV requires the DVR to be turned on at the same time for the TV to be functional.  I thought I needed to read the detailed owner's manual instead of the \"quick setup\" to overcome this flaw.  After talking with a customer service rep at Vizio, I was told that this is the way this TV is set up for.  I requested and promised a call back for this obvious lack of logic in this approach, so far I have not received any further input.  I truly hate this flaw because there is another remote to handle.  I decided not to bother to return this big TV and then do another round of search and purchase and the whole works.For the price I paid for this TV at Amazon, it is I believe still a good value especially considering the wireless Internet feature.", "Date": "February 25, 2011"}, {"Title": "Great picture, but off angle viewing is NOT GOOD", "Author": "tin_cup_25", "ReviewID": "R234XUU8249GCD", "Overall": "3.0", "Content": "I originally wanted to purchase the Samsung PN58C8000, but was a little concerned about the glare of a plasma screen and the price was pretty high.  After hearing the great reviews of the Vizio, I changed my mind and decided to go with the experts.The initial setup of the TV was excellent and I was pretty impressed with the picture.  I quickly used the CNet picture settings and was happy with the result.I sit somewhat off angle from the TV and I started noticing some blooming in dark scenes.  I got a little concerned, but just thought it was the signal and not the TV.  After watching it more, I started to notice that when you have off angle viewing with a dark scene, the TV has some pretty significant blooming issues.  If you move towards straight on, the issue goes away.I did more research because I wasn't sure if my set was defective or not, and it sounds like several people have a similar problem.  This is a problem I cannot stand and have decided to send the TV back.If you will not be sitting almost straight on with the TV, you will see blooming in dark scenes.  I'd ask any current Vizio owner to try playing \"The Gauntlet\" around the 47 to 50 minute mark, sit a little off angle, and you'll see what I'm talking about.From my perspective, this is a good TV, but does not have good enough off angle viewing to be rated so well.  I have now ordered the Samsung PN58C8000 and am hoping that this set will be much better.", "Date": "February 7, 2011"}, {"Title": "Vizio XVT", "Author": "J. Lee", "ReviewID": "R3T8062J1X09VV", "Overall": "4.0", "Content": "Got this TV from Amazon, boy it sells out quickly and you have to catch it when its in stock.  At the $1500 I paid its worth every penny, great picture and everything.  If your catching the TV at a higher price I would say I would look at the Samsung, its a slightly better picture and just looks more like a quality TV...But this TV is great..you really can't lose.", "Date": "January 22, 2011"}, {"Title": "Ehhh.  It's ok.", "Author": "Caustic One", "ReviewID": "R4ES94156YFBS", "Overall": "3.0", "Content": "I purchased this TV because my brother said \"it's the best reviewed TV Vizio has ever made.\"The TV was very easy to set up out of the box.  In fact, I was watching tv with it in the box because I couldn't pick it up myself and put it on the tv stand.  But that did not stop me from updating my Facebook status using the tv.VIA - is ok, I use the netflix streaming.  I wish the tv came with a youtube capability.Picture quality.  Maybe it is me, but the tv exhibits a great deal of clouding which makes me feel like the picture is subpar.  I am not too picky about blacks, but I can see how someone would complain that the black is not \"rich.\"With respect to color, I have tried many different calibration settings and have yet to find on that I am overall super impressed with.Bottom line - if you are not a videophile and you just want a large flat screen tv, this could be the tv for you.  However, with the deals that you can get on 55 inch tv's these days, I wouldn't necessarily say this tv is a good deal.  I got it when it was selling for $1498.00.  But for $1700?  I would have stuck to my 32 inch box tv.", "Date": "March 21, 2011"}, {"Title": "A Vizio lemon?", "Author": "John F. Roskowski \"Lazy Reader\"", "ReviewID": "R3TVRNLZBQ0NVS", "Overall": "2.0", "Content": "My Vizio XVT553SV 55\" TruLed LCD HDTV came with audio problems. The audio breaks up for 20 to 30 seconds on start-up. After doing all the trouble-shooting recommended, with no success I contacted Vizio. When given the option of having a tech come to my home and repair the problem I opted for replacement. They have agreed to send a replacement. They say it will take between 8 to 13 days. Now I notice an occassional digital picture flicker with digital breakup on the lower part of the screen.(thats why I gave it only 2 stars for an otherwise magnificent picture)The TV has to be shut off and restarted to stop the flicker.", "Date": "February 10, 2011"}, {"Title": "DO NOT BUY VIZIO TVS WITH INTERNET APPS", "Author": "dk", "ReviewID": "R2H4FVR3C8SLSN", "Overall": "1.0", "Content": "I bought a vizio t.v. just over a year ago and had problems connecting to internet last night through my apps.  After contacting my dsl service provider, I figured out they were not the problem.  So, I contacted Vizio and they figured out it was the television that needed to be repaired.  Since I have had the tv just over a year, it would not be covered under warranty.  Vizio said the work would cost 301.00 to repair the t.v.  I paid almost 1600.00 when I bought my tv brand new.  Save yourself the money and trouble, and buy a tv from respected brand that has been around for a while.  You may read other reviews where people say they love their vizio.  Unfortunately, they probably have just purchased their televisions and have not had them the time I have.", "Date": "February 2, 2012"}, {"Title": "DONT BUY IT! Waste of Money!", "Author": "Yvette", "ReviewID": "RS1JK9G1WTE3A", "Overall": "1.0", "Content": "When we first got this TV it was awesome. Could not complain about it one bit. BUT just one day the TV had lines on it, we called customer service and they said it is called \"line defect\", and that there is NO way to fix it. They told me to buy a new one.  We bought the TV 13 months ago, its warranty is 12 months.  I spend two thousand dollars on the dang thing and it only lasted 13 months!! Customer service is even aware of the problem the TV has, if you buy it make sure to get an extended warranty other wise it is just a waste of money and heartache.", "Date": "July 13, 2011"}, {"Title": "Only buy if you are willing to live with issues!!!!!!!!", "Author": "Daniel", "ReviewID": "R34LZF9PUEEZ13", "Overall": "3.0", "Content": "The tv is amazing in every way......Until the first thing goes wrong, then the second, and third.  Who knows what is next.  They could be livable for the picture you get. I haven't decided yet.  So I'll lay it out for you.  First the remote stops working at least twice a week.  You have to unplug tv to fix.  Sometimes it won't load and shuts back off.  Unplug again.  Ps3 through hdmi will be rainbow wave picture for 3 and a half minutes every time you turn it on.  No solution.  Also the wifi works here and there. Customer support has been useless so far.  You can decide but I think I am going to spend some more cash on a better set.", "Date": "January 10, 2011"}, {"Title": "Cable Box HDMI issues", "Author": "Tim Guion", "ReviewID": "R12O3M0J0MXP0R", "Overall": "1.0", "Content": "Bought the VXT553SV on 1/8/11.  Connected the TV and Motorola Cable Box Model DCH6416.  The problem is switching between analog and digital/ HD channels the TV seems to get lost and displays no signal.  If you switch channels within the seem realm of analog or digital, things are fine.  But go from channel 50 (analog) to channel 505 (HD) and for a moment the TV seems to find the channel then loses it. And it's not consistent.  1 in 3 tries it works. Cable company and 2 technicians worked several hours trouble shooting.  Switched out cable boxes, HDMI cords, setting on both the TV and cable box, but no success.  We hooked up my SONY 27\" and connected it with the same cable box and HDMI cables.  No problem.  Worked flawless.  Cable company remarked they've seen a lag switching between channels and 720i and 1080I, etc on other manufacturers TV's, but nothing like this so hit and miss on the VIZIO, which often displaying no signal.  Any suggestions or recommended fixes?  If we can't get this resolved we'll have to return the TV this weekend.", "Date": "January 13, 2011"}, {"Title": "Don't waste your money or time with Vizio!", "Author": "Maggie's mommy", "ReviewID": "R39ZH1Z68KTBVG", "Overall": "1.0", "Content": "We purchased this TV at the end of November. Shortly after set up, we started having issues. Every time the TV is turned on, the screen is pink for a second or two. I have contacted customer service several times and was walked through resetting the picture and power cycling the unit. Nothing has worked. There next brilliant idea was for me to take a picture of the pink screen. They require this before they will repair/replace the unit. This is easier said then done. The screen is pink for such a short time that I am unable to get my camera to focus quick enough to snap a clear picture. Bottom line, they refuse to do anything if they don't have a photo of the problem. (I have already submitted a detailed receipt verifying the TV was just purchased). I will be returning the TV, at my expense, since I don't own a vehicle large enough to fit it in. I would not recommend this TV nor any Vizio product for that matter. I found the customer service to be rude, uneducated and completely uncooperative. They fail to realize that when I spend $1700.00 on a TV, I expect quality. Also, I wasn't blown away by the picture quality. If you see this unit in the store, you can clearly see that other TV's by Sony or Samsung, have a much better picture quality. The only drawback is, they cost a bit more. But after my experience with Vizio, clearly, you get what you pay for.At the same time we purchased this TV, we got the Vizio 5.1 surround sound home theater with wireless surround, VHT510, and had to return that as well.  The lights on the sound bar stopped working just days after set up. After viewing other reviews about that unit, I can see it is a common problem. It seems they can't make anything of quality.", "Date": "December 15, 2010"}, {"Title": "question?", "Author": "Seaborn Tay", "ReviewID": "R345WX145K8USI", "Overall": "5.0", "Content": "I'm sure there is a simple answer, but I have to ask anyway. this TV remains at $1498 at Sam's Club. Why isn't it listed as a seller on Amazon?", "Date": "December 14, 2010"}, {"Title": "Troubles", "Author": "lnk282", "ReviewID": "R1B1LVWUKPFEI9", "Overall": "1.0", "Content": "Date Ordered:  1/13/11Scheduled Delivery: 1/20/11 between 9am - 12pmDelivered:  1/20/11 10:40amAt about 9:30am on 1/20/11 I received a call from Pilot asking me if it was an upstairs apartment or not and I said yes it is. Was told he would be by around 10-10:30am. Van pulls up about 10:30 and sits out there for about 10 minutes while he waited for a coworker in another vehicle to arrive.They bring it up and push it in the living room then made me sign a piece of paper then took off. They didn't offer to take it out of the box or anything but that wasn't a big deal to me the FIRST time around. I examine the box and its in great shape. I was nervous about the delivery aspect of it all but it seemed to work out great.I remove the box and hoisted the TV to its new resting place plugging everything in. TV looks great and is now ready to go. I turn it on and up comes the setup screen...1. It asked me if it was for home or retail use. I selected home.2. It paired the remote to the TV3. It made me fill in my contact info.4. It asked for my wifi password and connected.5. It asked if I was using a cable box or not.. I selected no then it started to scan for channels then the screen went black... no menus or nothing but I could see the back-light was clearly on.Hmm.. so I wait a bit thinking perhaps this was normal but nothing came back up. I do a reset by unplugging it and holding the power button down. Turned it back on and still no menus or setup wizard. Now I'm sad. I can see the back-light clear as day and the logo was lit white.I called Vizio and explained what happened and the guy says that cant be good. He made me do another reset and try another outlet. Neither of those solutions helped. So he gave me two choices which was to have a repair man come out after I showed proof of purchase and quoted me it will take about two weeks. Or I could return it to Amazon. I said I would return it because in my mind I wanted my full 30 days to explore this television to make sure it was right for me. I've seen mixed reviews on this set from the public but more good than bad so I really wanted to give this set a fair chance.I called Amazon and explained to Amanda J. what happened and was told they would ship me out a new one today and it should arrive on 1/25/11. I was told that they would pick up the defective unit when they deliver the new one. I was also assured that once I received my new set I would still get 30 days to try it out.So that's where I'm at and is why I can only give one star.. I'm not happy at all but stuff happens I suppose.I hope they put the old set back in the box and unpack the new one for me this time around. I will update this after I receive my new set and verify that it actually works for a few days. If not then I'll just have to reconsider my choice of televisions.", "Date": "January 20, 2011"}, {"Title": "Google \"Visio TV Black Screen Of Death\" Before You Buy Visio", "Author": "Blitz", "ReviewID": "R349X5XEISRJTW", "Overall": "1.0", "Content": "I bought a Visio LCD TV from a warehouse store 3 years ago (but I do a lot of purchasing on Amazon also). The same day I got home from total knee replacement surgery the thing wouldn't come on. The light changes from Orange to white, but nothing but black on the screen. I had been planning the knee replacement some time and had spent the previous couple years accumulating things like this TV and an adjustable bed so I would be comfortable so you can Imagine my frustration.I unplugged it and all that stuff to no avail. Next step was a Google search to see if anyone had any suggestions. OMG, see for yourself, Google \"Viaio TV black screen of death\". That's right, there's a name for it affects various models and sizes.Visio's response? \"One Year Parts And Labor\" $800 repair quote.Under no circumstances would I ever purchase a Visio product again. ZERO STARSGoogle \"Visio TV Black Screen Of Death\" Before You Buy Visio", "Date": "March 7, 2012"}, {"Title": "very poor customer service; not worth risk", "Author": "Katherine Lagana \"Kat Lagana\"", "ReviewID": "R3J9R5EYKP7FTS", "Overall": "1.0", "Content": "Tv & remote worked fine for 3 months then stopped working (thus no tv). Online reviews indicated this was common. Vizio required that we show proof of purchase (even though we went through their tedious online registration process) to prove we owned the TV before they would help us. We were granted a \"favor\" of getting a new remote but warned that if the problem persisted we would need receipt even though online reviews indicated that replacement of remote did not always work. Told this was industry standard which is not true in our experience for Apple, Sony, and Bose. Highly recommend stick with Sony or other brand because Vizio support is poor.", "Date": "May 8, 2011"}, {"Title": "DO NOT BUY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Author": "Lisa S. Medina", "ReviewID": "R2DXY6T7QVFUKM", "Overall": "1.0", "Content": "I am really big on reading reviews before I make a big purchase. This TV had good ones. It is a piece of crap. We got in the TV and in 3 days it froze. I contacted Vizio and they walked me through reseting it. After that it turned on but there was a two inch thick line across the top of the screen. I didn't bother dealing with Vizio again so I called Amazon. They were great and sent me a new one. Once again the reason I say DO NOT BUY THIS TV, after 2 days every time the tv had been off for over 30 min. when you turned it on it froze and did its own reset. EVERY TIME!!!!!! After paying almost 1700.00 for a TV I want it to work correctly. We went with an LG 55LE5400 and the picture quality BLOWS THIS TV AWAY!Vizio seems to be the Kia of TVs.", "Date": "March 16, 2011"}, {"Title": "Like TV has major design issues", "Author": "keisannator", "ReviewID": "R3OEXWGEDDBOSA", "Overall": "3.0", "Content": "Well I bought this TV and first off its not 240 HZ but 120 with an electronic upscale then love the remote but come on a remote that dosent light up also it has a picture in picture function but only with an component VIDEO  source  come i only use HDMI AND FINALLY THE VOLUME JUST STOPS SHUTS OFF AND THE ONLY REMEDY IS TO TURN THE TV ON THEN OFF", "Date": "April 8, 2011"}, {"Title": "Trust your own eyes.", "Author": "chanakya", "ReviewID": "R3DEJFRF459SJ4", "Overall": "4.0", "Content": "I was almost ready to pull the trigger and i just happened to go to costco and check the TV first hand.I saw that the picture was not having the clear \"pop up\" affect as some of the other TV's like the samsungs.I thought that its just Me and that probably it perhaps needed some the calibration.I checked online and found other people mention it as well.looks like its nothing to do with calibration.Thank god that i saw the TV personally.This is the second time i was fooled by excellent reviews.Nothing can replace your own eyes when it comes to deciding what is good for you.The matte finish on the tv gives the image a dull look.so if you can compromise for the crispness to get anti glare matte finish, go for it.If you have decided to buy this TV, Do go to nearby costco and check out the picture quality wrt to other TV's before buying.", "Date": "November 25, 2010"}, {"Title": "Go look at this TV in A STORE!!", "Author": "ktnelson", "ReviewID": "REHPN6QVIQWI4", "Overall": "2.0", "Content": "All of the features listed make this TV seem like a great deal.  In fact on paper (or online) Vizios probably always looks like great deals, but don't make the same mistake I made - Don't buy unless you've seen it in person.  I purchased this TV based solely off Amazon reviews and what it seemed like I was getting for my money, but before the TV arrived I saw it in store, next to a Sony LCD and a Samsung LED.  The picture on the Vizio looked horrible in comparison.  The Sony LCD looked 10 times better than the Vizio and the Samsung was in a whole different class.  Now I know people who typically buy aren't concerned with the \"best picture available\" but this isn't close. Don't let people who already own the TV to tell you you need to fine tune all the settings to get a decent picture - that's just pathetic.  Go in to a store and look for yourself.  I can almost guarantee you purchase something else.  Needless to say I returned the Vizio and bought a Samsung.  I couldn't be more relived and satisfied.", "Date": "November 28, 2010"}, {"Title": "WiFi connectivity", "Author": "Mk", "ReviewID": "R35X6G89NKFW49", "Overall": "2.0", "Content": "I tested it at the store and connected fine to a 3G hotspot device. Does not work on a new one out of the box?  I recently went back to the store to look at how they set up their 553SV.  The store's worked fine, but it was connected to a vizio blu-ray player.Does this mean my 553SV will not connecct to wifi adhoc connections on wireless 3G hotspot devices?Best regards,Mark", "Date": "April 5, 2011"}, {"Title": "Read below - VIDEO not Supported via USB", "Author": "Timothy D. Ulmen", "ReviewID": "R22JW9TQ5SXN4S", "Overall": "3.0", "Content": "Korey = VIZIO RepA S = CustomerKorey: Thank you for contacting VIZIO Live Chat in South Dakota, my name is Korey. What can I assist you with?A S: When will video be supported in the USB ports? Its been 'coming' forever. I'd just like to know when so I can plan accordingly. OR if it just isn't coming please be honest and let us know.Korey: Here at VIZIO we pride ourselves in providing best in class customer support and all of our support is U.S. based, and I can assist you with that.Korey: Right as of now we do not have video capability on the USB ports. If we will have it I do not know.A S: \"I'm sorry I do not recall senator\"A S: So it isn't coming out. I'll pass the word on.A S: Our readers want to know and I've had lots of folks ask.Korey: Is there anything else that I can assist you with today? Any additional products you are interested in purchasing?A S: So, for now I'm telling them it is not expected in the foreseeable future.Korey: Not as of right now but maybe later we just do not have that informationA S: Why would I purchase units that are not fully supported.A S: Can you get that information? I know I'm not the only one asking.Korey: I do not have that information at this timeA S: So it isn't coming.A S: within the foreseeable future.Korey: Not as of right now no.", "Date": "January 27, 2011"}, {"Title": "What a waste of time and money", "Author": "N. Fede", "ReviewID": "R309RU9SJHFCRG", "Overall": "1.0", "Content": "Total waste of my time.  I waited all these years for a HD TV and this was a mistake. I read the bad reviews and thought well those must be old inventory. Founda package deal for samsung and passed on it cause wife thought 3D was a waste.But this was worse. I have about 8-10 hrs of veiw time on it and te picture went out. Called tech support. told me the connection was to blame. Would take 5-8 working days to get a repair man here.  No. I dont think so. Set up sucks. Superbowel looked like crap on it. And the remote is cheap.Do not buy this TV.....", "Date": "February 8, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "It has 55-inch direct type LED-backlit LCD HDTV with full 1080p HD resolution (1920 x 1080 pixels) and 240Hz refresh rate\nConnect to the Internet via built in dual-band Wi-Fi 802.11n or Ethernet to stream video, audio and news content from VIZIO Internet Apps (VIA)\nSmart Dimming intelligently controls LED blocks to produce 10,000,000:1 dynamic contrast ratio\nConnections: 5 HDMI, 1 component, 1 composite, 1 PC, 1 RF, 1 Ethernet, 1 optical digital output, 1 audio output and 3 USB\nIncludes detachable base and thumbscrew and Bluetooth remote with slide-out QWERTY keyboard", "Name": "VIZIO XVT553SV 55-Inch Class Full Array TruLED with Smart Dimming LCD HDTV 240 Hz SPS with VIZIO Internet Apps (2010 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/41upmOjytpL._SY300_.jpg", "ProductID": "B003GDHI12"}}