{"Reviews": [{"Title": "Amazing TV for the price!", "Author": "barn girl", "ReviewID": "R3ST7XQ9HL4UYR", "Overall": "5.0", "Content": "I was looking for a small TV with a digital tuner to replace my REALLY old TV whose speakers were dying and my converter box that died as well. I wasn't looking for a plat screen/HD TV or anything fancy, just a plain old tv with a tuner built in, and that was in the right price range - $100-$150. I searched all the sites/stores I could think of and I couldn't find anything bigger than a 7inch screen in that price range, until I came across this one, and I have to say it is way better than I was expecting! I don't have much to compare it to, but to me the picture quality is AMAZING, the sound is WAY better than my old one, the tuner found 31 channels (compared to my conv. box that had around 8) and it has all kinds of input/output plugs so you can basically hook anything up to it from games, computers, DVD players etc... Basically I LOVE this TV and it was only $140, including free shipping - LOVE AMAZON! Way more than I ever expected to get for that price! LOVE IT!", "Date": "December 22, 2010"}, {"Title": "Coby HDTV", "Author": "Downeaster", "ReviewID": "R1QHFO43CP0KS2", "Overall": "2.0", "Content": "This Coby HDTV is priced nicely. I bought it to replace an old type color TV in the kitchen; however, my wife requested her old, 12 inch glass-tube TV be returned to its original place in the kichen.  I must agree. The Coby HDTV does not have the color nor the sharp image I had expected. The worse characteristc of the Coby is the SOUND. It is nearly like the sound produced by a Uniden speaker phone.  I may elect to keep this TV because it makes a good house alarm, leaving it on when leaving the house, because it only consumes 30 watts.  As an alarm, I will add another star to my rating!", "Date": "October 3, 2010"}, {"Title": "Great for a small space", "Author": "Diane L Gasparian", "ReviewID": "R199IBKGTXNM7N", "Overall": "5.0", "Content": "Purchased for use in my craft room. Have mounted on the wall. Have DVD player & external speakers plugged in (sound was not bold enough for my liking) Picture very clear. Very satisfied with this television.", "Date": "November 7, 2010"}, {"Title": "Coby doesn't stand behind their product", "Author": "KarenA", "ReviewID": "R11ZNQJI2VQ6FY", "Overall": "1.0", "Content": "We replaced our kitchen tv with a 19\" Coby flat screen last fall. After 7 months, the tv is shot; loud piercing noise with colored flashing screen - and Coby says they're sorry but they only have a 90 day warranty. Too bad;so sad. We have no children in the house and do not abuse our electronics. So, take your chances with the low price; any price is too much at this point!", "Date": "May 12, 2011"}, {"Title": "good product", "Author": "steve", "ReviewID": "R1PN3YPV2OXQTW", "Overall": "4.0", "Content": "If you want a good \"bang for the buck\" this is an excellent choice (for a small TV). Excellent picture, good sound.", "Date": "November 12, 2010"}, {"Title": "Awesome for Small Rooms", "Author": "Asif E Elahi", "ReviewID": "R13WTE70OB0ZEE", "Overall": "4.0", "Content": "I was looking for a small TV for my moms room. It is the perfect one. 22\"/24\" is big for the room.received in time. without any problem.It has nice color, resolution and very smart look !!!Channel change takes a little bit more time. Should come with an antenna to watch local free channels.", "Date": "August 2, 2011"}, {"Title": "lasted a couple months", "Author": "reviewfromamom", "ReviewID": "R16N53DNUOIUEV", "Overall": "2.0", "Content": "so, i bought this tv for my daughter in feb, and just bought a new one for my son about a month ago... right after i bought his hers quit working right! grr... it shuts off w/ no warning in the middle of movies, doesnt load right, acts like theres a short in it or something, acts like even brand new dvds are scratched. its crap! i'm REALLLLLLLLY holding out hope my son's doesnt do the same thing! but after seeing other reviews, i'm pretty much expecting it to happen (btw yes they're in kid's rooms, but the kids have never touched them, they're up on a shelf in both rooms and have never been dropped/damaged)", "Date": "June 29, 2011"}, {"Title": "KEEP YOUR RECEIPT!", "Author": "Laura M. Girard \"Hlavenk\"", "ReviewID": "RJZFGVRLL4N1N", "Overall": "1.0", "Content": "I bought this TV for my son this past Christmas and it worked great for it's purpose (playing video games and watching movies) until 6 months later it wouldn't turn on at all. It had a great picture and color and no indications that it was about to mess up. Hopefully it's still under waranty so that I can get my money back! I will never buy another product made by Colby.", "Date": "May 13, 2011"}, {"Title": "Junk", "Author": "Me", "ReviewID": "RSPX9A0ENT6NV", "Overall": "1.0", "Content": "Bought this TV last year, for my RV. It lasted 7 months and then it shut itself off. Won't turn on until you leave it disconnected for a week. Blue light flickers after shutdown. Coby is realy a worthless Company.", "Date": "September 23, 2013"}, {"Title": "ok", "Author": "Smolderin' Stu", "ReviewID": "RQNR8QR9LES7D", "Overall": "3.0", "Content": "this tv is ok at best. all i can say is do your research before you buy a tv. if you are not directly in front of it the picture is distorted.", "Date": "July 14, 2013"}, {"Title": "Tv ...", "Author": "iLaneF", "ReviewID": "R1UKG7JPXGO78J", "Overall": "2.0", "Content": "At first the tv was alright. cheep but didn't expect amazing to begin with.The Speakers aren't the greatest. so much treble and not enough balance. had it for a year, then half the screen goes out. This is why i'm picky about the brands i get.", "Date": "February 9, 2013"}, {"Title": "19 in HDTV", "Author": "A. De SANTIS \"ArticFox\"", "ReviewID": "R1VE9AV816QVRM", "Overall": "5.0", "Content": "I bought this 19 in. TV for myself but gave it to my son.  His room is small with no extra space, so this TV fits very well on the wall at the end of his bed where he can watch it without being in the way of his computer or other personal effects.  He loves it!!  He says it's just the right size for a bedroom.", "Date": "December 31, 2011"}, {"Title": "TV", "Author": "cstone", "ReviewID": "R1YGEOPW0VP5KA", "Overall": "4.0", "Content": "This 19 inch Colby TV was a good deal. very nice picture . It had some scratches on it which might have been nice to know about but its on the frame of the TV not the screen so not really a big deal but it is a gift for some one so I might have bought a different one if I had known that . But the picture is very nice on this TV. overall good buy!!", "Date": "December 19, 2011"}, {"Title": "Great TV", "Author": "molmcbr", "ReviewID": "R2GN7776B5HOU2", "Overall": "4.0", "Content": "After reading the reviews, I was skeptical to purchase this TV...it is only for use in my spare bedroom so, I went ahead and bought it.  The TV works perfectly, it was easy to set up and there is absolutely nothing wrong the sound!  It was a great buy at a great price.  I would certainly recommend this product!", "Date": "May 12, 2011"}, {"Title": "It is good at this price.", "Author": "Outsider", "ReviewID": "RDII81CPPB4OD", "Overall": "4.0", "Content": "Overall it is good at this price. The signal is not good in my home, so I have to use an attnenna. I can have more chanels now.", "Date": "May 2, 2011"}, {"Title": "Great for the price", "Author": "P. Kercheval \"AJ's grandma\"", "ReviewID": "R2QTYSKW07GN11", "Overall": "5.0", "Content": "I needed an extra television for a guest room. The picture is great and it was easy to set up.", "Date": "April 17, 2011"}, {"Title": "Coby 19\" television", "Author": "Joe Ann Key", "ReviewID": "RSDPE90P43RX8", "Overall": "4.0", "Content": "This is my second Coby TV purchase.  It is great for a small TV to use in a bedroom or kitchen.  It has a great picture and good color.  I picked this product first because of the performance I received from the first one I bought and second because of the price which is hard to beat.  Great TV for the price and size.", "Date": "March 16, 2011"}, {"Title": "19in TV", "Author": "R. Collins", "ReviewID": "R1K937L30Q4O7H", "Overall": "4.0", "Content": "Great picture for the price. Speakers could be improive and placed in a different location....they sound like they are sitting in a carboard box...but I still like it.", "Date": "March 8, 2011"}, {"Title": "19\" TV", "Author": "Josh", "ReviewID": "R37AVPIULTM2HB", "Overall": "4.0", "Content": "Item is good for the price. I don't notice a sound problem like some people but the angle you're looking at the Tv matters some.  I think its worth the money and would buy it again.", "Date": "March 8, 2011"}, {"Title": "Remote does not work", "Author": "todayforyou", "ReviewID": "R10Z9UTFWSVQ8C", "Overall": "1.0", "Content": "This tv was sent to me as a replacement for one i had to leave behind.  Its the same in the appearance from my old tv but the complete opposite in quality. The stand was unsteady, the picture is fine if you are exactly in front of the tv (i like to sit on the floor but i can't with this cuz the picture goes all dark) and what the most deplorable thing is that the remote DOES NOT WORK. not even for a second. so i bought a legit universal remote which likewise didn't link to this tv.If you do make the mistake of buying this tv, know that you have to pay the coby company to send it back. buyer beware this trap.", "Date": "January 20, 2011"}, {"Title": "Love this TV for the price.", "Author": "woofNbark", "ReviewID": "R3KO6WCQGZ057P", "Overall": "4.0", "Content": "I purchased this TV when my 13\" finally stopped working.  For the price it's a nice TV.  The sound quality isn't the best but for a 2nd TV, it works for me.", "Date": "January 10, 2011"}, {"Title": "Good", "Author": "Erin M. Dietz", "ReviewID": "R1S6KH4A09ZXPC", "Overall": "4.0", "Content": "Great small TV, but I found it very hard to figure out how to hook up my DVD player to it.  Once it was set up though, its great!", "Date": "September 28, 2010"}, {"Title": "To Help or Not to Help", "Author": "Purple Army Mom", "ReviewID": "R3UK02KWSJN7J5", "Overall": "3.0", "Content": "I bought a Coby TV. The Remote didn't always work, so I replaced the Batteries. This didn't help. I called the Customer Help Dept on the Product Info. The guy was nice. He told me to send a FAX to Customer Service with the Numbers he gave me.They would probably just send a new Remote, as I was under Warranty. Not having access to a FAX Machine, I called again. The next helpful Hannah told me I had used the TV for THIRTEEN WHOLE DAYS, therefore I should take it up with Amazon...Amazon sent my TV in a timely fashion..I would use Amazon again...Coby...EEH, Maybe...Coby Customer Service, HAH!DArmy Mom Strong!****************Coby TFTV1925 19-Inch Widescreen TFT LCD 720p HDTV/Monitor with HDMI Input (Black)", "Date": "March 7, 2011"}, {"Title": "Quite a dissapointment", "Author": "elzorrocr", "ReviewID": "R2PR9KA2L56WNI", "Overall": "2.0", "Content": "So I got this monitor for Cyber Monday. I thought that by being primarily a monitor but with a TV tunner it would be cheaper. And it was; unfortunatelly it came with several issues in output audio, I hooked up a Phillips DVD via component and the colors come out really weird. Believe me, I checked all connections. Then the audio would not come out. The AV input doe not seem to be working.Haven't tried it yet as monitor but so far it's very disapointing. Good luck if you got one these.", "Date": "December 14, 2010"}, {"Title": "Coby = poor quality", "Author": "T. Davis \"TD\"", "ReviewID": "R1RI9IDMOJXBW8", "Overall": "1.0", "Content": "I got this TV as a gift.  I'm glad that I didn't pay for it because it is a poor quality TV.  The remote is the worst part... but don't lose or break it because universal remotes don't work with Coby TVs.", "Date": "November 24, 2010"}, {"Title": "my tv", "Author": "Clark", "ReviewID": "R3U8E1Y4E7TKMA", "Overall": "5.0", "Content": "The Haier is an excellent tv for it's size. Inputs in the bac k makes it seem like you are dealing with a tv that is much larger. The picture clarity is also above reproach. I'm really glad I chose this product. In closing I would also like to say that the product is very cost friendly. Sincerely Llewellyn C, McDaniels", "Date": "February 3, 2011"}, {"Title": "only lasted 18 months", "Author": "kiwikam", "ReviewID": "R2FIGWT67VG3AT", "Overall": "1.0", "Content": "Paid $300.00 for a Coby 22\" LCD HDTV with Built-In DVD Player - Black IT ONLY LASTED 18 MONTH'S. Now have to go buy a new 1 BUT NOT a COBY..", "Date": "November 4, 2010"}, {"Title": "Great Product", "Author": "M. bowen \"feboweniii\"", "ReviewID": "RS4Y97H6IXVNH", "Overall": "5.0", "Content": "I actually own the 26\".  I wasn't too sure about buying it but the price was great.  I think it is a great TV.  It has surprised me in many ways.  First I did'nt even know it was 110V/220V till my son plugged into the 220V socket and blew up the Wii but the TV survived.  Also as we live abroad it did'nt need a converter for the cable system here.  I am pretty sure it is PAL here although i did have to use a RF box to find the channel. I am sure there is a way to do it but I am not big on reading the manual.  Anyway I love this TV, the colors are great.", "Date": "March 28, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "19-Inch widescreen TFT LCD (720p) is DTV-ready with dual ATSC/NTSC tuners\nHDMI digital connection for perfect AV signal transmission, HDCP compliance for HDCP content support\nAV input jacks for use with media players, DVR/VCRs, video games, and more.  15-pin VGA interface for use with computer systems\nFull-range stereo speakers (10W) along with  Digital comb filter and noise reduction\nV-chip parental control, Closed-Caption, and Electronic Program Guide support and  Multi-language on-screen display.  Wall-mountable design (VESA 100mm x 100mm)\n15-pin VGA interface for PC input\n19 inch widescreen TFT LCD color display\n720p resolution; ATSC / NTSC\nDigital comb filter and noise reduction\nMulti-language on-screen display", "Name": "Coby TFTV1925 19-Inch 720p LCD TV", "ImgURL": "http://218.201.42.40:8080/ecx.images-amazon.com/images/I/51odpja7k2L._SY300_.jpg", "ProductID": "B0037KLEKA"}}