{"Reviews": [{"Title": "Worth the money!", "Author": "John O. Ellis \"Jack\"", "ReviewID": "R3BPBZKW4CLHE7", "Overall": "4.0", "Content": "I purchased this Samsung after returning a 2010 46\" Sony EX500.  Sony was always a standard in quality for me, but something has really gone amis in the past few years.  The television just lacked the deep black levels and crisp whites that make an impressive picture.  That aside, this model Samsung was a downgrade in screen size, but a big increase in quality.The picture is amazing.  Although there are some issues with extremely fast movement, creating \"artifacts\", the picture quality is superb.  The LED back-lighting is new in my household, so we weren't sure what to expect.  The blacks are inky, and the brights could sear eyeballs if you turn the brightness to maximum.  Compared to the Sony, changing channels is super quick and the remote control feels lighter and has a more intuitive layout.  What's interesting to me is that the picture this Samsung produces is much smoother than what I've witnessed on any other TV.  Whatever the difference their video-processing provides, I like it.  This may sounds strange, but if you stare at this Samsung, versus almost any other maker, you'll be able to recall more of what you saw in the picture.  Maybe the picture is easier on your eyes, but in the end it \"just works\".Don't expect everything to be perfect though.  In extremely fast scenes, the \"artifact\" issues are noticeable.  There is also a screen uniformity issue on my unit where the bottom right and left tend to bloom with light when the screen should be deep black and the LED back-light is on.  (Dear Samsung: if you can fix my unit, I'll up my score from FOUR stars to FIVE).Overall, I would recommend this television for consumers looking for a 3-5 year television investment.  3-D televisions are going to be the next big thing, but if you don't want to spend a fortune paying off 3-D TV makers development costs, this is the TV for you.", "Date": "March 25, 2010"}, {"Title": "Samsung Went Cheap", "Author": "Miech", "ReviewID": "R2U2B2SO0HPHR7", "Overall": "3.0", "Content": "First, let me start by saying I was lured in by Samsung's reputation from years past. They really did make some fantastic televisions and I was caught up by the hype.The number one most grating flaw of this television is caused by what has been termed the \"panel lottery\". Basically Samsung no longer produces all of the panels it uses in this model, instead outsources to different manufacturers.I ended up with a CN02 panel which is by a chineese manufacturer and is considered the bottom of the barrel and can agree. What caused me to learn of this lottery was internet research as to why my TV looked so awful compared to the ones in the stores.What really destroyed this TV for me was horrible, (AND I MEAN HORRIBLE) backlight bleeding/flashlighting. Uniformity on the CN02 panel is the worst I have ever seen on any LCD including computer monitors. I had a distinct X pattern from all 4 corners including circles ranging in diameter from a baseball to a marble scattered all throughout the image.Rather then play the lottery again since you cannot specify which panel you want inside the television, I set up an exchange through amazon which was fantastic and purchased an LG model instead which cost the same, is slightly bigger, and has many more features. Best off, the LG models seem to use one uniform IPS panel instead of these god awful CN panels samsung is trying to get away with.I'm not saying this set will be horrible for everyone. Maybe I just got horribly unlucky with a bad panel, but based on the numerous online discussions regarding samsung's quality control issues and panel lottery, i'd rather not take the chance on another.Goodbye Samsung.", "Date": "July 23, 2010"}, {"Title": "Great Thin LED-LCD TV", "Author": "James B. Wieser \"TechFun\"", "ReviewID": "RJV8TW43XS0OW", "Overall": "5.0", "Content": "Purchased this via Amazon.com and have now had for about a month.  This is a great High Definition TV(my 3rd) especially where space is a limitation.  The picture quality is excellent - very clear and the image nearly jumps off the screen. It is ultra sharp with little to no processing artifacts.  I also have a Sony BRAVIA LCD 40\" which is 2-3 years old but the picture is no where near as clear and free of artifacts as the Samsung 40\" LED-LCD and the Samsung generates less hear - i.e. uses less power.  Highly recommended in this screen size class.", "Date": "May 21, 2010"}, {"Title": "LED LCD TV overheated after only 3 months, almost caught fire filling my house with toxic smelling black smoke :(", "Author": "Nao Nao", "ReviewID": "R2KCVTABNBD5H4", "Overall": "1.0", "Content": "This LED lit LCD TV has an amazing picture.  It appeared better than it's competitors when I compared it to all the TV's at Best Buy, so I bought it from Amazon.  The honeymoon has ended and it is looking more like a nightmare.I bought this TV in August and after only THREE months of light use (12 weeks of less than ten hours a week of usage), the TV literally melted down.  I was watching it from my couch last night and the LED TV went black and randomly started clicking on and off, simultaneously the internal power supply started to meltdown and filled my house with toxic smelling black  smoke.  All this happened in less than 30 seconds.  I unplugged the TV to get it to stop melting and billowing black smoke.  Super scary.  I had to open the doors and windows for an hour when it was freezing out before my house stopped smelling.  I did some online research today and it seems that at least thousands of people have had a problem with their Samsung TV power supplies failing (that is what I assume has happened here but only a technician could confirm).  Google search for: Samsung TV power supply problems.  Also look at consumeraffairs.com and there are 125 pages of complaints.I contacted Amazon customer service and will update this review once I hear from them.  The TV started back up after cooling down however, I am afraid to plug it in because I don't want my house to burn down if it overheats again when I am out of the room or not home.Where is the Quality Control Samsung?  Why on earth would they keep putting in third party power supplies (capacitors) that fail so quick?I was fooled by the slim profile and amazing picture. Not again.", "Date": "December 13, 2010"}, {"Title": "too sharp ?", "Author": "Michael M. Yuska \"irishlitvak\"", "ReviewID": "R8GIDNSTKNR3H", "Overall": "4.0", "Content": "after some research, I bought this samsung (non-3d, non-240hz) due to the ratings and seeing it at several retail outlets. the ratings had the biggest drawback being the price ( originally $1950 ? ), so as the price tumbled it seemed a good deal. I bought it for $1259+ nj tax from best buy; bought it online and picked it up( no shipping). what jumps out at you first is the plate glass front and the thinness--very stylish tho that's secondary to performance for me.it was jarringly clear from the getgo, making ordinary shows like \"The Tudors\" look like they were filmed on videotape and not film or digital.it was actually a little distracting and I had to turn down the clarity. the most amazing attribute is that on some shows it betrays the set lighting effects. you can detect the the keylight on actors faces.my one gripe is that samsung has not as yet given purchasers any direction in customizing the settings and they NEED customization. it is left on the consumer to figure it out with no guidance about \"jutter\" or why the info box says 60hz when the specs say it should be 120hz.the calibration websites have nothing on these models yet either and the danger is that they will skip over these models and focus on the new 3D sets coming out.so after all that griping, I still wouldn't send it back despite it not being perfect, its 'imperfection\" still leaves an amazing picture, can't wait to see how the NFL games look.", "Date": "May 26, 2010"}, {"Title": "Decent TV horrible port configuration", "Author": "Hugh A. Caldwell", "ReviewID": "R1XHWOO5SZFMF2", "Overall": "4.0", "Content": "This is a decent TV but the arrangement of the HMDI ports on the back is very poor. The HDMI ports are arranged vertically along the edge of the TV and thus must make an immediate sharp bend otherwise you'll have cables visible poking out the side of the TV. This is an incredibly bad design choice as I don't know of anyone who places there A/V equipment anywhere but below their TV. It seems like the problem would be even worse if the TV was mounted on a wall. Also the stand of the TV while it look nice in the pictures makes the cables from the components visible as they run down to the components and power outlet.", "Date": "October 21, 2010"}, {"Title": "Died of common problem in 2 months", "Author": "Y. V. Narayana", "ReviewID": "R2OEI0UTGN76JZ", "Overall": "3.0", "Content": "This TV was good as long as it worked. But looks like Samsung has problem of cheap components in the power supply of LCD and LED TV's that blows away anywhere from a week to 2 years. Ours broke in 2 months and Samsung is aware of this problem for quite some time. I also couldn't see any -ve reviews about it in Amazon, but googling samsung TV problem shows that it has problems. Customer service will come home to repair it for larger than 37\" TV's. Don't buy this TV unless Samsung addresses this problem in the TV.", "Date": "October 19, 2010"}, {"Title": "Samsung HDTV40C6300", "Author": "Bear Lover", "ReviewID": "R2R0KQ4XGHATRX", "Overall": "5.0", "Content": "Very happy with my Samsung HDTV UN40C6300 LED.  Did a ton of research on various makes/models of  HDTVs. Kept coming back to this one. I monitored price changes on this product on the Amazon and other sites and was pleased with the priced I paid.  This is my only television and perfect for my needs.  I am still marveling at the super slim and stylish design.  It worked great right out of the box with my old DirecTV receiver.  The picture was clear and crisp. However I have since upgraded to a new Directv HD dish and HD receiver and there is a marked (improved) difference in the picture quality on the HD channels. I also purchased the Amazon HD cable (around $7.00)and found it to be a product comparable to other cables I researched that sell for $89.  Was also very satisfied with the delivery of my tv.  I live in a rural location and was apprehensive that an unknown delivery company would be handling my product.  But I received a phone call well in advance of my anticipated delivery date, confirming a date and time and it was delivered in a timely manner and even on a Saturday.  Thanks Amazon for another great buying experience.", "Date": "October 17, 2010"}, {"Title": "Don't watch in a dark room", "Author": "Bruce Fan", "ReviewID": "R2MYOFE3DTI0Y3", "Overall": "2.0", "Content": "I am on my second copy of this model. Great picture in daytime or normal room lighting but watch out when the lights go down! White light leaks and creeps in blooms and trails like nothing I've ever seen. I'm very disappointed as this was chosen as a bedroom TV and every dark scene looks like a white algae outbreak. I exchanged the first one hoping it was a one-off fluke. Second version exactly the same. Servie guys says hmmmm, 'that's normal'. No way.", "Date": "October 6, 2010"}, {"Title": "Amazing difference", "Author": "J. fox", "ReviewID": "R3PLLYR1611NN", "Overall": "5.0", "Content": "This TV blew me away when I first set it up (no tweaking).  I turned on some random nature show (high def of course) and it nearly looked 3D.  The color, clarity, and contrast were outstanding.  And with my PS3/blue ray player movies have that theater like quality.  Watching Avatar was actually better than the theater!!  The only issue is the sound.  However, if you are getting a TV like this you should be hooking it to surround sound!Oh yea, even the low def channels look good.", "Date": "May 22, 2010"}, {"Title": "Awesome no-frills TV", "Author": "Bob", "ReviewID": "R1W0T2FZ8ZH2L7", "Overall": "5.0", "Content": "We set out to find a simple and energy efficient 40\" HDTV with a terrific picture, and the Samsung UN40C6300 has been perfect for our needs.  We didn't want 3D and had no need for Internet apps on the TV.  For anyone who doesn't like the \"soap opera effect\" caused by the 120 Hz refresh rate (aka Auto Motion Plus), that feature can easily be turned off or adjusted.  The picture is sharp and vibrant, and we've received compliments from other HDTV owners.  Not only that, but through Amazon we got a great deal--$899 at the time--and excellent customer service following a defect issue.  When we first received our set, we noticed considerable \"blooming\" on the left side.  We also noticed that the bezel on the left side was seriously warped, which may have caused the blooming.  When reported this defect to Amazon, they immediately delivered a replacement set that is not warped and has no blooming.  We've been enjoying watching it since, and we highly recommend this model.We had considered the cheaper but highly rated Samsung LN40C630.  Ultimately we went with the more energy efficient UN40C6300, which is also sleeker and has a higher contrast ratio, and we've been very happy with our choice.  Between those two models, we felt it was really a win-win decision.", "Date": "November 17, 2010"}, {"Title": "Samsung 40\" LED TV", "Author": "Gregory A. McCarthy", "ReviewID": "RROBW0LR0HAFW", "Overall": "5.0", "Content": "The most incredible picture I have ever seen, with high definition fios cable and blu ray dvd as the sources.  What is most remarkable about the picture on this TV is the night shots.  Blacks are perfect. This TV is also very versatle, being able to connect with a computer via hdmi-dvi or by a wireless network along with  3 other hdmi connections, optical sound and components.  My only complaint is with the speakers, which are necessarily small due the the 1\" thickness of this TV and its small border.  However, that is the trade off for such a thin tv.This was a great value at Amazon.  The best part about the purchase with that company was the free shipping, a free delivery,installation and setup.", "Date": "June 24, 2010"}, {"Title": "Amazing picture..while it lasted.  Avoid at all costs. UPDATED", "Author": "Jason Torchio", "ReviewID": "R1MS1YZR0XREWD", "Overall": "2.0", "Content": "Unless you have around a $1,000 to throw away - AVOID THIS TV.  I was amazed with the picture quality for the 3 months I had it with very limited use.  It looked almost 3D.  I did notice from the get-go it made some crackling noises but I assumed it was some of the internal components heating and cooling.  Then one day it inexplicably shut itself off and came back on.  The next day when I shut it off, it started making some God awful clicking noise and that's all it did.  No picture, no sound.  Apparently this is a VERY common problem (check the internet).  I know it must be a common problem because when I called Samsung, they didn't even bother trying to run me through some of those ridiculous troubleshooting techniques that many retailers do, like \"Is it plugged in?\"  I'm now playing phone tag with the repair guy.  I'm sick to my stomach over this experience.  Fortunately, it's still under warranty but I'm afraid I have a ticking time bomb.*UPDATE*A Samsung tech came out for a service appointment.  They call to give you a 2-hour window THE MORNING OF THE APPOINTMENT.  Fortunately, my window was 5-7pm so I didn't have to take a day off from work.  A very friendly tech arrived around 6:30 and was gone before 7.  No muss, no fuss.  He removed the back of the tv and replaced 2 major components.  I was actually surprised by how little pieces go into a tv.  You could tell the tech has made this repair about a million times and could do it in his sleep.  Hopefully this is a once and done issue.  I've changed my review from 1 star to 2.  If the tv holds up and actually keeps working, I'd have no hesitation bumping it up to a 4+.", "Date": "January 19, 2011"}, {"Title": "Nice TV", "Author": "1Rare1", "ReviewID": "R235LXRLX692KS", "Overall": "4.0", "Content": "I waited all year for the price to fall on the Samsung LED models.  I think the price was around $1800 when I first saw this model.  I guess buying it for $995 was worth the wait!  The TV looks good in our kitchen.  I purchased the Ultra-Slim Low profile mount on monoprice.com.  Don't waste your money on the Samsung Hanging kit.  I initially purchased the kit for $227 but sent it back after I read the reviews for Monoprice's mounts.  Also, use those guys for all your HDMI cables. I use them along with several friends.  It is the only cables that CNET uses for testing their TV's.  Way cheaper then Monster Cables!  Don't get ripped off.The picture looks great and offers the slick low profile we wanted.  I still like my Samsung Plasma better.  I can see subtle differences in the picture especially the off angle views.  It doesn't look bad on this TV but, there is no doubt you need to be standing center or slighty off to get the best picture on the LED.  That isn't a problem on the plasma.  I adjusted a few settings after reading several recommendations on Amazon and Best Buy sites. The speakers work just fine for the ordinary person.  I have our 50\" plasma on surround sound.  If you need a small TV like this one, that doesn't serve as the primary set, the speakers are fine.  We are pleased so far.", "Date": "August 12, 2010"}, {"Title": "Defective Products, Terrible Support", "Author": "Jennifer A.", "ReviewID": "R9Q7BJIZ99V4E", "Overall": "1.0", "Content": "5 weeks after buying the TV it inexplicitly started automatically going to 100% volume and would not stop - used the remote to turn it down and it automatically went back up.  Unplugged it, waited, plugged it back in about 4 times - still doing it.  Called their support line and got someone who at least spoke English but slurred her words so much she had to repeat everything.  I had to repeat everything too because she just didn't understand that I could not use the remote for any other purpose because the TV was stuck in \"volume up\" mode.  Was given a ticket number and told service would call me to set up appointment.Service calls me and cannot come for a week.  After I push, they agree to come in 4 days.  I get home, plug TV in and it's working again.  I call to cancel appointment and customer service obviously does not speak English well and cannot understand anything I am telling her.  Makes me repeat all the information I told them the night before, even though I gave her my ticket number.  I asked what could possibly have caused the problem and she said in her halting and inadequate English that she did not know, but if it happened again I should call.Here is a reason to buy from someone with a liberal return policy.  We bought from Sears and they will only take things back the first 30 days.  We've had this for 38 days.  So now we are stuck wondering when it's going to go on the fritz again.  I have no confidence in this product or in Samsung service.", "Date": "September 28, 2010"}, {"Title": "An Amazing TV!!!!", "Author": "D.M.G \"~Brown Eyed Girl~\"", "ReviewID": "R35TTSB1HVN9IF", "Overall": "5.0", "Content": "I initially purchased this tv at Best Buy but I returned it for an LG 42inLe5400. What a mistake that was. The picture quality was bad. So bad that I wanted to return it within the hour. I didn't like the stand, it just felt cheap. I returned that as well in an exchange for a refund.I'll start at the beginning, last year when I visited my brother I noticed that his television picture was clear and picture quality was amazing. It made the movie \"the ugly truth\" look life like.So that put me on a path toward a new television. During my research I narrowed it down to an LED tv instead of the LCD. I also had two choices in mind. the LG 5300/5400 series and the Sony Bravia EX710/700 models.  When I went to the store, I could see that I didn't like the design of the tv's and also they didn't pop out at me. The Samsung UN6300 was two rows over and it was amazing. I never intended on a Samy, but I went home to do some more research and found that this was what I wanted. My criteria was 120hz, a glossy screen, perfect picture and the clear motion technology. This samy had it.Watching Tv is a whole new experience. I watched back to the future part III and wow!!! you would of thought that the movie was made only a year or two ago.So now I came back and purchased this tv on amazon for maybe 2-300 dollars less. I was gonna go for the 6500 series because it had apps but that was not really important to me. I plan on getting a new blu-ray player that has wireless features on it.Just know that you won't go wrong with this purchase.", "Date": "September 28, 2010"}, {"Title": "amazing picture quality!!!!!!!!!!!", "Author": "Thomas C. Rybak", "ReviewID": "R340EGJCZR9FZ9", "Overall": "5.0", "Content": "This TV has the clearest most detailed picture of any TV I have ever seen.  The HD is amazing. The speakers are average as everyone says. Mine is about 1 month old and the picture dims unexplainably some time...probably some power saving mode I dont know about yet..Anyway - great TV - highly recommend it!!!", "Date": "September 5, 2010"}, {"Title": "Got a bad TV - Samsung Doesn't Care", "Author": "SDD 99", "ReviewID": "R1U8MD2WYOOSFZ", "Overall": "1.0", "Content": "My TV arrived 3 weeks ago and I still haven't been able to watch it.  First something was wrong right out of the box.  The picture had \"digital distortion\" regardless what video source Blue Ray HDMI, Component DVD, Built In Tuner.Samsung wanted me to view the \"test picture\".  I went back to the TV and could not get it to stay on for more than 5 seconds.  It just cycles through the on/off process until I unplug it.Samsung will not take it back, I am still waiting for a service tech to come fix it, but now I will have less than a refurbished unit.  At least refurbishing is done by highly skilled techs in a controlled environment, not a local tech who fixes all brands in my house.I would never buy another Samsung, you get what you pay for and they are cheap.  Obviously, this is not how most televisions come or they would be out of business in less than a month.  I hope no one else has an experience like mine.", "Date": "August 26, 2010"}, {"Title": "Bought two, both have backlight leakage/blooming/banding", "Author": "C. Wolff", "ReviewID": "R3HHOG280X1FFG", "Overall": "2.0", "Content": "We have bought two of these so far, and the second one is also going back. The picture is great in daytime or normal room lighting. There is no question about that. But I don't know about you, but I hardly ever have time to watch TV during the day, and even if I had, I'd prefer watching when it's dark. It's just more emersive. However, it's no fun doing that with this TV. The backlight leaks in blooms very badly. And it does so on BOTH TVs that we've had. So I'm guessing it's the same with all of them. I wouldn't mind bright spots in the corners or just near the edge (that would require some tolerance already). But I can not stand bright patches one fourth into the screen from the left edge. And it's not even a uniformly disappearing patch. It has a dark cross shaped shadow in it, so the patch goes to black abruptly for an inch and then its there again. I'm very unhappy with it. Some people might not bother with this. But if you enjoy watching SciFi or maybe just anything with dark scenes in it, then this will ruin your experience. We exchanged the first one, thinking this can not be normal. But the second one is very much the same. I hope there is an edge lit LED TV that's better. If not, I can't understand why everybody is buying them. I think it's crap.By the way, you will have to do quite some adjustments, if you don't want all movies to look like cheap TV shows. There is an auto motion feature that will reduce background blurring. However, blurred backgrounds are something Hollywood's camera crews usually want and do it on purpose. So why does Samsung think we wouldn't want it? I don't understand. But at least you can turn it off.What you CAN'T turn off is the dimming of the backlight in darker scenes. That's their way of making deep blacks. Fine for really black pictures, but seriously, when ever is most of the picture really that black, that you wouldn't mind not having real whites? Because of course you'll loose the whites when the backlight turns down. This happens in any mode except for PC mode.I'm giving it 2 stars for the great day time picture. If I left daytime watching out it would be 1 star for me. Sorry Samsung, this is a no-go for me.", "Date": "December 28, 2010"}, {"Title": "Very nice", "Author": "J. Slaker \"OBXTrader.com\"", "ReviewID": "R13O6G0QNNLNQU", "Overall": "5.0", "Content": "This is my 3rd Samsung and I am very happy with my purchase.  The maximum size TV we could fit where we installed this TV was 40 inches and this one fills it out great.  I was surprised by how real flush this TV can mount with a flush mount bracket.  The bezel is my also most thin one yet.The TV went into a guest/family sitting area and was to be used for gaming for children and house guest use.  The area is fairly dark, so the LED format fit our needs perfectly.  We have it hooked up to our older Bose sound system, so I won't complain about it's tiny speaker.  Don't buy this TV if you want big rich sound out of a 40 inch TV.  Spend the extra money and get a sound bar along with it if that's what you are looking for.  Thinness comes at a price.", "Date": "April 13, 2011"}, {"Title": "Good product", "Author": "mac", "ReviewID": "R2JA2TF7RINK0S", "Overall": "4.0", "Content": "I bought this TV around a month back. It was for $799 at that time. Its a good product at this rate. Though it do not have built in internet capability, you have option to get it seperatly. And I believe its good for some of the people as many of us have either play station or Xbox which can be used to connect to the internet. I personally don't have one but than I connect my laptop directly to the TV using HDMI cable (You can get it under $10). You can connect your desktop as well though no one likes to put big machine near the TV. For me my laptop works best to get internet connectivity and also it saved me few hundred bucks. One can also buy blu-ray player (approx $150). In all, I would say do not go for internet TV as it will cost you more unless you have extra money to spend. You have other better options to get internet on your TV.In all its a good product at this price.", "Date": "April 8, 2011"}, {"Title": "\"hold on, let me pick my tonge off the floor so we can talk\"", "Author": "TangsooBair", "ReviewID": "R18N3AUMMSMJKF", "Overall": "5.0", "Content": "WOW! Thats all I can really think to say about this tv.  My girl and I jumped from an old 19\" tube set to this LED master peice and I'll tell ya what, it was well worth the price paid and maybe even more.  This tv is able to do everything I was looking for out of the box and even more.  When I was shopping for a set we decided that going to Best Buy and looking at them first hand would be the best way to pick one out.  Rather than look at tech specs and name brands I was concentrating on the picture quality it's self.  Walking around the store I noticed that every set I would stop to look at because of the picture quality was a Samsung.  Now I know that this model is from last year and is missing some bells and wistles from the 2011 line but almost every thing that I couldnt do with this set by comparisson I can do with my PS3. (which looks amazing on this set by the way)  Hands down the best top dollar purchase I have made in a while.  Oh, and amazon rocks!  I did not want to pay for shipping because I wanted to save some cash, so I settled on the 7-10 business shipping option.  The tv was at my door no less than 36 hours later. :) GREAT WORK AMAZON!", "Date": "March 26, 2011"}, {"Title": "Beautiful", "Author": "Bookworm", "ReviewID": "R2MLQ41EMOAIVR", "Overall": "5.0", "Content": "I did a great deal of research into sound and picture quality prior to purchasing this unit, including visiting several retail stores to compare the unit with others that were available.The picture is stunning. Compared side-by-side to some of the other units I viewed, the UN40C6300 has bright, realistic colors, not washed out or overly-enhanced (i.e., skewed toward one end of the spectrum) like some other models. The HD picture is sharp and the sound is perfect for a medium room like mine (16 x 17). I can't comment on SD picture quality since I've not watched anything in standard definition...Setup was self-explanatory, and I was able to have it up and running in less than half an hour--most of that time was spent screwing the unit to the stand. I was a bit apprehensive about the stand at first--it's made of plastic, while I'd expected something metal, but it feels solid and sturdy.The unit itself is sleek and shiny; the screen is a fingerprint magnet, so if you have curious children, do be prepared to wipe it down occasionally.All in all, I have no complaints about the system.", "Date": "March 21, 2011"}, {"Title": "And then there's LED", "Author": "Paul", "ReviewID": "R2R6T0LWT1ZTYD", "Overall": "4.0", "Content": "I was in the market for a new HDTV for a couple of years and have been biased towards plasmas from go.  I found a great deal on a Panasonic 46G25 - $700 - at my local retailer.  First, don't believe any of the sizing charts - at 10 feet, a 46 was HUGE, way too big to watch comfortably.  And it is hot; it was uncomfortable to put my hand in front of the screen for any length of time after being on for 10 minutes.  And it definitely needs a soundbar, the audio sounded like it was coming from ~4 feet behind the TV.  I returned it.No 42\" 1080p plasmas were available and it was either a Sony LCD or the Samsung LED.  I took the Samsung for the technology (and a larger price tag).I got it home and hung it on the wall - no regrets to date.  The sound is awesome, no extra speakers needed.  Movies or regular programming, the sound is great.  HD content is REALLY good; movies and regular programming is awesome.  Sports or fast action scenes are great, no blur or ghosting.  And at 10', the screen is the perfect size, no swivel head to follow an onscreen conversation.  Pair this with a Samsung bluray and you have access to great apps - netflix, vudu, and it links to your home network easily (via wired connection to your router) to play your entire audio library - it's great.  And one remote for both with HDMI connections.  Your cable remote should be able to turn everything on or off, but not navigate the menus.Now the down side: It does take some serious fiddling with the settings to not have the Soap Opera Effect (SOE), an odd effect that makes all things look like your favorite day time drama production quality - at first I thought I would be sending this one back too, but take some time and notes to lock down your settings for the best viewing.  Notes are really important because the settings don't carryover to all of your inputs; separate settings for each device input (kinda sucks repeating all of the settings).  Look to audiophiles for some good starting points for settings.  Off angle viewing is odd - at more than 40 degrees off center, everything gets oddly brighter, but at 10' from the screen, unless you leave the room, it's no problem.  SD viewing is pretty good, but there is some pixilation and screen door effect (SDE, imagine looking at some sections of the scene thru a screen door - hair is horrible for this).  SDE is normally only seen on low quality productions - talk shows, kid programs, food shows - not better productions like network dramas.And price matching is awesome, my local retailer has dropped the price 150 so far since my purchase (one week), it is cheaper than the plasma now by a couple of hundred.I would give the Samsung LED 5 stars if the apps were available on the TV itself or if SD content was better, but I am really satisfied so far.  I'll update with any performance issues as they arise.", "Date": "March 9, 2011"}, {"Title": "Probably the Best TV I have Ever Owned!", "Author": "Amazon Customer \"RevAnakin\"", "ReviewID": "R3VTN1GCBH9KRL", "Overall": "5.0", "Content": "First, I LOVE SAMSUNG.  My TV is Samsung, my phone is Samsung, many of my computer parts are Samsung.  I just find their products extremely easy to use and reliable.TV:Pros:Clarity- Amazing, comparing this to my parents 47 inch LCD JVC, this smaller 40 inch when playing blu-rays blows it out of the water.Colours:  Beautiful greens and blues really hit me like WOW! Blacks and whites are pretty true, don't really find any issues.Style- Beautiful.  The glass accents add a modern yet sophisticated touch.  The base is gorgeous, too bad I mounted the TV on the wall :)Set up: Easy peesy lemon squeezy.  I set it up in less than 10 minutes.  Took longer to get out of the box then up and running.Addressing the Backlighting: Yes, when you have the room completely black AND your brightness turned all the way up AND there is a Dark scene you can see some back light bleeding.  DOES IT BOTHER ME? HELL NO!  That is too many \"ANDs\" that can easily be fixed.  Dark room, turn down brightness and everything is beautiful.Plus research has shown florescent lights in LCDs can cause depression where LED lighting is much easier on the human eye and brain.Cons:Only one: soundI am buying a Samsung Surround sound anyways so this doesn't really matter to me.  If you want better sound, upgrade one unit to the Samsung TV with Apps.  The specs say it has better sound.  Honestly, really, doesn't matter.All-in all do I recommend it? Heck yes.  But hey if no of you reading buys this it just makes me have a more rare TV :)", "Date": "February 24, 2011"}, {"Title": "For the price, this is a great choice", "Author": "A. Blacker", "ReviewID": "R12BIUKKQQMF2N", "Overall": "3.0", "Content": "This is a very nice looking television -- thin and stylish. And it is an excellent value. Most importantly, we have found no issues what so ever with picture quality. In fact, over the air (DTV) HD programming looks phenomenal. It blows away the Directv HD quality.The first time you turn on the wizard makes it easy to get the television setup. Which is good. The TV's menu covers a lot of ground. You could spend a couple hours poking around at the various settings. Speaking of settings: one of the first things we ended up doing is turn off the dynamic contrast. For our tastes, it added way too much contrast, making many shows look like they were shot with a cheesy camcorder.We found an unexpected (and cool) feature when we plugged an Ethernet cable into the television: It automatically found the shares on our home NAS. This allows us to access the movie files (.mpg's) stored on the network and play them directly through the TV. You can also view pictures and play audio.Now the un-good parts (none of which are show stoppers)1. The built-in speakers are tinny and hard to listen to. When the entire television is only 1 inch thick, you shouldn't expect top-notch speakers. The upshot is that external speakers are almost a requirement.2. After 1 month, a stress fracture appeared in the corner of the bezel. It is cosmetic, but irritating since it is a new TV. We contacted Samsung about this only to find out that it is not covered by the warranty. From their site: \"Physical damage (such as scratches or cracks) is not covered by your Samsung warranty. You will be charged for both parts and labor. We recommend you get an estimate of the cost before you proceed with the replacement.\" We're not going to pay to have a manufacturing defect repaired. It will server as a constant reminder of their sucky warranty.All said, we are pleased with this television and would absolutely purchase another.", "Date": "January 24, 2011"}, {"Title": "Mostly Positive", "Author": "Frank", "ReviewID": "R2MQPXCLVA22SX", "Overall": "4.0", "Content": "For the most part I feel this is a solid LED TV. I got it for a fare price which makes it that much better. The Picture quality is great. Its images are very clear and the colors are rich. The Motion plus feature really does help. I used that and turned the smoothness up for a hockey game and it was amazing. The game mode is also a nice feature. However, I find that the movie mode works better with certain games, like Uncharted Drake's Fortune. I can't comment on the sound quality because I use external speakers, which I do suggest because no TV can match true surround sound. Now, my only issue with this TV is the back light. When I'm watching dark scenes it shows through in all four corners which can get pretty annoying. Also, there is a very light white blur in the middle of the screen during very very dark scenes which I also believe is the back light, but I wouldn't let it stop you from getting this because you most likely won't notice it. I just called Samsung today to try and fix the issue and they are sending a tech to my house later this week. Hopefully they fix it. Even if they don't I will keep the TV. For $800 it's by far the best TV.", "Date": "January 16, 2011"}, {"Title": "Entry level LED-LCD", "Author": "derek", "ReviewID": "R38OZOVKXMEEFE", "Overall": "4.0", "Content": "The Samsung UN40C6300 is the entry level LED tv by Samsung.  It is a basic set that offers smooth flowing pictures with great clarity.  Setup of the TV is a relative breeze and it was up in running within a matter of 10 minutes.  This is a very basic set that does not offer internet applications as Samsung's big brother models.  Its super thin and we have ours mounted in our workout room.  Overall if you can get the TV for under 700 US dollars it is worth its price.", "Date": "December 30, 2010"}, {"Title": "The good and the bad.", "Author": "E. Haag \"Rode hard. Put up wet.\"", "ReviewID": "RTB404TCBO02T", "Overall": "5.0", "Content": "First, the good: This TV has really beautiful colors. Last Xmas I bought a Sony XBR9 for the downstairs family room. This year I bought the Samsung 6300 for the upstairs family room. We live in a remote area so both use DirecTv HD receivers as the TV input. I also got the Sony BD-570 for this TV and it is stunning with very vibrant colors. I didn't touch the settings on this TV. It's really very good right out of the box. With the XBR9 we use a Sony DVD player as well. It may not be a fair comparison, but it's what we have, and the Samsung is a noticeable step up in quality of display. The 4 HDMI slots were perfect. One for the TV receiver, one for the BD player, one for the stereo receiver, and one - gotta love this - for a Samsung DVD/VHS player. My wife just would not give up on all the VHS tapes we have. It is a bit redundant to have two DVD players - one that doesn't support BDs but up scales everything else and a true BD player. But hey, my wife is happy so life is good. ;-) BTW, the Samsung DVD - the one with the VHS and doesn't play BDs - does a very good job on the older non-BD DVDs. Much better than the Sony we have downstairs. So go figure. And the cabling upstairs is now on par with downstairs. That is, MUCH simplified.This is a great TV at a great price. Simple to set up. Easy to connect other devices. All in all: 5 stars.Second, the bad: This has nothing to do with the TV and everything to do with Amazon's contracted delivery people. Yes, we live 15 miles from the nearest place to get a gallon of milk, and 30 miles from the nearest big box electronics store. But still....we were given a 6 day window for delivery. My inquiries to try and close that time went unanswered. We cannot sit at home for six days awaiting delivery. My wife found the TV in the driveway the first day of that window, 200 feet from the house - we have a long driveway. It was 15 degrees and snowing at the time. We watched the Amazon online tracking of this TV to try and gauge it's arrival. One day it was in CA, the next day in our driveway. Gotta do better than that Amazon or we'll have seriously consider not ordering expensive items through this site.On a positive note, we have ordered many things through Amazon over the years - books, gifts, etc., but nothing this expensive and all those other orders, and delivery, was flawless.Merry Christmas everyone. Love the Samsung 6300!!!", "Date": "December 26, 2010"}, {"Title": "Very happy so far", "Author": "Nuwanda", "ReviewID": "RQQXYA2SWCW3K", "Overall": "4.0", "Content": "I've been using it for a week and a half, and so far, so good.The image looks beautiful, although I couldn't really compare it to other makes of models.It supports 1080p MKV video files with every codec that I tried: H.264, AAC, AC3, DTS...DLNA works great using the software from Samsung. For those that don't know what it is: It reads video files from your PC or other DLNA server like it does with flash drives, with the exception that it doesn't support rewinding and fast forwarding. It supports \"stepping\" though (jump 10 seconds forward or backwards), which is not as good (every jump takes time), but for me, it's good enough. If you leave the button pressed, it performs several jumps at once, effectively replicating the rewind/fast forward functionality, though not as \"nice\" to use.The only drawbacks that I noticed:1) Other TV's do support rewind/fast forward over DLNA. Why not this one?2) It only supports the FAT, FAT32 and NTFS filesystems for flash drives. exFAT support would be good to read video files of more than 4 GB without having to format the drive using NTFS (writing NTFS flash drives hinders performance on Windows 7).3) Doesn't support subtitles embedded in MKV files, you need to extract them to a separate SRT file using mkvextract.Update: Support for non-perfect video files is not good, since it completely stops playback after what seems to be an error in the file. My Sony blu-ray player just skips a few seconds and continues playing.", "Date": "October 31, 2011"}, {"Title": "Love this TV!", "Author": "bmbutler \"bmbutler\"", "ReviewID": "RCIDVMLVWLO99", "Overall": "5.0", "Content": "Purchased this TV last week and it arrived on Friday.  Could not wait to hang it on the same mount as current TV.  Samsung uses a different configuration on the back of their TVs so my existing mount would not work.  Bought a Cheetah mount and hung it myself.  Beautiful and awesome TV.  It looks like you can go up and touch the person on the screen - even a 1950-1960's Cary Grant movie.  Only wish it had built in internet capability.  But I have a Panasonic Blu-Ray with wireless adapter so not really needed.  Very easy to setup.", "Date": "April 19, 2011"}, {"Title": "Samsung LED rocks", "Author": "Mike A.", "ReviewID": "R1NIWUN1QOQL67", "Overall": "5.0", "Content": "This Samsung LED exceeded my expectation for clarity of picture.  Easy set up.  Even my wife who questioned why I wanted to upgrade is amazed bt the picture.  40\" 6300 is a great model.  I replaced my 2002 Samsung HD which weighed 100LB+.  I also upgraded my 15 year old Yamaha receiver leaving speakers in place.  Very easy to set up and sound quality also is noticable from all speakers including rear.  Hooked everything thru receiver to Samsung and all devices work great.  Cable, Blueray, Roku, CD, etc.Don't wait.  Buy this Samsung 6300", "Date": "April 18, 2011"}, {"Title": "Samsung UN40C6300 - Great THIN TV!", "Author": "KeriJane \"Keri\"", "ReviewID": "R1U1U05XYM3O5N", "Overall": "5.0", "Content": "I bought the Samsung UN40C6300 40\" LED LCD TV last year as an upgrade from my previous superb Samsung 32\" LCD TV.This TV has an astonishingly sharp, clear and vivid picture, it turns on quickly, the onscreen channel indicator is easy to see, the remote is wonderful and...It's THIN! Wow is it thin. It's like an inch and a bit thick. Completely unobtrusive when off, It looks fantastic with low-profile wall mounts.It's a decorators dream come true. People have asked me where my TV set is until I turn it on... and then wow! It has been mistaken for a fireplace when playing a fireside BluRay.The big disadvantage is the sound. The completely hidden down-facing speakers sound as thin as this TV is. It's really meant for an external sound system of some kind.A minor disadvantage is the set-mounted touch controls. They're there, but so unobtrusive as to be unusable. As stylish as this TV is, I prefer it this way as control markings would detract from the stunning appearance.Having lived with this TV for several months, my only regret is not getting the 46\" version of this set. Coupled with external speakers/subwoofer it's perfect!", "Date": "March 15, 2011"}, {"Title": "Great buy", "Author": "Deppmaniac", "ReviewID": "R309VRNGLLJJ2K", "Overall": "4.0", "Content": "I shopped around quite a bit for a good LED/LCD tv and found that Samsung tv's had better picture quality than other brands.  I have my tv wirelessly connected to the home network and get to enjoy pics, movies right off my computer.  The sound quality is also good.  The tv was very easy to assemble on the stand.  The menu is very easy to understand.", "Date": "March 9, 2011"}, {"Title": "Samsung 6300 tv", "Author": "Carolyn Holmes", "ReviewID": "R2KJBZDMDULDEP", "Overall": "5.0", "Content": "bought this product from amazon at a good price picture is beautiful very clear .traded a vizio 37 in for this and the difference is amazing. only problem was samsung didnt put the screws for the stand in box had to wait 7 days before i could use it. recommend this tv highly and amazons price cant be beat", "Date": "March 8, 2011"}, {"Title": "Best TV in it's class", "Author": "Forrest", "ReviewID": "R29AHAJGRMWKRY", "Overall": "5.0", "Content": "I have had this tv for a couple of weeks now and I couldn't be more satisfied. Its ability to link to my home network and play-on is probably more valuable then if I had sprung for the internet streaming model of the same tv.", "Date": "February 26, 2011"}, {"Title": "LED TV", "Author": "bub", "ReviewID": "R3DQI1WGEUONVW", "Overall": "5.0", "Content": "Wanted a TV for our den and was amazingly surprised how much clearer and sharper the picture is on this 40\"Samsung LED TV(C6300) compared to our 46\"LCD Samsung TV purchased last year which is in our family room.LED is definetly the way to go.", "Date": "January 14, 2011"}, {"Title": "good tv but will not buy a Tv from Amazon again", "Author": "Hippy", "ReviewID": "R111BXZCQWCYGR", "Overall": "4.0", "Content": "picture and sound are great.  Overall TV is great.  One problem that I have is with Amazon.  They said that they will do a price match but when I tried to do it, they said it wasn't a valid website (paultv.com) which is stupid since lots of people buy tv from that site and it also has a store down in LA.", "Date": "January 5, 2011"}, {"Title": "Great purchase", "Author": "cld_forest", "ReviewID": "R24CN6C6FGW2ZR", "Overall": "4.0", "Content": "Great TV. I love the picuture. The only negative I feel is the sound quality.", "Date": "September 21, 2010"}, {"Title": "Hotness", "Author": "Eddie", "ReviewID": "R3ICPPHMU8YVYL", "Overall": "4.0", "Content": "I have now owned my Samsung LED for almost a year and I have nothing bad to say about this TV.A year ago when I was ready to purchase a new TV for my bedroom, I had a few brands in mind that I wanted to check out (Sharp-Aquos-line, Sony, and Samsung). Initially I was thinking of getting an LCD because I assumed that since the LED was a newer technology that it would cost more. To my surprise, Amazon had an amazing deal on this 40\" LED TV (just over 50% off). I thought, \"how could this TV be this cheap? It has good specs and the model was almost brand new). I took a chance (since there were very little reviews on this set). I received this TV in 2 days (Arizona to Boston), wow!There were a few negative feedbacks regarding the low-volume control(s) but I didn't have any issues with that, everything was great: Thin & lightweight, multiple HDMIs hookups, 120 HZ, and a top-notch brand.My only thing (now) is that I wish it had apps pre-installed, but its not a big issue since I can hookup my computer.", "Date": "November 18, 2011"}, {"Title": "I love Samsung TV's", "Author": "Christopher Weger", "ReviewID": "R3OCBWS8UZH7JC", "Overall": "5.0", "Content": "I bought this particular model because I dont need the apps and didnt want 3D (already have it on the living room tv). this TV is very sharp. i have HDMI 1.4 cables hooked up to my Directv HDR unit and its never looked better. I'm very happy with this upgrade. Plenty of HDMI ports and just enough component for my Wii.I have a Samsung plasma in my living room, and this is really close to the clarity and sharpness of the plasma.Sound quality could be better, but i'm ok with it. you just have to mess around with the settings to get it where you want it. They are TV speakers so I wasnt expecting perfect 7.1 surround! The picture was what mattered to me anyway. There is always room for speakers on a shelf.Either way, this TV is a great choice if you are looking for a good quality, sharp TV.I also looked at Sony as an alternative. Ultimately, I stuck with the brand i know and have.", "Date": "August 9, 2011"}, {"Title": "I'm very happy with it - but not an electronic geek", "Author": "carole", "ReviewID": "R3QL9KYF9XEOOX", "Overall": "5.0", "Content": "As just an average tv person, not into gaming, just want to watch it for tv or movies, we have been VERY happy with this SAMSUNG LED Hi Def TV.  Bought this back before Christmas & agonized over all the selections available. Understand this, we were watching on an old Mitsubishi 55\" projection tv, circa 1995! Finally decided to join the 21st century - but were overwhelmed with all the makers, models, options, choices.  Went to brick & mortar stores to physically look, and of almost all the makes displayed, Samsung impressed us the most for clarity, definition, movement not being blurred, and the color was the most realistic - blues were blue, reds - red, etc. The whites were almost blindingly white.  Couldn't beat the price online, we saved over $150 over the best sales prices from some of the so called \"our price won't be beat\" stores, this was after Thanksgiving prices.  And there was no sales tax AND free shipping - Sears wanted to charge us $70 to deliver on top of a higher price overall.  The TV came in just a few days, delivered in pristine shape, by UPS. I was a little concerned about setting it up - we have Direct TV, living out in the country without cable. We didn't have HD set up, so we had to get that done by Direct TV.  This Samsung TV was a breeze to set UP, we had it hooked up in just a few minutes, watching incredible tv then and there.  Couldn't have been easier.  I don't understand folks who claim they have to go online & download things, unless it's for gaming? This is now June, we are STILL very very happy with this tv.  We have ZERO complaints. But, we don't do video games - so I can't speak to that.  If you want the just about the best tv for just that, with the best color & clarity and a great price - I urge you to seriously consider Samsung.", "Date": "June 13, 2011"}, {"Title": "Beautiful picture, fair to middling viewing angles, odd audio...", "Author": "J. Nichols \"nicho114\"", "ReviewID": "RB8O6FNQYXFWS", "Overall": "4.0", "Content": "A. PictureIn a previous review, it was mentioned that this panel produces almost 3-D quality imagees.  I can't deny this.  Even a hi-def television signal is gorgeous to behold, if woefully flat.  The only problem that I notice is in panel-judged scaling of smaller images.  I run my television as a second monitor off of my computer, so that Blu-ray format movies can be viewed on a freakishly large screen.  At first, I allowed the panel to defer to Samsung's post-processing algorithms.  This was a BAD decision.  When I reverted to all video processing going through my Gigabyte HD 6950, video went from disappointingly pixelated and color-distorted to crystal-clear and accurate.  The problem isn't Samsung's panel...  It's their processor.  Even in over-the-air signals, problems with color and aspect ratio only occur with commercials obviously meant for lower-definition monitors.  I wouldn't buy this TV if it's to be a stand-alone appliance, rather than a monitor.  But as a monitor, it is a faithful slave.B. Viewing AnglesEverybody's right.  Look straight on, or at a slight deviation thereof.  More than 45 degrees, and you'll be seeing snow-white LCD glow.  It's still better than my previous florescent-driven LCD hi-def television now in the bedroom doing sleep-timer service for one hour a day, and the color is truer as well.C. Odd audio...So.  Let's be frank.  If you're listening to a movie in a small room above 80 decibels, you're a very average person, and you deserve the sound system foisted on you by Corporate America.  I tend to listen to music at reference levels, sometimes below.  I'm very sensitive to sound.  There is distortion when one turns the volume up on this set...  But 10 Watt speakers are relatively powerful!  With the sound at 10 of 100, I take care of most of my needs, regardless of the 10% of internet video encoded poorly.  Music, when played at a low volume level, is adequately rendered by the included speakers on this set.  If you must listen to bad dance-club remixes at 100% volume, I don't feel sorry for your loathing of this audio solution.  There IS distortion at very low levels on heavy bass reproduction, but I don't really care for poorly boosted bass, either.  If you don't like the audio, I get it, but your ears ARE going bad already.", "Date": "May 25, 2011"}, {"Title": "Samsung LED 40\"", "Author": "little z", "ReviewID": "R26LX0JKRUWMOB", "Overall": "4.0", "Content": "handsome design, good quality picture and sound is good enough, I do not use external speakers.  Set up is easyI think its a good value for the money", "Date": "April 8, 2011"}, {"Title": "What did you say?", "Author": "Muskie", "ReviewID": "R97VZC4E7ODTJ", "Overall": "4.0", "Content": "I love the TV, except you would think that when you spend this kind of money, more thought would have been put into the sound system. This a total flaw. If you love good sound to go with great video, better have a separate sound system. Picture clarity is amazing.", "Date": "March 14, 2011"}, {"Title": "Very nice TV", "Author": "Dr. Wirth", "ReviewID": "R2BR1RI9TVOTIJ", "Overall": "4.0", "Content": "We have had this tv for a couple of weeks and we have been very impressed so far. The picture quality is great and the depth of the color is amazing. We really like that there are several settings for color and contrast balance. The speaker quality is not great, so I would recommend having other speakers. We have extra speakers, but ours plug in to the headphone jack and the tv will not adjust the volume, so that is a little obnoxious. The other complaint we have is that some times the response time for the tv lags a bit. It takes a few minutes to turn on and also a few minutes to recover if it cannot find a signal (we do not have cable, so we use broadcast signals.) Other than those minor issues, we are very happy with the tv and feel that it is one of the best deals on a tv, especially LED tvs!", "Date": "January 30, 2011"}, {"Title": "Look no further", "Author": "Michael J. Solomon", "ReviewID": "R2CFMHMJWL4W5U", "Overall": "5.0", "Content": "I get my reception on an antenna, I receive pure air waves, not compressed and then expanded as cable viewers do. I do not get \"inkys or blooms\" like some of the reviewers. Perhaps they should consider their source.To weed out the good from the bad, I went to Walmart to compare. This Samsung was by far the best model of all the brands.The sound is the same as on any television. If I want superior sound, Samsung sells a soundbar.The clarity, sharpness and features of this LED are superb. The tuner allows me 13 channels with an indoor antenna. Towers are about 30 miles away.Amazon did its job, the television was delivered on the day promised. Set up was easy.My only concern is that the TV is so light in weight, until I get it mounted on the wall, I am afraid the dog will walk by and knock it off the stand.Take this review for what it is worth, I did my homework. If you buy a Vizio, Sony or LG, you are buying an inferior product. I could not be happier with my purchase.", "Date": "January 30, 2011"}, {"Title": "Samsung 40\" LED TV", "Author": "J. Pearson", "ReviewID": "R2UC611WEHP4I7", "Overall": "4.0", "Content": "Very Good TV. One somewhat minor imperfection, but still annoying to me, is when switching channels. There is a snippet of audio that comes on from the selected channel before the actual channel comes on and that can take anywhere from 1 to 3 seconds. I must admit though. It may not be the TV's fault. I have a Comcast HD box that feeds the signal to the TV. There is no way I can test which is causing it. So in all fairness to Samsung they make a great LED TV.", "Date": "January 24, 2011"}, {"Title": "Fantastic TV!", "Author": "TornadoShanks", "ReviewID": "R75L7AH202QJ", "Overall": "5.0", "Content": "This TV fit perfectly for my needs. If you need your TV to have 3D or Internet apps, you'll have to look elsewhere. But, if you don't buy into the 3D trend and have other ways of connecting your TV online (360/blu ray player), and you want a nice looking TV for a great price, this is an excellent option.", "Date": "January 15, 2011"}, {"Title": "Awewsome TV", "Author": "Marsha E. Gilmore", "ReviewID": "R2STXSU1XZ7XXM", "Overall": "5.0", "Content": "This TV has an amazing picture.  Even before I got my HD service, the picture was excellent.  Upon getting HD service, the picture became awesome.  I enjoy watching alot of sports and this TV increased my enjoyment 100%.", "Date": "January 14, 2011"}, {"Title": "Awesome picture quality and works as expected!", "Author": "vermaraman", "ReviewID": "RJG1CZGSB38J1", "Overall": "5.0", "Content": "I remember myself standing in front of LCD and LED TVs for a long time in the store before I decided to pick this one. And it didnt disappoint me. Easy to assemble and working right out of the box with comcast HD showing a lot of enhancement over my previous CRT TV + SD reception. Connected great with my LG blu ray to show 1080 content.Audio is ok and I connect my 5.1 sony receiver for my entertainment. Tried playing wii and it works just great. Dims in dark automatically to reduce the glare. I also tried connecting a HDD to USB port and I was able to play different video formats very easily. Yet to try the internet connection for this TV.Some concerns -1. Cant use my comcast remote to work with this TV. Now I have remotes lying around - may be time to buy a Harmony remote!2. Need to get used to Movie watching on blu-ray HD. Its very different experience and I didnt like certain movies on blu-ray. Guess, I need to do some settings work. Planet earth, movies on TV, and animation movies --- all look awesome", "Date": "December 28, 2010"}, {"Title": "Samsung LED Picture", "Author": "Sappa", "ReviewID": "R2O3NQQSNBZ1AX", "Overall": "5.0", "Content": "Most programs aren't televised in the quality this TV can handle.  When you do find a program, it's incredible to see the quality of picture this Samsung produces.  So far I've had it installed for about a month and, so far it has lived up to the high standards I want in an HDTV.  I haven't seen another brand that has the quality picture I am receiving.  It's easy to use and I like the MENU feature and the ease that it works.", "Date": "November 29, 2010"}, {"Title": "Great shopping experience and Great TV Performance", "Author": "HeusOne", "ReviewID": "R55RK0H3KTRZS", "Overall": "5.0", "Content": "Great shopping experience buying this TV from Amazon.  Unit delivered fast after ordered.  Free white glove delivery was fantastic.  TV delivered to second floor and completely set up.  The TV picture is fantastic.  The next TV I purchase will be via Amazon.", "Date": "November 17, 2010"}, {"Title": "Excellent TV", "Author": "Thom Tucker \"consuuuumer\"", "ReviewID": "R3J6X6CNI7W83H", "Overall": "5.0", "Content": "I wanted a tv based only on its picture quality. This Samsung TV has a outstanding picture quality.  Deep color, almost liquid blacks. Sharp clear contrast.I have been checking out different brands for about a month. This is the best I have seen. I am completely satisfied with purchase I made. The shipping was super fast and free. No problems.", "Date": "October 31, 2010"}, {"Title": "great TV", "Author": "stanley", "ReviewID": "R23BVIRRE2ATOW", "Overall": "5.0", "Content": "I bought this Open Item TV. The first TV I got had a small defect with the screen, so Amazon quickly send me a replacement, after I ordered another. Love this TV, especially for the price", "Date": "September 25, 2010"}, {"Title": "Sharp Image", "Author": "FirstLED", "ReviewID": "RT5OZBETFL36O", "Overall": "4.0", "Content": "I evaluated several models of Samsung and Sony but finally purchased this LED model. The price point was good but was surprised with the clarity and sharpness without over driving the gain levels.  The only noteworthy issue is the sound quality. Probably common for digital TV but its too tinny and lacks bass and midrange outputs.", "Date": "July 15, 2010"}, {"Title": "great tv for a great price.", "Author": "orical", "ReviewID": "R3S37BI90ZK9VR", "Overall": "5.0", "Content": "I work for a large cable company so I see a lot of tvs. This one is one of the very best. Great all around.", "Date": "May 30, 2011"}, {"Title": "Prior ratings by others were Right - It's a great buy!", "Author": "JW", "ReviewID": "R1P9KN4G9C4876", "Overall": "5.0", "Content": "Bought this 40\" Samsung LED for my son as a Christmas gift.  I own two other Samsung LED's and each one has been absolutely beautiful (Color, brightness, clarity).  Samsung has come a long way and these LED's are Diamonds.", "Date": "January 18, 2011"}, {"Title": "First Timer", "Author": "Indianjmsr", "ReviewID": "RL1VDHX8C1UEI", "Overall": "4.0", "Content": "First time buyer/upgrader of TV. Boy am wondering now why I haven't done so earlier. O-yell the price is now affordable than ever thru Amazon. Picture, Sound, Set up features are great and real simple to follow. Just plug-in and go. EVEN GO WIRELESS!!! As stated first time buyer/upgrader all new and all fantastic. Glad I waited. One thing would change to give it 5star rating. The Holder-TV tie down should be part of box. Ex; review and research this exact same product in to other places ie; Sears and Best Buy. If you but this same exact same product from them you will get the tie down yes the mark up cost in these stores are higher. But not due to the tie is TV holder(tiedown). This is confirmed because when you call to purchase one the price does not justify the markup price. The explanation Samsung gives(it depends on the what brand you purchased). Well unfortunately the brand is the exact same one, letter per letter-number per number. Just being sent to you from someone's store when you purchase it from Amazon...HOWEVER DON'T LET THIS CHANGE YOUR MIND BY FAR IT'S THE BEST INVESTMENT SO FAR I'VE MADE.", "Date": "January 16, 2011"}, {"Title": "Samsung UN40C6300 40\" LED TV", "Author": "TazzD", "ReviewID": "R2WZF57ZS0L5DU", "Overall": "5.0", "Content": "Purchased Samsung UN40C6300 40\" LED TV from Amazon about a month ago to replace a Toshiba 40\" LCD which prematurely kicked the bucket.  This Samsung has the best picture I have ever seen. Even 4:3 broadcasts look good.  High-Def & Blue Ray are simply amazing.  Highly recommend this TV.", "Date": "October 19, 2010"}, {"Title": "Great Picture", "Author": "Chris", "ReviewID": "RCQGF4C6RYF5T", "Overall": "5.0", "Content": "This is a great LED TV for the price. I was thinking about buying a LED TV as a replacement to my old LN630 and my budget was around 1000. So I didn't go for any high-end Samsung models. I am glad that I found this TV and bought this. The picture is crystal clear. It is working really well with my PS3 and Wii, and so far I don't have any issues.If you are not looking for 3D capabilities, I would highly recommend this TV.", "Date": "July 30, 2010"}, {"Title": "Great TV", "Author": "Bee", "ReviewID": "R2F3RLQTZ562KH", "Overall": "5.0", "Content": "We purchased the Samsung UN40C6300 in May of 2010 and really love it. We added HD to that TV, so the picture quality is even better.  Delivery of the tv came as scheduled. Great price and Great service.", "Date": "July 26, 2010"}, {"Title": "NO KIDDING", "Author": "goodnumber8", "ReviewID": "R1UE75J0OMAOPN", "Overall": "3.0", "Content": "The UN40C6300 worked wonderful for 49 days (no adjustments needed). Color crisp, sound sharp, motion accurate. The TV I bought was refurbished. On the 49th day the sound went. It sounded like an electrical buzzing or frying. The sound came back but the picture now has an influx. Dark colors bleed into each other.  Reds and blues on the black background are illuminated, distorting the picture. I say it's okay because for 49 days it was.", "Date": "April 28, 2013"}, {"Title": "Great TV", "Author": "Bob-Cobb", "ReviewID": "R395CDK8VFNMDJ", "Overall": "4.0", "Content": "Gave it a four because of the cracking noise when you turn it off.  Awesome TV.  Had it for 2+ years and no problems.  Great picture, solid sound.  Obviously thin.  Only thing is that when you turn it off, the screen case makes a cracking or snapping noise.  Called Samsung and they said it's normal and is due to the heating of the outer plastic from the TV.  So if it's in your bedroom you'll take some time to get used to it.  Not a huge deal but it's annoying.", "Date": "March 14, 2013"}, {"Title": "Great picture, sound is low", "Author": "Megan E. L. Spangler", "ReviewID": "R2KJYKGBDVU3HR", "Overall": "4.0", "Content": "Great picture. I can't seem to turn it up enough to hear it well at times... which is what I knew from previous reviews about Samsungs. Overall pretty happy with it especially since it was a good deal at the time.", "Date": "January 12, 2013"}, {"Title": "Buy Samsung at your own risk!", "Author": "West Texas", "ReviewID": "RPLLHT40IV5UE", "Overall": "1.0", "Content": "I bought this TV new in 10/2010. This was a fantastic TV for 2 years and 1 month, not much reliability for $1067. While watching, it turned off and started the dreaded click, click, click, or pop, pop, pop, whichever you prefer. If you type in \"Samsung power supply problems\" it shows up like a rash and even one class action lawsuit which spread over several years and numerous models, there's even youtube videos showing you how to replace the capacitors in the power supply before Samsung was forced to step up. I guess it might be time for another. This set has always been on a quality surge suppressor and satellite receiver, yes, I know about joules, clamping voltage, response time and all of that stuff. I've contacted Samsung, I'll wait to here from them and see if they will do the right thing. In the mean time, I suggest you look at other brands and if you have a Samsung with a power supply problem contact your state attorney general. If they get enough complaints about the same thing they will put a little more muscle behind this obvious problem Samsung has yet to correct.", "Date": "November 17, 2012"}, {"Title": "It's a good TV", "Author": "Peter Heide", "ReviewID": "ROYNJAACVOQHS", "Overall": "4.0", "Content": "We've used this TV for a little over a year with no problems. The picture is very good, and doesn't suffer from the color and contrast problems noticed with the Sony WEGA it replaced. I don't find myself futzing with the colors (as I did with the Sony) because this DVD is too dark, or that cable station is too red.As others have noted, the built-in speakers are pretty tinny. Dialog can sometimes be hard to hear unless it's turned up pretty loud. We typically run audio through a receiver and 7.1 system, so this isn't a big deal for us.The power \"button\" is a little touch-activated sensor on the front bezel. It is physically indistinct from the rest of the bezel, and can be tough to find in the dark. Sure, you can turn it off with the remote, but you're on your way to bed and it's over there on the coffee table and would it really have killed Samsung to put a little a bump where you're supposed to touch the thing?", "Date": "February 28, 2012"}, {"Title": "Winner LED Television", "Author": "Jazzie Girl", "ReviewID": "R1VSYIND4NQQA", "Overall": "5.0", "Content": "Since we already had a larger Samsung LED TV we already knew that we would like a smaller version for our workout room.  The 40-inch size is perfect for the room it's in, plus it definitely has superior picture and sound quality.  Having done thorough research to find a television that was state-of-art and had consistently great reviews, we felt very confident that Samsung would deliver everything we wanted -- and it has.  The set arrived quickly and in perfect condition.  Set up couldn't have been easier!  We love the new set and it really makes our workouts more enjoyable!!  Thank you, Amazon, for your great service and reliability!!", "Date": "January 26, 2012"}, {"Title": "Great TV - Great price", "Author": "anybody can relate", "ReviewID": "RZSSKTSME1D2A", "Overall": "5.0", "Content": "I'm very happy with this TV.  Purchased from Amazon Dec 2010 when price dropped to $785.  It's been working fine now for a year.  I love the thin profile and great picture.  The sound is fine for basic TV viewing which is pretty amazing given how thin this set is.  I have a Roku box hooked up for viewing movies from Netflix and it works fine.  I don't use it for gaming or internet so I can't speak to that stuff.", "Date": "January 1, 2012"}, {"Title": "Exactly as advertised", "Author": "Melissa M.", "ReviewID": "R3J51PB42971R2", "Overall": "5.0", "Content": "This is my family's first flat screen tv. We love it. The tv is a good size for our living room. The picture is excellent. We adjusted the True Motion for regular tv. This limits the \"soap opera effect\". The tv came earlier than expected and arrived intact. This tv is a 2010 version. I knew what I was getting because I read the write-up and researched it before purchasing. I was able to do this research while it was still in my shopping cart as a lightening deal. We haven't tried the AllShare feature yet. This feature requires the purchase of a LinkStick dongle to utilize. However, we have used it with an HDMI cable and it works great with my HP laptop. This cable works well with both Netflix and iTunes movie rentals. I am very satisfied with this tv and I would recommend it to anyone. I recommend professional calibration and HD upgrade from cable/satellite for anyone who wants the best picture from this tv. I chose a Samsung TV because of the superior picture quality. The only other brand that had picture quality close to Samsung is LG.", "Date": "December 30, 2011"}, {"Title": "About Amazon Warehouse...and the TV", "Author": "P. Mertz", "ReviewID": "R102VCZPX5J12O", "Overall": "4.0", "Content": "First off, this TV is great. I am in an apartment, so I didn't want something huge. I love the picture quality as well as the styling of the TV. It looks great! Everything that everyone else wrote about this TV is accurate as I bought this TV off of these reviews. I would highly recommend this TV for anyone.Now, a note on Amazon Warehouse deals. If you are wondering about the quality of the item, just like I was, I will provide some insight for you. I would take the description for what it is and do not rely on the generic descriptions such as \"Minor cosmetic damage on the back of item\". My specific TV said that exactly, but arrived with a large chip out of the glass stand corner, a scratch on the front plastic, as well as a dent on the back. The descriptions are not accurate and will not be the only damage to the TV. The quality of mine was listed as \"Good\" and I believe it is but just as a word of caution don't take the descriptions as the whole truth. They are more of a guideline to let you know it will not be perfect. Hope this helps!On the plus side I got a TV with minor damage (that you can't see from viewing distance) for half off the retail value!", "Date": "December 27, 2011"}, {"Title": "okay tv", "Author": "djchongfw", "ReviewID": "R3I7HNKU492NA5", "Overall": "2.0", "Content": "i have 5 other samsungs and this is my first led. great picture but the 120 hz refresh stinks. you get a lot of motion blur. the price was decent so i bought it hoping it would be good but its not. spend the extra money on a 240 hz, it'll be well worth it.", "Date": "December 17, 2011"}, {"Title": "Amazing picture quality", "Author": "VeeDee", "ReviewID": "RB4Z73LUTKIBJ", "Overall": "5.0", "Content": "I bought this HDTV exactly 1 year back and since then we are enjoying the picture quality of the TV. The operations in the remote are very simple and user friendly and I must agree that its a great purchase for a very competitive price from Amazon.", "Date": "December 3, 2011"}, {"Title": "Bad Luck with Samsung 6300 Serie.", "Author": "Cleia Cavalcanti", "ReviewID": "RDJSLSLGCI7AJ", "Overall": "2.0", "Content": "I bought the 40\" Samsung TV UN40C6300 1080p 120Hz LED TV, and for little over a year, I was very happy with my wonderful TV. Suddenly, every time I turned the TV ON, it turned OFF automatically. Then turned ON again and OFF, ON/OFF, without stopping. I have been told by Samsung Authorized Assistance that the MASTER PANEL must be changed. I am very sad and disapointed because I always believed that Samsung was the best.", "Date": "November 27, 2011"}, {"Title": "samsung 40 tv", "Author": "toodaloo", "ReviewID": "R2XN9XA6VX051E", "Overall": "5.0", "Content": "I have been a fan of samsung tv's as they seem to out picture other models by far. They are durable and I get many comments on picture quality.", "Date": "February 26, 2011"}, {"Title": "Bold and Beautiful", "Author": "Saul Rapkin", "ReviewID": "RAY8YVH46KGGF", "Overall": "5.0", "Content": "After comparing several models side by side in retail stores, choosing the Samsung was an easy choice.  The picture was the sharpest and clearest of all the displays.  The decision to buy through Amazon was also easy.  The price was better on-line than through any other outlet.", "Date": "January 31, 2011"}, {"Title": "perfect computer monitor", "Author": "marymarga", "ReviewID": "R20ORVV4S2MQM3", "Overall": "5.0", "Content": "This 40\" LED 1080p Samsung is top of the line against any competitors with the same attributes and size. Some thought it may be too large to serve as a computer monitor for me but after looking at the tiny laptop screen the size of this one is welcome. It is definitely not to big to use as a computer monitor. The picture is sharp and it serves all of my purposes. Consider this one if you are looking for a fine high end 40\" screen.", "Date": "January 29, 2011"}, {"Title": "WOW", "Author": "TJ Lintner", "ReviewID": "R1ZSY8NAYSNMK0", "Overall": "5.0", "Content": "I never thought watching television could be so enjoyable.  The Samsung LED HDTV I purchased via Amazon probably ranks as my best decision for 2010.", "Date": "January 24, 2011"}, {"Title": "Great TV, great Value", "Author": "B", "ReviewID": "R27CHA058TGATZ", "Overall": "5.0", "Content": "Very pleased.  Beautiful picture, great sound quality, plenty of inputs, easy to set up.  Works well with my BluRay player and HD satellite service. I also use it as a 2nd computer monitor to view my hi-res photos.  I would recommend it.", "Date": "January 13, 2011"}, {"Title": "Great LED TV buy", "Author": "DavidinChelsea", "ReviewID": "R2PBXMIBVY297M", "Overall": "5.0", "Content": "After much research, I purchased this LED TV and have been very pleased with the design, ease of use, and picture quality.  Plenty of connections, great slim profile, and the crispness of the picture is exactly what I had hoped for.Delivery was prompt (as usual) and I used the Samsung slim profile mount to mount it making its appearance on the wall almost like a picture frame.  Couldn't ask for any more, though reliability will be proven through time of use.", "Date": "January 8, 2011"}, {"Title": "Great TV for a great price.", "Author": "Nick H.", "ReviewID": "R3L0U95CC8SSND", "Overall": "5.0", "Content": "We've had this TV for a little over a month now and are extremely satisfied with it. The picture is great, the controls are easy to use, and the TV is aesthetically pleasing. LED over plain LCD makes a big difference.A drawback: The sound is sort of crummy. As to be expected with a 1.2\" thick TV, the sound that the TV projects is \"tinny\" and certainly not as good as prior TVs we've owned. Our solution was to purchase a couple Bose speakers to put behind the TV, problem solved.Also, the TV had a small crack in the upper right corner of the framing, but it was concealed by the \"LED TV\" sticker so we looked past it.All in all, great buy for around $800.", "Date": "January 6, 2011"}, {"Title": "GREAT LED TV", "Author": "George Sottolano \"SODAMAN\"", "ReviewID": "R25LOG8NU0RS74", "Overall": "5.0", "Content": "this set is worth the money it has a great picture a lot of settings and the sound is great it does has some negatives but i still give it 5 stars-i got the s panel so i was lucky but it does have some flashlights in the corners but they are dim and with the settings you can compensate for this- led tv's have this problem the motion settings can help you or hurt you depending on the signal- artifacts are noticable in small items like grass scenes or black white colors on cloths or salt and pepper hair all this is still minor -the clarity is jaw dropping and i am picky but will not return the set- had an lg before this and did not like the panel samsung line is a good bet", "Date": "December 24, 2010"}, {"Title": "Samsung UN40C6300 40\" LED TV", "Author": "Joe Beakley", "ReviewID": "RB59762YRE64K", "Overall": "5.0", "Content": "I am very happy with the television as delivered.  It was easy to assemble and works great.  Picture is of exceptional quality as compared to the Vizio I had purchased about 6 months ago.  I highly recommend the Samsung brand.", "Date": "December 12, 2010"}, {"Title": "Good Buy!", "Author": "B. Casey", "ReviewID": "R24MOAULD6DZ0V", "Overall": "5.0", "Content": "Great Buy!! Awesome picture!! Wish I had paid a little more attention to the specifications and gotten version with better interaction with netflix, google, etc.", "Date": "July 20, 2010"}, {"Title": "A Christmas gift for us", "Author": "dvmet614", "ReviewID": "R8BEVBNCCE7HD", "Overall": "4.0", "Content": "I made the mistake of first purchasing a tv that was only LCD. The picture clarity was nothing compared to the LED/LCDThe Samsung has been beautiful for football games, movies and video games. We are very happy!", "Date": "December 31, 2010"}, {"Title": "Picture great...sound not so great", "Author": "Gary D. Bader", "ReviewID": "R3EN49D4C9WSEI", "Overall": "4.0", "Content": "This is a fine tv...the picture is fantastic...sound is marginal...HDMI/DVI input works for video  from a computer, but the sound input jack does not carry the sound when this input is used for video from the computer...I posed this issue with Samsung but they did not respond.....PC  sound input from a computer works fine when you use the vga input for video from the PC...The TV menu is not very intuitive and takes practice to get used to it...especially when selecting input sources...the Any Share feature is not worth the effort to view pictures and video on your computer...it is easier to hook up the computer via the vga input then to try to use Samsung's PC Manager software via a home network to view video and pictures stored on your computer.  For watching HD tv and BluRay this tv is outstanding..however you need a sound system or sound bar for quality sound.", "Date": "December 3, 2010"}, {"Title": "Very long wait", "Author": "BB", "ReviewID": "R2822GSMBV9NP2", "Overall": "5.0", "Content": "This Samsung LED TV is the greatest, an outstanding television. My only complaint is that it took more than two weeks to arrive at my home after placing the order. Could have spent 100 bucks more and gotten it 11 days sooner from Best Buy. Worth the savings? Don't think so.", "Date": "July 29, 2010"}, {"Title": "A great TV", "Author": "Greg", "ReviewID": "R37WIJZLUKFUZ4", "Overall": "4.0", "Content": "I bought this mainly because it was the biggest screen that would fit into my entertainment cabinet with 1020P, 120 hz, and LED.  At present I have only watched Cable HD sports and TV shows, but I am very pleased with the picture.  It is sharp and the blacks are really black.  The picture was too bright as shipped, I had to dim it down.  I will hook up the internet and blu-ray over the holidays to see how each of those look soon...", "Date": "December 16, 2010"}, {"Title": "Good value", "Author": "neighbors", "ReviewID": "RMME9PEN8KVOZ", "Overall": "4.0", "Content": "This Samsung was a pretty goof value when we bought it during the Cyber Monday Lightening deal.  We are pleased with it so far.", "Date": "December 2, 2011"}, {"Title": "Great TV", "Author": "Thomas", "ReviewID": "R30P7JNQL9O52I", "Overall": "4.0", "Content": "The TV arrived on time. The listing said it was in very good condition but I can not tell the difference between that and brand new. The only problem I had was that the TV came with only 2 screws that connects the base with the TV.", "Date": "February 4, 2011"}, {"Title": "Samsung did .....", "Author": "Buddha", "ReviewID": "R2ZJKZBVSZM7TB", "Overall": "3.0", "Content": "Went and purchased my TV for my new Apt through Amazon Warehouse.I was shocked to see what arrived, the box was all shredded and then taped back together.The description did not match what was in the details, the back of my LED TV had a scratch, a dent, and the front housing was coming undone.not to mention the only padding that was in the box was a sheet of foam.I was like oh crap, so took it out and plugged it in and it worked, but the picture is still a little blurred and grainy even in the HD mode.Tried to play with the settings and still no resolution.The TV is thin and light and easy to use after you get use to the different menu settings.I have my XBOX,PC,and HD DVR hooked up to it, wish there were more component connections.like others have said the HDMI ports would have been better if they were located on the bottom instead of the side.", "Date": "June 1, 2011"}, {"Title": "60 or 120 hz?", "Author": "hz challenged", "ReviewID": "R11ER8AOM3C4E4", "Overall": "3.0", "Content": "The description on Amazon states that this tv has 120 hz technology.  When you turn on the tv, however, it displays \"60 hz\".  The box the tv came in said something about 120 hz \"auto motion plus\".  What does this mean...that it is only 120 hz at times?  I'm not sure about hz, but I sure hope that this is not a case of false advertising.", "Date": "June 19, 2011"}, {"Title": "BROKEN PARTS", "Author": "Michael C. Miller", "ReviewID": "R2SIMOUDV11S4Y", "Overall": "2.0", "Content": "I RECIEVED A 40 INCH LED TV MODEL 6300. WHEN I OPENED THE BOX, I FOUND THAT THE NECK TO THE STAND WAS BROKEN IN HALF. SO, I WAS UNABLE TO WATCH THE TV BECAUSE I HAD NO WAY TO STAND THE TV UPRIGHT. SO, NOW I HAVE A FLAT PANEL TV AND NO WAY TO WATCH IT AS IT IS NOT GOING TO MOUNTED ON THE WALL. WHEN I CONTACTED AMAZON - THEY TOLD ME TO GO OUT AND FIND ANOTHER RETAILER THAT HAD THE PART. I CALLED BEST BUY, SEARS AND WENT ONLINE WITH NO SUCCESS. THEN I CALLED AMAZON BACK AND THEY GAVE ME A PARTS SUPPLIER AND THEY TOLD ME THEY WOULD CREDIT ME $21.95 TO REPLACE THE STAND.  AS YOU CAN IMAGINE, I AM NOT TOO PLEASED DUE TO THE FACT THAT I SPENT OVER $800 FOR AN LED TV AND I CAN'T WATCH IT UNTIL I FIND A PART TO STAND THE TV UP! MAKES A NICE TABLETOP THOUGH!!!", "Date": "January 6, 2011"}, {"Title": "NOT FOR LOW DEF VIEWERS", "Author": "linda maletz", "ReviewID": "R1VBYX9E2PETJC", "Overall": "5.0", "Content": "I ARRANGED TO RETURN THIS TV LESS THAN TWO DAYS AFTER RECEIVING IT.  THE PICTURE QUALITY AT 1080 P IS FINE, ALTHOUGH RAPID MOVEMENTS (FOOTBALL, ETC) HAVE A STUTTERING QUALITY REMINISCENT OF VERY EARLY MOTION PICTURES.  THE MAJOR PROBLEM IS PICTURE QUALITY WITH STANDARD (720P) DEFINITION BROADCASTS.  THIS CAN ONLY BE TERMED ABYSMAL.  THE COLORS ARE FADED, THE IMAGES ARE BLURRED, NUMBERS ARE SHADOWED, THERE IS PRISMATIC BACKGROUND.  I BOUGHT THIS EXPECTING AN IMPROVEMENT OVER A SAMSUNG 40 INCH 60 HERZ SET BOUGHT THREE YEARS AGO, BECAUSE THE OLDER SET WAS TAKING UP TO THREE MINUTES TO TURN ON.  SAMSUNG TOLD ME 1. That my complaint with the 6300 series TV was familiar to them, and 2. that my earlier set had a 'capacitor problem' and would be repaired free of charge.  To re-iterate, the 720 P performance of the earlier set is infinitely superior to that of the 6300 series.....the 6300 series is virtually unusable by anyone who watches primarily 720 p .", "Date": "October 24, 2010"}, {"Title": "NO INTERNET APPS", "Author": "sagz", "ReviewID": "R1DYE1IWX4L9NN", "Overall": "1.0", "Content": "If you are looking for a TV which can stream youtube, netflix and a web browser, then this not the right one. This has an internet connectivity But it is only used for updating firmware. So no practical option with it. I didn't know about it until I bought this one. I went on a vacation for a month after I bought this one, so couldn't return the TV. If you don't care about apps, then it's a good one.", "Date": "March 24, 2011"}, {"Title": "clear mojo", "Author": "James Williams", "ReviewID": "RFKNFFQEOWMON", "Overall": "4.0", "Content": "at sears this tv had a price card saying it was a 120 hz. The box don't say anything about 120-hz. Now on amazon ((The most awsome store ever)) it does say it is 120-hz with clear motion 480 added. the model number on the paper taped to the box ends with 630. On amazon it ends with 6300 so I guess they are the same number 630 - 6300 un40c6300. It buged me to think it wasn't 120-hz but now i feel a little more comfortable with this tv. I have it hooked up to my pc HUGE and its my 2nd sam.the info button does not show 120hz and the book says it don't display 120hz it displays 60hz but im 99% sure it is 120hz. why don't it display 120hz? UPDATE the back of this tv says \"60 Hz\" its going back.", "Date": "October 15, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "40.0\" Screen Measured Diagonally\n1,920 x 1,080 Native Resolution\nWi-fi Ready (requires Link Stick adapter)\nHDTV Tuner Built-in\nWireless LAN Adaptor Support\n10Wx2 audio output\n4 HDMI (ver 1.3), HDMI-CEC\nConnectShare Movie\nWide Color Enhancer Plus", "Name": "Samsung UN40C6300 40-Inch 1080p 120 Hz LED TV, Graphite", "ImgURL": "http://ecx.images-amazon.com/images/I/314299MdP4L._SY300_.jpg", "ProductID": "B0036WT492"}}