{"Reviews": [{"Title": "A beautiful TV that won't bankrupt you...", "Author": "Jason Ralsky", "ReviewID": "RZLZPGXJL1652", "Overall": "5.0", "Content": "The Sharp Quattron, many have said is a gimmick.  The whole idea of the \"yellow subpixel\" is a scam!  everything is produced in RGB so the Yellow is never used etc etc.**This is wrong.  Adding a YELLOW subpixel is actually a brilliant idea!  It works and perhaps is going to end up being the new standard.  Keep in mind something like 30-40 yrs ago we were using the RGBG color system \"red - green - blue green\" and it was found out that blue green was really redundant so it was dropped to simply Blue and thus \"tint\" was born.  Besides, if we thought on the logic that \"RGB is a standard we don't need RGBY.. we would still be using Floppy drives and dial up modems. I mean those were the standard years ago why change?\"** The visible light range for the human eye is far greater than a RGB TV can produce,  RGB produces the majority of colors but fails to produce many of the subtle shades.  By adding a yellow subpixel you expand more into the visible light spectrum and allow for subtle shades to be displayed.  This produces crisper, sharper colors that do a much better job separating themselves  rather than bleed together into the same color.Anyhow; About the TV!  The Sharp LC46LE810 is a 46in Quattron (4 subpixel) design using \"Edge-Lit\" LED X-Gen Sharp LCD panels.  Instead of a CCFL lighting system the entire edge of the screen is lined with LED's which provide a much brighter and 'natural' light.  This creates beautiful, clear , sharp colors  and by adding yellow into the mix you sharpen existing colors further while being able to display/create more subtle shades.  The panel is incredibly thin  and light weight which makes it perfect for wall mounting.Image Quality(IQ) - This TV blows away my standard Sharp and 40in Samsung.  While out of the box, Samsung looked the best and required little tweaking -- once I sat down and tweaked the Quattron color settings, back-light etc  the IQ just levels the Samsung.  There is no comparison anymore, I'd take my Quattron any day.  Movies look fantastic and realistic (DVD's look better, Blu-Rays look stunning).  You could look at a sunrise on a show and see multiple layers of color just like a sunrise - it is subtle but seems more \"natural\"  The display panel is also a \"natural\" 10-Bit panel  [ Some panels are 8bit + 2, mainly limited to computer monitors though ]Black Levels(BL) - The one thing that was difficult to adjust to was the black levels.  EDGE-LIT LED models tend to have back-light bleed because to illuminate the middle of the screen it has to get light from the edge to the middle.  This isn't a problem unless the image is \"black\" you end up with a little bleed.  This is an issue on virtually every Edge Lit model and not something exclusive to Sharp.  Once you adjust the picture accordingly it is barely noticeable.  The best way I found to ensure ideal black levels is to trust the video processor in the TV (use the video modes like Movie, PC, Game etc)  see what they set things to then customize it.  Like for Blu-Ray and DVD I use MOVIE mode w/ some custom tweaks.  The Black Levels aren't bad(gave it 4/5 stars) in fact for an edge lit LED they are fantastic  -- but you will have to mess around with some settings to make it look nice  (a CCFL or plasma doesn't have nearly the level of tweaking to get ideal black levels.. a \"full back lit\" LED also )Ports - The TV has tons of ports.  3 HDMI v1.3 ports  and 1 HDMI v1.4 port (for audio return - this TV can not display 3D)  It has 1 HD Component, 2 RCA sets, an RS-232C, a port for PC, USB and Ethernet.  The ports are located on the \"left side\" of the TV  sort of designed in a way that if you wall mount you still have access to all your ports w/o having to dig around behind the TV.  COMPONENT and RCA are behind the TV but on the \"bottom\" so if you wall mount you do not have to dig around for the ports.  All ports are in well thought-out positions and even without wall mounting provide good cable hiding abilityStand/Bezel - The stand is not a swivel (at least mine was not)  However it is very durable and almost has a nice glass look to it.  The TV has virtually no \"wobble\" to it so it is quite stable.  The Bezel is beautiful but does have a \"reflective\" problem.  If you are in a bright room it will reflect light  however the SCREEN is not that reflective.  the 820 model has a reflective problem because the screen has a thin pane of glass over it that is highly reflective.Ease of Use/Menus - This TV is so easy to use with simple menus that hold a lot of tweaking features.  When you enter the Menu mode the TV will shrink your image and then produce the menu on the Top and Right of the screen.  Everything is clearly labeled and the font used is simple and crisp.  If you leave an option highlighted for 3 seconds a \"help\" menu automatically displays explaining what the feature does .. and if it has sliders explains what going +  or - will do to the image.  There are multiple pre-programmed visual settings  each can be customized (so if you don't like presets on MOVIE, just change them and \"movie\" now will have your presets).  Each display port can have its own Volume, Audio settings, Video settings placed on it.Sound - The system has 2  10watt speakers w/ a built in 15 watt sub on the system.  Sound quality is above average for a LCD/Plasma.  Far better than my Samsung produces or my parents Sharp.  If you are heavy into movies or have a large space a sound system is the way to go - but stock/out of the box these are some nice sounding clear speakers.  (can't expect much from a 35watt system though vs say a 300 watt 5.1 system)  The TV lets you adjust Treb and Bass,  virtual surround sound , auto volume (I leave this off) and a few other features giving you a nice control over the sound outputOverall this TV is amazing.  There are a lot of settings to tweak but that is almost half the fun sometimes.  Plenty of video settings and color adjustments (at least double that of my old Samsung).  Color quality is amazing! Image Quality is amazing.. good sound out of the box.  Simple interface that gives you a lot of control  If you have been looking to get an HDTV  or simply need a replacement this TV gives you plenty of Bang for a decent buck.** The only negative would be the \"black levels\" but sometimes I wonder if it is just how satellite/cable handles the signal.  My PS3 has zero back-light problems!  Games like Dead Space which are mostly dark look beautiful yet I could watch a commercial for Dead Space and the dark spots which were \"dark\" for me, have a little black light issue.  A small negative but it is something you could easily remedy with some tweaking of the visuals and saturation*** Gaming TipThis TV , like almost every other HDTV out there has input lag especially with games.  GAME MODE removes the lag but I found a better trick.  Just Disable all the video processing elements, like set Noise Reduction to LOW, turn off FILM mode,  turn 120Hz to Low or Off etc.  This removes your lag w/o losing all the video processing such as Dynamic Color etc", "Date": "December 4, 2010"}, {"Title": "Sharp Aquos has amazing video quality", "Author": "9design", "ReviewID": "RYMO0RQDQLA51", "Overall": "5.0", "Content": "When viewing \"side-by side\" the Sharp versus other sets in an electronics store, the Aquos actually stood-out from the crowd for video quality. The high-end plasmas were very close, but there was something about the Sharp that set it apart. At home, while viewing satellite HD, old movies, even black & white, seemed like they were live broadcasts. This isn't just my impression, but those of most of my friends that viewed it as well. This set replaces a 4 year old Samsung DLP that should have lasted a lot longer than it did. Audio quality is mediocre, but what can you expect of speakers in a cabinet as narrow as this? A home theater sound system with this TV is a must. I also viewed the 240 Hz version of this set, but couldn't detect enough difference to warrant the extra expense. Bottom line is that this set gives superb video quality for a very reasonable price.", "Date": "July 5, 2010"}, {"Title": "Amazing Value", "Author": "Cybermed Rick", "ReviewID": "R2UIBI2S5IVOHI", "Overall": "5.0", "Content": "I purchased this unit on 5 June 2010 and after 7 days of viewing i have to admit that it has the best picture quality of all the LED's I've seen.  I replaced a Vizio 46\" FHDTV with this unit because the Vizio LCD panel failed after only 1yr 2 months of use. Entire lcd strings of vertical lines failed (20 plues), plus a dark comma-shaped smear appeared on half the screen. No more Vizio's for me. This set is a dream as far as we are concerned. It's like a theater film movie screen....  Just amazing!", "Date": "June 12, 2010"}, {"Title": "Stunning", "Author": "Mike H. \"cheffy\"", "ReviewID": "RBZFKFZ3763N4", "Overall": "5.0", "Content": "Just bought this tv after much research. Basically it came down to this and the Samsung 6300. The picture quality was close but the Sharp had the edge, along with the beautiful design and net streaming features it was a no brainer. After a week I must say I am still blown away by the picture. Hi def cable looks great as does the streamed movies from netflix. Dvd-awesome, blu ray--I can't imagine a better picture on any set. Sound is not bad but what do you expect from something under 2\" in width. Aquos net is basically useless.", "Date": "July 18, 2010"}, {"Title": "Awesome picture - great features", "Author": "Christopher M. Allen", "ReviewID": "RF5KIM9DM01EC", "Overall": "4.0", "Content": "I had been looking at LCD TVs for quite a while, but wanted to be sure to purchase the right one.  This TV has an excellent picture.  This is Sharp's innovative design that includes not only the red, green, and blue; but also includes yellow in the color spectrum to give the TV a sharper image with even more vibrant colors.It was very easy to set up and scan for channels.  You can also label each TV input on the menu screen so that you can easily switch between different units.  I have also plugged the TV into my ethernet connection which will allow you to download any software updates and connect directly to Aquos for any tech support you may need.  This TV is also Netflix ready and it works great.The only issue we had was that after about three weeks a mysterious black line appeared about 3/4 of the way down the screen on the right side.  I promptly called Sharp about the problem and they asked me to take a couple of pictures to show the problem and email them.  I did that and they called back within a few days and said that they didn't think that this problem was easily repairable, so they VERY quickly Fed Exed me another TV with easy instructions on how to send back the defected TV.Even with the problem I had, Sharp went above and beyond to make it right with me.  I am very pleased with this TV and really enjoy my purchase.", "Date": "November 23, 2010"}, {"Title": "so... so pretty 8)", "Author": "Will and/or Caroline C.", "ReviewID": "R2IHXIMJWHAJJU", "Overall": "4.0", "Content": "I bought this TV solely because I saw it advertised as having a yellow pixel... that is genius! Yellow is a primary color so how do they get yellow from red, blue & green?The picture is amazingly clear... unbelievably sharp. I can only imagine this is because the pixels have to bleed less to make yellow or something else far beyond my comprehension.In fact my only complaint with this TV is that all the blu-ray DVD's I watch on it are so clear & crisp they feel less like I'm watching a movie and more like the greatest production value soap opera ever made. At first I thought it was just me but my buddy made the same comment while we were watching Firefly the other day.Maybe I just have not hit the magic setting combination but it's so amazingly crisp an image I'm pretty ok with that. It does not do this with games though... just Blu-ray movies.", "Date": "November 19, 2010"}, {"Title": "Great TV!!!", "Author": "Football Fanatic", "ReviewID": "R2HLNTBGZN1AZ7", "Overall": "5.0", "Content": "I am 99% happy with this TV. The picture quality is great, and mounted on the wall, the sound is equally good. I was a little nervous after reading some of the flat screen sound reviews. I think the secret is that these types of TV's need to be mounted on a wall or installed on their stand near a wall so the sound can reflect. Otherwise, the sounds goes out the back of the TV instead of toward the TV viewers. I bought this TV primarily for watching sports (NFL football), and I have been very impressed with the picture performance. I will admit that I am not an extreme videophile but I have owned several flat screens and this TV has the best picture by far. The only *minor* complaint I have with the TV is that there is not an option for a wireless network connection. Sharp advertises AQUOS-net as a feature on this TV, but to use it, the TV must have a wired network connection (at least as far as I have been able to tell from reading up on the connectivity). As such, this feature is useless for me in my home configuration. I do not see this as a negative feature of the TV per se, but it would be nice if they released a firmware update so that they could support wireless network connectivity through a USB dongle or something.", "Date": "October 22, 2010"}, {"Title": "Incredible Picture", "Author": "Wayne G. Schlegel", "ReviewID": "R3TPWXI6TV5XKS", "Overall": "4.0", "Content": "Love it, Love it, Love it.The best picture I have ever seen on any TV that I have ever owned. This Sharp TV blows away my 52\" SONY that is only a year old.Only negatives - 1) some screen glare under certain lighting conditions 2) the polished \"chrome\" surround they can keep, adds to the glare problem 3) the sound quality is horrible - however most TVs that are this flat are the the same.  It's a WOW TV.  I look forward to watching this TV each and every time!", "Date": "August 25, 2010"}, {"Title": "Incredible Picture; Good Sound; Great Value for Price!", "Author": "Jason Largent", "ReviewID": "R2G2DUA2XRNSNO", "Overall": "5.0", "Content": "I've had this TV for 3 months now and must admit that I was a little skeptical at first, wondering how the quality of this TV would compare to some of the bigger names on the market.  If you compare the specifications of this TV with the likes of Sony and Samsung, you'll see that it is more or less equivalent, with similar features.  The main difference is the price, which is a few hundred dollars less.  Does this mean lower quality?  I'm convinced that it does not.This TV is on for about 6 to 8 hours a day in my house and have loved every minute of it.  I have a VCR connected to the only composite input, DVD to component, and I use three HDMI inputs for my DirecTV, PS3, and laptop.  Setup was easy and allowed me to specify meaningful names for the inputs instead of the generic \"input 1\", \"input 2\", etc.  The unused inputs could be set as unused so they are skipped when changing inputs.  This is very convenient.One area that most flat panel TVs fall short is sound.  I think this is where the Sharp TVs surpass others.  The speakers sound great, covering the low frequencies very well given their size.  The volume is more than adequate for my 15'x19' living room area where the TV is used.The contrast is amazing, colors are vibrant, menu settings are abundant and provide significant color tuning.  There is also a feature to automatically shut off the TV if there is no source signal detected or if there has been no user activity for 3 hours.  This comes in handy for the occasions when you fall asleep with the TV on.Overall, this is a great TV, especially for the price, and deserves everyone's serious consideration.", "Date": "September 16, 2010"}, {"Title": "Great tv even better picture", "Author": "D. Rambo", "ReviewID": "R1UWEHMGQR98J2", "Overall": "4.0", "Content": "I recieved this model as a replacment from sharp when my last set keep giving me problems so they finally gave me a upgrade. This set is x1000 times better then the last. Picture is great for blue-ray movies and gaming. As for tv it could look better i have dish network hd and it looks a little grainy but i suppose that could be dish network issue. The picture menu can get a little confusing their or a lot of options, I suggest that you go to [...] they have nice picture calibration i was happy with. Other then that its a great set you should be happy with", "Date": "May 18, 2010"}, {"Title": "46\" of amazing detail", "Author": "Avid Amazon Buyer", "ReviewID": "R2QEFA50P33V6H", "Overall": "4.0", "Content": "I got this TV for my family as an early Christmas present, and I must say I'm impressed. I replaced my 36\" flatscreen from Samsung with this HD wonder which was already an upgrade in size, but Me and my family watched Inception on it the day we set it up and let me say, nothing says quality like being able to see the light shimmer off a 1/10 inch water droplet, or being able to pick out individual splinters of wood in an explosion from ten feet away. Picture quality is extremely smooth and sound is just fine for those not needing a huge bass hit for every explosion. The only thing bad about this tv is that it switches the brightness of the screen depending on what colors are being put on the screen, for instance darker for shadowy like scenes and very bright for outdoor sunshine scenes. This would be great but sometimes it makes it harder to make out the details in the darker ones. Other than that, excellent quality for the price you pay.", "Date": "December 17, 2010"}, {"Title": "From LCD to LED.  A new champion emerges.", "Author": "Lee Wilson \"Animaleyez\"", "ReviewID": "R1A4I3U0ZZOXGH", "Overall": "5.0", "Content": "I had a Sharp Aquos 46D64U.  This unit still carries a place in my heart.  But it had some problems and now under warranty I went out and got the next successor in the line-up.  Enter the LC46LE810.  I must tell you I had my doubts when I compared this unit to some of the more expensive units.  But after having it for one day and seeing Avatar the Extended Edition at 1080p and 120Hz I'm humbled all over again.  The colors are nothing short of breath taking.  Far beyond what my beloved D64U unit was capable of.  I think there is proof in the pudding.  You have to see this to believe how great this unit is. I tried several times to take pictures of this unit to show you how beautiful it really is but my camera is not capable of reproducing the colors accurately.  I have to add this about the blacks.  On my previous unit the black were extremely black and awesome. Yet the blacks ended up bleeding over to one another on my D64U.  On this unit, somehow Sharp manages to create blacks that are blacker yet in the darkest scenes you can still see the objects definitively without them bleeding together.  I cannot imagine how the industry can improve on technology and go further. Yet I'm excited to see what the future holds.  As before hook this unit up to a good surround sound and if possible get yourself a Harmony remote.The remote is functional but I hate relearning remotes.  One good Logictech Harmony remote and forget about it.Don't think about buying this unit, just do it. No regrets or buyer's remorse here.  All the other competitors should be ashamed when compared to the price and performance of this unit. Ladies and gentlemen we have a new people's champion here.", "Date": "December 4, 2010"}, {"Title": "great picture, great value", "Author": "normsy", "ReviewID": "R13761E1OEESN2", "Overall": "5.0", "Content": "I have owned this television for a month.  It is excellent!  The picture is clear and sharp - by far the best I have seen in this price range.  The sound is more than sufficient for my viewing needs (I'm not a sound nut).  I enjoy the ability to connect my router straight to the television so that I can receive high-quality Netflix using the software on the television.  The remote is sufficient and controls Netflix fairly well.From opening the box to sitting in my recliner watching a movie took about fifteen minutes.Highly recommended.", "Date": "July 27, 2010"}, {"Title": "Picture is awesome -- QC is not!", "Author": "Marshall C. Miller, Jr.", "ReviewID": "R1SZRJ91WUF4LE", "Overall": "1.0", "Content": "After side-by-side comparisons in stores, I decided upon the Sharp Quattron Aquos HDTV.  This is, by far, the best TV picture I've ever seen.  The colors are amazing and the brighter and more colorful the video, the better it looks.  (Try Avatar on Blu Ray on this one -- it blows any other TV away!)  Sharp's idea of improving the picture quality (instead of going in big for 3D HDTV) seems to have paid off.  I could not be happier with this HDTV.Update (2 Apr 12):  After 16 months, the picture began to \"flicker\" and steadily became worse.  I now have to shell out $500 to replace a card with no guarantee that this will fix the problem.  Obviously, Sharp has some quality control (QC) issues.  I highly recommend an extended service contract for this HDTV!", "Date": "February 28, 2011"}, {"Title": "Unbelievable Picture, $$$$ less than comparable LED's", "Author": "KURT CHRISTIANSEN", "ReviewID": "RKJO70G5EGL0E", "Overall": "5.0", "Content": "I purchased this tv on 10/31 from Best Buy (talked them down to $1049!) and set it up myself.  The setup went smoothly.  I was replacing a 4 year old Samsung LCD 32\", and was originally looking to get another Samsung.  But when I saw the price of this set, plus the side by side picture comparison, I was sold on the Sharp Aquos.  The picture on this LED is unbelievable!  It is almost too real, and it took a little bit to get used to feeling like I was watching a live performance.  Once I was accustomed to the quality of the video, I was completely sold.  I am a huge football fan, and the quality of the picture just blew me away when I watched my first football game on it. On Thanksgiving we watched the new release of Avatar and we could not believe how good the video quality was!  I have read many reviews about the sound quality of the speakers, but who would ever think of purchasing a tv like this and not hook it up to a good sound system?  I have a 4 year old Onkyo and the sound is fantastic.  Also, the Netlix application is ok, but has no search abilities, so I am going to continue using my PS3 for Netflix.  Over all I give this set a 5 star rating, and would recommend it to anyone looking for the best bang for the buck under $1200.", "Date": "November 26, 2010"}, {"Title": "Love At First Sight", "Author": "S. Shawkey", "ReviewID": "R1K6VJ3LR2TESI", "Overall": "5.0", "Content": "I thought I knew what I was going to buy when I walked into the storebut my first choice didn't stand out among the others. Then I saw theSharp and thought it had some presence that the others didn't.  Thepicture is very impressive and I liked the sound.  Right out of the boxthe picture looked great, didn't have to mess with the settings.  Like the factthat it has a sub woofer built in and surround sound. Not home theaterbut I live in small place and it suits me fine. The remote iseasy to use. Like being able to put my music on a memory stick andplaying back on the TV, a lot easier than using CD's. Haven't tried theinternet capabilities. Price was right.  Very happy with the purchase.", "Date": "October 12, 2010"}, {"Title": "got this tv and loving it", "Author": "suresh72", "ReviewID": "R1YHDV2ZQ67S4H", "Overall": "5.0", "Content": "when i ordered this tv i couldn't wait to get it b/c i saw it at a big retail store, so i know wat i was getting and i paid about $550 less than the retail store i saved on the shipping and tax plus $200 less than what the store was charging, i'm very happy with my purchase thank's to amazon.com that has the best deal's and this tv is awesome love it so much  thank you", "Date": "September 17, 2010"}, {"Title": "Superior Image Quality", "Author": "S. deBeaubien \"Scotty\"", "ReviewID": "R3Y9VQIXYU6T0", "Overall": "5.0", "Content": "Simply put, the new technology in this TV, and the other TV's in Sharp's new Quattron line make it the one to beat.  I've seen lots of TV's, and been looking at flat screen TV's for a while.  I thought I'd wait for the market to settle down a bit, and prices to drop, especially when HDTV came out.  I'm strictly old school I guess, I finally gave up my Panasonic 36\" tube just a couple months ago.  The technology for flat screens has undergone several iterations of improvements already, and I've not seen anything that \"blows away\" the competition so completely as the 4th color pixel that Sharp has added.  The idea and the execution are simply brilliant.Colors leap off the screen at you and images on a flat screen appear so lifelike that people in the scene appear to be in the same room with you!  It's that much of a difference people!  I'm telling you, Sharp has taken a huge step and other manufacturers will be quick to follow I'm sure.  I've seen lots of Plasma TV's and I've always been impressed with the basic contrast difference between a Plasma and most of the \"ordinary\" LCD based TV's, but I would never buy a plasma simply because of the high energy usage.  I don't know how they ever got any Plasma TV's to pass as \"Energy Star\" rated TV's, they are all simply POWER HOGS!  While I'm not a total GREEN person, I do believe we all must do our part to \"Reduce, Reuse and Recycle,\" and I voted with my wallet in not purchasing a plasma.The power consumption by the picture producing part of the 46\" Sharp TV we bought probably only consumes about 85W as opposed to 450-550W for the typical plasma set.  That's IMPRESSIVE folks!  And to be capable of producing the quality of picture this set has is simply amazing.  I'm a layman, and I'll talk about it in layman's terms, but you can take my word for it - Sharp has produced the new flat screen TV's to beat!", "Date": "March 13, 2011"}, {"Title": "Fanatastic TV!", "Author": "TZ250", "ReviewID": "RAI54NL60H7W7", "Overall": "5.0", "Content": "This is a beautiful TV with a beautiful picture.  It reminds me of Apple components because of the smooth, glossy style.  The 'buttons' on the front panel are actually touch-screen buttons.  They don't protrude or don't distract from the look of the set.  The picture if fantastic.  I went to a couple of stores and saw them in person.  It was the only TV that I cared about because of picture quality.  The contrast is amazing.  The problem with CRT and flourescent backlight TV's is that you can't project black.  What we see is dark gray.  To get TRUE black, the LED backlights in that area are simply turned off.  There's nothing darker than off.  It's an excellent design.The speakers are tuned for mid-range because that's where we speak and hear.  If you watch action movies with the built-in speakers then they seem flat.  Speaking of speakers, my only complaint is that the audio output isn't controlled with the volume.  Sharp assumed that if you use audio-out, you'll use a receiver or amp for auxillary speakers for surround sound.  My previous TV used the stock speakers with an output going to a Yamaha 10\" powered subwoofer.  That worked well for a basic system.  With this TV, when I mute the audio the subwoofer is still playing.  That's okay with Blu-Ray because I pause the disc.  I can't pause TV because I receive HDTV through the air.The remote and the TV menus are intuitive.  I love the USB port for viewing pictures.  No one will ever setup the slide projector to show family vacation pictures!  The inputs are easy to use and they can be named.  The inputs can be removed from the menu if you don't want to see them.I've only had it a week, but I'm very happy with it!", "Date": "December 1, 2010"}, {"Title": "Sharp TV", "Author": "Dan W. Hipes \"dwhipes\"", "ReviewID": "RMXB8YSDFP0SF", "Overall": "5.0", "Content": "I received the TV, in excellent shape and it was here before I expected it.  We are using the TV daily and it exceeds what I expected.  A very good TV.", "Date": "October 14, 2010"}, {"Title": "Not to bad", "Author": "Howard \"Howie\"", "ReviewID": "R2I3LBYEM8A7E4", "Overall": "5.0", "Content": "Purchased this TV at BB this weekend.  Was between this and the new Samsung UN40C6300.This was purchased for a bedroom TV, and wanted something between 37\" and 40\".This TV is very thin, I have it wall mounted and it looks great.  Side viewing angles are great.  Picture quality looks great and speakers sound great.My biggest beef about the tv (which really isn't a huge issue for most) is the power cord is not detachable and its not very long either so it makes it a PITA to run through the wall if your wall mounting it.I also wish the bottom of the bezel was smaller, I guess because the TV has a built in sub, they had to extend out the bottom, it makes the TV look larger then it needs to be.", "Date": "May 10, 2010"}, {"Title": "Great Picture Poor Internet Options", "Author": "SlideShowMemories", "ReviewID": "R34GSYWIIN649J", "Overall": "3.0", "Content": "First the picture is great. The bad part is when you have your computer in one part of the house and the TV in another part of the house. Unless you don't mind long Ethernet cords be prepared to pay up to $250+ for Sharp's Powerline Ethernet Adapter. Not mentioned in the owner's manual,and accorinding to Tech support, this TV cannot be used with a Third Party Wireless Adapter. Sad.....", "Date": "September 7, 2010"}, {"Title": "Great TV", "Author": "James Urie", "ReviewID": "R36XCZ0WW8R2IC", "Overall": "5.0", "Content": "Best electronics/entertainment purchase I have ever made. The viewing experience is wonderful, I am very impressed with the Sharp four color system.", "Date": "March 6, 2013"}, {"Title": "Above the highest", "Author": "jtusmc", "ReviewID": "R8U52WJFRVDZ4", "Overall": "5.0", "Content": "We bought this tv for our 1st new tv and WOW!!! The color is crisp, vibrant and superb. I love that it has netflix built in so we can stream anything for our kids! The power leaves on the bottom make it nice for us energy savers to see how much we are really saving or using. This Tv is by far the BEST tv out there and I highly recommend it to anyone. The price is well below what its worth with everything you get!", "Date": "June 13, 2012"}, {"Title": "THE best value for these features", "Author": "MLipenk", "ReviewID": "RJFW7HA88AIOJ", "Overall": "5.0", "Content": "This is my first LCD TV and I researched for years. Looking for the best bang for my buck. Well, I found it in this Sharp! I considered mostly Samsung and Sony because of the brilliant picture of those brands when seen in the stores.  I also considered Vizio at my local big-box store simply for the cost factor.  My main criteria were 120Hz, LED, and at least 40\". Internet connectible was nice, but not a big thing for me because I don't have fast enough internet to take advantage of those features anyway.  Sharp wasn't even on my radar till I saw one in the store beside the Samsungs and Sonys.  The picture was outstanding. I would have thought the Quatron extra yellow pixel to be a gimmick until I actually saw it for myself.  The colors and contrast on this TV were second to none! Every bit as good if not better than any other brands I researched and at a price that feature for feature was not even close. The menu system and adjustments on the TV are very intuitive. Adjustments are easily done. If you feel you've over-adjusted you can simply select the \"reset\" option. I especially like that the volume is regulated between shows and commercials. Also, in addition to your typical mute button there is a \"Freeze\" button to freeze the picture. This is great during prime time when you anticipate inappropriate commercials that you don't want the kids viewing while you go to the bathroom. You can mute the TV and freeze the picture on a harmless Activia commercial or something, while you do your thing.I thought 46\" may be too big for my room but it is just the right size. It looks great 6 ft away and at 15 ft away. I suppose the sound is a bit thin on movies, but for regular TV the sound is easier to hear at a much lower volume than my old CRT TV which always seemed to be cranked to an annoying level.  I also liked the design of the bezel. The TV looks very Apple-iPod-ish in design.  I'm not a big fan of the highly reflective piano-black plastic bezel on any TV brand though. My room has a lot of windows and I thought this TV may be too reflective, but the high contrast and brilliant colors more than make up for any glare that may be present. Most of the glare actually comes from that annoying piano-black bezel. The movies we have watched using only a PS2 as our DVD player (mainly animated kids movies) looked amazing. I plan to marry this TV to a Sharp BluRay DVD player and a Sharp sound bar so I have a seamless system. I believe Sharp is now coming out with new models, but if you want a feature rich TV with an outstanding picture for a price that easily beats the other big names, I highly recommend checking out a Sharp Aquos Quatron of some variety.Update:  I recently purchased a SHARP BD-HP35U  BluRay DVD player to go with this TV.  The picture on regular DVDs with this TV is wonderful!  Many of the features of the player/TV are cross-functional with either remote.  The SHARP BD-HP35U  BluRay DVD player also has a wireless option, so if you don't have a wired network connection close to your SHARP TV you can still get Netflix, YouTube, etc. wirelessly.", "Date": "May 9, 2011"}, {"Title": "where have you been Sharp?", "Author": "peteski", "ReviewID": "R1VWRPKRASL0T7", "Overall": "5.0", "Content": "WAS LOOKING TO UPGRADE FROM A 42\"TOSH TO A 46\"-52\" LED. HAD SAMSUNG,LG AND TOSH(IN THAT ORDER)AS MY CHOICES. THEN SAW A DISPLAY OF THE SHARP QUATTRON WITH THE QUAD PIXEL.IT RAN TO THE HEAD OF THE PACK WITH THE ADDITION OF Y TO THE NORMAL RGB MIX ANDTHAT MADE THE DIFFERENCE FOR ME.I KNOW THAT PEOPLE ARE BRAND LOYAL,BUT SOME OF MY FRIENDS WHO HAVE SEEN THIS TV AND REMEMBER SHARP PRODUCTS FROM THE 70'S AND 80'S ARE NOW BLOWN AWAY TOO.HAVE TO PLAY AROUND WITH THE MYRIAD OF SETTINGS OPTIONS,BUT THAT'S JUST PART OF THE FUN.SETTLED ON,JUST FOR ME, STORE MODE WITH THE DYNAMIC SETTINGS ADJUSTMENTS.AND BLU-RAY IS AS CLOSE TO 3D AS YOU CAN GET WITHOUT WEARING THOSE GOOFY ROY ORBISON GLASSES.AMAZON WAS AMAZING,AND THE DELIVERY ELECTRONIC EXPO FOLKS EXCEEDED MY EXPECTATIONS BY ARRIVING EARLY ON THE DELIVERY DATE.KUDOS AND ACCOLADES TO ALL.BTW SHARP,YOU REALLY NEED TO GET MORE AGGRESSIVE IN PROMOTING YOUR PRODUCT IN THE MAIN STREAM MEDIA.THIS IS JUST MY TESTIMONIAL.", "Date": "April 29, 2011"}, {"Title": "As Advertised", "Author": "armuza", "ReviewID": "RCS6DDWSSHHDE", "Overall": "5.0", "Content": "Product is as advertised and previously reviewed.  The picture is bright and consistent across the width of screen.  After playing around with the settings it was pretty easy to get the picture how I wanted it.", "Date": "April 27, 2011"}, {"Title": "Outstanding TV", "Author": "Tex Styl Smoker", "ReviewID": "RU90QYBJ27UQJ", "Overall": "5.0", "Content": "Bought this because the 52\" only had HDMI inputs and we needed component and the red/white/yellow plugs.  Best tv I've ever had.  Love how it will swivel on the stand and the picture is like sitting on the front row at a game.  Sometimes I get a thin line of \"snow\" on the top edge.  Don't know what causes that but it only seems to happen on non-HD channels.  I haven't read the manual yet or customized the settings, but so far this tv is great right out of the box.  If you use the stand realize you only get about 2 inches of clearance to the bottom of the tv.  I only have one shelf for everything and had to stack the tv on some wood to make room for the DVD player and cable box.  Overall I'd recommend this to anyone who's #1 priority is a great picture.", "Date": "April 16, 2011"}, {"Title": "Picture jumps off the wall", "Author": "WarWagon", "ReviewID": "RUMOMEM0SAZ0A", "Overall": "5.0", "Content": "After visiting two big box stores, we stood about 100' back from the display wall, and watched which of the 25 hd tv's picture jumped off the wall. In both stores, but were Sharps. That sold me. This is a good way to judge picture quality.Sound qualiy is good, if you select wall mount mode, it defaults to stand mode.I have this hooked to my ethernet lan, and am watching Netflix on it. The built in network is pretty lame, so I ordered a Roku box. Hooking up the ethernet is handy for firmware updates, which this one required out of the box.Netflix is limited, no search, it just shows what ever is in your queue. No Hulu either. Buy a Roku DX box with this.I was planning on buying a larger model, but the 46\" seemed just right, not too small or overly huge.", "Date": "December 4, 2010"}, {"Title": "gr8 tv but not many options for live streaming", "Author": "Rajanikanth Pandiri", "ReviewID": "RVOVZ5AUQEJG", "Overall": "4.0", "Content": "Pros: Excellent picture qualify by sharp with new \"Yellow\" color addition. Instant streaming from Netflix.Cons: No Youtube, Basic Aquos Live, The default widgets are not much use.Sharp has to improve some basic stuff.", "Date": "May 9, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Full HD 1080p (1920 x 1080) Resolution - with more than 8 million dots for the sharpest picture possible.\nQuad Pixel Technology - featuring a 4 color filter that adds yellow to the traditional RGB.\nUltraBrilliant LED system - includes a unique double-dome light amplifier lens and multi-fluorescents, enabling high brightness and color purity.\nFull HD 1080p X-Gen LCD Panel - is designed with advanced pixel control to minimize light leakage and a wider aperture to let more light through, providing the industry's highest contrast level.\n120Hz Fine Motion Enhanced - for improved fast-motion picture quality.", "Name": "Sharp LC-46LE810UN AQUOS 46-Inch 1080p X-Gen LCD HDTV with Quad Pixel Technology", "ImgURL": "http://ecx.images-amazon.com/images/I/51pQAhK0LQL._SY300_.jpg", "ProductID": "B003E1WIPW"}}