{"Reviews": [{"Title": "Great picture + networking = total winner", "Author": "Uluru II", "ReviewID": "R1ZBHJDUQWFRQ7", "Overall": "5.0", "Content": "This is my first HDTV, so keep that in mind - I was bound to be wowed by HD, no matter what the TV.  But I really like this one.  It has excellent specs (high contrast ratio, 2.7ms response time, 120 Hz) and a 'picture wizard' that seemed to do a great job in calibrating the picture settings.  It supports the latest HDMI specs, and has some nice features like Real Cinema (which maintains film's 24 frames per second when watching a movie with a compatible source), and also the ability to tweak the settings of TruMotion, LG's image interpolation system.Interpolation is what 'smooths out' video on HDTVs - it actually creates additional frames on the fly to fit between the existing frames of the source, and it's what can give HD material that documentary/soap opera quality.  Sometimes that's desirable, but other times it just looks bad and cheesy.  This TV has Low, High, and User settings for this feature.  I was able to tweak the User setting to a good compromise, that smooths out some of the blur and 'judder' effect of normal video, but doesn't make it look artificial.  There are lots of other settings to tweak, for audio (downmix preferences, dynamic range, etc.) and everything else.  This brings up the user interface.  The menu system on the TV is very user friendly, and graphically attractive.  The remote control is one of the best I've used - it has just enough buttons, while being well-laid out and thin and light, and fits nicely in the hand.  The 'arrow pad' to move left/right etc. has comfortable buttons and works well (remotes often screw that section up, for some reason, but not this one).My favorite feature has to be the networking/Internet capability of this TV.  When I bought this TV (at a store) it came with a free Wi-Fi USB stick, so it was a good deal, but be aware that on its own the wi-fi stick is an unreasonable $70-80, and you can't just use any old USB adapter, it has to be a special LG one - at least it seems to work very well and it's N or G capable.  Or, you can also use the TV's wired ethernet port - even a 50' ethernet cable would be cheaper than the wi-fi stick.  In either case I think it's well worth the cost to unlock the TV's networking capability.  (***EDIT: I have recently seen the LG wi-fi sticks being sold at stores and on Amazon for around $35-45***) Built into the TV are the streaming Netflix interface, VuDu, YouTube access, and more, including Yahoo Widgets - this lets you access your Yahoo account and any associated widgets, like Twitter, weather info, stock feeds, whatever.  I only really use Netflix and VuDu in this section, but it allowed me to eliminate my Roku box and remote.  When you already have a computer or laptop in the room, the Yahoo Widgets thing seems a little superfluous - this TV is NOT a replacement for a computer with internet by any means, but for some people, being able to quickly check the local weather or movie showings, etc. on the TV could be valuable.The best part about the networking feature is that it will let you stream media from any computer on the network.  You just need to install some included Nero software - which, by the way, is actually small, un-bloated and simple, unlike any other Nero product - and voila, your PC is a media server.  You designate a folder (or however many you want) to be your media folder, you put videos, music or photos in it, and you can access them on the TV.  It really works well and it's very easy to do, literally just a few clicks of the remote.  I found that even streaming a 1080p mkv file wirelessly from my PC worked fine and looked fantastic.  There are a few caveats - for one, it only supports mp3 for music (why not FLAC, or iTunes format?).  It supports a lot of video formats (mkv/mp4,avi, divx, and more), but not all of them, and even for supported formats it may be finicky with specific files.  Usually, converting the file to another format will solve the issue and make it playable; this is annoying but it's only happened a few times out of dozens of videos, for me.  Occasionally, fast-forwarding or reversing through a video streamed from your PC can be confusing and slow (you backtrack 15 seconds, hit play, and it plays about 2 seconds before where you started).  This and the other issue could have everything to do with improper video encoding, and nothing to do with the TV, I don't know.  But given that the TV will automatically update its firmware through the network, one might expect these bugs to be gradually worked out.  Hopefully, they will even add support for more file formats with future updates; it's just a matter of adding more codecs to the firmware, which seems like it should be easy to achieve.The styling of the TV is subtle and not cheap-looking, unlike some brands (*cough*Vizio*cough*).  It's just a clean piano-black border around the picture, with a tasteful LED 'bar' light that stylishly fades from red to blue to indicate power.  The stand is easy to assemble (just install some screws) and looks nice while supporting the TV adequately.  The screen has a matte surface, so glare, while not totally eliminated, is not an issue.  The typical buttons (power, channel, input) are on the right side, out of sight when viewing from the front.  This TV has plenty of inputs - 4 HDMI, two component, two old A/V (the red, white and yellow kind), and normal cable input.  It also has an optical audio output, which will let you consolidate all sources into one stream.  This is great, because I no longer have to switch my AV Receiver between sources - cable, Blu Ray, VHS and Wii all go through the same input on my receiver.There's only one feature I really miss - the ability to control my receiver volume from the TV remote.  My old tube TV remote could do this, so why not this new juggernaut?  Like all flat TVs, the built-in speakers on this one are adequate but not much more.  You'll definitely want a home theater setup, or at least a simple receiver with a pair of speakers, to do the big, beautiful picture justice in the sound department.  (BTW, Blu Ray looks stunning on this TV!)I'm really quite delighted with the LG 42LD550.  It's one of the few major products/appliances I've owned that met and exceeded my expectations, and I have to dig pretty deeply to criticize it.  Even these criticisms are happily brushed aside, given how much I like everything else.  My only regret is not splurging on the 46-inch version. :)", "Date": "August 19, 2010"}, {"Title": "Enjoying TV, nice picture, great features.", "Author": "Ferk V", "ReviewID": "R3DSG2ZJI750R3", "Overall": "5.0", "Content": "TV is great for the type (LCD) and price.  The picture is bright, good contrast, and very smooth.  The menu/remote are very comfortable...overall the picture is very nice.  Aesthetically, the TV looks great as well...no cheesy features or decorations.  This is my first LG product and I'm very pleased with this set.  Also added the wireless adapter ($70).  The entire setup and interface are very intuitive.  This is a kids TV and they had Netflix down in no time (even the 5 year old).  My only wish would be a backlit remote control.Only complaint at all is with shipping.  It did not ship on time and there was no communication from the shipping company.  Ultimately, I had to contact the shipper to make an appointment (was stated that they would contact me).  Once I called them, they drove it over the next day (Saturday).  All in all, still very pleased.", "Date": "June 7, 2010"}, {"Title": "You are in for a big surprise", "Author": "Frank O.", "ReviewID": "RBX9ZS5FDJ00T", "Overall": "2.0", "Content": "I bought this TV a few weeks ago after reading many nice reviews about it, and while it's nice, I found its features disappointing.To start with the good part, this TV indeed looks great both on and off: its no-frills design is very elegant and will make it look good in every living room, its picture quality is amazing. I can't really comment on the sound since I don't have good speakers, but I'm not even missing them with the built-in speakers. Its TV-related functionalities and interface is also nice, with zillions of options to set the picture and sound to your liking.However, the selling point of this TV is supposed to be the built-in software for online applications (called Netcast), and Netcast on the 42LD550 is a major letdown. At the time of this review LG doesn't have model-specific information on the Netcast features available, only a generic all-promises page with the fine print \"features vary by model and product category\". Now, Netcast in principle has at least three different video-on-demand services built-in, as well as internet radio, and many other great features -- but this TV has almost none of these included! (I'm using the latest software version, as it updates itself automatically.)Netflix is included (that's the one extra star), and there is a dumbed-down version of Vudu, which only includes the movie rental features, but nothing else. (For example, there is no Pandora, even though it is included in the \"real\" Vudu application, it's only left out of the LG version). The rest are useless \"apps\" and a few selected Yahoo Widgets (all the good ones are missing, the best is probably Weather), Flickr, Picasa, Youtube and Twitter (twitter on a TV??), and that's pretty much it. But there is no Amazon On-demand, no TV On-demand, no internet radios, and I am listing only missing features that are available in some TVs with Netcast or Yahoo Widgets, but are not on this one.Another (minor) quirk is that this \"wireless-ready\" TV requires an extra USB wi-fi adapter (LG AN-WF100) to actually go wireless. This is also made pretty clear in the specifications; the only problem is that it's not easy to find this adapter anywhere! (At the time I bought the TV it was only available from a third-party vendor through Amazon marketplace, and it wasn't cheap.) So if you want wireless, check first if this adapter is available.At the end I'm not sure why would most buyers get this model. If you just want a sleek TV with great picture and sound, then there's no use paying for the internet-related features, and you can get a better or larger TV for much less money. It's perfect if you are considering buying a great TV with no internet features and a Netflix box - it may or may not save you money, but you get everything in one package, saving you the set-up or cable issues. But you may have cheaper options using a Netflix box, or if you already have a video game console, or by connecting your PC to your TV and using some media center software. If you expect all the bells-and-whistles from your internet-connected TV, then you have to get another model, because this one is really just a beautiful TV with a built-in Netflix box.", "Date": "August 13, 2010"}, {"Title": "I think it's love.", "Author": "Ryan Boam", "ReviewID": "R2SNE4G2IPA30C", "Overall": "5.0", "Content": "I had been planning on buying a new tv for quite a while, and did as much reading and research as time would permit.  I kept coming back to the LG 42LD550.  What really sold me on it was the Netcast (powered by the WiFi USB dongle), super-high contrast ratio, wireless-ready, and the price.  The price!  Man, a tv like this would have cost several thousand dollars a few years ago.At any rate, I've been working this set for about 2 weeks now, and I love it.  The picture quality is amazing, it's very responsive, the remote is very good, and even the speakers are decent.  If you spring for the wireless box, you have the option of mounting it straight on the wall with no unsightly cables hanging off of it (or being routed through the drywall).  Now it makes for a beautiful centerpiece of my entertainment center, which the wife loves to show off (win-win).The World Cup is going to look mighty nice in HD on this tv!", "Date": "June 7, 2010"}, {"Title": "Seeing is Believeing", "Author": "Dennis F. Lasanen", "ReviewID": "R1IXA1EEM13E9K", "Overall": "5.0", "Content": "I am very pleased with the LG capability.  It receives movies from Net Flix thru my DSL connection.  It was easy to program.  It also receives extra HD stations thru the basic cable service.  I was previously viewing from a Sharp 32\" LC-32D43U Aquos 2008 TV but was only able to receive Net Flix thru a graphics accelerator card connection from my Dell Computer by HDMI connection.  I receive a lot better quality sound from this LG. Adjustments are easier to make  for the picture and sound.  The quality will be remembered long after the price that was paid will have been forgotton.", "Date": "June 9, 2010"}, {"Title": "Terrific", "Author": "timmy84", "ReviewID": "R399Q60QASOOY0", "Overall": "5.0", "Content": "Excellent LCD TV.  Setup is easy, aesthetics are good, picture quality is fantastic, and the menus are intuitive.  I bought the WiFi adapter and it works flawlessly.  Setting up the network connection was very easy (I am not techy at all and it was only a few simple steps).A few specific points to make:The base is wobbly side to side (which is better than being wobbly front to back I suppose).  If you don't have small children running around who may knock the TV, it shouldn't be an issue.  But it makes me nervous everytime I have to move the TV stand or the TV itself.TruMotion: The standard picture rate is only 60 Hertz.  This is the appropriate setting for most regular television shows.  You have this setting as long as the TruMotion setting is \"OFF\" in the picture menu.  If you turn the TruMotion setting \"ON\", whether it is low, medium, high, or custom, regular programs look different.  The refresh rate of the picture is increased and gives the program a look of being rushed.  Some have said it looks \"soap-opera-like.\"  The definition of the picture is not increased at all (still 1080p), but the refresh-rate makes action appear smoother, which distorts the image for regular shows.  To enjoy normal programming, make sure the TruMotion setting is \"OFF.\"That said, if you are watching sporting events, the difference between full TruMotion and no TruMotion is striking.  I always set it to its highest settings when watching sporting events. Because it's live and unstaged, you don't get the same weird feel that you get with regular shows. Edges are crisp, motion is clear, and the overall picture is almost breathtaking.  It makes all the difference in the world.  It means going into the picture menu manually to change back and forth, but it is absolutely worth it.Netflix: The Netflix streaming feature is absolutely worth the price of the Wi-Fi adapter (that is sold separately).  I watch Netflix on the TV almost as much as regular broadcasts.  It is intuitive, clear, convenient, and the picture and sound quality are phenomenal.  Absolutely one of the best features of the TV.I would absolutely recommend this product.  Others may have more \"apps\" or other bells and whistles, but in terms of pure picture quality, intuitiveness, and specific convenient features, you'd be hard pressed to find a better option than this one, especially at this low price.", "Date": "October 3, 2010"}, {"Title": "Had received a bum TV at first, then a replacement that works great!", "Author": "Parag", "ReviewID": "R17FGW08GBFDZ4", "Overall": "5.0", "Content": "Let me just say that if you are not getting a good picture on this TV then most probably it has a defective component inside, and you should call Amazon (not LG) customer service to get a replacement. When I got my TV, the picture wasn't so good, and then sometimes, when using Netcast, or connecting my PC, it would start shaking vertically after an hour or so of usage. I tried several adjustments (like turning off Tru motion etc.) but nothing worked.I got a replacement TV soon, and like everyone has already talked about it, it is great!I will just mention about some other things:Amazon Customer Service:=======================I just used the \"call me\" feature, and I got the call the instant I clicked on that button. The customer service agent (probably in India) was very friendly and just asked me what was wrong with the TV etc, and arranged for a replacement right away. Overall, Amazon's customer service for getting a replacement TV went swimmingly.Netcast:==========There seems to be some confusion about what this feature has. Currently, this feature includes1. Yahoo widets - weather, sports, finance etc.2. Netflix - works great, even HD streaming. It can only access your instant queue.3. Vudu - didn't try it, rentals seem expensive.4. Youtube - don't use this much either.5. Picasa - you can watch random public images or even sign in to your picasa account and play slideshows etcThere is no Pandora, Skype etc.Connecting a PC through HDMI:==============================I have my desktop connected to this via HDMI and use the TV sometimes as an extended display. The display is very good. I don't see any pixels etc, e.g., when a PDF file is open - it's good for couch reading. I even use to watch my Windows Media Center stuff, or Skype video through my PC on this TV.Shipping-  PILOT Vs CEVA:==========================My first (bum) TV was shipped by Pilot. There was only one delivery man who struggled to carry the whole box inside. While assembling the TV etc he acted as if he was doing a favor to me. Didn't even have tools for the job. Though, later I found that the carrier is supposed to setup the TV for you, and also power it up to see the menu screen and check for any visible cracks.My replacement TV came via CEVA. And the service was awesome!! and very professional. Two people team lifted the TV and were very careful with its handling. Also, they told me upfront what they will do and what not (for e.g., they will not help you set up your cable connection etc). Overall, I was much impressed by CEVA's service.Both the carriers did call me in advance to let me know of a delivery time, and also an hour before actual delivery.Other features I like:==========================1. I like the \"My Media\" feature. It connects to your PC through the same LAN cable you have installed to use Netcast. You have to install the server software (included) on your PC. You can access your videos, music and pictures stored on your PC right on TV.2. Intellisensor is good. I like its adjustments based on the ambient conditions.3. Remote is easy to use.", "Date": "September 19, 2010"}, {"Title": "Excellent TV", "Author": "Derek Hammond", "ReviewID": "R2PD124NDMPCN1", "Overall": "5.0", "Content": "This is a great TV. Works well with our AT&T; U-Verse. The best feature of this tv is the NetCast. Netflix videos are beautiful. The ability to rent movies from Vudu is fantastic. You get one free rental with the tv. Nothing bad to say about it. Love it.", "Date": "June 28, 2010"}, {"Title": "Great picture and functionality, acceptable sound quality, Impresive specifications", "Author": "H. Narasimhan", "ReviewID": "R3LWSIWF59BGFJ", "Overall": "5.0", "Content": "This is my first LCD TV and I spent few days doing some research to choose a good TV. I did a specification comparison between several LCD TVs and finally had to decided between LG and Samsung. I choose LG TV as this one has 120HZ with 2.4 ms refresh rate.I am not sure how do these features affect the picture quality but this TV has excellent picture. I mostly watch movies over internet using netcast/DVD player and didn't watch fast sport action yet. Sound quality for this TV is regular and you need to buy speakers if you want something special.The wining feature for this TV was the Netcast functionality. I watch a lot of Netflix streaming over internet and this works great for me. You need to have atlease 3 MbPS connections to watch HD movies. Currently you can only have Yahoo Widgets, Netflix, Vudu, Picasa web album and Youtube available (no web-surfing).I am disappointed that I had to buy a LG wireless adaptor ($ Seventy) to access wifi. You can use a LAN wired connection as default without the adaptor. This TV also has some power save modes which I am using a lot to decrease the brighness when needed or switch off the display when not needed (listening to music). As this is not a heavy TV (around 40 lb), so it is relatively easy to hang this on wall.If Netcast is not what you need then I would recomend to have a look at LG 42LD520 which is a chaper bet than this one. I bought this TV when there were no review in Amazon but I am happy with my purchase and price.I don't have Cable or Dish at my home so I can't comment on that.", "Date": "June 10, 2010"}, {"Title": "I would have bought local if I knew what I know now", "Author": "Ihang10", "ReviewID": "R1KQTZN8143U6P", "Overall": "2.0", "Content": "This was a great TV for the 35 days it worked, but it has been a hassle since the beginning.  After haggling with Amazon's shipper for three weeks, my TV finally arrived.  It worked great, then it stopped working, two days after my return eligibility for Amazon expired.  Hoping for Amazon's customer service support was really the only reason I purchased this through them.  Once the return window closed, I was not able to return to Amazon.  No big deal, just call LG, right?  Yeah, right.  They scheduled me for an in-house appointment.  The day before the local service center called to tell me they knew what was wrong and it would be 3-5 days before the part would arrive.  Know what is wrong without looking at it?  Seriously.  Hmm, okay maybe if Thanksgiving wasn't in a couple of days.  I called LG again, and they said I was pretty much stuck with the local service company and would provide no other solutions or compensation, and that the first customer service rep shouldn't have told me someone would be out on the first available appointment.  So, I have a really good looking paperweight until they can show up...stuck with a TV that won't work and Amazon is no help at all.  I guess we can listen to the games on satellite radio.With a purchase of this magnitude, if I did it all over again, I'd go to the local big box store.  I learned, you should learn from me.", "Date": "November 22, 2010"}, {"Title": "Nice picture, lots of gizmos", "Author": "W. Beau Christian", "ReviewID": "R3FNTRWGOT22HS", "Overall": "5.0", "Content": "I finally took the leap to flat screen, LCD, HD television and have not been disappointed.  I selected the 42 inch size as being about right for my den, and chose LG due to reviews and a few news articles about the television.  The LG was easy to set up on its stand, although the construction of a new TV stand was not - but that's another story!  I get a great picture whether live or from DVD.  I guess my only problem with it is that it has lots of gizmos to figure out.  I tried to put on a wireless LAN and never could make it work.  Ultimately I ran another cable from my router to the TV and that got the widgets and movie rental screen going.  There are so many ways to modify the picture that it required me to spend some time with the manual and remote control. I didn't know, for instance, that I could switch from HD to 'normal' picture on the same channel.  All in all I am quite pleased with the product and my learning curve is my problem, not that of the product.", "Date": "August 2, 2010"}, {"Title": "Excellent TV", "Author": "Terry M. Kinane", "ReviewID": "R1Z27JCTCNKQC8", "Overall": "5.0", "Content": "I recently got my LG 42LD550 as a free replacement from an Extended warranty company. It was one of three brand new TVs offered to me as a replacement for my two year old Sanyo. I really made the right choice with the LG 42LD550.This TV is awesome. The picture quality is superb, and you can either make simple manual adjustments like, Backlight, Brightness, Contrast, color etc, or you can use the advanced mode to really calibrate the TV. The on screen menus are easy to use whether you are a novice or an expert.Being a 120Hz TV with the Trumotion feature, watching fast moving sports is great on this TV. I left my Trumotion setting at 'Low' and everything looks great.This TV has too many options to discuss here, and it offers high end functionality for a retail price of between $800 and $900.Highly recommended.", "Date": "July 8, 2010"}, {"Title": "A year of searching or an HDTV was worth it!", "Author": "D. Fanton \"Another Music Lover\"", "ReviewID": "R15MP24W42DQ7R", "Overall": "5.0", "Content": "I purchased this set from Amazon about a month ago and have been very happy with it.  As you would expect, I spent a lot of time researching HDTVs both online and in stores.  I had initially been looking for a 46\"+ model but after spending some time looking at them in person I determined that a 42\" set would be a better option.  I use the TV primarily for viewing HD cable and gaming on an XBOX 360.  A larger set would have been too big for the room and gaming would have been a headache.Free delivery (through Pilot) went smoothly.  I scheduled my delivery date at checkout, followed the progress on Pilot's website, and called to follow up the day before (they did not, and would not have called me).  Setup only involved affixing the swivel stand which, while not rock solid as other reviewers have noted, is no less stable than other flat screen stands I've seen.  There is an included attachment screw if you wanted to semi-permanently mount it to your entertainment center.Initial setup was easy and I never needed the included users manual CD.  There are a lot of settings options which initially overwhelmed me but I found a great forum with a number of settings and a wealth of other information for this particular model (the AVS forums are great).  I'm happy to post a direct link in the comments if anyone is interested.Image quality, black levels, contrast, viewing angle and even sound are all wonderful.  I have a pioneer surround sound system that I have yet to bother setting up since I haven't had the need yet.  I've only gotten the set cranked up to half way (15 or so maybe) and it was plenty loud.  We usually watch it on 8 or 9.Also, I had considered the 520 model of this same set (as I'm sure others have) but opted for the 550 due to the slight increase in dynamic contrast as well as the internet connectivity.  I have no need for the wireless adapter as the TV sits right next to my router.  The network connection allows for automatic software updates which can add functionality or troubleshoot bugs.One important note is that a recent automatic update changed the Netflix interface, adding many more functions, category browsing, search capability and a new layout (I may try to post some pictures when I get a chance).  While I previously used my 360 to stream Netflix movies, the ease of using the TV alone can not be overstated.  The picture quality is great (obviously depending on your connection) and the controls are intuitive.  I've also fiddled with Youtube a bit and set up some of the Yahoo widgets but Netflix will be the primary use for the Netcast feature.I'm still tweaking some of the settings but the set lets you adjust and save settings for each input.  I've programmed a different picture mode (game vs. cinema) and completely different settings (backlight, contrast, TruMotion, etc.) for the cable and the xbox and all I have to do is change the input and the tv applies the settings I've programmed.  Inputs are initially labeled as \"HDMI1\", \"HDMI2\" etc. but you can select from a number of preset labels and icons (cable box, game system, etc) and assign them to the appropriate input.  It's a simple feature, but a very handy one.  In general, gaming looks great and I've yet to notice even a hint of input lag.Overall, I'd say this TV ranks at or near the top of its price category and gives models costing a few hundred more a run for their money.  After spending the better part of a year looking for just the right mix of value and performance, I'm happy I waited for this LG.  It's been just what I was looking for.", "Date": "October 13, 2010"}, {"Title": "Horrible customer service", "Author": "Bri", "ReviewID": "R2LPRO994Q5MDG", "Overall": "2.0", "Content": "LG has the worst customer service! This TV developed a small white line down the screen shortly after we got it. 3 weeks later it is still not fixed! LG has offered no form of compensation.Finally did get an LG rep out to fix it. Loved the TV until 2013 when my son threw a toy car at it and broke the screen. The TV was already too outdated to be fixed. Really??? The screen was no longer being manufactured. We ended up buying the newer version. I am loyal to LG TVs.", "Date": "October 22, 2010"}, {"Title": "awesome", "Author": "A. Bell", "ReviewID": "R1PPV2OJQXBALD", "Overall": "5.0", "Content": "Great TV. Sound is a little tinny, but that's to be expected from such tiny speakers. They're not visible, which is nice.The TV can access netfix, yahoo widgets, youtube, vudu, picasa, gives you the weather and has games! Every time I dig into the menus I find something new. Also, it automatically updates it's own software -- which I love for some reason.Overall, it's just awesome. Buy 2.", "Date": "July 21, 2010"}, {"Title": "Why LG may be a better choice than Samsung!", "Author": "Internet shopper \"Retired but not tired!\"", "ReviewID": "R1TFGRZXXFHBEM", "Overall": "5.0", "Content": "This brief review compares certain features of the LG 42LD550 with Samsung LN40C630.These features applies to all sizes of the LG LD550 series and the Samsung C630 series.I had the opportunity to test both TV sets side by side (See Technical Problem below).IN GENERAL- First of all the pictures on both TVs are outstanding.- I did not notice any imperfections in the LCD display on either set.- The base on the Samsung is of superior quality and very rigid whereas the LG model is a bit flimsy (this is irrelevant if you mount the TV on the wall).- The remote controls are comparable however the Samsung has built-in light and the LG does not.- The LG's price tag was $78 higher than the Samsung however the screen on the LG is two inches bigger and the LG has more features (details below)TECHNICAL PROBLEMOne of my objectives was to view MP4 video from a USB hard drive and from USB memory sticks.The Samsung would play part of the MP4 movies and suddenly stop then skip to the next movie when playing from either the stick or the hard drive.It would play 1 hour 25 minutes and 43 seconds of two of the movies and only 24 minutes of a third movie.I tried a 30 Gb and 8 Gb formatted with NTFS and FAT32 respectively.Yes, I verified that the latest software/firmware was installed by connecting the TV to the internet via the Ethernet port.I tried both USB ports but the problem remained.SAMSUNG \"TECHNICAL SERVICE\"The Samsung customer service rep explained \"that this TV model was not designed to play full MP4 movies, only short clips\".She offered to schedule a service visit but made it very clear that they would charge me for a service visit if they did not find a problem with their hardware.I talked to two representatives and finally asked to talk with a technical service rep. They promised me that he would call me back within 24 hours.I eventually gave up waiting, returned the TV and ordered the LG for an additional $78 instead.Nobody from Samsung has ever called me back (it has now been weeks).WHY LG MAY BE A BETTER CHOICEThe LG model has no problems playing my MP4 videos. It plays from my 1 TB hard drive and any USB memory stick (FAT32 or NTFS format).It will even play M4V video which is Apple's file extension for MP4 containers.Here is the best part!Apart from the extra 2 inches (screen size) the LG model offers:1) Netcast, providing direct access to online viewing of Netflix, YouTube, Yahoo weather (and others).2) Free Nero MediaHome 4 CD opening up for Digital Living (DLNA) capability allowing you to access wired or wireless computers or other networked devices throughout your home to the TV.NETCASTUsing the Netcast feature, I no longer have to have my laptop PC connected to the TV to watch NETFLIX and it appears that the picture and sound quality is better than via a connected PC. Also I like to be able to select, start/stop and pause the movies from the LG remote.The TV has the RGB and stereo mini plug for a PC in case you still want to hook one up.I connected the TV to my home network by wire because I like the \"wired\" Ethernet speed and reliability (wireless is also available - see other reviews for details).NETFLIX was very easy to set up. Simply push the Netcast button on the LG remote, click on the Netflix icon. Enter the code displayed on the TV on your PC and you can start watching Netflix movies (obviously you must have a Netflix account or sign up for one). For only $8 per month you can watch unlimited movies without commercials. (I have come to realize that life is too short to spend part of watching TV commercials).DLNA (Digital Living Network Association)Installing Nero on my computers allows the TV to access any drive on my network. From the LG remote I can browse all Music, Video and Family pictures stored anywhere on our home network (Nero requires you to allow access to the specific folders before the TV is allowed access).The LG rep informed me that TVersity software (free) will also work as an alternative to Nero (I have not tried it yet).INITIAL SETUPThe initial setup was equally easy for both brands. The Samsung software/firmware was up to date. It took a short while for the LG to update from version 06.01.05 to 08.02.16 which may be because LG issues updates when new Netcast services comes online.The initial channel lineup was easier to manage on the Samsung.LG CUSTOMER SERVICEThe TV arrived without the Nero CD.I therefore called LG customer service. They told me that they may not be able to ship the missing CD. Instead they suggested I download the trial version from Nero.I therefore contacted Amazon Customer Service and they instructed LG to send me the CD. LG has confirmed that it \"is in the mail\".I am still waiting for the CD (at the time of this writing).I am currently using the Nero trial version which does not support MP4!!!CONCLUSION$78 for all the extra functionality and two extra inches is well worth it.", "Date": "January 17, 2011"}, {"Title": "Great Quality TV", "Author": "E-Cowboy", "ReviewID": "R1RLGILH842L11", "Overall": "5.0", "Content": "There's not much to criticize with the LG42LD550... Easy to assemble, check.  Easy to set-up with antenna/cable, check.  Stunning picture, check.  Good sound, check.  Great price for the quality and technology, check.Before buying this TV, I thoroughly researched options, compared prices and features, and the LG LD550 seemed to be the clear standout.  To this point, I haven't been the least bit disappointed in the purchase.  With the wireless adaptor, the access to the NetCast applications has been a great value-add and, again, the set-up was straightforward and simple to do.TV shopping is difficult, there's no shortage of options, features, etc.  In looking for a good quality, middle of the road TV, the LG LD550 has pleasantly exceeded our expectations.", "Date": "October 22, 2010"}, {"Title": "No regrets!", "Author": "peptalks2", "ReviewID": "R3O3QOAE8FDJMW", "Overall": "5.0", "Content": "This was an anniversary present for my husband. Not knowing very much about LCD's, LED's and Plasma's I started researching on-line for direction. After I narrowed it down to an LCD I researched the various brands.I appreciated the variety of information on the LG 550 .. I didn't want to only go by what was said on the LG site, after all, what else would one expect to read from the manufacturer but glowing reviews.I found a tech site that offered objective reviews on the top brands. It broke everything down giving opinions/reviews on things in particular as well as an overall review. It offered rankings based on numbers sold in a category as well as a rating based on consumer reviews; then I could read the reviews - good and bad.After all was said and done the LG 550 with netcast and internet capabilities grabbed my attention ... and never let go. I found a great price on Amazon.com. I printed out a description of the Television, a picture of it as well as the specifics/stats and gave it to my husband. We both anxiously awaited delivery ... and we have NO REGRETS!I rate highly the excellent customer service of Amazon.com; they make everything easy - from account set-up to keeping their customers informed of the transaction every step of the way to tracking the shipping.Once we had the LG 550 set up we thought what we felt must be what new parents feel upon the arrival of their first child. We think the look of the television is beautiful - sleek, clean lines. It even comes with it's own cleaning cloth. Everything about the television is, thus far, proving to be just as we expected based on what I had read.We haven't used the Netcast feature yet - were are trying to figure out how to get the service. If I have one complaint it is the fact that more information on HOW to establish Netcast service needs to be included with purchase of the television.Other than that, we are pleased with the LG 550 and would highly recommend it.", "Date": "October 18, 2010"}, {"Title": "Great TV at a great price!", "Author": "B. Myers \"BLMYERS\"", "ReviewID": "R2TQBFHJFGCQVF", "Overall": "5.0", "Content": "I just purchased this TV from Amazon.  While some reviewers don't really appreciate the Netcast it really is a neat feature.  It really is just a novelty item for the TV.  It does not include Pandora but what it does include works without issue.  The Vudu streaming and Netflix streaming are excellent.  That was my primary focus on getting the Netcast TV.  The Yahoo widgets are neat but nothing special.Video quality is excellent.  It is full 1080p for connected HDMI sources and comes in crystal clear.  The video optimization features are top notch and you can create a mode for any environment you are wanting.  The streaming video exceeded my expectations (especially Vudu).Sound always gets a bad reputation with flat screen TVs in this price range.  I haven't had any issues with it.  The sound is plenty loud and has many options to adjust it to your needs.  I do plan on hooking up a blu-ray home theater in the near future to fully optimize my TV experience.There are connections for anything that you would ever want to hook up.  A nice bonus is that there are 4 HDMI ports.  Switching between inputs is a breeze and anyone will find it easy.Bottom line this is a great TV with a great price for the features it offers.  If you expect more than it is listed to do I would recommend spending more and getting what you want.  Electronics are always expectations and price related, so as long as you don't expect too much this is an awesome TV for almost everyone.", "Date": "October 14, 2010"}, {"Title": "Incredible TV, best in its price range.", "Author": "Colin Vesper", "ReviewID": "R3CFHU2U7MSQMG", "Overall": "5.0", "Content": "You can't find a better TV for this price with everything that this TV includes.  Normally I go with Samsung products, but this TV was cheaper and had more features than the nearest Samsung TV.  I was incredibly impressed, and I'm now sold on LG.The simple black frame is beautiful, and the swivel stand is great.  The picture itself is amazing, and it is honestly one of the best looking LCD TV's I've ever seen.  The contrast is great, and the true motion feature is adjustable to reduce or disable the unfamiliar soap-opera effect (IMO having it on low is the best setting.  It looks a little strange at first, but you get used to it, and it's much better than dealing with judder).  1080p just looks incredible, and animated movies like Bolt look so good, you can't believe you didn't know so much was there that you never saw before.I have it hooked up to my xbox, but the extra features it has are very nice to have in a TV.  It streams movies from my computer, connects to netflix, and more more more.  I only wish it had wireless built in, but I had an ethernet bridge, so it's not a big deal.I really can't say enough good things about this TV, so I'll just put it like this:  If you are looking for a 42in TV or have $750 to spend, don't look around any more, just buy this TV.  You will not be disappointed.", "Date": "October 3, 2010"}, {"Title": "Excellent TV for the price", "Author": "D. Statler \"Something given has no value\"", "ReviewID": "RDJQ7WBZUAMNM", "Overall": "4.0", "Content": "I have owned this TV for a couple of months now and have enjoyed it immensely. I love the ability to stream Netflix and Vudu from the TV without an additional box involved and the wireless dongle has excellent signal pickup.The TV gives the user the ability to automatically adjust the picture quality for the ambient light conditions in the room and it also has a very robust set of color and sharpness controls. One down side is it only gives the blue color range, brightness and contrast, no red or green.With multiple HDMI (4) inputs, composite connections, and a digital optical out, the TV has plenty of options for just about anyone.", "Date": "September 3, 2010"}, {"Title": "Best TV I could have gotten for my money.", "Author": "Durza", "ReviewID": "R1WUMRPVQW4C6W", "Overall": "5.0", "Content": "This TV is probably the best I could have gotten for my money. I play a lot of video games on my xbox 360 and this TV makes them all look great. The 120 Hz is definitely noticeable while playing action intensive games or watching movies (720p or better highly recommended).I also watch a LOT of movies. The divix codec makes this incredibly simple for me. All I have to do is take a USB cable from my external hard drive and plug it in to the USB on the side, and the TV does the rest. Having the ability to read and navigate an external HDD partitioned into 2 different file systems (NTFS and FAT32) is impressive enough but through in .mkv support and I'm hooked. (.mkv .mp4 .avi and most other popular video formats tested. 98% of my 400gb movie collection working) I can personally say this TV has better support for video formats then my 360 does. I should also mention it has subtitle support .sub and .srt tested. (another feature the 360 fails to provide).Highly recommended.", "Date": "February 9, 2011"}, {"Title": "Ideal for its price", "Author": "R. Rantamaki", "ReviewID": "RP8F0RHRYPEW2", "Overall": "4.0", "Content": "After some research and comparisons (cost, picture quality, functionality) I settled on the LG 42LD550 - and couldn't be happier. The picture quality is phenomenal. The NetCast feature is built into the TV (just plug in a network cable to the back of the set, OR purchase a separate USB dongle for wireless access). NetCast provides access to your Netflix account, which has thousands of movies available for instant download (if THAT ain't worth the price of admission, I don't know what is). I've already forgotten what the inside of Blockbuster Video looks like!", "Date": "September 22, 2010"}, {"Title": "Excellent TV for the price, LG...Life is Good.", "Author": "Col. \"Hawkeye\" Ty", "ReviewID": "R1YL31UHNVMFIA", "Overall": "4.0", "Content": "Wife and I setup the 42 inch LG in our bedroom. The picture is fabulous. I was so impressed, we purchased a 32 inch LG for the kitchen. Ordering online thru Amazon was a breeze, and delivery was a matter of days. Setup was easy.", "Date": "September 18, 2010"}, {"Title": "LG LD550 LCD TV", "Author": "Philip", "ReviewID": "R2S08SVMOHNSJK", "Overall": "5.0", "Content": "I recently purchased this tv, because my old tv would no longer broadcast all of my provider's channels I pay for due the digital switch. After carefully reviewing other products in this particular product's price line, with the features and specifications I decided to purchase it. I read the other five star reviews here on amazon and decided it would be a smart decision, I also looked at the local Best Buy and found this tv to be quite stunning simply amazon offered a better price. The LGLD550 is a great tv for the money, it produces clear picture, games and movies alike are very clear, the refresh rate of 120hertz does well. Like other lcd tv's if it is bright in a room the black levels while you are watching the tv are not perfect, when the shades from your windows are dimmed the display is very good, in addition the viewing angle is good from quite a wide angle as i caught myself standing on the left and right of the tv to test the parameters and limits of the picture. Although I don't actively use them, energy saving settings are a great addition to this tv, along with the presets such as cinema, vivid, sports and two slots to customize the picture settings that you can save. I currently have it connected to my xbox 360 slim with an hdmi output and games are quite specatular, I am very happy with my purchase and if I ever decide to upgrade I would be very inclined to purchase an LG Hdtv again, I haven't had this product yet for more than a month, but if any problems arise, I will be sure to update this post!", "Date": "August 29, 2010"}, {"Title": "Recommended", "Author": "Diane Major \"Problem solver\"", "ReviewID": "R398ZS1WMTB2WC", "Overall": "5.0", "Content": "This is a great tv and the customer service makes it excellent! I don't have to wait long for help over the telephone and they are very courteous. I wanted to hook up my Dell laptop to the tv and also had a question about the wireless set up. Everything works and it's thanks to the help over the phone!", "Date": "August 27, 2010"}, {"Title": "But Wait... There's More", "Author": "CDubs70", "ReviewID": "R3QIUKJ7X5A42P", "Overall": "5.0", "Content": "I could re-deliver the same positive reviews that other buyers have posted, but I'd rather just say: I agree. The TV is great. What I want to talk about is a feature that gets NO play whatsoever. Yes, the TV is internet ready. And yes, you can add the wifi plug to connect it to your network, allowing you to watch Netflix content, as well as Youtube and Vudu. But what they don't talk about is that the TV connects automatically to any DLNA or UPnP home server (Like Nero Home or Twonky, which I use). What does that mean? You can share your own video, music and photo files from your home computer(s) to your TV. So if you have a folder full of home movies (encoded as mov or avi, and preferably DIVX), all you need to do is share the folder through your server admin panel and then go to \"Menu>My Media\" on the TV and PRESTO! Its there and ready to watch.", "Date": "August 25, 2010"}, {"Title": "First HDTV - Lovin' It!", "Author": "Seth Eaton", "ReviewID": "RYM6384DDE6PA", "Overall": "5.0", "Content": "I purchased this TV after a considerable amount of research into the LCD market. The price easily beat anything that I found at brick-and-mortar stores. Delivery was handled by Pilot, and the TV arrived promptly as scheduled.The unit has a very sleek profile and flat out looks GOOD! Setup was a cinch and I had my PS3, DVD player and Ethernet cable connected in no time. The NetCast feature is a limited but fun perk. Trying to navigate/type with the remote is cumbersome, but Netflix streaming movies look good and sports enthusiasts will enjoy the Yahoo! Sports widget (check all the other scores while watching the game!).I was initially concerned about the sound quality, but the speakers are serviceable for the 8'-15' range. Upgrading from a 27\" tube TV, I expected to be blown away by the picture quality and I have not been disappointed. I recommend turning off the TruMotion feature, though, as it tends to generate that \"soap opera\" feel.I have been very pleased with this TV so far and would highly recommend it.", "Date": "August 19, 2010"}, {"Title": "Lasted About Three Years Then Died", "Author": "Karuna", "ReviewID": "R2L1AWSTLFG91M", "Overall": "2.0", "Content": "The TV itself was great and I enjoyed it while it lasted.  Then just recently it quit working entirely -- just an endlessly blinking red status light.  After doing some research it appears this is not an entirely uncommon problem to have happen.While I was happy with the set before I really can't rate this very high because I expected more than three years out of it for my money.  Every other piece of electronics in my home still works just fine.  Be wary:  getting these things serviced is not cheap (unless maybe you are lucky and know someone who can cut you a deal) and parts are not always easy to find.", "Date": "August 1, 2013"}, {"Title": "LG NETCAST", "Author": "Wil", "ReviewID": "R34JF2KYS17KSJ", "Overall": "1.0", "Content": "First of all the stand was not stable, so i called (LG) and told them of my problem. They promised to send me a new stand and they never did...SECOND is that the TV is not being supported for  Internet updates and we are stuck with the few Apps that came with the TV...Again i called and they said that THERE WILL BE NO SUPPORT FOR THIS MODEL......So my SMART TV turned out to be a DUMB TV....I also purchased the extened warranty...I say People dont waste your money...AMAZON< This has no reflection of dealing with you....Great service......", "Date": "November 15, 2012"}, {"Title": "Amazing Television, Amazing Price", "Author": "Trunkzdbz", "ReviewID": "R1JVLGOI4OB2G4", "Overall": "5.0", "Content": "The Television is a 42 inch LCD HD 1080p, 120 Hz TruMotion, Internet Capable and Wi-Fi ready. The Price $629.99 when I made my purchase, tax free. My jaw hit the floor, it hit the floor for a second time when she finally arrived. She was more than I expected she has 4 HDMI ports, 2 USB ports, 1 AVI, 2 Compost cable ports, 1 Lan cable port to go dial up to the Internet if you wish, or she also has a Wi-Fi adapter port which once purchased for $50 can be put right into the port and boom no more LAN cable you are now Wi-Fi. This is one of the few Televisions which are Wi-Fi ready so far more a slated to be released in the future, but for now this 42 inch LCD from LG is the bad boy on the block. The remote is super sexy and extremely simple to understand and use, it took 5 minutes to assemble the TV once I pulled it out the box. The picture and something called invisible sound which makes the sound even cleaner and sharper blew me away, I jizzed as soon as I was playing Call of Duty, or Dante's Inferno, or Gears of War on the HDMI channels with the 1080p, and the TruMotion 120 Hz which is specifically put on this TV for hardcore gaming and sharper pictures. I cant say enough about this Television you have to experience it your self to understand what I'm feeling and talking about. Buy one today and I know you will be more than happy when she comes in the mail tomorrow. She is sitting pretty in my bedroom and when I take off all the lights and either watch a movie or am playing a HDMI game, I fall in love all over again.", "Date": "February 20, 2011"}, {"Title": "Very Pleased", "Author": "WarEagle13", "ReviewID": "R38REO3DHRGJ16", "Overall": "5.0", "Content": "Wanted/needed a new TV...but could only fit a 42\" in the space I had.  I previously had a Dynex 32\" 720.  After looking over all the Black Friday ads, I decided to go with Amazon's deal on the LG.  I did find some better deals on similar sized TV's, but the reviews and specs for this TV were great, and I didn't want to buy another TV in 2-3 years, so I went with a name brand.I got the TV for $700 and of course free shipping and no tax! It was delivered after about 10 days from a local business.When looking for a TV, I have also been considering upgrading my Tivo (i have a series 2) as well as upgrading to HD cable (i use comcast).  After looking at the picture of this TV, I decided to just save my money.  The picture is great! It is bright and clear.  There aren't any white spots in the corners. I have noticed the \"soap opera\" effect a little, but, that doesn't bother me.  Again, I had a Dynex with no HD.  I'm sure it would be amazing with HD cable, but I'm more than satisfied with my SD cable on this LG.We did get a Netflix subscription for Christmas, so I think I'll purchase the wireless adapter.  Also, I do have an Xbox 360 that I play on this TV.  It's hooked up with an HDMI cable and looks fantastic...no blurring or anything like that.It's amazing the quality that you can get for Tv's these days.  My neighbor spent over $3000 on his tv that's the same size (he bought it several years ago).Again, the TV is beautiful, picture is great even on just SD.  Perhaps some day I will have some extra cash to put towards HD, but until than, I am more than pleased with my purchase through Amazon.", "Date": "December 26, 2010"}, {"Title": "Great, Almost Perfect.", "Author": "Erin Kilkenny", "ReviewID": "R1NX99GWSJFXR", "Overall": "4.0", "Content": "I bought this TV a couple months ago and have been really pleased with it, in general. It's a great value for the price.The picture quality and color is great. For built-in speakers, the audio is pretty good too. As an object, it's one of the better looking TVs on the market. I got the wireless adapter as well, and have been using it to watch Netflix and Youtube, which is amazing, and was my main criteria when I bought a TV. The Netflix app started out being pretty bare bones, but has since updated and works much better - you can now search, it gives you recommendations, etc. I showed some people flickr photos once, which was pretty cool. I've also plugged my laptop into it (with a DVI to HDMI cord) to watch things on Hulu and iTunes. It works, it's easy, it all looks great.What sold me on LG rather than other brands, and what I'm ultimately very impressed with, is the design of the menus. I always seem to be changing inputs and settings, and the user interface is very clean, functional, easy to use, and aesthetically pleasing. I wish more electronics manufacturers would pay this much attention to that particular detail.Here's three (very small) cons: 1. The only audio outs are an optical out and a headphone out. My stereo is kind of old, so it has no optical in, and I've been using the headphone out. No big deal, but it would be nice to easily have a permanent hookup. 2. I wish there were more services included as part of Netcast - namely Hulu at the moment. I don't know what LG's plans are to upgrade this, but since a TV like this is a 10 year purchase, I'd be curious to know if there will be any integrated access for services that don't even exist yet. It's not a dealbreaker, since it's easy enough to plug a laptop into the TV, but it's nice not to have to. 3. More of an idea - How about an iphone/droid/blackberry app so you can use your phone as a keyboard for typing in search terms? It takes forever on the numeric keypad on the remote.Anyway, get this TV. Great picture, great features, really well designed.", "Date": "November 29, 2010"}, {"Title": "Excellent Product at a Great Price!", "Author": "Robert R. Branch \"phishhead\"", "ReviewID": "R3K6B5R6DIAWZ6", "Overall": "5.0", "Content": "I did extensive research prior to buying this LG LCD 42\" flat screen tv with internet ready capability. I couldn't be happier with the tv set! It is easy to use, has a great picture, and I can stream my netflix and utube videos right to the unit via my wireless router. For under $750 delivered to your door, I would highly recommend this product. If you don't need the internet function, you can get the same tv for $650 or so. Amazon even uses an expensive freight service, which you don't have to pay for, making the delivery quick and secure.  Thanks Amazon!", "Date": "November 27, 2010"}, {"Title": "Great TV, researched and tested", "Author": "zackg", "ReviewID": "R1ZSQR1VHX7KUG", "Overall": "5.0", "Content": "After doing some research and visiting many retailers to see the TVs in-person (a must), I decided up on the LG 42\" 550.Set up right out-of-the box and works great w/o changing any settings. Extremely happy with my purchase.One thing to note:The only audio out from the TV is optical (besides a headphone jack).My only personal issue with this is when using NetFlix (all other sources go direct the the Home Theatre).The optical out doesn't seem to play nice with my Home Theatre, even a simulated surround sound cannot be achieved.This may be an issue with my Home Theatre or the NetFlix app, etc, etc.. haven't had too much time to check, but do note the audio out if that's important to you.", "Date": "November 23, 2010"}, {"Title": "Love my LG 42LD550", "Author": "R. Wun", "ReviewID": "R3MD0YRRN981U9", "Overall": "4.0", "Content": "For the price and performance of this flat screen I highly advise those who are looking for one to buy it right away.  I love my LG 42LD550, it is exactly what I was looking for.  I bought it for my bedroom, eventhough my bedroom is small, it doesn't matter, it looks perfect from where I lay.  I purchased this for sports mostly, but I soon realize that it is an excellent screen for movies and tv shows too.  All and all a great buy.", "Date": "November 20, 2010"}, {"Title": "Great TV", "Author": "David Rizza", "ReviewID": "R1N6C6XQABMPXZ", "Overall": "5.0", "Content": "Ordered TV and received within one week.  Amazon had the lowest price and free shipping....no one else came close.  Delivery was by CEVA. Two technicians showed up, hooked up the TV and were done in 15 minutes.  Picture quality is great, no issues so far (only had the TV for three days).  DirectTV came out the same day and upgraded to HDTV in about 2 hours.  They also did a great job.  Highly recommend Amazon, LG DL550 and Direct TV.", "Date": "November 19, 2010"}, {"Title": "Great TV For A Great Price!", "Author": "Romell D. Weekly", "ReviewID": "RTP0XRAPL19DV", "Overall": "5.0", "Content": "I rarely take the time to review products, but I'd be remiss if I didn't review this TV. I paid the same price my mother paid for a Samsung; but this LG has WAY more features and better picture quality at the same 1080 resolution as her TV. This TV has Internet applications that make it extremely easy to connect to the social/video networking sites and video streaming sites (like Netflix).My only gripes are concerning the networking. You have to buy LGs wireless USB adapter in order to connect wirelessly. That was frustrating because I already have a wireless USB adapter and don't see why I couldn't just use it without having to buy something else. Also, the Yahoo Weather Widget could offer better weather forecasts for precise areas. I live in Saint Louis, MO, a major US city, but it wasn't located by the widget. Doing a search by zip code would have been really convenient. But, I guess I can't too much fault LG for this, as the fault most likely lies with Yahoo.Anyway, as you can tell, my two gripes are very minor. You absolutely cannot go wrong with this TV, plain and simple. Be smart and buy one. You won't be sorry.", "Date": "October 2, 2010"}, {"Title": "What an Upgrade!", "Author": "Jon R", "ReviewID": "R239A347MYV0LB", "Overall": "5.0", "Content": "I saw this TV model in stores, and really was impressed with the picture quality.I got on Amazon and was even more impressed with the price it was available at.I'm now extremely pleased with my purchase.  What an upgrade from a 27\" 4:3 CRT television, even though I considered that CRT to be really good quality in the picture department.  I'm using this TV in a room that gets a lot of daylight via a large patio door.  Glare is not an issue, and so much better than with the old CRT.Sound is pretty good through the built in speakers, although I spend most of the time watching with the sound run through a separate sound system.The Internet \"widgets\" are just fluff to me, and I haven't used them.  My other equipment already support Netflix and Pandora, which are the two things I ever want to use via my home theater. But I really don't feel like I paid extra for them being on the TV, as other TV's without them, but with comparable reviews to this model, were not significantly different in price.I like to fiddle with settings, and have to say one thing I wish was better is documentation about all the picture settings available on this TV.  There are many settings if you care to dig into them, but the manual does not explain all of them very well.  There are also some settings that aren't always available (visible, but grayed out in the menu), but no explanation as to why is given in the manual.  But there is a \"Picture Wizard\" tool built in to the TV, which got the picture pretty close to what I wanted, and I was able to get it the rest of the way on my own.Overall, I don't think one can go wrong with this television.  For the price point, I think it's a winner.", "Date": "September 2, 2010"}, {"Title": "Tickled!", "Author": "Bobby Dupree", "ReviewID": "R2K54YSWGQ1O6J", "Overall": "5.0", "Content": "My first review posted on any site...this TV is worth the time!  I did my homework before pulling the trigger and came up with a real winner.  Picture is perfect and everyone who sees it agrees.  I don't know about sound for surround sound or theater style viewing but it is great in my living room.  Highly recommend this TV...I even found a site that had reviews and one guy posted the settings that he found to work best.  I applied those settings and could not be more pleased.  Go for it!", "Date": "February 14, 2012"}, {"Title": "Nice TV, with small issues", "Author": "Mansooratyale", "ReviewID": "RLXBV9ISL8MSZ", "Overall": "5.0", "Content": "Seller was great, item arrived a little late but in perfect condition. Now the item itself is great, but the internet apps are few, not supported and there is no update. If you are looking for internet TV, go get a Samsung because LG don't care about their costumers and don't add apps. If you are asking about the quality (picture, sound, menu) it's a great buy, and the price is awesome!!One more thing, when you set the picture preferences and sound for one channel, it will take it to every other channel you switch too. I am not sure it's a defective, other than it's a function should be there (memory for each channel).One word, Nice TV.", "Date": "June 20, 2011"}, {"Title": "(Life's) Good Stuff!!", "Author": "Dr. E", "ReviewID": "RQC7WDWLQLSLJ", "Overall": "5.0", "Content": "No doubt, I love this LG (Life's Good) television. Five stars! However, with that said, I thought I'd detail some of the pros and cons for you. Here is my personal opinion (I hope it helps you in your decision):A.) Though the television is advertised as Wi-Fi, you do need to purchase the LG AN-WF100 Wi-Fi USB Adaptor. Yes, it is an annoying inconvenience and an extra fee, but it is entirely worth the price. (And, yes, I was stunned that it was not included with the tv. That's a little ridiculous since most folks are buying the television for this specific reason.)B.) The Wi-Fi was effortless to set-up (any person can do it regardless of her/his technological prowess!) Likewise, I have NEVER lost the connection. (I have a feeling that some of the complaints here about \"losing connections\" have more to do with those customers' routers and less with the television itself). Moreover, Netflix \"instant play\" looks amazing on the television ... ditto for YouTube. One drawback: not everything at YouTube is available for the television. For example, we watched all of Weeds Season Six on YouTube, but the final episode was conspicuously missing ... though it was available on my laptop. We searched the exact title as listed on my laptop, no dice. We searched the person who uploaded, denied. We have experienced this with a few other YouTube posts. While this is (admittedly) an inconvenience, it is still a great feature. (Mind you, like other reviews, Hulu would have been a fantastic addition.)C.) The TruMotion feature is genuinely bizarre. For me, the effect was uncanny and disorienting. I believe that there may be some value in relation to \"sports\" (maybe hockey) ... but I found the results for gaming and regular viewing to be strange. Certainly, not a big selling point for me (now that I've seen it in action).D.) Aesthetically beautiful. Furthermore, all buttons are \"hidden\" on the side (this is a welcome change from my other LG where the buttons were positioned in the back ... which made mounting difficult).E.) The sound is rich for such small speakers. Nonetheless, audiophiles will definitely want to add their home theater system to it (for some added crispness and depth).F.) The HD is staggeringly sharp. Truly gorgeous. (If you have HD cable, this television will be the perfect addition to your home. It really showcases HD cable!! I was totally impressed!!)G.) Delivery from Amazon was spectacular. Once the television was purchased, I was permitted to select the day and hour of delivery. Not only did the product arrive exactly at this time, but the delivery person carried it to my second floor living room ... and then set it up!! The delivery person was super friendly and extremely fast. (He even set-up the remote control!) This was all included in the price of the television.While there are a few drawbacks, the price and quality are not to be missed. You will not regret buying this television!", "Date": "April 16, 2011"}, {"Title": "Two weeks and it broke", "Author": "P Rose", "ReviewID": "R28FD4P9C0KR6G", "Overall": "2.0", "Content": "I live in nowhere America so the TV arrived a week later than promised.  I should have known... This was my first hi-def TV so it took awhile to get used to the difference.  Just about the time I did (2 weeks) it began to turn off/on/off/on.  I called LG.  Their service people were very helpful but it took a week for them to get a service person out.  It has been another week while parts are on order. And the repair people tell me it could be another week waiting for the parts to arrive.  This is the only TV in our house and it is sorely missed. I should have purchased locally.  For the few dollars I saved, I could return it and have another one sans the down time.", "Date": "April 11, 2011"}, {"Title": "Pleased with Purchase", "Author": "Yvonne King", "ReviewID": "R2LPHRQ9PKEL04", "Overall": "4.0", "Content": "This was my first large flat screen wireless TV, and the research I did prior to purchase paid off.  I had never bought any LG product before, but will in the future, assuming this TV continues performing as it does now.  The setup was a bit challenging, so I asked the Comcast Technician when he came to install the HD cablebox to assist me with connecting the peripherals. Once installed, all was well.The picture quality is excellent. A friend visiting from South Africa was so impressed, he said that he had to buy one when he returned home.I thought that during my research Pandora was supposed to be included in Netcast, which it isn't.  I haven't had time to find out why or whether I need to do something special to access Pandora - internet radio.  That has been my only disappointment thus far. I've had the TV one month. Being able to access Netflix without a Roku or other such box is a nice feature too.YK", "Date": "March 28, 2011"}, {"Title": "Great value", "Author": "Mohammed H Petiwala", "ReviewID": "R3UEF709HPPH1J", "Overall": "5.0", "Content": "I'm more of a value buyer. Hence, never purchase anything during the early adopter cycle, waited for LCD TV prices to come down to correct value. This TV fits the bill of great value at a good price. I looked at the functionality v/s price and couldn't ask for more. Amazon's price was lowest as compared to other online as well as brick-and-mortar stores. I did walk to the closest Best Buy to take a look at the product prior to my purchase and felt it had the stuff i wanted in the product. Didn't get a chance to get a demo of the NetCast/Internet TV functionality. But based on the online specs on LG's site as well as Amazon product description I was able to decide it.Have been using it for a month with Netflix, Youtube, etc and NetCast works great. Integrated remote is a great plus. The picture quality is just amazing. I've built a dedicated media laptop connected via DVI/HDMI and it has Hulu desktop/Boxee with a wireless keyboard and that adds to any missing capabilities from NetCast apps (only 6 NetCast apps is the negative point on this - they should instead integrate something like Boxee into it). I've seen many reviews complaining about low sound/audio quality - I've not seen any issues on audio side so far/audio o/p seems pretty adequate unless I'm missing something.", "Date": "March 26, 2011"}, {"Title": "Fantastic TV", "Author": "Amazon Customer", "ReviewID": "RHPDXAGGU24DN", "Overall": "5.0", "Content": "I purchased this TV two days ago and placed it in my bedroom.  It is a fantastic TV.  The menu's are simple and easy to navigate.  The picture quality is exceptional.  We have a larger HD DLP in our living room and we were surprised to see how much better the picture quality of this LG was.Having Netflix and the other web apps on the TV is wonderful.  I especially like the widgets.  You can look at web apps via widgets at the bottom of the screen and still watch your programming at the same time.  This is especially useful if you are watching a program with your spouse, they can still watch while you check the weather, stock, etc.This TV has tons of inputs.  It has 4 HDMI which I have found to be most important, but it has all of the other formats as well.  I have an HDMI cable that I can use with my laptop.  I can use it to work or play games on my laptop on my TV while sitting in bed.The wireless function of the TV requires a separately sold USB Wireless plug, which cost about $75.  I opted to purchase cat-5 cable, run it through my wall and place a jack behind the TV so the TV does not have any hanging wires.  It seems that most electronic components (expensive and inexpensive) have wireless inside them except TV's, DVD players and other TV related components.  They charge extra for them and then only allow you to use their products so that they can over charge you for it.All in all a great TV.", "Date": "February 19, 2011"}, {"Title": "Great Television", "Author": "Chris Vacek", "ReviewID": "R3O37B8VKUOULN", "Overall": "5.0", "Content": "I recently purchased this television and I have to say that I love it.  This is my first HD television and the experience has been amazing.  The LG 42LD550 is user friendly and has all the features I needed with ease of access to those features.  I am not a gamer nor have I hooked up my computer yet, I am mainly a movie and television viewer.  I plugged my network cable in, updated the firmware in about 5 minutes, and was watching Netflix online in about 2 more minutes.  Great picture, zero glitches on downloads, awesome. I have an LG blu-ray player also and the movies are amazing, my cable service also hooked up easily and looks great.  I am a detail oriented person who did my research before buying this tv and I have to say that have yet to find a flaw with this television.  Thank you LG.", "Date": "February 8, 2011"}, {"Title": "Great Buy!", "Author": "Rocky Dickerson \"focusyourpower dot com\"", "ReviewID": "R2YEXY6JYSN3J0", "Overall": "5.0", "Content": "I spent weeks comparing different HDTVs and shopped at Best Buy, RC Willey and other retailers and online outlets. I had considered all the brands and found that this LG model by far was the most bang for the buck. Then I got it delivered. It could use a touch more user friendliness during setup, but this TV ROCKS! I had good quality picture froom the start. Then I tried an HDMI cable and the picture was even better than being there in person. For me, it's now LG all the way!", "Date": "January 24, 2011"}, {"Title": "LG42 Internet Ready", "Author": "Anne Serrano \"Coffee Lover\"", "ReviewID": "R28960M10Y8O4F", "Overall": "4.0", "Content": "I like this TV.  I am not a Tech Geek but was able to install the Internet features with one phone call to LG support.  It is my first HDTV and the color and picture quality satisfy me. I am able to instantly download movies from Netflix and this is a feature I was especially drawn to.  Since I am not a gamer getting a game box to download movies did not interest me so this is a great alternative.", "Date": "December 31, 2010"}, {"Title": "Great TV", "Author": "Shaunathan", "ReviewID": "R11VZ6DQFFJNLL", "Overall": "4.0", "Content": "I noticed how these reviews helped me pick out a few items on Amazon so decided to do the same:Great TV! Picture is amazing and it really produces great HD quality TV! Aps are wonderful, wanted to show my friends a few things off YouTube (charlie bit my finger) and instead of looking at it on a small monitor i was able to quickly get it on my comp, not to mention the USB, HDMI's all great functionality.ONLY BAD: Slow loading, if your impatient, you will notice how it takes a few moments to load netflix and the widgets.", "Date": "December 21, 2010"}, {"Title": "Great for the Price and CEVA worked well for me", "Author": "D. Hong \"dhong55\"", "ReviewID": "R11QGMTXE2EQTF", "Overall": "4.0", "Content": "First of all, for everyone who is bashing on CEVA. I'm sure that there are many more good experiences than bad experiences out there and we only hear the bad ones since most people don't complaint when they have a good experience. My experience, unlike many of you on the reveiws, was very good. The TV came on time, and the thing is that you have to call CEVA, and make sure that everything is in order beforehand.Onto the TV, everything works great, except for one HDMI port, which seems to not work for some reason. A guy from Precision Television is coming out to see it in the next couple of weeks since it's nothing urgent. Everything else on the TV, with the exception of that one input, works, so it's perfectly fine. The Cinema mode works well and is pretty close to standard viewing experience.This TV is pretty awesome, and if I had to buy from Amazon again, I would do so in a heartbeat.", "Date": "December 14, 2010"}, {"Title": "Great TV with Internet Apps", "Author": "Amazon Customer \"Baldito\"", "ReviewID": "RB5Q3VLB8YSTX", "Overall": "4.0", "Content": "I bought this TV to replace 42 inch LG plasma and I cant be happier with my purchase. The picture is great with both SD, HD and has superb quality video with subtable bandwidth when viewing online Netflix videos. Sound is also a plus! I use this TV in my living room and the audio sounds crisp.A couple of cons that I want to note: 1 the swivel stand while cool and functional, seems to be weak and made of pure plastic. I'd be careful with this functionality and wouldn't recommend swiveling it often. 2. The boot up screen shows the LG logo and the current time which is nice, however why would you format the time in Military time. I have learned to translate what 13:45 means but still not as nice as 1:45 PM like most of us are used to.Bottom line: you will not regret the purchase, it is worth the money.", "Date": "December 14, 2010"}, {"Title": "Great TV for the money", "Author": "Brian Donovan \"tech and garden geek\"", "ReviewID": "R2ZYMXTFKPBJQX", "Overall": "5.0", "Content": "A very nice TV for the money. We have had it hooked up in our small living room for a month now and even the wife loves it.  5 stars on the picture hooked up to our 720p FiOS connection. The sound from the built in speakers is decent but I hooked it into sound bar speakers for better sound. The WiFi dongle hooked into our home network without issue. Very nice to use with NetFlix. I have played with the YouTube App and its a bit cumbersome to use and not sure  the real usefulness of it (maybe I'm too old at 48  LOL ). You cannot access music vids from the YouTube App and I thought that was annoying. I have upgraded the software / firmware a couple of times and that and I saw it is prompting me for yet another upgrade. Upgrading is a bit quirky and some of the menus are not designed well (and I have been working with computers for 30+ years). Picture is the primary thing though and it is excellent. Overall 4 1/2 stars.added - I bought this from Amazon and the delivery service was excellent.", "Date": "December 10, 2010"}, {"Title": "Nice TV, But Beware Pilot Shipping", "Author": "J. Shannon", "ReviewID": "R161IJDP75A9FI", "Overall": "4.0", "Content": "UPDATE: I posted earlier and at length of the awful experience with Pilot Shipping (below), but now that the TV is actually here and working, I'm quite pleased with it.The picture is quite nice and smooth.  It is clearer than many sets I've looked at which were more expensive.  A little tweaking with the picture wizard makes the image pop.  The Internet apps work well, but I wish they'd gone the extra step and put a web-browser into the product.The USB wireless network adapter is a cinch to get working and Netflix content is quick and smooth.  My only complaint is that the remote control is very touchy... it only works close to the set and when pointed at specific angles.  Everyone who has used it has complained about it.  Otherwise, this is a very nice product.Original post:So, this may be a nice TV.  I wouldn't know as I haven't seen it yet.  I've read others horror stories dealing with Pilot Freight Services, but I've never really had those kinds of experiences.  Maybe I'm lucky.  Well, luck ran out on this one...  According to the shipper's instructions, Pilot was supposed to call when the TV got to the local delivery agent.  We watched the TV make its way from Indianapolis to Fort Myers using the shipping tracker and we expected a call on 12/6 as advertised.  When that call didn't come, we thought, \"Oh well... probably tomorrow.\"  Not then either, although the tracking screen now said that it was in our town and \"out for delivery.\"  Then it didn't show up.A call to Pilot was met by rude and clueless service people who told us that the tracking information on their web site (and Amazon's) was wrong and that the TV was actually sitting in a warehouse in Miami, but that since Miami didn't deliver to our area, they couldn't call us for delivery arrangements.  Instead, they will ship it to Tampa (driving right by our house) where someone will call us to arrange delivery.  We should have it in about a week they said.There is no telling where the thing is now.  The people on the phone didn't inspire confidence and the apparently fictitious tracking information on Pilot and Amazon's web sites are apparently useless.So, if this nice looking TV ever gets here, I'll come back and review it specifically.  Since the purchase includes the service and delivery, I thought I'd better warn those who might be thinking about trying to get this in time for Christmas.  If it uses Pilot Freight, you'd better hope for a lot of luck.", "Date": "December 8, 2010"}, {"Title": "First HD TV", "Author": "Terry Moore", "ReviewID": "R2HULSTGUSTL5K", "Overall": "5.0", "Content": "After reading numerous reviews and finding positive and negative opinions on every popular brand of HDTV, I finally decided to give the LG 42LD550 a try since I'd been very happy with a computer monitor I had purchased from them.  We have had the TV for a couple of weeks and have been very happy with it.  Picture quality is good - comparable to the other TVs we viewed in the local showrooms (keeping in mind that we upgraded directly from a 20+ year old 27\" tube TV). Price was middle of the road for the feature set.  Internet features are pretty sparse beyond Netflix and access to some pay services, but we've already received access to a couple of additional services LG added in the 2 weeks we've owned the TV so its possible that may improve.  I didn't purchase the add-on wireless adapter but hooking up through a CAT 5 cable was painless.  Overall, so far so good.  Based on our experience so far, I'd recommend this TV to anyone looking in this price range.  If the Internet features aren't important to you, you might look at the LD520 and save a little money.", "Date": "December 7, 2010"}, {"Title": "What a bargain!", "Author": "A. Myhrman \"New Mom\"", "ReviewID": "R1C1NAPJLADT8Q", "Overall": "4.0", "Content": "After doing extensive research on which televisions to buy, I realized that I wanted one that I could use to access Netflix with instantly as opposed to needing to buy another piece of equipment or an expensive game system to do so.  This television was the answer to everything and the price was too good to be true.  The television arrived right on time and we had it connected and working within an hour of receiving it.  The picture quality on some shows is a bit grainy but all in all, I would have to rate this television more than adequate for the price.  Even above and beyond the amazing Black Friday deals I would have to say that this television is the deal of the year when it comes to HD with built in internet applications.  You will need to purchase a wifi stick to connect to the television, but that only cost me an additional $40 on amazon.  Do your research to get the right one and still, both are better than any price you can find in a store.", "Date": "December 6, 2010"}, {"Title": "good tv for the $", "Author": "Margot J", "ReviewID": "R1544K62NQY80W", "Overall": "4.0", "Content": "overall, this is a good tv for the $.  very easy to set up for the most part. picture is strong, works well in both well lit and darker rooms with the various picture viewing options.  Wished the LG remote could control everything (DVD, dish box, tv) so that's why it gets 4/5 on functionality. someone in our family bought an LG in Feb 2010, and spent more money for a tv with less functions, so they are definitely on the up and up.", "Date": "December 4, 2010"}, {"Title": "Trumotion sucks...", "Author": "Kevin P. O'connell \"Critical Online Shopper\"", "ReviewID": "R1UBBO5CIQ5M6L", "Overall": "5.0", "Content": "Trumotion is really stupid and makes it look horrible.  There are times when the picture does a weird trumotion blur thing even when you turn it off but it is rare.  Otherwise it is a really sweet TV.", "Date": "December 2, 2010"}, {"Title": "Everything I Hoped For in a TV", "Author": "Cable Free Since 2003", "ReviewID": "R3TCO1OKC8IKGF", "Overall": "5.0", "Content": "Great tuner for Over the Air signals and the HD channels look great.  I get 45 channels; more channels than with the DTV PAL converter box or the Zenith DTT 901.  Plenty of connections for everything and the USB slots will play AVIs which is great.  The Netcast apps and Yahoo Widgets are pretty good.  I can't wait till Yahoo lets you buy differnt widgets.  My computer looks great on this tv also.  The text can be enlarged so it is readable without distorting the page and having to scroll everywhere to see the videos. As long as it lasts, only had it for a week, it will be a great tv and truly deserve the 5 stars.", "Date": "November 26, 2010"}, {"Title": "good tv", "Author": "John A. Amann \"johna\"", "ReviewID": "R1PENW7T5YOLH5", "Overall": "5.0", "Content": "the only down side was I thought that when I got a LG blueray player I could use one controler.  wrong other wise great.", "Date": "November 5, 2010"}, {"Title": "42LD550 Seems to be a Good Choice", "Author": "Vance Rucker", "ReviewID": "R3LYVWQ1KEZQ7U", "Overall": "5.0", "Content": "Since we use only the HD TV feature so far, my comments are limited to this.  We are very pleased with picture quality, this being our first venture in HD.Pilot has been criticized about delivery by others.  Pilot handled delivery to our city but then turned it over to a local company to bring to the house.  We couldn't have been more pleased; when the driver brought it in, he did the usual unpacking and testing.  Then, when he saw our age, he put the stand together, mounted the TV on the stand and setup the channels for us.  He also carried our old TV upstairs to our bedroom.  He was totally cooperative and this is appreciated very much.After the cable company installed HD on 10/25/2010, a week ago, the picture is excellent and we are very pleased.  Our only question is whether or not we should opt for extended warranty.", "Date": "November 4, 2010"}, {"Title": "Still learning", "Author": "Ralph A. Gries", "ReviewID": "R1OQ3OD3600BWQ", "Overall": "5.0", "Content": "Still a might confused about on, off, selecting and etc..Comcast had to reprogram the black sox twice, and the T V still does not react to the remote exactly the same every time it is turned on or offs.", "Date": "October 22, 2010"}, {"Title": "Very Good TV", "Author": "Jay1527", "ReviewID": "R1SOGHR8WWCUOP", "Overall": "5.0", "Content": "This is a very good TV. Very aesthetically pleasing and picture quality is very good. Set up was very easy as well.", "Date": "October 17, 2010"}, {"Title": "Excellent TV, great buy", "Author": "Christine M. Skynar", "ReviewID": "R2VJR1SDFWGW4", "Overall": "5.0", "Content": "This is my first LG product, great picture, great remote, easy setup, good manual, need to learn how to set up network input.  Hi Def excellent.", "Date": "October 15, 2010"}, {"Title": "You'll be glad you bought this!", "Author": "Bill286", "ReviewID": "R9G14KSPKRFTV", "Overall": "5.0", "Content": "I took the time to find a TV with exceptional quality, dependability while also being affordable. Netcast was a factor for me, but not a make-or-brake issue. As it turned out, not only is it a big plus, but something I'm very pleased to have. After having the TV for just over a month, I'd have to say; \"I got exactly what I wanted and more\". Obviously, dependability remains to be seen, but so far, so good!The set-up is easy and the picture is great once you get beyond the multi options for tweaking it. The anti-glare is very helpful, but with a livingroom as bright as mine can be in the daytime, it cant be perfect. If appearance counts, I'd say it's simple and very attractive. Nothing was overdone and the design was well thought out. The remote control was no different.There are 3 aspects that I can't comment on because they haven't been used so far. 1) I dont know about the gaming portion of it, because I dont play games. 2) The wi-fi is something I'll use in the near future, but there's no rush on it since my wired connection is more than sufficient, and 3) I'll buy a new sound system before passing judgment on the audio.As far as TV's go, all-in-all, I couldn't be more happier. Finding a flaw with this television is not only very difficult, but even a nit-picking person should feel the same way. Clearly; I would highly recommend this product.", "Date": "October 1, 2010"}, {"Title": "LG Television is Great BUT", "Author": "Kathy K", "ReviewID": "R2R02GX1ZZHA46", "Overall": "4.0", "Content": "Hi, just received our new LG 42LD550 LCD HDTV yesterday. After reading the positive customer reviews, I would agree with most everything! The sleek styling, great picture and ease of setup were all positives. Connecting to my home network via wifi adapter was pretty easy - other than having to figure out how to use the television remote to input the network security code took awhile. Connecting to Netflix was great and took less than two minutes.The biggest surprise was the fact that the television does not have an analog audio out - only a digital.  So, I'm unable to connect to my stereo speakers without having to purchase a \"converter.\"  Unless I'm missing something, it looks as if this converter will cost at least $50.  Also, not pleased with having a CD instead of a hardcopy owner's manual. Suppose it saves LG lots of money but it's a pain to me.The buying experience with Amazon (and the free shipping) were very good. Received and had the television setup within a week of purchasing online.  The shipper (CEVA) did not call me.  I had to call them.  The driver arrived a half hour before the scheduled time but did not offer to even take the television out of the box. He was in a hurry but I would not sign for the television until it was out of the box and working.  So, he left the television with me without a signature and said to call him and let him know when I got it running . . . . He did call within the hour to ask if everything was okay.  Certainly not \"white glove\" service.  All in all, I'm happy with the television but not happy about the lack of analog audio out jack.", "Date": "September 24, 2010"}, {"Title": "Great TV!!! not a great stand", "Author": "Eotter \"Liz\"", "ReviewID": "R2EAI02I3CEFB5", "Overall": "5.0", "Content": "My husband and I LOVE this TV!! Can't beat the price!!It's great to have netflix right there no ps3 or Wii needed. If you want to use any of the extra features you need to have wireless, so make sure to purchase the LG AN-WF100 Wi-Fi USB Adaptor I searched all over the internet and amazon has the best deal.The only negative thing is the stand it's not as sturdy as you would expect for a 42' TV to be supported by. It wobbles with the lightest touch. I suggest getting a wall mount if you have kids or animals who might try to touch it. We were able to find ours for under $30.Other than that we are loving this TV!!", "Date": "September 22, 2010"}, {"Title": "Great TV at a Great Price", "Author": "MasterMind", "ReviewID": "RKGFTK0AH9Z7Q", "Overall": "5.0", "Content": "Excellent picture quality! i run my PS3 via HDMI, XBOX 360 via HDTV component, Nintendo Wii via AV, surrouns sound system and everything works great!! i love the netflix and vudu feature awesome!! best bang for your buck! easy to setup, use and mess around with.", "Date": "September 20, 2010"}, {"Title": "Great TV great price", "Author": "R. Brayer", "ReviewID": "RGSRXLYL5I4QQ", "Overall": "5.0", "Content": "I purchased this TV a month ago and so far I am very satisfied.Installation was easy including the wireless.Picture quality is amazing. I get HD broadcast from Netflix.I am very happy I bought this TV especially because I didn't have to use wires to connect my TV to the computer.", "Date": "September 19, 2010"}, {"Title": "Superb for the price!", "Author": "Mark Antonio \"MANTONIO\"", "ReviewID": "R3BTIWWQPPJCZR", "Overall": "5.0", "Content": "So happy with my purchase!After a month or two of research, I finally decided on the LG 42LD550. First off, I didn't want to spend more than $750 for a TV, so I looked at everything available in my price range. Nothing compared in price or specs to the LG. There's nothing I hate more than having buyers remorse! The one thing that makes me nervous is the stand. It screws on just fine, but it has a slight wobble. Nothing major, but just enough for me to mention.The Netcast/Netflix feature is great except it's more versatile on the Wii. On the Wii you can browse categories on Netflix, on the LG I haven't found a way to browse anything except for what's in your queue. You also have to buy the $50 dongle to connect to the Netcast internet feature, unless of course you hook it up via Ethernet connection.I love this TV!", "Date": "September 17, 2010"}, {"Title": "More than I expected for the money -- very pleased so far", "Author": "Michael Wheeler", "ReviewID": "RIMIK6QOOO02W", "Overall": "5.0", "Content": "I've been very pleasantly surprised with how much I like this TV. My old tube HD TV (Sony 1080i) died and I did some quick research and decided to go with the LG 42LD520. It has a fantastic picture. Our local cable TV network HD broadcasts look fantastic and so does video from my AppleTV (Hard Drive model), NetFlix movies from my ROKU XR (Sorry Apple there was just no reason to get the new generation of your AppleTV when the ROKU also offers Amazon videos), I haven't even watched anything from my Blu-Ray player yet because everything else looked so good I haven't felt the need yet. All devices are connected via HDMI but at first my ROKU XR was connected via component video and that looked wonderful as well. The built-in cable management feature is also a nice touch.It doesn't allow me to create my own labels for the inputs and I have to choose from the presets which mostly don't apply. The only one that applies to the equipment I have connected is the Blu-Ray player. There are no presets for AppleTV, ROKU or any type of Internet streaming so I'm stuck with HDMI 2 and HDMI 3 as descriptions. Yuck. The other main disappointment I have is that there is no way to label the TV channels. I'd like to be able to label them ABC, NBC, CBS, Fox, Discovery, etc. but there is no option for labeling channels whatsoever not even any presets.To me those drawbacks are minor annoyances but there is no reason not to have those options available on a TV as nice as this one. So 4 stars for User friendliness but 5 stars on every other aspect of the TV. I know the 550 model would have networking and NetFlix built-in but the ROKU box is tiny and simple and I think much better than what I've heard about the built-in networking in the 550. So if you're trying to decide between the two models then just let me say that I'm actually pleased that I opted for the 520 and put the savings toward the ROKU XR.", "Date": "September 13, 2010"}, {"Title": "High Quality at a Budget Price", "Author": "Spook", "ReviewID": "R2UGOU9UTQMI41", "Overall": "5.0", "Content": "Great buy you won't regret it, it's high looks and performance at a price that won't leave you cheated. I bought two myself LG has yet to let me down.", "Date": "September 11, 2010"}, {"Title": "Amazing product", "Author": "Jobin Basani", "ReviewID": "RABGPSBSBUZXZ", "Overall": "5.0", "Content": "Very light weight, slim and sleek. Works perfectly!Stunning display and the sound is really good too...Netflix connectivity is just awesome...totally happy with the product!", "Date": "September 10, 2010"}, {"Title": "Brilliant!", "Author": "Christos D.", "ReviewID": "R16OELFYM3UU1T", "Overall": "5.0", "Content": "Great picture quality; easy setup with cable feed; simple, good looking lines; good quality of plastics.I am impressed with this LG product (my first LG).I have not tried the wireless networking capabilities of this TV as they require a non-included accessory (~$50), and this is not the main TV in the house. But it is good to have the option to network it in the future.Overall, this was a great value at $699.", "Date": "September 9, 2010"}, {"Title": "LG TV", "Author": "sailor1226", "ReviewID": "R3CYA7AZTDY28I", "Overall": "5.0", "Content": "Received a good price for this TV, and it presents an excellant picture and sound.  It was delivered quickly and the carrier brought it into the house and did the basic set up, plus removing all discarded packaging.", "Date": "September 5, 2010"}, {"Title": "Worth Every Penny", "Author": "Business83", "ReviewID": "R6BALN4F5OJZ9", "Overall": "5.0", "Content": "I have had this TV for almost a week now and I have to say that it was worth every penny when I bought it and it looks amazing with an HDMI cable hooked up to it. I mainly use for playing video games and whenever I get my computer put together as well and the wireless on it is really nice as well. I enjoy watching walkthrough of games on youtube and I had to do it on my computer but now that my TV has it, it is very nice. The sound quality for it is pretty good too, its not a really big deal to me about the sound because as long as I can hear it well, thats all that matter to me. Overall, I would recommend this TV to anyone looking for a good size TV and at a good deal, this one is too good of a deal to pass up!", "Date": "September 2, 2010"}, {"Title": "just pure Beauty", "Author": "DerekFlint", "ReviewID": "R1UWQOH2QPU12", "Overall": "5.0", "Content": "Great TV, Great Quality, no problems in shipping and paying only $700 i felt like a thief ... only tiny tiny tiny, insignificant detail is that on the stand that comes with the TV it is a little wobbly. but thats due to the epic size and beauty, haha just put it some place you wont bump into.", "Date": "August 31, 2010"}, {"Title": "Very Happy", "Author": "toots", "ReviewID": "R1LR0YFUORHXXC", "Overall": "5.0", "Content": "The ease of use, quality of pix and decent sound make this a winner.  A simple dongle is all that\"s needed to make it a wireless wonder.  No need to have an extra box top to receive netcasts.  Love it.", "Date": "August 30, 2010"}, {"Title": "Great TV for the Price", "Author": "PrincessBaca", "ReviewID": "R1ULUQR9F8HY3F", "Overall": "5.0", "Content": "Purchased this TV and wall mounted it with \"VideoSecu MF607B Mounts Tilt Wall Mount For most 32\"- 55\" Plasma LCD TVs Monitor Flat Panel Screen Display VESA Up to 700x400 1QH\" product. Interfaces on this TV and very intuitive and easy to use. Right out of the box I ran an Ethernet cable to preview the online content (as I recommend you do) and was very impressed. I didn't anticipate using this feature at all but once connected, the TV updated its firmware, pulled weather and time information, and had me streaming a netflix movie. I was hooked! Especially if you already have a netflix account this is a must. Needless to say I ordered the wifi adapter for ease of use (FYI this has to be the LG specific adapter ~$50). The displays and user menus are very useful and easy to use. I turn off the tru-motion during movies because 120Hz just doesn't look right to me but for sports my boyfriend loves it. I recommend turning off the video noise filters as they tend to just make things jittery for me (that goes for any TV) but that's your call. Also, the auto dimmer is a great feature so the brightness is adjusted to fit the room and surrounding light. Some people may choose to manually adjust brightness (or energy efficiency as described by the TV). Also, the ability to turn off the screen is awesome for me because I tend to listen to XM or other music off directTV. Simple things such as the carousel volume display really add to the elegance of this TV. I don't think anybody looking for high dynamic contrast, awesome refresh rate, and over all good quality TV will be disappointed.", "Date": "August 24, 2010"}, {"Title": "Great TV", "Author": "Mr. K. Carter", "ReviewID": "R2RV2584S3H2YH", "Overall": "5.0", "Content": "I bought this TV to put on the wall as we were re arranging the room. I looked at all sorts of different TV's size 42inch.I bought it for £479 which I thought was a great price. I self installed a new Sky HD box and then with a 5m HDMI cable linked it to the TV. It was very easy to set up and I am very delighted with the picture quality. I then set up a connection with my Wi using a component cable and again a great picture. Setting up my surround sound system also was easy.Overall I am delighted with this TV and would recomend it.", "Date": "August 19, 2010"}, {"Title": "Fantastic TV!", "Author": "bsm999 \"bsm999\"", "ReviewID": "R12BRPF9NQOE2Z", "Overall": "5.0", "Content": "I have had Dish-HD in the house for a couple years, but only one of two sets had the HD capability.  I looked long and hard for a TV that had a really good picture, a reasonable price, and a good set of features.  This is it for me!!  I've had it for a month and I still sit in awe of the picture quality.  Have watched about 5 flicks from Netflix and they have all been of excellent quality.  In order to use Netflix, I had to purchase the wireless USB dongle but setting that up was no problem.  I also tried a hard wire and that worked fine.  I really don't have one bad thing to say about this TV.  Shipping from Amazon was a bit slow...  It took 9 days to move it about 400 miles and then I had to call the freight co. (they didn't call me).  Had to drive 40 miles to pick it up but that was my choice.", "Date": "August 15, 2010"}, {"Title": "Awesome price for a really good TV", "Author": "Uttam Channegowda \"Uttam\"", "ReviewID": "R139WYM4X31J6S", "Overall": "5.0", "Content": "After having done a whole lot of research and weighing in on the Netcast and other features, decided on buying this. I must admit, was damn confused between Samsung and LG. Finally decided to buy LG, cause i had a really good experience with the LG Scarlett 32 inch i had.Netcast is a really good feature to have. Even if you end up paying a few additional dollars.1080p and 120HZ both for 750$(Now, its 700), is something of a steal, for a brand like LG.Its feature rich. So, when you are trying to finalize, take my word that it has all the expected features and much more.A word for Amazon's customer service - You guys are 'The Best'.", "Date": "August 12, 2010"}, {"Title": "If your eyes can handle the refresh rate....", "Author": "Darren Italiani", "ReviewID": "RIU3LXNU9KVPV", "Overall": "4.0", "Content": "The refresh rate was pretty intense.  If you get motion-sickness easily, i recommend sticking with the 60hz version.  This TV works best for videogames and blu rays operating at 1080p for the 120hz rate.  Television looks a bit strange when scaled up, and older movies just creep me out, looking like they were just made. This is not the TV's fault, but the technology's.  The TV does exactly what it says it will do.  Occasionally, there are blurry sections around people during movement, but its rare. Its worth every penny if the 120hz is what you're looking for, just buy some motion-sickness pills....", "Date": "October 19, 2010"}, {"Title": "So glad I made this purchase!", "Author": "Amazon Customer", "ReviewID": "R2CQ3D2MVNM5VT", "Overall": "4.0", "Content": "I love, love, love my new TV. Awesome picture and ability to instant view movies and other programs as well as Internet capabilities at a reasonable price. It is everything I wanted as an addition to my home theatre.", "Date": "June 14, 2010"}, {"Title": "Great TV", "Author": "Mike", "ReviewID": "RDTJ13SNT3QR1", "Overall": "5.0", "Content": "I have only had this TV for a couple weeks but it is everything I expected. The picture is really good, the TV is a good size for wall-mounting and not too heavy, the sound is good too (better than I was anticipating based on some other reviews) and the ability to plug in a USB drive and watch movies/tv shows is easy and really nice. You do need a LG USB Wireless adapter to use the wireless TV part of this so keep that in mind. Also has a good remote, which is always a plus. Can't really go wrong with this TV.", "Date": "November 9, 2010"}, {"Title": "One missing feature...", "Author": "shoopa", "ReviewID": "R26YQBHOCGH37J", "Overall": "4.0", "Content": "Overall I am satisfied with this TV. But I wish I had known that it has only one optical audio output. Unfortunately, my current receiver has only the RCA style analog inputs. Where this matters is when I use the Internet streaming function to watch Netflix on the TV, I need a way to route the audio from the TV to my receiver. Unless I want to watch movies with just the built in speakers.At this point, I need to either get a digital to analog converter. Or get a new AV receiver, though I really like my current system. Would I have gone with a different TV had I known this? Probably.Other than that, the picture quality is very good. (Got it in time to watch the World Series) Very asthetically pleasing. Features and user experience seems consistent with those of competitors.Amazon's delivery was very good.The user manual was a little bulky in the sense that they try to address too many different models with one physical manual. You have to check the model number to see what you are looking at.", "Date": "November 2, 2010"}, {"Title": "Good value for the price", "Author": "Jimmyjud \"JJ\"", "ReviewID": "R3IGW0RNO9R5Z0", "Overall": "4.0", "Content": "Although the unit accepts internet input it is somewhat limited as to what it can access.  Quicker firmware upgrades would be nice as Netflix is now \"searchable\" on my stand alone unit (Roku) and Wii, but not through the LG.  Customer service was prompt and helpful during set up with the USB internet device.  Picture quality and sound are good, but it requires a fairly high s/n ratio for off air reception.", "Date": "September 17, 2010"}, {"Title": "This TV is great!!", "Author": "J. TRUJILLO \"JarJar\"", "ReviewID": "RNTO7ESX17C65", "Overall": "5.0", "Content": "When I was looking for a TV I came across the 42LD550. This is the first time buy an LG product so I was a little worried that it was just going to be crappy. It turns out that it is a good TV has excellent picture, and sound. It beats pay $3,000+ for an LED TV.", "Date": "September 7, 2010"}, {"Title": "Broken 3 times", "Author": "Greg Barlin", "ReviewID": "RPZBMGQ51TU4X", "Overall": "1.0", "Content": "Out of the box, everything seemed great about this TV.  4-5 stars.  Fast forward 6 months, and suddenly we started to have issues with the video board.  We were able to successfully replace this under warranty (after 2 tries), and things were fine again...for a while.  9 months after the first replacement, the same issue happened again, but this time it was out of the one year warranty period.  LG was kind enough to make a special exception for us, and the board was replaced for a 2nd time.  The, this past Fall, the same issue returned, and now I'm in the market for a new TV.  Despite them trying to do us a solid, the product quality on this LG TV has been horrendous.", "Date": "January 29, 2014"}, {"Title": "DIED after 2 years", "Author": "R. Graziano", "ReviewID": "R297GJDZGH9KOK", "Overall": "1.0", "Content": "While it worked, it worked flawlessly.  Then, just today, I turned it on and all that it did was display the LG splash screen and blink the red power LED.  A little research on the internet (on LG message boards, no less!) revealed this is a common problem across all their TV lines.  Either the power board blows capacitors, or the motherboard dies.  In either case, LG claims ignorance.In my case, there were intermittent popping sounds coming from the device prior to it dying, like the sound of a metal spoon on an aluminum saucepan.  Too bad.  It really was a great device while it lasted.  Easy to use, very responsive.  Time to switch brands...", "Date": "October 14, 2013"}, {"Title": "TV is okay", "Author": "Julianne Canada", "ReviewID": "R5R7HRVN4DCON", "Overall": "3.0", "Content": "The regular settings for the TV are fine but on HD channels, there is a bleed at the very top that is actually from the bottom of the screen.  Other than that everything else works fine.  Wish I'd seen this product firsthand before I purchased online.", "Date": "May 8, 2013"}, {"Title": "I got what was promised and paid for. It arrived on time, in good shape.  and it works.  I would buy again.", "Author": "fair trader", "ReviewID": "R2AFMVI6CG1JVQ", "Overall": "5.0", "Content": "I got what was promised and paid for. It arrived on time, in good shape.  and it works.  I would buy again.", "Date": "March 22, 2013"}, {"Title": "LG TV", "Author": "Gary \"Gary\"", "ReviewID": "REHMXSOU9BDBQ", "Overall": "5.0", "Content": "A good TV for the price.  I have had this for one year with no problems. I like the Internet ready performance, and always stream video on it.  It can be connected to a DVD/VCR player also.  I am very happy with its performance, but should have bought a larger one for my family room.", "Date": "January 17, 2013"}, {"Title": "Lasted just over two years", "Author": "M. Geary \"electronics junkie\"", "ReviewID": "R34787EWC3L2L4", "Overall": "3.0", "Content": "This TV(LG 32LD550) gave us just over two good years. Today, we turned it on and we could not get a signal. We have cable service so I tried hooking another working TV to the same cable supplying the LG 32LD550. The other TV received a signal and worked fine so my conclusion is that the LG LD550's tuner went bad. The LG was used no more than 1-2 hours per day for the two year period. We have a 32 inch Sony Bravia that is 7 years old and is still going strong and has had much more use per day.  I have another LG, a 60 inch plasma and I hope that we can get more than two years from it. We are now looking to replace the LD550 and our thought is to get something other than an LG. Hopefully, those of you who have purchased one of the LD550 series tv's since 2010 can get more than two years of use out of it.", "Date": "January 1, 2013"}, {"Title": "$150 for discontinued Internet package, \"NetCast\"", "Author": "W. E. Thorn \"Carolina, Blue\"", "ReviewID": "R2UJL6MD90FF0M", "Overall": "2.0", "Content": "When I bought this TV I paid $150 for Internet applications. This service was supposed to grow as innovations were  developed. The next year this TV was discontinued. The new models all had Smart TV, which became there Internet package.They should have made this service available to me. Instead I was left with a $150 package that I can access U-tube and several pay for movie sites (NetCast)It takes a couple of years to develop something like smart TV, but It came out in less then a year after I bought my TV.I had thought for sure they would offer me this service, but they just discontinued my TV and offered no upgrades or explanations that I know of.  It's a shame too, in the two years I've owned the TV it's been great. Unfortunately, I feel they treated me poorly and I won't be buying another LG product. I've discontinued them.", "Date": "December 11, 2012"}, {"Title": "Lg 42ld550 42\" 1080p LCD", "Author": "AC", "ReviewID": "R2BNDY6FMXHS5B", "Overall": "5.0", "Content": "I've had this tv for a 1 1/2 years.  I haven't had any problems with it.  It has good dark black tones.  Good viewing angle from the side.  Adequate speaker.  No ghosting or dead pixels.I use netflix and connect my computer to it.  I stream video from my computer and use the tv like a monitor, I watch movies from the Netflix interface that this tv offers. The only thing is , I had to purchase a USB adapter to connect to my modem wifi separately.I would recommend this tv for connecting to a computer, Netflix and wifi capability, and excellent picture quality.", "Date": "August 30, 2012"}, {"Title": "Better than sex! Welllllll, not quite. But it's great!", "Author": "Timothy Erk", "ReviewID": "R2WS2R6110DFPZ", "Overall": "5.0", "Content": "I can't say enough about this TV. Here's the pros:- The picture is incredible. Blu-rays look absolutely stunning. I get compliments from all my friends.- The USB port plays EVERY VIDEO FILE I'VE TRIED, even HD MKV files. I use it constantly.- I use Netflix all the time too. Very easy to use. Looks amazing too.- I also often hook my laptop up using HDMI, and it looks fantastic.- The remote and menus are easy to use.- The intelligent light sensor is always correct. I never have to adjust the settings.Only con:- Netcast needs an update bad! They need to add Hulu, Amazon, Pandora, etc. I have a Roku 2 on my other TV which takes care of that, and when I need it, I just switch it. But it would be really nice to not have to move it.", "Date": "November 26, 2011"}, {"Title": "100% according", "Author": "JJ", "ReviewID": "R2KASEVA8OO05S", "Overall": "5.0", "Content": "conforme, con el producto y la entrega fue dada en el tiempo descrito, y el artículo en excelentes condiciones, gracias y saludos", "Date": "November 15, 2011"}, {"Title": "LG 42 LD550", "Author": "Frank", "ReviewID": "R28299UTZ208RZ", "Overall": "5.0", "Content": "I've had the this TV for 8 months. I wanted to wait awhile to see how things worked out. You don't write a review after having the TV for only a week.This being my first review of any product, has to mean \"I'm impressed\" and I am.The image quality is great. The audio as I wear hearing aids. It might not sound as some audiophiles would want. It more then sounds good to me, with or without the hearing aids.  I was asked by a neighbor \"where are the speakers?\" He couldn't believe the sound quality not being hooked up to my stereo system. The sound quality is more then adequate. Anyone not likening the quality of sound is asking too much for a TV. If you want audio a 5.1 or 7.1 sound you have to purchase a sound system. Enough said about sound.The image quality is second to none. I've had LCD & LED TV¡¦s yes the LED is not as wide in diameter. And image quality is good. You are not going to get better image quality then this TV no matter the price. I don¡¦t care how much you spend. My son paid almost $2000 for his LCD TV (a Sony) my daughter and son-in-law paid over $3000 for there 55¡¦ LCD and my picture quality is as good or better. (Matter of fact they tried to return theirs. But they already had it 4 months.Size that brings up a point I want to make. GET THE BIGGEST SIZE YOU AN AFFORD¡K and when you have that wait a little longer save a little more and get a bigger size. Don¡¦t let anyone tell you size doesn¡¦t matter. (When it come to a HD TV º) I have a 42¡¨ in my small living room. I¡¦m about 10¡¦ feet away. But if I move up 2¡¦ feet it makes a huge difference. (You can check this out in a store)There are more connections then you¡¦ll ever need.How about this! If you are hooked up to the internet you have access to; Netflix, CinemaNow, MLB.TV, Picasa, Vudu, Yahoo, Youtube and one more to come. I didn¡¦t see this mentioned, only NetFlix.. NetFlix has about 3500 HD movies. CinemaNow has thousands. (Cost more then NetFlix) MLB.TV all the games, I hope the NFL will be available.Get this model but get the biggest you can afford!I could mention more positives, but this is enough.For the price you pay for this LG Model LD 550 you're just not going to beat it. Buy it now and in 3 years get the new 3D TV's...And if you shop around for price you can get this size and model for less then $700 NEW!Hope this helps someone. I don't work for LG... but this model your just not going to beat the  quality and features.UPDATE 10/15/11About a year for this TV still no problems. Did forget to mention in previous review, as long as you are connected to the internet this TV updates it's firm ware automaticaly a big plus!! I've read some negative reviews and know you can fix any problem you have with color adjustments. YOU just have to understand how. (read you're manual!) You just can't beat this LG TV picture quality.", "Date": "August 30, 2011"}, {"Title": "Everything You Want", "Author": "Matt", "ReviewID": "R2CNW8OGC0WX64", "Overall": "5.0", "Content": "This is a great LCD TV. I, along with many friends, notice that most regular LCD TVs(including this one) have a much better look than the high contrasting LED TVs. The picture wizard is absolutely AMAZING! The apps are fun, but pretty much pointless if you have a gaming console. I use this TV for gaming and for a screen to play movies from my laptop, and it does both of these with ease. I have to say that LG's remote is a notch above many other remotes. It is simple, yet it allows you to do so much. LG's interface when accessing settings and advanced options is great. This TV is 120Hz; this is said to be the highest possible refresh rate the human eye can notice. The only reason anyone should buy 240Hz is for a 3D TV (it has to render 2 pictures- 120Hz & 120Hz).The one piece of advice I can give to you if you're looking to get this TV(or any other, actually) is to make sure to buy good quality HDMI cables. I actually find that HD-component cables work better, but that is just my preference.I honestly believe that LG is one of the best LCD brands out there. (Samsung is a close second favorite)", "Date": "August 18, 2011"}, {"Title": "Failed after less than 9 months of use", "Author": "Boris Yoffe \"boris\"", "ReviewID": "R1SVFYRR3MXV6F", "Overall": "2.0", "Content": "It worked fine for the first 8 month.  Then, no video (blank screen) but it makes good rario since audio is still there.  It is a shame to see such a low quality from respectable manufacturer like LG.", "Date": "August 12, 2011"}, {"Title": "Good quality for the price", "Author": "veronica s", "ReviewID": "RWKCUVJQX9OIO", "Overall": "4.0", "Content": "This was my first HDTV purchase, and in fact my first television purchase ever, so I comparison shopped for months before finally settling on this model in Feb '11.  As someone who knows very little about electronics and technical specs, I wanted to get the best quality for my money without paying for a lot of extras I will never use.  I also didn't want to spend a lot of money for something I only use occasionally.  I did want something up-to-date, with streaming capabilities as that's my primary source of entertainment.This TV has suited those needs perfectly.  It was delivered exactly within the scheduled delivery window and brought inside to my second floor apartment.  The deliveryman did tell me that they are generally required to take the TV out of the box and turn it on to demonstrate that it works but that he couldn't because it was so cold outside that the tv had to warm up for an hour or two before I could plug it in.  I was a little nervous to hear that but he left, I waited several hours, then took out the TV and plugged it in.  Worked perfectly, and I managed to set up the whole thing by myself in about an hour, including screwing in the base, connecting cable, DVD player, Netflix.  I am NOT someone who is good at that sort of thing, but I am impatient and wanted to try it out right away and it really was very easy.  The manual is clear and straightforward and I had no problem finding what I needed to know.I did buy the separate wi-fi adapter for about $39 and it was very easy to plug in and get connected to my wireless network.  I mostly watch Netflix movies etc, though it would have been very nice to also be able to access Hulu Plus without buying additional electronics in the future.  This is probably the only negative for me overall.As someone who is not electronically savvy, I actually had no idea how big this screen was going to be.  I thought my old TV (a Sony non-flatscreen) was about 30\" and that I'd just be going a bit bigger.  My significant other kept telling me that it had to be at least 42\", anything smaller would be REALLY small.  Well, I might've known better! When I saw the size of the box, my jaw dropped a little.  I'm not a huge TV person and I live in a cozy Boston apartment, so a reasonable-sized TV is perfect.  However, I was pleasantly surprised by this screen size and have since been very pleased with it.  I would NEVER have chosen this size if I had a better sense of how big it would actually be, but it's totally worth the price and I'm very happy with it. If you have a lot of space or a really large family room etc, perhaps this TV would be on the small side but if you are only sitting 10-20 feet away from it, the picture is great.So if you're like me and don't really know TVs, get a tape measure and pull it out to 42\" and hold it on a diagonal.  Really.  Maybe even add 2-3 inches to take the edges into account.Appearance. I do like the look of it.  This LG wasn't at the top of my list in terms of aesthetics alone and I'm very picky about decorating, especially when it comes to such a large object.  However, it's fairly unobtrusive and looks... well, like a simple black TV.  This is fine with me.  I do have it on the stand but hope to hang it on the wall at some point and will update accordingly.Finally, we did move about a month ago, and it was a MASSIVE move.  I simply wrapped a blanket around the tv (after removing the base) and transported it in the back of an SUV.  I'm sure it sustained a few bumps here and there but it looks and works like new, not a scratch anywhere (which is far more than I can say for some other furniture).  Could I have been a LOT more careful?  Yes, especially since I still had the box, but it seemed more efficient to fill it with other stuff and just carry the TV.  But the TV held up beautifully and I think it's about as durable as a flat screen TV is going to get.Very very happy with this purchase.", "Date": "June 13, 2011"}, {"Title": "Great TV for the price", "Author": "Darrick Addison", "ReviewID": "RMJMC9R139DIZ", "Overall": "5.0", "Content": "My family has owned this HDTV for almost 6 months and we love it.  The picture quality is superb.  We have the PS3 connected to this tv and the blueray movies look as if you are sitting in the theater.  You will not go wrong if you purchase this HDTV.", "Date": "May 28, 2011"}, {"Title": "Great 1080P TV", "Author": "Tank #1", "ReviewID": "R151VX9MQHEZLT", "Overall": "5.0", "Content": "I love this TV! Out of the box and set up in 30 minutes or less. Very user-friendly menus. Picture quality is excellent. The Netflix streaming is built in but YOU STILL have to get the USB Wireless Adapter. Plays AVI And DIVx formats via USB ports(2). Added a Blu-Ray player to get the whole 1080P experience. ABC network HD broadcasts, especially, play great!", "Date": "April 5, 2011"}, {"Title": "LG 42LD550", "Author": "M. Sample", "ReviewID": "R3O1G76SBUDYQE", "Overall": "5.0", "Content": "I researched quite a bit before I selected this HDTV.  It is my first HDTV and I had my doubts at first, but I have decided it's a keeper.  The price was a selling point with it coming with the internet apps.  I had problems at first trying to get the best picture but read another reviewer who suggested going to the internet and google for picture settings and I found some that seemed to make a difference.  But I was still unhappy with the quality when watching my DirecTV.  I called LG and they told me that sometimes when you watch SD channels with a HDTV the picture may be worse that when watching them on my old tube TV, and they were.  I called and tried to get DirecTV to cut me a deal with upgrading to HD which they wouldn't do so I switched to DISH network and I couldn't believe the difference now watching the HD channels.  I also purchased the LG 590 blu-ray player, which also comes with internet options.  When I purchased them I wondered about having them both have the internet apps, but when I checked into just getting an HDTV without the internet apps, I wouldn't save that much money, so I decided to go ahead with the HDTV.  Also, with the player it didn't seem to save much and I liked the idea of the 250 gb HDD so I have both with internet apps.  At first I used the player to stream Netflix and YouTube, but I decided to go ahead and purchase the Wi-fi adapter for the TV since it was on sale for half the price and now I use the TV for streaming instead of the player, it's just easier.  It is so cool to watch Youtube on the big screen as well as streaming Netflix!  The adapter worked perfectly finding my router and setup was a breeze.I don't have it mounted on a wall, it's setting on my TV stand, but it seems pretty stable and I like that the stand swivels.  The sound seems good as it says it has four speakers instead of two, which was another selling point, and I hope to hook it up to a theater sound system next.I was not happy with the time it took to receive the TV, I had to wait almost two weeks since I live in a small town a long way from a major city I guess.  When I ordered the TV it stated it would be delivered the next week, but when the service contacted me they stated it would be another week and they only come to town once a week and only in the morning, so I had to plan on taking the day off from work since I had to be there.  I lucked out and they called the night before and wanted to deliver it then, so I didn't end up having to take the day off after all, which was nice.All in all, I am very happy with it and would only wish maybe I would have gone larger with a 46 inch.", "Date": "April 4, 2011"}, {"Title": "Great Crisp Picture and flawless so far", "Author": "Andy H. Greenwald", "ReviewID": "R3SDB8OSWKRVI9", "Overall": "5.0", "Content": "Just a great picture.  Sports really shows well on this TV.  The setup was simple and the internet connectivity is a great plus.  We love this TV and would recommend it to anyone.", "Date": "March 29, 2011"}, {"Title": "I love it.  The only thing I wished it had - audio outputs.", "Author": "Carol Thull", "ReviewID": "R3J3QAD2YSQ904", "Overall": "4.0", "Content": "This is the perfect TV for my usuage.  I just wish it had audio output, so I could run the sound through my stereo receiver.", "Date": "March 28, 2011"}, {"Title": "Extremely Satisfied", "Author": "Madelyn T. Kelsey", "ReviewID": "RTX2GRV0EYGXR", "Overall": "5.0", "Content": "This TV is everything it was advertised it would be and more.  The picture is AMAZING, I have 3 flat screens and I swear by Panasonic, but this TV is even better than those.  The only thing that wasn't clear, but not a huge deal was that there was no mention that you would need a usb thingy (sorry I don't remember the name of it) in order for the Netcast feature to work, so expect to spend at least another $ 80.00 for this tv to be complete.  Definitely money well spent.", "Date": "March 28, 2011"}, {"Title": "Review", "Author": "David", "ReviewID": "R3GMB2MEYOPFLT", "Overall": "5.0", "Content": "These are great TV's they work flawlessly. Sadly they were to large for the space I was going to put them so I sent them back.  Great TV's and a great return policy on Amazon.", "Date": "March 27, 2011"}, {"Title": "LG tv review", "Author": "Sandra L. Morgan", "ReviewID": "R36352ERWATWUI", "Overall": "5.0", "Content": "I absolutely love this TV.  The color is great and it has features which are so cool......am so glad I bought this tv.!!", "Date": "March 26, 2011"}, {"Title": "Excellent TV.", "Author": "Ralph", "ReviewID": "R3OVJZGGCLC8D4", "Overall": "5.0", "Content": "For the first two weeks, we had it connected to our digital standard definition cable box via the RF antenna input. The picture had a good, clear soap opera look, but you can get used to that. Then we had a new high definition cable box installed using the HDMI connection. OMG, what a huge difference in the picture. I never thought a HDMI connection could improve the picture that much, but it really did. The picture is excellent in either SD or HD format using a $3 6' V1.4 HDMI cable.", "Date": "March 24, 2011"}, {"Title": "Pleasure and then more pleasure...", "Author": "Lori Smith", "ReviewID": "R1FUKSE3AWE93Z", "Overall": "5.0", "Content": "I cannot state enough just how beautiful the picture is on this unit.  I had a 32\" Bravia that I have loved for almost two years and this unit is even more beautiful and the 120 hz translates to a much sharper picture.  The images are so real the characters could almost come right off the screen...It was delivered right to my door -- according to schedule :-)  I plugged in my sound bar and my ethernet line from my router and off I went.  The price was awesome - what a deal!  The remote is perfect in size and design - one of the easiest ones I have ever worked with.  As my eyes are older and I often cannot locate my glasses, I find the intuitive design of the remote makes it very easy to operate even when I cannot really see it.  The black background and bright, clear numbering also makes the remote easy for hands that have trouble with the little, tiny buttons often found on other remotes.I could not have asked for anything more in a television except perhaps more options with Netcast -- Netflix is great, but there is more out there (hint, hint).  Hopefully they will make more deals in the future (Amazon downstream please take note of this want - I am sure it would net you many more Prime subscribers - myself included).", "Date": "March 22, 2011"}, {"Title": "Really easy..", "Author": "E9 Batmobile", "ReviewID": "RCWNL7GW2Q97O", "Overall": "5.0", "Content": "This tv is very easy to set up, even with the wireless USB connection. I had it up and running in less than 20 min with all the inputs (DVD, VCR, wii, etc).  Picture quality is fantastic and sufficiently customizable. Excellent tv for <$700 on amazon...", "Date": "March 18, 2011"}, {"Title": "Very good TV. Too bad no DTS support!", "Author": "chrismir", "ReviewID": "RXSAK6GDDT75W", "Overall": "4.0", "Content": "I bought this TV for it's internet apps and wireless networking capabilities. I also want a TV that can play everything by itself (do not want any other devices and cables cluttering our small room). Network setup was easy and DLNA connectivity using the provided Roxio software is very good. I can play almost everything!The only drawback (and a major one if you play MKV's) is that LG did not purchase DTS licensing for the U.S. market (WHY?), therefore, you cannot play audio of any media file with DTS encoding. I believe Samsung can play DTS encoding so perhaps you can get a Samsung TV with similar features if this is a deal breaker.", "Date": "March 18, 2011"}, {"Title": "Great TV", "Author": "cookies100", "ReviewID": "RGZTKU8FZ9E3M", "Overall": "5.0", "Content": "I have had this TV for about a month and love it so far. I wish the netcast had more aps but other than that its great", "Date": "March 15, 2011"}, {"Title": "LG 42LD550", "Author": "EVOLUTION", "ReviewID": "R2XDTW4Z8FEATQ", "Overall": "5.0", "Content": "I was hesitant to order my TV online and after reading as much as I could take in I decided to buy the LD550 from Amazon. The price was great and much cheaper than I could find locally. When the TV showed up from homedirect the packaging was perfect and so was the TV inside. The driver helped my wife open the box and get the TV out for inspection. There wasn't a single problem and ended up being a great decision. The TV looks great and the size was perfect for our house. I am not a huge fan of the True motion feature setting on the TV but after you turn that off or down the picture quality shines. I would defiantly recommend this television from LG!", "Date": "March 15, 2011"}, {"Title": "Great Software", "Author": "Alex Leiva", "ReviewID": "R3UANL3VJBKYLU", "Overall": "5.0", "Content": "I have recently bought this TV, and I can't be morehappy, the picture is excelent, de look of the TV isvery nice, the internet applications are veryusefull, and the look and feel of the software isgreat, very sofisticated but  friendly at the same time", "Date": "March 14, 2011"}, {"Title": "WOW. Impressive", "Author": "C. Gilbert \"infomercial addict\"", "ReviewID": "RDC92BHP65KH8", "Overall": "5.0", "Content": "From a very picky person, I am blown away by the clarity of this TV. Replaced our old tube TV in our living room, it is the perfect size (IMO) We do not have cable, we stream from Netflix or DVD player, and the picture is just awesome. One note, remember to purchase LG AN-WF100 Wi-Fi USB Adaptor seperately or your Netflix and other Internet Apps won't work. Priced EXCELLENT (about $500 less than stores) received no tax & free shipping. Can't complain!! WOOHOO!", "Date": "March 8, 2011"}, {"Title": "Nice TV but.......", "Author": "M S", "ReviewID": "R2S1FIXDAARTWG", "Overall": "4.0", "Content": "Got it for a great price. Actually, I was forced into buying this TV because I wanted the 24 month interest free financing. I originally wanted something else. But this TV picture especially in 1080p is amazing. Regular cable TV looks bad and blurry on it. But HD is awesome!!Limited user settings, but more than enough for the average person. Internet applications are awesome. Netflix looks good, especially with a faster  connection. Vudu HD is crazy sharp. The strange thing is, on this TV,  THERE IS NO AUDIO OUT. Okay, there's a minijack headphone output. And an optical out. But what about normal RCA outputs? I have many different components connected to this TV. I don't want to have to individually connect them to a receiver. Besides, what is the use of streaming HD directly to the TV when there is no audio output for 5.1 surround. That's just strange. Perhaps it's a plan from LG to get you to buy only LG products, because they all work together seamlessly.The sound from the TV is okay. But for it's size, and clarity, you'd definitely want a hifi setup with it. I'm going to have to figure this out the hard way.", "Date": "March 7, 2011"}, {"Title": "Love This TV!", "Author": "Benjamin Kantor \"Dr. Lecter\"", "ReviewID": "R1G3ICOUJPLLZO", "Overall": "5.0", "Content": "This TV was perfect for what we needed!  It is the right size for our living room, and the picture quality is fantastic.  We wired it in to our home network, so I can't speak for the wireless capabilities.  Streaming Netflix and other internet uses are extremely easy.  I also really like the remote.  The buttons are large and easy to understand.  We are very pleased with this item.", "Date": "March 7, 2011"}, {"Title": "Love my tv!", "Author": "IdolFan \"DDT\"", "ReviewID": "R3MKRG29PG8VWC", "Overall": "5.0", "Content": "After seeing a tv demonstration of this tv, I knew it was the one I wanted.  I found the best price here at amazon and the lowest price on the extended warranty and a huge price difference in the adapter.  Not only did I get a great tv and an excellent deal, the tv arrived one week early!  What more could you ask?  My only problem was figuring out how to change the remote from characters to numbers to input the security key so my network would connect.  My manual and the cd manual did not address this issue that I could find.  I finally noticed on the remote the char/nbr hidden between two input buttons midway on the remote.  Once I found that, the network was fine.  I did have a bit of a problem updating.  The tv wanted to stop at 55percent completion.  I finally turned tv off and went to bed. This morning, I turned on the tv and it did that one more time.  I again turned off the tv and turned it back on and it finished the updating.  I did see when I googled this others were saying they did the same thing to finish initial update.  I was amazed at the pic and sound quality and we don't even have hi-def receiver yet.  I don't know why a lot of raters have issues with the sound unless they are used to big speakers and surround sound.  The internet apps are impressive.  Far more of them then I thought or had read this tv had.  I was very pleased to see ebay and youtube.  Now if they add facebook I will have all the various apps I really need.  I setup netflix for movies and this will allow me to greatly reduce my satellite bill.  I find signing in and inputting passwords a bit annoying as the down arrow and widgets keys are so close on the remote I often hit widgets in error making me start the signin process over.  My husband was happy to see the Gunsmoke channel on youtube.  My daughter had input my husbands name via remote while I was out of the room and when the pc finally finished initial auto programming and came on, it said hi to my husband by name. lol  I wondered how it knew his name since all the paperwork was in mine rofl. doh........  Buy this if you can still find this model.  Everywhere I tried to buy it the tv sold out till I finally found it here at the best price.", "Date": "March 3, 2011"}, {"Title": "Just what we were looking for", "Author": "Cheese", "ReviewID": "RYF0YD11R39C7", "Overall": "5.0", "Content": "Netflix comes in great with the LG dongle, though another wireless dongle might be just as good.  In another room we have an LG Blu-ray player that goes into a Samsung TV in which the streaming quality of Netflix is pretty poor.  I didn't know that the quality of the streaming could be this good.  The picture quality is great with DirecTV as well.  That's all we have hooked up.  The sound is decent, too.  We currently have no home theater set-up on this TV.", "Date": "March 2, 2011"}, {"Title": "Absolutely Stunning", "Author": "momochaims", "ReviewID": "R2MPPQESFDE2CJ", "Overall": "5.0", "Content": "Initially I was hesitant to spend so much on a TV. This tv is sooo easy. I didn't even get the cable hooked up before I was able to utilize the wi-fi and the netflix feature. The picture is crisp and clear. Easy set-up and connectivity.  It comes equipped with games, youtube and even added yahoo widgets.  No cable needed. Internet access creates unlimited opportunity for watching movies or television.  Great Buy!", "Date": "March 2, 2011"}, {"Title": "42ld550 lcd", "Author": "Steve S", "ReviewID": "R3TH2Q0EX8TKCR", "Overall": "5.0", "Content": "Happy with the supplier the lcd and the delivery.  Got internet options which i probably will not use but it was such a great price and it was an lg", "Date": "March 2, 2011"}, {"Title": "Nice", "Author": "Ed Ward \"EDTHEWARD\"", "ReviewID": "R2GQNF04KDB37E", "Overall": "5.0", "Content": "I have owned this TV for about 4 months and don't regret it. This is our main TV and it is on alot. Ease of use and great picture quality on all channels are great. We have our Cable remote programmed and it works great. (Time-Warner)  Net connection is great for netflix. everything looks and sounds nice. The only gripe I have is the netflix TV software does not stream closed captioning like a PC or PS3. Not the TV's fault, but one of the reasons I bought it. this would not really affect most viewers. Other that that I can't complain. Well...I COULD....but it wouldn't be about the TV.", "Date": "February 26, 2011"}, {"Title": "Love it!", "Author": "January \"Early Adopter\"", "ReviewID": "RP6UDPTK3H56W", "Overall": "5.0", "Content": "The picture quality is as great as everyone has told me about LG. I especially love that it has a matte screen since it's a room that has a lot of windows.", "Date": "February 24, 2011"}, {"Title": "probably 95% of what I wanted in a TV", "Author": "B. Geraghty \"Resident Geek\"", "ReviewID": "RRUNREQ7R0TO1", "Overall": "4.0", "Content": "So I'd say that I'm very happy with my overall experience with this TV. From the delivery, setup, picture quality, responsiveness. I'll fully admit a couple of things. First, I upgraded to this 42 incher from a 26 inch 'circuit city' native brand which was often the bane of my existence. So to work with a TV of this caliber was a high contrast to be sure. Second, the functionality which I was very excited about, but have yet to find is the ability to stream personal videos/movies over my home network. Sure I can tie into netflix and vudu and even picasa, all of which are very cool. However I want to be able to create a place on my network where I can dump files, and then access them from my TV. As of yet I have not figured out how to do that. While this might not be important to your viewing experience, it was something I was after and as a result this TV get's a 4 until I figure out a way to make that happen.Overall though, I have zero complaints about the unit itself. Great quality, responsiveness and features. And considering I got it for like $450 out of pocket, I was a pretty happy camper. That's basically what I paid 4 (almost 5) years ago for the TV I was supplanting.", "Date": "February 24, 2011"}, {"Title": "Fantastic TV for a great price.", "Author": "Seth A.", "ReviewID": "R3QNWC1U0OX327", "Overall": "5.0", "Content": "I bought this TV Super Bowl Sunday weekend on a steal deal at FRY's. I cannot post prices here but I will say that I got it at half of the list price on Amazon. This is a great deal for this TV with Internet capabilities. The picture quality is fantastic, I was extremely impressed with even Standard Definition DVDs being up-scaled to 1080p via my Sony DVD player.I do not watch Cable TV, I primarily watch movies and streaming content online. I use Hulu via my laptop computer with an HDMI cable and the picture quality is fantastic. The sound is very adequate for my 1 bedroom apartment living room. If you have a very large living room you might consider an amplified stereo system, but that is to be expected with such a slim TV like this.Netflix works pretty well on the TV as well, although I am not a monthly subscriber due to lack of online streaming content. Yahoo Widgets is a neat feature, although I have not really used it. I like the integrated Youtube program, it is easy to watch some of my favorite videos. However, I would like to see more options in the future (like being able to login to your favorites and your subscriptions on your Youtube Account). I would also like to see Amazon's Video On Demand service with this TV in the future.The energy Saver feature is fantastic. You can set it to Automatic, and it will adjust the brightness based on how bright your room is. If you turn on a lamp or light, then the brightness will increase, and when you turn them off then the brightness will decrease. I love this feature.I went back to Frys Electronics the next weekend after buying this TV and the price jumped back up to the full list price (Twice what I paid). I would not be willing to spend that much on this TV. But if you can find this TV on Amazon or an online retailer on sale then it is an excellent buy. I am very happy with my purchase.", "Date": "February 20, 2011"}, {"Title": "internet  tv", "Author": "Trevor Stevens", "ReviewID": "R3VIVMARV03XWU", "Overall": "5.0", "Content": "this  is a great tv  we had to go through  a process  to get connected to internet  with our wireless connection  but the end result is  lots of fun with you tube on the big screen  just scroll through your favorites  which are on you tube  and watch them on the tv  all  done with the tv remote. we needed a fibre optic cable with our home theater reciever  though and an adaptor for that cable , also wireless router  we purchased  made by linksys.  would recommend this tv to anybody", "Date": "January 11, 2011"}, {"Title": "Great Product", "Author": "T. Damo \"casualbuyer\"", "ReviewID": "R35OHIV1NNY90I", "Overall": "5.0", "Content": "Everything is great about this TV. From feature to performance to the way it look in my living room.I can't stress how great everything about it is.As a constructive criticism to the makers it would be nice if the remote buttons were lighted, so I can see the buttons during night time movie watching. Also to location the remote signal receiver in the middle as opposed to the right so i dont have to directly point to the right in order for the TV to recive the signal command from the remote.These are not problems at all they are just a way to make the model better.", "Date": "January 5, 2011"}, {"Title": "Extremely Pleased!", "Author": "Jamey Bowles", "ReviewID": "R142PR0W8ZC1G3", "Overall": "5.0", "Content": "I checked out several TV's before I bought this one, and I couldn't be happier with my choice. The HD picture quality is great! The sound isn't bad, but the standard sound option leans toward the \"treble side\", but I honestly haven't messed to much with the sound settings yet. (I plan on getting a sound bar anyway.) I love having connected to the internet in order to get Netflix and other movie channels, just wish LG had a few more apps loaded. Overall we love it!", "Date": "January 5, 2011"}, {"Title": "Overall very nice", "Author": "JustinW", "ReviewID": "R34WK4QRV398C8", "Overall": "4.0", "Content": "Very nice first HDTV. It's being primarily used for Boxee (through computer, not Boxee Box) and Console gaming.While it appears this is pretty standard nowadays, it would be nice to have the AV Input control cycle through the available inputs (esp if it cycled between inputs it senses as having an active source). Instead, you have to hit the Input button, then use the navigation keys to highlight the desired input, then hit the Enter button.The NetCast features are not really that special. Yahoo Weather, News, etc. are no big deal to me. NetFlix works well. Keep in mind I'm using this with Boxee so these features are barely looked at.Like all TVs, there's just too many buttons on the remote. Changing AV input is all I need from it.This particular model only has 1 audio output (3.5 mm headphone jack) so if you need anything else, you're better off getting a different model. Again, for me, it's not a big deal as this TV is being used for Boxee through a computer. Currently only using the VGA input and it looks good. (changing over to HDMI in the near future).", "Date": "January 4, 2011"}, {"Title": "GREAT PURCHASE - GREAT SELLER", "Author": "MissBlakeley", "ReviewID": "R3E2P69RX70JIG", "Overall": "5.0", "Content": "I am not an electronics expert by any means, but I kept coming back to this TV. Consumer reports rated it well, and most of the reviews on Amazon were great. I purchased in November and am exceptionally pleased with it.", "Date": "December 27, 2010"}, {"Title": "Excellent TV for the Price", "Author": "EMS", "ReviewID": "R1Z5WTRDBG3KY5", "Overall": "5.0", "Content": "Overall, I'm very pleased with this purchase.  I researched extensively and finally settled on this one (Samsung LN40C630 came in second place).  I picked this up for $699 from a third-party seller that was fulfilled by Amazon and have had it for a little over two weeks.  This was during Black Friday mind you, and I couldn't find any better deal for a name brand 42\" 120 Hz anywhere really.  The picture quality is crisp and vibrant, there is no lag on the screen, the audio is better than expected, the interface is pretty slick, and it's light and aesthetically pleasing.  Major upgrade from my previous 37\" Olevia.  The swiveling base is also key.CEVA delivered the TV; they simply carried it to my living room, but didn't set it up.  It wasn't that big of a deal to me, though, as it's pretty straightforward to take it out of the box and set up the stand and screw the TV on it.  Installation was quite easy to do on my own.On the negative side, I'll say that the remote is not so great.  I supposed it gets the job done and has all the necessary features, but it is huge and looks like a novelty toy in my opinion.  It doesn't matter to me after the onset though because I simply use a TiVo remote, which was easy to setup, so I'm not going to penalize the TV.The interface of the menu for the LG is straightforward and easy to use - it's quite easy to configure the TV to your liking.  I have found that I like turning on TruMotion only for sports (have it on 5-user) while turning TruMotion off for everything else.  Some may like the \"soap opera\" effect, but it does make it seem like things were shot on a handheld camera and doesn't seem very professional/movie-like.  For sports, though, it's great because it makes it seem like you're there.In regards to the other settings, google \"LG 47LH90 picture settings\" and a cnet forum provides the optimal ones they found for a similar LG set.  I found these to be fairly close to what I thought was best as too, but everybody has their own personal taste.The Netcast functionality is decent, but not outstanding.  I haven't used it very much and actually use Netflix through the Tivo instead, but I've dabbled around a little bit watching Youtube videos and the like.  I'd say there is still work to be done with the netcast amenities, but it has a few nice basic functions.  While that is supposedly the selling point for this TV, it wasn't a main factor in my decision.  My main deciding factors were picture quality, price, durability, aesthetics, and overall design, and I'd say it excels in those areas.  I thought for an extra $30 or whatever, it was worth having internet-capabilities for the future.Definitely happy with this TV!", "Date": "December 16, 2010"}, {"Title": "Very Happy !!!", "Author": "Happyviewer", "ReviewID": "R7HTUESXXCY94", "Overall": "5.0", "Content": "I bought this TV on Black Friday, and it was installed on Monday after. I am glad I had the shop install it, since it is quite complicated with the new surround sound system/Blue Ray player and our Comcast DVR box and so on. We went from an old 26 inch comventional TV to this incredible machine, and we are DELIGHTED, DAZZLED and ecstatic.I would recommend it to anyone!!! You have to be aware that the wireless only works if your router is near the TV, we'll have to change that, before really being able to enjoy that.It is the first time in my life that I actually watch the ads, since they are soooo clear!!! Best pics of course on HD channels, especially when watching sports, I can see the blades of grass on the football field!!!", "Date": "December 15, 2010"}, {"Title": "Great picture!!", "Author": "Alex", "ReviewID": "RHE9QSGJ3EKS5", "Overall": "5.0", "Content": "After reading all the good reviews about this LG 42\" TV, I purchased it on the black Friday season at comparatively low price.  Overall, the picture quality is nice, i mean great.  It automatically adjust the brightness depends on the light condition in room.  Sound quality is poorer than I expected, but not bad.  It's design is also great.  It looks great with my black TV desk.Complaint is, that there is no keyboard on my remote.  I have to move direction to search on Youtube.  and there is no FACEBOOK!  and I had to spend another $50 to connect wifi.  (you have to get USB wifi device that only works for LG TV device).Other than those, I am enjoying my TV day and night.", "Date": "December 14, 2010"}, {"Title": "Wow!", "Author": "Cheryl r. \"bensongirl\"", "ReviewID": "R32YTBDBL2Y5HY", "Overall": "5.0", "Content": "Ordered this tv online and delivery was spot on in just a few days.  Set up was decent.  Used the help desk.  Was able to get our cable provider by help desk as well.  Both sets of help desks were able to help us get it up fast.  The picture, unbelievable, sound quality is terrific.  The directions from television include other models so confusing...but help desk again, was flawless.  Love our new tv...now for the weekend, decision/install Blue Ray.  More proof to me that you can order anything online.", "Date": "December 14, 2010"}, {"Title": "Stunning", "Author": "D. Hufford \"dhufford\"", "ReviewID": "R18Y5TN0ZWTMYN", "Overall": "5.0", "Content": "After much research in this price range, I decided to go ahead and purchase the 42LD550.I haven't had the TV for long at the time of review, but I can say so far the experience has been amazing.  Not a single defect in the panel, no overly noticeable backlight bleeding on my screen, and overall excellent color and quality out of the box.For watching movies I keep the Trumotion settings on low.  It's the perfect balance that helps reduce motion blur, while at the same time avoiding the \"too fast\" soap opera look.I can't attest too much to the internet features, as the PS3 does basically everything that Netcast supposedly does.  I didn't see the merit in buying the wireless adapter if the PS3 could already serve all of the functions that I wanted (and then some, e.g. Hulu Plus).The reason I bought this model over the 42LD520 is because of the higher contrast ratio (150k:1 vs 100k:1), not because of the internet features.  It's nice to know though that if I ever need any of those features they are there.I don't have a cable/satellite subscription, so I can't say how it performs as far as antennas or interaction with cable boxes, but I don't have any reason to believe it would perform any differently.  I've become a Netflix+Hulu user because I can't stand to pay the amount for cable/satellite when I can get everything I need elsewhere (not a sports watcher).  Internet content comes in at a lower quality (even in 1080p) because of compression, so unfortunately I don't get the very best out of the TV all of the time, but I still enjoy Blu-ray in full quality.As with any flat panel, the speakers leave something to be desired, but I plan on getting a home theater system in the coming weeks, so that will soon be an issue of the past.The only weakness in this whole buying process was the shipping, but both Amazon and the carrier (Pilot) were able to work everything out with me.  If you're buying this during the holiday season and you have the option of doing scheduled delivery, I would recommend giving a few days of buffer from when it actually says the delivery will be available.  I expected the TV to arrive in a certain time-frame, so I worked from home that morning, and then no one ever showed up.  Upon calling Pilot I was told that they hadn't received the package from Amazon yet.  Well, that would have been okay if someone had let me know ahead of time.  Like I said, Amazon handled this situation beautifully, and I don't have any regrets.", "Date": "December 10, 2010"}, {"Title": "LG TV 42\"", "Author": "Smallfoot", "ReviewID": "RAUU62JMSIURY", "Overall": "4.0", "Content": "Delivery was well planned and the TV arrived in perfecT condition.  We had some major problems getting it to work but it was our provider (Time Warner) and not the TV.  It's only been 2 weeks but so far we are very pleased.", "Date": "December 9, 2010"}, {"Title": "Great TV, but issues with shipping", "Author": "Lester Pimentel", "ReviewID": "R28MQH9PH7NGZ6", "Overall": "4.0", "Content": "This TV is an amazing looking unit, especially when compared to the 46\" projection Sony it replaced.  I thought I was looking at an HD picture with the Sony, but the picture on the LG is 10x cleaner and brighter to me.  Nothing negative about the TV to mention at all.Now, on the the shipping issues.  Like others here, my TV was shipped via Home Direct.  Now, that \"Want it delivered by XX Date?\" in the description is just a guarantee that your TV will make it shipping company by that date.  You then get a call from the shipping company to schedule a delivery.  In my case, this was 4 days after my \"Want it delivered by\" date, which was frustrating to say the least.  I did bring this up with Amazon customer service and they were extremely sorry and offered me a shipping credit.  They probably shouldn't have the delivery guarantee mentioned in the item if it's out of their hands once it gets to the shipping company though.", "Date": "December 8, 2010"}, {"Title": "Amazing TV for the price", "Author": "Brad", "ReviewID": "R2EDUTKRIGMYNH", "Overall": "5.0", "Content": "Absolutely loving this tv, which is wall mounted in my bedroom.  True Motion is hard to get use to, but a friend of mine said that my eyes will adjust to it eventually.  Bought my first blu-ray player for the TV and I must say I didn't know what I was missing when just watching the standard dvds.  The picture on this tv is amazing and the menu setup is very easy to navigate.  Excellent buy for the black friday sale.", "Date": "December 6, 2010"}, {"Title": "excellent tv for the price", "Author": "(ExceL)", "ReviewID": "RRGF4BYGCGKL", "Overall": "5.0", "Content": "Pros : excellent tv/quality is great!/decent sound/lots of inputs/I love it!Cons: noneI really enjoy watching HDTV and the picture quality rocks! so i have nothing bad to say about LG.", "Date": "November 27, 2010"}, {"Title": "Love this tv", "Author": "R. Gohad \"Crab Man\"", "ReviewID": "RJI9L2I1YANPM", "Overall": "4.0", "Content": "This an eexcellent purchaseI have had this tv for last 4 months and my experience is greatHighly recommend", "Date": "November 1, 2010"}, {"Title": "LG42LD550 TV - not playing all youtube videos", "Author": "cons54", "ReviewID": "R3V9G7HAVPFT4K", "Overall": "4.0", "Content": "Last Edit: Dec 11, 2011I bought this TV 1 year back. Youtube app giving problem recently. It does play some videos as expected. However it does not play all videos. It blackens out TV screen when I start the video or exits from Netcast in the mddle of playing the video. Called LG today. They informed me that my warranty finished, and I need to take it to some shop. They have no software update available. Reducing to 4 star.Prev Edit: Nov 15, 2010I have bought the TV with the wifi USB dongle. The picture quality is very soothing. I found every setup easy. While using the remote control, to enter text or digits, use the \"FAV\" key to switch between the two modes. The \"FAV\" key is just below the 3X4 number pad.I used NETFLIX to stream movies. With a 6MB download capability of my DSL, it was very smooth. I did also logon to Picasa, yahoo, and Twitter. However, I noticed buffering on a few Youtube videos, but some were good without buffering.I had problem with Youtube search after update to version 8 of the software. I spoke to LG afew times, and got it rectified with Software version 8.00.11, on Nov 12. So I am returning to giving 5 star ***** rating.Pros: NETFLIX, YOUTUBE, User Interface, Picture qualityCons: The navigation keys in the remote are below the body level in the remote, and needs a bit of extra effort to use. The quality of the plastic in both the remote and USB wifi dongle are not great.Overall: Very satisfied with this purchase.", "Date": "September 28, 2010"}, {"Title": "Perfect TV", "Author": "akk1477", "ReviewID": "RIG90LDYVTAEN", "Overall": "5.0", "Content": "This TV has the clearest picture I've ever seen on an LCD TV.  All who have entered my home, have commented on the crisp picture.  It was easy to set up and has been easy to figure out all of the little extras.", "Date": "September 27, 2010"}, {"Title": "Excellent TV!", "Author": "P. L. Mclaughlin", "ReviewID": "RG0IMS7G86LGF", "Overall": "5.0", "Content": "I returned a Samsung that didn't have the wonderful attributes of clarity, color and freshness that this TV has. It is a wonderful TV all around and an especially excellent value.", "Date": "September 22, 2010"}, {"Title": "spectacular television", "Author": "L. Cato \"L. Cato \"computer gurl\"\"", "ReviewID": "R2I4F8KGO8CYX6", "Overall": "5.0", "Content": "For this to be my first HDTV purchase, let me say that I am very happy with my purchase.  First of all, I like the look of the t.v from the beginning.  Then once I finally made up my mind about purchasing it, I looked at other sites and the price could not compare to AMAZON, so that was my second reason.  Third, I already own an LG air conditioner and it's been working like a champ since I installed that too.  The picture quality is outstanding and the ease of use in which I quickly learned how to adjust the picture to my liking, was just plain cool.  My family likes it too.  Anyway, get this T.V. you won't be sorry.", "Date": "September 21, 2010"}, {"Title": "NIIIICE!", "Author": "Designer", "ReviewID": "R10OWVIGS3UMQH", "Overall": "5.0", "Content": "I am more excited about this new television than my husband (doesn't defy genetic code?)All positive reviews are spot on. The only thing I could add (slight disappointment) in the YOUTUBE favorites.I was happy that this TV is enabled with Netcast. I thought FINNALLY! No more sticky 16 month old finger prints on my Macbook! Unfortunately you can only save 20 YOUTUBE favorites (we need a longer list for a girl that gets sick of \"C is for cookie\" one day but NEEDS it another day and so on with our 30 favorites).Small detail! GREAT TV!", "Date": "September 13, 2010"}, {"Title": "love my 42\" LG", "Author": "06joy", "ReviewID": "R2Y2OU1IQC7O56", "Overall": "5.0", "Content": "I purchased a 42\" LG LCD about 1 year ago and was so happy with the quality that I purchased a second one for the living room.  It makes a statement when you walk into the room and is so easy to set up and use.  I highly recommend this TV.", "Date": "September 11, 2010"}, {"Title": "broke after a month", "Author": "Tara McKeever", "ReviewID": "R1EGXXAS76M5XH", "Overall": "2.0", "Content": "Initially, the TV was great-we loved it. Unfortunately after a month, the widgets stopped working and the Netcast features were slowing down. We called customer service and they sent a repair company to pick up the TV. we haven't seen it since and it has been over 2 weeks. First LG sent the wrong part, then they said the right part was backordered and they had no idea when it would come in (apparently this must be a popular problem that needs replacing?)I had to call LG directly and no one was helpful--it was like they could care less. I was told they couldn't help me because the parts department was closed and they'd call back. They never did. I called them back again, and was finally given a case number and told to email them with a copy of the sales receipt for a replacement TV. It has been over 24 hours and I haven't received any acknowledgment yet. It has been almost 3 weeks since my TV broke...at this rate it will be out for repair longer than it has worked. Very disappointed with LG--especially customer service and repairs.", "Date": "April 26, 2011"}, {"Title": "Awesome TV", "Author": "Meade", "ReviewID": "R20UFL2P1AZFWG", "Overall": "5.0", "Content": "I mean, I just love it. The picute is just amazing. The colors blow you away. And the Netflix feature is incredible. Very fast and good quality. My only regret is not getting a bigger one.", "Date": "April 22, 2011"}, {"Title": "A great buy", "Author": "I. Wong \"Y Square designs\"", "ReviewID": "R1LQ9RPYU02BXU", "Overall": "4.0", "Content": "Purchased this TV from Best Buy as AMZN does not ship TVs to Hawaii. I feel I got a good price but not as low as on AMZN. :(The set up was easy and intuitive although I haven't really fine tuned the tv. Regular tv is nice and HD is crystal clear (almost 3D). Does well in a very bright room as my living room has a lot of sunlight. The off center viewing is also decent. Overall, I am please with my LG LED LCD TV purchase. I just hope this TV last as this is my first LG purchase. One missing app is Pandora.", "Date": "February 2, 2011"}, {"Title": "Outstanding", "Author": "Daniel", "ReviewID": "R1JT6ZGLEUEO0A", "Overall": "5.0", "Content": "This was perhaps the best electronics purchase I have ever made. I loved my new TV and am just blown away by how simple it was to set up and how amazing both the picture and sound quality are. Amazon had a price that was unbelievable and that included the free shipping, waived the California recycle fee and zero tax. Why would anyone shop elsewhere? I would highly recommend this LG TV to anyone who is considering purchasing a new Television....and the best feature it that it comes with Netcast.", "Date": "November 14, 2010"}, {"Title": "LG: A great TV for just watching TV", "Author": "Casey Prisee", "ReviewID": "R1FKZR3D76OUR7", "Overall": "2.0", "Content": "I bought this television on sale through amazon. Here is my list of pro's and con's:Pros:*Great picture quality*Easy set-up*Lots of available ports*This tv actually has games on it, such as sudoku and whack-a-mole.Cons:*Wireless dongle sold separately (was $75 at Best Buy). The dongle is made by LG specifically for these televisions. A regular wireless adapter from your computer will not do the job.*Remote control buttons could have been arranged better. For example: The \"input\" button is at the very top of the remote, while the directional pad is way down at the bottom. It's quite a reach for your thumb. Also, the \"flashback\" button, instead of going directly to the last channel visited, just brings up a list of all recently visited channels, through which you must thumb through, every single time. It kind of defeats the purpose of the button.*The Net-Cast feature. It's why I bought the tv, actually-- so that I wouldn't have to go though my game console to access Netflix and YouTube. But in this department, the LG does not deliver. It gives you seven wireless channels to choose from: Netflix, CinemaNow, MLB.tv, Picasa, Vudu, Yahoo!, and YouTube. No Hulu, no Pandora, no Google. Sounds bearable, right? Half the time, it cannot even connect to the internet, even though everything else in my apartment can. And for some reason, browsing YouTube on my tv brings back only a fraction of the search results as when browsing on a computer. The videos that *are* able to play are blotchy and pixellated, and not clear at all.*Because of my location (and I don't live in the woods), shipping was a big hassle. Way to go, amazon.Bottom line:If you're looking for a basic tv, consider this one. If you're looking for a well-made wireless-ready tv, buy a different brand. If you have nothing else better to do than sit at home all day waiting for packages to be delivered to your home, buy from amazon.", "Date": "April 14, 2011"}, {"Title": "Dont ship with Home Direct", "Author": "Captain Dave", "ReviewID": "R3CMABRPEQXCCZ", "Overall": "3.0", "Content": "I still have not received the television but my friend has it and its amazing. WHAT EVER YOU DO DO NOT SHIP THIS TV VIA HOME DIRECT. So far my tv is 8 days late, and the shipper has no idea where it is. To get to customer support you have to wait 15-20 minutes on the phone and they will not give you any answers. They also don't deliver on the weekends. Pay the extra cash and have a professional ship it, not these idiots.", "Date": "November 24, 2010"}, {"Title": "3 Months and it's broke now...", "Author": "William M. Merritt \"Mike Merritt\"", "ReviewID": "R3FGK1LP4GJV30", "Overall": "1.0", "Content": "I bought this tv at the end of January.  I've loved it up until now, as it has broken now.  The tuner has gone out of it and now I get to own a 3 month old repaired tv that I paid a new price for.The tv itself has been great, I love all the features and the picture is awesome.", "Date": "April 27, 2011"}, {"Title": "Wireless accessory is inconsistent and Pillot Delivery was unsatisfactory", "Author": "Kevin P Dugan", "ReviewID": "R23Z7B2NUHALYE", "Overall": "2.0", "Content": "The delivery service left the big, unwieldy box in the lobby of my apartment building, even though the Amazon description of the special service said that the delivery person would bring it into the room where it would be installed.The firm was Pilot Freight Services, but I don't blame them as much as I do Amazon. The delivery guy explained to me that his company was paid the \"economy\" rate, not the higher living room delivery option that was publicized at Amazon.The box had been previously opened and was re-taped. The delivery came before the pre-designated time, and I was lucky to just make it back from work in time.My email about the issue was never answered by Amazon. An altogether unpleasant experience. I would recommend a brick and mortar store for big-boxed, big ticket items like this. I use the wireless box that is sold separately, and I frequently get \"no signal\" readings, even though it is very close and the tv reads 5 bars when it is working.", "Date": "January 12, 2011"}, {"Title": "Remote only works from a few feet away", "Author": "Xpert Shopper", "ReviewID": "R20KT52BYZ956R", "Overall": "2.0", "Content": "Just bought this tv and was delighted by the picture and sound. However, I cannot get the tv remote or the Verizon remote to work the tv at all from more than a few feet away from the tv. I've looked all over to see if I missed removing something from the front that might be blocking the remote sensor, but I see nothing. If I could figure out why the remote capability isn't working right then I would change my rating to 5 star.", "Date": "November 21, 2010"}, {"Title": "LG LCD", "Author": "Melissa A. Switalski", "ReviewID": "R2EHHT56T8AVFL", "Overall": "4.0", "Content": "The only thing that would make it better is if came with the WIFI adapter.", "Date": "July 26, 2010"}, {"Title": "Excellent Quality", "Author": "samirp", "ReviewID": "R3O7XOLMYUJF8F", "Overall": "5.0", "Content": "Bought this after much research and we are really pleased with the quality and performance.Only one thing that bothers a bit - sound quality. I have not completely analyzed whether it's inherent TV problem or my settings, so would give this TV a benefit of doubt.", "Date": "April 18, 2011"}, {"Title": "hoping it was just a faulty tv", "Author": "benny09", "ReviewID": "R1TP09EVKQU621", "Overall": "1.0", "Content": "The picture on this tv was outstanding...well, about 2/3 of the screen was outstanding. I ended up returning this item about a month ago (still no refund from Amazon...). The tv came a little bit later than expected (carriers fault, not Amazon), and was very impressed when I first turned it on. The picture was incredible for an LCD. Unfortunately, the right 1/3 of the screen was either damaged or faulty. Green pixels were showing up almost constantly, making it frustrating and impossible to ignore them. The problem was so obvious I could not put up with it. Sent it back about a month ago and still waiting on a refund. Pretty disappointed, but I really do hope it was just one faulty tv.", "Date": "October 8, 2010"}, {"Title": "Wifi tv", "Author": "Naveen", "ReviewID": "ROLVICY92A352", "Overall": "3.0", "Content": "Good one. After lot of research we bought it but I don't think we need wifi tv. It has only few apps useful . I think wifi tv is not worth. Shipping is good. Picture quality is not that good.", "Date": "March 27, 2011"}, {"Title": "Nice TV but...", "Author": "Benjamin Sevilla \"BJS\"", "ReviewID": "R1NDI3F8YKCQ0W", "Overall": "3.0", "Content": "We got this TV as a gift for my daughter's room.  This is our first LCD, I am more of a plasma guy.  I got this due to the high reviews, price and built in Netflix and Vudu.  I grabbed it from Costco due to the additional 2nd year warrantee (free).  When I first opened the box, it was missing the base mount (plastic that connects the LCD with the base) so I had to repack it and go back to Costco. The guys at Costco said that I'm the 2nd customer that has this issue and gave me the missing piece from another box so that I do not have to return and re-buy. So I assembled it and found that it was missing one screw. No biggy, I'll get one from the hardware.  Wow, what a horrible packing quality control!  Fully assembled, the TV wobbles a bit when touch or swivelled. I checked the Costco display and it wobbled the same way.  We may wall mount it later.  The TV works well with the tuner and xbox.  Display was nice but I still prefer the picture from my Panasonic Plasma.  I thought the TV can do Skype using a USB webcam. It will if you buy the optional LG Skype webcam (model ANVC200) which cost around $75-99. My daughter prefers to use her laptop for Skype.  I don't see an option to program the remote for the cable box.", "Date": "February 19, 2011"}, {"Title": "It was okay", "Author": "Dr Sim", "ReviewID": "R33FJAOK26WPH7", "Overall": "2.0", "Content": "It took me months to chose the right tv and it seemed like this Tv looked great and the price was good. I recieved the Tv quickly and Ceva shipping was great, they set it up for me. Now when it comes to technology, I'm a critical guy, I know quality and I just gotta have the right quality when it comes to this. So why did I ship this tv back to amazon? I shipped it back because this LG tv is not good with motion. If you love videogames, movies and entertainment then this tv wont satisfy you. sometimes things look really good when there not moving fast and toy 3 looked awesome but once things get going, the blur was bothering me.The biggest thing that made me mad was the fact that I upgraded from a 32 inch Jvc old school crt tv. Now this old tv did not have any motion problems, I never complained about that tv, it's only problem was that it was old and heavy but it was a great tv. So going from 480I to 1080P that looked great but going from my Crt motion to this Lg motion was a mess. I don't like the true motion feature, it makes people look soap opera like and i don't want that affect on my movie unless the movie was made to look like that. Now if your a fan of that real type of look then you might be happy with this tv. It just didn't work for me. I hooked it up through hdmi, I used it for blu-ray and xbox 360 and it was just average.If the motion was smooth without the added soap opera effect then I would of been happy but it just didn't cut it. So I'm probably going to get a plasma nevause there motion is the best and the burn-in problems aren't too bad these days..plus I'll get a warranty so I'm not worried. I recommend spending a little more money and you'll be happy and also you can spend a little less and get a Vizio, I used to think that Vizio sucks but the motion on my friends 3 year old Vizio was better then my 2010 Lg hdtv..what the heck? I hope this helps someone, if your critical like me then you'll follow this advice. if not then this tv should be great for you.", "Date": "January 31, 2011"}, {"Title": "network", "Author": "draganla", "ReviewID": "R17CKB9U0U4PEC", "Overall": "1.0", "Content": "This TV is a great product. It was easy to set up and quality of picture is excellent.  My only problem that updating of software is preventing use of Internet application.  Regardless if auto update feature is on/off it always starts looking for updates, get connected to network, starts downloading, makes some progress (17% at most ) and that's it.. Not sure why but it won't re-connect and continue where it was interrupted.  There is no way to go around \"updates\" and system will not let you use applications until \"update\" is completed. So for now I'm stuck with TV and what is achievable through Wii (Netflix ...)", "Date": "March 12, 2011"}, {"Title": "So-k", "Author": "HFreeling", "ReviewID": "R7C4XJW0T4OZV", "Overall": "3.0", "Content": "The tv is very nice, except I have found it impossible to fine tune.  The picture is adequate, and the sound it adequate.  Not wanting to settle, I have spent some time trying to do better.  I cannot fine tune either to get them to great.  To be fair I do not have a HD input so maybe that would make a difference.  I have not used any of the other features of the television, so all I can speak about is the basic picture and sound.At this time, I would not consider buying this television again.Oh, and the company that does the shipping for amazon missed my appointment day, then came late the next day.  They gave me the BS line that they just got the paperwork.", "Date": "February 12, 2011"}, {"Title": "Huge letdown", "Author": "Meg", "ReviewID": "R1Z8ZAVGBNK788", "Overall": "2.0", "Content": "I bought this TV because I thought the internet applications would enable me to get rid of Time Warner cable.  It does not.  There are few options for applications and none of them include watching TV shows. The TV quality is fine, but don't waste the extra money on the internet applications.  I basically paid an extra $250 to watch Netflix on my TV.  The other applications are all features that you can get on any TV with digital cable (news, sports updates, etc)", "Date": "January 13, 2011"}, {"Title": "Terrible Delivery!!!", "Author": "Amazon Customer", "ReviewID": "R1YR9ULML5649T", "Overall": "1.0", "Content": "Home Direct was terrible.  They never knew where our tv was or when it would be delivered, even though it was scheduled to be delivered on 2 separate occasions.  We never got to enjoy the tv as we returned it before it came as it was 3 weeks past the initial delivery date and Home Direct still hadn't contacted us to set up delivery when we were told it would be ready for delivery (for the third time) 2 days ago.  I would not recommend buying this product if it is delivered with Home Direct.  Amazon was helpful with the return and attempting to help us locate our TV however we were still frustrated with the experience with Home Direct!", "Date": "December 7, 2010"}], "ProductInfo": {"Price": "$599.95", "Features": "NetCast Entertainment Access (Wi-Fi Ready)\nWireless 1080p Ready\nTruMotion 120Hz\nFull HD 1080p Resolution\n150,000:1 Dynamic Contrast Ratio", "Name": "LG 42LD550 42-Inch 1080p 120 Hz LCD HDTV with Internet Applications", "ImgURL": "http://ecx.images-amazon.com/images/I/41ISaUPK81L._SY300_.jpg", "ProductID": "B0039RSYQS"}}