{"Reviews": [{"Title": "Great Upgrade", "Author": "Sunsand", "ReviewID": "R3CSQCC34YVVJV", "Overall": "5.0", "Content": "The set up was extremely simple.  I replaced a 52\" Toshiba DLP that was about 6 years old with this Plasma TV.  I did a considerable amount of Internet and in-store research on this TV before I pulled the trigger.  I couldn't be happier with the purchase.  I'm probably a mid-level audio and videophile.  The picture upgrade when comparing this to my DLP is significant.  Here's a tip--I purchased this TV direct from Modia for quite a bit less than I could find it for anywhere else.  It arrived 4 days after I bought it.  The sound out of the TV is quite good.  I'll be connecting to my router this weekend to start exploring that aspect of what the TV offers.  Samsung has done a fine job of fielding a user friendly TV that works exceptionally well right out of the box.  You'll need to purchase HDMI cables and the Digital Audio cable, but everything else appears to be provided with the TV.", "Date": "December 15, 2010"}, {"Title": "problems with white background", "Author": "Tell-only-the-truth", "ReviewID": "R1VG5VHVTKQOBX", "Overall": "1.0", "Content": "Bought one of these and have had it about a year. After 2 months it started displaying  a wide pink bar hoiozontally across the screen. Under warranty the panel was replaced but it still displays this somewhat. With normal pictures it seems to do OK but with any bright or white background or same but with writting it has troubles displaying images. I recommend you look elsewhere.", "Date": "June 8, 2011"}, {"Title": "I got this TV back in 2010...", "Author": "Sade", "ReviewID": "R858RTBM8I2Q1", "Overall": "5.0", "Content": "...and guess what? I still love it!!!!!!!!! The apps are great. I stream Hulu daily. I don't have Netflix but that app is available as well as Pandora and several games. I love the picture on a plasma set and wouldn't trade my bundle of joy for the world.There does seem to be a slight hum when the tv is idle but's it's nothing to go dropping ratings about. Plus, it is going on being 2 years  old.", "Date": "November 20, 2012"}, {"Title": "Buy something else", "Author": "dew", "ReviewID": "R19JUJT41Z40BG", "Overall": "1.0", "Content": "So... New, out of the box it was OK but about 6 months later it developed a purple stripe about 10 inches wide across the screen in the top section. Samsung replaced the screen, under warranty only to find the stripe was still there. Their technicians argued that it was a defective screen and two weeks later another screen was put in place. That one turned the purple stripe into a grey one which eventually turned purple again in the last day of warranty. I called Samsung and somehow I was talked into calling the next day so I can explain the situation to somebody more qualified who happened to be off that day. Naturally the next day \"the more qualified person\" explained me that now the warranty is over. Pretty sad I'd say. Maybe the \"buy American\" idea is not so bad after all but fact of the matter is I will never buy another Samsung product ever again regardless of how attractive the price will be.", "Date": "November 13, 2011"}, {"Title": "Pink band strikes again.", "Author": "J Halford", "ReviewID": "R2ZKW3491QUITF", "Overall": "1.0", "Content": "I guess from the perspective that it lasted longer than a day after the warranty expired, I got lucky.  I bought the TV in July of 2010 and it's taken until August of 2013 for the band to appear.  I thought I had done the right thing when I switched brand loyalty from the Sony's I've always bought in the past (after Sony burned me with a DLP set that didn't last more then a couple of years).  All the reviews were glowing and I even bought the set at a Premium Audio/Video and they had nothing but good things to say about Samsung TVs.  And, honestly, we've been thrilled with the size and quality of the display, up until now.  Other than the band that appears when there is an overwhelmingly light/white image being broadcast, it is still a fabulous picture.  I tried to get some help from Samsung Customer Care via chat and that got me nowhere.  Even though there is no way they don't know about this chronic problem, the rep on the other end tried to tell me that my issue originated from my input source or cabling.  So my game console, sat box, and DVD player all went wonky on my at the same time?!  Anyway, I wouldn't buy this set unless you pay for an extended warranty and don't mind knowing that you will probably have to go through the hassle of filing a claim under it.  I know better than to expect things to last like a good old Trinitron did in the past, but if you take the price I paid for it and average it over the three years it's lasted care-free, that's six hundred fifteen dollars a year.  Too much, if you ask me.", "Date": "September 7, 2013"}, {"Title": "Great TV", "Author": "ohbabyjoz", "ReviewID": "R2CYLWEV53KWTI", "Overall": "5.0", "Content": "I love my new TV.  I got the 58 inch and I don't know how I lived so long with a smaller TV.", "Date": "November 10, 2011"}], "ProductInfo": {"Price": "$2,149.99", "Features": "Dynamic Contrast Ratio\n600Hz Subfield Motion\nUltra-Slim Design\nEnergy-Efficient Plasma", "Name": "Samsung PN58C6400 58\" 1080p Plasma HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/31a6wxkWHyL.jpg", "ProductID": "B003U47OBQ"}}