{"Reviews": [{"Title": "Great picture. Turn off the Auto Motion Plus", "Author": "Justin Noel \"Glitch\"", "ReviewID": "R136PBOBPVG9SA", "Overall": "5.0", "Content": "Fantastic picture quality! Easy to set up and use. Shippers were great, unpacked the TV and made sure it worked before they left. The only complaint is I spent my 1st whole night wondering why all my shows looked the Soap Operas. Turns out this is caused by Samsung \"Auto Motion Plus\" feature that adds extra calculated frames to the video stream. Turning this off made the picture look as I expected (i.e. Law and Order's proper gritty/jerky camera motion when the detectives are on the street). When this mode is off the tv is still running at 240Hz, but shows the same frames unaltered over and over just like the movie theater does rather than trying to \"make stuff up\" in between frames. I now only turn on the \"Auto Motion Plus\" when watching hockey.", "Date": "May 18, 2010"}, {"Title": "Be cautious with the UNC Models", "Author": "J. Miller", "ReviewID": "REPF1F4WAEDVH", "Overall": "3.0", "Content": "This isn't going to be a full videophile review; only a word of caution.  After purchasing this TV, on the second day, the menu would pop up and try to change to component or another mode (like store demo mode) or it would change the viewing settings from \"normal\" to the \"spanish soap opera\" looking one while we were watching TV.The bottom right of the screen has a red light that indicates that the remote is being used and it was constantly flashing during the times it was acting possessed or someone was inadvertently sitting on the remote.  After taking out the batteries on the remote, it continued.  In fact, it got so bad that we couldn't do anything with the TV, we couldn't even turn it off- we had to unplug it for a bit.  Then it would be ok for a short while.After calling Samsung, they directed us to a local TV repair place.  We described the problem and they contacted Samsung.  The TV repair place didn't even bother coming out, they wanted to order the part that was necessary to fix it.Because of this issue and the flashlighting in the corners of the screen, we decided to return it.  I honestly didn't want a TV that had to be worked on after the second day.  The TV repair place was really pressing us to get it fixed, but Amazon said they would not take it back if it had any work done on it.  So we returned it as is.We have been waiting for the refund to get the UN46C8000, and I started looking at the reviews and the comments for that one.  Apparently, others have been having this problem with the other model as well!So just be careful.  I don't know how well it works after being fixed, but it appears to be a very common problem with this years models.", "Date": "May 7, 2010"}, {"Title": "Happy With The Outcome", "Author": "MC70", "ReviewID": "R3MQSOPW0NJY2B", "Overall": "5.0", "Content": "I own several Samsung products and have been pleased with each one. I have also read of the horror stories of working with Samsung customer support and must say in my case all were proved false. I did my homework and was waffling between the UN46C7000 and the UN46C6300, thought for the extra money the 7000, 3D Blu-Ray Player and starter kit would be a fun addition to the house. The TV showed up as promised on the day I arranged, eagerly put it all together, inserted the 3D movie Monsters vs Aliens...it didn't work. Just got a blured image. What to do? My first thought was to return it to Amazon and start all over. But, decided to give Samsung a chance to correct the problem. The TV worked fine in 2D it just lacked the 3D and wow what a picture, it truly is crystal clear. The Blu-Ray disk player (BD-C6900) is awesome as well, a little pricey, but fast! Well the call to customer service went well, started with the standard card flipping problem solver who quickly passed me to technical support. He had me run through a battery of problem solving checks and decided a visit from a technician was necessary. Got the call the following day for a visit the next day and get this \"When it was convenient for me\"! I'm a teacher so it's not really easy to up and take a day for the usual \"I'll be there between Noon and 7:00\" appointment. He showed up at 5:00 ran through a series of tests, no not much different than the one's I ran through with the phone tech, but I guess he had to confirm the previous tests. Still no 3D. He needed to make contact with Samsung about his findings. Early the next week he returned, (yes, again when convenient) and found that I had at best a failed IR transciever or worse a failed main board. Got a call Monday of the next week that parts were ordered and an appointment was made for Thursday to make the repair. The tech showed up again and I now have 3D. So from beginning to end we waited a little more than 4 weeks to have the 3D but wow, it really is impressive. Yep, I know it's a gimmick and there are few movies to support the feature but Blu-Ray movies and HD television look spectacular and I would recommend the UN46C7000 on that alone. If I were to have one wish granted it would be to include built-in Wi-Fi instead of the add on stick, come on Samsung I paid a premium for this TV!If I had it to do all over would I buy this television again? Yes, but I had a working 2D television with a broken 3D feature. If the TV had shown up totally broken I might had a more negative review. Oh and at the advice of the technician I extended the warranty 2 years, just to be on the safe side.", "Date": "June 12, 2010"}, {"Title": "Samsung Fan is impressed beyond expectations.", "Author": "Jayson", "ReviewID": "R3TPV9QHTZ09CQ", "Overall": "5.0", "Content": "After a few weeks of research I finally settled on the Samsung UN46C7000. At the time it was about $250 cheaper on Amazon.com than in any local business that and for whatever reason Wal Mart, Best Buy, etc... did not carry the 46 inch TVs, it was either 40 or 55. Also at the time Amazon.com was running a promo to get a free 3D Blu Ray player and starter kit (worth around $700-800) with the purchase of the TV. I received the TV after about 10 days, there was a mix up with the local carrier that when I called to question the status of the delivery, they told me they were waiting for me to call them to schedule delivery.The first thing you notice when you take it out of the box is it is super thin and light. This TV is easily lighter than the older LCD 40 inch Samsung I had bought my parents. I could move and mount it by myself if needed, but I don't recommend that. Setup was easy, most of everything is just plug and play. However for everything that is not HDMI (VGA or CAT5 cables for example) the TV requires a special adapter for, which are all included. I assume this is to keep the slimness of the TV.The picture quality is amazing. If you are watching a Blu Ray it will look as if you're looking through a window and not a TV. Some of my friends however have complained that it looks \"too real\" and it looks like you're watching \"the making of\" instead of the actual movie itself. It does take a bit to get used to, but once I adjusted to the \"realness\" I love it. The auto motion 240hz feature makes everything incredibly smooth, you can turn the feature on or off in case you don't like the \"real life\" look.The 3D aspects of the TV are stunning. I have only viewed Monsters vs Aliens 3D and some of the Playstation 3's 3D demos. It really does look like things are reaching out at you. The TV also has a 2D to 3D conversion, this will not make things pop out at you, but it will add a lot of depth to what you are viewing, as if you could stick your hand into the TV. However, you need the glasses in order to view it. Everyone watching will need a pair because watching it without the glasses things are very blurry and it can strain your eyes.The Sound on the TV I can't say much about, they're good for TV speakers but you can't get a TV like this and use the default speakers, some sort of surround sound set up is a must. I personally use the Samsung HT-Z522 Home Theater System and it makes for an awesome in home movie experience.The TV stand is solid, I have used it and another mounting system. The TV is light enough I would be comfortable wall mounting it if I wanted too. I currently have the TV mounting on a swivel on the Bell'O TPC2127 Triple Play Universal Flat Panel Audio Video System with Swivel Mount. The remote is a very nice looking remote and and super easy to navigate. There is a button to back light all of the buttons, and it works as an on/off switch. (It will stay lit until you turn it off)", "Date": "July 21, 2010"}, {"Title": "Defective TVs from Samsung", "Author": "Andrey Golub", "ReviewID": "R3V06X4S43YS4O", "Overall": "1.0", "Content": "I just purchased this TV, and it had problems right out of the box. Right side of the screen has red dots that move in randoms directions. I called Samsung warranty and created a service request. A week later I got a call from service center that was 90 miles away. They were trying to diagnose problem over the phone because they couldn't send a tech to check it out because it's \"too far away\". So 3 days later they called me back to tell me that the part was ordered, so I asked what kind of part is it? They told me its an internal cable. That didn't make any sense to me, but I said ok. So 2 weeks later they showed up at my house to replace the cable and before the tech even took my tv apart he said that it's not going to solve the problem, it's just a cable!!! So he told me that the paned is bad and it needs to be replaced. He also said that that kind of problems occur on Samsungs all the time, so when my warranty expires I would have to pay it out of my pocket. He said that sometimes they would order a new panel from Samsung and it would come with a defect from factory. Now, apparently Samsung has no quality control and they use the cheapest parts they can find. At this point I hope they can fix my TV, if the second repair is going to be unsuccessful, they should give me a new TV. The reason why I didn't ship my TV back is because I threw the box away, and the tech told me that new TV from Samsung might have the same problem, if not now then in the future, maybe after my warranty expires, so the best thing to do is fix the existing problem now while its free.Samsung has the best picture out of al TV's out there, but they sell defective unit to people and do nothing about it. Samsung had same problems with their LCDs and LEDs for years and they keep manufacturing this crap without correcting they problems. Sony has no problems with parts, but their picture quality is not as good as Samsung. So decide...Update:Here is the transcript of my chat with tech support:Chat Information Please wait for a Samsung Agent to respond.Chat Information You are now chatting with 'Susana Y'Susana Y: Hi, thanks for reaching out to Samsung tech support. How can I help you today?Visitor: Hello, I have purchased a TV few week ago from samsung and I had issues with it(screen). I created a service request and they came by my hose to fix it today.Susana Y: Okay.Visitor: They replaced an internal cable, but it didn't solve the problem. The technician told me that the panel is bad and need to be replaced. Since the panel is the major and most expensive part of the TV and it only few weeks old, is samsung going to replace the TV? The problem occured from day 1.Susana Y: I'm sorry for the inconvenience.Susana Y: When did you get the unit serviced?Visitor: todaySusana Y: Did you file the online service request?Visitor: I did, few weeks ago(on 02/10/11).Susana Y: Okay.Susana Y: In this regard, please contact the service center to fix the issue.Visitor: I repeat the question: \"The technician told me that the panel is bad and need to be replaced. Since the panel is the major and most expensive part of the TV and it only few weeks old, is samsung going to replace the TV? The problem occured from day 1.\"Susana Y: I understand your concern.Susana Y: Please provide me with the model number of the TV.Visitor: UN46C7000WFXZASusana Y: Thank you.Susana Y: You can purchase the parts from J & J Parts.Visitor: Excuse me?Susana Y: Yes, please go ahead.Visitor: You can purchase the parts from J & J Parts.... what is that?Susana Y: I'm sorry, Samsung do not provide replacement for the panel.Visitor: It's under warranty.Susana Y: I can understand, however, there is no replacement for the panel.Visitor: ??? The TV is only few weeks old, its under warranty, and your repair guys said it needs a panel. How is it not covered? You sell defective TVs to people and then refuse to replace it??Susana Y: I can understand your requirement. However, replacement is not provided for the panel of the TV. If I have any other option to process request for the panel replacement I would have really helped you.Susana Y: I hope you understand my scope.Visitor: I hope you understand that samsung is going to see me in courtThen I had a chat with another agent and he told me it's covered under warranty.Aghhhhhhhhh.........", "Date": "February 24, 2011"}, {"Title": "Nothing's perfect, but this is about as good as it gets.", "Author": "RedzoneOS", "ReviewID": "R2PA0ZGS845DNX", "Overall": "5.0", "Content": "UN46C7000 review:When I started thinking about writing a review, I was planning on deducting .1 overall points for every minor flaw, and .5 points for every major flaw.  However, I realized rather quickly that my list would be too short to do it this way.  This TV is about as good as it gets if you're specifically looking for a 3d capable LED TV.PROS:Price:  I got this TV for an outrageous price about one week before black friday on a different website (buydig) for 1420.00 including tax, shipping, 3D starter kit, and samsung C6900 Blu-ray player (yes that's a \"6\" not a \"5\" which is the older model with no wi-fi).  TIP:  Shop around, these things go on sale all the time, if you pay 2K for this TV and then complain about it being too costly, it's your OWN fault, not the TV.Features:  Feel free to read the specs/description.  Needless to say this TV has essentially every feature any other LED TV has (save for wireless internet).  I don't really use any of the internet services as I have a PS3 attached to it but did download all the updates and tested out the various applications.  It's a bit slow at times (I have a really nice home build desktop PC so I'm spoiled), but everything works.  I wasn't a big fan of Youtube because too many videos look like crap but that's because of the videos and not a fault of this TV.  Speakers are actually a lot better on this TV then I assumed, the speakers actually sound better then both of my other TV's.Performance:  Very good, but based on ALL tv's and not just LED's I would rate this a 4/5. Compared only to other LED/LCD TV's, the samsung is amazing and easily warrants a perfect score (my friend has the 9000 series, and the difference is no where near worth the 3x cost even if you have the money to blow)... I have 2 other TV's. Samsung PN50B650 plasma TV, and a Panasonic Kuro.  The two plasma's have better picture quality, but it's negligible enough.  I bought the LED TV for my bedroom and wanted something more energy efficient then the 2 plasma's and this thing fits the bill beautifully.  Considering the bedroom TV will be used for gaming, frequent movie watching, and is attached to my computer I was willing to compromise picture quality for energy efficiency.  3D works MUCH better then I expected.  I only tried the movie it came with and the blu-ray 3D looks flawless, in fact it's a better experience then watching 3D at the theater.  2D to 3D conversion is fairly impressive, but the difference is only worthwhile when you're watching very \"scenic\" shows/movies.  Anything that has lack of depth is not worth watching (standard sitcoms etc aren't that great).CONS:Price:  starting price is a bit high (still well worth it for this TV), but as I said, this is NOT a con simply because if you're willing to shop around these TV's can be had for nearly half the price (including the free add-ons).Features:  This TV DOES have some screen uniformity issues in the corners.  noticeable white blotches anytime the screen is completely black.  Definitely NOT a deal breaker, but it is there if you're picky enough to care.  How often will your TV be completely black except when you're on the wrong input!!  Wish it had wi-fi, but it doesn't really matter because just about everything I own has wi-fi and all the same/similar apps.  Not a big fan of the stand, I much preferred the solid rectangle stand I received with my PN50B650, but all my TV's are wall mounted anyway, so doesn't matter.Performance:  Default settings aren't perfect.  search online and find the tweaks, take the time to tweak the colors, white balance, etc to improve this.  (note that this isn't a con either, As I said I have 2 other TV's and both of those require some tweaking as well)IMPORTANT NOTES:1.  A lot of the issues mentioned in some of the more popular reviews regarding 3D appear to have been resolved via firmware updates so I suggest you update as soon as you get your TV, and don't judge the TV based on reviews written 6 months ago!!!!!!  One reviewer mentioned backlight bleeding in a dark room, I have experienced no such issue.2.  If anyone is wondering how 2D to 3D adult videos look.  Well, lets just say it depends on the \"scenery\".  As I said earlier, scenes with no background depth (pun intended), are rather lack luster and don't warrant having to wear the 3D glasses.  However, scenes shot outdoors with significant distance between the primary subjects and the background are spectacular (note that this is true for any 2D to 3D conversion video, not just adult films!!)3.  Definitely turn off the Auto Motion Plus. I never really understood this feature until I bought this TV (since it's a non-issue with my plasmas)... It's really unnecessary and ruins the viewing experience except when watching sports like baseball and tennis.RECOMMENDATION:If you're looking specifically for a 3D LED TV, then this is it, shop around find the best deal and buy it.  NOWIf you're looking for 3D but want the best available picture quality possible regardless of other features, buy a plasma.  Honestly I would recommend a plasma for anyone where energy efficiency is not an issue.  Plasma's are better performers, have the same features, cheaper, and you can buy those in \"ultra slim\" as well.  Image burn is a NON-issue, I have had both of my plasmas for at least 12 months, and I have no signs of it (I have never run any of those anti-image-burn apps either)...If you don't care for 3D, then why are you even reading this?", "Date": "December 5, 2010"}, {"Title": "Worth buying.. will recommand", "Author": "Alpesh D Mehta", "ReviewID": "R2EFPQDEMY1WVC", "Overall": "3.0", "Content": "Pros :TV have lots of good things to offer which is worth spending money on this one. TV have been at his best when played different HD channels.Cons :  Entire selling guidelines did not mentioned that this TV is not Internet ready but its Internet Enabled. You have to buy Adapter to make it working or connect to internet. You have option of connecting to LAN cable and make it internet ready.", "Date": "April 9, 2011"}, {"Title": "Uh Oh", "Author": "Tom", "ReviewID": "R3558GRG079XAT", "Overall": "4.0", "Content": "Got this set a week ago, its the third Samsung LED in the house (but the first 3D).  Hung it on the wall, and immediately noticed a red line stretching from the top of the picture to the bottom, regardless of which input you use.  Obviously not pleased, but I understand these things can happen.  I've read the horror stories about Samsung customer service.  I just called to log my issue.  So far, so good.  Ignoring the red line for a moment, the picture quality is excellent.  The set is incredibly thin and light.  Assuming the outcome of the customer service experience is favorable, this rating will go up to 5.", "Date": "April 18, 2010"}, {"Title": "HDMI Port not working after 30 days - Amazon replaced the TV", "Author": "Samsudin B. Kamis \"sambog\"", "ReviewID": "R1BJ9DIE4FSQTL", "Overall": "3.0", "Content": "I bought the UN46C7000 back in January 11 during the great promotions with FREE Blue Ray DVD player and 2 pair of 3D glasses. The delivery is good and we are happy with our first LCD-LED TV but that joy ended yesterday. I told myself to give 2-3 months before I write a review but I was very disappointed with the purchase. Let me share what I like about the product.- Excellent TV design and looks very beautiful externally- It was an easy to setup and picture quality for HD looks awesome with DirectTV HD and Blue Ray DVD- The 3D movie Shrek was amazing and we enjoyed it very much.- The Internet setup was easy but disappointed that it does not have Amazon movie, we watch Netflix movies almost every day- I wish they come with Wifi Built in but that is small matterHere come the sad news- After almost 30 days, the HDMI port stop working. We have DirectTV and Samsung Blue Ray player connected via HDMI and the TV keep saying \"no signal\" when we change source- I try changing to different HDMI port and it still does not work. I have a spare HDMI cable and it still does not work- We tried RGB and Component cable with DirectTV and it works, so I am sure that the HDMI port fried up.- Called Samsung and they open a service request. A technician called and they need to order a new mother board for the HDMI port and will take 5-7 days.- We are using the RGC cable now to watch TV from DirectTV and quality sucks. (not HDMI)- I did all my research online and even tried a Master Reset but still no luck(Press Exit when power ON) but it still does not work.- I hate to have a new TV with faulty parts. It's like you have new 1 month car and they have to replace the axle or transmission.- I contacted Amazon asking for replacement of TV but have not received any response.This is our first Samsung TV and I very disappointed with the product reliability. I should have pay more for Sony or other brand but you get what you pay. I hope that it was some setting and not major hardware replacement. I will update my review once the TV has been fixed (I hope).\\Updates (3/7/2011)- Amazon never failed to impress me with great customer service. They replaced the TV as promised last week and all HDMI ports is now working.What a difference with HD quality thry HDMI cable.- Everything is good but I was not impressed with the delivery company. They did not help me installed the stand for the TV. The first time I received the TV, the guys help me out since I was all alone at home.- If you bought from Amazon or any dealer. I recommend you buy the extended warranty after what I have been thru.- Amazon send a USB disk drive with the Firmware Updates but it does not work so I connect the TV online to Samsung to update a new firmware. I hope the HDMI will work longer this time and not just for 30 days.- The new Amazon Streaming video is a good addition to Netflix but they have limited collection. You can find Amazon video under yahoo! Widgets and not under Samsung App. Here is the instruction[..]", "Date": "February 16, 2011"}, {"Title": "*****Amazon Shipping of this product*****", "Author": "jeff goldston", "ReviewID": "RI63M3WAMN4KI", "Overall": "5.0", "Content": "Very disappointed in Amazon's follow thru on expensive, large purchase orders and the shipping of this item.  I have purchased this item on a Sat Jan 16th. Jan 20th i am getting excited about the TV being delivered soon and check the tracking of this product when i see \"Carrier unable to contact recipient to arrange delivery. Please contact Amazon.com - Jan 18, 2011 4:18:00 PM\". After checking the shipment info under tracking and calling the service department i have found that Amazon did not give my contact info to the delivery service. I have not been contacted since the update on the tracking package section 2 days later. I had to contact Amazon, who then contacted the delivery service to schedule a delivery. Now the delivery service will not be making my delivery until a week and a half after purchasing the product and well beyond the \"estimated date of delivery\" (by Jan 24th) per Amazon.com. I have received a confirmation that i will receive the item on Jan 29th. To me this is poor customer service and Amazon's fault for not following up with the delivery service to give contact info so they are able to schedule the delivery. This is a very big purchase, not cheap on either and Amazon should make sure the delivery is handled properly even after they have received payment.  I am very disappointed in the follow thru from Amazon.  When purchasing large items from Amazon.com BE VERY WEARY OF SHIPPING, EXPECT 2 WEEKS OR MORE.  MAKE SURE YOU CHECK BECAUSE AMAZON HAS YOUR MONEY AND WILL NOT MAKE THE EXTRA EFFORT TO VERIFY THE DELIVERY COMPANY HAS YOUR CONTACT INFO OR CONTACT YOU ONCE NOTICE OF PROBLEM!!!!!", "Date": "January 19, 2011"}, {"Title": "Just some additional thoughts on this tv", "Author": "D. Mantelli \"I am part of the Amazon Tribe kn...", "ReviewID": "R1I09GR8JOGN8U", "Overall": "3.0", "Content": "I really like this TV but it could use some improvement. One reviewer said \"severe backlight bleed\", I notice it sometimes. However, I am not a videophile so maybe thats my problem, so the average consumer will probably not even notice it. I also wish it was easier to switch over to the Game Mode, they should have it right on the remote. I used to have a Plasma TV and it seems that my electricity bill has gone down slightly with this new TV. About those Internet Apps Meh!  I am also sad to report that the TV  now turns off and back on by itself every few hours. It appears there may be a problem with the capacitors that Samsung has been using. The problem seems to occur in many Samsung models. I will update my review after I get the TV servicesSo, I filled out an online form on the Samsung Support site and a a repairman was out a few days latter and replaced what look like a motherboard and voila, problem fixed.", "Date": "December 10, 2010"}, {"Title": "Excellent LED TV; excellent value", "Author": "Jeff \"Jeff\"", "ReviewID": "R24YW6MID5JE1V", "Overall": "5.0", "Content": "Purchased this with the deal where you got the BD Blu Ray player and 3-D starter kit for free.  Assuming the bluray is worth $300, I got this TV for $1480.  This is excellent quality.  The directTV installer told me after viewing the set this is the clearest HD tv he's ever seen, and this is all he does.  The colors are phenomenal-- so vivid.  We watched the earth wonders series and everyone was floored at the clear, crisp, and vibrant colors.  The 3-D is great, too.  We used the built in 3-D up converter to convert a 2d channel to quasi-3-D.  This worked great, albeit not as good as something originally shot and aired in 3-D.  The sound is good, but not surround sound, but then again you didn't get surround sound with this.  I like how the TV integrates with the network, other PCs on the home network, and communicates with the BD player.  Considering there are other LED Tvs for sale for a higher price -- without 3-D -- the 3D makes this an excellent value, especially when the BD player and glasses are thrown in.  The front door service was also great.  Highly recommend.  Highly, highly.", "Date": "August 2, 2010"}, {"Title": "Buy it for the picture quality, and get 3D as a bonus", "Author": "isteal", "ReviewID": "R18DZ3JZIIQEPO", "Overall": "5.0", "Content": "I have had my tv for 1 week now, and have no complaints with this product.  I upraded from a Sony rear projection, and the difference is incredible.  I did LOTS of research and waffling before finally settling on this TV.  I was debating between the Sony XBR9, Samsung UN46C6500 and the UN46C7000.  I finally settled on this set because of the brightness, picture quality and a bit of future-proofing with the 3D feature.  I have read several reviews saying that the sound is poor, which is maybe going too far.  The sound is better than you SHOULD expect from a TV this thin.  And honestly, most people buying a $2K+ tv are using a home theater of some sort anyway.  Buy this TV for picture clarity and quality.  The blacks are very \"inky\" and the whites are ultra-white.  There are lots of audio and video adjustments on the TV allowing you to fine tune if you want to.  The remote seems very high quality also.  Brushed stainless look with backlighting is as aestetically pleasing as any remote I have seen.  As others have noted, dont plan on using the wifi adaptor (sold seperate) with an Apple Airport router, but the wired ethernet works fine for the apps and widgets, which work well.  I would rate the 3D higher, but there is almost no content available at this time.  There is only 1 movie available at retail, and less than 5 currently slated for release this year.  To make matters worse, the various 3D manufacturers are trying to get exclusive bundle rights to the few movies that are rumored for release (panasonic and Avatar, Sony and Alice and Wonderland, etc).  I would definately reccomend this to a friend, and have enjoyed the 3D movies that I have watched (Monsters vs Aliens & Cloudy with a Chance of Meatballs).  Go for it!", "Date": "July 24, 2010"}, {"Title": "Great picture, great apps, slight backlighting bleed on black", "Author": "Martin Babb", "ReviewID": "RVFYT7NYYYTY0", "Overall": "4.0", "Content": "Great product: excellent picture quality (in HD), great design, great apps (LOVE the Netflix app- quality is unsurpassed) and great remote. Only complaint really is that unless the black level is set so low that the tv is unviewable during the day, there is somewhat significant backlight bleedthrough on large black areas- and not only at the corners or edges. On black title screens there is an odd mottled effect from the uneven blockage of backlighting.Other than this one problem, which I understand is corrected somehow in the current 8000 series, I couldn't be happier with my purhchase.", "Date": "May 10, 2010"}, {"Title": "Stay away if you watch tv in a dark room", "Author": "Christopher M. Jewell", "ReviewID": "R39JX90FRJ5J7B", "Overall": "1.0", "Content": "The severe backlight bleed from the new line of Samsung LED tvs is unacceptable. Do a search for backlight bleed or flashlighting with the new samsungs. Very common and after noticing it, it's all I see. I'm going to return it...it's a great tv otherwise, but this is a deal breaker. I honestly can't believe they would try to sell something with such a huge flaw. I've lost faith in Samsung and this will be the last product I buy with their name on it.", "Date": "November 19, 2010"}, {"Title": "Very Nice 3D LED tv", "Author": "John Gonzalez \"Bulletstorm\"", "ReviewID": "R10466LM0YUR97", "Overall": "5.0", "Content": "Ok, so I plunged my 1 year's savings on this 3D LED from Samsung and I do have to say it looks amazing. The picture has tons of settings for your liking. It still lags on gaming if you dont have the Game Mode turned on for those who like to play on their PS3,Xbox 360. I didnt see much difference in picture with the 240hrz compared to my 120hrz I have in the bedroom. I guess it is what it is. The bezel is about an inch thick all around and the depth is ultra slim (about an inch also). There is a nice chrome trim around the bezel with more of it on the bottom of the tv making it look very nice. The screen is not matte, more of a shiny one which will display backround light and could be a bit distracting to viewers. Sitting 20 degrees or more to either side of the tv will make the picture suffer a bit. There is definitely backlight bleed around the corners of the screen when dark scenes are displayed, and a tiny bit of clouding for those who really are picky. I knew these issues were present before I bought the tv, so I dont mind them much, but they are there. I guess is the LED edge lit systems that causes it. For the price they sell now, its definitely not a bad tv to get.", "Date": "October 25, 2011"}, {"Title": "Awesome Picture, great TV", "Author": "AF Pilot", "ReviewID": "R3TB50LFG6YZSQ", "Overall": "4.0", "Content": "The picture quality on this TV is incredible.  The color response that the LED brings is better than any Plasma or LCD that I compared this TV to.  The full 240 hz is a plus as well.  It gives the picture an ultra-realistic feel, almost as though you're looking through a window.  The 240 hz, does however, give you the \"soap opera\" effect.  The settings menu will allow you to adjust the \"Auto Motion Plus\" to minimize this effect.The 3D looks ok, but the glasses are expensive, and I barely use it.  Watching a football game in 3D is cool, but mostly gimmicky.  It makes everything appear to have depth, but the players by no means appear to be in my living room.  The best description I can give is that it's like watching the game in a diarama.The internet apps are ok as well.  I've got AT&T; DSL with a 3 MBPS connection.  The Netflix app looks good, except that it takes a few minutes to buffer so that you get a smooth and uninterupted picture.  I've had better results using my PS3 to watch Netflix.Pros: Outstanding picture quality.  The color response and 240 hz refresh rate are incredible.  The TV itself looks good, it's fairly light and VERY thin.  Wall mounting it is pretty easy. 4 HDMIs, a VGA, component, and AV connector are really nice.  There are also 2 USB ports and an ethernet in to use the internet.  The remote is nice and easy to use without being overly cluttered.  The iPhone remote app is nice as well.Cons: The streaming apps could be smoother, but this may be a function of my internet connection vs the TV.  There are a multitude of settings to make the picture look really great, but they can be overwhelming.  The 3D is gimmicky at best.Overall, I love my Samsung and highly recommend it!", "Date": "June 13, 2011"}, {"Title": "Great tv BUT...", "Author": "lala", "ReviewID": "R1RKU1OEMC37X5", "Overall": "3.0", "Content": "within 6 months of owning the brand new, out of the box tv...it needed to be serviced already because the sensor for the remote, located on the tv, suddenly malfunctioned.  so no remote.  to drive in the disappointment, i can't access the apps that allow me to watch tv shows and movies on netflix, pandora etc. all the buttons that need to be pressed to access the internet@tv feature are on the remote.  booooo.", "Date": "May 14, 2011"}, {"Title": "Great TV", "Author": "Suzanne Iselt", "ReviewID": "R2I9YJWGIYK4D0", "Overall": "5.0", "Content": "I really love this TV, but follow the advice of the other reviewers regarding turning off the auto motion plus.  It took me weeks to figure that out, and it bugged me until I fixed it.  Other than that, it's a fab TV.", "Date": "April 28, 2011"}, {"Title": "Amazing!- Updated 01 FEB 11", "Author": "Jm Lawlor", "ReviewID": "R802KN7TFB0OG", "Overall": "5.0", "Content": "I bought this TV as a Christmas present to myself. My rear projection Sony LED lasted about 8 years and I paid almost twice as much for that TV as I did for this one. Obviously,  technology has changed a lot since my last TV purchase.I am amazed by this TV. Putting the 3D feature to the side a minute, just as a regular HD TV this is a great purchase! The picture is life like and the colors are deep and rich. The settings are very easy to use and understand. The remote has the option of back lighting and can be turned on or off. Great feature. Having a \"Tools\" button on the remote allows for getting right to where you want to go to change the brightness of the show you are watching to the perfect spot for a movie, live sports or just plain old TV shows.The assembly is quite easy, did it myself in less than 10 minutes. (The stand requires 4 screws). Internet features are new to me on TV and I haven't really played with them much yet other than Netflix. I also have a TIVO Premiere XL and Netflix is much easier to use on the TV than on the Tivo.Now for the 3D. This is a really cool effect and again, there is a 3D button on the remote for easy upgrading from 2D to 3d. I was curious about switching a regular show to 3D and was impressed with the outcome. Unfortunately, 3D effects are not really included in 2d TV productions, so while there is a difference in the picture, there really isn't a point to switching it over. It is fun to play with the feature on different things though and as the technology improves and catches on, I'm sure this will be something that will start changing. The 3D Movies are great and it is like sitting in the same room with the characters you are watching.Overall, I am quite pleased with this purchase. I have read some things about white spots, but have not seen anything like that. I guess the updates have fixed that issue.Update-So I have read and followed a couple of the reviews recommended that you turn off Automation Plus picture enhancement. I did that when I first got the TV. I have also been playing with that feature on various shows. I have discovered that that feature is great. If you turn it off, do so on older HD programs & non HD programs. If you turn that feature on with those, the picture is somewhat better, but \"choppy\". Watching up to date HD is something you want to use this feature for. As a friend said, it is the difference between watching a TV show and watching the program thru a window. I personally like the feature now that I know when the best time it is to use it. Outdoor scenes are especially breath taking and up to date HD w/ the automation plus setting, gives the 2D to 3D enhancement much nicer. I hope you find this useful! Enjoy!", "Date": "January 6, 2011"}, {"Title": "The BEST 3D HDTV / Definite Buy / A Wonderful TV!!!!", "Author": "Alvaro Munoz \"MUAR\"", "ReviewID": "R3OPA93BJTCVZ3", "Overall": "5.0", "Content": "I spent a lot of time looking for my new HDTV. I decided for this 3D HDTV because it offers a lot of useful features.Le'ts see:PRO:- Convert any source from 2D to 3D. It's rock !- 4 HDMI and 2 USB ports!!- Up to 240 Hz- DLNA, Apps, and Yahoo Gadgets - Amazing!!- Support to Skype -- I'll get the camera during Holiday Season- LED Technology, green product!!!- Excellent picture, better than other Plasma and LED LCD TVs that I tested- Easy and friendly GUI- Nice Remote Controller included, with backlight support.- Excellent 3D picture, amazing !!- Auto-upscale to 1080p!! Improve all my sources!!- Sound works nice, excellent SRS function- Try one of the two Professional Calibrations:(Good decision!)|---> TweakTV => [...]|---> LCDTVBuyingGuide => [...](it is about the 55\" model, but it work for any C7000 model)CONS:- The Media Servers from Samsung, PC Share Manager, requires to much RAM memory and the DB is slow. I installed \"TVMOBiLi\", it is better. Poor support for that application.- Do not support third party options, like USB Keyboard and USB Webcam.- PIP only works with \"Antenna/Cable\" plus any other sources (except DLNA sources).- Expensive Skype Camera (however, it is a must to have)- For the price of the HDTV, Samsung should included a better remote control with keyboard, like the Samsung RMC30C2.\"Pros:Built-in speakers, Bright display, Durable, Realistic color, Lightweight, upscaling to 1080p, convert 2d to 3dCons:poor remote controller, do not support 3d party options like keybaord", "Date": "September 22, 2010"}, {"Title": "Pleasantly amazed", "Author": "Dennis R. Mcnicholas", "ReviewID": "RETBASWCEUZ5H", "Overall": "5.0", "Content": "This is an amazing TV.  The picture really comes out at you when watching 3D.  It automatically switches to 3D mode when a 3D movie is in the 3D player.  I am REALLY looking forward to more  movies coming out in this 3D format.  You have to consider, if you're thinking of buying a 3D TV and Blu Ray player, that the \"3D\" movies that are on the market and use the red/blue lensed glasses are different and you won't get the true \"3D\" experience that you get with the actual 3D IMAX type glasses.  Granted, the red/blue lensed 3D movies still look GREAT on this TV, the new 3D technology is AWSOME!!!  I really hope that Avatar will be released in this format.", "Date": "September 20, 2010"}, {"Title": "Samsung 3D TV UN46C7000", "Author": "T. Walton \"Jake\"", "ReviewID": "RH0C7UAS092O2", "Overall": "5.0", "Content": "Love this Samsung 3D TV. Great features. Very good price. Product is just as advertized. Picture and sound are great. Plenty of input and output ports. Connect to PS3 and your computer for even more 3D access.", "Date": "July 31, 2010"}, {"Title": "Samsung LED Continues Dominance", "Author": "Rob66", "ReviewID": "R12NQK5F5ZZQQC", "Overall": "5.0", "Content": "Many people who purchase a Samsung system are frustrated with their 3D experience. They often say that when they watch Monsters vs. Aliens the 3D experience is underwhelming.  I initially was one of these users.  I watched the movie on my new UN46C7000, C6900 3D Blu-Ray, and the 3D starter kit.  I saw little of the blurring others reviewers mentioned but I did see some (mostly in the background of heavily detailed scenes).  It never seemed to \"pop\" off the screen.  I got the package on promo for 1700.00 so it was actually cheaper than last years model without 3D.  I wouldn't have complained but I felt like I just got last years model with a \"gimick\".My review at this point would have been 2-3 stars overall.  Few 3D titles, great TV, and decent 3D experience.  However, this last weekend I purchase Cloudy with a Chance of Meatballs and let me tell you, if future 3D Blu-Rays are this \"wow\" I'm sold.  The depth, color, clarity, and 3D effect were unbelievable.  I would say the 3D experience is a 5 star experience now.  No wonder Sony TV's are getting better 3D reviews.The TV itself is well constructed.  It is out of the box ready with simple to advanced user tweeking available.  I really felt like the 3D part of the TV was an bonus and not a selling point.  The longer I have the TV and the more I watch sports (translated into 3D from 2D) and the more 3D Blu-Rays I see I think it is the driving force of the TV.Pros: Samsung quality, size and dimensions of the TV (1.1\" thick), gives a great 3D effect from 2D content (both from DVDs and cable), great and simple to use remote, simple setup, nice finish to TV \"case\", & contrast ratio very high.Cons: Need very expensive 1.4 HDMI cable to pipe 3D Blu-Rays to TV, Left out auto dimming on the 7000 seriers, Little can be done but while watching 3D viewer has to be sitting up (no laying down but hey, u can't do that in a theatre either), very few 3D titles, slight headache after watching 2+ hours of 3D (my limit seems to be 1 movie), & reviewers who are making judgements too early on the 3D experience.", "Date": "July 29, 2010"}, {"Title": "Nice Tube", "Author": "Ubiq", "ReviewID": "R1941MS94VWHF6", "Overall": "4.0", "Content": "Just had this for a few days now and my 3D exposure has been limited to the Monsters vs. Aliens Blu-ray that ships with the companion player. The 3D experience is every bit as good as, say, Avatar in theaters, in my opinion, particularly if you can arrange to view the screen from the optimal distance.  I actually ducked in one scene where objects appeared to be hurtling toward me. Given that it is a TV and that it takes up a fair amount of living room real estate, it is not unattractive hanging from the wall. Samsung has done a good job with connections and while the audio is not up to a decent 7.1 setup, it is surprisingly good for what is essentially a single point source.  Samsung app and widget functions are pretty speedy and intuitive in the 2010 offerings. The remote is well planned and slick looking. My only gripe has nothing to do with this particular implementation of the technology, but rather with HD content generally; it all looks like studio TV. Whether you're streaming an HD movie or running a DVD, HD presentation loses some of that analog glitz that we've come to associate with the cinematic experience. It all looks like it was shot on a soap opera set. The detail of high-def somehow flattens out the picture (except with 3D, of course).  So I wont be renting any HD content.  I find that I prefer the look of standard def.  It's probably just some weird idiosyncratic thing. That said, this is a sweet gizmo with a little bit of future proofing built in.", "Date": "June 24, 2010"}, {"Title": "Do not buy this", "Author": "VG Purist", "ReviewID": "R2V4LW4Y6SD0DE", "Overall": "1.0", "Content": "I actually bought this TV at Best buy.  The first one of this model, the TV had developed this bright light near the power button and had a horizontal \"pillaring\" line effect going down the screen.  I returned that one since it was within the 2 week return period.  I received the replacement one and the SAME THING started happening. Only it was on the top right side with the aforementioned \"pillaring\" effect.  I called Samsung warranty repair center and they seemed to know what I was talking about as they put in an order for another TV panel and whatever else they needed. However, since that time I had to wait another two weeks before I heard anything about my repair work.  I had to call them!!  Finally they said that they would try to get in touch with the technician near me.  After all of this time... I am still waiting.  I am hoping that this review will deter others from getting this flop and save them the same headaches as I have had over this.", "Date": "April 17, 2012"}, {"Title": "Truly Amazing", "Author": "Saurabh Raisinghani \"saurabhrais\"", "ReviewID": "RVZJL5QCOXMC", "Overall": "5.0", "Content": "There are few products that you cherish about whenever you use them, this is one of those. Both me and my wife loved the TV. The picture quality is just mesmerizing. We dont watch too much of 3D, but 3D quality was pretty good too. Overall we loved the TV.", "Date": "June 11, 2011"}, {"Title": "Outstanding", "Author": "LazyMoose", "ReviewID": "RRLBEI6BZ0Y42", "Overall": "5.0", "Content": "I have always avoided LCD TVs in the past, favoring the quality of plasmas.  That changed with this TV.  The picture quality is simply amazing.  Movies, sports (Go Mavs!), PS3 gaming... it's all enjoyable on this tv.The 3d is better than I expected.  We watched 2 imax movies and enjoyed them.  There were a few brief spots where the glasses shut off for a second or two, not sure if that is a flaw with the glasses, the movie, or the tv, but it was infrequent (I think it happened to each of us once or twice during each 40 minute movie.)The menus are easy and intuitive, so adjusting the settings is a breeze.I can't comment on the sound quality because it has been hooked up to a surround sound system right from the beginning.I did not experience any of the quality issues that some others have posted about.  Everything worked flawlessly from the beginning.The only flaw I've noticed with is that when the screen is completely black there is a lot of light noticeable at the corners, but this problem does not appear if there is anything but a solid black screen.  I don't see it during movies or tv shows, even in very dark scenes.I guess the best endorsement I can give this tv is that after watching it for two weeks, if I was given the opportunity to go back and redo my purchase I would buy the same tv again.  No regrets at all.", "Date": "May 25, 2011"}, {"Title": "Great TV for cable, DVDs, Blu-Ray & 3-D", "Author": "J Luke", "ReviewID": "R3CS42C5DSNCEN", "Overall": "5.0", "Content": "This TV is insane!  I love how light it is; the 240hz should be the minimum standard because the picture looks as if you're looking out the window it's so real.  The only issue I have is with black spots on the TV with dark scenes you can see the pixels working.  It's not a big deal to me, but you'll see that's a huge negative for most people.  I love the TV regardless.  The only REAL issue I have is that there's Internet for the TV and, I don't know if it's not hooked up right or what, it doesn't work.I love this TV and it's the best TV I've ever had.  The 3-D is incredible!  The glasses are easy to use and Shrek 3-D is amazing!  It really makes you feel like a kid again!I LOVE IT!  I bought it on Black Friday with the 3-D Kit & all 4 Shrek movies included!  It's awesome!", "Date": "May 19, 2011"}, {"Title": "Best TV ever", "Author": "Nate", "ReviewID": "R3BN2TFMMTCA5F", "Overall": "5.0", "Content": "I recently bought this tv to replace an older one in the house.  I am extremely happy with all aspects of it.  I don't know why some people don't like the \"soap opera\" look when viewing it with the auto motion plus enabled.  I think it gives TV shows/movies a more realistic look and feel than standard viewing.  I tested the sound before hooking it up to my receiver and it was really good too.  I have yet to try the 3D part but might in the future.  2 thumbs up from me  :D", "Date": "April 1, 2011"}, {"Title": "Best TV for great price", "Author": "Wakkas, Seattle, WA", "ReviewID": "ROBD1CT5I7S2H", "Overall": "5.0", "Content": "I bought this TV from amazon for its great price. I did not buy a new one but a used one from amazon warehouse and knew that the set will have couple of scratches at the back. But bought it for 300$ less than the new one. Got the TV in time and was amazed by its thinness. It had one scratch at the back which is not noticable and never visible. had some screws missing for the stand but i had some with same size.Set the thing up and its been amazing experience. Love the Auto Motion feature for supports but have it turned off otherwise. Great picture quality. Amazon gave the best price for this TV and had 30 day return policy on used TVs as well. so thought i check if its a fair unit and save some bucks and its been amazing.", "Date": "March 22, 2011"}, {"Title": "Great TV", "Author": "Noel W.", "ReviewID": "RGZARY52LRQE8", "Overall": "5.0", "Content": "Been watching this TV for a month now and the picture quality is great. Can't comment on speaker quality, I am using it with my Onkyo 7.2 surround system and keep the TV speakers off. Would be nice if the remote would control multiple devices. Best TV I ever owned.", "Date": "March 6, 2011"}, {"Title": "The Cat's Meow", "Author": "Dale Dellinger", "ReviewID": "R2931UJVOZ0WSY", "Overall": "5.0", "Content": "The picture and sound quality on this TV is stunning and the colors are very realistic.  I'll just give a short anecdote that summarizes our experience : The other day, we were watching the movie \"Babies\" (from Netflix) and there was a cat meow in the movie and our cat, who normally never notices the TV, suddenly went and sat right in front of the TV and was intently watching every movement and listening for every sound for a long time.  There was more meowing and he got up on the table and walked around to the back to see where the cats were!  Okay, cats can be fooled, but it was still pretty cool.This TV has Internet \"Apps\" which are useful little programs for accessing the Internet -- but none can be used as a real browser and don't think \"Apps\" like in iPhone Apps, there's not very many (although the number has grown quite a bit since we've had the TV).  You start out with a set of Samsung Apps, and you can download more through the TV, but you can't delete them and Samsung has chosen 5 \"recommended\" ones that are always at the top.  One frustrating thing for me is that when you go into the apps section, if any one of my apps need updating, I am forced to download it right now even if I'm not launching the one that needs updating.  Samsung, this model doesn't scale well to large sets of apps, so let us know about updates but don't always require download it right away.  We have been using the Netflix app to watch movies and aside from some pausing and reloading, it is clear and easy to use.  Also, the Netflix app doesn't  let you add movies to your watch list -- I had to use my computer or pod touch to add movies to the list.  I should mention that in order to use Internet apps you need access to the Internet -- I use a wired network connection to my router.The TV can view photos and movies from a USB drive, but the interface is a bit clunky and limited in the file formats.  You can view JPG files but not PNG.  The movies were trickier -- it wouldn't play slideshow movies made directly from iPhoto (m4v format) -- had to convert them to something else (I used mp4 format) before they would play.Samsung offers a neat free iPhone app called \"TV Remote\" on iTunes that works as a remote control.  Doesn't do too much more than the regular remote, but you can use the keyboard enter any text into these apps (e.g. facebook, picasa password, etc), which is MUCH easier than using the arrow-select-arrow-select method spelling provided by the regular remote.  To use it, the TV and the iPhone or iOS device both have to be on the same local network.These points are small quirks.  We enjoy the TV and its bright, clear picture, and with the Samsung Apps, there's a hope that new features will be added as new Apps are offered.UPDATE (Jan 23, 2011):  The Netflix App was just updated with an all-new interface that now allows browsing and searching for new titles within the app.  The interface is easy to use with the Samsung remote and seems much better for streaming video without the long pauses to reload that we saw before.  I also downloaded a new version of firmware for the TV itself.  I think that's the third one I've downloaded so they seem to be updating fairly regularly.UPDATE (Jan 29, 2011):  Enough is enough!  The cat is really getting into the TV to the point of being annoying.  We watched a wildlife documentary last night (Wild China, BBC via Netflix) and the cat was very interested and jumped up on our entertainment center and blocked our view of the TV until we got him down.  He really thinks there's some animals inside this TV.  Good thing they don't make 3D glasses for cats -- then we'd *really* be in trouble!", "Date": "January 16, 2011"}, {"Title": "Samsung LED 3D tv", "Author": "D. Short", "ReviewID": "R2ASDGHU9Q3EGC", "Overall": "5.0", "Content": "Wow!  Absolutely the best picture.  Everyone that see's this TV is amazed.  It looks like people are actually behind the screen in some situations.There is still a very limited availability of 3D movies and TV shows which is really disappointing, so the few things I have watched are pretty cool.  2D to 3D doesn't really do much.  The \"required\" 3D glasses are an inconvenience and WAY too expensive, but I figure I'll have obsolete technology before prices come down on these.  The sound is o.k. but must be hooked up to another source like home theater or amplifier to do the picture justice with the sound.  I'm not an internet freak, so the internet apps are something I will have to learn how to use, especially if it had a friendlier way to control it than on-screen commands with the remote.  I also got the Samsung BD-C6900 3D blu ray disc player, which matches beautifully with the TV. This comes standard with the internet Link, so don't buy the Link Stick seperately if you get this blu ray player with the TV.  All and all I am very happy with the TV, and I hope to be happier with the 3D when it actually becomes fully available in the future.  (Purchased 4/10)", "Date": "December 31, 2010"}, {"Title": "Excellent Plasma Experience", "Author": "Jeff H.", "ReviewID": "R3M1POEULKYT6L", "Overall": "5.0", "Content": "Excellent picture and 3D experience is quite stunning.  Pre-holiday sale included free Blue Ray and 2 pair of 3D glasses.  Note that the 3D glasses use a CR type watch battery.  They're inexpensive to buy in 10 packs on Amazon or E-bay.  Sound is adequate but additional speaker bar or surround system makes a huge difference.  You must buy a proprietary wireless connector for the television to use the internet features.  Also, the tv includes no HDMI cables.  Again, inexpensive, quality cables can be purchased ahead of time via the net.  Don't buy the cables from local retailers.  On the net they can be bought for well $8.00 each versus $36 even at Walmart.", "Date": "December 31, 2010"}, {"Title": "Excellent TV!", "Author": "DerekFE", "ReviewID": "R3T9R2MZRA2ACO", "Overall": "5.0", "Content": "The Good:  Amazing picture quality - like nothing I've ever owned before.  I did a fair amount of research and came to the conclusion that Samsung LED products are the best.  This is my first LED TV - or flat panel TV of any kind - so I may not be the best indicator of quality versus the competition and other models.  Nevertheless, I'm quite pleased.  Keep in mind most cable(channels do not broadcast in 1080p/240 htz....most will broadcast in 720p/60 htz on HD channels.  You won't see the full effect of the TV's picture quality until you put in a blu-ray disc.The Bad:  Internet capabilities seem to be somewhat limited.  I haven't tried the Netflix streaming or even Pandora but there aren't that many \"apps\".  I do not have a computer hooked up to the TV either.  However I don't really care too much about the \"Internet TV\" part of this package.  I also don't care too much about 3D TV - it'll be a nice feature to have and it didn't cost too much more to have it.  Keep in mind there is very little 3D content out there so don't get too excited about purchasing a 3D TV.Overall, if you are looking for an amazing picture - which is all I really care about - then this is an excellent purchase and shold be good for years to come when more content is available and cable/satellite providers are able to broadcast more channels at higher levels (1080p/120 htz - etc.).", "Date": "December 29, 2010"}, {"Title": "Im in love wiith this tv", "Author": "L. Valdez \"Luis\"", "ReviewID": "R2410ILZS43832", "Overall": "4.0", "Content": "Finally I had the guts to buy a new tv. I was going to wait until next year but i couldn't stop myself when I saw the deal at 1am. Its a great tv. I bought it for the 240 refresh rate and the online applications and so far those are the best features on the tv. Blu Ray movies look great and its I like to use the pandora and netflix apps on the tv.The only thing that is so so about this tv is the 3d, is not bad but i believe 3d just hasnt develop completely yet. I checked a panasonic and a sony tv at best buy and I tried their 3d and it looks the same.3d is good for blu ray movies, ESPN 3d which I love is just not there. the fast live action is hard to put it on a 3d format so I seen some lines, double images on that channel. But Im sure as time goes it will only get better. still nothing better than watching NBA and college sport games on 3d. it gives you a court side feeling of the game.", "Date": "December 27, 2010"}, {"Title": "Samsung's better range product", "Author": "HL \"Laughter brings happiness\"", "ReviewID": "R8YWLP6LE5GVI", "Overall": "5.0", "Content": "I was told that this TV has been out for about a year  back in Korea. 3D channels are available for sports fans in Korea and their prices are quite competitive to regular ones of the same picture quality.I have purchased this TV, spending a little more now, hoping that the TV will last for a decade. Paid $2000 with a free promotional 250gb external HDD to be used as Tivo and a usb stick that transfers your home wi-fi that will connect you to Samsung's sites that show some converted Youtube and other internet features all on TV. An additional webcam the company sells will allow me to have skype. But I already have two laptops while watching TV in the same room. Technology is all there to be explored, at least.There are handful of 3D signal contents in US, and Korean Cable TV channels. I have no intention to buy 3D blue-ray player yet, hence no other tests but the TV only.The contents I watched is quite good, but, not as 3 dimensional as IMAX 3D movies. But, it does convert any TV signals into 3d and if you can endure a bit of crossed-eye sickness initially, you will enjoy most of images in 3D(with the front figures and far background)The sound is quite crisp and I never had to increase sound volume to 25% at any time. And, no dull bass sound.I am surprised that they are not in stock in USA since the end of November. But this has been a popular feature in Korea as people get digit satellite 3Ds now and then from their cable subscription, and some of US Comcast. And, their price has hit the bottom. The other LCD/LED  TV without 3D is $500 cheaper. They all come with wide viewing angles, sold color with right brightness, and sound. 240HZ/480zHz are definitely better choices.The 3D glasses with rechargeable batteries, after clicking a few times of your remote conrol, and its red wine accent, and green power LED lamp,You will hear a buzzing sound then 3D show starts in true senses. It is not like using the plastic 3D disposable ones we used, for Avatar.They are slightly big but very comfortable when worn. Two sets come with TV and I was told it is about $120 per each extra, but I think the price should come down a lot so that more than 2 people can enjoy the 3D programs at once, especially when the screen size is 46 and 55.The only thing I don't like about this TV is the actual metal chrome stand. Just cheaply made looking like an aluminum forged handcraft-dull sheen.In Korea, the stand come with a motorized version with extra $150-200, that swivel the entire TV to your viewing angles. The same features are available in 4 different wall-bracket versions. I am sure all 6 options will be available in USA.Overall rating for me, is almost 5. definitely higher than 4.5 ;) And, I hope this becomes more of the standard for any Samsung products from now on.", "Date": "December 20, 2010"}, {"Title": "A nice TV with internet viewing", "Author": "Ravi Chandra Reddi", "ReviewID": "R1RTVMDN6VCAOB", "Overall": "4.0", "Content": "I bought this for a friend. Everyone who has seen it likes it.Pro: It has a great picture, good viewing angle allowance, good sound (we don't have a home theater system), and the easy access to netflix/etc built into the TV has been great. The stand is also nice.Con: 1) I tried this TV's 3D feature at Best Buy with a Blue-Ray player and it is far too choppy for me to ever watch. DON'T buy for 3D...at least not yet.  2) To connect to a wireless network, you MUST buy the Samsung Wireless Network Adapter, at around $65. Its annoying and blatant profiteering. A generic adapter costs almost nothing.  3) The internet setup was a bit time consuming, and sometimes won't accept input (as when it is updating - which it only does when one wants to watch).I got a discount due to it being open-box. I consider it a very good deal and well worth the price I paid.", "Date": "October 27, 2010"}, {"Title": "Awesomesauce in a box.", "Author": "Andrea", "ReviewID": "RASGQBSVM7RVQ", "Overall": "5.0", "Content": "After receiving the TV, a 46\" variety, I have to say I could not be happier.  I'm not having the flashlighting in the corners as some of the other reviewers have, and the 240hz realmotion hasn't been a particularly big nuisance after tweaking the settings.  I'm enjoying the 3d option, however, I wish there was more 3d content available.  3d PS3 gaming is fun but distracting, as I've never really needed to deal with what appears to be approaching landscapes before.  The one thing that I wish was better is the sound, but honestly, who gets a TV of this caliber and plans to NOT build a sound system around it?  Overall, I'm thrilled and would recommend this to anyone who can spare the extra money for a machine.  After all, it's not just entertainment, it's an investment.", "Date": "October 22, 2010"}, {"Title": "Amazing", "Author": "SteveM45", "ReviewID": "RDUCEDM6W3KKF", "Overall": "5.0", "Content": "I purchased this TV off amazon.com and all I can say is wow!! This TV is rated number 2 overall on cnet's top 5 TV's for a reason. If you are looking for a TV with a great picture this is a definite buy. Amazon shipping is also amazing thanks for the great work!", "Date": "September 14, 2010"}, {"Title": "Excellent TV: Exceeded my expectations", "Author": "Pandu saMson", "ReviewID": "R60014CE2V9XB", "Overall": "5.0", "Content": "Pros:* Amazing Picture quality* great features like Internet Apps; Yahoo widgets;* Accessing files from my laptop wirelessly by DLNA. It even runs FLV (flash video) files.* Although my 3D exposure has been limited to the Monsters vs. Aliens, but the quality of 3D is great and is more than my expectations.Cons:* the tv is too bright and unviewable during the day. But could manage it by setting the backlight to 9 (default was 13).Conclusion:Amazing Picture quality with Best 3D effect and superb sleek design. I am more than happy with my purchase.Suggestion: If you are planning to buy a 3D TV go for at least a 46 inches TV (instead of 40 inches)\"", "Date": "September 3, 2010"}, {"Title": "Nice TV.  Vivid Colors.", "Author": "c", "ReviewID": "R38HHG6KXPR35E", "Overall": "5.0", "Content": "You won't regret this TV.  I read some of the negatives about this TV and I don't notice it.  The delivery was great.  They called and asked to set a delivery date.  When they arrived they took it out of the box and placed it where I asked (I had to ask them to do it)....  They turned it on to verify it worked were on their way.  I would do it again.  PS.  You need to buy a good HDMI cord to the Blu Ray DVD to get the true 3D effect.  I had to pay $90.00 locally for it but worth it.  The 3D is mind blowing!", "Date": "August 21, 2010"}, {"Title": "Great TV - 3D is a bonus!", "Author": "Gisele \"-g\"", "ReviewID": "R1O07P2R1FMBMC", "Overall": "5.0", "Content": "We were ready (finally!) to upgrade our 20 year old rear projection set and figured best to go to the newest technology out there. We love it. Have had the set since March and have had no problems at all. The integration with Netflix is awesome for HD video on demand (1080i!) and the USB port is great - saved AVI files play perfectly with a simple folder structure. Ditto MP3s. If only Amazon would put up a client like they did for Roku...The 240Hz refresh rate makes a HUGE difference in picture quality over smaller LCD TVs we've got that have a 60Hz refresh rate. There's no motion blur and no noticeable skipping. Blu-ray action flicks are awesome.We've been watching the soccer matches in 3D and it's cool. Not perfect and not as startling as hoped for, but still - really cool. Can't wait for a movie other than Monsters vs Aliens (can only watch it so many dozen times...) to put it to the test.The only complaint I have is that the volume doesn't go terribly high. For most things this isn't a problem since most components go through the AV system, but for Netflix and hard drive, it can be slightly annoying.All in all, no regrets at all. I'd buy it again.", "Date": "June 23, 2010"}, {"Title": "The best of the best", "Author": "Calvinbob \"Kevin\"", "ReviewID": "R1UX24PYSZ1S2Z", "Overall": "4.0", "Content": "This TV is really amazing. the blacks are perfectly black (no light from the screen is emitted from black areas) the colors are vibrant. the picture is super crisp. my only complaint is the sound from the TV is quite.  I have changed multiple settings and yet we still sometimes have problems hearing soft dialog.  we are looking to invest in a 2.1 sound bar to enhance the sound a little more.  I have this with the 3D BluRay player from Samsung and frankly we never watch anything in 3D. the Nintendo Wii is sometimes a little fun to watch in 3D but I found it took a little too long for the TV to process the video quick enough to get accurate response with the remote and it quickly becomes annoying.  overall I still feel this is one of the best TVs out there", "Date": "June 14, 2010"}, {"Title": "Amazing!! Streaming videos from PC easy with Windows 7 only", "Author": "Retired EE \"Daniel\"", "ReviewID": "R3YVVS43PPL1V", "Overall": "5.0", "Content": "First Samsung LED is GREAT- so much brighter than an LED. Amazon delivery included \"white glove\" - meaning it was carried into house, unpacked, plugged in and operated. Great service. My UN46C7000 does not have backlighting like the 8000, but we can not see any difference. But the 240Hz refresh rate does give a better picture than even the 120Hz.I use a powerline wired internet connection (PLK300) and Windows 7 (Intel i7-920) - I set up a shared homegroup for videos, photos and music on my PC and Samsung instantly knew it was there. I have no need to use the Samsung DLNA software, as Windows 7 does it all for me. I record TV and etc on my PC and Samsung plays them; even pauses and rewinds and fast forwards!! I tried wireless (using AE1000 adapter) it was good but not as fast as the powerline wired connection. Setting up Pandora and other apps is amazingly simple.The 3D glasses do not work well in brightly lighted area (ours kept going in / out of 3D) - called Samsung and they were going to send someone out to investigate!! I declined their offer, because when we closed the shades to block the bright sunlight the glasses worked OK.Recommendation - get the 240Hz refressh, no need for backlighting, no need to load Samsung's DLNA software manager onm your computer. The powerline ethernet PLK300 is sooo easy to use.", "Date": "June 8, 2010"}, {"Title": "Panel Issues, Panel Issues, Panel Issues", "Author": "razar", "ReviewID": "R1R9NFQXGDJYYF", "Overall": "2.0", "Content": "I've owned this particular model for just over 3 months now. The first 2 months were fine. I enjoyed the picture quality and wished I had sprung for the next size up. It was either this model or a comparable Panasonic set. I wish I would have bought the Panasonic instead. Suddenly the entire right half of the picture developed \"pillaring\" distorting the entire right half of the picture along with a thin black line down the center of the screen. I've had a certified Samsung technician out to my house twice now to try and fix this tv. They first tried replacing one of the pcb's and that only fixed half the problem. The service rep said I would need a new panel. Thats when the fun really started. I literally had to yell at a Samsung representative who tried to tell me my reciept was \"not valid\". I had to fight with them on the phone. I found it hilarious that when they thought it was just a circuit board they were willing to service my tv but when it turned out to be an expensive part (the panel) they wanted to deny my warranty work. A customer should not have to argue with a company to provide warranty work on equipment that is well within the warranty period. The local service rep came out a second time with a new panel in hand. The \"new\" panel is even worse than the one I have...... So now I have to wait another week for another panel and another service visit. Going on a month now with a bad panel.I know I'm probably the unlucky one when it comes to this brand/model but for being my first Samsung tv ... it will also by my last Samsung.", "Date": "June 22, 2011"}, {"Title": "Very good tv. Colors and refresh rate is amazin.", "Author": "J. Gan \"CEO\"", "ReviewID": "R32HWMESQWK2A7", "Overall": "5.0", "Content": "One of the best tv I have seen. The surface of the tv is glossy an beautiful. The design looked like it was designed by apple. The back of the panels have enough ports for you to play in anything. I have an 55 inch Vizio LCD and this samsung LED completely destroys the Vizio LCD in quality. It is so light and thin that I lifted upstairs myself. Refresh rate is so high that the pictures looked fake (in a good way). Buying this is like having an art peice in your room. Even the remote controls are state of the art design. It looks metallic and expensive. When my girls come over they look at it and play with it cause it looks that good.WARNING: DO NOT BUY THIS FOR THE 3D. Buy it for the LED TV. This 3D is the worst I have seen. The quality for 3D is so poor that I invited 4 friends over the see it. One got dizzy, the other ones said the picture looks fuzzy. Which is true, they blur the background making the image quality fuzzy just to create a 3D effect that is garbarge to my eyes. If I stared at it for too long my eyes might bleed. I hope this is a firmware issue and that samsung can eventually update this technology.... Even with the \"free\" 3D glasses they gave me, I can honestly say it was not worth it.4 Stars for the LED TV. ZERO stars for the 3D technology Samsung invented.", "Date": "May 15, 2010"}, {"Title": "A Good Deal?", "Author": "Barbara J.A. Flynn", "ReviewID": "RVH1JVQ4CCUYC", "Overall": "1.0", "Content": "The deal offered sounds so good, and sold on Amazon would indicate that it couldn't go wrong. I was very mistaken. Since receiving delivery in December, I have not had one complete day of satisfactory TV viewing. Because I live in a very small apt, I had no place to store the box so had to get rid of it.  I therefore called Samsung directly. After seven (7) calls to service techs, I was set up with an at home service call. The tech showed up and supposedly corrected the problem of the TV switching on and off with out any notice other than what has become a most annoying tune. 15 minutes later the problem was there again. Tech returned immediately only to admit that he did not know what the problem was and therefore could not fix it without further \"consultation\" in the office. I am now left without the use and enjoyment of a T V that cost a considerable amount, and uncertain how the problem is to be resolved.", "Date": "January 12, 2011"}, {"Title": "Love it", "Author": "Barbara Berk", "ReviewID": "R1WKKGGD31IQTA", "Overall": "5.0", "Content": "Love it; everybody comments about the picture clarity.  When I purchased this TV, wifi built into the TV didn't exist.  I can get through to the internet via my Blu-ray player.  If I bought a TV today, I would definitely get wifi built in.", "Date": "January 19, 2014"}, {"Title": "TV Makes a clicking noise and won't turn on", "Author": "Kyle", "ReviewID": "R2ZECV60Z3N1N7", "Overall": "1.0", "Content": "I've owned this TV for almost 3 years and one day while watching a show, it turned  off and will not turn back on, TV Makes a clicking noise and won't turn on, no back light, no keypad, no lights, nothing. Checked capacitors and nothing looks \"blown\" or burned out.  Really disappointed only having it for almost 3 years, contacted Samsung and they said go pay for it to get fixed.", "Date": "July 19, 2013"}, {"Title": "After 2 years great", "Author": "littlesheba \"littlesheba\"", "ReviewID": "R1IHTRII094EZM", "Overall": "4.0", "Content": "I've had this for a couple of years now. It has had no issues. Even though I purchased this a lot cheaper from another site, it's been a beautiful LED TV. 3D . I'm not a gamer so I don't use the 240hz settings. You will have to tweek the setting to your taste, but it won't be much. I've never had any of the power or pop up issues. People come over to watch a game or movie and they always comment on the picture. It's a TV, and it's a very clear picture. I don't use the sound since I run it through my AV receiver, so I can't comment although I'm sure the sound is sad since it's so thin. It's a great Picture. Plenty of connections too although updates if any have to be done by USB. I'm sure since it's 2013 Samsung has allowed direct computer connection to the TV. My AV receiver and Bluray player has all that, so I miss nothing as far as Pandora, Netflix and all the other goodies out there. It all shows though this LED TV fantastic.", "Date": "May 30, 2013"}, {"Title": "Same power issues as Samsung LCD", "Author": "R Duffy", "ReviewID": "R2E32W1958PW89", "Overall": "1.0", "Content": "This has the same issues that many of the Samsung LCDs had.  Clearly they did not address the problem. They don't car about their consumers. Don't buy Samsung and maybe they will fix the problem.", "Date": "February 19, 2013"}, {"Title": "Excellent buy - Satisfied on all levels 10/10", "Author": "Mr. Buys Toomuch", "ReviewID": "R1SRHTU65LW9C6", "Overall": "5.0", "Content": "It's a shame this (and probably all comparable technology) gets bad reviews for what, in many cases, seems to be a blatant lack of understanding on the users part of the technology or how to properly use the product. I love this TV. The image is flawless. Crisp, bright, vibrant and Samsung seems to have the best black to color depth so the image pops in every lighting.Design: 10/10Picture: 10/10Built-In Sound: 7/10Features: 10/10Price: 7.5/10Design:I have mine mounted with the Samsung's 'Ultra Slim Wall Mount' (WMN2000) and between the mount and the minimal depth of the TV's design, it hugs my wall impressively close. I also ran my cables through the wall so I was quite happy o find how easy it was to (while mounted) lift the TV away from the wall and plug in my cables without removing it. (Power cable could have been a tad longer but not that big of a deal)Features:I also have a Samsung blu-ray player and home theater receiver and love how in sync the two were in regards to remote. One I set up my receiver the TV already worked off of that remote without any added hassle. Blu-Ray (240 functionality) and 3D are stunning.Sound:If you plan on using the built in speakers, plan to be unimpressed. The sound from the TV speakers is pretty lame but that's to be expected.Picture:Image quality is where this unit really shines though. My sister has a 50\" (also 1080 and 240) but from a lesser/generic brand and the difference in picture is remarkable. It's like looking at an acrylic painting next to a watercolor,, or watching a Pixar movies next to an old school Disney flick like Aladdin. Every thing else seems bland and muted. The image is flawless. Crisp, bright, vibrant and Samsung seems to have the best black to color depth so the image pops in every lighting.Overall:Highly recommend this TV.", "Date": "December 23, 2012"}, {"Title": "Love this TV!", "Author": "globetro", "ReviewID": "R3QOA3M4B71VI1", "Overall": "5.0", "Content": "I love this TV.  I'm no videophile, but the picture looks amazing to me.  Great contrast and color, super clear.  I also bought an LG TV that was quite a bit cheaper (with similar specs), and you can definitely tell the difference in quality.  The picture on the LG just doesn't look as vibrant or sharp.  (Even though both are 1080p).My two knocks are that: 1) The 3D is pretty meh.  I have yet to watch any 3D content that impressed me.  and 2) The auto-motion stuff is pretty garbage.  It makes the picture look much \"smoother\", but it winds up looking like a home video/soap opera. It's hard to explain, but it's verrry noticable.  I guess for sports, it's kinda cool, but still looks unnatural.", "Date": "March 31, 2012"}, {"Title": "Samsung 46\" LED 3D TV", "Author": "joseph j. eichendorf", "ReviewID": "R1N0HGX20UY9HO", "Overall": "5.0", "Content": "Without a doubt, best TV I've ever owned. Picture even gives impression of 3D in normal viewing.Color is outstanding. Would recommend to anyone.", "Date": "February 22, 2012"}, {"Title": "Auto Turn off with white light.  Need advice", "Author": "T. Yiu", "ReviewID": "R2SUI9S17Q5UBD", "Overall": "1.0", "Content": "TV model is UN46C7000 Software version is FVALAUSC-10212 version: SQ01Purchased on Nov 2010, this TV started to have problem on Feb 4, 2012.  On Feb 4th, 2012, the TV suddenly turns off by itself without anyone triggers it.After this turn off issue, the TV would display a line of white light at the bottom of the right side of the screen, near the red light power indicator.  Then, TV would not function.  It would not respond to any remote or direct action.  At this time, the only way is to unplug to power cord, wait a few minutes and plug the power cord again.  Next, an attempt to turn on the TV would result the same \"auto turn off\" problem.  The TV may stay up for 15 minutes or 20 minutes before going back to \"auto turn off\" again.According to the user manual on Page 24, there is a Sleep Timer.  However, this \"auto turn off\" has nothing to do with the Sleep Timer.  I followed the instructions on Page 24 section \"Using the Sleep Timer\" to confirm the Sleep Timer is off and none of the Timer is active.  (Even if a Sleep Timer can explain it, it does not explain the line of white light issue and non responding issue)As I searched the Internet, I tried to find the answer.  It seems CNET has some reviews on this issue across a few TV models, in addition to UN46C7000.Meanwhile, after a horrible experience yesterday with this TV, I was eager to see what happens with this TV on Feb 5th.  Incidentally, so far, for 4 hours, this TV does not have the \"auto turn off\" problem.Still, since it happened once, I suspect that one of these has issue:  the tuner, sensor, motherboard, or firmware.Please advise if anyone has more information on this problem.  Thank you!", "Date": "February 5, 2012"}, {"Title": "I love this TV - newer models probably even better", "Author": "alimo20", "ReviewID": "R371Q621F3KN7U", "Overall": "5.0", "Content": "I've had this TV for 10 months and i love it. No matter what I do with it, it performs just the way I would want it to. 3D is excellent, though the newer and bigger models would be even nicer.I mostly use it as my main computer screen and wow, its amazing.I don't really even like sports but because of the TV i've been watching more and more!Definitely recommend!", "Date": "December 19, 2011"}, {"Title": "We love It!", "Author": "PD", "ReviewID": "RD4JH9FBLSQIR", "Overall": "5.0", "Content": "We bought this TV one year ago and we love it!The quality of the picture is too good.The quality of 3D is good too.The applications are very user friendly (more user friendly than Sony TV applications)In last one year the internet TV has not buffered for 1 single time. You cannot determine if the video is playing on internet or cable. (Our friends SOny tv buffers so many times while watching a TV (not sure if its the TV or the internet))The Remote is very Neat. It has a back light for handling it in dark (neat!)Very easy to connect your devices to tv like phone, camera and the interface is good too.I can go on and on.. In short ...  I am 110% satisfied", "Date": "November 15, 2011"}, {"Title": "Samsung 46UNC7000", "Author": "Froike \"Froike\"", "ReviewID": "R2GVF6SVY9VP8V", "Overall": "4.0", "Content": "So far so great. I ordered this TV by accident; I intended to order the 8000 model but ordered this instead. As yet, no regrets. My genius (Nerd)son says the 8000 has far more colors and much better picture quality. Quite frankly, the picture blows me away!!! I'm more than happy with this choice. Audiophiles would be best to invest a few more sawbucks for a good Audio/Theater System. However, if you have the normal ears of a mortal, it will suffice.My Kudos to Beach Camera...they delivered the set in two days...far before the promised time. It arrived New and in perfect condition, as promised.These guys are not Sheisters....they delivered the product as promised, quickly, and no bait and switch nonsense! Very pleased with the dealer and the set!Nuff said!", "Date": "March 1, 2011"}, {"Title": "Stunning", "Author": "C. Mellard", "ReviewID": "R22VYJ60E6T0KC", "Overall": "5.0", "Content": "With proper calibration this TV is absolutely stunning.  It is by far the best TV I have ever owned.", "Date": "February 24, 2011"}, {"Title": "Best TV I Have Owned", "Author": "Valerie J. Olinger", "ReviewID": "RTP7DMEWHTVCA", "Overall": "4.0", "Content": "I bought this TV for the size and the 240HZ auto motion. The 3D aspect was just a little gravy on top. First of all Amazon did a great job of getting the set to me in a timely manner. Second when my first set had some issues with the LED backlighting, they replaced it with no problems at all. The picture on the set is very nice. LED backlighting does bring the LCDs closer to Plasma. The sound is pretty darn good also for a 1.1\" slim flat panel set. The 3D is very cool, but the whole experience is not quite living up to the hype. It is still a work in progress as far as I am concerned. Alot of parts to the chain just to get the 3D experience. I did have an Emitter failure on the set that I had to have fixed. Samsung and Canyon State Electronics were great and fixed the problem quickly. My overall rating would be 4.5 stars out of 5. Best TV I have ever had.", "Date": "February 23, 2011"}, {"Title": "Love 3d", "Author": "D. E. Hoffman \"dustboy\"", "ReviewID": "R3RLHP1TVTC8WJ", "Overall": "5.0", "Content": "Tv has superb 3-d quality as well as regular 2-d.  I have no complaints with the tv.  The detailed specifics are already covered in some of the other reviews so I won't bore you with repeats.  I am real pleased with it.", "Date": "February 23, 2011"}, {"Title": "Impressed so far...!", "Author": "Bob M. from Raleigh, NC", "ReviewID": "RR03NGZ08K17S", "Overall": "5.0", "Content": "Bought this item after looking at it in a store. It had a strikingly better picture than any other in the store. Got the best price on Amazon from 6th Avenue Electronics and everything was just as smooth as possible!  Arrived undamaged in new condition, as promised. No disappointments!", "Date": "February 21, 2011"}, {"Title": "Skype, but only with Skype's $150 camera", "Author": "S McClellan", "ReviewID": "R2N6Q931WIPBHW", "Overall": "4.0", "Content": "I like the 46\" Samsung C7000 series TV video quality, and the remote. I was intrigued by the Skype application and made a startling discovery. Be warned; if you want to make use of the Skype application you MUST buy THE UNIQUE \"webcam\" compatible with this TV from Skype for $150. This single purpose \"webcam\" is not compatible with computers, and conversely, computer compatible webcams are NOT COMPATIBLE with this TV. Surprising and disgusting. I will not buy the Skype camera for $150, maybe for $60.", "Date": "February 16, 2011"}, {"Title": "happy with purchase", "Author": "dds", "ReviewID": "R2HGKZ9F76PZ16", "Overall": "5.0", "Content": "picture has been great on blu-ray/dvd. there are many great options and adjustments for fine tuning the picture. the only thing i would want to improve is i wish the manual was a little more detailed on what a lot of the picture settings and features change and how they correspond to each other. after some trial and error and internet research though, i feel its pretty easy to tune.sound was better than i thought it would be. i primarily use home theater for sound but am also happy witht he tv's speakers.3d experience has been good so far, the only downside is the limited content and availability. the blu ray that came with package did look great though", "Date": "January 31, 2011"}, {"Title": "AMAZING picture quality.", "Author": "Eric A. Fetcho", "ReviewID": "R33GPD75BFX8UZ", "Overall": "5.0", "Content": "The picture is the best I have EVER seen and I work in the professional HD video market, and SUPER bright.  Considering how thin this is, it is insanely clear and bright.  The audio is very good considering the depth of the screen, very adequate for most.  My only hiccup is, the blacks are not even, annoying to me, but nobody else notices unless I point them out.  My model does NOT have the issue of light spilling out of the rear of the screen, that other people have mentioned.", "Date": "January 28, 2011"}, {"Title": "Good 3D TV for a good price", "Author": "Steven V", "ReviewID": "R3TNE3RUBRLD2J", "Overall": "4.0", "Content": "It's a starter 3D set but for the package price of less than $1400, I can't complain.I went from a 720 DLP to this LED and that's a huge jump. The pictures are so vibrant I'm still amazed.  Install and hook up were easy.  Setting the proper color, contrast, backlight, RGB, .... to suit my taste is a little challenge.  It's just trial and error until it \"looks\" right.", "Date": "January 27, 2011"}, {"Title": "Samsung UN46C7000 46-Inch 1080p 240 Hz 3D LED HDTV (Black)", "Author": "Paul", "ReviewID": "R3M17MVU89I58A", "Overall": "5.0", "Content": "I am very pleased with the purchase of this product.  The picture is unbelievable.  It was shipped on time and received on time.  I am not happy with Samsung because the 3D glasses needed to view 3D content are $200.00 a pair on sale.  This price is rediculous.  I will have to wait several years until the price of these viewing glasses come down within reason.  Also, only Samsung 3D glasses will work for this TV.  But, the 240 Hz refresh rate and the 6,000,000:1 contrast ratio make for a magnificent picture that is hard to discribe.", "Date": "January 25, 2011"}, {"Title": "Incredible Picture Quality, Nice Internet Features", "Author": "Hamburglar", "ReviewID": "R29CT5W0FFRQOH", "Overall": "5.0", "Content": "I had initially bought a Sony 46HX800 and returned it in favor of this TV.  The Sony's colors weren't very good in a set at that price point and feature set.This Samsung has incredible picture quality.  The colors are vibrant and striking.  I have no complaints on the picture.  Clarity, color, sharpness are all excellent.Sound seems powerful and clear too.  I usually only have to turn it up to 6 or 7 on a scale of 100 and it fills my bedroom with sound.  It doesn't sound thin or tinny at all.  Good sound.I am using the separate wifi adapter to load in the wifi applications.  They are interesting and kinda cool.  A bit slow, but they are something to mess around with.  Theres netflix, youtube, vudu, yahoo, and the other usual suspects.  They all seem to work well.I am not a huge fan of the chrome stand and chrome accents on the bezel of the TV, but they don't bother me like I thought they would.  I thought the shiny chrome stand would be reflective when I watch the TV, and it is, but not to the extent that it bothers me.The remote is slick and fancy, but its a bit flat and it kinda hard to feel out the buttons sometimes.  Not the greatest design, but its functional.There is some LED bleed in the corners.  I do see the LED bulbs a bit in each corner during letterbox movies or when the screen is completely black.  That could be an issue for some, but it doesn't bother me since the picture quality is just so unbelievably good on this set.  You wont notice the LED bleed on full screen programs unless the screen goes black.All in all if you can get a good deal on the set, I would recommend it highly.  Can't beat the Samsung picture quality, particularly their rich and vibrant colors.", "Date": "January 23, 2011"}, {"Title": "shiny screen", "Author": "R. Weilep", "ReviewID": "R3R3HPU8XP37A0", "Overall": "4.0", "Content": "My second samsung lcd.Pros; Very nice picture quality once you get Hd service, non-hd channels not so good. very thin TV, improved remote control and better sound quality than my Samsung LN52A650.Cons; hate the new stand style.  Did I say non-HD channels suck. The HDMI inputs come out sideways near the edge of the TV making the cable more difficult to hide. One primary reason I picked LCD is because of the reduced screen reflectiveness when compared to Plasma. However this TV has a much more reflective screen than most LCD tvs. Makes for a nice picture in the dark, but more glare from light shining through windows.All in all a very nice unit, but pricey.", "Date": "January 22, 2011"}, {"Title": "Plain and Simple", "Author": "JMastaFlex", "ReviewID": "R3CU19U6Q4HJB5", "Overall": "5.0", "Content": "I am going to make this quick and simple.  The looks of the TV are incredible.  Just buy the TV, you can not go wrong with all the features you get.  Great picture, internet apps, 3D and its only an inch thin.  If people are going to cry about the smallest details that only a professional can notice in a test facility, then don't get the TV, simple as that and you can regret it later.  Also, Amazon and a few others are offering incredible deals with this TV.  SO price should be of no concern.  I got the 46inch UN46C7000, with the Shrek 3D starter kit, and the C6900 3D Blueray player all for just over $1,400.00.  Also, this set features probably the best remote I have ever seen or used.", "Date": "January 20, 2011"}, {"Title": "movie watcher", "Author": "Laurie", "ReviewID": "R1URDI4FM9FUUM", "Overall": "5.0", "Content": "If you are trying to decide on a 3d tv you can not go wrong with this one. The picture is amazing even with old movies. Everything is crystal clear the defention is unreal. The 3d technology is amazing we have just started playing with turning regular tv in 3d.there are so many features and extras, purchase the wireless connect for wifi to get online unless you have an extra ethernet cable. Amazons customer service is also amazing tv went down in price I was immediatley refunded the difference great product and cheaper on amazon then anywhere in town.", "Date": "December 8, 2010"}, {"Title": "Dec 2 2010 purchase 1st review", "Author": "Christopher Skeval \"fieldboss\"", "ReviewID": "R1ERZOFLGOGFH1", "Overall": "5.0", "Content": "OK fellow campers;  Wife just shock me with this TV & related Blue-Ray DVD with the 3-D Glasses.  She purchase it at a local store, Olum's, good price, terrible service.  Anyway this is my 1st new TV in 10 years so all the HDMI and related cables are new to me.I am on the Time Warner Cable system and having problems with HD channels falling apart. I have them coming on Saturday to look at their cable.PRO:The picture is absolutely stunning.  The kids are watching the sample 3-D DVD that came with the DVD and wearing their 3-D glasses, they are blown away.CON:When I change Sources say from TV to the WEII (component cable) it doesn't recognize it.  I press Refresh and still no go.  I have to power off the TV and re-power then it seems to recognize it. Same thing with the DVD player. Maybe I doing something wrong.The other thing is that I can't have both the TV speakers on and the Surround Speakers on at the same time.  There are a lot of times that won't care about the Surround sound and just want the TV speakers, so now I have to go into the TV menu and setup and choose speakers and turn them back on.  PITA!!I have yet to actually see a Blue-Ray movie, hopefully tonight.My sound system is an Onko 7.1 system with the Optical Digital inputs.If anyone has any opinion of Samsung's sound system which might be more integrated, I be interested to hear about it.I'll do a followup in a week.  Anxious to see how the wireless WIFI works on both the TV & DVD.", "Date": "December 3, 2010"}, {"Title": "Love It", "Author": "Amazon Customer \"Yonkers, NY\"", "ReviewID": "RDRPIWSMS0JEZ", "Overall": "5.0", "Content": "I purchased this TV from a different vendor (replacement for covered set) and it is wonderful.  Th picture is beautiful.  The sound is fine for normal use.  The picture is so life like, I can see a 3D in the normal pictue quality.  I've watched a few shows with 2d->3d and there is a difference.  Nice experience.  Keep a watch on the starter 3D glasses kits, as the starter movie changes the glasses go on sale.  I got two pairs for $90.  Yes, I now have two copies of the same movie, but I've 4 glasses for 90 (first two were free with the promotional offers).I just watched a movie on demand from Amazon and it was like being in the movie house.  Unbelievable.  The 3D is amazing (if you have 3d Content).  Whe I selected this set I assumed I'd have it for a number of years and the way 3d is expending, regular programing is not that far in the future.If you can aford this set it will live up to everything you wanted in the TV.  Excellent choice.The one draw-back I see right now, is that skype requires a specail camera (its pricy).One more note:  Set up was easy.  Screwed in the base (which swivels), plugged in cable (hdmi), and added internet wireless stick.  I did have to change the input source.  Once up and running choose internet TV, downloaded a few samsung applications, but to get Amazon VoD you have to choose Yahoo.  It was very simple.", "Date": "November 27, 2010"}, {"Title": "Samsung is the Best!", "Author": "Penny S Maltoni", "ReviewID": "R1A75ST8H8HTJ5", "Overall": "5.0", "Content": "This is our 8th Samsung purchase and their products keep getting better & better.The reason I only gave a 2 rating under 3D is because we have not tried the 3D side of the TV as of yet, and cannot give it a rating at this time. This 3D LED TV replaced a 2008 Samsung 52\" LCD and looks wonderful in it's place. We wouldn'd have any other brand in our home, even our computer monitor is a samsung.", "Date": "October 21, 2010"}, {"Title": "Great TV but Crutchfield.com offers more", "Author": "Coach Steve", "ReviewID": "RNKYS2OEH5UAN", "Overall": "5.0", "Content": "I got this TV a few days ago and I am in love with it. The 3d is really cool and doesn't give me a headache like the movie theater 3d does. I got this TV from crutchfield.com and it came with the samsung 3d bluray player with wifi and the samsung starter pack with 2 glasses. All of that was the same price amazon sells just the TV for, so shop around. The sound is okay but if you are using TV speakers with a set like this there is something wrong with you. It would not be possible to fit good speakers in a set this thin anyway.", "Date": "October 20, 2010"}, {"Title": "Love It", "Author": "Srikanth", "ReviewID": "R2DXVOCS410Q6", "Overall": "5.0", "Content": "This is an excellent TV (that I bought at a great price from Amazon). The best part is Internet@TV - you can stream all movies from your Netflix Instant Queue. Also, you have several other providers (including Amazon Video on Demand, Yahoo, Pandora, Blockbuster, Hulu, etc) making the overall usefulness of the TV a lot higher.The TV is surprisingly slim and light. Picture quality, sound, etc are all as expected or better. 3D experience is great, though 3D programming available is quite limited. 3D TV makes sense only when you take a slightly longer term view of the investment.Connecting your laptop (with HDMI port) to TV is very easy. The TV has 4 HDMI ports - more than you can ask for.One word of caution - Original wall mount for this TV can be extremely pricey (up to $250).", "Date": "September 27, 2010"}, {"Title": "Blown Away by this LCT 3D TV", "Author": "Barb", "ReviewID": "R3D594S5VQ8ODR", "Overall": "5.0", "Content": "This is the first BIG item ordered from anywhere including AMAZON.  TV arrived on time in fact a day early.  The delivery folks even offered to uncrate it as well I opted out of that free service.  My old DELL supplied wall mount didn't fit the bolt pattern on the back of this TV so we had to find a solution.  We went to Wally World and got a glass stand that I love.The 3d experience is limited but the BluRay DVD that came with the Starter pack was amazing.  The 2D - 3D conversion playing AVATAR in BluRay is VERY good.  If I were to add anything it would be more composite inputs.  HDMI from Cable and the Samsung BC6900 BluRay player is truly amazing.  Clarity is breathtaking, and that's compared to my DELL plasma.I recommend you learn how to adjust the TV and use all of the options to get the maximum benefit for your vewing experience.  Can't wait till I get to see the World cup match broadcast in 3D on espn this Sunday.  Just a note for those of you who sometimes have a case of Duhhh, like I did.  3d cannot be sent from cable or satellite over composite, it has to be HDMI.  Composite is analog and HDMI is digital nuff said.  Allshare is VERY nice as it synchs up the DVD and the TV.  I am tempted to get a Samsung surround sound setup which will also connect via allshare.Overall I am very pleased with this purchase and IF I had to do it all over again I'd make the same choice.", "Date": "June 19, 2010"}, {"Title": "AWESOME!", "Author": "Jose E. Gallo", "ReviewID": "R1ZYWACVINAQJ2", "Overall": "5.0", "Content": "At te begin I thought it was a bit expensive, even when AMAZON offered the best price, but when I received the TV I was really impressed.  First looks really smart and incredibly thin (less than one inch!), is definitely beautiful.  The picture quality is spectacular, when you look at high definition channels cannot believe the sharpness, colors, etc.  3D function is great and even when the supply of these movies are limited, the offer will increase rapidly.  In short, the best of tecnology (including internet connection) in a beautiful design.  About the sound, is pretty decent, you cannot expect 1000 watts of power (for that are home theaters).  For those who love television the spending is more than justified!  Definitely I recommend it.", "Date": "May 31, 2010"}, {"Title": "upset", "Author": "ken", "ReviewID": "R2JO4K8CGSGSA3", "Overall": "2.0", "Content": "Had my samsung tv for two weeks before it broke . i can not get digital channels between 2-80 .It hard for me to believe will not replace this tv. on all the other channels picture quality is great.", "Date": "December 23, 2010"}, {"Title": "TheBest", "Author": "Loveshopping", "ReviewID": "R3NBNCLS4EEF03", "Overall": "5.0", "Content": "Me encanta comprar por internet, es mas facil y puedo recorrer diferentes websites para verificar precio, aunque siempre termino comprando aqui lol,Esta TV ha sido una de mis mejores compras  ya la tengo por casi 2 Anos se ve super genial los  colores son vien vivos especialmente en munequitos, el tamano esta mas que bien si tienes una sala regular no tan grande ,  la recomiendo seria mente muy buen precio y una buena tV.Muy feliz con Ella..<3", "Date": "November 8, 2012"}, {"Title": "Edgelit / Backlit problem", "Author": "Albert S Woo", "ReviewID": "R3BGPYCGBC35I0", "Overall": "2.0", "Content": "If seeing gray instead of black bothers you, or if seeing uneven bleed on the background bothers you, you'll be disappointed.  I have to set backlight level to 0 and brightness to 40 to get acceptable black color.  In those settings, the image is just not sharp and isn't good when being viewed in a well-lit room.", "Date": "January 15, 2011"}, {"Title": "Even better than I could ever expected!!!", "Author": "Mudgrunt", "ReviewID": "R3TQMHNE1V9YPR", "Overall": "5.0", "Content": "I did alot of research on this TV.  Everything from price, picture, connectivity, EVERYTHING!!!  This unit is worth every penny!  My girlfriend and I were totally blown away by the picture.  BUY BUY BUY!!!", "Date": "November 4, 2010"}, {"Title": "samsung un46c7000 46-Inch 1080p 240 hz 3d led hdtv", "Author": "Bo Phenevongsa", "ReviewID": "RYAMZ5UN6TCKD", "Overall": "4.0", "Content": "Great tv, the 3d is amazing. Probably going to get the 65 inch for the living room.", "Date": "November 2, 2010"}, {"Title": "Poor store service", "Author": "William Schabel", "ReviewID": "R1LPYJ2B4RMS7G", "Overall": "1.0", "Content": "Ordered item on Jan 29 and received notification of order receipt and shipment on Jan 31 or Feb 1.  On Feb 2 late afternoon received email that order was oversold and I would not receive the television.  What happened between Jan 29 and Feb 2?  Seems like 3rd rate clown school rather than a good store.Samsung UN46C7000 46-Inch 1080p 240 Hz 3D LED HDTV (Black)", "Date": "February 2, 2011"}, {"Title": "Misleading Marketing - Poor Service", "Author": "Ronald D. Ford", "ReviewID": "R1Z79J36M3P5GC", "Overall": "2.0", "Content": "I caution you to not buy this product due to misleading marketing and poor service.  The marketing says that the TV has personal computer (PC) input capability, but this is NOT TRUE for all PCs.  When I asked Samsung for help on this issue, they acknowledged this lack of compatibility despite what their brochures, website, user manual and the salesman said.  Their response was basically - we sorry we put out false information, but too bad for you, and we will do nothing to make it right.  In addition, there are numerous errors in the user manual with regard to internet capability and updates.  They also have error/information codes that pop up and are per Samsung not what they say they are requiring calls to their \"support\" people.  When I asked to be transferred to Customer Service, their reply was \"we don't have a customer service department, just us technical support people\" - I am not kidding!  That was one of the most accurate statements they made.  The picture quality and sound are very good, but no better than other comparable products, which do what they advertise they can do.", "Date": "June 17, 2011"}, {"Title": "Where is the Amazon Video??", "Author": "Padraic B. Keeble", "ReviewID": "R1EEOAA4XVOHGB", "Overall": "1.0", "Content": "First off, this is an awesome TV! Excellent video quality, very crisp, very fast motion. The sound is just OK, we had to buy the sound bar which makes the sound awesome, but at $200 it had better!I gave it one star overall because IT DOESN'T HAVE AMAZON VIDEO AS IT SAYS IN AMAZON'S WRITE UP! I'm an Amazon Prime member so I would love to be able to watch the 30,000 plus free streaming videos and movies on my TV! Not my computer! Alas, that app isn't available from Samsung yet. GET YOUR WRITE UP CORRECTED AMAZON!", "Date": "March 5, 2011"}, {"Title": "Samsung does it again", "Author": "Oscar \"electronic junky\"", "ReviewID": "R3G6JOYNO9TPUA", "Overall": "5.0", "Content": "Pros: Full 1080P, 240HZ, 1 inch thick, 3D ready and swivel stand. I'm not into having to spend $[...] bucks for glasses so the 3D really doesn't concern me and I'm not going to run a line for the internet so the internet tv isn't going to be used. bottom line on this set is the outstanding picture. Even my hidef cable service blows me away and on Blu-ray it's a killer. I know I paid top dollar for a new model but using coupon code WS920X5750 at exponj saved me $272.64 ! If you have been setting on the fence check out the UN46C7000 and you'll be off that fence as fast as I was.Cons: Price, internet tv, too many bells and whistles", "Date": "March 24, 2010"}, {"Title": "Visually Stunning", "Author": "BronsonC \"Bronson\"", "ReviewID": "RI002PX716O90", "Overall": "5.0", "Content": "If you purchase this item make sure that you outfit it with the very best. I purchased a expensive Monster 3D HDMI cable and I suggest that you do the same. I actually didn't want to after I saw how much I was spending on this purchase but then I was talked into it because I had the 3D TV and the 3D blu ray so I said what the hell I might as well get the 3D HDMI. Boy am I glad I spent the extra money for the cable. Just watching normal blu ray DVD's, the picture quality is so life like it is ridiculous. When watching a 3D DVD it was so awesome to be able to see the items popping out of the TV. Also the ability to up-convert 2D DVD's to 3D was so awesome. I popped in the 300 blu ray DVD and up-converted it to 3D and it was still pretty awesome. I enjoyed every minute of it.The only thing that I would suggest with a 3D TV purchase is to make sure that your couch is back far enough to get a clear picture. If you are to close to the TV you will see the double vision but if you are back far enough it will be gone.", "Date": "April 24, 2010"}, {"Title": "3D Fantastic experience, however, need internet TV help  ron rivchin", "Author": "Ron Rivchin \"Ron Rivchin\"", "ReviewID": "R3L8SRKXJKLOL5", "Overall": "4.0", "Content": "I am pleased with this purchase.  I find that the 3D is a unique experience. Most people rarely get the chance to experience how the 3D works while at home, my set came with 3D Active Glasses that communicate wirelessly with the C7000 HDTV. These glasses are special liquid-crystal lenses. They block out the left or right lens in coordination with the frames flashing on-screen. So,the right eye sees only the \"version\" of the movie intended for the right eye, and the left eye only sees its version. Anyway, watching tv at home is a groovy experience. In just a few years we are going to watch holograms.  I am confused how Skype or internet@homeTV works. It seems like it takes too long to load. I didn't get to successfully watch HULU yet, I think I will get the hang of it.  Hopefully, maybe a new app changes this.  I am waiting for the iPad delivery so I can watch HULU around the house. Apple iPad Tablet (64GB, Wifi) I use the 6900 player and it is beautifulSamsung BD-C6900 1080p 3D Blu-ray Disc Player I am not sure what titles are available in 3D, I am looking forward to Avatar release.  Here are the movies I have watched on blu-ray on this set: My Bloody Valentine 3D [Blu-ray] IMAX: Wild Ocean [Blu-ray]Jonas Brothers: The 3-D Concert Experience (Blu-ray/DVD Combo w/ BD Live + Digital Copy)Imax: Under the Sea [Blu-ray]The Final Destination [Blu-ray]", "Date": "March 18, 2010"}], "ProductInfo": {"Price": "$2,599.99", "Features": "Mega Dynamic Contrast\n4 HDMI (ver 1.4), HDMI-CEC\nComponent & PC input\n2 ConnectShare Movie\nBD Wise", "Name": "Samsung UN46C7000 46-Inch 1080p 240 Hz 3D LED HDTV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/31izb70MmpL._SY300_.jpg", "ProductID": "B0036WT4EC"}}