{"Reviews": [{"Title": "Great Little TV!", "Author": "Beethoven Buff \"Beethoven Buff\"", "ReviewID": "R3MUYPTG1KBY1O", "Overall": "5.0", "Content": "I have had this TV for almost a month and am completely satisfied with the performance.  It is compact, thin and easy to set up--just follow the instructions on the screen after you have turned it on.  The color was a little \"washed out.\"  I went into the color adjustment option and \"tweaked\" it a little.  There is a protocol during the set-up that helps you select the color reception, however it proved not to be what I really wanted, so I did it manually.  Now it is clear, sharp and very natural looking.  I also adjusted the sound quality the same way. I feel this TV will rank with any more expensive Sony or Panasonic for quality and reception.  If you are looking for a excellent, small 22\" for the kitchen or bedroom, this is a keeper.  The only problem, and it is a minor one, was during the \"auto-scan\" process to search for TV stations.  It warns that it could take as much as 20 minutes--and it did.  I had to do this three times since it turned itself off after about 15 minutes twice before completing the scan. It could have been my cable supplier, but don't worry.  Be patient and all will be terrific.", "Date": "January 24, 2011"}, {"Title": "Great buy, fabulous Philips 22-inch LED LCD HDTV", "Author": "T. K. Fowler", "ReviewID": "R1FAX58ARI8QMA", "Overall": "5.0", "Content": "I tried going for a smaller widescreen than everyone said I \"had to have,\" and am I pleased!  I suspected that since this is my first widescreen, and since I've been getting by on a 13-inch square since my 20-inch square TV went kaput, that a 22-inch Philips would seem like a huge step up.  And does it ever.  The picture is so sharp that I don't need a bigger screen in my little cottage -- certainly not until my upstairs 13-inch gasps its last.  I can read the newscrawlers, subtitles and sports scores.  The color is gorgeous, and I haven't even taken time to superfine tune it.  The TV arrived days early from amazon.com yesterday afternoon, Free Super Saver Shipping, and I started setting it up this morning.  Just then \"Goodbye, Mr. Chips\" came on Turner Classic Movies, and I hadn't seen it before, and wanted to, but I plunged ahead, watching while I looked at the Quick Start.  I unplugged the old and was back watching the movie again before intermission.  This HDTV has all the hoolymajiggits to hook up your PC, your video camera, your computer games, and I don't know what all, but being a film fan, all I have is a Magnavox DVD-VHS  player, and that hooks up just fine.  The remote operates intuitively, and I can move through the menu likewise without reading the manual.  I just couldn't possibly be more pleased, especially since I've long depended upon the quality of Philips and Magnavox.  Just after Christmas there were 22 of these sets, and they sold out before I could make a move.  I let amazon.com know I was sold on the set, but couldn't buy in time.  I was so sold that I was thinking of buying the same TV in the 32-inch if I couldn't get the 22.  But true to form, amazon.com came through with more 22-inch Philips 720p LED LCD HDTV, Black.  I bought one, it's here, and it's up and running, just like that, after weeks of checking availability.  I actually think the 32-inch might be too big for my cottage as it is for my budget right now.  My TV stands atop the entertainment tower for my component stereo system (remember those?) and it can face forward to the living room, or turn toward the adjacent bedroom (fishing village architecture).  It's a very big picture either way.  What I like about the Surround Sound is that a lower level is adequate because it's not all coming from one back speaker. No more blaring that makes my Chinese Shar-Pei rub her ears. I'm happy, happy, happy, and so is she.  I won't be needing the free return, but in this neck of the woods, I'm grateful amazon.com offers it.  Thank you, thank you, amazon.com.", "Date": "February 17, 2011"}, {"Title": "Good and Bad", "Author": "EG Whitman", "ReviewID": "RDO02JYWLB1RD", "Overall": "3.0", "Content": "Not being a techno wizard I needed to replace the old analog TV as it was giving up on us. A little researce and going by other reccomendations I selected this TV. It was as advertised with one exception. Ease of set up and picture were near perfect. Only complaint I have is the sound quality, VERY poor. Even after going thru the equlaizer set up and selecting type of entertainment to view .ie . movie,news, music etc all sounds as if it were emminating from a tin can. I am currently looking for an external speaker option.", "Date": "March 7, 2011"}, {"Title": "For the price, its a great little TV", "Author": "grindMARC", "ReviewID": "R2YY81U0FWKTQQ", "Overall": "4.0", "Content": "Over all, I'm pleased with this TV for the price. I mounted it to a wall over a tall chest of drawers in our bedroom. Its picture is bring and clear. And the viewing angles are much wider than I thought they would be. If I forget to pull the TV out from the wall and tilt it down to the bed, its still a good picture. However, the sound is pretty bad despite the availability of an equalizer in the menu. The preset sound and picture settings are HORRIBLE. I panicked at first thinking that there was something wrong with the picture. Then I found the settings to brighten it up. It was terribly dark out of the box. You should definitely play with the sound settings too to add some base and take out some of the highs.", "Date": "March 31, 2011"}, {"Title": "For some purposes, it's perfect", "Author": "Fireworks", "ReviewID": "R2RYULP05KOK0Z", "Overall": "5.0", "Content": "Replaced a 19\" Sanyo we had in our bedroom for 6-7 years with this Phillips 22\". At the price we paid, we couldn't be happier. Very clear picture allows you to set coloration, tint and so forth manually, even has an equalizer for the sound. It's better than I expected.", "Date": "January 23, 2011"}, {"Title": "Small but Beautiful", "Author": "Emma Beel", "ReviewID": "R2YA68GFIZEAH9", "Overall": "5.0", "Content": "OK, this TV is definitely on the smaller side. Coming from a 21\" dinosaur-age TV, I thought that 22\" would be larger but it is not because of the wide-screen. So, even though the diagonal is a bit larger, the height of the image is lower. Bad thinking on my part. However, in a tiny apartment like mine, a small TV has only advantages. The images are amazing, great colors, great sharpness.Yes, the reviews are true that the sound is not great, but that is not really what I expect from a TV. I have a setup with 5.1 surround sound computer speakers plugged into the ear phone jack. To my very pleasant surprise, the TV remote then can be used to adjust the sound level. Before, I had to operate one remote for the TV, one for the speakers, and one for the converter box. Could not be happier with this purchase.And just a word about the shipping. It was the fastest ever. It barely took 2 days to get to me, and it was announced to arrive more than a week later.", "Date": "May 4, 2011"}, {"Title": "For gaming it's perfect...TV is perfect too! What else do you want?", "Author": "N. Rodriguez \"Gamer FOREVER\"", "ReviewID": "R1BD80HM3ZCUYE", "Overall": "5.0", "Content": "Honestly after reading these reviews I don't know what to say about others. I just got this little TV today for my kid brother to have his own little TV for his 360 and I have to say it's a beautiful picture! For a little 22inch screen it's great!!!If people can play app games on a little 4.3 inch screen on a iphone then you can game on this bad boy!In fact I just ordered a 2nd tv to go along side my 40 inch sony so I can plug in my Wii. Because for you hardcore gamers like myself you know how bad a Wii can look on a larger HDTV!Anyway.. As I said this TV is idle for gaming and TV viewing. If your trying to go bigger than fine, But no need to bash this TV.. As for the sound complaint.. It's not that bad. It's not bad at all. Again.. it's only 22inchs.. you expecting Bose sound or what?!", "Date": "March 18, 2011"}, {"Title": "Very Satisfied.", "Author": "tyler", "ReviewID": "R3LGOJ8NQUK5V8", "Overall": "5.0", "Content": "I bought this television just recently.I had it wall mounted in my bedroom just for watching tv here and there.The picture quality is fantastic; better than I expected.The sound is very good too for being a flat-paneled tv.Philips has always made good products, and this just deepens that logic.", "Date": "January 29, 2011"}, {"Title": "For the price, this is great", "Author": "zigzagg", "ReviewID": "R2OCMONVPFFM72", "Overall": "4.0", "Content": "Bought it for our home gym.  We are just using an over the air antenna, a PC connection and an old DVD player because the gym is away from the house and running a cable would have been a total pain. It does a fine job playing exercise DVD's,  displaying streamed Hulu and picking up broadcast TV.  Nothing really demanding though, at least for us.As other posters said, setup was a breeze.  Just follow the on screen instructions and it is done.  One thing I did notice though is that during setup there is a selection for \"home\" or \"business\".  The \"home\" selection is an energy saving mode that, in my opinion, washes out the colors.  Take \"business\", it makes all the difference.When you change the channel to an HD station broadcast over the air, it takes a millisecond to recognize it is getting HD. So the picture starts square and then blinks to HD. No big deal but I've never seen that before.Looks good, great price, the 30 day return policy and it was at our door in two days with Prime.  Saved us a drive and a ferry ride (let UPS pay for it), cheaper than the big box stores too.", "Date": "May 5, 2011"}, {"Title": "So far, so good", "Author": "Den Shan", "ReviewID": "R2C2T906T11676", "Overall": "4.0", "Content": "Purchased this TV for the bedroom.  Although it's the size of a large computer monitor, I am very happy with it.  Nice clear HD picture and SD picture is fine as well but does not fill the screen (which is a cable issue).  Sound quality is fine as long as volume is kept in the \"50\" range.  Hookups for DVD player and HDMI easy to reach.  Overall, very satisfied with this purchase.  Unhappy that TV was approximately $60 less a few days after I purchased it.", "Date": "February 9, 2011"}, {"Title": "Not a great TV set", "Author": "J. Hammel", "ReviewID": "R3NXYKZFHA4IMX", "Overall": "3.0", "Content": "I can't honestly say I recommend this TV. It isn't horrible; it is certainly functional enough. it's purpose was meant to be a secondary screen for games and as a monitor of sorts for my mini-lap when I'm playing games or watching movies in the bedroom. I was going to just get a monitor, but I wanted something I could jack my PSP into and had some sound output.Let me say that if you're just going to watch TV or play the occasional movie, this should suffice. The price point isn't bad for a 22\". Games look adequate from my ps3, and while I realize it is a smaller screen, I still feel my 32\" LG blows this thing out of the water in picture clarity. Heck, my 11\" mini lap has a sharper image, so size has nothing to do with it.I can't recommend against using this thing as a monitor enough though. The image looks too washed out, and I spent forever fiddling with the settings. You can eventually come to something livable, but the whites just never quite look right. I can plug and play my mini lap with an HDMI right into the larger TV without fiddling with it at all and it looks fantastic. Not so on this TV.Also, the sound is sub-par. While the picture does eventually come to a point where it's acceptable enough after fiddling (and fiddling and more fiddling ad nauseum), the sound never does quite get to a point where it isn't noticably inferior to what one would hope. I went long enough with just standard TV speakers to know what they should sound like, and these don't cut it, and I'm sorry, but if they don't sound good because I only carefully tuned the settings for 3 hours instead of 5, then something is still wrong here. I didn't have to mess around with an equalizer for any other tv I have ever owned for it to sound adequate out of the box.This is an okay television for what it is. The cons aren't compelling enough for me to return it, though it's crossed my mind and I really can't recommend this TV to anyone else expecting it to be as versatile as I was.", "Date": "May 11, 2011"}, {"Title": "Decent, inexpensive LCD HDTV", "Author": "Brandon K. Rush", "ReviewID": "R3GAYFNF8UF1K5", "Overall": "4.0", "Content": "I needed a TV to replace my very old RCA 20-inch CRT that my ex took when she was moving out, and I found this one. It's light, widescreen, and does the job of a basic television quite well. \"Installation\" is easy -- you literally just put two screws through the stand to mount it, and plug it in. I don't have cable, but I have an RCA 1500 flat antenna that was very easy to install (simply screw the antenna cable into the port on the back of the TV), and within five minutes out of the box, it had already been set up, channel-scanned, and I was watching television.There are a few minor issues worth mentioning, however: yes, it's very light. It's not shoddily-constructed or anything (in fact, it's constructed quite well), but the TV itself is less than ten pounds, meaning if you have small children or rambunctious pets, you should obviously take precautions in where you place the TV as it could be easily knocked over and go crashing onto the floor. Because of this I suggest immediately filling out and mailing off the warranty card in the box, just in case.Many consumers here who have bought the TV have complained about the sound quality as well, citing that they needed to buy a sound system (or, barring that, a set of powered computer speakers) to hear the TV properly. I understand what they're saying to a certain extent, as the TV's sound is quite low -- I have the TV set up in a 12x15 foot living room, and my comfortable volume levels for the TV are usually between 55 and 60 (out of 100). Keep in mind this is not a *large* television anyhow, and that its sound (as well as viewing quality) isn't meant to be spread through multiple rooms, or even a room bigger than my 12x15 living room. This sort of television is best used in a small room such as a bedroom or kitchen for the best sound quality.Picture quality, for the price, is mid-range; yes, it's only 720p, but to get your brightness and color saturation levels to your satisfaction, you'll more than likely have to adjust them manually in the TV's settings menu. This only takes a few minutes, however, and is worth your time just to see what suits your viewing preferences the best.Overall, this is a great little TV for the price; no, it doesn't have all the bells and whistles that more expensive models do, but if you're looking for a lightweight, basic TV with a lot of functionality, this one's hard to beat -- especially when comparable models are selling for $230-250 in stores. I got mine on here for $179.", "Date": "August 20, 2011"}, {"Title": "Good TV @ a great price", "Author": "Richard Ivey", "ReviewID": "R1EM9TSXJM7JO7", "Overall": "4.0", "Content": "After doing some research on small HDTVs I noticed that Amazon had this model that others had rated fairly highly so I bought it and received it in only a few days in perfect condition. It was easy to hook-up using an HDMI cable. The picture is really nice and the sound is good in the small bedroom we use it in. I have a question for the designer(s) though: Who is the engineering genius who thought that using a BRIGHT white light to indicate that the TV is on would be smart, on a TV that will often be used in a dark bedroom at night?  Couldn't a normal person notice that a BRIGHT WHITE LIGHT might be distracting under any lighting circumstances?  An opaque piece of black tape lets enough light through to work. Once the user compensates for the engineering genius(es) it is a great tv.", "Date": "April 28, 2011"}, {"Title": "TV Broke after 1 year and 7 months", "Author": "Tony Heitmann", "ReviewID": "R3AIPYVCS5E4C1", "Overall": "1.0", "Content": "I am very disappointed with this TV, since the screen went bad (red, green, white, blue vertical lines - no picture) after 1 year and 7 months.  I called Philips to explain the issue and they told me that there was nothing they can do since it is outside of the 1 year manufacturer's warranty.  He also said that if I took it to a TV repair shop, it would cost so much to repair that it would be better to buy a brand new TV.I feel that a TV should last longer than this, considering we rarely used it.  I advice everyone to be careful when purchasing a Philips TV, if their products are designed to only last a little over 1 year.", "Date": "December 21, 2012"}, {"Title": "Great TV for the money", "Author": "Stop Motion Maniac \"Elroy Jetson\"", "ReviewID": "R3PLGYBRLE0ZNO", "Overall": "5.0", "Content": "I was a little hesitant at first to buy this tv because of what some people said about the sound. I bought it for my bedroom, and the distance from my headboard to the tv screen is roughly 12 feet, and I have absolutely no problem hearing the volume. In fact...I'm only able to turn it up about 1/20th of the way because it becomes extremely loud. So, I really don't know what to say about the reviews in which the sound seems to be an issue. I had also done some research online before buying this, and one article I found online was a primer for what to pay for and what not to pay for when buying a television. The article said not to pay extra for 1080, unless you would be viewing the tv very close-up...because the difference was negligible in that author's opinion. The author of that article also said that LED was a better value than LCD because it lasts longer and uses less energy. I wanted to be able to play video games (e.g. Nintendo Gamecube) that used component cables (rca) in addition to ones that used the hdmi/digital. This tv is able to accommodate both. I was also worried about 22 inches not being big enough for me to play games in which I need to read text...and again, no problems. The picture is so clear that I'm able to read subtitles on movies, and text in video games with absolutely no problem. And did I mention that the picture is gorgeous? Has absolutely no problem handling blacks or reds. I love this tv. I highly recommend it", "Date": "December 4, 2011"}, {"Title": "Bang for the Buck!", "Author": "V", "ReviewID": "R3BRV6XAZB9WJF", "Overall": "5.0", "Content": "Arrived fast and packaged well. Picture quality is normal, crisp and clear. If you plan on it sitting on top of anything tall, make sure your line of sight is also. Remember this is a LCD and we had to buy a VESA wall mount in order to tilt at a lower viewing angle.Sound quality is good, not surround sound by any means, but satisfied for our bedroom TV.Plugged it in, hooked up the cable, HDMI insert is a plus, even came with batteries for the remote, scanned the channels and it performed as described.All the ports you'll need for your bedroom television. All easily accessible and do not interfere with table top stand or wall mount.My only complaint is the TV, while using the stand, does not rotate or swivel to the viewing degree for higher placement.The price was the main factor with todays economy, it blew away any other competitor I compared it to.If you're buying this for the garage, kids' room, or yours, you won't be disappointed with the all around value.AMAZON is way better than eBay any day!", "Date": "March 31, 2011"}, {"Title": "It is good and well worth it", "Author": "C. Church", "ReviewID": "R15YJ7ZYOXXMKS", "Overall": "4.0", "Content": "Bought this TV mostly for gaming so I will place my personal opinion on subjects pertaining to my experience. The 22\" Philips LED LCD HDTV is a great buy. Amazon did wonder with shipping except was not all that excited with the fact that they deliver packages in their original packaging. If the main box was placed in another shipping box I would feel less uneasy with the fact that a the package sat next to my front door in the open with Phillips marketing brands all over the box really giving away that there is a 200 dollar TV sitting on my patio. I prefer discreet shipping:/Ok so Just to start if your a gamer, and your not looking for anything too serious in the category of Hi-def. Then I would recommend this. The size is perfect. A 22\" TV wide is a preferable size for gaming as it allows for the perfect pixel set with out any blurring or distorted images due to the image being stretched out because of large resolution screens ( such as a 42\" TV normally distorts media images on XBox360, not so much for PS3. The refresh rate for this TV was great, no real flickers or nothing that was too noticeable. Overall I was pretty pleased with the screen performance except for the color and brightness. the Color was really hard to tweak and never quite adjusted as I wanted it to be with the brightness very dull and not suited for media that has a lot of shadows with details or objects of attention inside the shadow areas.Image using component cables was standard just less flicker from the slight haze that was probably just from the frequency. HDMI preforms well with quality sound output.Stand alone Sound was very \"echo'd\" on this Model, I really do not think it was designed for quality output so I set up my home theater system on the TV and it was impressive consider Par to my Sony Bravia in sound quality (Interesting how they pack a decent sound environment system into such a small TV).For people that might attempt to use Play station Move on this TV, I would recommend it. You cannot quite get to far away from the screen but if you get too close the PS3 eye system will begin to over compensate movements from the PS3 wand controller.For people that might attempt to use XBox 360 Kinect on this TV. I did not see any issues playing the games that the Kinect Sensor had while on this TV.Overall, this TV preformed well. If my relationship with this product continues to be positive, well I don't see me changing up screens for quite some time(unless Amazon has another huge BLACK FRIDAY again XD).", "Date": "February 26, 2011"}, {"Title": "Nice HDTV", "Author": "tbone", "ReviewID": "R1GCDOZ76ZIMB0", "Overall": "5.0", "Content": "This is my first HDTV. Overall, I think this TV is excellent, with terrific picture quality and great reception.A few points:The TV's standard or default picture settings (and the other presets) are a little too dark and color saturated IMO, so you may need to manually adjust them to get the best picture. The TV comes with a calibrator to help with this but I found I still needed to manually adjust the picture settings.I simply added a little brightness to the picture and lessened the color a little and I also set the color temperature to \"normal\" (it was on \"cool\" by default) and now the picture looks nice. Colors are vivid and calm and the picture is clear. The TV seems to have a good built in tuner/antenna too... my last TV with a digital converter could not get many of the over the air digital HD channels... this TV gets everything.The sound is OK (HDTV's generally don't have great sound) however you really need to either hook the TV up to a stereo or to some powered PC speakers. I bought some very cheap Altec Lansing BXR1220 2.0 speakers and plugged them into the headphone jack and the sound now is really good.The headphone jack seems to be a little tight... I had to push the plug in carefully with strength to get it in all the way.I have Netflix plugged in to the TV using a Roku box with an HDMI plug (the TV has 2 HDMI ports... HDMI is the highest quality connection) and the picture and sound quality is very good.For $190, I think this TV is great value for the money. I recently went to BB to look at all the HDTVs and IMO this TV, especially the picture quality, compares very favorably to models far more expensive.", "Date": "April 29, 2011"}, {"Title": "poor choice", "Author": "aardvark", "ReviewID": "R2PLTQLRT5ZI7V", "Overall": "1.0", "Content": "i've had good luck with Phillips products in the past but, not this one! I had to recheck the product discription to make sure it was an HDTV. The picture quality is that poor. You have to be directly in front and at the same level as the TV for the picture to look like anything. The smart volume does not work properly. You still have to monitor volume level. The remote does not work properly. At first I thought it was a battery issue. So, if you like a poor picture,ajust your volume every time you change the channel, and a remote that you have to push the same button 3 or 4 times before it works! then this is the TV for you...", "Date": "August 12, 2011"}, {"Title": "Good While It Worked", "Author": "Charles", "ReviewID": "RQ9N4H16BI1JX", "Overall": "1.0", "Content": "I've had this television for about a year and a half.  It has worked fine in the time I've had it.  However, I came home the other day and the screen had completely quit working.  I called Phillips and they were nice enough, but told me the warranty is only good for a year.  Hopefully mine was just a fluke, but I'm out over $200.", "Date": "February 13, 2013"}, {"Title": "Worked fine for 18 months, then just died", "Author": "David Beaudoin", "ReviewID": "R180W4NQ2UQQTD", "Overall": "1.0", "Content": "Just like some other reviewers have noted, this set worked great for a little past one year (the warranty period), and then all of a sudden I turned it on and there was a black bar down the middle of the screen, and the picture had switched to negative values.  I'm certain it will cost as much to fix it as it will be to buy a new one, so basically, it's worthless.  I wasted $200.  Won't ever buy a Phillips again.", "Date": "January 1, 2013"}, {"Title": "Average life span.......about 1.5 years", "Author": "Jaime", "ReviewID": "R2JQKRVK3SUZOR", "Overall": "1.0", "Content": "I bought this TV in May 2011. Last night I went to turn it on and there's this big black bar on the left side of the screen and the color has changed to blue, red, and green. I tried checking the wires, unplugging and then it dawned on me that it's the TV and nothing else. I cannot believe a TV under a known brand would die after a year and a half. Of course the warranty has expired, so can't go that route. I checked Amazon and see many complaints of the same issue too. Stay away from this make and model. Buy something else and get an extended warranty too. Lesson learned.", "Date": "December 28, 2012"}, {"Title": "Worked great for 12 months", "Author": "Jbog1883 \"olympus_mons\"", "ReviewID": "R11L1USOTXZ3BP", "Overall": "1.0", "Content": "As usual the manufacturers warranty is 1 year and I bought this TV on December 30, 2010.  It is now January 30, 2012.  The tv worked like a charm the entire time until this morning.  I turned it on and there was a huge black bar down the right side of the screen and the color shifted to negative values.  Philips tech support consisted of \"unplug the unit for 60 seconds.\"  After 60 seconds I plugged it back in, no change.  The response was \"at this point I have determined that the unit is defective and there is nothing we can do but offer you a refurbished one at a discount ($170 after shipping and handling.) or I could take it to a repair center.  POS", "Date": "January 30, 2012"}, {"Title": "A fabulous TV at most amazing price", "Author": "Cook & Collector \"Qualified Foodie\"", "ReviewID": "R2KFR2Z53SH8D", "Overall": "5.0", "Content": "This is a great TV. Wonderful picture, great sound, easy to use and one of the best but last TVs from Philips. Works wonderfully as a computer monitor and doubles as a great security monitor and/or TV. Light weight but, top quality construction. An amazing deal at this price.", "Date": "May 28, 2011"}, {"Title": "Nice little TV for the bedroom", "Author": "Gladstonechick", "ReviewID": "R13BPR473A4C1N", "Overall": "4.0", "Content": "I bought this for my bedroom to replace an old, outdated set.  This little TV was easy to get set up,  has a great picture (even without the HDMI cable), and is exactly what I was looking for.  The only bad thing I can say about it (and why I didn't give it 5 stars) is the sound.  As other reviewers have said, the sound is pretty awful.  However, that was easily solved by plugging in a set of speakers that I had previously hooked up to a computer but were just sitting around gathering dust.  I used another reviewer's handy tip and plugged them into the headphone jack.  With that done, the sound is a thousand percent better, and I am very happy with my purchase.", "Date": "May 9, 2011"}, {"Title": "Great Value For the Price", "Author": "Brett Mathews \"Brett\"", "ReviewID": "RIQW8SUGEA7E4", "Overall": "5.0", "Content": "I'm not sure what the people that wrote bad reviews expect from an LED HD TV under $200. For the price, it is a great value.Yes the sound is not great, but I've had 40+ inch screen HD LCD TVs that didn't have great sound. Most TVs don't have superb sound on their own. That's why you add a receiver, floor speakers, etc. I realize that may not be ideal for a TV of this size, but you can always plug your average $10 computer speakers into the headphone jack on this TV and your sound issue is gone.Great price, great value. If you want something fancier, then spend a LOT more money.", "Date": "May 30, 2011"}, {"Title": "Shortest lifespan of any TV I've ever owned.", "Author": "Michael Graham", "ReviewID": "R2E8N0U2OA4OM7", "Overall": "1.0", "Content": "This TV lasted 2 yrs, 1 mo. and 2 days.  Big black bar on right side - picture had shifted to the left & turned negative (like looking at a film negative). I called Philips, \"Josh\" took all the information down, asked me if it did the same thing on all inputs (it does), then politely told me to throw it away - cost to repair would exceed buying a new one. I stated it was an awful short lifespan for a TV, would they offer some kind of a goodwill discount in purchasing another Philips. \"Josh\" stated a firm no. I replied; based on this incident, I'd never buy another Philips product again. \"Josh\" politely said Ok, and then thanked me for buying Philips - sometimes the script they follow is rather funny! I would not recommend this TV or any Philips product based on my experience.", "Date": "April 5, 2013"}, {"Title": "Best option, for what I wanted", "Author": "Mike R.", "ReviewID": "R20YK7S3YRDCPP", "Overall": "5.0", "Content": "This television was the best option for what I was looking for, regarding a new television.LED, as eco-friendly as possible, not bulky, very movable, great sound/ video, AND (of coarse) great price.Unfortunately, we live in a high-consumption society. However, as a fellow consumer, this t.v. is probably a better option than most.", "Date": "December 13, 2011"}, {"Title": "Old vs New", "Author": "REB", "ReviewID": "R27V7HW3XFJ20V", "Overall": "3.0", "Content": "The old TV that I replaced was of course, not quite as nice as this one. I figured that I already have a 51\" Phillips plasma that I am satified with so I would just get another for the second TV. The picture is good but as others have commented the sound is like a speaker that is turned against the wall. I guess it's cause the speaker is in the back? I will try a pair of USB speakers and see if makes it any better?", "Date": "December 7, 2011"}, {"Title": "PERFECT!!!", "Author": "C. CATARASO \"Design nut\"", "ReviewID": "R16PMPRMTCMTBO", "Overall": "4.0", "Content": "I was skeptical about purchasing a television online..WELL..I'm VERY GLAD I did..Amazon did me good,price was terrific (deep discount.I'm one of those people that cant see spending 4000$ on a television when there's always something NEW around the block .This size 22\" is PERFECT for my studio here..just right size and thickness as to NOT be first thing you see as you walk in ...BEST of all is that I can also use television as my Monitor !!!..I used to have a 22\" monitor here (right next to TV on desk- not good)Now all I have to do is change over to PC mode n I'm all set..plus added bonus of more space on desk now. Picture quality is great..My ONLY peeve would have to be the sound of speakers on TV..I wish it was better quality I just feel its missing something when in HDMI mode..I have JBL multimedia speakers for my PC and when I watch a movie or watch music videos thru system sound is MUCH BETTER and has a richness and depth..Great buy for $$$", "Date": "October 31, 2011"}, {"Title": "GREAT VALUE", "Author": "Robert Lum \"PhotoBob\"", "ReviewID": "RN3JG2W1Y8LNM", "Overall": "4.0", "Content": "THE SET IS A GREAT VALUE AND HAS A VERY GOOD PICTURE. THE ONLY SHORTCOMING IS THE INEFFECTIVE AUTO SOUND LEVEL SETTING.", "Date": "May 1, 2011"}, {"Title": "Great picture, poor sound", "Author": "Robert J. Medvetz", "ReviewID": "R3QZLOWWZFOMCE", "Overall": "4.0", "Content": "Really good value.  Great picture, but the sound is a little disappointing.  Sets up quick and easy.  Can't beat it for the price.", "Date": "April 29, 2011"}, {"Title": "Questionable HD", "Author": "MTBrider", "ReviewID": "R3F6UVVM7V3GX1", "Overall": "2.0", "Content": "I would honestly compare the picture quality of this TV to SD not HD.  I have a 32\" 720p tv that I have had for 5 years and this Philips 22\" makes my 32\" look like it is 1080p.  I would recomend looking for another TV.", "Date": "March 29, 2011"}, {"Title": "disappointed...", "Author": "steveh", "ReviewID": "R1BWPKPLK1HZN8", "Overall": "1.0", "Content": "As several other reviwers have stated, my 22\" Philips set has failed also after approximately 1.5 years. Turned it on one evening and two wide vertical bars on left side of screen with washed-out picture in remaining area, that darkens somewhat after some time, but looks like a negative exposure most of the time. This was my newest of 4 flat screens, and first to fail. I say \"Nyet\" to Philips from now on...too bad. Built-in obsolesence???", "Date": "April 25, 2013"}, {"Title": "same as everyone tv just turned blue", "Author": "A. See", "ReviewID": "R13IHSSGK542R4", "Overall": "1.0", "Content": "Can't believe this happened had it for about a year and a half and it broke wow!  what crap, the screen is blue and red. when you see a person on the screen they have a black face and blue eyes. went to turn on the tv and it just happened out of no where. so sad", "Date": "April 4, 2013"}, {"Title": "Sudden Death after 1.5 years!", "Author": "Ms. Wysteria", "ReviewID": "RD1GOZ31A6F0", "Overall": "1.0", "Content": "Yeah, just like the others...mine died too after 1 year and 8 months.  Guess I got a few more months than average cuz I'm single and don't watch much.  Turned it on and multicolor vertical bands over the screen.  I seriously doubt I'll consider Phillips again, I thought they were a trustworthy company.  Good TV until its sudden death.", "Date": "March 9, 2013"}, {"Title": "Worked for just over a year, then broke", "Author": "Ben Foster", "ReviewID": "RAZRI8DD411VZ", "Overall": "2.0", "Content": "I bought this TV in September of 2011 and it worked great up until December of 2012. The warranty provided by Philips is exactly one year.The screen shows inverted colors and a 4\" black bar down the left side of the screen. Spend the extra money and get a nicer TV that will last you some time.", "Date": "December 18, 2012"}, {"Title": "This TV is a piece of CRAP!", "Author": "Sharon W", "ReviewID": "R20S0KDI7FZFUE", "Overall": "1.0", "Content": "The picture suddenly went out after just 14 months, so no longer under warrenty.  We will NEVER buy this brand again!", "Date": "December 10, 2012"}, {"Title": "Beautiful Performance ... For Six Months.", "Author": "mykulonly", "ReviewID": "R1LRTRLX1YZ8W0", "Overall": "1.0", "Content": "I have owned this TV since April 2011 - never a problem, great picture, great sound, I loved it.  Just a few weeks ago, I came home and turned it on.  I have colored vertical lines on 3/4 of the screen and a black bar on the left side.  Sound is sporadic.  I unplugged everything - still same screen.  I called my cable company to troubleshoot - it wasn't the cable (other TV works fine).  I called Philips - ZERO idea about what happened, only that it's out of warranty and I have to take it to a repair shop.Ridiculous.  Looking online to try and troubleshoot with a little desktop research, I'm seeing that there are plenty of occurrences of this with Philips sets and that it is a main driver board issue.  A TV should last a good 5-7 years.  Hell, I'd take 3 years.So disappointing if only because it's such a stereotypical buyer-related issue: something works fine until the warranty expires, then breaks.I will never buy a Philips product again.  This is the kind of thing that really turns me off abut a brand.", "Date": "November 19, 2012"}, {"Title": "Worked for 15 Months", "Author": "Tommy", "ReviewID": "R1LNW3D6MPEQL3", "Overall": "1.0", "Content": "The picture on this TV had been sharp and crisp. Then I turned it on today, and there is a solid black bar down the right side. Reading other reviews, I'm not the first to have this happen.", "Date": "September 12, 2012"}, {"Title": "Note on VESA mount", "Author": "Kent Corbell", "ReviewID": "R35LKRHWA3GQPN", "Overall": "3.0", "Content": "FYI - the power connection is about 3\" directly below the line of the VESA mounting holes on one side.  So only mounts with small square plate connections will work.  Adjustable mounts with longer vertical rails for universal adjustability won't work.", "Date": "January 30, 2012"}, {"Title": "Happy camper", "Author": "Stiggles", "ReviewID": "R2UEFG7TRS3XN1", "Overall": "5.0", "Content": "Excellent picture quality and sound. Easy to hook up with my cable box, and compatible with my universal remote. Very happy.", "Date": "October 13, 2011"}, {"Title": "VERY HAPPY", "Author": "robert", "ReviewID": "R39CZ8RROD0D40", "Overall": "5.0", "Content": "Over the past year I have purchased 3 of these tv\"s. They all work great, I have them hooked to a standard HD roof top antenna and am pulling a signal from 70 miles away... perfect picture.", "Date": "October 7, 2011"}, {"Title": "Ps3", "Author": "Angry Zach", "ReviewID": "R27UA4WBB14LTW", "Overall": "5.0", "Content": "4 a small tv it's a good 1 hi plugmy ps3 into it and it looks great the sound is great that has plenty of inputs", "Date": "September 24, 2011"}, {"Title": "Fun little tv!", "Author": "whit", "ReviewID": "R194SZSDIQ60XR", "Overall": "4.0", "Content": "I really like this tv! I originally had a \"32 inch\" tv (but it wasn't really because of all the stuff around the screen). This is a true 22\" tv. It might not sound big but I think for a smaller bedroom or tv room this is the perfect tv. The sound is nothing to brag about and I think that's unfortunate in this otherwise amazing tv. I opted for hooking up speakers to it and that fixed the problem. So unless you feel buying speakers would be too much of a hassle or money then perhaps buy another tv that has amazing sound. I feel like for the price you won't get anything better.", "Date": "September 14, 2011"}, {"Title": "Great Little TV!", "Author": "L. Stark \"starks8111\"", "ReviewID": "R5KR6V4YN74R3", "Overall": "5.0", "Content": "This little TV is awesome and fits perfectly up on my dresser....still debating whether I want to hang it on the wall! I had an older Sanyo 17\" and was holding out to get one of these as a grad. present and I dont know why I didnt get it sooner! The price was great, the TV is great, and another cool thing: It doubles as a computer monitor! :) Get your's today!!", "Date": "September 4, 2011"}, {"Title": "Decent small TV", "Author": "David A. Elliott Jr. \"Record & CD collector\"", "ReviewID": "RNZ5880VV56LU", "Overall": "5.0", "Content": "Overall I'm satisfied with this TV. Its flat screen & light weight sure beats the back breaking heavy TV's of the past. Setting it up was easy. When I hooked it up to the cable it downloaded the channels similar to when you download something on your computer. I get some channels I don't get on my other 2 old fashioned TV's like channel 12.2 for example. It sounds great as I've got it hooked up to my stereo equipment. I have only one minor complaint. Sometimes it is hard to turn it off with the remote. Sometimes when I turn it off with the remote, I think it's turned off but then it suddenly turns on again. Apparently you've got to aim the remote just right at the TV. Also when you turn it on, there is a screen that says \"Philips\" for a couple seconds before going directly to whatever's on. I've never seen a TV like that. I like that the remote has a feature that lets you jump back to the channel you were watching before, as I like to watch other channels when commercials come on. So far I think it's a good small TV at a good price.", "Date": "August 30, 2011"}, {"Title": "Finding what I wanted", "Author": "Barbara", "ReviewID": "RVL2VM59WE18C", "Overall": "5.0", "Content": "I was happy to find what I wanted at the price I could afford--shipping was fast and everything came for ease of use. Thank you", "Date": "August 12, 2011"}, {"Title": "The Little HD TV that could!", "Author": "ACM", "ReviewID": "R2HXU6O872CQK6", "Overall": "5.0", "Content": "Excellent little TV; easy to carry from stoop, to stairs, to stand; package protection and materials just right for size of TV; you don't have to fumble through tons of plastic, cardboard, tape or ties.Recommend this TV highly for *small* areas; vivid colors, sufficient sound and overall grate quality.For $180 bucks, you CANNOT go wrong!  If you want a big-ass TV with all the toys, then you're looking at the wrong model and the wrong price point.", "Date": "August 10, 2011"}, {"Title": "Excellent Value in a small TV", "Author": "Great Faulkner's Ghost", "ReviewID": "R23PQ0J9WXVTHP", "Overall": "5.0", "Content": "This is an excellent small TV for the money.  The picture is clear and crisp, especially in high definition using the HDMI cable from my Comcast box. Initially I connected it up through the RCA/composite video, and while that was acceptable, I do recommend the HDMI cable for the best picture quality and aspect ratio adjustment. Since the HDMI cable is not included in the box, I recommend you buy one from Amazon when you purchase the TV (the cost is about $3 for a 6 foot cable.). I found the picture to be consistent from various viewing angles from side to side as well as up and down, which is quite helpful if you're going to be mounting it on top of a shelf or in a high bureau in your bedroom. The sound, as many have commented, is barely adequate, but since I use the TV primarily for watching the news as opposed to movies or music videos etc., it really doesn't matter to me. Regardless, I do recommend that you tweak the sound using the menu control, as the out of box sound is quite tinny and overly biased towards treble. You will also want to tweak the out-of-the-box picture to your taste using the menu controls. The TV has a built-in color, brightness, and contrast setup protocol, which I found pretty illogical and basically useless. (It ask you to choose which side of the provided test picture you like better, but since the two sides of the picture are not identical, it was pretty confusing to me.) I would give the color fidelity only an  average grade. Skin tones are rather coppery, and there is a slightly digital sheen to the overall color rendition. But that's a pretty minor quibble on a TV that is so reasonably priced, and I'm quite happy with it.", "Date": "August 5, 2011"}, {"Title": "Great TV for the price", "Author": "J. Morales", "ReviewID": "R2BVFBVGPG4I7I", "Overall": "4.0", "Content": "So far I really like the TV. It's a perfect size for a small bedroom. The picture is beautiful, all though not 1080p. The sound isn't the greatest but it's not as bad as I read some people say it is. You just have to turn it up and it is a very clear stereo sound. It's very easy to setup. You put it on the stand, put 2 screws in that come with the tv, and turn it on. In the setup, there is a picture setup where they show you 5 pairs of pictures and you choose which one looks the best out of each pair. That adjusts the color and brightness to your liking.Overall, for $180, you can't go wrong. I will update this if any problems occur.", "Date": "July 30, 2011"}, {"Title": "NIce picture but speakers are on the back", "Author": "Douglas C. Williams", "ReviewID": "RWTTY9AAL8N2A", "Overall": "3.0", "Content": "I bought this to sit on a bar counter.  It is attractive and functionsl.Negatives:speakers are on the back so the sound all goes away from you.  The result is a slow echo hard to hear sound.  I should have bought a tv with speakers on the front.  I may need to return it.  Also the channel set up took forever, like ten minutes.  Others I have had can do it in about two min.Finally the remote has numbers that are hard to see.  Too black.", "Date": "July 29, 2011"}, {"Title": "Great TV", "Author": "RatingItWright", "ReviewID": "R216JT5OK79CVQ", "Overall": "5.0", "Content": "I'm enjoying my new TV.  I don't have any issues with it at all.  Full disclosure - I do have small computer speakers plugged in so I can't honestly evaluate the TV speakers, but mine sounds great.  I have no complaints and I'm happy with my purchase.", "Date": "July 9, 2011"}, {"Title": "Phillips is getting better.", "Author": "I8UNtheV", "ReviewID": "R20B7Y4IJ62EDO", "Overall": "4.0", "Content": "I really didn't care for their plasma's and LCD's around 2006 to 2009. Cheap Build and Feel as well as short life span. I know they were out sourcing some of their TV's to Sansui which I don't care for period. But I believe who ever is making these (if it actually is Philips or not) they have a good product here. The speakers aren't that great but don't expect it from any Slim LCD or LED. But it looks nice and seems like better craftsmanship. The screen is good and bright and easy to use. I like mine and I think you will enjoy yours too.", "Date": "July 7, 2011"}, {"Title": "Philips 22\" LED/LCD/HDTV", "Author": "drivethecar", "ReviewID": "RVY65785LCXPD", "Overall": "5.0", "Content": "product is a great and a terrific value: operates well and is easy to use, good looking, easy to set up, format for picture and audio gives you lots of options to suit your taste- only 4 stars on the audio because its a 22\" and this size never has the slamming audio that a larger tv has-- but-- i do not use surround sound, so with that option, i'm sure it would be fantastic, too. buy it.", "Date": "July 6, 2011"}, {"Title": "Great little TV, especially for the price", "Author": "A. Purvis \"chinsbob\"", "ReviewID": "R9U8D4UT0BFLS", "Overall": "4.0", "Content": "IMO great little TV for the price.  Can't comment too much on sound quality as I'm hearing impaired and use captions most of the time, but the picture is very good for a little TV.  You do have to get the color adjusted properly before you truly enjoy viewing it, which can take some fiddling.  But the controls are easy to use and intuitive so it's not that big a deal.It also doesn't always handle dark/shadows as well as I would like, which is why I don't give it five stars.  Turning off power save usually helps with that.One more downside is that the viewing angle is not as wide as one could wish...like many of the first LED backlit TV's, it pales around 30 degrees and 160 degrees.  Manufacturers are correcting that problem but it still exists in this item.  But realistically most of us don't sit and watch TV from that angle, anyways, so it's no big.I like that the screen has a tilt feature, which is I guess due to the fact that it's so small and can double as a computer screen.  Since it's a bedside TV, that feature helped me.For the price vs. quality I highly recommend this little TV.  I had to return the one I bought from Amazon b/c someone gave me another as a gift after I showed it to them and told them I wanted it (they didn't know I broke down and bought it for myself), but I still own the unit and am just as pleased with the second as I was with the first.", "Date": "July 5, 2011"}, {"Title": "Good buy and led too", "Author": "John Bernstein II", "ReviewID": "R6DJHAWL4P0IC", "Overall": "5.0", "Content": "Very good buy for extra small tv. Led light source for long life. I bought a second one three weeks later.", "Date": "July 3, 2011"}, {"Title": "Inexpensive little TV", "Author": "Andres F. Guerrero", "ReviewID": "R2DV8E4I6VUX3U", "Overall": "5.0", "Content": "This little TV is just perfect for my bedroom. The picture quality is excellent. The sound quality is okay, but that's what I'd expect to get from a TV like this one. I've been using it for over a week, and so far I'm loving it.", "Date": "July 1, 2011"}, {"Title": "Philips 22PFL4505D/F7 22-Inch 720p LED LCD HDTV", "Author": "Larry J. Holt \"coolgrandpa\"", "ReviewID": "R39PYITQO4W0UG", "Overall": "5.0", "Content": "Bought this TV for the bedroom, so far I have not been disappointed. Crisp clear picture, and looks better than other 720p HD LCD TV's I have viewed! Plays Blu Ray DVD's very well via a PS3 system.Philips 22PFL4505D/F7 22-Inch 720p LED LCD HDTV, Black", "Date": "June 27, 2011"}, {"Title": "A Great Bedroom Set", "Author": "JazzMann \"Jazz-Wine-Sun\"", "ReviewID": "R2YNZO4LKYOR2P", "Overall": "5.0", "Content": "This inexpensive LED-LCD set makes a great little bedroom TV. Picture quality is excellent. Sound quality is good enough when tweeked by the built-in equalizer. Despite some reviews to the contrary the sound quality is decent. If you want Home Theater Suround Sound then invest in speakers and an HT reciever. But who needs that for the bedroom? I've had no issues after a week of use. I'll post again after a couple of months of use.", "Date": "June 19, 2011"}, {"Title": "Nice picture. Audio is fine.", "Author": "S Sasaki", "ReviewID": "RGJ5V7MK1265P", "Overall": "4.0", "Content": "I was weary of tinny audio. But by adjusting the equalizer (very easy) to promote bass and demote treble, it sounds OK.The power cord indeed sticks out about 2 inches so a flush wall-mount is problematic. Even using the stand, if the back of the TV is visible the stiff cord looks a bit odd sticking out like a diving board more than the thickness of the TV. A right-angle cord or bottom-edge plug would have been nice.There is an HDMI on the side and back, other input types are side-only or back-only, so consider which inputs you need so you can plan a tidy cord arrangement.I switch between Comcast cable TV and a combo DVD/VCR. The cable signal is from a DTA which outputs analog Chan 3. I considered a lesser known brand TV but a reviewer noted he could not program his Comcast remote to control that brand. That would have been a nuisance so I went with Philips and the Comcast remote (using code 10037) controls on/off and volume so I can watch TV using just the cable's remote.A minor annoyance is switching between TV and Video to watch a DVD. On my retired analog TV a single button press toggled between TV and EXT. With the Philips I must scroll thru 6 choices (TV, Video, Component, HDMI1, HDMI2, PC). Some TVs with many inputs can be programmed to skip unused inputs to allow one-press toggle between 2 sources. Philips can easily solve this and I was amused to see the TV's software is upgrade-able via USB - not that they'd bother with this triviality. I received the TV May 2011 and it was loaded with s/w version _101. Per the Philips website, there have been 3 releases since then but they appear to deal with bugs rather than enhancements.", "Date": "June 8, 2011"}, {"Title": "Great product for peanuts", "Author": "Malcolm T.", "ReviewID": "R36X0UGH75IGWX", "Overall": "5.0", "Content": "I bought this product with some trepidation after reading some of the reviews, but I couldn't resist the price.  I found that the product set up easily and although I'm still fine tuning the picture parameters it is functioning beautifully.  Just a word about sound which I gave 5 stars, that is a rating of what is, not what you would like to have if it were a rack system worth thousands.  The case of the TV is small and thin and the speakers had to fit, they do with all of the limitations that forces.  I'm in my seventies, and although I spent a career in Marine Corps aviation flying a variety of aircraft including helicopters, I did not indulge in listening to acid rock with the sound so high that the vibrations could be felt in the next town so I find the sound level from my viewing postion, 15' away, is fine with the volume in the mid range.  The speakers will not be used to enjoy chamber music as they do have limitaions but seem to be fine for the news, sports and the occassional movie when I'm baking.  If this is to be your only set then I would still buy it and add some larger speakers with better range for additional enjoyment.I might not have made this purchase had it not been for the discussion with your employee Jacob, in customer service who was very helpful, you have great staff.  I promised him the review so here it is, Jacob go for it.Satisfied customer.", "Date": "June 5, 2011"}, {"Title": "DONT LISTEN TO BAD REVIEWS...", "Author": "Rafael J. Lovera", "ReviewID": "RBLD4N0XWS5XG", "Overall": "5.0", "Content": "I bought two of these march 27, 2011 for $ 180 each... I have got to say for $180 an slim tv is not bad.... easy to run, bought them with the articulating wall mount and is great, sound is good not a disco but is loud enough, the picture es awesome in any angle... i just love it.... although im confused if it is led or lcd the tv says led lcd wich it does not make sence to me i have a led tv and is says led but whatever, You wanna get this tv, DO IT IS WORTH IT !!! AT LEAST TO ME IT WAS !!!", "Date": "May 22, 2011"}, {"Title": "Excellent HDTV, I'd Call it a bargain.", "Author": "Chris M \"junk250\"", "ReviewID": "RHVMO4OAF6L0S", "Overall": "5.0", "Content": "REAL nice TV, good reception, Awesome picture.Sound is not great, but is much better than other other Tv's in its price range and sufficient for a tv, you can easily add powered speakers for better sound.Great tuner, very good sound, And awesome clarity/color.Beats the heck out of the other \"cheap tv's\" that are sold in the local BigBox store by far.A BARGAIN for a nice TV, and they don't stock these in the local wally stores.Go with the Philips !!!Great Amazon service too, fast ship and you can get an excellent 3 year extended warranty cheap also.I got the 22\" (Amazon $188.00 I think, with free ship + 27.00 for excellent 3 yr warranty), and its picture size seems comparable to other 26\" screens, a different ratio I guess, but the 22\" Philips gets a great(large)full screen pic in HDTV.Highly recommended !", "Date": "April 19, 2011"}, {"Title": "Great Little TV!", "Author": "Nelson", "ReviewID": "R2ZVMJQCOW8OJG", "Overall": "4.0", "Content": "This is a great addition to our home.  I was searching for a smaller tv to replace the 19\" CRT we had in our bedroom that just gave up on us.  I wanted a flat screen with HD and this turned out to be a wonderful fix.  At the $190 price point and with free shipping with Amazon Prime I was sold.  Installation was quick and the TV prompts you during set up so it was a breeze.  Image clarity is excellent in HD.  It's sleek and unobtrusive as far as form goes.  Not too much fuss.  I only have two minor items against this TV, but I \"Macgyver\" remedied them myself.  The first is, there are only 2 HDMI inputs.  I loaded my cable box into one and my Western Digital Medial player onto the other for my video playback.  My BlueRay player went into the RCAs onto the back.  Not my preferred choice, but I'll eventually get an HDMI splitter to fix that situation.  The other item is that the onboard stereo speakers are crap, but what do you expect from a 22\" TV, and there is only a digital audio out on the back which doesn't fare well for your typical bedroom set up, especially when you like to watch movies and have decent sound even in the bedroom.  I jimmy-rigged a pair of so-so computer speakers I had laying around into the headphones jack and voila...problem solved.Bottom line, for an excellent TV in a small room set up, you can't go wrong with this hot ticket TV.  The HD quality and unobtrusiveness of the tv's design more than make up for it's lack of audio punch.Like.", "Date": "April 15, 2011"}, {"Title": "Good tv, great price", "Author": "Sampson", "ReviewID": "RTYMBOKZEXP10", "Overall": "5.0", "Content": "This was a great decision to buy this tv. This is a good quality product, I would recommend buying this.", "Date": "March 28, 2011"}, {"Title": "simple to use, no doo-dads to get in the way", "Author": "MMW", "ReviewID": "R29WCOZICGTV5O", "Overall": "5.0", "Content": "Was purchased for my 90 year old aunt who was having loads of trouble with her universal remote(s).  Seems she'd get it out of programming easily.  This TV has a remote for the product it was meant for.  I haven't heard of Aggie having problems, yet.  Took it out of the box, followed easy to understand instructions and had it working and programmed in about 15 minutes. I'm not a whiz, myself at 70, but am satisfied with the results.", "Date": "February 20, 2011"}, {"Title": "Perfect Bedroom HDTV", "Author": "j. aikman", "ReviewID": "R1HFQ4M4W6NHHU", "Overall": "5.0", "Content": "This Philips tv is perfect for the bedroom.  Not too big and not too small.  Set up in less than 10 minutes with adding a flat antenna for the digital signals and have my Philips DVD Player hooked up to it also.  The sound wasn't that great so I bought a set of speakers for 25 bucks and the sound is now perfect. They are 20w and plug right into the earphone jack.  Speakers and sub were off brand names but it does the trick so why spend extra for a name?.  Anyone in need of a bedroom TV should get one like this--you won't be disappointed.  So, yes, I would recommend this to a friend.", "Date": "March 27, 2011"}, {"Title": "22\" TV", "Author": "Lawrence", "ReviewID": "R187UEQROFMQHX", "Overall": "3.0", "Content": "The sound is not very loud. The picture is only good if you are directly in front of the TV. Any angle and the picture darkens and blurs considerably.", "Date": "May 11, 2011"}, {"Title": "Broke after a 1 year and 2 months", "Author": "Julio", "ReviewID": "R2LQT1ZZSGK26Y", "Overall": "1.0", "Content": "I bought this TV and used for 1 year and 2 months... and doesnt work anymore! Just turn on for few seconds and shut down.... Never going to buy Philips TV again... I have one 55 LED 3D Samsung... one 40 LCD Samsung, all of them working fine!!! Now I bought a new LG 22 LED TV, and need one more... and for sure is not going to be Philips....", "Date": "February 15, 2013"}, {"Title": "Phillips LCD Television 22in", "Author": "Donna Coleman \"project lady\"", "ReviewID": "R28T4OAON24MMZ", "Overall": "5.0", "Content": "I ordered two of these , one for me and one for my sister, and we couldn't be more pleased. Easy to set up and has a clear, sharp picture. I  would reccomend this to everyone in the market for a new tv.", "Date": "July 7, 2011"}, {"Title": "The tilt stand", "Author": "Clarence Shaddix", "ReviewID": "R2K7EKXXSS4AWC", "Overall": "3.0", "Content": "The tilt part of the TV does not go far enuff either way.  You have to be right in front of it to correctly view it..  The color and picture becomes distorted (darker)if your viewing it from above or below..... I have tried to rememdy that problem but to no avail......", "Date": "June 23, 2011"}, {"Title": "Great Picture", "Author": "Elena Morra", "ReviewID": "R21867SXHPENNC", "Overall": "4.0", "Content": "The LED is super crisp. The only thing slightly annoying is that it takes a few seconds for the picture to come  on when you turn the set on. I definitely recommend.", "Date": "March 30, 2011"}, {"Title": "GREAT QUALITY TV", "Author": "James L. Thompson \"jlt56\"", "ReviewID": "R32339FNC756XY", "Overall": "5.0", "Content": "I have owned this set for a good long time now, and it has not let me down in any respect. It has performed very well, and has a great picture. I watch it at night before going to sleep. Very much so would recommend to others.", "Date": "June 4, 2014"}, {"Title": "Will not buy another Philips TV", "Author": "Caleb", "ReviewID": "R32N6RX6ATD78M", "Overall": "1.0", "Content": "As many others have stated, this TV worked (under very limited use) for about 2 years then suddenly started displaying only half the screen in negative. The issue seems to be with the T-Con board, which is a critical component -- the unit is now junk.I will not buy another Philips!", "Date": "June 2, 2014"}, {"Title": "so-so television", "Author": "Nick Sargent", "ReviewID": "R3RA7YMWQG64PX", "Overall": "3.0", "Content": "Audio is extremely low. Other reviews stated as such, so be forewarned. It also seems to not like the HDMI ports. I often lose video when turning on the TV and I have to switch inputs. Also the tint is very dark, even after making adjustments. All-in-all it's a decent television. Works for what I need, but don't expect top quality, or near top quality.", "Date": "May 11, 2014"}, {"Title": "Electronics is failing", "Author": "ZBatia \"cyber teacher\"", "ReviewID": "R15RWEOTVHJO50", "Overall": "2.0", "Content": "It used to be nice TV. After about 1.2 years, the white vertical line appeared on the right side of the screen at about 1.5\" from the corner. No adjustments could remove the line. I had to replace it with Samsung. Not recommended.", "Date": "April 21, 2014"}, {"Title": "Still going strong", "Author": "star", "ReviewID": "RCVIPO8R4YEBA", "Overall": "5.0", "Content": "This Phillips TV is still going strong.  The color is beautiful, worth every penny I paid.  Would recommend this product to anyone.  Some people have complained about the volume, but for the bedroom, I don't need a loud TV.", "Date": "April 6, 2014"}, {"Title": "Extremely dissapointed", "Author": "Mark Pastrnak", "ReviewID": "R1WOCAE0TLBOEQ", "Overall": "1.0", "Content": "I bought this tv as a cheap bedroom display. Have been dissapointed in this tv since buying and wont buy Phillips anymore.Issues:Bright LED light that indicates power shines directly at you on the front of the TV. very distracting, especially when trying to watch TV in a dark roomColour saturation is extremely poor. Without fiddling with the colour controls, you will have an extremely uneven, and unpleasant viewing experience, featuring extremely dark scenes and colour oversaturation.Startup time is ridiculous for a tv. TV's shouldn't take longer to boot than a computer! This TV regularly takes up to 30 seconds from pressing power, to the display shows on the screenSometimes the TV just wont start. I have to unplug it from power. give it a minute, then plug it back in, just to get the tv to start!The TV is NOT normal VESA mounting kit compliant. Any normal TV mounting kit will not fit this display. You must use a Computer monitor based VESA mounting kit, since the mounting kit holes will not line up with a standard TV mount kit.I was told by Phillips that there is nothing wrong with my unit and they refused RMA during warranty period. I will never purchase phillips again from this experience. I knew i was buying a cheap TV, but i did not expect it to be this low quality of a device.", "Date": "April 3, 2014"}, {"Title": "DUD", "Author": "Zizerzazz", "ReviewID": "RNLXX0U2R226G", "Overall": "1.0", "Content": "Crapped out 2 months after the warranty expired, used in a vacation home 10 weeks out of the year.  That's pretty pathetic.", "Date": "January 29, 2014"}, {"Title": "Bummer", "Author": "Jim", "ReviewID": "R1EU5MG365LUP3", "Overall": "1.0", "Content": "Packed missing a foam corner (replaced with folded cardboard!?) all lose in box. Should haver not accepted at that point. Then after not connecting through DVI/HDMI form iMac, bummer number two; there's a three. Dang thing has huge white box at left quarter of screen!? oh well. at least the RCA 26 works w/HDMI from the iMac for dual work! cya", "Date": "January 9, 2014"}, {"Title": "Nice little TV", "Author": "Timothy O'mara", "ReviewID": "R3MFY5K3GDF9YQ", "Overall": "3.0", "Content": "Had this in my bedroom for over 2 1/2 years.  Picture is clear and sound is to be expected from these sets.  I have trouble reading the program summaries which makes it annoying when you are trying to choose a program.  Other than that no complaints.  This was a referbish so if it experiences the same problems of just dying one day like some of the other reviews have stated than I have no problem getting a new one.  These sets are getting cheaper everyday so I might actually upgrade next time.", "Date": "January 7, 2014"}, {"Title": "Tv ordered through amazon was good price, but had short life", "Author": "karen mccall", "ReviewID": "R1Y7T920OYXO2W", "Overall": "2.0", "Content": "This tv was nice, while it lasted.  It died after a year. Everything seemed good, my cable guy was not surprised of tvs short life.", "Date": "January 3, 2014"}, {"Title": "Very poor sound and terrible dark pictures", "Author": "NWcaliMOM", "ReviewID": "R2I8GUBBI79M3B", "Overall": "2.0", "Content": "The sound is awful. I've had the T.V. for over a year now and the sound has never been good. It is really bad with low tones especially. My wife and I wince whenever a dark scene comes on the set. I wish I had bought a different model.", "Date": "December 25, 2013"}, {"Title": "PLEASE do not do business with Phillips. This is the worst product they have shat out since the CD-I.", "Author": "Derpatron \"Fuh sho!\"", "ReviewID": "R13VS8UM8ETAV1", "Overall": "1.0", "Content": "This Television went kaput after two and a half years of meager use. I turned it on one day to find the left half of the screen completely black with RGB colors scattered vertically on the other 3/4ths of the screen. Changing the channel, messing with the settings does nothing to fix it.I PLEAD with whomever is thinking about buying this television set to reconsider it. PLEASE do not give Phillips your money. They do not deserve it. This is unacceptable. My mother's 60 year old CRT still works perfectly. This is a disgrace.", "Date": "November 14, 2013"}, {"Title": "Mouse", "Author": "Roslyn Duncan", "ReviewID": "R3N53B79JV6EGF", "Overall": "5.0", "Content": "It's small. I can move it around the house according to the season. The picture is very good,and the sound clear.", "Date": "November 7, 2013"}, {"Title": "Great Picture, but not so much with the sound.", "Author": "Asaad Miller", "ReviewID": "R3DO6AUWBDH6RP", "Overall": "2.0", "Content": "So, to start off, the TV worked fine at first, but I believe some of the chip inside was cracked, as the AV ports didn't work, and the sound stopped working a month or so after use. Its been over a year, and I still use it, The pictures great, its a nice design, but the cracked chip inside kind of makes it a hassle to use.", "Date": "October 29, 2013"}, {"Title": "Good Little TV", "Author": "Kevin", "ReviewID": "R2SEHUZIET96PD", "Overall": "4.0", "Content": "The speakers are a little weak, and about 2 months after I bought the TV it died on me but they promptly gave me a free return and shipped me out a new one. Since then it has been 2 years and the TV has held up just fine. It would be different if they didn't send me a free one within a week of when my original died but I am happy with how they responded and am happy with the TV thus far. I got it for a good deal and am happy with my purchase. It has a very nice picture.", "Date": "September 4, 2013"}, {"Title": "Everything great except...", "Author": "harry lime \"3rd\"", "ReviewID": "R25GDZZI2O8KUU", "Overall": "1.0", "Content": "A very good picture, good sound, easy to use and plenty of connections. It died after 18 months of very limited use. Don't take a chance on this model.", "Date": "August 29, 2013"}, {"Title": "Seller does not stand behind its products!", "Author": "Michael St. Clair Lee", "ReviewID": "R1P2P17W0LEPLZ", "Overall": "1.0", "Content": "I purchased this television 11 months ago and it went belly up a week ago. The seller has not stepped forward to stand behind its sales. In fact, Phillips is giving me the royal run around as well. I will avoid this seller like the plague in the future. If they step up and make this good, I will change this review.", "Date": "June 3, 2013"}, {"Title": "Never buy a Philips TV - Failed after 1.5 years", "Author": "Steven Schardein \"DigitalChumps.com\"", "ReviewID": "R1EQYVFVLFTI53", "Overall": "1.0", "Content": "These televisions are clearly defective.  There are numerous reports of Philips TVs failing after just 1.5 years of life -- a terribly short lifespan for a television, conveniently just outside of the product's warranty period.  The symptoms are nearly always the same: a large, black bar down one side of the TV, and negative colors across the entire panel.It is a panel-level issue that would require a replacement of what is essentially the heart of the television to fix.  Quite frankly, these are cheap products and Philips should be ashamed to have their brand attached to them.  Taken in conjunction with other unacceptable problems with the brand in other products (such as LED Christmas lights) and their terrible customer service, I am seriously disappointed.  It will be the final Philips product our family purchases in my lifetime.I recommend you look elsewhere.  Anything else on the market is better.", "Date": "May 21, 2013"}, {"Title": "Pretty good deal", "Author": "Eileen Tomasello", "ReviewID": "R2G9O0GLTG4DK5", "Overall": "4.0", "Content": "I bought this in the blind because we had just bought a beautiful Samsung so I decided I should have a little TV for my sewing room.  The only problem is the LCD part - You have to be looking at the screen straight on or the picture becomes compromised.", "Date": "March 9, 2013"}, {"Title": "Worked great for me.", "Author": "Jerry Mobley", "ReviewID": "RNL4QLSM2M3BH", "Overall": "5.0", "Content": "Have, had no issues, bright screen, big enough for my uses, use as a computer monitor, and occasional game. Selah.", "Date": "February 3, 2013"}, {"Title": "perfect for a dorm", "Author": "tes", "ReviewID": "R26XZEG3GZ0N7V", "Overall": "5.0", "Content": "Great small TV - excellent HD picture, perfect for casual gaming and watching TV or movies by yourself or with 1 or 2 or 3 other people.", "Date": "December 19, 2012"}, {"Title": "great tv", "Author": "Jerry G", "ReviewID": "R2IP9UVWVG3OWJ", "Overall": "5.0", "Content": "nice size,picture,sound great set for small room...i like to keep comment short and sweet i dont know why these reviews have a minimum they should have a max instead", "Date": "November 14, 2012"}, {"Title": "8 month TV", "Author": "Beth", "ReviewID": "R1FXOSM1ETLC4K", "Overall": "1.0", "Content": "Bought this at target, worked nice for about 8 months.  It's a pretty little waste of about $200, you get what you pay for I guess.", "Date": "October 6, 2012"}, {"Title": "Bought this to use as a PC Monitor and XBOX 360", "Author": "electronicnut", "ReviewID": "R3VFBP5Z6OJ1H2", "Overall": "3.0", "Content": "I bought this to use as a monitor and XBOX 360.  I was tight on space so I needed a decent size monitor / HD TV and this fit the bill perfectly.  It's 720P so it works great with my XBOX 360 and since I'm also using a Hauppauge HD PVR; I wasn't too sad that it wasn't 1080P.The XBOX 360 displays great, but when I used the monitor display, it's just ok.  I compared it to my plain 17inch monitor and noticed that the 17inch monitor was more crisp and the text was more sharp.  So if you're using this as a monitor as well, you may be a little disappointed in the quality.The sound is something that is lacking as other reviewers have mentioned.  You will need to buy external speakers to get better sounds.  The sound is considerably soft compared to other TVs and I find that I would have to up my volume to 50/100.  Even at that volume, I found it hard to hear my programs.Overall great display for the XBOX 360.  OK display for the monitor.  Bad speaker volume.  Price when I got it was below $200.  So my rating is 3 out of 5 stars.", "Date": "June 30, 2012"}, {"Title": "Phillips 22\" Television", "Author": "ladycristant", "ReviewID": "R1MMBPER8WRYPE", "Overall": "5.0", "Content": "I have had this for a few months now, and I am as happy with it now as I was when I received it. The only thing I would really say bad about this tv is that it is slow to turn on.  But the color and clarity of sound is really great, which is very important to me. The ability to pick your own close captioning colors is wonderful (I have a hearing problem, and, yes, I wear hearing aids) and the clarity of sound is really greatly appreciated. I rely a lot less on the close captioning.Happy? Yes. A good purchase? Yes. Recommend? Definitely. Change anything? Only the slow turn on. Oh, and delivery? Unbelieveably FAST.  That was wonderful for this tv addicted customer! Kudos to Amazon!!", "Date": "June 18, 2012"}, {"Title": "Do not buy unless you get the warranty.Only lasted 3 months!", "Author": "runnergirl27", "ReviewID": "R3OJQSBZIZZ595", "Overall": "1.0", "Content": "I always buy warranty for all electronics but when I bought this tv for my daughter for Christmas I figured I would chance it.  BAD IDEA!  It no longer works. The picture was never good to begin with but now it has vertical lines running up and down on the screen.  I have no warranty so I am out of luck and what a waste of money!!!! Buy the warranty if you buy this tv.", "Date": "April 2, 2012"}, {"Title": "Works fine, arrived quickly.", "Author": "Dancinqueen", "ReviewID": "R1FD912J3YH4RZ", "Overall": "4.0", "Content": "I got this within about 2 days of ordering.  It's my first HDTV, to replace an older bedroom set - I've seen larger screen HD's and it seems to me those pictures were sharper. But this is really fine for bedroom use - I agree with those who said it wasn't loud enough - the sound could be better, but no big complaints on that, either, I am able to hear it with the volume turned almost all the way up.  I think I got pretty good value for money spent.", "Date": "March 20, 2012"}, {"Title": "GREAT!", "Author": "Trevinator110", "ReviewID": "R315XF26Z0G466", "Overall": "5.0", "Content": "I run a Two monitor to one computer system and this tv makes a really great monitor. As my main monitor it adjusts automatically to your lighting setting best for your eyes and the quality of the picture is excellent. If you want to get this TV for a monitor its a great choice and since its a tv if you dont have speakers you can use the built in speakers on the TV but i dont use them. Highly Recommended for tv or monitor use!", "Date": "March 15, 2012"}, {"Title": "great little tv at a great price", "Author": "gamer2k13", "ReviewID": "R1DV8IFLD3N27S", "Overall": "5.0", "Content": "i bought refurbed and saved a ton!  excellent picture quality (for 720p), clarity and color.  sound a bit tinny at med/high volumes as described by others, but not horrible by any means (typical of tv's this size).  great kitchen tv at a great price!", "Date": "March 7, 2012"}, {"Title": "The looks that never payd off", "Author": "calbertcsc", "ReviewID": "REVY4VQUWAL3D", "Overall": "1.0", "Content": "Well people; I should never buy again serious things like TV Sets online, first time ever in my life I bought a TV 22\" and it only lasted one month roughly. Well? Are we drunk? I wasn't happy in the first place for the quality of the picture. I've adjusted many times, no truly change despite I had all the cable technology had to offer at high price. And? this thing lasted only this brief time? No, way! Power turns on, very slowly until it doesn't turn on at all! Thanks but no, thanks!. Good I don't have to have a total end complete TV in my bedroom, DVR and everything else. I will save a bundle bye get to bed without any bad habit TV, Philips dear with me you're done! A.A.C.", "Date": "March 1, 2012"}, {"Title": "Not great", "Author": "KrH", "ReviewID": "R2HC0E7D27LXCF", "Overall": "3.0", "Content": "I was looking for an inepensive TV for the kitchen. I guess this does what it issupposed to, but after purchasing some larger HDTVs from other manufacturers, I am disappointed by this one.The sound is VERY tinny and there is no way to adjust it. Also, it takes a long time to come on. This seems to be the case with other Philips HDTVs as well, as I noticed the same thing at a hotel I recently stayed at.If I were to do it over, I would have paid a little bit more for a different brand.", "Date": "February 10, 2012"}, {"Title": "Didn't even last 6 months", "Author": "Kevino", "ReviewID": "RC4CR2UHWCXFN", "Overall": "1.0", "Content": "This TV is lousy. It is not even 6 months old and the screen is broken. Picture getting worse by the day. This is a terrible product!", "Date": "February 10, 2012"}, {"Title": "Excellent little TV", "Author": "Some Amazon Consumer", "ReviewID": "R3DTBND87OWBR4", "Overall": "5.0", "Content": "I have had this TV for a few weeks now and can recommend it.  The picture is excellent, the sound is good, and the setup was easy.  The remote is simple and functional - nothing spectacular, but it is just a remote.  Settings are plentiful, although the default settings worked well for me.  There are plenty of inputs, including one for a PC.  The sound is good - much better than I expected for such a small TV. No additional speakers were needed, although keep in mind the TV is just 2-3 feet away so I don't need the volume turned up very loud. The TV works well as a PC monitor for streamed content or simple tasks but does not have enough vertical lines for more serious applications. The \"on\" light is bright so you might want to cover it.Update September 30, 2012: I almost downgraded the rating because a couple of times the TV would not power on (through the remote or the button on the TV itself). I unplugged the TV for a short while then plugged it back in. This seems to fix the problem. I decided not to change my rating because even though I have never had this kind of problem in a TV before, it was only a couple moments of inconvenience in .5 years of frequent use. (I originally said 1.5 years, which was wrong).Update February 27, 2013: The TV is still working perfectly except for the rare \"won't turn on\" problem.", "Date": "February 8, 2012"}, {"Title": "good for the price", "Author": "Jim", "ReviewID": "R1KZS4CJ53B6L9", "Overall": "4.0", "Content": "I've had this model for 10 months now. It's good for a small room (if you're going to sit more than 6 feet away, get something bigger). Picture quality is fine, but for concerts etc, you're going to want to hook it up to a sound system, which is easy enough to do. It also works fine as a giant monitor once you adjust the screen resolution on your computer.The only glitch is that about once a month, I can't turn it on with either the remote or the power button. Unplugging it and plugging it back in fixed the problem (as suggested in the manual, although I've never had this problem with a TV before).", "Date": "January 28, 2012"}, {"Title": "ANN", "Author": "Ann", "ReviewID": "R37PR3GOOV3OV1", "Overall": "4.0", "Content": "THIS PRODUCT WAS VERY EASY TO HOOK UP . THE SET UP WAS VERY SIMPLE TO FOLLOW.THE PICTURE IS GOOD. ENJOY IT VERY MUCH.", "Date": "January 17, 2012"}, {"Title": "Just an ok tv", "Author": "\"the Dish\"", "ReviewID": "R2H9NHV4NS19HO", "Overall": "3.0", "Content": "I was looking for a small and affordable television for my son's bedroom and this one fit the bill with it being LED, to boot. However, when it came time to install it onto the new wall bracket, I also ordered from Amazon, it wasn't compatible to the this TV. Despite the many configurations the wall bracket has, it still would not mount without covering the cable and DC connections. Which by the way, are very poor locations for them anyway, being so close to the mounting holes on the TV (might want to rethink that one again, Philips).So, instead of returning the TV or the wall bracket. We decided to keep both and put the Philips in the downstairs den and give my son the larger and BETTER, Samsung LCD TV, after discovering the Samsung was compatible with new wall bracket. Besides, all my wife and I watch in that room is Skyangel IPTV anyway.Well, after finally installing both in their new locations. I was impressed with the clarity and detail of picture on the new, smaller Philips LED TV, but I was very displeased with the sound quality, no matter what sound adjustments were made. I mean, it is bad. I'm so glad I didn't throw or give away our last computer's desktop speakers because I'm using them once again for this mediocre set. But, for some reason they will not operate when plugged into the PC audio jack on the back of the Philips. But will with them plugged into the headphone jack on the side of the Philips. Strange I say, very strange.Everything else on this basic and slimline TV I am satisfied with, so far.As for my son, he's extremely happy to get mom & dad's Samsung for his bedroom.Thanks Amazon for keeping someone in our family completely satisfied.", "Date": "January 10, 2012"}, {"Title": "mom is happy", "Author": "wgu1", "ReviewID": "R28I1I8HJG0BQ9", "Overall": "3.0", "Content": "I bought this for my mom to put in her kitchen. She had to buy the converter box a couple of years ago for her old set.  That television set has joined the many in TV heaven now (she does still have it... in the back bedroom.. just sitting there...ugh)I hooked it up and programmed it without issue.  I did try to put it where the other TV was, on top of the fridge.  It fit just fine but you had to be directly in front of it to see the picture without the \"negative effect.\"  I walked around the kitchen and found that the best spot was on the counter...eye level to mom when she's sitting at the table.  I could see the picture in just about every spot in the kitchen when it was positioned here.  The foreground and background are incredibly clear.  Mom's eyesight is not so great and she saw so much of a difference she was speechless for a moment.  I recommend this tele for everyone and everyone's mom too.  Thank you for such a great gift.", "Date": "November 2, 2011"}, {"Title": "nice little TV", "Author": "Ahni \"Light arts\"", "ReviewID": "R3C14DKLEXHYWR", "Overall": "5.0", "Content": "Sweet little TV - it is perfect for my small condo.  Great picture and sound.  No problems what so ever.", "Date": "October 29, 2011"}, {"Title": "Nice TV", "Author": "Margaret Davis", "ReviewID": "RHNYVTX3D2TAQ", "Overall": "5.0", "Content": "I bought this for my office and it serves the purpose.  We have Satellite TV and the only problem is that both remotes must be used.  The Satellite doesn't recognize the Philips remote, so we have to turn the TV off/on with the Direct TV remote, then use the Philips remote from then on.", "Date": "October 24, 2011"}, {"Title": "Phillips 22 inch", "Author": "yvonne", "ReviewID": "R11G8LJYSEMQY6", "Overall": "5.0", "Content": "Bought it as a third tv to use in the sunroom/exercise room. Some channels are sharper than others (could be my own cable reception). Considering price/size/quality, I recommend it highly.", "Date": "October 7, 2011"}, {"Title": "good buy!", "Author": "Carrie", "ReviewID": "ROS1WCGNUX0S6", "Overall": "5.0", "Content": "The t.v IS very nice easy to use. Fits prefect on my sons room. Only thing is sound, could be better.e", "Date": "October 3, 2011"}, {"Title": "Philips LED HDTV 22 Inch", "Author": "KR", "ReviewID": "R10Y8WRY23Y1UI", "Overall": "5.0", "Content": "I bought this TV for my dad to use in his bedroom.  He loves it, the picture quality is great. Would definately buy another Philips LED TV.", "Date": "October 2, 2011"}, {"Title": "Amazing Product!", "Author": "user1912", "ReviewID": "R3BMDZPTEFSC6G", "Overall": "5.0", "Content": "Great Product, great size and performance. The Screen is clear and the product is easy to set up and install. Totally worth my money. I recommend you to buy it", "Date": "September 30, 2011"}, {"Title": "Good TV", "Author": "Tundra Man \"reggie from minn\"", "ReviewID": "R9YGPO32DA9YK", "Overall": "5.0", "Content": "An inexpensive TV that works just fine for our purpose.  Mounted on wall in the laundry room and is watched only occasionally.", "Date": "September 27, 2011"}, {"Title": "Nice bedroom TV", "Author": "James F. Coyne \"Jimdamick\"", "ReviewID": "R9X9YN75UHKOV", "Overall": "4.0", "Content": "i bought this to save space in my son's room. It is just the right size, has a very good picture, but limited audio performance. For good sound, you will need a reciever.", "Date": "September 25, 2011"}, {"Title": "Awesome!", "Author": "John", "ReviewID": "R1OG072JOSD3AX", "Overall": "5.0", "Content": "This was a perfect tv for what I needed it for. If you are looking for a simple Tv for personal use this is it! I use mine for my PS3 and my desktop and it works wonderfully!", "Date": "September 19, 2011"}, {"Title": "Good TV, Minor Tweaks Necessary", "Author": "the1thepwnly", "ReviewID": "R1AW1EJB1IUU5D", "Overall": "4.0", "Content": "Let me start off by saying when I bought this it was on sale for $50 off ($179 total). Received it quick and set it up super fast. Base snaps into the tv and is secured by two screws. Power wire comes off which is awesome for transport and the picture quality is awesome for the price.However, the only problems I had with it is that the start-up every time is slow, super slow. The only other problem I have is that the sound is not that loud or clear. But I knew this going into it reading other reviews. I just bought an aux cord and hooked it up to my guitar amp.", "Date": "September 15, 2011"}, {"Title": "Great picture, \"fair\" sound,miserable electronics", "Author": "Ed from Las Cruces", "ReviewID": "R3T1UUVVXJ90PT", "Overall": "1.0", "Content": "Echoing what other sites have said, I am very happy with the ease of installation and start-up, with the quality of the picture, and am content that, for the price, the sound is adequate but hardly a plus. I use my TV in my workshop which hardly has wonderful acoustics and bought this TV knowing that the reviews ont he sound quality were marginal. Sound is marginal so think hard about where you are going to use it in one's home. I mostly watch talk shows while \"fiddling\" in the shop so this set is fine.Shortly after I bought this unit, I began to notice that the sound would suddenly, and without any action on my part, simply rise to the maximum or fall to its minimum positions. In this case, there was no way to counter the rising or falling volume without turning the set off and restarting. Since then, without any action on my part, the set has begun to change settings from HDMi to PC to the TV channel setting and simply scrolls through these settings. Again, the TV will only correct after turning the power off. In this mode, the set will not respond to either the provided remote or the cable company remote. Also--turning it off so as to allow it to reset, often takes several attempts. Something is radically wrong with the internal electronics and I would strongly suggest that the nature of hte defect will make it not worthwhile to even try a fix. THis is just a poor product with multiple electronic problems and should be avoided--no matter what the price!", "Date": "September 12, 2011"}, {"Title": "Philips 22PFL4505D/F7 22-Inch 720p LED LCD HDTV, Black", "Author": "kwinken", "ReviewID": "R3KQB5DLHMZGQ9", "Overall": "5.0", "Content": "Philips 22PFL4505D/F7 22-Inch 720p LED LCD HDTV, Black Philips 22PFL4505D/F7 22-Inch 720p LED LCD HDTV, BlackWonderful picture, definition and color.", "Date": "September 9, 2011"}, {"Title": "Good as a bedroom TV", "Author": "Reginald D. Garrard \"the G-man\"", "ReviewID": "R33FN5OCJRK952", "Overall": "4.0", "Content": "'Bought this set about six months ago and was initially pleased with the ease of installation.  While the picture is good, it's not up to par with the same-screen-sized Vizio that's in another bedroom.However, for the price and the esay-to-operate menu on the remote, the television performs as an auxiliary set for the bedroom, the children's room, or anywhere that a \"small\" set would be needed.", "Date": "September 7, 2011"}, {"Title": "TV disappoints", "Author": "Kenneth Richter", "ReviewID": "RRGCV96XAQSF0", "Overall": "3.0", "Content": "This TV lacks adequate contrast and takes a long time for picture to appear after being turned on and when changing channels. Its just a bit but when scrolling channels its noticeably slow and irritating. I had a choice of inexpensive 22\" TV's and might have chosen wrong. Would not buy again.", "Date": "September 7, 2011"}, {"Title": "Phillips 22PFL4505D/F7  22-inch 720p LED LCD HDTV Black", "Author": "Mitford Buddyroe", "ReviewID": "R3HVNPPHY3AS2T", "Overall": "5.0", "Content": "I was extremel pleased with my Phillip 22\" HDTV.  It arrived in mint condition within 5 days of placing my order. It was exactly what I was expecting.  I was able to set it up and use it within minutes. The quality is superior to the price I paid.  I haven't seen anything comperable anywhere else. I would buy from this seller again.", "Date": "September 5, 2011"}, {"Title": "GREAT!", "Author": "Jennifer", "ReviewID": "R1JXE4GKUWW05I", "Overall": "5.0", "Content": "Well given this is my first HD tv, I love IT!So wonderful and fun!THANKS PHILLIPS :)I really love digital television -", "Date": "August 28, 2011"}, {"Title": "good bedroom TV", "Author": "CAPT T. RUBENSTEIN", "ReviewID": "R16O05Q79CZMFV", "Overall": "5.0", "Content": "A great TV for a bedroom or kitchen.  Low price and HDMI inlet make this TV a keeper.  Sound is ok not great.  Picture is very good for size.  Overall an 8 out of ten.", "Date": "August 26, 2011"}, {"Title": "Great small TV for Price", "Author": "CMD", "ReviewID": "R3CJRTYOVKTQW6", "Overall": "4.0", "Content": "This is a nice little TV.  You have to remember, for this price and small size TV, you are not going to get the greatest sound or picture.  Both are decent, especially for what most people are going to use this TV.  We put it in our son's room, and it is more then enough for the needs.  This TV is perfect for a kitchen or a bedroom where you are not watching a lot of TV.  Comes with a bunch of features, and has plenty of the different TV inputs.  This TV gets you a good performance for the price.", "Date": "August 22, 2011"}, {"Title": "not bad", "Author": "anthony", "ReviewID": "R123ICRMB3J17O", "Overall": "4.0", "Content": "just received my LCD,LED,HDTV.. it looks beautiful, but i thought when a got the hdmi cable i can get it to 1080p.. nope. but ehh it still looks great. sounds good to! i don't know what everybody else is talking about? its a 22 inch! for a small room! not a huge noisy living room.", "Date": "August 19, 2011"}, {"Title": "Very nice", "Author": "Nick", "ReviewID": "R2E5496D8NH89S", "Overall": "5.0", "Content": "I bought this for my mom for a present, she upgraded from a 13 inch CRT. She really enjoys this TV", "Date": "August 14, 2011"}, {"Title": "Vantastic", "Author": "hillbillygoat", "ReviewID": "R2W268XZYZ7SZS", "Overall": "4.0", "Content": "I bought this TV to put in a Van so I can watch TV while night watching at a coal mine in the middle of nowhere in the beautiful mountains of Ky. It was a perfect pick. Just the right size and great picture. The only problem is the sound is not the greatest.Have to turn it way up to hear the talking while music overpowers you. Adjusted everything. I think because I am use to my Bose surround sound. I would still recommend this TV for a small room.", "Date": "August 8, 2011"}, {"Title": "TV was just what I expected", "Author": "Mr. K \"Reyes\"", "ReviewID": "R2IHZTDHBU6EY0", "Overall": "5.0", "Content": "Everything worked out of the box and packaging was nice.  The TV itself is great and picture quality is descent. I loved everything about this HDTV except for the volume, its not so loud but its good for the small room it went into. Overall I am very satisfied with my purchase.", "Date": "August 8, 2011"}, {"Title": "Good bedroom TV", "Author": "ChloKins", "ReviewID": "RDUWLMKC8GV6T", "Overall": "5.0", "Content": "This is a great little television.  I read a lot of the previous reviews, and even though I saw that the most common complaint was the sound quality, I decided to take my chances.  I'm glad I did.  All I can say is that I just had to be patient and play around with the equalizer until I eventually found a good balance.  Also, this is a small TV - not made to be your family room main TV.  I have this in my master bedroom and it is absolutely perfect for the space. I hooked up a surround sound system to it at first, but decided that I really didn't need it. BUT, if you really do want to have a small TV in your living room or other large room, you will probably want to get a small set of theater speakers to go with it and not rely on the built-in speakers alone.Picture quality is really good. 60Hz refresh rate is not bad for a small TV. I don't have any complaints with the picture.", "Date": "August 4, 2011"}, {"Title": "Quality Product for a Bargain Price", "Author": "Elaine A. Lopez", "ReviewID": "R17Z2CQ5GO1U44", "Overall": "5.0", "Content": "After doing research on price and quality, I ordered this TV from Amazon for $179.00 less my accrued bonus points for a total of $143.96 .  I have been very happy with this decision.  It is easy to install and light enough that even with a bad back I was able to put it into a cabinet space that is above my head.  The body is slim so that the screen comprises most of the width, allowing it to fit into a space that is close to the size of the TV  (my last one had about 4 inches of \"trim\" so that I could only fit a 19\" screen into a space that this 22\" fits nicely.The picture is sharp and the colors are very good.  There are enough settings on the menu that it is easy to adjust the picture to one's liking", "Date": "July 19, 2011"}, {"Title": "Philips 22' for 179 $", "Author": "Karthik", "ReviewID": "R2NOEXXMV2LMTG", "Overall": "5.0", "Content": "It was awesome for the price. You can plug in a flashdrive, HDMI cable,PC,etc. You can't expect more than this for the price. I think the problem is that it takes time when you change the channel and when you switch on the tv", "Date": "July 16, 2011"}, {"Title": "Great Picture, Horrible Sound!", "Author": "Amazon Customer", "ReviewID": "R18Q5L2E5J0XH2", "Overall": "2.0", "Content": "Picture was great, even without HD.  The sound was horrible.  It was very quiet and everything sounded distorted.", "Date": "July 5, 2011"}, {"Title": "Small TV", "Author": "Roy M. Waters \"mikenquincy\"", "ReviewID": "R2AOAKPQDPO92Q", "Overall": "3.0", "Content": "Bought this 22 inch TV for my mother-in-law's small apt bedroom. Wish I had bought a slightly larger set but I think she will get used to its size because it does have a much better image than her old analogue set, though the speaker volume isn't that great. She is a bit hard of hearing so I just have set the volume very high since she is the only one to watch it at night.", "Date": "July 5, 2011"}, {"Title": "audio not so great", "Author": "Kenneth A. Bushey \"hayseed\"", "ReviewID": "R157UT3OF3NOHN", "Overall": "4.0", "Content": "Real crisp and sharp picture, easy remote. Audio is bad so hooked computer speakers to it. Big difference. For the price, good tv.", "Date": "July 4, 2011"}, {"Title": "Very pleased", "Author": "mlc", "ReviewID": "R1LVAMW44VGPDB", "Overall": "5.0", "Content": "Bought this to replace a Vizio in our kitchen that quit working after 6 months. One thing I like about this over the vizio is that setup and the different configurations are done from the remote and not from the buttons on the TV. Picture quality is better, sound is about the same. Would buy again!", "Date": "June 29, 2011"}, {"Title": "Philips 22\" LCD TV", "Author": "Posey", "ReviewID": "R36FUBPNWZKQWC", "Overall": "5.0", "Content": "We ordered this TV for our sons to watch. It has a great picture and fit the space we had available for it. The price was great and we received it quickly.", "Date": "June 27, 2011"}, {"Title": "Nice Resolution", "Author": "Brandon", "ReviewID": "R2GPMFT8QRB1K5", "Overall": "4.0", "Content": "I haven't heard of this tv  having any problems yet. I took it out of the box, followed  understand instructions that were written well enough and had it working and programmed in about 35 minutes. I'm not a strong tech guy, myself but am satisfied with the results. I purchased for my parents who watching a very old tv and didnt want to spend the money on something nice. Seems they are working it prfetty easily. This TV has a remote for the product it was meant for which is important when you have one that is not.", "Date": "June 18, 2011"}, {"Title": "Love it!", "Author": "Holly R Ross", "ReviewID": "R2R7MYFFPNCQ7Q", "Overall": "5.0", "Content": "Perfect size for my daughters room, great picture!  More than I expected for the price.  Paid more for another one and this one is twice the TV the other one is!", "Date": "June 14, 2011"}, {"Title": "Bedroom TV", "Author": "cheviac72", "ReviewID": "R1ZXZFSNUVPNBL", "Overall": "4.0", "Content": "Perfect little TV for the bedroom. Nice picture, sound isn't theatre but its not used as the main AV viewer. The annoying light under the screen is my only negative and can be distracting at times.Would recomend for small spaces and a secondary TV.", "Date": "June 11, 2011"}, {"Title": "Awesome Picture and Easy Set-up", "Author": "Dewymoon", "ReviewID": "R3QLF22KFJKFN8", "Overall": "4.0", "Content": "This set is priced right for a small televison. Setup was a breeze!!! only 5 minutes to watching Direct TV right out of the box... The picture is crisp and clear .... The only drawback is the sound quality ... But with being a small unit it is what it is ... I plan on getting a PC set of higher quality speakers to enhance the sound.", "Date": "June 6, 2011"}, {"Title": "Very Nice TV", "Author": "Fritz Bishop \"The Goo\"", "ReviewID": "R3GEAHCF0RB5W9", "Overall": "4.0", "Content": "Purchased this TV as a secondary TV to watch while we work.  The picture is nice and colorful.  The picture on this TV is far more colorful and bright than my other 22\" HDTV.  The sound is a little tinny, but that's OK.  Every TV this size had a tinny sound, so I expected it.  Otherwise, great TV for a great price.  Love it!", "Date": "June 2, 2011"}, {"Title": "Great little TV", "Author": "Cel", "ReviewID": "R7VVFVU04EDSU", "Overall": "4.0", "Content": "I started with a larger, older tv and was worried i wouldnt see as much when i moved to a smaller screen, But this tv's picture is A lot clearer than i had before. Its doing its job well!", "Date": "May 31, 2011"}, {"Title": "Pretty good, but", "Author": "LovemesomeAmazon", "ReviewID": "R271Q5Q8IQNJRA", "Overall": "4.0", "Content": "This is a pretty darn good tv.Pros: The video quality is great. I own 3 larger HD TV's from 32\" and up. The quality of this one does not disappoint. Changing settings on the tv isn't hard. The size is just fine for my room.Cons: The sound quality of the tv isn't that great. I own some nice external speakers so I just plugged those into the tv and so I bypassed this con. Also, the Tv didn't come with the latest update so I had to install the new one via the usb port. Instructions for that are online. The latest update just fixes a few bugs. I suggest if you buy this tv you do check it out.Conclusion:Although my cons section seems longer, I am very happy with this purchase. I don't know how much difficulty others might have installing the latest update via usb(if they choose to) or using external speakers but for me it was easy so it didn't bother me much. Especially for the price of this TV. You can find the update through philips website.UPDATE 1/4/13I came back to give an update on the TV and Customer service. Unfortunately after about close to a year of use one side of the TV stopped working , luckily since I was still under warranty Philips gladly took my broken TV and sent me a new one with no hassle. All they needed was for me to email them my proof of purchase which thanks to Amazon is quite easy to get. Other than that, my original review still stands.", "Date": "May 30, 2011"}, {"Title": "Great unit for TV or Computer", "Author": "Michael J. Fortster", "ReviewID": "R1WV6NGHWNNNOH", "Overall": "5.0", "Content": "Great TV - easy to get going right out of the box.  I just bought a monitor but wish I bought another one of these instead.  I could switch between TV & the computer (where I use it)as all the inputs are there.", "Date": "May 23, 2011"}, {"Title": "its not full 1080 but its good", "Author": "brock", "ReviewID": "R1HTGZZVOKJKFC", "Overall": "5.0", "Content": "bought this tv so that i can play some PS3 overseas and it does the job the px wants 270 for a 19inch that just seemed crazy to me so i got ahold of this one on amazon and it was cheap so i got it and it works great easy to set up the picture is good and the sound could use a little more work but its a 22inch tv soo what can i expect.. thats why i got headphones!", "Date": "May 15, 2011"}, {"Title": "Exceptional  Quality for the Price", "Author": "John Graydon", "ReviewID": "R1F8EY6K7FDVYU", "Overall": "5.0", "Content": "This is an amazing value.  It fits nicely on my desk.  Readily connected to my comcast cable and has HDMI for blu ray and my computer.  What a deal!", "Date": "May 14, 2011"}, {"Title": "A great bedroom TV", "Author": "John R. Brynteson", "ReviewID": "RZGS6BYUISU5F", "Overall": "5.0", "Content": "Philips 22PFL4505D/F7 22-Inch 720p LED LCD HDTV, BlackI am very happy with this TV which I have installed in the bedroom. The quality is good and the only work I had to do was adjust the brightness, color, tint, etc. to \" personal\" settings as the pre-set ones were good for certain stations and too dark on others.", "Date": "May 6, 2011"}, {"Title": "Great TV for the price", "Author": "Marina Ginos \"margin\"", "ReviewID": "R133CXPW9S8GAR", "Overall": "5.0", "Content": "I love this TV. Right size for a bedroom and it was so easy to install/hook-up. I liked the fact that there was a picture of the hook-ups on the website. It is easier to look at an hook-up, then guess what is what. It was super easy to hook-up and it has every plug I needed and more.Update on the TV. It stopped working 13 months after I purchased it. I guess there is a reason it was so cheap. Very disappointing.", "Date": "April 28, 2011"}, {"Title": "Great TV for the Price", "Author": "John", "ReviewID": "RB9TF96B6M1YU", "Overall": "4.0", "Content": "Overall this is a great TV. The volume is better then other TVs this size. Great picture and easy to use. Only issue is that one of the two HDMI inputs didnt work, other than that. I would recommend this TV for the price.", "Date": "April 21, 2011"}, {"Title": "Best $190 Spent in a Long Time", "Author": "Joe", "ReviewID": "R141SCSYQS65DC", "Overall": "5.0", "Content": "I really had no intention of replacing my 28\" CRT, but when I saw this model on sale at such a low price, I decided to give flat screens a try.  A larger screen wasn't an option for me anyway since I live overseas and needed my friend to bring it down for me, so it needed to be reasonably small.  It survived the shipping and United flight with no damage at all.I've had the TV for 3 or 4 days and have to say that I'm incredibly impressed.  The viewing area is not that much less than my old 28\" CRT TV.  The picture quality is great, the remote is easy to use, it was easy to update the TV's software, it works great with my notebook via HDMI cable to stream internet programs/movies and youtube videos.  Very cool. I won't comment on the audio because I don't listen to the audio through the TV speakers.NOW . . . here's a tip for anybody that might want to connect this TV to a traditional stereo receiver (maybe I'm the only one who would bother since I use this small unit in a small living room)--and if your sound system is NOT home theater and does NOT have any HDMI cable inputs (such as the Yamaha RX-397 receiver):Almost all the traditional (RCA) connections on this TV, including audio, are inputs--not outputs--and you may conclude that there is no way you can get the sound out of the TV and into both your receiver/stereo speakers.  There are two solutions: 1) instead of plugging the cable that you use to connect your MP3 player to your stereo, plug it into the TV's side-mounted headphone jack instead Monster THXIMINI8 THX Certified 1/8 Stereo to Stereo RCA Cable Adapteror 2) connect a similar cable to the TV's single digital sound output (except instead of a 1/8 stereo mini plug, you would have a single RCA plug into the TV). [[RCA Male to Two RCA Male Y-Cable]]With that audio work around, I really have no complaints at all and highly recommend this unit.", "Date": "April 12, 2011"}, {"Title": "Philips 22\" TV", "Author": "george", "ReviewID": "R1KCM0VJAPJL45", "Overall": "4.0", "Content": "Bought this for a bedroom. Just the right size. The picture is good for this size tv. Not as good as my Sony 32\" but then I didn't think it would, but at 1/3 the price I am definately happy with it. The sound is fine for a bedroom with no complaints. Somehow my original order got damaged in transit and was flagged by UPS. I reordered and Amazon gave me $10 off for the delay. Made this purchase even better. Time will tell how it holds up.Update May 2011Well started having trouble with the remote function. I called Phillips and thru some testing determined it was not the remote but internal to the TV. Phillips sent me a new relacement TV and paid return shipping label. Hopefully this one keeps working. I must say working with Phillips was a pleasure. I hope this one stays working because I am thinking of getting another one for my room to replace my CRT TV.", "Date": "April 8, 2011"}, {"Title": "Very nice!", "Author": "Oswaldo J. Gazzaneo", "ReviewID": "R33LYDLC1Z72IM", "Overall": "5.0", "Content": "Bought this TV for use in my kitchen. It is the right size for the small kitchen. The picture is very clear and volume is fine for the kitchen. I would definitely buy the same one again.", "Date": "April 6, 2011"}, {"Title": "Very good LCD tv", "Author": "sarah", "ReviewID": "R2RUE4IBQGYXOJ", "Overall": "5.0", "Content": "fun game very immersive gameplay and graphics are brilliant. get it for nothing from controls are easy to learn and onlnie play is competitive for better players.", "Date": "April 5, 2011"}, {"Title": "Philips 22PFL4505D/F7 22-Inch 720p LED LCD HDTV, Black", "Author": "W. Raisch \"Bill Raisch\"", "ReviewID": "RTPDAW29JP5TY", "Overall": "5.0", "Content": "I've had this TV long enough to use it awhile and I love it! I bought it for my bedroom and it does everything I need a TV for! I've read some reviews saying the sound was not good. What do you want from a 22 inch TV? It sounds just like I would expect a 22 inch TV to sound! Picture is good and for the price, I think it's a great deal! Buy one, you won't be disappointed, unless you really wanted a 50 inch bigscreen with surround sound! LOL!!", "Date": "April 2, 2011"}, {"Title": "Nice TV!!!", "Author": "K. Allen", "ReviewID": "R223U5201SEYIT", "Overall": "5.0", "Content": "I bought this TV for my children's room; they are 4 and 2 years old. I love the performance of this TV. Don't hesitate to buy; a good choice.", "Date": "March 28, 2011"}, {"Title": "Philips 22 inch", "Author": "Adrian Sayers", "ReviewID": "R3UVYO8YN3N61", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1HCC8XWIOWWU9embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1HCC8XWIOWWU9refresh_preplay() {\n\ndocument.getElementById(\"cv_mo1HCC8XWIOWWU9chiDiv\").innerHTML = document.getElementById(\"cv_mo1HCC8XWIOWWU9hiddenPre\").innerHTML;\n};\ncv_mo1HCC8XWIOWWU9refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1HCC8XWIOWWU9so;\t   \n\n\nfunction cv_mo1HCC8XWIOWWU9loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1HCC8XWIOWWU9so = new SWFObject(swfLocation, \"cv_mo1HCC8XWIOWWU9AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1HCC8XWIOWWU9so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1HCC8XWIOWWU9so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1HCC8XWIOWWU9so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1HCC8XWIOWWU9so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1HCC8XWIOWWU9so.setAttribute(\"height\", swfHeight);\n          cv_mo1HCC8XWIOWWU9so.setAttribute(\"width\", swfWidth);\n          cv_mo1HCC8XWIOWWU9so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1HCC8XWIOWWU9so.write(\"cv_mo1HCC8XWIOWWU9flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1HCC8XWIOWWU9', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1HCC8XWIOWWU9';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1HCC8XWIOWWU9', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1HCC8XWIOWWU9loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1HCC8XWIOWWU9\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m17E4A3UW6F78U\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m17E4A3UW6F78U\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3UVYO8YN3N61\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m17E4A3UW6F78U/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1HCC8XWIOWWU9duration')) {\n      document.getElementById('cv_mo1HCC8XWIOWWU9duration').style.display='none';\n    }\n    cv_mo1HCC8XWIOWWU9loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1HCC8XWIOWWU9loadSwf(movieID, playerVersion) {\n   return _cv_mo1HCC8XWIOWWU9loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1HCC8XWIOWWU9newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1HCC8XWIOWWU9', 0, h);\n}\n\nfunction cv_mo1HCC8XWIOWWU9resetPlayer(w,h,bw,cc) {\n  cv_mo1HCC8XWIOWWU9newHeight(h);\n\n  cv_mo1HCC8XWIOWWU9so.addVariable(\"resetBandwidth\", bw);\n  cv_mo1HCC8XWIOWWU9so.addVariable(\"cacheCode\", cc);\n  cv_mo1HCC8XWIOWWU9so.setAttribute(\"height\", h);\n  cv_mo1HCC8XWIOWWU9so.setAttribute(\"width\", w);\n  cv_mo1HCC8XWIOWWU9so.write(\"cv_mo1HCC8XWIOWWU9flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1HCC8XWIOWWU9RollOverImg = new Image();\ncv_mo1HCC8XWIOWWU9RollOverImg.src = \"http://ecx.images-amazon.com/images/I/814XCg9cJFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1HCC8XWIOWWU9preplay = document.getElementById('cv_mo1HCC8XWIOWWU9preplayImageId');\nif (cv_mo1HCC8XWIOWWU9preplay) {\n  cv_mo1HCC8XWIOWWU9preplay.onmouseover = function() {\n    cv_mo1HCC8XWIOWWU9preplay.src = \"http://ecx.images-amazon.com/images/I/814XCg9cJFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1HCC8XWIOWWU9preplay.onmouseout = function() {\n    cv_mo1HCC8XWIOWWU9preplay.src = \"http://ecx.images-amazon.com/images/I/814XCg9cJFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1HCC8XWIOWWU9preplay.parentNode;\n\n  var cv_mo1HCC8XWIOWWU9currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1HCC8XWIOWWU9currentClick) {\n      return cv_mo1HCC8XWIOWWU9currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 2:04 MinsThis tv is a good buy for you bed room got it today and it works great since i mostly play games i thought it might not be that good for that purpose but it has proved me wrong. i hooked up my play station 3 and my play station 2 on it and ususally with most HD tv's a PS3 would look great(and it did)but a ps2 would not look that great because ps2 use 480p which is not a high resolution so you tend to see tiny little blocks of pixels but with this the tv it has a technology called pixel plus and this gets you a clean picture when playing ps2 as well as ps3 games. i was really suprise with the speakers in this as well they are really loud but i won't risk playing them at max volume because don't want to burst the speakers. The only reason i gave it four stars is because i have a 32 inch toshiba tv and it shows HD a little bit better than this one but if you are an ordinary person you may not notice this little and insignificant detail.", "Date": "March 14, 2011"}, {"Title": "Very nice little TV.", "Author": "Griffin", "ReviewID": "R2UR46B1EYXUKJ", "Overall": "5.0", "Content": "This is a fantastic value for a 22\" LED backlit hdtv. I bought this to replace my old tube tv which died after a lightening strike. The design and form factor is very nice. I love the clear strip around the bezel and the white led light that lights up when it is powered on. This is the first time I have seen a USB port on a TV. I used it to charge my phone and it worked fine. The picture quality is very good when watching digital/HD channels. I plugged in my computer using HDMI and it works great. There is a tiny bit of lag because of the 8ms response time but other then that, I use it to extend my screen real estate from my laptop. Overall, this TV is great, lots of connectivity options, great picture, and fairly good sound. Hopefully it will provide me with entertainment for years to come.", "Date": "March 10, 2011"}, {"Title": "Good HDTV", "Author": "Ct442", "ReviewID": "R3LU1SEVTL151Y", "Overall": "5.0", "Content": "Easy to setup and use.  Nice picture quality.  Sound is a bit tinny but otherwise a great value.", "Date": "March 9, 2011"}, {"Title": "Perfect small TV.", "Author": "Chemist", "ReviewID": "R3OCR44E5RJJZK", "Overall": "5.0", "Content": "I am using this TV 1.5 months and like it very much.It cost me only $189.00 and this is perfect TV for my kitchen.Easy to install, easy to control and good colors and sound.So far I am very happy with this purchase.", "Date": "March 4, 2011"}, {"Title": "Great 22 inch", "Author": "Animekd3", "ReviewID": "REKDK0SXQWPYZ", "Overall": "4.0", "Content": "This product was easy to install and setup. the hd quality is pretty good however you need to toggle with the color settings a bit.", "Date": "March 2, 2011"}, {"Title": "Quality product", "Author": "Robert G. Splaine Jr. \"patsfanrob\"", "ReviewID": "R2DUWMA7V9KEWA", "Overall": "5.0", "Content": "I bought this TV as an upgrade for the bedroom. When I first brought it home, the HD picture wasn't what I expected, but that was because I didn't have an HD receiver for the satellite. I upgraded my receiver to HD, and now I am very happy with the picture. This set is a good size for the bedroom, the picture has good HD, and the sound is fine. This is just a quality product, and the price is right. I recommend it.", "Date": "February 28, 2011"}, {"Title": "Good buy for the price", "Author": "Dental Lab", "ReviewID": "R1S9JPB48YQC6I", "Overall": "4.0", "Content": "I am using this tv in the kitchen, mainly for news. It is on an air antenna and I get a great picture. For what I use it for, it is great. If you want to watch movies on this tv you will probably want to run it through an amplifier. The sound from the tv is a little tinny. Don't buy it for good sound. Other than that it is a great buy for the price.", "Date": "February 24, 2011"}, {"Title": "Extra $40 for the software??", "Author": "Teapot", "ReviewID": "R1R0HK15RLCNIP", "Overall": "2.0", "Content": "I was looking forward to connecting the TV to my computer via the home network, just to realise that the software required for this is something I need to purchase online for an additional $40 ???? From some service named \"Twonky\"?? That is the most outrageous customer treatment I have ever seen. I expected more from a company like Philips.", "Date": "April 6, 2013"}, {"Title": "know what you sell", "Author": "barry", "ReviewID": "R20P16XIY7DE2U", "Overall": "5.0", "Content": "all australia is a 240 volt country. all australia  is pal.tv with a little care it would be possible to advise customers  that the product may need alteration to use outside the USA i am 82 years of age nd my experiance i found stressful.i trust that this may be helpful to you.  john (barry)davidson", "Date": "September 27, 2011"}, {"Title": "Good picture, screen size is between 20 and 20.8 at most, REALLY bad sound,", "Author": "Joseph P.", "ReviewID": "RZX5Y39AH40M1", "Overall": "2.0", "Content": "With flat panel displays, it's the norm that when you say a screen is 22 inches, that its viewable diagonal distance is indeed is 22 inches. This screen is a little over 20 inches. Maybe not a big deal if you're talking about larger screens, and even then the dishonesty would be annoying. But with a small display, the difference is significant. Deceptive marketing pisses me off, and Amazon should correct their description accordingly.I read other reviews about the sound quality, so I was prepared for pretty bad sound. I don't know if it's typical of sets this small, as I've never owned a flat panel tv of this size, but the sound is indeed terrible. Separate computer speakers are pretty much essential. To say this tv sounds like it's utilizing tin can technology, is an insult to tin cans.The picture quality is good for the price you're paying. Good contrast, good colors. My other 46 inch samsung is a few years old, that's all I can really compare this against.I'm thinking about returning this. At $180, it still seems a good buy. I don't see much on the market that compares. It sits about 6 feet from my PC, I'm trying to see if I can find something so that I can get the PC speakers to play the TV's sound without having to disconnect and reconnect the cords.Amazon, as always, did a fantastic job in terms of shipping. Just wish they'd verify the actual screen size and put that info in bold on the product description.", "Date": "August 6, 2011"}, {"Title": "TV In a  Box", "Author": "garrick", "ReviewID": "R3EAARSLSWF12X", "Overall": "4.0", "Content": "This is a high-functioning television set. The colors are vibrant.  Do use a good antenna or cable connection though.  I had to assemble the base to the screen, which was not fun .  The remote works fine.  It is relatively simple to use, especially the bottom half.  It is an ergonomic remote, which means a curved bottom.  I do not have a car at this time so I liked the idea of  it being delivered, especially for free.  It was properly protected by its foam inserts, although I do believe the outside box should be somewhat heavier.  That is Amazon.com's problem.", "Date": "May 26, 2011"}, {"Title": "Not bad for the price", "Author": "N. Breuer", "ReviewID": "R1JMYFN7MPP4UR", "Overall": "4.0", "Content": "TV works great.  Not a whole lot of menu options and the sound is not great since the speakers are facing down, but other than that it is a great buy for the price!", "Date": "April 17, 2011"}, {"Title": "Finally", "Author": "rulade", "ReviewID": "R1PHM8K2JJHZIQ", "Overall": "4.0", "Content": "I waited a long time to replace my 1985 13\" Goldstar TV. This one is an improvement but HD is not connected & the sound is tinny. Otherwise for an infrequently used TV it is fine. Easy to install, easy to use.", "Date": "March 23, 2011"}, {"Title": "waste of money", "Author": "Michael A. Biddick", "ReviewID": "R2VVMMDJ7HRV7V", "Overall": "1.0", "Content": "I bought this set for a bedroom. First off the sound is terrible, and the set is too small. I tried adjusting the color, sharpness, contrast and picture is blurry. It might be ok if you are watching it close up within 2 feet of set. Will use it as a computer monitor and purchase a different TV", "Date": "September 28, 2011"}, {"Title": "It gets the job done.", "Author": "J.D \"J.D\"", "ReviewID": "R33TPK49P3QKEL", "Overall": "4.0", "Content": "It's just a tv. No special bells and whistles. The picture quality is as good as expected. It works and it's cheap. I'd recommend it if that's what you're looking for. Works for me.", "Date": "March 21, 2011"}, {"Title": "Typical Philips excellence!", "Author": "William T. Sawyer \"Handy Man\"", "ReviewID": "R3V5Y9ILBSB3NP", "Overall": "5.0", "Content": "Just as I expected, another great product from Philips.  I could write all the accolades, but take it from me just pay attention to the 5 star rating...says it all and much better than I.", "Date": "December 21, 2010"}, {"Title": "Missing one BIG feature!", "Author": "Matt", "ReviewID": "R2TG5LJ52UENRJ", "Overall": "3.0", "Content": "Many other people have covered both the video and audio quality of this TV, so I won't bother repeating them.  What does need mentioned, however is the lack of a feature that has become an industry standard, and ultimately was the reason for my returning this item:It has no internal clock.That means that you cannot set automatic on/off times for the TV.  All that they give you is a sleep timer, and even that only maxes at 120 minutes.We bought this as a bedroom TV and found that it was lacking in the one feature which it actually needed for that purpose.  It might not be a deal-breaker for some, but it needs to be mentioned, just in case it might be.", "Date": "May 29, 2011"}, {"Title": "EXCELLENT", "Author": "Aster T. Tessema", "ReviewID": "R383PRXO3VHXEQ", "Overall": "5.0", "Content": "NOW,  WITH A $200, PHILIPS LED TV, HOOKED UP TO MY BUILDING CABLE WIRING, I DO NOT NEED TO WASTE MY TIME WATCHING THE CABLE TALKING HEADS HERE.  INSTEAD I WATCH THE NEWS  FROM ALL OVER THE WORLD & SAVE $180.00 / MONTH IN CABLE SERVICE.", "Date": "February 21, 2013"}, {"Title": "good article", "Author": "manuel", "ReviewID": "R3VQH4NQJZ6QIM", "Overall": "4.0", "Content": "to receive and open it seems of good quality wine in a box well protected. The number of stars not complete because I have not completely exceeds my expectations", "Date": "December 20, 2012"}, {"Title": "Less than 1 star", "Author": "Jim Bo", "ReviewID": "R3ULOSR2V7UY9K", "Overall": "1.0", "Content": "Received product, did not appear to be new as stated. Looked like been opened before. After 2 weeks, TV intermittently, would not turn on using TV on/off button. Would like info on how to send back and get refund. Bad product.", "Date": "June 22, 2012"}, {"Title": "nice picture bad sound good buy", "Author": "Pat", "ReviewID": "R39LXUDH4MS3JQ", "Overall": "4.0", "Content": "this tv is on like all the time and we have had no problems out of it. the only thing i would say is the sound is not the best, you can hear it ok just kinda sounds far away.", "Date": "November 7, 2011"}, {"Title": "Accidental order", "Author": "Babushka", "ReviewID": "R1JMWEDQ1PBV8H", "Overall": "5.0", "Content": "I cannot review as an accidental order on USA site rather than UK. I will be returning as cannot get it set up with the leads and frequencies here.", "Date": "September 26, 2011"}, {"Title": "Returned it ...", "Author": "Margie Justice", "ReviewID": "R27ATLKJIFEU69", "Overall": "2.0", "Content": "I returned this set because the picture was quite a bit smaller than the screen size and it did not receive sound on several channels.  However, the quality of the picture was good.", "Date": "June 28, 2011"}, {"Title": "Great little TV", "Author": "Eric Hamilton", "ReviewID": "R14AJXFCU3CYIN", "Overall": "4.0", "Content": "It works great, my digital channels are great but analog are not there.  I am sure it is the setup that I did.", "Date": "June 24, 2011"}, {"Title": "ok for gaming", "Author": "ivan1872", "ReviewID": "R6YRR54ATB9W8", "Overall": "4.0", "Content": "i got this tv for gaming with my ps3. my games and my bluray on this tv look great. the sound comes from the back of the tv so it sounds weird. the only complaint is compared to my old tv, its slow. i play mortal kombat and when i move to the right there is a delay from when u push  the button on your controller to  the actual character moves on the tv. but i did get used to it after a wile but it makes it harder to preform moves in the game.", "Date": "June 13, 2011"}, {"Title": "It serves it's purpose!", "Author": "Schnauzers Rule", "ReviewID": "R1NP60GD7BFA8D", "Overall": "4.0", "Content": "I received the Phillips 22 inch for my sewing room.  I wanted a nice tv in there but didn't want it to cost a fortune.  It has a good picture but isn't as good as our Panasonic. I like it but for more use I would purchase a Panasonic.", "Date": "May 25, 2011"}, {"Title": "Philips TV", "Author": "Gordy", "ReviewID": "R3S7Y6WFZMKRMY", "Overall": "4.0", "Content": "Ordering,shipping of this product was easy. The TV is of high quality and the price very reasonable. Free shipping made the deal.", "Date": "May 9, 2011"}, {"Title": "Totally disappointed", "Author": "Retired Dad", "ReviewID": "R22YBZ2SX4IWUG", "Overall": "1.0", "Content": "Sent the TV back because the colors were out of balance. Could not get a decent color image either with custom adjustments or factory settings.  Returned and got my money back. Bought another brand form a local shop and I am very satisfied. Amazon customer service was great.", "Date": "July 15, 2011"}, {"Title": "There are much better TV's out there", "Author": "Ricus", "ReviewID": "R1MTFHAK38ACG3", "Overall": "3.0", "Content": "How can I sum up my feelings about this TV...... Disapointing would be the first thing I think of. I feel that this TV could not be used in a brightly lit room because the picture backlight was very dim and the colors very muted so the light in the room could easily overcome the bightness of the TV display. I did my best to \"Customize\" the picture to try to correct the dimly lit screen but I was not successful in improving the picture quality. I then put this Philips LED HDTV beside a 4 year old 46\" Sony LCD and my old Sony looked brighter and it had more intense color(s) than this Philips LED TV even after 4 years of use. The Philips TV construction was good and the sound was better than most TV's this size and the display tilted also which was unexpected, however the picture quality I felt was poor so thanks to Amazon, I was able to return it promptly.", "Date": "August 25, 2011"}, {"Title": "its ok, if you want a nice TV or anything close, I wouldn't recommend this one", "Author": "kevin", "ReviewID": "R2MX2YG5NWK1U2", "Overall": "3.0", "Content": "I have had this TV for about 3 weeks if it has buttons to adjust volume or channels, I have no idea where, I use the remote so I dont care, just an observation.  The picture quality is solid, the sound is very weak.  Its an average TV, thats it.", "Date": "July 22, 2011"}, {"Title": "Crappy image, terrible sound, broken HDMI ports", "Author": "FroggyM", "ReviewID": "RKIKAC94CR8YD", "Overall": "2.0", "Content": "I purchased this tv about 1.5 months ago.  When I first started using it, I was immediately disappointed with the quality of the image (only ok/crappy, not great) and the sound (totally dreadful).  The sound is so bad that you _must_ plug in external speakers.  Anyway, this is a bedroom tv that I don't watch that often, so I decided to just keep it.  I wasn't sure if I could get a better image quality at this price range, and the external speaker improved the sound quality enough to make it ok.Then, this week, both HDMI ports stopped working on the tv.  They started to produce this terrible screaming/clicking noise, making them unusable.  I tried multiple devices, different HDMI cords . . . still broken.  I'm outside the 30 day Amazon return window, so I'm having to return the device with Philips directly.  The Philips customer service was excellent, and I should have a new tv in about a week.Anyway, I'm not sure if all the tv's in this price range are this bad, but I'm pretty unhappy with this one.", "Date": "June 13, 2011"}, {"Title": "ONLY LAST for 4 months", "Author": "yoon", "ReviewID": "R1HW1LA4XEF3CM", "Overall": "1.0", "Content": "Phillips SUCKS. Phillips SUCKS. Phillips SUCKS. Phillips SUCKS. Phillips SUCKS.THis TV only lasted for 4 months and Philips service is HORRIBLE and SUCKS.THis TV only lasted for 4 months and Philips service is HORRIBLE and SUCKS.It took over 2 weeks to update the system and their customer service don't know anything. thier most favorite answer was \" I DON\"T KNOW\"> I DON\"T KNOW WHY PHILLIPS HIRED THESE WORTHLESS PEOPLE AND MADE THEIR CUSTOMER MAD. PHILLIPS SUCKS. I WILL NEVER BUY ANYTHING FROM THEM AGAIN", "Date": "January 19, 2012"}, {"Title": "Either Buy a Cheap Off-Brand or Go with Samsung Instead", "Author": "C. J. Meglio", "ReviewID": "R3OOPDW0DNNN8S", "Overall": "2.0", "Content": "I purchased this TV because I wanted a small, affordable TV to put in my home office that could also serve as a second monitor for my computer if and when needed. I've always been weary of off-brands (e.g. Element, Vizio, Emerson, etc.) when it comes to technology, so I thought I'd opt for the safe choice in a name like Philips, especially since it was almost as affordable as the off-brands and highly rated. Don't be fooled. This TV is junk! The sound quality is very poor - the speakers are tiny and have no bass. The picture is acceptable but a bit grainy and nothing compared to the two Samsung TVs I own. If I were shopping for a TV again, I would either pay the extra money and spring for a quality brand, like a Samsung or LG, or just go with an off-brand, because this Philips offers the worst of both worlds - relatively high cost and relatively poor quality.", "Date": "June 5, 2011"}, {"Title": "Sound is terrible!!", "Author": "JMS", "ReviewID": "R2QL5TYCL44DT6", "Overall": "2.0", "Content": "I have bought many Philips products in the last 30+ years.. This is the last product I will buy from Philips. The sound is like a tin can on a string. The speakers are tinny sounding and are facing down instead of facing forwards.. When the tv is on, there is a bright white light blinding you like a street light,(fixed with a piece of black tape). The coaxial hook-up comes out the back where the wall mount goes, poor R&D;,(fixed bracked with hack saw).. Philips has gone down hill like all the rest, No Quality control anymore.. JMS, Oregon", "Date": "March 20, 2011"}, {"Title": "theres way better...", "Author": "natedogg", "ReviewID": "R3UMAE3T423IC8", "Overall": "2.0", "Content": "i shoulda paid the extra 10-11 bucks to get the 22\" lg. the color is not very good and hd channels look like non-hd. i would not recommend this tv to anyone. i expected much better from an established name like philips. my laptop screen is much clearer by far and is only 480p. it works but i bet you could easily get a way better picture for the same price or a little less. DON'T BUY!", "Date": "February 26, 2011"}, {"Title": "not so sharp look elsewhere", "Author": "paul schwartz", "ReviewID": "R1JSLMI532XCSE", "Overall": "1.0", "Content": "We were not happy with this amazon product.It would not load certain channels.The picture was not sharp. It was fuzzier then our four year old Sharp and certainly inferior to an old CTR set that we have gone back to. We will have to put it into a guest room for occassional use.It is a shame when a good manufacturer debase its reputation with an inferior product.Rating one star", "Date": "June 1, 2011"}, {"Title": "It never worked.", "Author": "puyo", "ReviewID": "R2AQ314U8I2FHU", "Overall": "1.0", "Content": "I purchased this TV, but it never worked. When I turned it on, nothing was shown on the screen. I strongly recommend that no one should buy it.", "Date": "December 27, 2011"}, {"Title": "articulating wall mount for this TV", "Author": "Annie", "ReviewID": "R3A1Z2C67VGQJ2", "Overall": "4.0", "Content": "I am looking for an articulating wall mount for this TV. I have found plates that fit the holes for  mounting, but they end up covering up the cable input jack.ThanksAnnette", "Date": "June 8, 2011"}, {"Title": "POOR HD QUALITY, POOR SOUND", "Author": "TNTFM", "ReviewID": "R3F1LMAH0PNHPE", "Overall": "3.0", "Content": "I saw the reviews and noticed most of reviews said the sound quality is poor...Well, IT IS!I almost saw a lot of reviews saying that the picture quality is great...Wel, IT'S NOT!The only good thing of this produt is the price (of course, you'll get exactly what you pay, don't expect more!!!)I learned something from this experience: If somebody had an old TV and buy this one, they're going to qualify this product as excellent, but if you have another HDTV, like SONY or PANASONIC, and it's bigger, DON\"T buy this one, you'll be disapointed, just like me!", "Date": "June 16, 2011"}, {"Title": "tv", "Author": "Linus Peter", "ReviewID": "R1TZDTT2IYSNIV", "Overall": "2.0", "Content": "All I wanted was a tv with a wake up timer. I contacted customer service to ask a question. I got a gentleman who couldn't speak english and very slow!!!I asked if the tvs had a wake up timer he assured me that EVERY tv had it. I said why does it not say it on description he said its a stanard feature. So I took his word for it. Got my new tv guess what NOO wake up timer I am very unhappy", "Date": "April 30, 2011"}, {"Title": "Would not Work At All", "Author": "Gary W Pearson", "ReviewID": "R3V1WM0LYL2ZIH", "Overall": "1.0", "Content": "Worst product ever.  Would not even get past the initial screen.  Philips tech support thought it was a bad remote and sent me a new one.  Still would not respond in any way. Sent it back.  Do not buy!", "Date": "January 20, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "2 HDMI inputs\nPC input via VGA\nLED - edgelit\nPixel Plus HD\nEnergy Star 4.0", "Name": "Philips 22PFL4505D/F7 22-Inch 720p LED LCD HDTV, Black (2011 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/512XbGRmdKL._SX300_.jpg", "ProductID": "B003DPPZJA"}}