{"Reviews": [{"Title": "A truly exceptional plasma television", "Author": "Joshua Pearl", "ReviewID": "R2RCM6OIYP35E0", "Overall": "5.0", "Content": "I've owned this for 3 days now, and wanted to wait until I fully tested it to write a review.  After seeing how it performs with videogames, blu-ray movies and basic cable, I feel I know the television enough to offer my thoughts.Picture quality:  Incredible.  Blacks are as deep as the bezel surrounding the TV.  Colors are bold - everything you'd expect from a top of the line plasma.  I own a 62\" DLP, a 26\" LCD, a 50\" panasonic 720p plasma and this plasma, and the plasmas are the only sets that really \"pop.\"  This model is head and shoulders above even the 50\" 3-year-old model I own.Video game play:  There's a game mode, which bumps up the brightness and sharpness.  It's great for PS3 games.  I've played Demon's Souls and Wolfenstein on it so far, and both look amazing.  The system touts \"1080 lines of moving picture resolution\" to help with motion blur.  Honestly, I never felt plasmas had an issue with motion blur to begin with, so I'm not sure how much of a difference this feature is making, but from what I understand in doing research it helps to have it.Cable: HD looks good - even the reds aren't blown out.  Basic cable is standard definition - a thing on it's way out anyway, lol.Aesthetics/connections:  The TV is very sharp looking, and the anti-glare feature on the S model (as opposed to the U model) actually makes a difference.  I rolled my eyes when I read the feature, but I'm watching it in the daytime in a well-lit room and the glare is really minimal.  The only minor dissapointment is no VGA connection, but I'll figure out a way around that.  Was going to use VGA to hook up my 360 (since I'm using computer speakers for audio at the moment), but will go the component route now.  By the way, a TON of controls and an HDMI input are on the side of the tv, making it very easy to get to.Burn-in/image retention/ghosting:  Haven't experienced any signs of even ghosting yet.  Had my game on pause for a few minutes a couple times to test it.Audio: Haven't tested the TV's speakers, just using an external set of logitech speakers with subwoofer at the moment.Overall:  For the price, I highly recommend the set.  Like I said, I own 4 televisions of 3 different technologies and this one shows off the best picture.  I have a collection of almost 800 blu-rays, and stay up to date on all the high-def news, etc...  I do extensive research before purchasing a product, and actually went into this thinking I was going to give in and get an LED.  I don't want to get into an LED vs. Plasma thing here, but the LED's are simply LCD with different lighting, and it brings all the inherent LCD problems with it.  They make catch your eye in the store, but once you get home and get into your environment, it's a different story.  That said, this plasma in game mode gets the picture as close to LED as I've seen but with much better blacks.Update 5/2/10: Just thought I'd add to this that I've had a videogame on pause for more than an hour a few times, and while I wouldn't make a habit out of it, there hasn't even been a hint of ghosting and certainly no issue with burn-in.  Even so, the TV seems to have an auto shut-off function after 5 minutes or so of complete inactivity.  There will be a message prompting you that it will shut off in 3 minutes and it counts down from there.", "Date": "March 13, 2010"}, {"Title": "Superb - Settled on this after a lot of research - DOES work with Mac and PC", "Author": "P. Cook", "ReviewID": "R23IWVV9A14KTE", "Overall": "5.0", "Content": "This TV really is something else.I did research for months before finally settling on this. I was strongly considering the Panasonic G20 and G25 TV's, the 2010 steps up from the S2 series (which is a 2010 model as well, to be clear), but ultimately picked the S2, here's why:First, only the G25 and S2 series have a 42\" model (rumors of a 42\" of the G20, but as of this review they were not available). Anything larger than 42\" wouldn't fit properly in my space, so that knocked out the otherwise attractive G20 for me.Let's talk about what features it doesn't have compared to the bigger brothers: First, it lacks the Panasonic 'Looks superb. The G25 series has the Panasonic \"Infinite Black Panel\" - the S2 does not, but I swear after watching the G25 in store and then watching a properly calibrated S2 at home, the average consumer cannot tell a difference. The blacks on this TV are very black, and merge well. The contrast ration on this is 2mil:1 vs the G25 5mil:1 if you want to know the numbers.The other major features that this doesn't have over the G25 are the Viera Cast (youtube, netflix, twitter, etc) online features (there is no internet connection of any sort on the S2), and it also lacks the THX mode that the G20 and G25 have. Let me tell you why I'm not missing these, even as a filmmaker who might otherwise seriously consider the THX mode.First, while the Viera Cast features sound nice and are convenient, they're essentially negating what my PlayStation 3 can already do in terms of online access. All I mean to say here is, if you're willing to use an external device (console, computer) to access these features a different way, then you can pay less and get this model. If you don't have a console or want the convenience of having these built in without another device, then set your gaze on the G25 (or a blu-ray player with the same features that the TV's have). Also, the THX mode does sound nice, but if properly calibrated, this TV looks masterful on it's own and is a true bargain for the price.In the three days I've had it, I've tried PS3 games, Blu-Ray movies, Standard DVD movies, and streamed Netflix (one of the films they stream in HD, and let me tell you, it looked like Blu-Ray) and all three have looked truly superb. No shuttered motion (thanks to the 600Hz), great color reproduction and, folks, the brightness is fine. It really is. While this TV ***WILL*** have some glare if you have it in a room with TV's in the background, when the TV is on, any minor glare/reflection from lamps (etc) in the room will immediately be overcome by the image.The sound is not masterful, but in no way is it bad. It's on the high end of \"normal\" from a TV, if you will. Absolutely worth listening to until you can get a sound system later, if you need or want to wait. I \"want\" a sound system, but it's not a priority, for what it's worth.This TV does NOT have USB ports, but again, if you have a console you shouldn't miss it. A PS3 or XBox will substitute almost any need for a USB port. The Wii looks/works fine (I have one) but overall extended use should come from one of the HD systems if you have this TV (purely because the Wii lacks HD output, is all. Not knocking it!).Some of the Picture modes are a little weak (\"standard,\" for example), but with some adjustments or a true calibration you'll be fine. Nothing to shy away from at all.Finally, ***BURN IN WORRIERS NEED NOT WORRY***. All the 2010 Panasonic plasmas have a pixel shifting technology that helps reduce burn in. They also have a \"white wash\" feature that erases burn in, and although I have yet to have need for it (burn in is worse typically in the first 100 hours of a plasma) - some other reviews I've read seem to think this feature will operate well as intended, IF you even need it.My last thought is this: If you don't want to pay more for features you already have via another device, this TV is your best bet for 2010 model plasmas. For the cost of the 42\" G25, I bought this TV, a Logitech Harmony One remote, an HDMI cable, a 4 year protection plan on the TV, and the Logitech device that makes the PS3 work with the Harmony One remote. All for under $1,200. That's outstanding, in my opinion.", "Date": "April 27, 2010"}, {"Title": "For the most part, a pretty good TV", "Author": "Carl M. Coleman Jr.", "ReviewID": "R2RZW5YLP78VCM", "Overall": "4.0", "Content": "I got this TV because it looked like the perfect fit for a price / performance ratio.  Overall I'm pleased with my purchase, although there are a few things that Panasonic can improve on.  I have seen and had lots of experience with the 2009 S1 model, as well as the 2009 G10.  The 2010 S2 is better than the S1 but doesn't quite have the picture quality to match the G10.  Its close though.  So if you can find a G10 at the same price you may want to go with the G10.  The reason I didn't go with the G10 is because Panasonic has had problems with some of their TV's losing a significant amount of their black levels in previous year's models.  They said that they have addressed these issues in the 2010 model lineup.  So to get a few more years out of my plasma, and sacrifice a slight loss in picture quality I decided to go for the S2.Picture QualityAs far as black levels go, I have no quarrels with this TV.  It has excellent black levels, and honestly I think this feature is a little over hyped in the industry.  I do appreciate black levels but when TV's are this black, I much prefer color accuracy, which is where this TV has a few problems.  Most colors look great and the red's specifically pop very well.  Skin tones are also very accurate for the most part.  But the greens don't look as good as other high end models and you can tell in a side by side comparison.  Some of the HD sources I used to distinguish the picture quality of the TV are: Planet Earth, The Dark Knight (which is the best HD source that I've ever seen).Food Network (to accurately judge color), about a dozen video games, and a few other Blu-Ray movies.  The fluid motion of action scenes is very good, and I couldn't really see any flaws as far as motion quality goes.  The detail of the content that I viewed is pretty good, but you may notice a few flaws if you sit really close.  Another complaint that I have about the picture quality is that sometimes the video processor doesn't handle older HD sources and doesn't do SD sources very well at all.  SD sources, at times, look downright terrible, and the TV doesn't seem to clean up HD sources that were made four or five years ago as well as higher end models.  This TV also seems to handle video games very well.  There were only a few occurrences where I saw a difference in picture quality and they were minute.  Overall, very good picture quality.SoundNo one is going to mistake this for a good home theater setup, but to sound is pretty good for a TV.  If you're serious about your audio, then you'll definitely want to get a home theater system to compliment this TV.Features / MenusIt would have been nice to have an Ethernet port to get firmware updates, and have a few internet applications, but these apps are usually slow and I much prefer to use a set top box or gaming console.  The Ethernet port is the feature that is any concern for me.  As far as the menu goes, Panasonic has almost gotten it right.  You'll have to go into the settings, and change a few things because the default settings are a little strange.  They're also missing a few things like gamma, and an option to just turn up the brightness of the panel (not the picture).  Mostly everyone will turn it on Vivid which may be a little to bright for some, but the alternative, Standard, is much to dim.  It would have been nice to fine tune everything the way you like.  The menus do a descent job of explaining what each setting does, which is a welcomed addition.  They have also disabled some of the settings which is also a little strange.  The remote is nothing special.  They could have moved around a few buttons to make it easier to navigate but, I`ve seen much worse.  The Viera Link feature (for me) is completely useless, and I can't imagine anyone using it very much.  There is also a slot where you can put an SD card and show off photos.  This is useful, but it is very slow going from image to image.  It's also worth mentioning that this TV does have the ability to heat up a room.OverallThis TV does what I want it to do.  It has solid picture quality, and enough features to keep me satisfied.  The fact is that technology changes so fast that it doesn't make sense to spend top dollar on hardware when that hardware will be trailing edge in a year or two.  So, while I would love a higher end model, I am very satisfied with my purchase.  With proper calibration it's hard to see the difference between this TV and higher end models unless you sit really close, so I do recommend this TV.", "Date": "April 29, 2010"}, {"Title": "It all started 'cause I wanted a new monitor for my Mac...", "Author": "Erok of the Valley", "ReviewID": "R2LJ57R4V1Y92I", "Overall": "5.0", "Content": "I've had a 15\" MacBook Pro for the last year and a half, and am smitten with its perfect, though diminutive, image. But when I saw that Fry's was selling a 24\" ViewSonic LCD for $169, I jumped at it. Drove to the store that same day, bought the monitor, brought it home, set it up, and bathed myself in HD goodness. Games, movies, Internet--everything looked great.That night, however, watching an episode of Lost, I realized that there was a brightness on the bottom and the top of the screen. No matter how dark the scene was, it always had this gleam to it. By the end of the program, I was positive that there was no way I could live with the defect, and resolved to bring the item back to the store.I turned in the ViewSonic the next morning and immediately bought a Samsung, a top brand for HD. It wasn't on sale, but I was determined to get a perfect monitor, even if I had to pay twice as much. I brought it home, hooked it up--same damn problem. Even a perfectly black image was marred by this infernal glow. Maybe it's just something I have to live with, I reasoned, suddenly realizing that I just spent an extra $75 on a product that was no better than the one I had before in any redeemable way. I took it back that afternoon, and just my luck--truly mind-boggling, really--the same exact Fry's employee was there to take my return, giving me the stink eye (\"Weren't you just here?\").After a little bit of research, I found out that the condition plaguing me was called \"backlight bleeding,\" and it was endemic to practically all reasonably priced LCD monitors. Apparently, what I found intolerable was a standard in the industry. How much did I have to pay to get the 24\" quality that I wanted?! Well, Apple was offering their LED Cinema Display for a mere $900. Apple, a company I've loved my entire life, was out of its cotton-pickin' mind!I figured if I was going to spend anywhere near that for a monitor, I might as well go all the way and upgrade to a fullblown HDTV. I had waited long enough (my 27\" Phillips CRT TV was hardly getting any use any more), it was time to hunker down, dive into the Interwebs and unearth a technological gem.Plasma, in spite of the recent strides with LCDs, still seemed the way to go. Flawless viewing angles, zero motion blur, and--most importantly--black levels blacker than the blackest black that ever blacked. I have witnessed glorious spectacle from expensive LCDs, but I couldn't risk a third disappointment. Once I knew this, the rest became obvious. Plasma screens generally started at 42\", which is perfect for my room--any larger would be bulky and obnoxious. I needed 1080p, because I had intended to use it primarily in conjunction with my laptop computer and I didn't want to chance the text being all fuzzy.Panasonic is a well-respected brand, especially amongst HDTVs--appearing repeatedly in top 10 articles, including several from CNET and Consumer Reports. But I almost didn't go with this particular model because some yahoo, who may or may not be trolling for Samsung, made the rounds on all the vendors' websites claiming that it doesn't work with Macs or PCs.I did read plenty of reviews declaring the opposite, but I couldn't find out for sure. I even brought my laptop to the store in hopes that an employee would let me hook up to the floor model, but was denied outright (I'm lookin' at you Fry's). Amazon offered a TC-P42S2 that was about $63 less than Best Buy's \"sale price.\" I leaped at the offer, eagerly tracked the package, literally chased the UPS guy down, brought it home, opened the box... busted screen--completely shattered.Props to Audio and Video Center, the actual seller of said package. The day after I told them about my problem, they sent me a brand new set by company truck, straight to my front door, taking back the broken one no questions asked. They even screwed the TV to the stand. Great peeps.Naturally, the first thing I wanted to do was confirm whether or not I could hook up my Mac to my new toy. Let me declare in absolutely no uncertain terms: It works. Perfectly, and boo on anyone who says different. To pull this off, I used a Mini DisplayPort to DVI Adapter, a comfortably long DVI cable, and a DVI to HDMI adapter. No calls to Panasonic, no programs, no fancy electronic gadgets. After all I've been through--all my tribulations, false starts and letdowns--it is an unparalleled joy to blow up giant pictures, to surf the Internet, to watch YouTube videos in all of their HD glory on such a colossal, crystal clear display.Burn in is a threat with plasma TVs--especially new ones--because the fresh phosphors burn more intensely those first 200 hours. For the first one and a half weeks, I kept the contrast below 50, and left the screen on at night, my computer cycling through an ever-growing collection of 1920 x 1080 wallpapers every five minutes. Even now, I'm careful never to leave a single image on the screen, be it an icon or a pair of widescreen bars, for more than an hour at a time. Crisis averted.My greatest gripe with the TC-P42S2 is the unforgiving variety of inputs. Obviously a single DVI input would have been welcome. But the lack of an S-video port or even a little something for analog audio is borderline negligent. Some of us are still happy with our $150 bookshelf speakers.Speaking of audio, I've read a lot of reviews of people dissatisfied with the sound quality of the set. It's really not bad at all, completely passable. What television out there sounds as good as an actual stereo system? It's a non-issue; save up some bucks and upgrade.The picture is gorgeous, absolutely gorgeous, and I defy anyone to quote me a price on a cheaper high-quality plasma that has full 1080p definition. The cinema mode (properly tweaked), is perfect for movies, and the game mode is perfect for video games. I obsessed over the purchase, sweated the details--loved and lost--but am completely satisfied with my initiation into High Definition Electronics, and am excited by the prospect of many years with this wonderful television.", "Date": "August 5, 2010"}, {"Title": "P42S2 thoughts + calibration", "Author": "Ever", "ReviewID": "R7FTC314UIQKB", "Overall": "5.0", "Content": "Picked this set up for a great price at another retailer and am blown away by the picture quality once it's calibrated properly.  There aren't too many negatives to point out.  The blacks are deep (though surprisingly they don't seem to be that much better than my Sony LCD 32EX400 tv).  The picture quality thanks to it's great color reproductions is great.  I really wanted to go for a plasma since they have such great motion fluidness, and wanted the deeper blacks associated with plasma's.  Plasma's in general are currently the viewing angle kings, and this one is no exception.  You can sit at nearly an 80-90 degree angle both vertically and horizontally and not notice any image degradation which is common with LCD/LED's.The only negatives are pretty minor.1. I wish it had a swivel base like some of the other Panasonic models.  But to cut costs they usually skimp out on this feature.2. Some user's notice that it has symptom/feature called \"floating blacks\" which basically causes the intensity of the black level on very dark scenes to fluctuate to brighten up the picture and give more contrast to certain areas in the picture.  I haven't yet noticed this, and hopefully I don't.  Some users are more prone to noticing it than others, and some sets seem to do it more than others.3. Both the 2009 and 2010 Panasonic's have a \"rising black level\" which occurs after a certain amount of hours (1000-2000+ hours).  Basically this causes the black levels to rise a bit.  Other plasma manufactures (Samsung, LG, etc) don't work like this.  They have a constant black level throughout the life of the product.I decided to go for the Panasonic plasma since in the size range I wanted (40-46\") there simply was no other option at 1080p with great image quality.  So I bit the bullet and decided to give this TV a shot and so far I'm happy with the purchase.  Overall, I think this is an excellent TV.  Sure it has some negatives, but it's positives are also great and no TV is going to be perfect.I'm using these settings on my TC-P42S2 (these should work for the entire TC-PxxS2 line of TV's). They are based off the widely use reference settings from a calibrator D-Nice from the AVS forums:Picture Settingso Picture Mode : Cinemao Contrast : 71o Brightness : 60o Color : 47o Tint : +9o Sharpness : 0o Color Temp : Warmo x.v. Color : Offo C.A.T.S. : Offo Video NR : Offo Blur Reduction : Off (with On you get full 1080 lines of motion resolution but with some frame insertion/interpolation)* Aspect Adjustmentso Screen format : FULLo HD size : Size 2* Advanced pictureo MPEG NR : Offo Black level : Lighto 3:2 pulldown : Auto (reference is On, this is only adjustable when the source is a 480i or 1080i signal)Service Menu OffsetsWB-ADJ MENUR-DRV: +5G-DRV: -11B-DRV: -11R-CUT: -2G-CUT: 0B-CUT: +4Note: These offsets must be entered for both Color matrixes. You access the different matrixes by using a 1080i/p signal for the HD matrix and 480i/p signal for the SD matrix. The WB Method Select option should be set to 00 instead of 03.The thread can be found on the AVS forums if you want to do the service menu offsets and want to learn more about the set.", "Date": "November 23, 2010"}, {"Title": "Beautiful display, great price, mediocre sound", "Author": "Andy K \"Andy\"", "ReviewID": "RK4KQSTU55RQ9", "Overall": "4.0", "Content": "I received this TV from Amazon 2 days ago and so far I love it. I shopped around extensively, and it was by far the best value for a large plasma screen from a \"name brand\" manufacturer. The display is gorgeous. It creates a lush picture with dark blacks and vivid colors. I bought this to replace a 3-year-old 26\" Panasonic LCD screen, and I am blown away by the improvement in picture quality. Now, I have to reprogram my DVR to ONLY record HD shows because they look so great; I never noticed that much of a difference between HD and standard-def with the old TV (which was probably only 720p while this new one is 1080p), but I can see a huge improvement with HD now! Overall, very impressive picture quality.It has 3 HDMI inputs, so I could plug in my cable box, DVD player and Netflix Roku player with no problem. (How great to be able to ditch all those component wires!) Set-up was a breeze and the on-screen controls are intuitive. The remote control is very nice.My only complaint with the TV is its poor sound quality. I suppose there must be a tradeoff for a $700 42\" plasma, and if so, sound is most definitely that tradeoff. The speakers are tinny and echo-y. (By comparison, the speakers on the Panasonic LCD TV I replaced this with are much, much better... of course, I paid the same amount of money for that 26\" TV 3 years ago, so I'll willingly take the larger, better screen any day.) I played around with the audio adjustments extensively, but could not find a sound setting that I considered acceptable. I am still giving this TV a 4-star rating because I assume most people purchasing this TV will also have a home theater system. Last night I purchased a Polk Surroundbar 2.1 speaker system, and I am happy with the sound now, but that was an additional $350. Before buying the Surroundbar, I was hoping to plug the TV into my Bose Sounddock, but the TV's ONLY audio output is optical audio, so you cannot make this TV work with inexpensive computer speakers or any speaker system that is not specially designed for home theater with optical audio capability.As long as you're aware of the sound situation, then I highly recommend this gorgeous and well-priced TV.", "Date": "June 24, 2010"}, {"Title": "I think I finally found it", "Author": "Movie Source", "ReviewID": "R3J6BOG9LJ68D4", "Overall": "5.0", "Content": "It is nothing short of a headache shopping for a new TV.  I find one I like and then a list of drawbacks sways me to another which has its own set of problems.  I was beginning to think a I would be dissatisfied with any TV I got (especially in the price range I wanted).  So after months of research I decided to go with the Sony EX 400 series 40\" LCD.  It was nice.  Not fantastic, just nice.  It had some slight motion blur that I convinced myself I would just have to deal with, but then I saw a my friend's plasma.  Now I had considered plasma, but decided to stick with LCD because of reported burn-in problems, buzzing, and energy consumption.  I live in Colorado Springs (over a mile high), and so I did not want to chance buying a plasma.  However, after a brief demo at my friend's house, I was sold.  After having the TV for a while I am happy to report no burn-in, buzzing, or other altitude related problems.  It does slurp some energy, but that is a side-effect of plasma.  Plasmas have a definite bonus for me though: no blur.  Since the refresh rate is so fast it is almost like watching a CRT.  The black levels are superb (almost dark enough to suck the light out of my bedroom), and the colors are accurate.  The definition is astounding.  I cannot comment on the sound, since I use a receiver and speakers.  This TV does put out some heat, but is by no means going to heat the room.  I used some configuration settings I found on the internet which meant putting most everything on 50 percent (except, of course, for sharpness).  All in all, I am very happy with this TV and would easily recommend it to anyone.", "Date": "June 18, 2010"}, {"Title": "Panasonic Plasma 2010 S2 series - Nice job!", "Author": "Miguel A. Atuesta \"Mig-21\"", "ReviewID": "R31EW3Y50GW3NE", "Overall": "4.0", "Content": "As usual, I've waited one month to review my product. My humble findings:Pros:- Purchased it for the 2010 World Cup. Outstanding image in sports, thanks to the typical plasma refresh rate, but also to Panasonic quality, no shocker there.- Nice sound for a TV with no home theater. Used to have a Samsung 32\", this one is far superior. I do have the home theater, but it's not a new model, so no optical input. More on this in the cons list.- Ease of installation and operation. Took me 10 mins. to set the thing up with the tabletop. The store added a wallmount, free of charge, but took 2 weeks to come. It's now on the wall and looks amazing.- Antiglare filter works in my living room. That is subject to your own setup so I won't dwell on this. Works well for me, that's it.- IT WORKS WITH PC AND LAPTOPS VIA HDMI. Any reviews stating otherwise are NOT TRUE.- 1080P for PS3 and Blu-Ray... Amazing!!!- 720P for Xbox360 and DirecTV HD, excellent and affordable quality.- SD channels look ok, but with this screen size I didn't expect any wonders; still is easy on your eyes.- No hints of burn-in so far, even thou the games I play are mostly racers that keep the HUD on the same place all the time during races. Had a LG Plasma 2 years ago and the burn-in made me discard it (to my kid brother, where I can still see the damages)Cons:- Images are more vivid on the Samsung LCD I used to own, but not enough to regret the purchase. I am using the Vivid setting on the thing, which fixes the problem somewhat. Others will love less glare from the screen so this is just for me.- The only audio output is optical, so my home theatre is not in use. I am not buying a new system, since my old one is powerful and works well, but I have not been able to circumvent the conections to make it work, so one star goes out the window. Is it too expensive to keep the 2 audio RCA's outputs of yore?- Not as thin as the latest models from LG, but then again, I believe Panasonic is a better make, so I hope Pan makes them thinner next year.The most important thing in my mind when making the purchase was the price/quality ratio, and after extensive research, I think nothing beats the deal with this product. There is, of course, room for improvement, but overall, I am VERY satisfied with my purchase, and would recommend it to anyone!UPDATE: I gave in and bought a new home theater, since the TV speakers are just adequate. I now have my entertainment center all set up, and couldn't be happier with it:- Panasonic TC-P42S2 1080p Plasma TV set- Panasonic SC-PT570 1000w HTiB- DirecTV HD DVR- PS3 80gb- Xbox 360 w/Beatles Rock BandI don't think I need anything else, but I'll gladly check out any ideas... bar 3D, I'm not ready for it yet ($$$)5 STARS FOR THE TV!!!", "Date": "August 5, 2010"}, {"Title": "Great picture, great price, smooth delivery", "Author": "King Me", "ReviewID": "RYLVPKCV9OQEU", "Overall": "5.0", "Content": "I've owned this plasma tv for about a week now and have to admit that I have nothing but good things to say about it. The picture is everything I could ask for in a 1080p tv, the price (under $700) was excellent, the features are well thought out and the remote is comfortable and very well laid out. If I were to be brutally critical I would say that the tv itself has a rather basic look - some other brands are a bit more stylish - but since that is the least important thing on my list, I hardly notice it at all (and it actually does look great and matches well with my tv stand). I was actually very impressed with the sound from the tv. Of course, it can't compete with my 5.1 surround system, but for simple tv speakers they did their job perfectly well and sounded much better than I expected. One minor complication is that the tv has only one audio output, that being an optical digital out. I connected it to my receiver and not surprisingly the broadcast 6-channel sound blows away the TVs speakers. I also happened to notice a small notation at the bottom of page 29 in the manual that says if you run sound from an external piece of equipment through the tv using the HDMI connection, the tv will output it as 2 channel. I tested it with an upconverting dvd player and also with my PS3. The sound from the dvd player came through as 6-channel and sounded the same as it did from the original coaxial cable connection, but the PS3 seemed to be too much sound for the TV to process and it came out as 2-channel with some ProLogic processing. I imagine that the lossless sound ouput from blu-ray can't be run directly through the TV. Sort of unfortunate if true, but still not at all a dealbreaker to get such a great 1080p picture at such a great price. You just have to run the sound from external equipment directly to your receiver. Finally, I like the anti-glare feature. It lightly blurs any light shining on the screen and does not interfere in any way with the quality of picture being displayed. Very cool.Anyway, I placed my order for the tv on a Saturday. On Monday I received an email from Pilot Freight informing me that it was being shipped and giving me a web address where I could easily track the progress. On Thursday I received a phone message from the delivery man asking when I would like the tv to be delivered. I called back quickly and was told I could have the tv between 3pm and 5pm that day(!) The delivery man arrive at 3pm, was pleasant and carried the tv one flight up to my media room. It was all an extremely easy and low stress purchase and delivery. Everyone did exactly what they said they would do and I could hardly believe that after placing my order on Saturday morning, I had the tv up and running my blu-rays on Thursday evening! Outstanding.I should mention that I set up the tv entirely by myself but would rather have had someone there helping me with a few things, just to be on the safe side. What I did first was to open the top of the box, remove and look over the directions and put the stand together. Then I carefully laid the box on its back and opened the box bottom. I stood the tv back up, making sure that the flaps on the box bottom were open and would not interfere when I lifted the box off of the tv. The tv had rather large styrofoam coverings on all four corners to protect it, so I carefully tilted it onto its side. That allowed me to attach the stand and then gently lower the tv so that it was now sitting on its stand. I put in and tightened the last bolts to hold the stand firmly in place, made sure I wasn't wearing anything that could scratch the screen, and lifted the tv onto my entertainment unit. As this 42-inch plasma weighed just 55 lbs, it wasn't too difficult to lift myself, though again I would rather have another person there to help, simply to protect my new gadget.So that was it. The Panasonic is an excellent tv at a great price and the delivery and set up was smooth and easy. One final thing I should mention: Right after I made my purchase I read that some people experienced something they call the \"blinking lights of death\" or something, which causes the Panasonic to be unable to start up. I have not had that happen in my limited time with the tv but that information did throw a bit of a scare into me. I'll update my review if I encounter any problems, but at this point I'd give the tv and experience a 10 out of 10 and would certainly recommend it to anyone looking for an excellent hi-def experience.", "Date": "August 6, 2010"}, {"Title": "Fantastic TV, especially for the price", "Author": "Andrew Stevenson \"drew and not u\"", "ReviewID": "R25JZ60VOWSTQM", "Overall": "5.0", "Content": "This is my first plasma. In the past I'd helped my parents purchase several high-end LCD TVs (as well as doing installation and basic calibration for many friends and family), and I was finally in a position to purchase one for myself. I had a fairly limited budget and ended up going with an entry level Sharp 1080p LCD. After setting up and calibrating it, however, I wasn't thrilled with the picture quality and decided to replace it.I hadn't considered plasmas until that point because of all the drawbacks they had when they first became popular (which I assumed still held true). After reading more about the state of current plasma TVs, and reading the glowing reviews for this model in particular, my interest was piqued. When I saw the price on Amazon I was sold.Here are my thoughts after living with it for a couple weeks:Pros:-Extremely vivid colors with smooth gradients-Much deeper blacks than any LCD (including the $2000+ models I've worked with)-Fantastic shadow detail - eg. you can clearly see every wrinkle on a black T-shirt-Overall picture quality is just stunning, whether it's playing the new Castlevania game on xbox, watching the black and white samurai classic Yojimbo on DVD, or Up on Bluray via my Laptops HDMI.-Very little glare from sunlight and interior lighting-Textured bezel with blue accent looks great in person-when making picture adjustments the menu hides so you can see the entire image, which is great when calibratingNeutral:-decent variety of color and video calibration settings-adequate remote-3 HDMI inputs - adequate but more would be betterCons:-I occasionally notice slight video noise (sparkling) on certain patterns when watching netflix via my xbox (probably due to the compressed 720p stream). The noise reduction setting mostly eliminated the phenomenon, making it barely noticeable to me, and unnoticeable to the other people watching with me. I have not witnessed this effect from any other source, including DVDs and games on the xbox.I couldn't be happier with my purchase. You'd be hard pressed to find an LCD TV at any price that could match the picture of the S2.", "Date": "October 15, 2010"}, {"Title": "Great picture quality", "Author": "Anthony", "ReviewID": "R2MKPBMINVAC5X", "Overall": "5.0", "Content": "First I bought a Vizio 42\" lcd and picture quality was just horrible in my opinion ,returned it and did alot of research this time before deciding on this Panasonic and could not be happier. I have owned this tv for 4 months its performed perfectly with an amazing picture and great overall features. New plasmas beat lcd easy. I believe this is the best 42\" plasma with full hd available in my price range.", "Date": "November 20, 2010"}, {"Title": "Amazing for the price", "Author": "Thomas Nielsen", "ReviewID": "RSTVCFBUBJ2IN", "Overall": "5.0", "Content": "This is a great 1080P plasma screen for the dollar. I was looking for an HDTV that could measure up to my 1080P HD professional 3 chip camcorder. I wanted plasma, but many of these are still 720P.....or quite expensive. The colors are very accurate and nuanced, blacks are deep and holds multiple shades.While you get a very high-end screen, you dont get wifi capabilities, however why would you spend the xtra money to have you TV wireless when this can be accomplished far cheaper by your bluray player or even playstation 3 among others. Here you dollar goes to picture quality. Build in speakers are as always nothing to write home about, but nevertheless decent.I use this with panasonics DMP-BD85K blu-ray player that takes care of the wireless part while delivering a class leading picture signal.", "Date": "August 19, 2010"}, {"Title": "Does work with PC", "Author": "Rex", "ReviewID": "RL3DCDITBLMWU", "Overall": "5.0", "Content": "I have only had the TV for a couple of days, but so far it looks great and is easy to use/set up.  Contrary to an earlier review, I was able to connect a Windows Vista PC to the TV using an HDMI cable without any trouble.", "Date": "July 2, 2010"}, {"Title": "Better than expected!!!", "Author": "Dr. Todd M. Jamison", "ReviewID": "R167ASCUOXBCOY", "Overall": "5.0", "Content": "This set was purchased for a large teen game room and it's picture is so crisp and clear that I know I will purchase another, slightly larger Panasonic for the man cave. At $580 it can't be beat. I'm a university researcher, so I go a little over the top in research. There were some sets that got slightly better reviews, but they were $200 more. In the cost to features analysis - this model won. Without reservation, I recommend this set.", "Date": "January 12, 2011"}, {"Title": "Adjust picture settings", "Author": "SimpleLife", "ReviewID": "R1CZKIBYD2HXE3", "Overall": "5.0", "Content": "Love the TV.  I do wish it had an analog audio out jack.  Also, as shipped, the image is very dim.  It is very easy to go to the menu and select vivid.", "Date": "November 11, 2010"}, {"Title": "What Can a Non-Techie Say About a TV ...", "Author": "Giordano Bruno", "ReviewID": "R3ETE2F6MBNE8R", "Overall": "5.0", "Content": "... except that it looks pretty darn good. I've had this one for several years already and it shows no urge to become obsolete or to misfunction. I have NOT had the problems, asserted by the previous low-star reviewers, of 'burn-in', of black-out with blinking lights, or of incompatibility with my Mac computers. I scarcely watch TV programming aside from baseball and tennis, but the last few days I've had the chance to see NLCS and ALCS games on my own TV and on those in bars and the homes of friends. My own plasma Panasonic has been consistently superior in color and in capture of quick movement.Sound is another issue, of course. I watch/hear a lot of opera DVDs on this set, but I' hardly be satisfied with the sound produced by the built-in speakers. I have it hooked up to a battalion of speakers, as I presume almost everyone will.Now let me use this review for a serious purpose. Just a few years ago, when I finally felt a need to live in one place and to have a TV of my own, there were no more than a dozen DVDs of operas listed on Amazon, and half of them were Wagner. Now there are scores of them, some edited from 'ancient' filmings, some produced as films, and some of recent stagings filmed with cinematographic brilliance. This is a genre of art/music/drama which has come of age. Give yourself a thrill; watch Monteverdi or Rossini on the off days of the World Series.", "Date": "October 22, 2010"}, {"Title": "Excellent TV for the price", "Author": "Brett A. Swanson", "ReviewID": "R32ROPWAYHEKJN", "Overall": "5.0", "Content": "The previous reviewer is obviously inexperienced in LCD and Plasma TV's.  The picture is excellent.  I could not be happier.  The bezel is really cool and the anti-glare screen does exactly what is supposed to do.  I don't think you will find a better TV for the price.", "Date": "March 8, 2010"}, {"Title": "DONT PURCHASE PANASONICS UNTIL YOU READ", "Author": "Jane", "ReviewID": "R39DBMLCV1BW9L", "Overall": "1.0", "Content": "Purchased this Panasonic from a Sears and  we were very happy with set for apprx. 15 months. Turned the set off for a few hours returned and the set would not turn on. All you get are 10 Blinking lights-NO PICTURE. I unpluged all incoming electrical and it worked again for four more months, now it wont come on just blinks back at ya. All warranty is expired and it cost to much to repair the set. After reading reviews on Panasonics I have determined this problem is a great flaw which has not to date been corrected.DONT PURCHASE PANASONICS UNTIL YOU READ REVIEWS CONCERNING THIS BLINKING LIGHT PROBLEMS", "Date": "May 23, 2013"}, {"Title": "Loved it so much bought another one", "Author": "jbanana1", "ReviewID": "R3IHZUHALNCYKW", "Overall": "5.0", "Content": "We first bought this tv in May, 2010 for our main tv room.  Used the settings found in the reviews on this site (thank you to those that listed them) and have loved this tv so much we bought another one for our bedroom at Christmas.  We don't play games on our tv and watch mostly sports and a few sitcoms, movies and other shows.  The only real negative is the sound quality.  It varies depending on the show but overall it is fine for us.  Got a good price on Amazon the first time but by Christmas it was selling for a couple hundred less which was even better!  No problems with delivery/set up.  Bedroom tv is mounted on wall.  Husband initially wanted led tv for bedroom but after looking at prices decided that he liked the plasma so much that he couldn't justify spending the extra money just to have led.  Highly recommend this plasma tv.", "Date": "January 26, 2011"}, {"Title": "Great TV for the money!", "Author": "Mainlined Coffee Please", "ReviewID": "R1BX3YAQO5IDUU", "Overall": "5.0", "Content": "We love our new TV! We've had it for close to 2 months and it's been amazing. The picture is amazing with Blu-Rays and HDTV, and DVD's also look fantastic. The sound quality is never going to equal surround, but it's not bad at all. A step up from my old CRT, that's for sure. Setup was easy and the functions are pretty self-explanatory. Very easy to change the picture settings if you've got too much red or green or it's too dark or whatever. We haven't used the Viera link or SD card slot yet, but we probably will eventually. And it's definitely a must to have at least 3 HDMI inputs, which this TV does. One from the cable box, one from the blu-ray player, and we use our third to hook up a laptop and play downloaded movies. Would be good for video games, though, if you have a console.The one downside is Amazon's shipper. They were A WEEK LATE in their estimated delivery. But I'm not too upset because Amazon comp'ed us for the delay. Overall, great deal on a great TV.", "Date": "January 17, 2011"}, {"Title": "Nice TV", "Author": "ramram98 \"srijr\"", "ReviewID": "R1SLMST0BI70FX", "Overall": "4.0", "Content": "I'm writing this review to see if some people will respond to a question that I have.  I ordered this tv and hooked it up.  I'm very happy with the picture quality and everything seems to function well.  However I do hear some slight buzzing from the tv when I listen to the back.  Do you know if this is normal?  The buzzing also changes pitch when different backgrounds come up.  I can't really notice it very much when I'm in a seated position with the volume up.  I just want to make sure that I take some corrective action now if this product is defective.", "Date": "January 8, 2011"}, {"Title": "Great TV at an even better price", "Author": "Aggressive Owl", "ReviewID": "R2TCLOT22VYGSF", "Overall": "5.0", "Content": "I am very pleased with this TV.  I believe the picture quality is far better than any LCD's that I compared it to, but I have always thought that LCD's could not compete with plasma TV's in that regard.  The TV was extremely easy to set up right out of the box onto the stand and hooked up in about 15 minutes.  The controls are easy to use.  Also, you have the speedy refresh rate associated with plasmas, that again, I do not believe LCD's can compete with yet.Price, wow, I purchased this TV for $549.99 on Black Friday and I am thrilled to have gotten it for so cheap.  I cannot believe that I got a TV this good and this size for under $600.", "Date": "December 6, 2010"}, {"Title": "great TV", "Author": "D. Collins", "ReviewID": "R3MH8PNW2PTBZB", "Overall": "4.0", "Content": "This is our first big screen TV and it's a great one. The picture quality is great.  We've had it for 5 months now and the only thing I can really say is annoying is that the screen size (whether it's zoom, just, or hi-fill) seems to keep changing all the time. I don't notice it at first, but on certain channels with the station LOGO, sometimes I see that I only see half of it so I change the screen size. No matter what we change it to, it seems to change again and again.  It could be a setting that we need to change, but we just haven't found it yet.My husband has hooked the Wii, XBox 360 and love the picture quality.We have this in a big room with a lot of windows and have had no problems.", "Date": "December 1, 2010"}, {"Title": "Great Plasma for the price", "Author": "alpen", "ReviewID": "R25U6YU8T1F8WO", "Overall": "4.0", "Content": "This TV is easy to set up. You cannot leave the picture on standard video as it is too dark (energy saving?). You also need to turn down sharpness a little to avoid ghosting on some programs (football games). As with most, I wish I had gone up to 46 inch as the 42 inch is a little too small for the location.Very Satisfied with this purchase through Amazon.", "Date": "November 30, 2010"}, {"Title": "Plasma TV", "Author": "J. Wilkins \"FlyingJ\"", "ReviewID": "R15OK6FRITXM2J", "Overall": "4.0", "Content": "I have used Panasonic products in the past and have always been pleased.  That is the major reason I selected another Panasonic television.  This 42\" Plasma TV has not disappointed me. If there is any one thing I might consider a bit weak it would be the speakers.  However, I am reluctant to make that statement because a major part of the problem is that I have a severe hearing impairment.  I'm glad I made the purchase.  I would do it again.", "Date": "October 31, 2010"}, {"Title": "Big Fan", "Author": "Brett Gardner", "ReviewID": "R3IVXA612AIS1Z", "Overall": "5.0", "Content": "I have been looking at amazon for about 6-7 months now looking at TVs in the $500 price range. I was definitely looking for either a 37\" 1080p tv or a 42\" 720p for that price point. After finally stumbling on to this TV, after looking at the price and all the features it had I was still a little weary that a TV of this caliber wouldn't be that great.After mulling over it for 2-3 weeks I decided to listen to the great reviews and buy it. The shipping was great they worked with my hectic 60 hour a week schedule. It was scheduled to show up between 11am-3pm they showed up at 12pm. They did offer to bring it upstairs and set it up for me but I would rather do it myself. Box came in prestine condition, didn't even look like anyone touched it. They did a great job of handling it.Now for the TV. It was like experiencing being able to see for the first time. My brother in law has 3 insignia hdtvs at his house and this looks so much crisper. I was floored by everything, I watch everything in Cinema mode and Games on my xbox in game mode look nothing short of breathless. I recommend anyone looking for a top notch tv under $600 this is the Tv there is nothing else like it.", "Date": "October 16, 2010"}, {"Title": "GORGEOUS PICTURE but My First one was defective.", "Author": "culpeper", "ReviewID": "R39PE1XWINDN2D", "Overall": "5.0", "Content": "Panasonic knows how to make plasma TV\"s This one is far superior to the C or U series in my honest opinion and if calibrated correctly is VERY close to the G series, without all the extras that you can obtain by simply connecting your PC via HDMI. Excluding the THX mode, which you can use a THX disc to calibrate anyways and save money. Finally, don't be a fool and play the contrast ratio game.  This TV is more than Adequate and paying any more for a higher contrast ratio is just a waste of money!", "Date": "October 13, 2010"}, {"Title": "Great T.V. and Support", "Author": "LoveAmazon", "ReviewID": "R3HCZ4DTPFCWIZ", "Overall": "5.0", "Content": "This is a great plasma TV, we really like it and for the price its awesome!  I don't really know the technical details but it has great color & blacks.  We waited over a year for this purchase and are very happy. In addition - do not worry about ordering on line & delivery.  We live in a very rural area where shipping can sometimes be a hassle, but this arrived on time (actually early).  Unfortunately on arrival there was 2 small dents on the back cover (the TV was functioning great, but I was concerned about possible future problems).  I emailed Amazon with problem, they called me within 2-hours and set up an exchange immediately, no hassles, no issues!  We now have our replacement and couldn't be happier.  AMAZON ROCKS!", "Date": "September 3, 2010"}, {"Title": "Great TV at a very good price and, \"white glove\" delivery for free...", "Author": "Chuck M.", "ReviewID": "R1EVY8AI37RII", "Overall": "5.0", "Content": "My wife and I love this new Panasonic 42 inch plasma TV. Great picture!  Best price arround and, the free white glove delivery was great.. I've been telling everyone about Amazons great service and value...", "Date": "August 4, 2010"}, {"Title": "14 months and it's a goner!", "Author": "Grumpyhead \"Grumpyhead\"", "ReviewID": "R358KNYJAD2WAH", "Overall": "1.0", "Content": "Tonight the TV shut down without warning. The power light is blinking 7 times and that is supposed to be the diagnostic code for the problem. I still have to translate what it says to figure if it's a simple parts swap or something worse. Really unhappy since I'm sure the warranty is 12 months.", "Date": "March 4, 2012"}, {"Title": "Do not buy this TV!!!!!!!", "Author": "NoPanasonic", "ReviewID": "R316OGZ2HUYUB6", "Overall": "1.0", "Content": "Do not BUY THIS TV... I owned it for 13 months and the TV DIED, it will not power on. I called Panasonic support and no help at all. DO not buy this TV, if you do it will be a waste of your money.", "Date": "January 11, 2012"}, {"Title": "Good TV and good price", "Author": "Ting Liu", "ReviewID": "R3VDWFQEHNPE41", "Overall": "5.0", "Content": "I have owned this TV for a few weeks and found it to be excellent.Some reviewers have mentioned that this TV is a little dim and noticed haze while watching the TV. I have observed these too while watching low quality TV channels (e.g. 480i/sd) and the TV mode is not set to the correct mode e.g. cinema. However, once you use high quality input source, it delivers clear pictures.Some reviewers have also suggested to break in your new plasma for the first 100 hours. but based on the discussion from AVS forum, it is not conclusive for the new 2010 models. I personally do not follow break-in process rigorously as the technology has advanced so much, but I do run break-in pictures once in a while to clear the image retention issues that I have observed. It does solve the issue nicely.Comparing LCD vs Plasma, I do think Plasma is not as bright as LCD. But the picture quality is not all about the brightness and the price of this TV from Amazon ($550) makes it a good sale.Comparing Panasonic with Sam Sung, I personally do not like SamSung. I had Sam Sung LCD before and it broke within just 4 years normal usage while each and every Panasonic TV I bought lasted more than 10 years and still working. Went to newly-opened Best Buy (4 months only) and noticed one of SamSung TV already had the broken pixels in certain areas.More importantly, Panasonic (formerly known as Matsushita) is the first one who researched/commercialized the plasma and now the #1 leader in the plasma technology, so I think I made a good decision in purchasing this TV from Panasonic.In conclusion, it is a good TV with very good price.", "Date": "December 13, 2010"}, {"Title": "great buy for the money", "Author": "AmazonFan", "ReviewID": "R2LFCY0B5BXMHS", "Overall": "4.0", "Content": "I am a huge user of Amazon, but it took two weeks after purchase to get the tv using the free shipping. A bit long, but CEVA met all my expectations, unpacking the TV and setting it on the console for me. I did tip them well, so I don't know if that is usual service, but I was very happy with delivery when it finally came.The TV has a very good, clear picture on TV shows filmed in HD.  Not quite as sharp as my 1080p Visio LCD, but very good and I am happy with it. The blu-ray discs on my Panasonic player are simply outstanding in sharpness and clarity with this TV.All in all I am very, very pleased with the TV!I did talk to Panasonic about the burn-in issue.  Everything I'd read said to keep contrast and brightness <50 for 100-200 hours.  The support person at Panasonic said not to worry about it.  I did tell him that I would have the TV on 12 hours a day every few days and he said that didn't matter.  Hope he's right!", "Date": "August 20, 2010"}, {"Title": "great tv", "Author": "J. M. Maggi", "ReviewID": "RO5VE0NGIC132", "Overall": "5.0", "Content": "I expected a good tv when I ordered it from my research, after a couple weeks I couldn't be happier. Great picture, so sharp it's a little scary and the sound is very good with controls operating in a logical way.", "Date": "July 7, 2010"}, {"Title": "Excellent value for money", "Author": "Ramesh K", "ReviewID": "R3HQOQMLPWEW9W", "Overall": "4.0", "Content": "Bought this to replace my 32\" 720p LCD TV in my bedroom. Very happy with the picture quality. Vierra link works very well with panasonic blu Ray player. Good picture in standard def as well. Not so good sound, but it works for me.", "Date": "August 23, 2010"}, {"Title": "Excellent TV", "Author": "Dr. Richard H. Knee \"Docknee\"", "ReviewID": "R2ZCKI9RKKZVO0", "Overall": "5.0", "Content": "This has been an outstanding TV for my man cave.  Great Picture with easy install for home theater etc.  Menu system is simple and easy to use.  Ideal for a second unit in your rec room or man cave area.", "Date": "November 21, 2013"}, {"Title": "Blown Scan Board In Less Than 4 Years", "Author": "Kimberly J. Morr", "ReviewID": "R9SAXLVBJJIUK", "Overall": "1.0", "Content": "I bought this tv for my wife as a Christmas present in 2009. In October 2013, I hear a loud 'pop' and lose the picture. At a local repair shop, they tell me the scan board is shot and it will take $469 to fix. I bought this from Sears, with an extended 3-year warranty. When I asked the technician at the local repair shop why it would do this, his reply was it was common for plasma TV's to do this after 4-5 years due to heat, and that was why they no longer sold plasma TV's, only lcd or led. I contacted Panasonic for a reason why. They said to send them a copy of receipt plus copy of service estimate by email and they would review it and get back to me. I confirmed their receipt of copies and have been waiting a week with no response from them. This was a gorgeous tv with a phenomenal picture. I can't tell you how many times my wife commented that she loved her tv. This is a colossal disappointment. Written by Robert Drabing.", "Date": "October 31, 2013"}, {"Title": "Great TV, I bought 2", "Author": "THE LINDEN'S", "ReviewID": "R2B562IH7OHDU1", "Overall": "5.0", "Content": "The first one I bought offline because I thought buying TVs online was not the best idea. Second one I decided to give it a shot. Got here fine, works just as great as the other!", "Date": "July 16, 2013"}, {"Title": "Big Mistake", "Author": "Michael J. Seitz", "ReviewID": "R3JZDODAVHZRN", "Overall": "1.0", "Content": "Purchased this t.v. in November of 2010. Within 3 weeks it was in the repair shop to replace a bad board. I thought \" well o.k. it's just a little glitch\". Well fast forward to November of 2012 and it's toast AGAIN! Cost to repair $381.00 . Called Panasonic service to express my dissatisfaction. I mean after 2 years and 2 repairs I'm not getting a warm fuzzy feeling that my purchase was a wise one.The customer service made me an \"offer\" of $89.00. Really? for my $800. T.V. that has lasted all of 2 YEARS? Not acceptable. Then they offered me $ 107.00. Oh goodie a whopping  $18.00 more. The bargaining continued and their final offer was  $ 179.00 . What a lousy way to treat your customers ... see how cheap you can get away with taking care of a customer who really hoped he would have a nice quality T.V. for a long time. Now I have been waiting weeks for the repair shop to get the part. I will not be buying a Panasonic product again.", "Date": "April 28, 2013"}, {"Title": "Great picture with big caveats", "Author": "Tree Weezel", "ReviewID": "R3CN0XXQWOFAND", "Overall": "3.0", "Content": "Once it's warmed up everyhing looks great.  The quality is so good that you can use it as a monitor, but I wouldn't put this great screen to such a mundane task.Biggest issue is that this puts off so much RF interference that it kills all TV reception.  I have to record TV on my computer and watch while something ELSE isn't recording.  So as a traditional television, where you sit on a couch and flip channels, this is a failure.Second biggest issue is that I have a very slight 4:3 burn in.  I've been off 4:3 viewing on this thing for a few months and it persists.", "Date": "April 4, 2013"}, {"Title": "Great Picture So-So Sound", "Author": "Karen W Engel", "ReviewID": "R22973CVAPFPO6", "Overall": "4.0", "Content": "I've owned this TV for 2 years now and use it daily for at least a few hours. The picture quality is excellent with colors quite vivid with little adjustment needed. The sound quality is just fair but no worse than a CRT TV. If you're going to use it for DVD or blue-ray movies, I'd run the sound through a surround or stereo system Only problem I encountered came when I tried to use separate audio and video cables from an older VCR. I created an loud buzz in the sound output. But the problem may have been in the cables, as I get no buzz in any other programming.", "Date": "November 14, 2012"}, {"Title": "Ive owned this tv for 2 years now", "Author": "Mr Mexico", "ReviewID": "R3UGT3C9SOOE2B", "Overall": "5.0", "Content": "This tv is awesome!  its got a better picture than most lcds and its 2 years old and still new to me.  Hangs on the wall lookin sleek, and burn in is no issue, i leave it on all the time.", "Date": "February 8, 2012"}, {"Title": "The Folks LOVE IT!", "Author": "Hwy 35 Rch", "ReviewID": "R21EJXXG9KIFE", "Overall": "5.0", "Content": "The folks hadn't had a new TV in 30 years and they LOVE IT! Almost a year of daily use and absolutely no problems.", "Date": "November 24, 2011"}, {"Title": "Very Pleased", "Author": "Paul J. Jezierski \"tall paul\"", "ReviewID": "R2TILDNASCYW8Z", "Overall": "5.0", "Content": "I must admit I am a Panasonic fan. I have owned Panasonic electronics for most of my life, and they are rugged and perform well over the lifetime of the product, which is usually longer than other electronic brands I have had. I have a Panasonic VIERA G10 Series TC-P50G10 50-Inch 1080p Plasma HDTV that has worked perfectly since I purchased it from Amazon in November of 2009. I belong to a sportsmen's club that wanted to put an additional 40 inch TV in the bar area. I told them to refrain from the temptation to run down to the nearest big-box store and buy the first set they saw. Instead, I volunteered to do the research, and if the price was right, make the purchase. I found an open box unit TC-P42S2 with a blemish on the stand for $419 delivered. Since we were mounting it on the wall, the blemished stand was a non-issue. It's been a month now, and this set has not disappointed. There were a few naysayers who poo-pooed Plasma because they personally owned LCD technology, but little by little everyone who takes the time to look at this TV is becoming a believer in Plasma technology. The cable box is connected via an HDMI cable, and the Hi Def channels are razor sharp, and the fast movement of sporting events is delivered beautifully on this set. Viewing angles are not a problem either. This TV looks fantastic no matter where a person is in the room. This TV is a great value if you can get it for under $450.", "Date": "September 6, 2011"}, {"Title": "Too glaring to eyes", "Author": "Ashok \"ashok\"", "ReviewID": "R15D38F4BPD7UK", "Overall": "4.0", "Content": "We had other models of Panasonic TV in our family.I was so impressed that I ordered for this but did not turn out to my expectation nor was the picture quality was  equal to our other models in the family.Supplier was kind enough to take back.Great service.", "Date": "June 27, 2011"}, {"Title": "This TV is fabulous...", "Author": "Cecil", "ReviewID": "R3G5HZLPAOBZTH", "Overall": "4.0", "Content": "This TV is fabulous.  The colors and picture in HD are Photoshop quality.  I searched high and low, compared the S2 with its rivals and none came close at this price point.  The only thing better is the GT series but why folk over the extra cash.  I read the reviews, weighed the pros and cons, and trust me this TV is the one.  It took over 3 month of consternation before I pulled the trigger and I'm glad I did.  If you watch standard definition this TV isn't for you but if you love HD and bluray, this is what you've been waiting for.  Plasma beats LED and LCD hands down.  During the day this TV shines but at night in low light, this TV will blow you away.The sound quality from the built-in speaks suck but who buys a plasma that doesn't have surround sound?  Plasma and surround sound is a match made in heaven.  I caught a deal on the 42\" and I'm loving it.  My only regret is that I didn't go bigger.", "Date": "June 16, 2011"}, {"Title": "Great TV", "Author": "ffej423", "ReviewID": "R2R1N04536BGY1", "Overall": "5.0", "Content": "This tv is exactly what I hoped it would be. The picture is great. Don't believe the horror stories. It's inevitable that a few units will be bad. Plasma is the way to go. LCD and LED are old technology. Burn in is not an issue. A friend left the tv on all night on the Xbox home screen. It has a lot of stagnant images, but there wasn't even the slightest sign of burned images.", "Date": "March 29, 2011"}, {"Title": "Great Tv", "Author": "Jim", "ReviewID": "R3S9BGX0T1TKLS", "Overall": "4.0", "Content": "I've had this TV since christmas works great. I play video games on it all the time and right out of the box. Haven't had any IR or ghosting at all. Picture is great, sound is ok.", "Date": "March 3, 2011"}, {"Title": "Plasma live up to its reputation", "Author": "Mike Miller", "ReviewID": "R2Y5S1P0QR2V3R", "Overall": "5.0", "Content": "We're delighted we chose the Panasonic TC-P42S2 42-Inch 1080p Plasma HDTV after much research and comparison of plasma vs LCD. Picture quality is absolutely beautiful. Blacks are black, shadows detail is great and highlights are clean. Highly recommend! Sound from built in speakers is OK, better than expected. Picture controls work, but could be better organized and easier to use. All in all, especially considering the price, this is the champion HDTV of it's class.", "Date": "February 27, 2011"}, {"Title": "Very Pleased", "Author": "Lynne", "ReviewID": "R2GAZEKYN62254", "Overall": "5.0", "Content": "Great TV... Picture quality is excellent; good rich color.  We use it without any additional speakers, so the tv audio is a bit fuzzy beyond 30-volume; but below 25, the sound is good.", "Date": "February 16, 2011"}, {"Title": "Panasonic TV", "Author": "Marianne", "ReviewID": "R1CUW1P4BHZWPL", "Overall": "5.0", "Content": "It was received in good time. Set up was easy once we bought the right cables and figured out the TV/Input.  It was set to TV, not HDTV and we thought it was the cable box and needed a service call.  The quality is super.  No glare that we worried about.", "Date": "February 2, 2011"}, {"Title": "Great TV", "Author": "R. Morgner", "ReviewID": "R2S5TATOGKT2DB", "Overall": "5.0", "Content": "This is my first large screen TV and I'm very satisfied with the choice I made. The colors really pop and the picture quality is great. I watch more movies than TV and really enjoy the clarity of HD and Blu-ray movies on this screen. Setup literally took just a few steps and I was watching TV in 15 minutes! Most of the setup time was in waiting for it to search for all the channels. Delivery service from Amazon was excellent too. My older eyes love the large buttons on the remote and its overall simplicity. Viewing photos via the SD card slot is very simple, and large file size JPGs (6-9MP)are extremely sharp looking at the almost full screen size they display. I bought an Amazon brand 2m HDMI cable to connect the TV to a Panasonic Blu-ray player I purchased at the same time and everything functions great. Streaming Netflix wirelessly through the Blu-ray player to the TV works like a charm, and I am really enjoying movies on this larger screen. I was a little concerned about reflections on the screen as the room it's in has 3 windows and 3 lamps. However, I have to say that the well lit room causes no problems with screen reflections that are bothersome to me in any way. Contrast is great even with all the lighting. I have had several Panasonic products over the years and have never had any problems with them. I've been using the TV for a couple months now and have not one complaint so far. I would definitely recommend this TV for its quality, ease of installation, and ease and simplicity of use.", "Date": "January 28, 2011"}, {"Title": "Panasonic TC-P42S2 from Amazon.com", "Author": "royl", "ReviewID": "R8SBDM80D3KTO", "Overall": "5.0", "Content": "After a lot of research and reading various reviews, I decided to purchase the Panasonic plasma p42s2. I ordered it the day before Christmas and received it on Dec. 30.  It took me just 10 to 15 minutes to set it up and view the first program.  This was after my son-in-law helped me unpack it and set it on the stand.  We replaced an old 27\" RCA so you can imagine the difference the 42\" flat panel makes in our TV viewing.  The adjustments/settings, access to menu and items in the menu were straight forward and easy.  The picture quality is great, just like it was when viewed in the store before purchase from Amazon. The sound quality of this TV is amazing considering that it has such small speakers, etc. Viewing a football game on this set is a joy.  I would recommend the TC-P42S2 to anyone who needs this size and wants superb quality.", "Date": "January 22, 2011"}, {"Title": "A wonderful TV", "Author": "jud", "ReviewID": "R1LTKJZ8BVZ2ZL", "Overall": "5.0", "Content": "We purchased this along with a blue ray player to replace a smaller lcd hi-def tv which migrated to our bedroom.  This picture is as good or better than I have ever seen elsewhere. The performance/gadgets of the pair of devices is simply terrific.  Delivery was right on time and the setup was a breeze.  This is one off the smarter things I have done.  Well done Amazon.", "Date": "January 20, 2011"}, {"Title": "Great TV! Lots of usable features", "Author": "Leah D. Gordon", "ReviewID": "R2O04VI1VZXMC0", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3NACZQD94ADQUembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3NACZQD94ADQUrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo3NACZQD94ADQUchiDiv\").innerHTML = document.getElementById(\"cv_mo3NACZQD94ADQUhiddenPre\").innerHTML;\n};\ncv_mo3NACZQD94ADQUrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3NACZQD94ADQUso;\t   \n\n\nfunction cv_mo3NACZQD94ADQUloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3NACZQD94ADQUso = new SWFObject(swfLocation, \"cv_mo3NACZQD94ADQUAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3NACZQD94ADQUso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3NACZQD94ADQUso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3NACZQD94ADQUso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3NACZQD94ADQUso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3NACZQD94ADQUso.setAttribute(\"height\", swfHeight);\n          cv_mo3NACZQD94ADQUso.setAttribute(\"width\", swfWidth);\n          cv_mo3NACZQD94ADQUso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3NACZQD94ADQUso.write(\"cv_mo3NACZQD94ADQUflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3NACZQD94ADQU', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3NACZQD94ADQU';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3NACZQD94ADQU', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3NACZQD94ADQUloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3NACZQD94ADQU\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3Q3ARV8P2BFI4\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3Q3ARV8P2BFI4\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2O04VI1VZXMC0\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3Q3ARV8P2BFI4/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3NACZQD94ADQUduration')) {\n      document.getElementById('cv_mo3NACZQD94ADQUduration').style.display='none';\n    }\n    cv_mo3NACZQD94ADQUloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3NACZQD94ADQUloadSwf(movieID, playerVersion) {\n   return _cv_mo3NACZQD94ADQUloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3NACZQD94ADQUnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3NACZQD94ADQU', 0, h);\n}\n\nfunction cv_mo3NACZQD94ADQUresetPlayer(w,h,bw,cc) {\n  cv_mo3NACZQD94ADQUnewHeight(h);\n\n  cv_mo3NACZQD94ADQUso.addVariable(\"resetBandwidth\", bw);\n  cv_mo3NACZQD94ADQUso.addVariable(\"cacheCode\", cc);\n  cv_mo3NACZQD94ADQUso.setAttribute(\"height\", h);\n  cv_mo3NACZQD94ADQUso.setAttribute(\"width\", w);\n  cv_mo3NACZQD94ADQUso.write(\"cv_mo3NACZQD94ADQUflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3NACZQD94ADQURollOverImg = new Image();\ncv_mo3NACZQD94ADQURollOverImg.src = \"http://ecx.images-amazon.com/images/I/816k%2BkkYcfS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3NACZQD94ADQUpreplay = document.getElementById('cv_mo3NACZQD94ADQUpreplayImageId');\nif (cv_mo3NACZQD94ADQUpreplay) {\n  cv_mo3NACZQD94ADQUpreplay.onmouseover = function() {\n    cv_mo3NACZQD94ADQUpreplay.src = \"http://ecx.images-amazon.com/images/I/816k%2BkkYcfS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3NACZQD94ADQUpreplay.onmouseout = function() {\n    cv_mo3NACZQD94ADQUpreplay.src = \"http://ecx.images-amazon.com/images/I/816k%2BkkYcfS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3NACZQD94ADQUpreplay.parentNode;\n\n  var cv_mo3NACZQD94ADQUcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3NACZQD94ADQUcurrentClick) {\n      return cv_mo3NACZQD94ADQUcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 1:37 MinsWe gave this TV 5 stars! We made a MAJOR upgrade, so didn't have anything to really compare it to. We didn't want an overloaded TV with features we would never use, but did want certain features such as viewing home video and photos. HD makes a HUGE difference! Viewing home video at such a high quality is very enjoyable!", "Date": "January 11, 2011"}, {"Title": "Really Excellent for the money", "Author": "Laura J. Mazich", "ReviewID": "R19ITFDNRCWP8D", "Overall": "5.0", "Content": "This has a execellent picture.  Easy to hook up to my current multi media receiver.You can't beat this for the $685.00 I paid! 11/24/12. Just up graded to a 50\" Panasonic plasma.  Gave the 42\" to a friend, still running great.", "Date": "January 10, 2011"}, {"Title": "Nice plasma, some nits keep it down", "Author": "Phillip Else \"3D Man\"", "ReviewID": "R2QMC8SX1J0LZ7", "Overall": "4.0", "Content": "I went back and forth on this and an LCD for a new TV for my mother, who finally decided to take the HD plunge.  She hates when a picture changes at different angles, and I have also heard LED LCDs give a \"soap opera\" effect, so I decided to go with a plasma.  I figure it would have deeper blacks as well, and no motion problems.The biggest improvement was enabling the picture change settings posted here and at AVS Forum.  I boosted the brightness and contrast a bit because of ambient light.Speaking of which, the so-called \"anti-reflective\" screen leaves something to be desired.  It seems to make MORE reflections, but boosting up the brightness seemed to help, and of course turning all the lights off is best.SD is better than I thought although obviously the worst thing you'd watch on it.  DVD through the component looks pretty good, I wonder if it would be improved through upscaling on a Blu-ray player.  The HD feed is through Time Warner Cable, and looks from good to excellent depending on the channel.  I do see some \"floating blacks\" sometimes as they get greyer during dark scenes and darken up during bright ones.  It's not too bad, but a bit disappointing.  Another thing is when I stick my face up to the TV I see a lot of \"noise\", but when I back up to a proper viewing distance it looks fine, so I'm probably nitpicking there.  I think the picture could be better, but in fairness I have not connected a 1080p source so I bet it soars when that is connected.Another strange thing is sometimes the picture settings go back to standard when I switch inputs, but it seems to have stopped doing that.  Sound could be better, but ideally speakers/amp would be how you go to match the picture.Overall I think this is a strong TV for HD.  It could be better, but I'm pretty nitpicky on little things.  I did get hypnotized a few times, like when Fantastic Mr. Fox came on HBO in HD, so that's the ultimate test really when it pops right out of the screen.(who needs 3D)", "Date": "December 29, 2010"}, {"Title": "Panasonic TC-P42S2", "Author": "jeb", "ReviewID": "R3DANGWLLGUI14", "Overall": "5.0", "Content": "Wow !  What a great picture.  We love that it does not reflect!  It is our first HD TV and what a difference.  A bit hard to get everything (DVD, VCR, Stereo system) all connected correctly, but once we did it is amazing.", "Date": "December 28, 2010"}, {"Title": "great tv", "Author": "puricoso", "ReviewID": "R78O3E4NGEO7K", "Overall": "5.0", "Content": "After chasing hdtvs on amazon we finally decided on this one. Had very good reviews so we bought it. So far I am pleased with this TV.", "Date": "November 15, 2010"}, {"Title": "excellent tv", "Author": "J. Huffine", "ReviewID": "R336O37PHO64BS", "Overall": "5.0", "Content": "I would only echo the positive reviews by others.  Downside is sound quality, but I expect the vast majority of people will use a seperate reciever/speaker sound system. Also a 10 second delay when turning on, but this is a minor complaint.", "Date": "November 2, 2010"}, {"Title": "Amazing Picture, Works Great @1080p 60hz with ATI HD 5750", "Author": "NPG_Rey", "ReviewID": "R9OKVNM48WG5V", "Overall": "5.0", "Content": "I have only been using this tv for about 24 hours and I must say it looks amazing. The only problem I have run into is that when I use it as a computer monitor there are slight errors. It seems that you have to turn on your tv then turn on your pc. Also it seems to be picky about the HDMI wiring. Initially the picture was a lil fuzzy but setting a few things and it looks amazing. I ordered a new HDMI and it seems to clear the problems. (Problems are: the sound cuts out sometimes, the picture seems to constantly readjust). Outside of my computer problems this thing is amazing on the xbox 360. It is as if I am playing in a whole new world.EDIT: The problem is the HDMI cable that I bought from wal mart. Its a Phillips brand with ethernet. I have been using a longer wire but its a High Speed HDMI and I haven't had an issue. So if you have a computer you will have to buy one with an HDMI out. The computer is plug and play and looks amazing. To me it looks better then any I would see in a store.", "Date": "October 19, 2010"}, {"Title": "excellent value and picture", "Author": "paul b wiseman", "ReviewID": "R2PCOEFB31PMZP", "Overall": "5.0", "Content": "Led or plasma? Plasma seems sharper and can adjust to movie mode for softer viewing (which I prefer). The reduced glare screen was also a key factor in the purchase along with the value for the $.", "Date": "September 20, 2010"}, {"Title": "Quality TV, INCREDIBLE PRICE!!!", "Author": "dgreen", "ReviewID": "RYZEBKFFY9MX0", "Overall": "5.0", "Content": "After browsing through a ton of TVs I decided on this one.  Partially because I had seen it in stores, but mostly because it had been recommended to me by a close friend in the industry.  The price was just right, much lower than any of the local box stores,and the quality is a great step up from the old LCD I've had for years.  Paired this with a Logitech Harmony 650 to round off my existing entertainment system.  I love every minute spent watching this crystal clear, super sharp TV!", "Date": "September 18, 2010"}, {"Title": "TV", "Author": "Walter Steuber \"early adapter\"", "ReviewID": "R21P8S3INNL3H4", "Overall": "5.0", "Content": "I ordered this plasma TV from Amazon and they passed the order on to another company to fulfill.  The package arrived promptly from across the country but was broken up inside, apparently due to heavy handling by UPS.  A replacement was shipped from Japan and it, too, arrived promptly, but had a serious flaw in its display.  This looked like it had left the factory without being checked for operability.  A third set was promised from Japan for delivery a month later and handling our order was turned over to a Panasonic dealer just a few miles away.  They came around immediately and replaced the faulty set with a good loaner which they very nicely installed.  After the month went by, they came around with the new set and installed it, again very nicely.  The TV picture is absolutely beautiful.", "Date": "September 17, 2010"}, {"Title": "delco3", "Author": "GE Bledsoe", "ReviewID": "R6IV14BUGNS3B", "Overall": "5.0", "Content": "Only had the unit for 2 days.  The picture quality is incredible.  Bright, crisp, rich colors and the black is excellent.  Setup was a snap, can't wait to watch a blue ray movie.", "Date": "August 18, 2010"}, {"Title": "Still very happy", "Author": "Eager Reader", "ReviewID": "R270LE2YK4VKZA", "Overall": "5.0", "Content": "We bought this TV a couple of years ago so we could drop cable and view by streaming.  This has worked very well. When content is available in HD, the picture is amazing. Broadcast channels are so crystal clear you can see newscaster's make-up lines. SD movie content is pretty vivid on the sizable screen and most SD streaming content is also quite adequate. I'm thrilled we made the switch when we did and that this TV offers such an amazing picture. The only downside not related to the product, but the overall goal is that many streaming sources now only offer HD content for certain products and this TV is not one that is listed by Amazon.", "Date": "July 12, 2012"}, {"Title": "Great TV", "Author": "Nana Di from WI", "ReviewID": "R2FZ9J61IHOHKL", "Overall": "5.0", "Content": "Very good TV for the price.  Our first plasma, our first big-screen TV, and it's great.  Our blu-ray player and our Wii work beautifully with it.  We feel, as folks who are new to the plasma HD experience, that the picture is a huge improvement over the old TV. It's just the right size for our family room.", "Date": "February 4, 2011"}, {"Title": "Wow", "Author": "jbembe", "ReviewID": "R3CDOEGGEAX9UZ", "Overall": "5.0", "Content": "I got this TV from the great black friday sale. It is an amazing improvement over the 10 year old CRT tube we had, so I can't say I'm too good at the technical details and there is no comparison. After hooking this up with HDMI cables and a compenent setup for the Wii, I have to say it is quite amazing. We also got a PS3 to play blurays, and not only do bluray movies look arresting, but I have found black ops to be totally amazing on this as well. I'm still nervous about making such a large purchase online, but so far there has been few concerns. I am paranoid about it though, after reading many articles on AVS forum, and eventually want to make sure I have the color setup properly. It is hard to tell because I don't have a \"perfect\" standard to compare too, but it looks much better than our old TV and I didn't want to deal with the hassle of playing test slides for 100 hours on initial setup.I was a bit annoyed with the delivery people who didn't want to even let me take it out of the package and let me check that the thing turned on because they were in such a rush. They asked me to sign papers saying everything was working and we had a nice argument as to whether they were actually supposed to make sure everything worked before taking off, with them arguing that I didn't get the \"platinum\" delivery option so they didn't have to do any of the things they wanted me to sign off on. I felt I was getting BS-ed but they let me take it out and make sure it turned on. I was also worried about the fact that the thing arrived nearly frozen (Michigan is cold in the winter), which can't be good for electronics can it? I have also heard a bit of creaking and wonder about the front bezel which has two dimples in the front and has some areas that creak when pressed, whereas other areas show no creakiness (anyone notice dimples front bottom or creakiness in their TV, is this a huge issue?) I don't know if this is normal or will affect the future performance of the TV, but so far everything looks OK.", "Date": "January 3, 2011"}, {"Title": "excellent value", "Author": "arkie", "ReviewID": "R24V439X54U3VZ", "Overall": "5.0", "Content": "I received this Plasma TV about 3 wks ago.  Thanks to Amazon packing the TV in an additional container it arrived without a scratch. The picture quality is excellent and setup was easy. The price for TV from Amazon was better than other sites I checked.  I would recomend this TV and Amazon to my friends.", "Date": "December 28, 2010"}, {"Title": "User friendly", "Author": "N. Thomas", "ReviewID": "R3O7FXXCOEF7LW", "Overall": "4.0", "Content": "Good visuals on the TV, and sound is normal. It was easy to set up and does the job so far. Was leery of Plasma, but it does have good black levels, and vibrant colors.", "Date": "October 14, 2010"}, {"Title": "Great except for one thing...", "Author": "atomx", "ReviewID": "R3NNTBBG7LEUKO", "Overall": "3.0", "Content": "Great picture, great price.  My only complaint is that the image retention problem has not been fixed.  I have owned this TV for less than a year.  I am a big soccer fan, and have watched many games on this set, and the FOX Soccer Channel /English Premier League score line logos are burned into the screen.  Scrolling helped a little, but the images still exist.  I imagine the problem will only get worse as the TV ages and the images continue to get burned onto the screen.  I don't believe my next set will be a plasma.", "Date": "February 6, 2011"}, {"Title": "panasonic tv", "Author": "Amazon Customer", "ReviewID": "R2O2YOCIIYVOU4", "Overall": "5.0", "Content": "Very please with the television, had some issues due to the Holidays, but the seller did contact us and try to make things right.  They had an overload of orders.  I was very impressed on how the seller called personally to make it ok.  Thanks", "Date": "January 3, 2011"}, {"Title": "DO NOT PURCHASE THIS TV", "Author": "Albert Sutcavage", "ReviewID": "R2QNBYQFEMQ85R", "Overall": "1.0", "Content": "I always liked Panasonic flat-screen TV picture quality.  When it came time to buy a TV for our bedroom to mount on the wall, I researched only panasonic and found this tv to meet my quality vs price value proposition.  I purchased online from a reputable company, the TV shipped via Pilot and it set up easy enough.  A few days into use the TV would not power on and got was I learned online to be called the 'blinking power led' spiral of death.  Mine blinked 10 times, then reset.  As an electrical engineer that now manages teams of service people that install video for corporate use, this looked like a DOA situation.  I checked outlet voltage, connections, and all the expected things.  I contacted my on-line company who first referred me to Panasonic support.  In the meantime I learned of many others with this power problem and their horror stories on this series of HDTVs from Panasonic.  Now upset I made a mistake, I reached Panasonic support after looking up the problem the support person told me it would have to come in for repairs (3 days out of the box), I said I don't think so and returned it (thanks reputable online store) for full credit.I will be purchasing another brand.Just goes to show that how much research you do, your still bound to these kind of problems.  In this case, an apparent chronic issue that others shared comes back over time even after weeks of repairs, and if out of warranty - local electronics re-cycling time.  No thanks.  I'll find a brand that last for years thank you very much.  I still have a Sony built in 1984 running fine in my 5 year old's room.  If he throws the Wii controller at it, it will just bounce off and hit him in the head.Audio/video quality has gone up, but manufacturer standards and worksman ship has sure gone down.Thank you Panasonic, I don't think I'll try you again.Signed, regrettable.", "Date": "January 13, 2011"}, {"Title": "Good for the money", "Author": "PostalWings12", "ReviewID": "R35248WHA1K65T", "Overall": "3.0", "Content": "The picture quality is very good, high contrast, though I have read in PC World or Consumer Report, I can't remember which at this time because I'm also watching TV in the background, that Sony's Bravia plasmas might have the best image quality. But Panasonic is second to only one for a reason, highly functional, durable, and reliable. However, as a nerd, I'd like this to have a VGA port or two for a dedicated PC. Also, the speakers face the rear of the TV and are of pretty poor quality. Invest in external speakers.", "Date": "January 23, 2011"}, {"Title": "game mode?", "Author": "Bryan Weiss", "ReviewID": "R2APYFKMPSHBOE", "Overall": "4.0", "Content": "had to put it on game mode for hd picture quality. think its a bad setting on tv but it works and not sending back. took forever to find this.", "Date": "December 19, 2010"}, {"Title": "One slght problem", "Author": "scooter", "ReviewID": "R20MG281IQOUQ8", "Overall": "5.0", "Content": "I am well satisfied wit the TV.  I had A 32 \" Toshba and I wanted a larger screen Mu son had a Plasma set and I felt that his picture was better. The only thing that was better in the Toshiba was that when I turn the TV on the Plasma is a bit slower for the picture to come on than it was on my other set. That set was about 3 years old and is still in use.", "Date": "September 19, 2010"}, {"Title": "Best 2010 Value", "Author": "TucsonShopper", "ReviewID": "R3MXXA16W780HT", "Overall": "5.0", "Content": "I just can't see how anyone could rate this TV with less than 5-stars. You can get more by paying more, but only much more (along with Erok, I defy anyone to suggest a better picture for the same money - I feel a kinship to Erok's story as I also started out looking for an LCD computer monitor for my HDMI PC and was unhappy with the 6-bit color depth producing unnatural colors and poor off angle viewing for affordable Twisted Nematic monitors like the ASUS VE276Q 27-Inch Wide (16:9) 2ms Response Time Display Port LCD Monitor - Black as well as the twice the cost compared to this screen price tags of IPS LCDs like the NEC MultiSync LCD2690W2-BK-SV - LCD display - TFT - 26\" - widescreen - 1920 x 1200 / 60 Hz - 320 cd/m2 - 1000:1 - 8 ms - 0.287 mm - DVI-I, DVI-D, VGA - black - with SpectraViewII Color Calibration Solution... I was planning to wait for an LED LCD until I checked out a similar plasma model). Moreover, how useful are the fancy features? As P. Cook says, after a little more effort tweaking the picture, don't we most all currently have a console, streaming player, or old PC? (and, yes, the Panasonic TC-P42G25 42\" Class Viera® G25 Series Plasma- FREE HDMI Cable + MP3 Player is a good example of what yet another 2 C-notes could get you... but, so is the Xbox 360 4GB Console, ha ha). Solid image quality (especially stunning black and greyscale performance), not too heavy (for my wall mounting), and far better bang for buck than ANY LCD. I think the speakers are slightly better than most but I use a Yamaha RX-V2700 - AV network receiver - 7.1 channel and five Aperion (dot com) Intimus speakers (why get a HDTV and not spend at least as much on the audio?) with a ASUS Internal 4x Blu-Ray Reader SATA Optical Drive BR-04B2T (Black) in an inexpensive HP PC with a HD tuner, remote, and a BTC 9019URF Wireless Multimedia USB Keyboard w/ Dual Mode Joystick Mouse (this is my bedroom system, costing about the same as just one of my main system's subwoofers). This is 2010's best value TV, and I'm very glad I found it.", "Date": "August 29, 2010"}, {"Title": "disappointed", "Author": "john s", "ReviewID": "R7MQCY4F5JURF", "Overall": "2.0", "Content": "I'll be briefBought this set based on consumer report.hook-up was easy..great picture, acceptable sound quality.Set worked for all of 2 weeks...heard a loud snap.Screen went blank..no audio..power light kept flashing  with a slight pause after every 10 flashes. Don't know if this is a cronic problem with this set.Spoke to a few people who have the same set for a nuber of years.They experienced no problems.Called Amazon for a replacement...none available...returned the set.Instead will purchase an LED LCD tv in the near future.", "Date": "December 26, 2010"}, {"Title": "Green Line after a few hours - Amazon's carrier is TERRIBLE", "Author": "Geff TheShopper", "ReviewID": "R1FFKJB8T6B22R", "Overall": "1.0", "Content": "Ordered the TV a couple of days after Thanksgiving. It took 3 weeks to get it delivered by Pilot (amazon's carrier). The TV worked fine for a few hours then showed a vertical green line, 1 pixel thick, about one third from the left of the screen.I called amazon and they offered exchange or refund. I took the refund. It then took more than 2 weeks and a couple phone calls to Amazon (forget trying to reach Pilot directly!) for them to pick it up. I just talked to amazon and it will take another 2 weeks for Pilot to send the TV back to amazon. Then, they will issue the refund. My money will have been unavailable for almost 8 weeks.So the few hours that the TV worked, the picture was very good. No complaint about amazon's service but they MUST get rid of that carrier and I will not buy a TV again from Amazon if they don't use Fedex or UPS.I just got a Vizio 42/120 LCD from Samsclub for less money and if it breaks, I'll bring it back and get my refund the same day.", "Date": "January 7, 2011"}, {"Title": "7 blinking lights of death", "Author": "mb2001", "ReviewID": "R2R3MJA21YR4SL", "Overall": "1.0", "Content": "Shortly after purchasing power button light  went into death throes. Blinks 7 times than stops briefly before it starts over again. TV will not power on. Large circuit board replaced one month ago and now back to doing it again. Google \"Panasonic 7 blinking lights of death\" to see just how widespread the problem is.", "Date": "July 25, 2010"}, {"Title": "Horrible Picture Quality", "Author": "Scott", "ReviewID": "R3N9NQ6YELNUD0", "Overall": "1.0", "Content": "I bought this TV and the picture quality is HORRIBLE.I get 1080p from DirecTV and Xbox 360 and compared to other TV's the picture quality doesn't look like high definition at all.The blacks are incredibly deep but that's about it.It's as if I bought a regular TV for $700.I have tried troubleshooting over and over w/ no success.If you're looking for a new TV, find a TV that can not only recieve 1080p signals but show them on the screen as well.", "Date": "December 10, 2011"}, {"Title": "The WHITE'S ARE so dim they are almost GREY!", "Author": "Trustmeiknow \"Trust me I Know\"", "ReviewID": "R1M0SPEA99IBGG", "Overall": "2.0", "Content": "Aweful picture quality! I am only going to rate this TV based on one feature, because it really is the most important feature, Picture Quality! And this tv fails - MISERABLY!  I was so surprised by all the other positive reviews about this TV that I started thinking maybe I got a bad one.  So I did my research and went to my local electronics where, sure enough, they had this tv on display, and I was able to compare it to surrounding televisions there as well, to confirm that I did not just have bad luck.  I also did some research and found, sure enough, that there are tests out there with confirmation on white levels being way, way too dim with some LCD's being 3-4 times brighter whites.  Apparently a common problem with Plasmas.  I searched \"p42s2 whites\".When I first turned the TV on I immediately shunned the picture quality noticing the greyed out whites right away.  This becomes the most obvious defect but later I noticed an overall haze to the picture quality, which I assume is due to the glare filter.  I was really surprised because I had every expectation that the picture quality would be superb.  My other TV is a Samsung Series 7 (LN40B750, retail $950) and it blows this one out of the water!  Now there is a true TV!  It makes even watching my wife's romantic comedies bearable just due to a Looking-out-the-window realistic picture quality!  Even though I got this TV on sale for $550, including a free Tivo, I just can't justify the cost savings compared to the poor picture quality and white levels.  You really notice it most when most of the screen is white, like a commercial with a white background and a Christmas present in the middle.  It's gotta go.  And I'm not crazy, try a real TV next to this one.  But if you don't know anything better, then maybe you'll be fine... at least until your friends point it out to you.Secondly, and this may not be the fault of the tv, the screen goes dim and brightens again.  I have only noticed this on Netflix so I can't say who's at fault.Disclaimer: Plasmas are supposedly great for gaming.  I haven't used it for serious gaming, just Wii play and I don't see the advantages over my flat screen tube tv on the Wii.", "Date": "November 13, 2010"}, {"Title": "2nd time useing amazon", "Author": "gutterman", "ReviewID": "R6HYYUVXQJM2S", "Overall": "5.0", "Content": "2nd time i order stuff from amazon and still happy with my order,on time and no problemeverything is good . i will order again in time!. so for i got back up camera,seat coversand Panasonic 42 plasma s2 TV (camera,seat covers ) 1st order .very happy with all", "Date": "June 1, 2010"}, {"Title": "Burn in can still happen.", "Author": "Joshua J. Wilson", "ReviewID": "R1ZT75I67HBS51", "Overall": "2.0", "Content": "Unfortunately burn in worriers do need to be worrying.  I've only had this tv for 10 days now and its starting to show some burn in.  I did 2 months of research before buying this tv.  I initially was going to go with a LCD but the features of this plasma are excellent for the price.  I was hesitant on purchasing this tv because it is a plasma which are prone to burn in.  Panasonic had shed my worries with their talk of \"anti image retention\" capabilities, \"burn in is a thing of the past\" and the reviews on amazon.  After 10 days i can slightly see \"burn in\" when certain images are displayed.  I have used the \"whitewash\" feature many times and its still there.  It isn't bad enough to see when watching movies but its there and I can see it sometimes.  I understand there is a break in period and i'm adhering to these precautions.  I hope what i'm seeing is ghosting and not burn in.  I hope this issue will correct itself as the break in period continues.  If you want a tv you can just turn on and watch without worry this is not the tv for you.", "Date": "June 10, 2010"}, {"Title": "pre review", "Author": "Rhett Authement \"coonassboiy\"", "ReviewID": "R2I3ULIESJOSYE", "Overall": "5.0", "Content": "i dont know if this people are right or wrong but monday i will see if this tv sucks are is awesome", "Date": "November 29, 2010"}, {"Title": "Been almost 3 weeks and i still have not gotten my TV.", "Author": "Jordan", "ReviewID": "R2PYY5QNRXXWEF", "Overall": "2.0", "Content": "This company im sure is a great company. They have outstanding ratings and always ship things on time at a great price. My TV costs about 800 and i bought it for 500. The thing is it was so popular that they dont even have enough so they are getting more and i am yet to receive mine. When it gets here i will be excited but until then, lets hope it gets here within a month since i ordered the tv.", "Date": "December 9, 2010"}, {"Title": "Does not work with MACs or PC", "Author": "J. Wandtke \"Hulu Fan\"", "ReviewID": "RYFJ04S3YJ0X8", "Overall": "2.0", "Content": "Don't buy this TV if you want to hook up your MAC or PC.  It does not recognize DVI/HDMI conversion signals from a PC or a MAC.  Does not recognize direct HDMI signals from PC to TV.  Have a new HP PC with a HDMI graphics card TV does not recognized signal.  It would be nice if Panasonic would state in it's tech specs or ads that this TV doesn't work with PCs and MACs.  Great Picture if you only need a TV and never want to connect it to the Internet.  I tried everything, went back to old Sony Vaio with S video connected with S-video to component video only got a black and white signal.  Tried VGA to component video got nothing to work.  My three old Samsung works fine with DVI to HDMI conversion from both my MAC and PCs.  Stick with Samsung.  Took seven contacts to Panasonic support before last rep told me that they were getting many calls about the DVI/HDMI connection not work with MACs and PCs", "Date": "April 17, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "42-inch Plasma HDTV with full 1080p HD resolution; 1080 lines of moving picture resolution\n600Hz Sub-field Drive technology for superb full-HD motion; 2,000,000:1 dynamic contrast ratio\nVIERA Image Viewer for JPEG image slideshows directly from an SD memory card\nInputs: 3 HDMI, 2 component, 2 composite, 1 digital audio output\nIncludes removable stand; measures 40.6 x 27.8 x 12.1 inches with stand", "Name": "Panasonic TC-P42S2 42-Inch 1080p Plasma HDTV (2010 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/51qjhfiE%2BAL._SY300_.jpg", "ProductID": "B0036VO70Y"}}