{"Reviews": [{"Title": "Awesome", "Author": "KS", "ReviewID": "R1KXO5UCQUXI3P", "Overall": "5.0", "Content": "I did a lot of research for TV's in this price range.  I've bought a few plasmas and LCD's previously, and this TV blows them all away.  This is a great price point, size and brand name TV.  You can't go wrong really, you will most certainly be satisfied.  The 120hz setting on Clear works best, otherwise gives your TV content a weird soap opera look, so either set it to Clear or turn it off.  This LCD works great with a PS3 also, and supports 1080p/24hz resolution, so when you watch blurays, the picture is crystal clear.  If you experience any input lag when playing games (delay from button press to action on screen), try setting the source name of your PS3 to PC, it seems to fix that issue pretty well.The sound on this TV is very robust and clear, although when watching blurays I have to turn it up to hear dialogs, which then makes action sequences really loud, but it's not a big deal.The design of this TV is just awesome.  It has the glass bezel and gloss table top, definitely one of the best looking TV's that I've ever seen.  The stand also swivels, which is something every TV should have, but usually don't.The remote works well, and is very sturdy.  The onscreen menus are very clear and even provide descriptions to most of the settings so you don't need to try and figure out what certain settings do.Its a pretty thin and light panel too, so if your mounting it, it should stay pretty flat on the wall.I've got nothing but positives to say about this set, its worth every penny, and I'm usually very critical about electronics, but I'd recommend this LCD to anyone.  It doesn't look that great out of the box, but after a week of playing with the color settings, I think the picture has been perfected.UPDATEHere are my picture settings for anyone that needs a little help getting startedMode: StandardBacklight: 14Contrast: 80Brightness: 40Sharpness: 20Color: 51Tint: G48/R52Eco Solution: all offEdge Enhancement: offDigital Noise Filter: Low (though I'm sure auto is about the same)MPEG Noise: LowColor Tone: Normal (some people seem to like the Warm settings)Auto Motion Plus 120HZ: Off (I didn't really like this feature)If you have any adjustments to these, let me know", "Date": "April 23, 2010"}, {"Title": "Time for an upgrade!", "Author": "Paul Pacis", "ReviewID": "R1JNP785ZCU81E", "Overall": "5.0", "Content": "I have literally been following the prices of HDTV's for about a year now, and there is no better time for an upgrade! Samsung just released their new \"C\" series, and somehow they are remarkably less expensive than their pre-existing models! The majority of the websites are selling this HDTV for $800+, Amazon's lower-than-low price is less than the rest of the market. I purchased it here on Amazon, and received my HDTV in 5 days (could have been 4 days, but I had school all day). CEVA did the shipping for my HDTV, which I was wary at first because I have only dealt with UPS and Fedex. However, CEVA provided excellent customer service as they did contact me and I verbally specified a delivery time. Packaging was very efficient, and surprisingly light too!For those who prefer using TV stands, you do have to assemble it on your own. Extremely easy to assemble though! All it took was 9 screws (already in the box) and I recommend using a power-screwdriver. Directions said it required two people, I did it solo! I was just eager to hook up my PS3 via HDMI cable and experience the wonderful world of 1080P.Okay, now for the specifics and why this HDTV deserves a spot in your living room - As I mentioned before, right up to my purchase I extensively followed the quality and price of several HDTVs. The Samsungs 530, 550, 630, 650. The Samsung 630 is the best deal for your money, here's why: The 5 series is less expensive, but only offers refresh times of 60Hz as compared to the 630 which is 120Hz. This is a big difference, and means that your HDTV with 120Hz displays at least twice as many frames-per-second which makes movies, not only sports, very fluid and more realistic. Another difference is the response time, where as the 5 series has a 6ms response time, the 6 series has a 4ms response time. And if you are a gamer, a difference of 2ms can make a big difference. So why the Samsung 630 and not the 650? The only difference now is the contrast ratio. The 630 comes with a 80,000:1 contrast ratio which in my opinion, still creates an extraordinary depth to the display. TV contrast ratio's are starting to become stable around the 70,000 - 100,000 range (or much higher for LEDs). Whereas, 3 years ago the highest was around 10,000 but kept constantly rising. So this HDTV is very much future proof. Yes, the 650 has a higher contrast ratio, but is it worth the extra $200 something dollars?All in all, if you're not worried about price, go all out and purchase a LED HDTV. But if you want to shop smart, this HDTV is the way to go.", "Date": "March 24, 2010"}, {"Title": "Pray that it doesn't break......", "Author": "michibilly \"michibilly\"", "ReviewID": "R2DS78QN7CRC9N", "Overall": "2.0", "Content": "Up until two weeks ago, I loved this TV. I upgraded from a 32 inch non-HD/non-flat screen TV.  The picture quality is wonderful, the sound was really good, but I hooked it up to a Yamaha receiver anyway.Here's what happened.  A little over two weeks ago we had been watching the TV, and then left to go outside to do some yard work.  After dinner we decided to watch a movie so I turned on the TV.  Nothing.  Usually when a Samsung TV is off, there is a small red light.  When you turn it on, the picture emerges and the little red light goes off.  No red light.  I unplugged the TV from the power supply and plugged it directly into an outlet (the DVD was on the same power strip and was working).  Then I took the power cord off and went into the kitchen and plugged it into the little Samsung TV in there.  Worked great.  Dang. I pulled out the TV information and the TV was still under warranty.  I called Samsung.After just a few seconds on hold a real person answered and I explained the dead power supply problem.  She told me somebody would call me in three to five working days to arrange for the repair.  WHAT?  Three to five days just to talk to somebody to schedule a repair????  NINE days later somebody finally called and said that my 'ticket' would be sent to troubleshooting.  WHAT?  After nine days, still no appointment for repair????  On day twelve I got a call from a repair guy from a local business contracted to do the repair, and he asked me if the part, the power supply, had come yet.  WHAT?  What part?  I called Samsung again and they gave me the number of GURU, the company they contract to do their repairs, and the company that subcontracts to other local repair services.  I now realize that I'm twice-removed from Samsung and NOBODY is coordinating this repair but ME.I call GURU again after two weeks, and the part has not yet been ordered!!!!!  Two weeks after my initial call and the part isn't ordered yet????  WHY NOT?  Nobody knew why it wasn't ordered by GURU so they immediately blamed Samsung.  Now I'm thinking Samsung is stalling until the warranty runs out, which will happen in about two weeks.  Why in the world would there have to be so many layers of uncoordinated mayhem to do a simple swap of a power supply?  I'm guessing sometime within the next month or two somebody will fix this TV, and I'm guessing it will be about a 15 minute job.When the TV worked we loved it.  The picture quality was great and the sound was pretty good as well.  It has nice features that were pretty easy to figure out and setup.  However, would I buy another one?  Probably not.", "Date": "July 26, 2010"}, {"Title": "Outstanding TV for its price range", "Author": "J.R.W", "ReviewID": "RHAE6BO88YPYW", "Overall": "5.0", "Content": "Picture Quality -  Pros -  The picture on the samsung c630 looks very good right out of the box.  Watching Avatar on Blu-Ray is simply amazing.  Playing PS3 on this TV looks equally amazing and with no noticeable input lag.  I haven't had chance to switch to HD cable programming yet so can't comment on that but standard cable still looks pretty good on this 40 inch tv, a solid 8/10.  Watching standard DVDs through an upconverting 1080p DVD player also look very good.  You can see some graininess if you're within 3 feet or so of the TV but any further than that and the picture looks crisp and clear 9/10.  Blu-Rays just look phenomenal, no other words to describe it really. 10/10.  This TV has plenty of video adjustments to tinker with make the picture suit your taste.  I actually turned the contrast and backlighting down a hair on my set because it was a bit too good.  The TV will also save your picture settings for each input device.  Cons - One of the main reasons I went with the c630 model was for the 120hz capability.  I wasn't really sure how much better the picture quality was with the 120hz over the older 60hz models so I decided I'd be better off safe than sorry.  I can say now that the 120hz feature on the newer model LCDs seems more of a gimmick than anything.  Within the first few hours of watching my new tv I turned off the 120hz and set it back to 60.  This can be done by changing the Auto Motion Plus setting in video options(settings are standard, smooth, clear, custom and off).  The 120hz feature does indeed give the picture a clearer almost 3D like appearance,  however the soap opera effect caused by it unfortunately makes watching movies very distracting.  You feel more like you're watching a live stage show than a film.  It's good for watching sports and some other live broadcasts and events but bad for pretty much everything else.  Another comment i have about this tv is with the viewing angles.  While the picture remains clear even at the widest angles, the colors get a little washed out when viewing from the sides...although not to a huge degree.  Overall the picture looks great from all angles but you will probably notice a slight difference in color saturation depending where you're viewing from.  Color Reproduction overall on this tv is very good.  Colors are accurate, whites look white, blacks look black.  If I had to pick a weakpoint however it would be with the grayscale.  Some grays may appear fuzzy or grainy if you look very closely.  This should be unnoticeable however from normal viewing distance.Features -  Pros - The Media Play and AllShare features are quite nice.  you can plug a flash drive right into your tv and play a variety of video files, mp3s, jpgs with easy to navigate menu's.  Playing files from your PC works in the same way.  You do have to download a file sharing server app from Samsung (it's called PC Share Manager) for it to work but it's fairly straight forward to set up.  You just install the app and choose which files/folders you want the samsung TV to be able to browse on your computer.  Cons - I was unaware of this before purchasing the tv since the product description says you can connect wirelessly to your PC but I have since found out wireless network connection is not built in to this tv.  To connect this tv wirelessly to the internet or to your pc, you need a seperate wireless LAN adapter from Samsung which costs about $60 on Amazon.  So now I either have to purchase another 25 ft of ethernet cable or cough up 60 bucks for the adapter.  Another problem i have with the Media play feature is it can only handle a limited number of files.  I have a 16Gb flash drive with over two thousand mp3s on it but the tv will only read the first 999 of them and the rest cannot be played.  Also for playing music or video files there is no shuffle feature.  You can sort files a number of ways but Samsung left out a random playback ability.Sound -  Pros - Sound on the Samsung c630 is decent although not spectacular.  It's about what I would expect from built in speakers which there is little room for in many of these newer and thinner LCDs. I haven't seen an LCD tv yet that had amazing sound quality right out of the box.  There are plenty of Surround Sound presets and an equalizer to fine tune the audio to your liking.  Cons -  To get the true movie theater experience with this tv, unfortunately you'll have to hook it up to an external home theater system.  Built in speakers are adequate but certainly don't raise the bar for LCDs.  I purchased the Phillips DVD home theater HTS3371D.F7 along with the TV and it sounds spectacular for only $160 extra.Overall - For the $800 range the Samsung C630 seems to offer the best picture along with the most features and 120hz capabilities compared to other sets in the same price range.  The internet capabilities and media player of the C630 are very handy and this set has easy to navigate menus with plenty of audio/visual settings to tweak.  The casing of the TV also looks very sleek and stylish.  The 120hz in my opinion seems like a limited use feature and may not be worth the cost over a 60hz set if you're not also looking to get the additional features many of the newer LCDs have as well.  Although that and most of the other negative comments I had aren't even knocks on this TV set in particular but issues with LCDs in general.  The only true complaint I have with the Samsung C630 is that it requires a seperate adapter to connect wirelessly to the internet which is not what the product description would have you believe.  Some of the features I might be nitpicking about aren't even offered on other tvs in this price range.  Overall, unless you're willing to invest a couple hundred more to make the jump to the new LED backlit LCDs, this is one of the highest quality TVs you'll find for the price.Other notes -  The C630's Energy Saving features allow it to automatically adjust screen brightness to fit room lighting.  Although it's not as energy efficient as the newer LED tv's, the C630 doesn't seem to be generating too much heat.  The box that the Samsung LN40C630 came in was about half the size as the box the for an LG 37\" LCD I had bought my parents the year before.  Not much packing in the box besides styrofoam holders on the top and bottom end of the tv.  Recieved the TV one day prior to estimated delivery with the free super saver shipping.  Was shipped via Pilot Freight and then transferred to another regional freight service which did not show up in tracking information.  I only found out by calling Pilot to try and schedule a delivery time.", "Date": "May 5, 2010"}, {"Title": "The Samsung LN40C630, Definitely worth it!", "Author": "Is2r", "ReviewID": "R3SW5S3DW9OVWY", "Overall": "5.0", "Content": "For being my first HDTV, I am more than happy with my purchase.  I was debating for months to get the LN40B630, but the price didn't come back down to below $800.  Searching Amazon, I saw this year's model for less than last year's model, so I decided it was time to get one.  I'm more than impressed by what this TV can do: already I have hooked my PS3 and DVD player up to it.  The visuals are absoulutley outstanding -- I feel like I'm actually there.  Reading reviews from last year's model, I saw negative comments about sound quality; this year's model, in my opinion, exceeds expectations. Amazon had this delivered to me in under a week with super saver shipping -- I couldn't ask for better.  Out of the box the stand was easy to install: just slip the TV over the guide stand, screw in, and you're good to go.  Setup up was easy; the only thing I have an issue with so far is that you can't go directly to a different source/input unless the TV is picking up a signal from the device.  Starting up other equipment and then having to select the input again is a bit annoying because you miss the start up unless you leave it on that input.  Not sure if I've calibrated it right though, at this point, it seems fine and looks fantastic with some of the default settings.  The manual isn't very informative in setting most of the options; still being new to HDTV's, I have to look up guides on how to optimize it for different viewing situations. I can't say for sure if this TV is better than all the rest or how it matches up, but side to side at electronic stores it had the best picture in mine and my spouse's opinions.  The Allshare feature is also a nice addition: I am able to stream files from my network devices on to the TV with only having to run an ethernet cord to the router.  In conclusion, I beleive this TV will be more then enough for at least the next 3 years until I consider an upgrade, and I mean a BIGGER upgrade ^.^  Thanks Samsung!", "Date": "March 19, 2010"}, {"Title": "Great TV, great price!", "Author": "Aggie Anesthesiologist", "ReviewID": "RZ3DNRMAM3OXL", "Overall": "5.0", "Content": "\"I'm an everyday user, i.e. NOT a technophile. I did some research before buying, but at the end of the day, I wanted something I could enjoy without spending a fortune, and I'm happy with what we got. Some tips on buying your TV, whether this one or another:1) 120 Hz refresh rate -- great for future-proofing, but realize that your cable box may not yet transmit in anything faster than 60 Hz. I don't know if this is different for satellite or antenna transmissions. Also, make sure you buy an appropriate HDMI cable that supports 120 Hz...this should be listed on the package. (Although it may not be needed now, it will be when the cable boxes update again.)2) 1080p -- crystal-clear picture when watching 720p or 1080i programming (nothing on cable is shot in 1080p yet) or 1080p Blu-Ray video. The picture is almost kind of eerie at first, sort of like a soap opera-type appearance, which can be unusual if you're not used to it. I adjusted to it quickly, but it took my wife some time. In the store, ask them to show you something on the airwaves in full HD, or have them run a standard DVD if you think you'll be watching that some via your Blu-Ray player. It is definitely an adjustment.3) Sound -- always a knock on TVs, though for my purposes, it's fine (it's in our living room, not our media room). I really like the \"night\" option for the sound; it keeps the sounds from ebbing-and-flowing as dramatically, i.e. from conversation to a car chase, which is nice when you have kids in bed.4) Computer connectivity -- I have a laptop with HDMI output, so we have connected that the TV and watched something streaming from websites. You can pay extra for \"internet connectivity\" applications like Netflix, Blockbuster, etc., though since we already had that with our Blu-Ray, we didn't duplicate with the TV. The easy computer connectivity is a nice feature.\"", "Date": "June 2, 2010"}, {"Title": "Jaw dropping picture!!!!", "Author": "1Dub79", "ReviewID": "R2HOJHWKYJEW4C", "Overall": "5.0", "Content": "I went to Brandsmart, and I was expecting to buy a Sony BRAVIA EX 400 Series 40-Inch LCD TV, Black. The associate told me though it was a 1080p LCD, it was 60hz LCD. Therefore, it would not show as good as an LCD with 120hz. Then, I was looking at the LG 37LH30 37-Inch 1080p LCD HDTV, Gloss Black. It was very reasonable. However, it was a little out-dated. I was then looking at the Samsung. The associate told me it was the top of the line. Of course, I know Samsung is a great brand, though I bought the LG 37LG30 37-Inch 720p LCD HDTV last year because it was cheaper. When I bought that LCD, I knew it would not show as good, but it has been good enough.While making a decision, I found that pixels AND the hertz DOES have an affect on how good an LCD resolution can be. The associate told me the difference between a 60hz and a 120hz LCD is an 120hz shows more of a live picture. This means, there is no blurriness on moving objects, and everything moves increasingly fast, as if in real time. I decided to purchase the Samsung. When I hooked this LCD up, I noticed how sharp the moving objects were. It was unbelievable. All I could say was, \"wow\"! The subjects, and the movements are almost 3-D like. That is the best description, which I can give. While watching some movies, it actually felt as if I was on a live set. I no longer felt as if I was watching actual TV. This is thanks to the 120hz. The picture is one of the most amazing features I have ever seen on a TV, albeit the HD features. Right out of the box, it showed great. I had to make no adjustments. I also noticed how the LCD is user-friendly. Though I am pretty good with gadgets, I don't know what every feature means. At least, every feature has an explanation of what it is at the bottom of the screen. The sound it pretty good, as well. I could not say the same for the LG.For those, who have a PS3 or Xbox 360, the featured Game Mode takes HD gameplay to a whole new level. The graphics, sharpness, sound and movements are enhanced by the 120hz LCD. I highly recommend playing a 1st person shooter, such as Modern Warfare 2. I was playing a Team Deathmatch, and the sound was superb. While playing, I could clearly hear every footstep, which my team, nearby enemies, and I were making. The gunshots sounded increasingly crisp and authentic. The gameplay experience has a lot more to offer on this LCD than playing on my LG. Also, be sure to switch the Game Mode off, prior to watching regular TV!!! If not, the screen will shake lightly per user manual.Also, if you buy the LCD, it will seem as if it does not swivel. However, the LCD actually does. Prior to placing the LCD to the base, look at the base bottom. You will see some screws underneath. Take all, but one of the screws out. This keeps the swivel stand in place. You should now be able to spin the swivel stand. Then, put the same screws back into the base. The LCD will then be able to swivel. Overall, the Samsung is great. It is worth the price. I did not feel bad about spending a little over seven \"big ones\". This is coming from someone, who is frugal, and tight with money. If you are looking for a top-notch LCD TV, look no further than the Samsung LN40C630 40-Inch 1080p 120 Hz LCD HDTV (Black).", "Date": "April 18, 2010"}, {"Title": "Sensational tv", "Author": "Alana London", "ReviewID": "RWNGTV4BPAL4J", "Overall": "5.0", "Content": "Pro  Totally easy set up, just plug it in, attach an HDMI to it and then to your cable box and it's on.  Immediately a stunning picture, great clarity and beautiful deep colors.  It has a matte screen to cut down on reflection.  Very nice remote too with big buttons.  We purchased this tv for the bedroom after buying the Samsung LN52B750 for our living room and loving it.  This one does not have all the bells and whistles (widgets and DNLA) that the B750 has but has 2 USB movie inputs which I wanted because I download a lot of movies and tv broadcasts from Europe. I have not yet found a codec that these tvs will not play.  We paid $809 with free shipping and no tax thru Amazon.  I consider it a great buy.HOWEVER.......  We had it installed on the wall at a horrendous price - articulating wall mount $92, installing the wall mount to the wall which had to be reinforced because no studs could be found $346, parts to finish off the reinforcement of the wall with moldings, wiremold to cover the wires and a shelf to hold the bd player and cable box, $99, + $100 labor = $637!!!!!!!!!  OMG unless you can do it yourself, think twice about wall mounting your tv!!!  If you are installing this tv on the wall, think too about how you will get to the inputs which are mostly located in the back of the tv, ie home theater, audio and components, as well as extra HDMIs.  You will need to access these inputs from time to time so make sure you have the room to move the tv out and turn it to reach these inputs. That is why we bought an articulating mount.  Still we have to move some furniture out of the way to get at the back of the tv.  Hopefully we will not need to do this often.Con  The shortest power cord in the market I am sure, at most 3 ft. You will need an extension cord.Alana NYC", "Date": "May 19, 2010"}, {"Title": "Samsung LN40C630 -- Worth the wait!", "Author": "Artemis", "ReviewID": "R3H1GROPVQX6D0", "Overall": "5.0", "Content": "I researched my first purchase of an HDTV extensively over the last 4-6 weeks.  After a couple of disappointing experiences related to models and brands other than this one (one TV I ordered never arrived, one came defective and had to be returned), I discovered the Samsung LN40C630, which was recently released by Samsung.  It is an amazing TV and it almost made the problems with the other TVs I previously ordered worth the pain.  This TV was easy to set up, has nice sound, beautiful picture, and user-friendly menu options.  It also looks really nice in my home.  I was not a big fan of the red trim (Touch of Color) on some of the other Samsungs, so was pleased to see a model that had nice, less gimmicky esthetic details. I LOVE THIS TV.", "Date": "March 26, 2010"}, {"Title": "Well Worth It", "Author": "D. Harris", "ReviewID": "R3GTIC8PPTYZNM", "Overall": "4.0", "Content": "First of all, this TV is beautiful, even before turning it on, you can see this is a great design with a clean, contemporary style that compares to what the ipod did for the mp3 player. The stand is also great, with a nice swivel and sleek look. While some may say the aesthetics of a tv don't matter much, itThe picture is impressive with 1080i television and 1080p movies/xbox. I'm sure it can be better, but you will never notice unless you have a (...) tv in the next room. The sound quality isn't bad at all in my opinion, although it isn't very impressive either.A cool feature is the easy use of an external HDD. All you have to do is connect an external drive into the usb port and you are able to play your favorite movies/media, which surprisingly works with all of my video file-types including avi and mkv(in 1080p). There's no need to connect to a network/pc as long as you have a usb device that can hold enough of your media.At (...), this was an absolutely great buy! Samsung is a brand you can trust when it comes to TV's, at least as much as you can trust any large corporation.I would give it the 5 stars, but the few cons that it has make it a \"great\" tv, not perfect.Cons:-no \"internet apps\" for this model, (as far as I can tell). I was assuming that the apps would be standard, considering how new this model is, but samsung makes no attempt to let the consumer know about it's internet limitations, maybe that's why it's so cheap.-you need to buy a wireless adapter to get a wireless connection, which is just another way for samsung to get an extra (...) from you. Also, right now I don't really see the point of connecting to the internet, seeing as how there arn't any apps like netflix, pandora, or whatever else.-remote isn't great, although most people can just use their cable remote anyways", "Date": "April 4, 2010"}, {"Title": "Amazing TV!!", "Author": "South Jersey", "ReviewID": "R41JHR8LEL88V", "Overall": "5.0", "Content": "After shopping around a while for a 40\" lCD for the bedroom, this Samsung hands down is the best... It rates top in the picture quality, sound and inputs. I looked at the Sony KDL40ex500 but for the same price for the Samsung it was a no brainer. The Sony Bravia is a good TV but Samsung is the best. Please, please get a service aggreement no matter what TV you buy because things happen as you may know. I recommend trying Square Trade Warranty it's half the price of all other warranties and they offer four years. I asked a lot of questions and compaired the service agreement with all other competitors and I was very confident and satisfied that they will hold up to all the others. They will come to your house you don't have to ship it etc. Most of all the concerns of the TV if something were to happen would be covered. Remember no warranty is going to cover 100% if you neglect the TV. But anyway, be smart! get the Samsung!!!! you 'll be happy have fun...", "Date": "April 1, 2010"}, {"Title": "The Samsung LN40C630 is the best TV under $850", "Author": "RC", "ReviewID": "RHU2KY67DN47O", "Overall": "5.0", "Content": "First of all, I spent almost two months doing research online, reading customers reviews and comparing features on various LCD and Plasma models in the $850 - $900 range. Out of all those HDTVs, the C630 was the one that offered the most features and best performance for the price.The colors and black levels on this TV look amazing right out the box. I always keep my TV on \"movie mode\" when watching movies and some TV shows because it makes me feel like I am at the movie theater. Also, this TV looks better than most LED-HDTV models from last year when properly calibrated. That 120,000:1 contrast ratio does really make a difference.Standard definition channels at 480p look better than in most HDTVs. 720p/1080i HD channels look unbelievable. It looks like if you were there.I haven't played any Blu-ray discs yet because I don't own a Blu-ray Player but I can assure you that 1080p content would look better than HD channels in 1080i and 720p.This TV also reads portable hard drives and thumb drives in either FAT32 or NTFS formats. I have a 500GB portable hard drive with most of my DVD collection and some 720p Blu-ray rips. I don't even use my media center pc anymore because this TV plays every movie format that I have from .avi, .mkv, .divx, .mp4 and etc..If you don't have a portable hard drive, you can also connect this TV to your home network using an Ethernet cable so that you can play photos, music, videos and movies from your PC.The audio is better than I expected, I keep the volume at 35 or 40 when watching action movies and it does the job. I might get a home theater later on but for now the built-in speakers are fine.Get this TV and you won't regret it!!", "Date": "June 24, 2010"}, {"Title": "Amazing picture quality", "Author": "Skeptical consumer", "ReviewID": "RDVCAUFROW1LX", "Overall": "5.0", "Content": "I've had the Samsung LN40c630 for about a month and it has an truly amazing picture quality. It rivals and I feel surpasses image quality of far more expensive products. It is most likely the best product for the money I've ever purchased and this comes from a highly skeptical consumer.", "Date": "June 5, 2010"}, {"Title": "Good buy", "Author": "T. Anderson", "ReviewID": "R10XZ1J1EGBY2G", "Overall": "5.0", "Content": "Had good luck with a previous Samsung LCD TV. Was thinking of going LED this time, but the prices are still a bit high. We found a good deal on this TV, through Amazon, and even thought it didn't have any reviews at the time we purchased it, we took a gamble.Glad we did. The picture is SOO crystal clear...much better than our previous Samsung TV (which is still really good mind you). Sound (without additional external speakers) is pretty decent, too.If you can get this TV for under $800, it's well worth the price. Very good. Highly recommend it.", "Date": "March 31, 2010"}, {"Title": "Great TV, Questionable Support", "Author": "Dana L", "ReviewID": "RGUU1PJQKT525", "Overall": "3.0", "Content": "I purchased this TV from Amazon, and it arrived two days later. Unfortunately, the TV was defective in that all images had a reddish tint. I have worked in the high-tech industry long enough to know that sometimes things are defective, so I figured that I would give them a chance to repair or replace it. I called Samsung, and they said that they would send out a service person. About a week later, a technician came out to repair my TV. First of all, he showed up about two hours after the end of the 4-hour window they provided, but even worse, he didn't have the parts required to fix my TV. He claimed that he had ordered them overnight two days before. The strange thing was that I had scheduled the appointment over a week later, so I didn't understand why the parts weren't ordered at that time. He basically said that I was out of luck, and that he would have to come back again.I called Amazon, and they cross-shipped a replacement. The replacement arrived in a few days, and seems to work pretty well.I did get a call about two weeks later from Samsung, telling me that they wanted to schedule an appointment to repair my TV. For a brand new TV, this level of service is unacceptable. If the product weren't so good, I would have sent it back.Despite the poor experience up-front, I have been pretty happy with the TV. The picture is great, and the sound is pretty good for built-in speakers. Overall, I'm satisfied for the price, although I hope that I don't have to deal with Samsung service again.", "Date": "September 14, 2010"}, {"Title": "Nice unit", "Author": "meinfla", "ReviewID": "R38V4F4P4GY4N5", "Overall": "5.0", "Content": "After purchasing various items from Amazon and being completely satisfied, I decided to purchase a TV which I consider a major purchase. Delivery went like clockwork, Ceva unpacked, assembled and placed the TV. After they were sure it was working, they removed packing and left.The TV quality is excellent. I have cable, the picture was great, I upgraded to a HD box, the picture is even better. I had some tech questions, called Samsung received quick and courteous answers. This is the best 40 inch LCD TV I have seen.Amazon is a great place to buy.", "Date": "June 2, 2010"}, {"Title": "A solid all around great buy!", "Author": "Neuronaut", "ReviewID": "R1DV4I3NYLN9N2", "Overall": "4.0", "Content": "I actually bought this TV and had it at home for about a week and loved it, althoguh I returned it, BUT, not because of any bad issues, just because this I was curious to see how it performed since Consumer Reports gave it a very high rating and also a \"best buy\". I returned because I wasn't in a rush and decided I wanted a bit larger than 40\" and perhaps wait for a sale or price drop.The television has a stunning HD picture although I thought slightly below that of the 650 model. I was surprised it also played divx movies, .avi, mpeg4, and mkv without a hitch(did not try other formats), by just popping in my external drive via the usb port (there are 2 of them). It was easy to navigate through the files and when playing a movie you can fast forward, reverse, pause, etc. It has a good choice of screen sizing/zooming. For a non-led the TV is also rather thin and light, and the stand was very nice quality and easy to install. CR says the viewing angle was somewhat limited but I thought it was pretty darn good as I could watch it from a very shallow angle with reasonable (but not face-on) picture quality. Sound was pretty good for a flat panel TV but of course not home theater quality.My wife and I were not prepared to see the weird \"soap opera\" effect that I now see many people comment about for LCD TV with 120+ Hz. What I refer to is that the lighting, etc. looks like a tv soap opera, or old \"Dr. who\", maybe like shot on video but also very \"real\" looking like you are right on the set and can tell it is a set. Supposedly if you turn off or turn down the antiblurring it will alleviate this effect. Some people like it but I don't. It may also be that the PQ is so good that you can detect the \"fakeness\" of movie props, makup, etc and some people comment that Hollywood has not caught up to the technology. However we were watching only a 720p version of \"AVATAR\" and even though it was only 720p on a 40\" screen it still looked soap opera-ish and the scratch scars on the military sargeant's head looked totally fake,and when they were inside the helicopter/spacecraft it looked like a scene from \"general hospital\" or \"young and the restless\". At least it made us laugh and thus increased entertainment value! However I didn't know then to try to reduce the motion effect which interpolates frames and inserts them between the actual frames. This seems to be a problem with basically any 120/240hz LCD HDTVs, but I was told if you buy one, try to get a TV that permits you to separately adjust the anti-judder and anti-blur so you can reduce \"soap opera\" without introducing more judder.only other issue was SD channels didn't look so good. It may have been our cable signal but it had a faint \"double image\" next to the image, but then again it may be because I had some sort of motion/image processing on that actually makes SD look worse so I can't blame it on TV. CR rated SD content for this TV \"very good\".Overall a great LCD and a great value. I think factoring in price, Picture quality, features, and physical quality about the best 120hz LCD you can find. If you want slightly better PQ plus some internet options and willing to pay about $150 bucks more then look at the LN40c650 model. However with this model it seems you can just network it with your PC via ethernet and stream internet content to the TV anyway.", "Date": "May 11, 2010"}, {"Title": "Samsung LN40C630", "Author": "James McLaughlin \"Sailor65\"", "ReviewID": "R3TIKGANKMSJFI", "Overall": "5.0", "Content": "Samsung has a superb reputation and this Television does not let the rep down. This is so simple to set up a baby could have done it, in fact I have not had a television that was easier.All I had to do was plug in all the cabling and switch on, a picture appeared almost straight away.WELL DONE, SAMSUNG", "Date": "March 31, 2010"}, {"Title": "Great TV", "Author": "RoyBoy", "ReviewID": "R1WV8Y85VR2F2Q", "Overall": "4.0", "Content": "I chose this TV mainly because of my prior positive experience with a Samsung LN52A750, which I purchased 21 months ago from Amazon and am still very happy with. I purchased this LN40C630 for my bedroom and it fits in just right size-wise. After two weeks of use, I have not been disappointed with either the picture or other performance aspects. I set it to Movie Mode and Warm2 Picture Mode, which seem to suit my tastes for natural-looking colors. Unlike my LN52, which is connected to a 5.1 surround audio system in my living room, I am using the on-board speaker system on this LN40 TV. I wasn't sure if I would be happy with the audio quality but it is just fine for my bedroom needs. I even turn up the volume quite a bit when I am using my stationary exercise bike and it works great. My only disappointment audio-wise is the lack of a headphone jack, so I can listen in privacy or not have to turn it up so loud when I exercise. My earlier LN52A750 has this feature but Samsung must have decided to delete this on some newer models. This wasn't a surprise as I researched this before my purchase and still went with Samsung because of my good past experience. The lack of the headphone jack is the only reason I rated this TV 4 stars, as otherwise it is an excellent TV.As far as Amazon's customer service, I couldn't be happier. Both of my Samsung TVs were shipped quickly and arrived in good condition. The smaller LN40C630 was delivered to just inside my front door where I unpacked it and set it up myself, which was no problem at all. Although Samsung's instructions say that it's a two-person job to lift the TV and assemble it to the base, I managed just fine doing it alone. I then moved the TV to my bedroom alone, which was no problem as total weight is about 40 lbs with the base. Any larger TV would probably be too unwieldy to lift and move alone. (I had the white-glove delivery and set-up service with my LN52, thank goodness, as I live alone.)", "Date": "October 22, 2010"}, {"Title": "WOW!", "Author": "Michele \"Racer X\"", "ReviewID": "R2J8JVYZKBY182", "Overall": "5.0", "Content": "OK, so I just wasted 15 min writing a review for this TV that just disappeared. I'm gonna try it again and hope for the best, there might be two reviews from me that show up at some point. I am just so happy with this TV that I am going to give it another try.  I spent a lot of time researching different brands that sold 40\" LCD TV's.  I would say the main reason I went with a Samsung is because I have another flat screen Samsung that is still kickin at almost 4 years old. That may not sound like a long time but I bought a Vizio at Best Buy that lasted 13 months, it died one month after the warrenty expired, go figure. My old Samsung is 720p so I wanted to buy a 1080p, 120hz model to see what I was missing.  First let me say that I have purchased many small item from Amazon in the past. This TV (at 749.00) was a big pruchase for me, especially off the internet. Thanks to other reviews from this page I went for it and would do it again. The carrier was a company called Pilot. I was able to select a date and time for delivery. They were there on time, brought the box into my living room, took the TV out, and plugged it in to make sure it worked before they left!  I sat there for a long time reading the instructions and playing with all the settings. After that I watched HD TV, Blu Ray's, PS3 games, football games, even very old movies to see the difference with everything (Blu Ray is out of control)! The 120hz setting is amazing, it makes any Tv show or movie your watching look like a home movie. I can see how this would be distracting but for now I find it facinating. On most things it is overkill, it takes that \"movie\" feel out. Of course you can put the setting very low without turning it off, which I like.  This is a great TV for a GREAT price. I would buy another big item from Amazon since everything went so well.**UPDATE**  I have had this TV for almost a year now and I am still completely satisfied. I am thinking about getting another to replace a 5 year old TV. You can not beat the price for what you get. I am not interested in widgets and all the other fancy stuff, I use my TV as a monitor for my Mac Mini anyway. GREAT PURCHASE!!", "Date": "October 4, 2010"}, {"Title": "Can't beat it", "Author": "Isaac Smith", "ReviewID": "R1YL3POBE5XHDC", "Overall": "5.0", "Content": "Okay. There are a ton of tv's around this price range. I chose the Samsung because of the image processor. The comparable tv to this is the Sony - KDL40V5100. It uses the Bravia engine 2 which is now old considering the new BE3. Samsung and Sony are very big competitors and are always trying to top each others engines. This is the newest Samsung engine and much better than the BE2 engine. I not only did a lot of research on this tv but actually spent time watching the ones I was looking to buy. The picture quality of the Samsung is extremely hard to beat at this price range and the Sony didn't even come close. The Samsung also have a better upconvert than the Sony. You can read about hz and contrast ratio all day but it comes down to what you like and what you're willing to spend. For me, this was the nicest looking tv at the best price. Make sure to view the HDTV's in standard mode, not dynamic. The box stores are always putting the tv's on the highest settings to attract your attention. This is an amazing tv for the price. I bought mine at Best buy for the same price that is on Amazon. Don't be afraid to ask places to price match. Plus I got the Black tie warranty. I love amazon but money speaks.", "Date": "June 15, 2010"}, {"Title": "I give up", "Author": "Quahog", "ReviewID": "R3L86DBYTDDGJA", "Overall": "2.0", "Content": "In the past two weeks I went through 3 of these TVs. The issue for me was consistent on all three -- the right side of the panel appears washed out, as if it were being overly lit. For example, when watching a baseball game the outfield grass looks beautiful all the way across the screen until you get to the rightmost five or six inches where the color is noticeably lighter. I had guests this weekend and I challenged them to figure out why I was going to return it. All three quickly identified the same problem with the picture. I tried the TV in different locations, daylight and darkness -- the problem is very consistent. It is a shame, because the rest of the picture looks great and it would be a terrific value. Judging by the popularity of this set, I guess most people are not bothered by this problem, but I found it incredibly distracting.", "Date": "August 16, 2010"}, {"Title": "Samsung is the best!", "Author": "N. Kennedy", "ReviewID": "R206IKGG27QHNN", "Overall": "4.0", "Content": "I got this TV to replace my Toshiba Regza.  I am glad I did.  This TV is used mostly for movies and PS3.  Movies definitely are better, but the PS3..WOW what a difference!  I really didn't expect the samsung to be this much better.  The gaming on this TV is awesome!The only thing that I didn't care for was the audio on this TV.  I wasn't expecting much considering it was so thin, but it didn't meet my expectations.  I am not saying it is bad, but it is not exceptable to me.  If you are using surround sound, which most people do, this will not be an issue.", "Date": "March 29, 2010"}, {"Title": "Best Quality for the Money", "Author": "R. Laurie", "ReviewID": "R2Y412KO3AS45C", "Overall": "5.0", "Content": "Pros:  -Incredible Picture Quality  -Great, clean, logical UI  -Great-looking TV  -Swivel Stand  -Good RemoteCons:  -Speakers leave something to be desired: decent high ranges, but a little tinny; almost no low  ranges, which is typical for built-in speakers.  -For some reason, the optical-out jack will only output 2.1 channels from a 5.1-channel HDMI source, but will output up to 7.1-channels from a TV broadcast.  Easily remedied by plugging the blu-ray player directly into the surround system.---After shopping around for an LCD TV for a long time, I knew I wanted a Samsung.  In brick and mortar stores, the Samsung TVs always stand out: they always have the most vibrant, crisp colors, and smoothest, sharpest picture.I was conflicted about getting the 46\" 5-series or the 40\" 6-series (at very similar prices), but when I saw a 5-series and 6-series next to one another, there was no contest - the 6-series has noticeably better color and contrast, absolutely worth the extra money in an investment like this.Surprisingly Amazon's price was way better (by $50-$100) than any brick-and-mortar store, and free 2-day scheduled delivery with Amazon Prime.  The deliverer even helped my wife take the TV out of the box and set it up.", "Date": "October 19, 2010"}, {"Title": "Reliable Strong Performer", "Author": "Avi", "ReviewID": "R36T0R7MOLSXZD", "Overall": "5.0", "Content": "Not too much to say here. Samsung seems to be a pretty reliable brand, and this TV is no exception. Everything worked out of the box (the TV required some minimal assembly, connecting the display to the stand, but that can be done by a single person). Video quality is very good (as expected), although some people might not like the 120Hz effect (makes non-sports TV shows look 'artificial', for lack of a better term - it's hard to describe without seeing it), or the dynamic backlight (the TV will lower the back-light intensity for 'dark' images to achieve deeper blacks). It's ok though, since both settings can easily be enabled/disabled in the TV's menu.I use the TV for all my video inputs (currently that's just cable, laptop, and Wii), and hooked up a fairly inexpensive external 5.1 receiver powering my surround sound speakers via the digital audio out on the TV. This seemed much easier to me than getting a more expensive receiver with a huge number and variety of inputs (the TV already has plenty for me) and then plugging everything into the receiver, and going from there to the TV. My way, any input on the TV that's currently displayed has it's sound go from the TV to the receiver, and through that, to the speakers. There's no delay between the audio and video that I'm able to discern.Lastly, Amazon's ability to schedule a delivery within a 2-hour window was great - I think most companies give you a much less accurate 8-hour window, which forces you to be home for longer. Overall, very happy with this purchase!", "Date": "July 28, 2010"}, {"Title": "1 initial concern, though!", "Author": "Seban Jose", "ReviewID": "R36JVD711YWNUH", "Overall": "4.0", "Content": "This is my first HDTV and I totally love it. Not that I have a trizillion others to compare to and be a professional rater but I haven't come across any bad points on this TV as yet. Works just good with awesome picture quality so far. Touch Wood! (I got my renters insurance kicked in as well).The TV came in in due time as promised by amazon and in perfect condition. The delivery guys were even able to install and test the TV for me before they left. Was perfect (I think that is an amazon prime facility though).Having said that, I must say that the first couple days I owned this I was in a slump. The picture clarity was so insanely real that it felt like I was a part of the movie or the scene. For example when Arnold Schwaz. flipped around with his shot gun in terminator I had to dart behind my IKEA sofa for safety. I might not have conveyed the right message in the above 2 lines but the clarity had a sense of unwanted realisticity to it. The scenes and people in the scenes looked like out of a documentary and did not have the \"flare\", if I might say so, of a movie - \"The movie effect\" you would get in a theater. Howvere, on a quick online search and enquiries at Best Buy and Walmart I learnt that I was not the first to experience this. I got into a painstaking effort of rectifying this and had to dig into the myriad of options the TV had (as recommended step by step in a webpage) before things began to look better. Not sure what I did in the end of the day but the picture clarity is just fine now and my wife and I have no complaints any more. Terminator and recently Avatar on Blu-Ray as well was insanity unleashed.Gud Luck choosing. I would recommend Samsung and the LN40C630 for sure.Update - 10/19/2011: In further exploring into the TV functionalities, one disappointment I have come across is the fact that the TV is not compatible with Samsung Apps. Therefore, you cannot browse the net on the TV and primarily cannot watch Youtube or Amazon Prime videos over the wireless (which is what is killing me). I have to use a PC-TV connection cable to display PC contents onto TV. It took me hours of exploring to figure out how to share my laptop local hard-disk content with the TV over a wireless network. This is pretty cool, though the internet apps would have been cooler and is what I really need. Note that, amongst others, the LNC650 has the Apps feature.", "Date": "June 30, 2010"}, {"Title": "High Quality TV", "Author": "Jason Visser", "ReviewID": "R31BXVVSFCP7VZ", "Overall": "5.0", "Content": "Fantastic TV for the price.  I use my laptop with an HDMI connection to run the TV.  Everything looks great and works well.  The sound quality is definitely above-par for a TV, but ofcourse can't really compare to proper sound system.  Lots of options and settings to tweak in the menus, which can be a little overwhelming, but I really appreciate them.  Has a network connection (wired, or optional wireless), but it is only for media sharing capabilities, this TV does not support streaming Netflix.  This was a bit of a disappointment for me, because I read a review where they said it does support Netflix.  Oh well, aside from that, I highly recommend this TV to anyone who values high picture quality, very little artifacting (stuttering, shuddering, etc).  The bezel attracts a lot of dust, but we have 2 cats, so we probably have more hair/dust flying around than most people.", "Date": "June 7, 2010"}, {"Title": "Exceeds expectations", "Author": "K. Picone \"Go Pen's\"", "ReviewID": "R33H2ODURYQQPJ", "Overall": "4.0", "Content": "I am very satisfied with this TV thus far.  We replaced a 42 inch Vizio which failed after almost exactly 2 years.  Needless to say, I was simmering mad.  $1400. down the toilet.  But I digress.  Anyway, after lots of research this Samsung just beat the pack in specs and consumer reviews (the only ones that matter).  The price was almost half what I paid for the Vizio and with a 120Hz refresh rate it is a very good bargain.  The only slightly negative comment I have is that the onboard sound is not as good as the Vizio.  Having learned my lesson the hard way, I purchased the 4-year Square Trade Warranty offered by Amazon.  It was only 80 something dollars and I easily justified it to myself since the cost of the TV at Amazon was $50 dollars cheaper than anywhere else I could find it!  I highly recommend this additional purchase.  It's cheap insurance..just in case this TV does not age well.  Finally, I have to comment about the shipping.  I opted for normal delivery and though it took a couple of weeks for me to get the unit (I think it was back-ordered) the company in my area that delivered it was outstanding.  Anyware Express gave me \"white glove\" delivery which included setup and removal of the dead Vizio at no charge.  Good experience all the way around.", "Date": "May 29, 2010"}, {"Title": "Very good Picture and a very good Value for a basic tv", "Author": "tech boo", "ReviewID": "RORMDXR2GOVP5", "Overall": "4.0", "Content": "Samsung LN40C630 Review after 4 months.I bought this tv in September 2010 to replace an old 27\" CRT style tv.  This thing blows the old style tv's away!  So maybe the big leap weighs my review higher than if I went from a 5 year old LCD to this LCD.The picture is perfectly clear, I only get OTA (over the air) signals.  No overpriced cable for me.  I live in Dallas, so there are over 30 channels, half of them hispanic, religious or product sales, so I get to watch around 15 channels that have regular shows.  The HD channels are awesome on this tv.The screen is very bright and clear.  I was considering the Sony Bravia EX500 - 700 series.  The 500 is in the same price range as the LN630.  The Samsung has better colors to me.  More vibrant with deeper contrast.  The Sony's have muted colors that some say are more realistic.  I like the more vibrant colors so the Samsung won me over even though the Sony has more features; like the internet apps.  This screen is also a matte screen which is what I was looking for.  It is in our living room with 4 very big south facing windows, so glare is a big problem and this really helps.  Don't let the sale people tell you matte doesn't matter and that glossy gives you a better picture.  Under ideal conditions, in a windowless jail cell, they are correct.  The glossy screens do give you a more vibrant and brighter picture, but in the real world of rooms with windows the matte definitely reduces the glare by 50%.  If you can't see the picture the quality doesn't really matter.I'm glad I didn't cave in to the internet features of other higher priced tv's, because they are very limited except for the very new Sony TV with Google TV.  Of course you have to pay a bit more.  There are other ways to get internet on this tv via, blu-ray, laptop, internet boxes, etc. for around $300 or less.The sound is adequate.  I have SD speakers set up, so I have the option to get very good sound at anytime.  I only use my theater system for movies and live sports.  Regular shows and news, these speakers are just fine.Plenty of connectivity; HDMI, composite, USB, ethernet.  If you really need more, then you need to get an AV receiver.  You'd fit the profile of a person needing an AV receiver.Basic setup is pretty straight forward.  Other people have posted their setup specs, which are a good starting point.  One thing I will mention is that I got this tv for the 120hz refresh rate so motion blur would be less noticeable, especially for football.  The best setting is - Auto Motion Plus 120HZ: CLEAR.  Otherwise you get the 'soap opera' effect, which is really weird that Samsung thinks anyone would want that look???  I see no motion blur watching football like the older LCD tv's.  So this is a winner in this category.Ethernet setup was a little more difficult.  I have my PC and router hardwired with CAT6 cable to the tv, getting the tv to see the router took some trial and error.  The auto detect did not work the first time, so I got all the router info and manually set it up... and got a connection error.  Finally I tried the auto set up again and it connected this time.  Why it didn't see the router the first time is beyond me.  But I now can use this tv to show all my photos and home movies to friends and family.  Goodbye projector slide shows, and crowding around a 20\" PC monitor !  You can also watch movies from the PC, but I don't do that because of the time it takes to format the movies and the space they take up on my hard drive.This is a more basic model, and the price reflects that, especially a very good sale price.  More expensive tv's have more features, but for the picture quality, this can't be beat.  Also the more basic the tv, the more future proof it is, since the next gadget won't make what few gadgets this tv has obsolete so quickly.  Google tv has already made the previous Sony app and Samsung app tv's dinosaurs.  And 3D tv?  they just came out and now I hear they are already working on 3D tv's without the need for glasses.The only real Con I have is that the IR sensor is to the extreme lower right corner of the tv.  I think most people are like me in that we point the remote to the center of the tv.  Often it doesn't pick up the IR signal if quickly pointed randomly to the center.Finally I checked into the Samsung capacitor problems the '06-'08 tv's were having.  Samsung told me that they had corrected that failure in the '09 models so the 2010 models are clear of that problem.  Incase you didn't know about the capacitor issue, what Samsung did was under engineer their capacitors to the point where after a year or so of use they would burn out and you'd end up with a nice black rectangular mirror.  Often after the one year warranty, so the buyer was SOL.  It's an easy fix for an electrician, but who buys a $1000 tv to last one year?  And how many of us are electricians?  You might want to do some research to clear your mind of this Samsung problem, because it spanned all their tv lines.This tv rocks for sports, everyday use and especially because you get more bang for the buck !****update June4, 2011****I have started to move all my movies from DVD to mp4 on an external hard drive (see my iomega ego 2tb review).  Man it's nice to get rid of the DVD's.  Mp4's are 1-2gb in size and the picture quality is about the same.  I cannot notice a difference.  I just plug in the iomega hdd via usb and use the samsung tv remote to find my movie and watch!  could not be easier.  Sound is also theater surround just like the DVD.  I plan on getting another HDD and getting rid of our 8yr old 5 DVD disc changer.DNLA also works like a charm.  I use the Samsung PC Share Manager program and can easily watch photos or movies from my computer.  Although there are some flaws with the samsung pc share manager.  The most glaring is that photos are displayed in a random order, not in the order as you see on your hard drive, WTH?!?!?!  So vacation slide are shown skipping all over the vacation time period?!?!  that make no sense.  It seems as if the program is a high school student's science project.To get around the randomness of the photo order, I have to use the plain DNLA connction, but that sometimes distorts the photos when they go from landscape to portrait.  the following photo is stretched to landscape when it should be portrait.  So there is no one fits all solution, I just wish Samsung would update the program and fix that one bug.", "Date": "December 18, 2010"}, {"Title": "JULY 2013 UPDATE", "Author": "Pelvin Gamble \"Nature Boy\"", "ReviewID": "R23HB8E9KNX1UB", "Overall": "5.0", "Content": "I have no regrets about this purchase. First off I was a little hesitant purchasing a big ticket item from amazon.com but since I have had nothing but great experiences with amazon I took the chance. Delivery was quicker than I expected and the driver set up the TV (I requested the set up to check for damage and to make sure it was not DOA). Five stars as usual for Amazon.Now for the TV...I have waited 6 months to review this TV because I wanted to make sure that I was satisfied. No regrets! I was debating between the similar Sony (40ex500) and this Samsung LN40c630. I am a Sony man and to be honest the Samsung won because of the amazon price at the time and the offer for 24 months no interest financing.I could not be happier with my decision. The TV is beautiful. The Picture is excellent in HD and Bluray and standard definition is OK but I don't attribute that to the TV. The Menu is easy to understand and settings are plentiful. 40 inches is perfect for my sitting distance (about 8 feet). I know a few people complain about the sound but for me it is fine, I do have a stereo receiver that I have the TV connected to but I only use it for listening to music channels, for regular viewing the TV speakers are perfect for me. I have had the TV for 6 months now and I have not had one problem with and don't expect to have any at all because everything seems solid and reliable. If by some chance there comes a problem I will let you know.To those doing research on LCDs...I researched and debated for a year before making this purchase and as stated before I have no regrets. Thanks for reading I hope this helps.UPDATE...JULY 2013I wanted to take the time to amend my review to let others know about the panel problem on my TV and my displeasure with its short life. I have been very happy with my Samsung LN40C630 until 2 weeks ago. The panel started going out (panel version code - AAO1). It randomly gets dark and sometimes it seems to have a ghostly white film over the screen and other times the colors bleed all over the screen. Upon further inspection I discovered that it also had what some call jailbars running up and down the screen. I was very surprised because I have always considered Samsung a reliable company. I expect a TV to last longer than 3 years no matter what kind it is (LCD, LED, Plasma). I have a Sony (Tube version) from 10 years ago and it still plays perfectly. The LCDs may not last as long as that but 3 years...give me a break.", "Date": "December 7, 2010"}, {"Title": "Very nice TV", "Author": "Jenny Cook", "ReviewID": "RAHTIT5IR1K2F", "Overall": "5.0", "Content": "I got this one recently. It is very stylish and elegant. You can expect nothing more from the picture. It is simply brilliant.I know people spend days researching TVs - dont waste your time  just get this one and you will be fully satisfied.", "Date": "October 18, 2010"}, {"Title": "Samsung 40 inch", "Author": "kfab12", "ReviewID": "R32S6C57KIRWCE", "Overall": "5.0", "Content": "I've had this TV since mid July of 2010.  I waited to post a review to see if there was going to be any issues with it.  So far I can say that not a thing has gone wrong.  The picture quality is great.  The sound is fine for me.  I really like the set up features and found that some of the reviews and what others recommended was very helpful instead of going at it on my own and trying to figure it out.  If you plan on getting this TV, do some digging in these reviews because they are really helpful.  I have no regrets buying this TV from Amazon and having it delivered.  It was delivered prompt and handled with care.", "Date": "October 14, 2010"}, {"Title": "Couldn't be happier", "Author": "Charlie S", "ReviewID": "R2AV67R8J881U4", "Overall": "5.0", "Content": "After putting off buying an HDTV I finally broke down. I had a perfectly good 27\" Sony Trinitron that I was happy with. I did alot of research with Consumers Reports and on the web and decided on Samsung 40\". I loved the swivel base. Not all HDTV's come with a swivel base. It was a little bit more but the reports were very good. I was always taught you get what you pay for. Went to a few stores and priced a few sets. Amazon had the best price but I was concerned about having a TV shipped. I never bought anything from Amazon before. I was so impressed when I read that when ordered what time period and day I wanted it delivered. I ordered on a Sunday and chose to be delivered on Thurday between 10-1pm. I was able to track the package. Then I got a call at 10:15 on Thursday and the driver said he was in the neighborhood and will be there shortly. I walked out on my terrace to have a smoke and they drove up in 3 minutes. I checked the package and model number and told them I was impressed with the service. I hooked it up shortly thereafter and was very pleased. I would reccomend the TV but I should have gone a little bigger but I had a budget. I was impressed with Amazon service.", "Date": "October 7, 2010"}, {"Title": "Samsung LN40C630 40-Inch 1080p 120 Hz LCD HDTV (Black)", "Author": "R. Riley", "ReviewID": "R3IRXRZ8BG6XEG", "Overall": "5.0", "Content": "This is a very nice television.  The picture quality is great!  You can adjust the size of the picture on the screen, as well as adjusting for movie settings, natural, etc.  It has a lot of features that I haven't even used yet.  My only advice would be if deciding between the 40\" and 46\" go for the 46\", I wish I had.  In a smaller room 40\" is ok, but in most living rooms at least 46\" would be much better.", "Date": "September 14, 2010"}, {"Title": "Superb value, image clarity, colors, and sound! Works great in bright rooms! No glare!", "Author": "Tilley Duthie \"tilleyd\"", "ReviewID": "R2DRBK9P4998B5", "Overall": "5.0", "Content": "We have always purchased Sony TVs as part of an ongoing tradition but that has now ended with the purchase of this TV. Our hearts have been won over! The stunning image and text quality this TV provides is truly remarkable, especially when paired with an HD receiver connected with an HDMI cable.Prior to this purchase, we were uncertain whether this TV would present glare issues as we read in reviews that Samsungs are notorious for their glossy reflective screens. Since our purchase, we have not experienced any sort of issues with glare. In fact, in our brightly lit daylight living room the image on the screen remains vibrant, clear and glare free.The built-in TV speakers provide excellent sound and do not require additional investment in a high-end audio system.The thing that attracted us most to this TV was its value! We paid $665 for this TV after some internet rebates. This by itself distinguishes Samsung from Sony and other manufacturers.Setup and installation were a breeze and the operating manual was clear and well-written. We encountered no issues navigating the TV settings and the on-screen menus are intuitive and useful. The overall build quality appears to be sturdy and the product seems to be constructed with quality materials.Move over Japan, Korea is now the king of the hill. Thank you, Samsung!", "Date": "July 28, 2010"}, {"Title": "A great TV with awesome features", "Author": "AussieinNY", "ReviewID": "RY1Z9OGW5H60D", "Overall": "5.0", "Content": "Had this for about 6 weeks now and have only got great things to say about.  Picture quality is first rate with the 120hz refresh really making images vivid. With my 1080 upscaling DVD player you feel like you can reach through the screen to the people and objects. Just got the BD-C5500 blu-rayer player on special from Amazon to match and it is a great combo.  This TV blows away the 2007 Panasonic 42' Professional Series TH-42PHD8UK in our living room.The only minor issues I have found are:- Ability to resize pictures, particularly from video files, is very limited compared with the TH-42PHD8UK.- The built in ability to decode video file formats is great but limited (no .mov, some AVI codecs unsupported). It sometimes crashes and changes device.Cheers", "Date": "June 5, 2010"}, {"Title": "Great TV, when signal is HD!", "Author": "Petru L. Cretu", "ReviewID": "RML0M6Z7L07V1", "Overall": "4.0", "Content": "I purchased this LCD due to the fact that it had great reviews. It is really a great LCD, with good picture and sound, BUT it performs the best when it has HD (High Definition) programming. Otherwise, the picture is kind of bad and it has a greenish tint all over. Get this LCD only if you have HD programming, otherwise you will be kind of disappointed.", "Date": "May 20, 2010"}, {"Title": "Perfect Performance", "Author": "Adriana V.", "ReviewID": "R3RKQSONG690OL", "Overall": "5.0", "Content": "I've had this TV now for about 8 months.  I researched TVs for quite some time before settling on . . . . a Panasonic Plasma.  Then I went to Best Buy and looked at televisions for a half an hour.  Then I went to Walmart.  Then I went to Target.  After all that time just staring at screens (and killing more than a few brain cells in the process), I landed on this baby.  Amazon had a deal I just couldn't pass up so I jumped into the brave new world of Hi Def.  After 8 months of football games in HD, video games, and lots of Netflix, I can honestly say this is one of the best purchases I have ever made.  Everyone in the TV realm talks about \"blacks\" and I find the \"blacks\" to be very \"black\" in this television.  Overall, the colors are great - very saturated.  The picture quality is crystal clear.  Seriously, I feel like I'm at the game.  Or killing zombies.  You know, depends on the day.The biggie in this TV is the 120hz.  Now, for the price difference of something like 60 bucks, they upgraded the model from 60 hz to 120 hz and it shows.  It doesn't show all the time, but when it does, it shows.  Panning through a Bluray feels much smoother.  Overall, the entire movie-watching, team-rooting, castle-storming experience is fantastic with this TV.  And as a bonus - I moved in the last 8 months and the TV made it through the move just fine, wrapped in a blanket.  I would recommend this television, or any Samsung, to anyone.", "Date": "September 7, 2011"}, {"Title": "Completely Happy with My Purchase!", "Author": "sjhug", "ReviewID": "R1GWE6FNE3F6D4", "Overall": "5.0", "Content": "I was already happy about this TV when it was delivered less than 24 hours after I ordered it, even though I chose my Prime free 2-day delivery.I got it out of the box and set it up myself, and I'm a female college student.  So, it's definitely nothing someone with a tad bit of muscle can't manage to do yourself.  However, I would still consider it heavy so don't try to do it yourself if you think you're gonna drop it.Adding the base was simple and hooking it up to my AT&T; uverse and surround speakers took me all of about 20 minutes and that's with having to run cords through the back of my TV stand, etc.As for the actual quality of the picture and sound.  I am extremely happy with picture quality; I adjusted the different settings to get the right fit for the room/lighting, but now it's perfect.  Every one is going to want to adjust their picture to their own liking--it really does depend on how your room is lit, where you sit in relation to the screen, and just your personal preference.  Sound quality is pretty good for an internal speaker--I would rate it better than most TVs in the same range of quality/price.  However, I already had external speakers with my last TV so I hooked them up.  I did use the internal speakers when playing music from a USB and I was happy with what I heard.Overall, this TV is a huge deal for what I paid ($568.00).  Free Shipping is a plus.  If you are looking for great prices on TVs, the best time to look is during March Madness when suppliers are trying to get rid of old models to make room for new ones.", "Date": "May 1, 2011"}, {"Title": "Stunning Picture", "Author": "DeaninVA", "ReviewID": "R2DAX831FVRMSD", "Overall": "5.0", "Content": "I bought this 40 inch, which would fit inside my existing furniture, and it is beautiful. In regular broadcasts (haven't upgraded to HD yet) the picture is excellent. Viewing a Blueray disk, it is incredible. Great, great tv. I gave sound a 4 but I don't expect fantastic sound from a flat screen tv.", "Date": "March 2, 2011"}, {"Title": "Not recommended", "Author": "fishermanjeff", "ReviewID": "R3TYYQ6XJQ46NE", "Overall": "1.0", "Content": "Our first puchase in the flat screen world in the beginning of January.  Amazing picture on this set and thought we were in business.  we only have analog cable but we get a high def equivalent of each of our channels.  Here it is about March 1 and the digital tuner on this set is shot.  Warranty periods are over and nobody will do a thing without shipping it in the original package anyway.  Sounds like this is a common problem with the Samsungs.", "Date": "February 27, 2011"}, {"Title": "400 lb Panasonic HDTV Replaced by light Samsung LCD TV", "Author": "Harvey Muller", "ReviewID": "R1FBU1EK7FM8TQ", "Overall": "5.0", "Content": "We had a LARGE bulky HDTV in the living room for a couple years now.  I had been watching LCD tv pricing for awhile and finally made the buy decision for this Christmas holiday.  Despite the Samsung's larger screen, the room feels larger again with the huge cathode ray HDTV absent.These are my subjective observations about the Samsung LCD TV:Physical Appearance.  It is just as handsome in the home as it is in the store.Ease of Setup.  The TV is basically plug and play.  For those not satisfied with the generic setup, the settings menu provides a large number of items to tweak.HD picture quality.  The clarity is amazing.  Only two things to mention.  One, you will probably want to calibrate the display to your own preferences (Google helps).  Two, you will also probably want to pair it with a PS3 or other suitable means of providing an HD signal to the TV to enjoy the full capabilities of the screen.Sound quality.  The sound is great for a TV, but for those expecting a cinema experience you may want to add an external sound system.Remote ease of use.  The remote gets the job done and is easy to use.  The TV takes a few seconds to boot up and turn on, you only need to press the power button once.  =)I preferred the SAMSUNG 40\" LED LCD TV because it seemed very crisp and sharp in the store while their LCD TV did not seem as bright.  But I am now content with the LCD TV after having it in the home and putting it through its different modes of operation.HD movies are amazing to watch on this TV.  It feels like we have a little theater in the home.  And now that we have a PS3, my wife cannot get enough of streaming Netflix.", "Date": "December 28, 2010"}, {"Title": "Great picture and tons of features!", "Author": "J. Polzin", "ReviewID": "R19FXUK5GPZF1W", "Overall": "4.0", "Content": "I've been watching the prices and researching HDTVs for a couple of years, waiting for prices to come down on the higher quality units.  When Amazon had this TV for $650.00 with free delivery, I finally jumped.  I have had my eye on Samsung TVs for quite awhile.  Most reviews I've read have been positive for the Samsung brand, and so far I've been very satisfied.PROs:-Great crisp video quality!!  Graphics pop and even smaller text is easy to read.-VGA input is an awesome feature.  I like to play computer games from time to time and also do some video editing on occasion.  Hooking my computer up to the monitor was simple and increases my workspace.  And playing games on the larger screen was amazing.-The USB ports are a nice touch. I only wish that the TV would have audio outputs, so that any music or video accessed through USB could be directed through my surround sound.  But it is nice way to listen to all your mp3s.  It's almost like a giant mp3 player!-Easy to assemble and set up.  Back in the day of massive CRTs and even more cumbersome giant projection units a 40\" Television would have required a couple of big guys to muscle it into position.  I was able to unpack, assemble the stand and lift it up onto my television stand entirely on my own, without incident.  It was harder getting rid of the 32'' CRT that was there before.CONs-While this TV allows you to adjust display settings to the most minute detail, it was a bit daunting getting through all the settings.  I found some of the online user comments extremely helpful in getting the display to look great.  It does take some tweaking.  I originally had some judder issues and frame jumping.  (Turns out it was the 120 Hz True Motion settings...they needed to be turned into \"off or clear\" mode to get rid of the judder)-120 Hz True Motion....I could be wrong here, but at this time I think that it may almost be unnecessary. Almost every source I've connected to the TV only inputs at 60 Hz.  Which is why having true motion turned on caused issues with judder. Perhaps some gaming consoles output at 120 hz???  I'm not sure.  Again, I could be wrong about that.  I had the impression that using 120 hz would improve the clarity and sharpness of images in motion.  With my current settings at \"clear\" it appears to be un-utilized.  Longterm, however, I could see sources catching up to the 120 hz output, so I won't need to get a new set when that happens.  So perhaps it's an investment in the future.Overall, I'm extremely happy with this TV.  The Pros far outweigh the cons.  Quality for less money...I couldn't go wrong.", "Date": "December 8, 2010"}, {"Title": "Just WOW! 120hz works!", "Author": "NoTexasCowboy \"NoTexasCowboy\"", "ReviewID": "R2J3CTAD39H5XT", "Overall": "5.0", "Content": "I received this TV yesterday to replace my Samsung 720 60hz unit that is moving upstairs to the bedroom and all I can say is WOW!!!Even though my cable box only has a 720 output, the picture on this TV is NOTICEABLY more clear and crisp than the 720 60hz!  So for those of you wondering if the 120hz is worth the upcharge, I thought I would let you know that *I* certainly feel like it is!The built in USB port shows my home videos off of a thumb drive and is as crisp and nice as it is on my monitor, although it only supports a few video codecs. (showed AVI and mpg, but not MOV or mt2s) I have not tried DVD's or Blu-rays yet, as the player will be delivered Tuesday, but I am looking forward to it.  Everything else works beautifully, and looks absolutely great!Setup was as easy as it gets...assemble the stand, attach the TV, put it in place and plug in the HDMI and power cable.  That's it.Recommended :)Best Regards,", "Date": "November 28, 2010"}, {"Title": "Beautiful picture quality", "Author": "Aiylan", "ReviewID": "R27YROBM9WXC7Q", "Overall": "5.0", "Content": "I purchased this TV after hearing rave reviews from my friends who also own a Samsung TV and after determining what size and type of TV that I wanted.  I've watched horror, action and drama movies on the TV.  It all looks great and even the older movies look fantastic.  I definitely recommend this TV!", "Date": "November 28, 2010"}, {"Title": "sensational picture", "Author": "Richard Libowitz \"critic at large\"", "ReviewID": "R50JUSK9JSTRA", "Overall": "5.0", "Content": "We have only had our set for a few weeks but are absolutely staggered by the quality of the picture. Film looks like videotape and the clarity gives a suggestion of 3-D.We could not be more pleased.", "Date": "September 18, 2010"}, {"Title": "A great deal on a great tv", "Author": "Matthew Alvarado", "ReviewID": "R3UHRA26KV5YW1", "Overall": "5.0", "Content": "Excellent picture definition especially with blue ray.The black levels are also deep and dark.Great color saturation in all colors. None of that faded LCD look.The picture is crisp and clear from a wide range of angles.Excellent refresh rate with TV or gaming consoles. No ghost images.Excellent sound quality and volume levels even without surround sound.Easy hook-up and intuitive controls.A huge amount of options for inputs and outputs.Overall just a really great TV at a really great price.", "Date": "September 11, 2010"}, {"Title": "spike tucson az. great buy great tv", "Author": "spike", "ReviewID": "R2Z4F2906MNCNA", "Overall": "5.0", "Content": "dollar for dollar great tv terrific picture just be careful of price amazon is great buys but they change prices by the week bought this tv for 710 2 weeks aago want to buy my daughter one today its saying 749 don't understand ?", "Date": "September 5, 2010"}, {"Title": "Captain Kirk is in my living room!", "Author": "SMG \"homebodies\"", "ReviewID": "R3KWRIBBZQ4PBG", "Overall": "5.0", "Content": "This television has a beautiful picture, good sound, and is a pretty set.  My husband keeps shouting at the tv for those people to \"get out of our living room!\"  Great price for the quality.", "Date": "July 31, 2010"}, {"Title": "Good value for the money", "Author": "Paul Lockyer \"Headhunter\"", "ReviewID": "R3TM4DLNOY935P", "Overall": "5.0", "Content": "This is my third flat panel.  The other two were Panasonic Plasmas. One I hung from a bedroom wall and it weighs over 80 pounds so I'm not exactly a novice.  I thought the Samsung had really lousy instructions.  It was unclear how to attach the stand and took a few tries to figure out.  The manual switches on the panel are not easy to find or use and the instructions tell you little about locating them.  I thought the TV had no manual on/off switch until my wife inadvertently bumped it and turned on the TV.  It turned out to be a touch/screen (like a PDA) with manual controls in the lower right corner.The picture is excellent. The sound is very good.  Picture resolution is definitely better than the plasmas, almost so much that movies' special effects look a little less convincing.  I haven't yet tried a football game on it, which is where the plasmas shine, and which is about the only reason to watch TV.  However, it is in my daughter's bedroom so that may not be relevant.The bottom line is that I would definitely buy this Samsung model again.", "Date": "July 19, 2010"}, {"Title": "Great picture/sound/features", "Author": "J. Beck", "ReviewID": "RSRHGA3OZFC1L", "Overall": "5.0", "Content": "This was the first TV I've purchased in the last decade that I actually did research on - I purchased a few with roommates who pretty much got talked into whatever model the guy at Best Buy told them to.  From the get-go this one was on my radar, but checking them out in person at a local big box shop was the final straw.  There were a few TV's that really stood out picture wise, but this one was the best...and the cheapest.I watch some TV on it, but I bought it primarily for my PS3 - and it shines for both gaming and Bluray.  The one feature I knew of and thought was going to be somewhat beneficial was the USB port - I use it constantly with one of my external hard drives.  Was planning on rigging up my computer to a KVM switch to go between my monitor and TV but now there's no need.  I had low hopes for compatibility from hearing other systems constantly failing to play .mpeg or .avi formats, I've yet to find something the TV doesn't play natively.All said and done it's a fantastic TV and the fact that it's less expensive than it competition just seals the deal.", "Date": "June 28, 2010"}, {"Title": "A Great Choice", "Author": "Donald A. Beech", "ReviewID": "RNDRZHCBD98JM", "Overall": "5.0", "Content": "After spending many hours over a number of months researching various possibilities for my first HDTV, I zeroed in on this Samsung model, which fit all of my criteria and had received numerous excellent reviews. After two months, I am very pleased and completely satisfied with this TV's performance. Shipping was arranged promptly and smoothly; set-up was easy on my own (although it took me a while to figure out that I had to loosen the screws a bit in the stand to allow the screen to swivel); and programming was fine using the manual. Although I am only an occasional TV and movie watcher, it is so enjoyable now to view programming in true high definition. I highly recommend this model if the specs meet your requirements.", "Date": "June 27, 2010"}, {"Title": "Very Pleased", "Author": "Gary S. \"Gary\"", "ReviewID": "R20YJM9GUBMTOK", "Overall": "5.0", "Content": "TV was purchased a month ago and we've been very pleased.  Package arrived on the date scheduled, and was light enough for a single person to carry and set up.  Pay attention to the note in the instructions about placing the TV on the stand while upright, NOT lying down, or it could end up crooked.  It was a bit of a pain removing & re-inserting the stand to fix the slight tilt that I created.While my DVR shows are still in SD (hurry up Ceton), playing HD/1080p videos via the USB port blows me away every time.  It's played all formats of videos I've attempted via USB (TS, MKV, AVI).  Was on the fence regarding the 60Hz vs. 120Hz before purchase, but would strongly recommend 120Hz now.  Downloaded some HD Desperate Housewives episodes for my wife and she said it's like watching them in real life.Sound quality, while not great, is what I'd expect for the size/locations of the speakers.  Perfect for our bedroom, but would recommend something external for a larger room.  Video quality during gaming (XBox360) was a bit off until I enabled the 'Game Mode' but now it's perfect.  Using it as a PC monitor via the PC input looks great too.", "Date": "June 24, 2010"}, {"Title": "Bang for the buck", "Author": "Crosley B. Jackson", "ReviewID": "RYVMRRW0VTM7Y", "Overall": "5.0", "Content": "After ordering one for my parents, I talked myself into buying one for myself.  I've only had it for a week, but the picture looks incredible.  No complaints.  For the cost, I don't think you can beat it.", "Date": "June 16, 2010"}, {"Title": "Beautiful picture, quality tv", "Author": "R. Dombroski", "ReviewID": "R3NLCUNHKCPQ21", "Overall": "5.0", "Content": "I love this TV, it was easy to set up , easy to use, terrific picture quality, great value. I bought a 40\" should have picked up a bigger one but this was what I wanted to pay, no regrets.", "Date": "June 13, 2010"}, {"Title": "Blows my 40XBR6 out of the water", "Author": "evalam23", "ReviewID": "R30Z0SIO9I7SW", "Overall": "5.0", "Content": "Well what can I say, an awesome TV, watched Avatar on Blu-Ray and it was simply amazing, I even watched it on a upconverted DVD player and it still looked good.  Love rewatching (not sure if that is a word) Lord of the Rings upconverted to 1080p.  My Sony XBR6 which is not that old does not even compete.  The only problem when you watch something on a 40 inch with this much clarity you are wanting a bigger picture.  I bought this TV because it was under $800, free shipping and all the positive reviews.  Cannot complain was almost ready to buy another one cause the picture was that good.  You know recession and all, so I will just sit back and enjoy this TV hooked up to my PS3, even played some MW2 with my laptop hooked up with HDMI and that was awesome.  If you are looking for 40 inch that has a great picture for under 800 look no further.There is one thing to point out and that is sound sometimes comes in and out playing a few video games with my PS3, not sure what that is all about.  Might buy the 3 year warranty just in case.  Things just not made like they used to be, if you know what I mean.", "Date": "May 15, 2010"}, {"Title": "Great TV", "Author": "Admin \"Church Lady\"", "ReviewID": "R3E4KSNH53YQE8", "Overall": "5.0", "Content": "This is our 2nd Samsung tv and we are very happy customers. It does everything you expect and nothing you don't. I watched PT109, a 1963 movie, the other night and it was amazing! We added the Sony sound bar system and together, it is great. Watching network tv would be okay with the tv audio, but I would not enjoy music over the tv or movies as much if we were using the tv's sound system. We didn't expect a tv to have great sound, so bottom line is we love everything about it. We thought it to be a very good value considering all the alternatives.The product was delivered to us by Pilot Services and they did a very good job. They had me inspect the box before opening it, and put the stand together expertly (even looked at the instructions!) They took the packaging away with them and the delivery man was very professional.It took longer than I expected, and all other pieces of our purchase had arrived prior to the tv getting here. I had read so many reviews saying the tv was delivered in 4 days, etc., I expected a similar experience. I tracked the product through Amazon for a 6 days before it showed that the tv was in transit. When we got a call from Pilot, we accepted the first option for delivery they had available. All told, it was 9 days for us to get the tv. Buyers should be aware that there is no guarantee of a 4-day deliver experience.", "Date": "May 2, 2010"}, {"Title": "Amazing Television!", "Author": "David P.", "ReviewID": "R46QXGONZ6VUR", "Overall": "5.0", "Content": "I bought this TV as an upgrade from a 26\" LCD screen, and I have not regretted buying it at all! I was a bit skeptical to buy a 120 Hz TV since sometimes the picture frame rate can look pretty crazy, but this TV has the option to opt to 60 Hz if you so desire. The 120,000:1 contrast ratio is unbelievable, as is the picture in general. It's such a sleek, attractive design as well. The speakers on the TV are alright--I don't use them though. I use the optical digital audio out to hook it up to my sound system. Regardless, you can not go wrong by purchasing this TV!!", "Date": "April 14, 2010"}, {"Title": "Excellent TV, can do without Auto Motion Plus", "Author": "KR \"Tall Guy\"", "ReviewID": "R2KNRQ3A64HVR0", "Overall": "4.0", "Content": "I agonized over whether to buy a 40\" TV with 120hz or a larger TV at 60hz.  I wound up going with the 40\" 120hz from Samsung with the hope that the higher refresh rate would make the picture unbeatable.Many people have noticed that the 120hz TVs from Samsung make the picture look like it was filmed with a camcorder, or look like soap-opera video quality, which is not all that desirable.  It turns out that this is really because of a technology that Samsung uses to \"upconvert\" form the 60hz broadcasts of digital cable and DVDs to 120hz.  This is the Auto Motion Plus feature.  Turning it off makes the picture look normal, and slightly enhanced from a 60hz TV.  There sometimes is a \"choppy\" look, but this is most likely just how a \"lower quality\" signal looks on a \"higher quality\" display, sort of like how standard definition video looks awful on a high definition TV.  However, the picture looks great, and there is no blur, as well as there being vivid colors.So what's the point of 120hz?  Well, essentially you are \"future-proofing\" your TV, since television and Bluray discs will most likely broadcast at the higher rate within the next few years, and that will undoubtedly look incredible on a 120hz TV.My recommendation?  The TV is great, and if you buy this then you probably will enjoy it more with the Auto Motion Plus turned off.", "Date": "December 2, 2010"}, {"Title": "Fantastic for the Price", "Author": "Annette", "ReviewID": "R35KNMF6501B5P", "Overall": "5.0", "Content": "I've been watching this TV since February and in order to take advantage of the promotion prices finally decided to bite the bullet. If you want a quality, top rated 40\"-42\" TV for between $700-$800, this is the one to get. This Samsung TV replaces a 3 year old 37\" 720P Sharp Aquos that was excellent for it's day but doesn't come close to this 40\" Samsung. The clarity of the 1080p 120Hz vs the 720p 60Hz of the Sharp is like night and day. I looked at it in the store next to a 40\" 1080p 120Hz Samsung LED TV and could not tell the difference. Honestly, the clarity is so dramatic it takes a little getting used to.The only problem I had was getting the TV on the stand. The directions are poor and it took a friend who also has a Samsung to show me what I was doing wrong. If you have the same problem, be aware that the TV actually slides ONTO the base, it does not sit against the vertical section of the L bracket. If you do that you won't be able to get the screw holes to line up.I am loving this TV. I had rented Sherlock Homes in HD and it was the first movie I viewed on this TV...I was blown away by the detail. Everyone has their own personal preferences for the settings but the Dynamic option is awsome for everyday viewing.I highly recommend this TV.", "Date": "May 13, 2010"}, {"Title": "nice mid level hdtv", "Author": "andy", "ReviewID": "R458CD9Z6TIP0", "Overall": "4.0", "Content": "We have had our Sammy now for just over a month. The good: black levels are deep--comparable to that of a low-end plasma, the factory corrective electronics do a nice job cleaning up bad TV signals, the adjustments are infinitely flexible--and simultaneously maddening if you are in any way OCD about visual picture quality, it has a slender frame for its picture size, the fit and finish of the TV are visually appealing, judder is kept to a minimum for the most part--except on a few, old slow-panning scenes. The bad: I have one stuck pixel--red, and it drives me slightly crazy...and it will not go away. I understand that you need a min. of 5 such pixels for them to consider it a defective display. Also, the sound is not so good. Please plug this TV into a good surround system to do it justice. The 2x10w speakers are tinny and somewhat harsh sounding. The display will tell you that it is operating at 60 HZ, but this is a misnomer. Your input is coming in at 60 HZ, but your display is still operating at 120 Hz...if that makes any sense. Overall, we're pleased with our purchase and would recommend it to friends.", "Date": "April 26, 2011"}, {"Title": "Excellent Product & Service", "Author": "RGC", "ReviewID": "R35UON6QW76XSI", "Overall": "5.0", "Content": "After researching numerous reviews and checking out Cnet's review on the \"Best cheap TVs\" [...] we decided to go with the Samsung LNC630.  So far it has been a great TV with no issues after 2 months", "Date": "February 28, 2011"}, {"Title": "Important first impression issues", "Author": "RPGer \"another opinion\"", "ReviewID": "R2HWQZYU8XVBCX", "Overall": "4.0", "Content": "DO NOT BE ALARMED IF THE TLEVISION DOESN'T MEET YOUR EXPECTATIONS WHEN YOU TURN IT ON FOR THE FIRST TIME! You are only a few tweaks away from an excellent picture.This review is only about first day setup and viewing; I've only had the set 3 days so anything else is premature.The first evening I felt I had made a terrible mistake or had a lemon.  I have a Playstation 3 and expected it could only be a better experience than it was when played on the 2.5 year old 26\" LG entry level I replaced. If there were shadows, the screen became virtually unviewable; if the character passed a window with sunlight comine in, the whole screen would flash brightly.I went through the user manual - I am comfortable with electronics, but the information in the manual is very poorly written with little practical instruction; for example, there was a brief mention of a game mode (the comments about using the game mode indicated diminishment in the quuality of the image, the image shaking... based on all that negative information why would they even have a game mode?)  Further, I could not even find the game mode option (when directed to it by tech support the following morning, it was not an intuitive path at all).The next morning technical support was fairly helpful, after first suggesting setting up a service call before offering any information  - the fix to the screen blacking out in shadows was very simple: turn off the \"EcoSmart\" (there is a case of over kill: having the power consumption change second to second is one of those features that I am sure CNET will say to ignore.So, after experimenting with various settings adjustments the picture looks good, and I can get evening lighting in a game. I'm not done trying to optimize the picture, but a bit at a time.  I am comfortable with the purchase now.As I said, I wouldn't review anything I just bought, but the fact the default settings are not optimal and that the owner manual is really subpar robbed me of the pleasure of a new upgraded television.On balance, I am really pleased by the high sound quality from the built in speakers.  I am confident the major problems are far-less-than-optimal presets,and a user manual that should be a major cause of embarrassment to Samsung.It doesn't even include the specs; that first night I was questioning if it really was 120 refresh - Playstation was the only screen that showed rates, and that was 60!", "Date": "February 2, 2011"}, {"Title": "Died Shortly after Arrival", "Author": "J.D.H", "ReviewID": "R2XAWZSFGDFVLH", "Overall": "2.0", "Content": "After carefully setting up this brand new Samsung LN40C630 TV it died after 10 minutes of first use. As a precaution I even waited 24 hours for 1st power up because of somewhat cold temperatures during shipping.Shut down & wouldn't turn on again. After consulting with Samsung support it was determined that there was a power issue that would require a technician from Samsung to come out in a week or more. I decided to return to Amazon thanks to their very generous & simple return policy. It's very disappointing but might have been damaged in shipping?I will give this model another chance because of all the great reviews but Amazon is now out of stock. Will find local source for same.Amazon made return easy & effortless.Still very disappointed,though....", "Date": "January 11, 2011"}, {"Title": "Great deal", "Author": "Brad Smith", "ReviewID": "R3M67X66QR70DA", "Overall": "5.0", "Content": "I am quite impressed by this lcd tv, which I bought after Black Friday at a great price of $599. The picture is a vast improvement over my old 32 inch Samsung, acquired in early 07 for more than double the cost. This model also boasts what I consider almost astoundingly good sound. Coupled with an Insignia internet blu-ray player, the sound of Pandora on here is better than with any dvd and almost good enough as not to require any type of external speakers. I am not sure why this is, but the sound is many times better than on my older Samsung tv. I have not even fiddled with the display controls yet, and am perfectly satisfied with how this tv looks. The multitude of display options is mind-boggling. Most of the normal dvds that I watch are in 720p, so they do not even take advantage of the tv's 1080p capacities. As far as the 120hz feature, I'm sure that makes a difference, too, but I am not qualified to judge it over the older 60hz models. It does look good. If you want a great tv that looks better than anything you could imagine just a few years ago, then you can do little better than this one.", "Date": "January 1, 2011"}, {"Title": "Great, but with a mind-boggling flaw that ruins it", "Author": "Edward Sunder", "ReviewID": "R3RQRTCJVG410J", "Overall": "1.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moVC9P531ZL4CDembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moVC9P531ZL4CDrefresh_preplay() {\n\ndocument.getElementById(\"cv_moVC9P531ZL4CDchiDiv\").innerHTML = document.getElementById(\"cv_moVC9P531ZL4CDhiddenPre\").innerHTML;\n};\ncv_moVC9P531ZL4CDrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moVC9P531ZL4CDso;\t   \n\n\nfunction cv_moVC9P531ZL4CDloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moVC9P531ZL4CDso = new SWFObject(swfLocation, \"cv_moVC9P531ZL4CDAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moVC9P531ZL4CDso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moVC9P531ZL4CDso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moVC9P531ZL4CDso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moVC9P531ZL4CDso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moVC9P531ZL4CDso.setAttribute(\"height\", swfHeight);\n          cv_moVC9P531ZL4CDso.setAttribute(\"width\", swfWidth);\n          cv_moVC9P531ZL4CDso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moVC9P531ZL4CDso.write(\"cv_moVC9P531ZL4CDflashcontent\")) {\n          fp_resizePlayerSpace('cv_moVC9P531ZL4CD', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moVC9P531ZL4CD';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moVC9P531ZL4CD', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moVC9P531ZL4CDloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moVC9P531ZL4CD\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3AJDP7SWNX4UE\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3AJDP7SWNX4UE\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3RQRTCJVG410J\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3AJDP7SWNX4UE/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moVC9P531ZL4CDduration')) {\n      document.getElementById('cv_moVC9P531ZL4CDduration').style.display='none';\n    }\n    cv_moVC9P531ZL4CDloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moVC9P531ZL4CDloadSwf(movieID, playerVersion) {\n   return _cv_moVC9P531ZL4CDloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moVC9P531ZL4CDnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moVC9P531ZL4CD', 0, h);\n}\n\nfunction cv_moVC9P531ZL4CDresetPlayer(w,h,bw,cc) {\n  cv_moVC9P531ZL4CDnewHeight(h);\n\n  cv_moVC9P531ZL4CDso.addVariable(\"resetBandwidth\", bw);\n  cv_moVC9P531ZL4CDso.addVariable(\"cacheCode\", cc);\n  cv_moVC9P531ZL4CDso.setAttribute(\"height\", h);\n  cv_moVC9P531ZL4CDso.setAttribute(\"width\", w);\n  cv_moVC9P531ZL4CDso.write(\"cv_moVC9P531ZL4CDflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moVC9P531ZL4CDRollOverImg = new Image();\ncv_moVC9P531ZL4CDRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81gsulDOg0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moVC9P531ZL4CDpreplay = document.getElementById('cv_moVC9P531ZL4CDpreplayImageId');\nif (cv_moVC9P531ZL4CDpreplay) {\n  cv_moVC9P531ZL4CDpreplay.onmouseover = function() {\n    cv_moVC9P531ZL4CDpreplay.src = \"http://ecx.images-amazon.com/images/I/81gsulDOg0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moVC9P531ZL4CDpreplay.onmouseout = function() {\n    cv_moVC9P531ZL4CDpreplay.src = \"http://ecx.images-amazon.com/images/I/81gsulDOg0S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moVC9P531ZL4CDpreplay.parentNode;\n\n  var cv_moVC9P531ZL4CDcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moVC9P531ZL4CDcurrentClick) {\n      return cv_moVC9P531ZL4CDcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:37 MinsI purchased this TV along with the Samsung HW-C450 sound bar. Both worked fantastically. The picture is great, the sound is fantastic. In order to use the TV with the sound bar, you set the TV (under Sound -> Speaker Select) to use \"External Speaker\". Once you do this, however, every time you change the volume it says \"Not Available\" in a decent-sized gray box in the MIDDLE OF THE SCREEN. This box stays there for a couple seconds (more if you press the button a couple times). This is horrible. If the movie gets intense and you want to change the volume, you get an error message right in the middle of the screen EVERY SINGLE time you change the volume. Everyone in the room goes, \"Hey! What happened? Why can't we see what's happening?\".I called technical support and patiently explained my problem to them. They indicated this was a feature, not a bug, and that they would not be offering any way to disable this in the future. They suggested I just use two different remotes - one for the TV, one for the sound. Which is not, in my view, an option. Sure it's technically possible, but I got both products from Samsung specifically so that I wouldn't have to dp that - so they'd be compatible. I love Samsung products (I own an Epic among other products) and I love both of these products individually, but am returning them because this is so glaring a user interface error that I cannot live with it. I only hope Samsung reads these kinds of complaints and fixes this issue for future users.This video shows what I'm talking about.", "Date": "December 28, 2010"}, {"Title": "I love my new tv1", "Author": "Frances", "ReviewID": "R83HG0XAK2WFM", "Overall": "5.0", "Content": "I'm not a very sophisticated TV reviewer - I may never get past turning it off and on -  but I read the other reviews and am very happy with my purchase so far. It arrived quickly, in perfect shape, and I was able to set it up pretty easily. I haven't attempted the internet-wireless thing yet, but I LOVE it overall. The picture is great and I don't get the weird slow down thing with HD.", "Date": "December 19, 2010"}, {"Title": "TV is Awesome so far!", "Author": "Ry Tuc", "ReviewID": "R54VHPN0B77RH", "Overall": "5.0", "Content": "TV is working awesome so far! Love it! I ordered the tv on 9/30/10 and it arrived here in Tampa on 10/06/10. CEVA was the free super saver shipping company and their service was outstanding! They called me to arrange a time to be home that was convienent for me and they showed up right on time. They carried the tv upstairs for me, unpacked it, intalled the base, set it on my entertainment center, and then had me turn it on to make sure everything worked and they took off. Very hassle free and professional delivery service! A+ I've only had the TV a couple of days but it's been very smooth sailing so far. Love all the connections, the remote, the settings menus are very intuitive and easy to navigate, the HD resolution is awesome... Worth every penny of the $749.99 I paid for it. I'm also going to purchase the 4 year square trade warranty to cover it for the next 4 years just in case. Sounds like it's worth it to me.", "Date": "October 8, 2010"}, {"Title": "Samsung 40\" LCD TV", "Author": "rich185", "ReviewID": "R3VYNAPF9Y8PRG", "Overall": "5.0", "Content": "Great picture and plenty of options to fine tune for your viewing needs.  Has good sound also.  Got the best price at Amazon and the delivery time beat their estimate.", "Date": "October 2, 2010"}, {"Title": "Great tv with no wireless connectivity", "Author": "Krishnapraveen Yadlapalli \"KK\"", "ReviewID": "R2IR54C4DI6E4Z", "Overall": "4.0", "Content": "Very good quality TV for the price. Video quality is amazing. Sound quality is acceptable. The major drawback with the remote. I have hard time pressing the buttons on this remote.. Not very convenient. TV doesn't have the internet capability. All share lets you watch photos, videos from the PC but you can not watch the online videos.", "Date": "October 2, 2010"}, {"Title": "Samsung 40LCD TV", "Author": "Rosemary Moran", "ReviewID": "R22GPJMESQRMP1", "Overall": "5.0", "Content": "This is an excellent TV.  Picture and sound are great. There have been no problems.  Easy to set up, attractive design.  We have absolutely no complaints.  R. Moran", "Date": "October 1, 2010"}, {"Title": "It's a Samsung after all", "Author": "Rick Palmisano", "ReviewID": "RCH6BAOKF35QC", "Overall": "5.0", "Content": "This is my 3rd Samsung and as usual I'm very happy with it. Vibrant colors, great sound and very thin. I wouldn't expect more.", "Date": "September 25, 2010"}, {"Title": "Great value", "Author": "Brad Fisher", "ReviewID": "RUWA7OYZK8XEB", "Overall": "5.0", "Content": "The product is even better than advertised, the quality of the picture is outstanding. It was an easy set up and delivery was on time.", "Date": "September 22, 2010"}, {"Title": "Great quality at a good price.", "Author": "AMLLC", "ReviewID": "R2HI6PD6RN6103", "Overall": "5.0", "Content": "We bought this TV because it was a 40\" with dimensions of less than 39\" wide. So it will perfectly fit into our small TV space. The picture quality is excellent. We listen to the sound through our surround sound system so I can't really comment on the sound quality of the TV. I am really beginning to like Samsung products - they seem to be high quality and on the technology cutting edge. Also, bought the Samsung blu-ray player to go with it and love it's Wi-fi capability and internet apps. We use it to stream our Netflix movies all the time.", "Date": "September 21, 2010"}, {"Title": "Fantastic!", "Author": "Cobe \"Cobe\"", "ReviewID": "RF2C9HBLZQ5S", "Overall": "5.0", "Content": "I have had several very good TVs in my life, but this one has blown me away. I got this one for the bedroom. The image is so perfect it just looks like one is right there, being part of the scene. The stereo surround sound is excellent even without any extra speakers. On HD channels the degree of perfection is such that it looks like one is watching a 3D movie. I just wish all channels were on HD. We have been with Dish Network for ten years and decided to upgrade to a new HDTV receiver. Out of a total of about 140 channels, we get some 40 or 42 HD channels, and those are the only ones I now watch. Since this HDTV arrived, I have even found myself watching certain uninteresting or silly movies that I would have never watched before. But with this HDTV even the stupidest movies seem attractive and serve the purpose of testing the excellent quality of the picture and the stereo surround sound on this tv. My laptop has blu-ray so I hooked the laptop to the TV to watch two blu-ray movies and both the image and the sound are also spectacular. On top of it, this TV has a beautiful design; it's the most elegant LCD HDTV I have seen. To me, this HDTV has it ALL. Boy, am I happy I got it!I have aso fallen in love with the remote. It is the nicest, most user-friendly remote I have ever had, with big numbers and light too. As we are with Dish we need to use the Dish remote to switch channels, but I love this remote so I use it for everything else.(Concerning the manual, it has such a small font that I don't even feel like reading it. This is something most manuals from most manufacturers need to look into.)", "Date": "September 18, 2010"}, {"Title": "Best TV I Have Ever Owned", "Author": "Mindray", "ReviewID": "R1B7X9LZKYWHGL", "Overall": "5.0", "Content": "As a tech junkie, I have been through my fair share of high-end televisions. This is honestly the best one I have owned to date. Samsung continues to impress me with their line of televisions. The 120 hertz refresh rate makes the picture quality incredible smooth and the picture is so sharp and clear that I actually feel like the people on the screen are sitting right in front of me. The hint of grey is also a nice touch in my living room and should work well with just about any set-up. Very easy to install. Has several USB ports and has the same audio jack that your computer has so you can plug in a set of speakers if you want. The sound is the only thing that is a little underperforming. But it's nothing that a decent set of speakers can't fix. Overall, this is an incredible TV and definitely worth the price, which I thought was already low :).", "Date": "August 1, 2010"}, {"Title": "Even a used version is amazing", "Author": "Sean Hopkins", "ReviewID": "R203J12AQ1WQYJ", "Overall": "5.0", "Content": "I've been looking for a new TV for a long time and decided that I could afford this one. I think Samsung makes the best LCDs & LEDs out there is terms of picture quality and TV set designs.I took a chance and ordered a Used edition from Amazon Warehouse that was listed in very good condition and saved about $100 off new price. With my Amazon Prime account 1-Day shipping was only $4.99. Brilliant!The TV came UPS and the box was brand new, there was a fist-sized hole punctured in the back of the box and my heart sank. When I opened it up there was not a single scratch anywhere on the unit, infact there was no sign that anyone had ever touched this TV before. Must've been cosmetic packaging damage. Feeling better about buying a like new used LCD TV through the mail!This set looks great! It took about 5min to set the TV on the stand and screw in the bolts holding it in place. This TV is LIGHT! My old 32\" tv weighed almost 80lbs, this set is about 30lbs.I have a PS3, 360, Wii, Cable TV, and Computer hooked into this thing and all them look great. I run my computer through a DVI => HDMI cable and it displays in perfect resolution, Hulu looks great! Game mode did seem to help my game session with some BlOps on PS3, did seem to improve initial controller lag.Games look great, movies look great, Blu-Ray looks awesome. I watched some Planet Earth and was blown away. My old set was an HD, but this is like looking a real HD set. Very nice black levels.I didn't play around with the settings too much, but for me the Dynamic picture setting was brightest and most vibrant. I do have what after researching on AVS forums the lower end display chip, but I haven't any issues after the 1st week. I will update this review if anything goes pear-shaped.Some people may not think the speaker are good, but I don't turn them past 20 and they are loud as hell. When watching something while going to sleep I have to turn it down to around 7 to not be too loud in the house. So speakers are really nice for built it units. They actually sound better than my 10yr old micro-speaker 5.1 system.Well thats it. Good TV, get the bigger version if you can afford it, or hell get some LED action if you can afford that, but this is an amazing buy for those looking for a great TV for a great price.", "Date": "November 22, 2010"}, {"Title": "Why LG may be a better choice than Samsung!", "Author": "Internet shopper \"Retired but not tired!\"", "ReviewID": "R3QH6ID53UZ0AG", "Overall": "2.0", "Content": "This brief review compares certain features of the LG 42LD550 with Samsung LN40C630.These features applies to all sizes of the LG LD550 series and the Samsung C630 series.I had the opportunity to test both TV sets side by side (See Technical Problem below).IN GENERAL- First of all the pictures on both TVs are outstanding.- I did not notice any imperfections in the LCD display on either set.- The base on the Samsung is of superior quality and very rigid whereas the LG model is a bit flimsy (this is irrelevant if you mount the TV on the wall).- The remote controls are comparable however the Samsung has built-in light and the LG does not.- The LG's price tag was $78 higher than the Samsung however the screen on the LG is two inches bigger and the LG has more features (details below)TECHNICAL PROBLEMOne of my objectives was to view MP4 video from a USB hard drive and from USB memory sticks.The Samsung would play part of the MP4 movies and suddenly stop then skip to the next movie when playing from either the stick or the hard drive.It would play 1 hour 25 minutes and 43 seconds of two of the movies and only 24 minutes of a third movie.I tried a 30 Gb and 8 Gb formatted with NTFS and FAT32 respectively.Yes, I verified that the latest software/firmware was installed by connecting the TV to the internet via the Ethernet port.I tried both USB ports but the problem remained.SAMSUNG \"TECHNICAL SERVICE\"The Samsung customer service rep explained \"that this TV model was not designed to play full MP4 movies, only short clips\".She offered to schedule a service visit but made it very clear that they would charge me for a service visit if they did not find a problem with their hardware.I talked to two representatives and finally asked to talk with a technical service rep. They promised me that he would call me back within 24 hours.I eventually gave up waiting, returned the TV and ordered the LG for an additional $78 instead.Nobody from Samsung has ever called me back (it has now been weeks).WHY LG MAY BE A BETTER CHOICEThe LG model has no problems playing my MP4 videos. It plays from my 1 TB hard drive and any USB memory stick (FAT32 or NTFS format).It will even play M4V video which is Apple's file extension for MP4 containers.Here is the best part!Apart from the extra 2 inches (screen size) the LG model offers:1) Netcast, providing direct access to online viewing of Netflix, YouTube, Yahoo weather (and others).2) Free Nero MediaHome 4 CD opening up for Digital Living (DLNA) capability allowing you to access wired or wireless computers or other networked devices throughout your home to the TV.NETCASTUsing the Netcast feature, I no longer have to have my laptop PC connected to the TV to watch NETFLIX and it appears that the picture and sound quality is better than via a connected PC. Also I like to be able to select, start/stop and pause the movies from the LG remote.The TV has the RGB and stereo mini plug for a PC in case you still want to hook one up.I connected the TV to my home network by wire because I like the \"wired\" Ethernet speed and reliability (wireless is also available - see other reviews for details).NETFLIX was very easy to set up. Simply push the Netcast button on the LG remote, click on the Netflix icon. Enter the code displayed on the TV on your PC and you can start watching Netflix movies (obviously you must have a Netflix account or sign up for one). For only $8 per month you can watch unlimited movies without commercials. (I have come to realize that life is too short to spend part of watching TV commercials).DLNA (Digital Living Network Association)Installing Nero on my computers allows the TV to access any drive on my network. From the LG remote I can browse all Music, Video and Family pictures stored anywhere on our home network (Nero requires you to allow access to the specific folders before the TV is allowed access).The LG rep informed me that TVersity software (free) will also work as an alternative to Nero (I have not tried it yet).INITIAL SETUPThe initial setup was equally easy for both brands. The Samsung software/firmware was up to date. It took a short while for the LG to update from version 06.01.05 to 08.02.16 which may be because LG issues updates when new Netcast services comes online.The initial channel lineup was easier to manage on the Samsung.LG CUSTOMER SERVICEThe TV arrived without the Nero CD.I therefore called LG customer service. They told me that they may not be able to ship the missing CD. Instead they suggested I download the trial version from Nero.I therefore contacted Amazon Customer Service and they instructed LG to send me the CD. LG has confirmed that it \"is in the mail\".I am still waiting for the CD (at the time of this writing).I am currently using the Nero trial version which does not support MP4!!!CONCLUSION$78 extra for the LG TV provides a lot of additional functionality and 2 inches extra.", "Date": "January 17, 2011"}, {"Title": "I don't regret the buy!", "Author": "MrRuiz LXIX", "ReviewID": "RR9PTKQBOCZ7V", "Overall": "5.0", "Content": "I want to share a quick review but more than that a experience of this itemand for all you out there looking for a nice tv and great pricelet me tell you what I went through to find the right oneI bought the LG 42LD520 at Walmart and this Tv look really nice and all the feature were cool but came defective  and it was too big for my setting,  didnt like that and took backthen I ordered the  LG 37LE5300 this tv is amazing if you are gonna hook it up to a Home theatre but if you are notthen dont get it! speaker are too little and dont sound good and if you are a gamer you wont love itI sent it back and order this samsung 40\" 1080p 120  gotta tell you this tv fit my needs and my room like the way I dreamed of  I cant tell how happy I feel with every single detail since I opened it I couldnt stop saying .. waoo look this waoo look that.I use this tv as Monitor/ps3/netflix and all work greatnow I dont get into detail like picture setting and all that because there are many reviews of it .I just wanted to tell you that if you are looking for a tv and you are between Lg.visio and Samsungthis samsung is the best choice for the price and the look is way better than Sony x400 , vizio lg and the others.I took some pictures of the setting and you can check them out at the customer picturegood luck !", "Date": "November 20, 2010"}, {"Title": "No internet or apps", "Author": "William G. Witt \"albertusparvus\"", "ReviewID": "R3I833K1JMG1MX", "Overall": "3.0", "Content": "This television has great picture and sound.  However, buyers should be aware that it has limited internet capacity.  The manual states that by purchasing the Samsung Linksys wireless adapter (from $60 to $80) one can connect to a wireless router--which is true.  And this connection does provide internet access.However, the wireless internet access is fairly useless.  Samsung is currently promoting internet apps for its TVs, which include Netflix, Pandora, Napster, etc.  Be aware that this TV does not support these.  The only thing the Linksys adapter allows one to do is to connect to a local network.  I really don't see the point of an internet connection that does not do anything.Needless to say, I was greatly disappointed to discover I had to purchase a propietary Samsung adapter to get wireless support, only to discover that one cannot do anything useful with the wireless connection--apart from share files on a PC.Customer service is also less than satisfactory. It took me almost a week to receive a response to my question about app support, to which I received a one sentence response.Would I recommend the TV?  Yes.  But I would warn against purchasing the additional Linksys Adapter.  If you want streaming, go with a product like Roku.", "Date": "October 1, 2010"}, {"Title": "satisfied", "Author": "Mike Hicks \"reader\"", "ReviewID": "R4SW2VQWYY73I", "Overall": "4.0", "Content": "I have been disappointed in the lack of information about how crutial it is, in order to receive, the quality picture I was after, the other requirmemts that were needed in combination with the new set to get the high quality transmission. For example, the extra cable[HDMI] that is important and that the transmission has to be regulated properly in order to even receive HD tv. Just buying a good quality tv is far from what is required in order to receive and enjoy  good quality television.", "Date": "December 28, 2010"}, {"Title": "Sound Disappointment", "Author": "Michael Buccola", "ReviewID": "R36HCTNTZQ8YQB", "Overall": "4.0", "Content": "Purchased this TV based upon great reviews. Picture quality is amazing, but sound management is all over the place. When tv transmission went digital, my analog set had trouble with consistent volume levels. And when I was shopping for a new HD set they all proclaimed how well they managed sound levels - so I came into HD with big expectations. What a let down.", "Date": "August 10, 2010"}, {"Title": "sound is trapped", "Author": "Rebecca", "ReviewID": "R3R2OUF9PAX5EU", "Overall": "4.0", "Content": "The sound comes out under the TV so allow enough clearance or you won't be able to hear the sound.", "Date": "January 6, 2014"}, {"Title": "Love this TV", "Author": "Jet Jockey", "ReviewID": "R36W64EEAK2DID", "Overall": "5.0", "Content": "I really like this TV for the bedroom.  It has all the features I want including internet connection for updates.", "Date": "September 6, 2013"}, {"Title": "Clear Picture", "Author": "Robert W. Catlin Jr. \"BobCat\"", "ReviewID": "RRF5P41YVODF5", "Overall": "5.0", "Content": "We've had this TV for several years and it continues to provide a clear picture and reliable service.  It's the perfect size for our TV alcove.", "Date": "August 30, 2013"}, {"Title": "Great Picture", "Author": "Janet V. \"janvag\"", "ReviewID": "R1F9JZ69S5EHCJ", "Overall": "4.0", "Content": "Great value purchased 2 TVs and will purchase Samsung products again. They have a good record with other products they produce as I have read in Consumer Reports.", "Date": "April 8, 2013"}, {"Title": "Nice picture", "Author": "C. Towles", "ReviewID": "R2Q9F7SU0318BA", "Overall": "5.0", "Content": "It works well.  I don't know much about TVs, but it's got a nice picture and it's lasting.  The one complaint I would make about modern TVs like this is that when they are turned OFF they let you know with a red light on the front.  So if you're like many people I know who have a TV in the bedroom it's annoying to have a bright red light blaring.  It's not just this product though and it seems to be a standard.", "Date": "March 21, 2013"}, {"Title": "Samsung LN40C630 40 inch 1080 120 HZ LCD HDTV (Black)", "Author": "julia masse", "ReviewID": "R1RHU9E459KGDL", "Overall": "5.0", "Content": "We love our Television. It was the first and only Big item that we have purchased on line.My husband was a little sceptical, but when we received it in great condition, he was happyJulia", "Date": "February 5, 2013"}, {"Title": "A good TV", "Author": "NDS", "ReviewID": "R2XS4660TBZLPY", "Overall": "4.0", "Content": "Have had this HDTV for about 4 years now. Pros: No problems with it so far. Looks and works like new. The size is good for a regular apartment. Cons: The refresh rate could have been better.", "Date": "January 14, 2013"}, {"Title": "Honestly, best TV I have ever owned", "Author": "N. Jones", "ReviewID": "RGACIWXFZPYGD", "Overall": "5.0", "Content": "Well-designed, looks great in my room. Picture quality is superb. I have no complaints with this TV, do yourself a favor and get a Samsung, they make excellent products (my smart phone is a samsung and I adore it as well)", "Date": "January 10, 2013"}, {"Title": "Went for the name", "Author": "Josephine Zloty", "ReviewID": "R1SKMASDHFKOMY", "Overall": "5.0", "Content": "This is a great HD TV...I had someone install it for me.  Delivery time was excellent, had the unit delivered in my home in three days.  The sound is great, hooked it to speakers - can't beat it.  I would definitely go with Samsung again.  Looking for another HD TV only bigger this time...", "Date": "December 31, 2012"}, {"Title": "great tv", "Author": "KT", "ReviewID": "RMFZF7PAF6A7O", "Overall": "5.0", "Content": "I definately recommend this tv. Has great quality, both sound and picture. Can't find any flaws so far. My parents also have the same one and they are really happy with it as well.", "Date": "January 9, 2012"}, {"Title": "Does them pixels and such", "Author": "Joseph T. Earhart \"Jate\"", "ReviewID": "R13KZ5DEPTAXRL", "Overall": "5.0", "Content": "I thought it was some kinda magic when I turned it on!Pictures n' colors so vivid, I'd thought I was starrin' into a window of the future!I reckin' this here would be great for those \"F P S\" games you kids are all playin' today.", "Date": "November 5, 2011"}, {"Title": "Excellent product", "Author": "Allison Jaffe", "ReviewID": "R3HP4BMEVAYZ79", "Overall": "5.0", "Content": "Everyone told me to go with a Samsung TV and I am very happy I did. Being a big purchase for me this past year, I couldnt be more satisfied with the quality of the tv. Its color and sound are wonderful and I had a very easy time setting the tv up.", "Date": "September 10, 2011"}, {"Title": "Great TV", "Author": "buckmore2000", "ReviewID": "RRWZXTO824LZ4", "Overall": "5.0", "Content": "I bought this TV about a year ago, and I have not been disappointed. This TV has amazing clarity, definitely 1080p, has plenty of HDMI inputs, and has USB input so you can watch shows, music, or photos saves on a USB flash drive.I don't know about the sound quality, I use the digital audio out (toslink fiber optic cable) to a surround sound system. When I turn on my DVD player or my PS3, the TV automatically turns on also, very cool feature. The TV also dims or brightens depending on the lighting of the room.I absolutely love this TV.", "Date": "August 22, 2011"}, {"Title": "it has all the basic", "Author": "Hao", "ReviewID": "RLJXFUWS5EPF1", "Overall": "3.0", "Content": "two things i am not happy with it1, I click the power on button and have to wait till i literally think it's dead.2, if I change volume right after trying to switch channels, it won't switch", "Date": "August 13, 2011"}, {"Title": "Great LCD TV; Minor complaints about media file handling and other.", "Author": "Jason Farrell", "ReviewID": "R1ZM99ZW68UQDF", "Overall": "4.0", "Content": "After our 32\" Westinghouse LCD gave up the ghost, I upgraded to this 40\" Samsung LCD after a bunch of research (a 42\" LG was the runner up). The first LCD that was delivered had an apparent power supply problem, as the TV would randomly turn itself off and refuse to turn back on, unless left unplugged for hours. Amazon quickly shipped a replacement, free of charge, and this replacement has worked flawlessly ever since.I love everything about this TV, but especially the vivid color (in standard mode), automatic brightness adjustment to save eyes and energy, the great built-in audio, the usbkey media support, and the clean look of both the LCD and even its stand.A few minor complaints (in order of annoyance):1) I can't use the Samsung Remote control android app with this TV because the Samsung LN40C630 doesn't have the \"Internet@TV\" feature that 650 series and above have. Should've bought it instead.2) 120Hz video smoothing looks like crap, so I've disabled it, HOWEVER, that setting appears to be ignored when playing content off a usbkey(!!!), so movies still have that 'homevideo' smoothed look.3) There's a known problem with playing 720p h264 MKV video files from a usbkey, where the audio is always out of sync by a few milliseconds. Still hasn't been fixed by a firmware update (but hey, most TVs can't play MKV video at all).4) It takes a looong time for this TV to turn on (what seems like 10 seconds), but hopefully that's a good tradeoff for saving power (haven't yet hooked my kill-a-watt meter up to see how much phantom power it's using when 'off').5) DLNA still isn't very compatible (especially with linux servers), so I'm not using it. Using usbkey sneakernet instead.6) The TV supports ext3fs formatted usbkeys, but not ext2, or ext4 (which is needed for playing back files larger than the FAT 4GB limit).", "Date": "August 1, 2011"}, {"Title": "Great tv", "Author": "S. Craven", "ReviewID": "R3LVMT4N8WVCGD", "Overall": "5.0", "Content": "This is plane and simply the best tv I have ever owned.  All and all looks great and even the older movies look fantastic, expecailly the redigitized ones.. I definitely recommend this TV!  purchased this TV after reading rave reviews from ohter sites  who also own a Samsung TV and after determining what size and type of TV that I wanted. I've watched nature, action and drama movies on the TV.", "Date": "July 5, 2011"}, {"Title": "A Great TV For Video Games, Movies, and Cable!", "Author": "Mark Elders", "ReviewID": "R1RZJPWFZB4NQA", "Overall": "5.0", "Content": "I bought this TV a little over a year ago, and since then, I have used it extensively and love it!  The picture is great (after you change the picture to standard settings and not dynamic) and really smooth no matter what you use the TV for!Last school year, I had a Wii, a PS3, a PS2, and an XBox 360 hooked up to the TV at once, and with the Game Mode setting on, the games were smooth and looked incredible!  I can't even describe how good games like Metal Gear Solid 4, Uncharted 2, Mass Effect 2, and Portal 2 look on this TV!I've also watched a great deal of Blu-rays with this TV via my PS3, and you can definitely tell a difference between DVDs and Blu-rays!  Blu-rays make movies like The Dark Knight, Inception, and The Imaginarium of Dr. Parnassus look incredible, of course, but they even make The Office and The Social Network look great!Also, HD channels look incredibly clear with this TV.  Basketball games are so much clearer with HD channels coming through this TV!Even non-HD sources look significantly better on this TV than they would on non-HD TVs.So the picture is great, I've established that, but what about the other features?  Well, the sound is superb.  I feel no pressing need to buy any sort of external sound system for this TV.  Also, it has a lot of nice features that you can adjust at will.  You can set it such that the brightness adjusts to the lighting of the room.  You can let certain external devices control the TV to an extent. (When I turn on my PS3, it turns on my TV and switches it to the correct HDMI port.  I have had a couple problems with this, but they are few and far between.  Turning off the feature will obviously fix said problems.)  The TV has plenty of ports as well: 4 HDMI, 2 Component, 2 AVI, 1 DVI, 2 USB, 1 LAN, and others that I have never used.This is the best TV I have ever owned, and I'm sure I will use it for years and years.", "Date": "May 27, 2011"}, {"Title": "new samsung", "Author": "klosingsircles", "ReviewID": "R1MJPMRSUMK4IY", "Overall": "5.0", "Content": "I love samsungs. I own three of them. I looked around a while before deciding on this one. Biggest factors: Price, this one came in under my 1k budget, Size, i didn't want anything less than 40\" Pic. Quality, good contrast ratio and 120 hz was a must.This Samsung LN40C630 fit all that. I play a lot of games and love watching movies, this tv does the job well. No problems yet(knock on wood) but i trust samsung(I have two other samsung lcd's after 5 years they work fine). I would strongly recomend this tv to anyone who looking around. Trust me i shopped around deligently for 6 weeks before deciding.", "Date": "May 10, 2011"}, {"Title": "A very nice TV", "Author": "Frank  C \"Frank  C\"", "ReviewID": "R79LK9HTDU48M", "Overall": "5.0", "Content": "I have a Samsung 55\" and just bought a Samsung 40\" LCD TV.At the 40\" level the picture is unbelieveable.It has all the options,but if you have a computer,you probably will never use them anyway.I would recommend these TV's to a friend.", "Date": "May 7, 2011"}, {"Title": "The picture is great.", "Author": "brbdoll", "ReviewID": "R2Q0RJOA5EO6VQ", "Overall": "5.0", "Content": "Got a great deal at Amazon.  The color and picture quality are great for the value. Would make the same choice again.", "Date": "April 25, 2011"}, {"Title": "Excellent", "Author": "D. Geoffrey Webster", "ReviewID": "R4U9OMTC3O9JF", "Overall": "5.0", "Content": "We ordered the TV based on a personal recommendation and a consumer site review.  We have not been disappointed despite high expectations.  It arrived fast, was easy to set up, and the picture quality and features have been excellent.  THere are still a few features we are figuring out, but not for lack of user friendliness.  We highly recommend this product and this vendor.", "Date": "April 20, 2011"}, {"Title": "Great product and buy from Amazon....read below", "Author": "AMAZONFAN", "ReviewID": "R2KVZ84N0OLE0", "Overall": "5.0", "Content": "I purchased my second Samsung from Amazon in 2 years.  The first was a 52 inch and EVERYONE compliments the picture and clarity of the TV.  At the time it was around $3500 and no less a huge risk to buy over the internet.  When the delivery service dropped it off, they waited to have me plug it in and test it before leaving.  It was a great experience.  When it came time to get a second TV, there was no reason to even try another MFG or seller.  I purchased a 40 inch Samsung and they dropped it off when I wasn't available.  It turns out the glass was broke, but AMAZON shipped a replacement within 12 hours....(I opened the box and discovered the problem on Sunday because of being out of town)  The new TV shipped at 7 AM Monday morning.  Amazon and Samsung is a perfect combination.  Samsung is a great product and Amazon knows how take care of their customers IF something goes wrong.  I have never had a problem but this first was handled flawelessly.", "Date": "April 19, 2011"}, {"Title": "Great Buy (consumer reports recommended)", "Author": "calty", "ReviewID": "R2O75LZW9MT6I8", "Overall": "5.0", "Content": "For the price this TV is excellent.  Paid $650(Amazon) and couldn't be happier.  Samsung makes great TVs, from plasmas (though not as good as Panasonic)to high and low end HD models and the picture on all of them is excellent (family owns a few).  With 1080p and 120Hz this TV is ahead of the curve (especially since no channels are broadcast in 1080p...yet, blue ray and netflix movies are which is why I got this model...don't use the 120Hz unless watching basketball games which I watch a lot of, I use the clear setting, don't need it for baseball).  Two complaints: one is that channels that aren't broadcast in HD really don't look that good, so basically I only watch stations that are broadcast in HD and those look great.  Other problem is the sound going from shows to commercials, however every TV I've owned over the last 15 years have had this problem, HD or not.  Don't use any of the features so can't comment on them.  Try not to pay any attention to the way people say this TV should be set up, looks great right out of the box.  Only changed few things, the backlight setting, lowered it to get deeper blacks.  Set Dynamic contrast to medium, set tint slightly to the green end G57/R43, people faces were slightly pink/reddish and set Edge Enhancement to on.Plain and simple this TV is worth every penny, most importantly HD channels look great.", "Date": "April 16, 2011"}, {"Title": "Issues with Over the air channels", "Author": "Bharathi Selvaraj \"Bharathi\"", "ReviewID": "RWCPKUO8X0QNT", "Overall": "3.0", "Content": "Based on my usage, before I returned the product for a refundPros:1) Picture quality was really good2) Played movies and songs from connected external hard disk through USB3) Shared programs through wired network worked fine.4) Sound is reasonably ok.Cons:I tried with three different indoor antennas, but \"over the air channels didn't work well\". I had to return the TV and I got a replacement.  Still the replaced TV had the same issue.When I ran the auto program, it memorized the channels properly and HD channel reception in particular was very clear.  However, when I kept changing channels and once it detected a weak channel, it corrupted every other channel (nothing appeared).  Also, it slowed down the main menu while changing different options.  I think most people use cable at home and never noticed this issue.  So far I could find only one reviewer at bestbuy.com mentioned this issue.Samsung customer care was not good enough to resolve this issue.  They sent a technician who replaced the TV tuner and still couldn't resolve it.  However, I am extremely happy with the way amazon handled this issue and I hope to get my refund soon", "Date": "April 7, 2011"}, {"Title": "Wonderful Artwork", "Author": "B. Yun \"None\"", "ReviewID": "R2XVSP12YMLX17", "Overall": "5.0", "Content": "I bought this 40 inch samsung LCD TV from Amazon.com last week. Up to this moment, I am happy with this guy.It is easy to install, nice quality of picture and easy streaming from my PC.I have no problem to watch some BR grade movie files in my PC using streaming via PC share manager.If the life of back light last longer, I'd be very happy.It is a nice deal.", "Date": "April 5, 2011"}, {"Title": "Better than my Sharp Aquos", "Author": "diyguy", "ReviewID": "R1X6QYJ75S0C48", "Overall": "5.0", "Content": "Simply fantastic.  Once you select the option for 120Hz (fast motion), you will be amazed.  I'm thinking about getting another one for the master bedroom.  It is definitely worth the money. No complaints so far.  The picture is so sharp and clear.  All I can say is Wow, way to go Samsung. Don't stop making this model.", "Date": "March 26, 2011"}, {"Title": "Sound suggestion", "Author": "Dennis3D", "ReviewID": "R5V7NW9T1HHB7", "Overall": "5.0", "Content": "I really love this TV's picture. It's a great purchase and Amazon has been a good partner. The one thing about the TV that needs to be enhanced is the sound. I've read a lot of posts regarding the improvement of sound for HD TV's. I was mainly looking at soundbar reviews. From Samsung to Sony. There wasn't a simple solution, each product had one little or major concern. From glitches to too much bulky equipment.I already have a great radio with rich sound. The Cambridge Works I765. I was wondering if it were possible to hook this up to my TV. After a little research I purchased a 6 ft audio cable (3.5mm male to 3.5 male). I plugged one end into the TV's audio out and the other end into the radio's Aux. Bingo! Great sound for all programs, whether they be Roku, Blue Ray, or regular TV.I can have the TV's sound and the radio's sound on together. I have the radio's sound set at 10 and the TV's at 22. The blend is perfect. The radio does a great job clearing up muddy dialogue and the bass is terrific. It's not surround sound but it was a simple solution with very satisfying results.Thus if you already have a radio with great sound, try this out and save yourself a few hundred dollars.", "Date": "March 20, 2011"}, {"Title": "LCD Love", "Author": "KB", "ReviewID": "R2UFJJILIU77NZ", "Overall": "4.0", "Content": "I did about 3 months of research before purchasing this tv.  Lots of great reviews and features to this tv.  I am very pleased with the picture quality.  It is crystal clear.  I am having some issues with the sound quality; am thinking about purchasing a sound bar?  I read all the amazon reviews in hopes of finding a solution to some issues with motion.  Lots of comments about turning the Auto Motion Plus feature Off; which i have already done.  The motion problem only appears on certain shows that have a lot of back and forth panning with the camera.  One reviewer suggested switching to the sport mode or gaming mode when necessary.Overall, i am very happy with the tv.  There is so many ways to make adjustments to suit your every need.  The 40\" size is perfect for our family room.  We watched a DVD the other night and it was the clearest picture i have ever seen.Great price, great tv; sit back and enjoy!", "Date": "March 18, 2011"}, {"Title": "Great TV at a great price", "Author": "Jack B.", "ReviewID": "R104UEG8881IBO", "Overall": "5.0", "Content": "This TV provides a nice picture straight out of the box, but I would recommend taking some time to adjust the picture settings. After a little bit of tweaking this TV will look amazing. A quick Google search will give you plenty of recommended settings and you can find which one works best for you. Do not hesitate to buy this TV, you won't be disappointed.", "Date": "March 14, 2011"}, {"Title": "Nice set if you don't need apps", "Author": "DDudek", "ReviewID": "R54BI8RUDVS08", "Overall": "4.0", "Content": "This TV is a great choice for people who do not need internet applications (Netflix, Amazon VOD, Pandora, etc).  The picture quality and sound are great and the sleek profile fits in most rooms.  I have been using the TV for 3 months now and have no complaints.", "Date": "March 9, 2011"}, {"Title": "Samsung Review", "Author": "KitKat10", "ReviewID": "R3IHATC20GYZWF", "Overall": "5.0", "Content": "Moved into new apartment, needed a new TV.  After tons of research, all signs pointed to Samsung.  This really is the best brand out there for the value, definitely recommended.", "Date": "March 7, 2011"}, {"Title": "Good but not perfect", "Author": "Sam", "ReviewID": "R2PIL7CDNAIRV3", "Overall": "4.0", "Content": "The set up was beyond easy.  You just turn it on and unless you need special setups because of things I do not understand, I used the basic defaults.  The actual apperaance of the tv is amazing.  It is beautiful and really looks great in a living room--not at all clunky and really looks modern.  The video quality is beyond good.  It is amazing.  Just two problems which may not even have to do with the tv.  When using my Apple Tv on the TV the sound will turn off for about 5 second sat a time at random.  It is incredibly frustrating after a while.  Problem 2 when turning on the tv it can take up to 5 second for the tv to turn on and sometimes you think it hasn't turned on so you accidentally press it again.  This sounds like a small issue but after a while sitting for 5 second to wait and see if you first try had worked can be really annoying!", "Date": "March 5, 2011"}, {"Title": "Great purchase!", "Author": "Ann Marie", "ReviewID": "R6KBVSB6WNIJG", "Overall": "4.0", "Content": "I took my time researching this purchase and am very pleased with itsperformance. The difference in picture quality from prior set is amazing.There is a slight volume issue on HD channels it is lower and has to be increasedthen it is too high when you switch channels. Small price to pay but it wouldbe ideal if Samsung could rectify.I would definitely buy from them again.", "Date": "March 2, 2011"}, {"Title": "Great TV for price", "Author": "Reviewer_123", "ReviewID": "R1P57BQ2MLM24T", "Overall": "5.0", "Content": "Didnt know what to expect when I ordered this TV but when the PS3 is plugged in with games or Blu-Ray movies it looks great.Killzone 3 looks fantastic on this TV in case anyone is wondering.Pros: Great Price, Awesome Quality, Sound is better than you would think.Cons: Only con is the fact that non-HD cable looks a little grainy but with the correct settings adjustments it looks better.", "Date": "February 22, 2011"}, {"Title": "Easy to use - Great quality", "Author": "Peter", "ReviewID": "R3P7YNG4OW38QE", "Overall": "5.0", "Content": "Since I have gotten it, I have not been disappointed. It came in the box that you would buy it in the store and normally I am hesitant when shipping big items like it. UPS took very good care of it and you have to sign for it in order to get the TV.So, after signing for it, I opened up the box. Found the base and it was easy to set up. Make sure you have to persons handy because you will need it in order for the TV not to smash on the ground. I plugged every cable in the right spot, turned it on and the picture was great. The menu is easy to navigate through and after changing some of the settings for my likings, got it to work. I realized my cable was not in HD and it clearly made a difference. After calling and upgrading, the 120HZ was amazing and did its job.Make sure when you buy a blu-ray player that the output will be 120HZYou will not regret this item!", "Date": "February 20, 2011"}, {"Title": "Samsung 40\" TV nicely made", "Author": "tkdgal", "ReviewID": "R3QVO29PV671MS", "Overall": "4.0", "Content": "I wanted a good quality HDTV that was easy to use and had PC capability but on a budget.  The picture quality is outstanding. It also works wonderfully well hooking up the Mac and using it as a huge screen to oversee the kids activities on it.  With WI-FI to the mac - we can access anything over the internet without paying the price for a \"internet ready HDTV\".  Huge savings... Only draw backs - took a while to figure out the remote and some programming. Haven't yet hooked it up through the stereo system and the sound quality (particularly the volume control) is not ideal.  Some of that is the broadcaster's responsibility - but for some channels - have to turn the volume all most all the way up to normally hear.  Sometimes there's been a strange occasionally click or snap in the sound but again only with certain channels. Also,love all the extra output options so that I don't have to keep changing everyting between the various consoles the kids add to it.", "Date": "February 13, 2011"}, {"Title": "We're quite pleased with it.", "Author": "jerseyboy", "ReviewID": "R3R7NA73PDX1YW", "Overall": "5.0", "Content": "The TV produces an outstanding picture. It's hooked up to a Samsung BD-6900 Blu-ray which is wi-fi enabled. The combo streams nicely from Netflix.Setup is a bit clunky and counter-intuitive, but this can be said of every manufacturer.I'd advise turning off the BD-Wise communication feature.As far as setttings, every room is different. Play with them.", "Date": "February 5, 2011"}, {"Title": "Beautiful picture", "Author": "M. Writtle \"MurrayW\"", "ReviewID": "R2QB92NIZC9EM4", "Overall": "5.0", "Content": "This looks great and gives a crisp colourful picture for a great price. Very happy. Have only used with output from a PC and from a standard DVD player. The output from the DVD player was a revelation after a CRT TV. It eliminates a layer of abstraction and gives a very strong sense of \"being there\".", "Date": "February 3, 2011"}, {"Title": "can i change", "Author": "can i change", "ReviewID": "R2NCT03JP4690", "Overall": "5.0", "Content": "hi i am from australia and i would like to buy this tv but i am worried that i cannot charge the power cord so it will fit australian plugs is there some way of doing this all is it just the hdmi cable that needs to be changed so my question is can i change the cord without buying a adapter to a australian plug and will this tv work in australia the same", "Date": "February 3, 2011"}, {"Title": "Fantastic color", "Author": "pyrofan", "ReviewID": "R3I2RH7TWWZ22K", "Overall": "5.0", "Content": "This is the nicest color tv I have owned...have own Sony, JVC, Sharp actually just about every brand made.The Samsung LN40C630 was purchased to replace a 32\" Sony LCD. It was supposed to be used as a seconded viewed TV but right now we watch it more than our 50\" Sony LCD. A lot probably has to do with the 120 Hz refresh rate and the 1080p versus the 60Hz and 720p on the Sony. Very Pleased.", "Date": "February 2, 2011"}, {"Title": "Very Good Product Thus Far", "Author": "Amanda Bazan", "ReviewID": "R3H1XEGCS20U3N", "Overall": "4.0", "Content": "Well, I've had the TV for about a month now and I have been very pleased. I did a good deal of research before making this purchase. It was between this TV and the comprable Sony model. With the Sony, I felt like I'd be paying a little bit more for the name. I did get a chance to see the TV in person at best buy before I made the purchase online (which was important to me). I don't have a lot of experience with HD...but I am VERY happy with product.The picture: The quality is excellent. I have DirectTV and the HD channels are beautiful.The setup: very simple - 4 HDMI ports made the setup easy. Out of the box, I was watching TV and BluRays in 15 minutes.The Sound: Good not great. I don't have a very big living room, so it works very well for me. But if you have a stereo system this doesn't matterThe appearance: Pretty sleek looking TV. Not as thin as some of the high end models, but At this price point, it's as good looking of a set as I found.Features: I'm not one to use the TV to get online...so this doesn't matter nearly as much to me. I've got Wii that I use to stream Netflix and the picture is very nice. 4 HDMI ports (I'm only using two - DirectTV and bluray). The bluray looks fantastic.Overall: definetly a very nice TV, particularly for the price! There are certainly TVs with more bells and whistles; but if you're looking for a very good picture and very good price, this is an excellent choice.The one thing I can't comment on is the durability...I've only owned it a month, but if this changes I'll update the review.", "Date": "February 1, 2011"}, {"Title": "Fully satisfy", "Author": "Gek \"Gek\"", "ReviewID": "R3QJFDMPOITU7R", "Overall": "4.0", "Content": "I like the TV I bought, had received some return as lowest price was guaranteed. Expect the further price decreased on Samsung to get new 55\" TV, because loved the quality of the new one.", "Date": "January 31, 2011"}, {"Title": "Samsung LN40C630", "Author": "djarcher", "ReviewID": "R12ZX4W7K2MC49", "Overall": "5.0", "Content": "I was very pleased with the quick delivery. Exterior of box was perfect( no holes) and delivery person was very curtious. Unit was in perfect condition and was setup and working within 60 minutes. Picture is excellent and my son ( who this was purchased for) could not be happier. For the price I don't think you could find a better unit, and expect it will provide great service for several years.", "Date": "January 29, 2011"}, {"Title": "Great TV.", "Author": "Raymond", "ReviewID": "R186TT4P10FBHA", "Overall": "5.0", "Content": "I'll let all the self-appointed electronic technology experts and critics give all the finer details of performance and visual quality.  All I can say is my new Samsung 40\" HDTV is the best I have ever seen and satisfies my long desire for great high definition TV watching.", "Date": "January 20, 2011"}, {"Title": "Is this TV worth the price?", "Author": "vaporcat", "ReviewID": "REKAZI4V2WKJ5", "Overall": "4.0", "Content": "This is an awsome televison. I was not sure if I wanted to spend this much money but after reading reviews decided this was the one for me. When I got it installed and saw the picture quality I knew I had made the right decision. This is worth every penny!", "Date": "January 19, 2011"}, {"Title": "Great Picture", "Author": "Michael West", "ReviewID": "R2DPPGMWFG5CWY", "Overall": "5.0", "Content": "and price to match.  I bought this TV from Amazon for $649.00 and I am glad I did since the next lowest seems to be  around $800.00 and Amazon doesn't seem to have anymore in stock.  Great picture and easy to set up.  The sound quality is good.  Lots of features for the price.  I have hooked it up to my FIOS via HDMI cable.", "Date": "January 14, 2011"}, {"Title": "Great Purchase", "Author": "dlp", "ReviewID": "R2RUT26NVXWFGD", "Overall": "5.0", "Content": "I was looking for a new television for our basement family room where I could watch sports and other shows while my wife watches our tv on the main level.  I wish I could switch them now as I feel that this picture is far superior to one we regularly use.  I am very pleased with it and considering the price that just makes it that much better.", "Date": "January 10, 2011"}, {"Title": "Great TV", "Author": "Assassin715", "ReviewID": "RIZTUJ7QF33ZM", "Overall": "5.0", "Content": "I love this TV it is by far the best picture quality I have seen. It has a very bright picture which you can dim if necessary. The screen is matted but not enough to get rid of the glare from the window that is behind me when I watch the TV. It is beautiful and is a great price for the quality. the only thing I found insufficient was the the speakers. The sound quality is pretty bad but you could get use to. I have a home theater so it does not bother me. You can also turn the TV speakers off so it only plays though the home theater only. There is also a ethernet port so you can update the software. There is Picture in Picture but it only works with cable, so no HDMI and component (if you are using HDTV cable box from Comcast with component it does not work). There is Media Play but it does not work with an iPod and there is no apps. I did have a Samsung before and the speakers were better but the picture is truly much better on this model.", "Date": "January 6, 2011"}, {"Title": "Great TV, great price", "Author": "R. Jarreau", "ReviewID": "RQIEAO21053V6", "Overall": "5.0", "Content": "I got this TV as a graduation gift in May last year. I am nothing more than completely satisfied with my choice. There is not better TV in this price range. This TV is an all around great TV, but I use it mostly for gaming. The only downside to this TV to me is that from a distance, the remote is a little laggy, and the features and settings are not very newb-friendly, and I only recommended changing the settings if you are experienced. Aside from that, crystal clear picture, great sound, sleek design, the whole package. You will not regret buying this TV.", "Date": "January 2, 2011"}, {"Title": "Samsung LN40C630 HDTV", "Author": "Uncle Lars", "ReviewID": "R1G7BLRPWF2PGN", "Overall": "5.0", "Content": "I bought this HDTV as a Christmas gift for my daughter and son-in-law. After some difficulty in setting it up (because of the cable company) they couldn't be more pleased with this LCD HDTV. They love it in every respect.", "Date": "January 1, 2011"}, {"Title": "We love it!", "Author": "Bernard I. Birnbaum \"Buzz\"", "ReviewID": "R1UVZZ6ECOR4UR", "Overall": "5.0", "Content": "We have waited to upgrade to a quality flat screen tv and this Samsung 40\" LCD was really worh waiting for. It,s a quality and price winner and coupled with our existing sound system, it's truly a joy. Looks great and performs great. We are thrilled.", "Date": "December 31, 2010"}, {"Title": "Great purchaSe", "Author": "happytvman", "ReviewID": "R29LGC55PETK2E", "Overall": "5.0", "Content": "I ordered this tv on black friday and have loved every minute of it. The 120hz is perfect for watching basketball and football games, I don't ever want to go without it now. You can't go wrong with a samsung this its the best tv for the price/features.The only thing I've encountered was a couple times I have turned the tv on and there was no sounds coming out of the speakers the only solution was to turn the tv off and on again. This has only happened twice. Another problem was the motorola comcast cable box will have problems after watching tv for a while. After researching the issue I found out its because it uses infrared waves to connect the tv control to the box and the lcd screen gives off infrared waves that, after a while, begin to interfere  with the control, so I had to move the box from under the tv to the side where the signal doesn't have to cross the televisions path.", "Date": "December 30, 2010"}, {"Title": "Picture is awesome, range is only average", "Author": "Brian_F", "ReviewID": "R31UYIVQJ435C8", "Overall": "4.0", "Content": "My last LCD TV was from 5 yrs ago, and when shopping for it I couldn't tell the difference between brands/models/resolution. Except the cheap-o generic ones like Soyo and Vizio looked slightly worse.  I got a sale-priced, low-end Sony that my Aunt recently bought (she insisted) for a reasonable price and an old compact stereo system.Anyway this time I really could tell the difference. This TV has an excellent picture.  I compared it with Sony, Panasonic, Toshiba, and Sharp at various retail stores. The Samsung was near the top overall, and the price was lower.  120 Hz really makes a difference for sports, etc., and the processing from broadcast signal (I live near the city), looks much less pixelated than I was used to.The only 'problem' was that while the old Sony got all the stations using a paper clip in the coax-in (seriously), for this one I had to get commercial rabbit ears and UHF loop.  Besides the $20 I had to spend on the antenna, this has a great picture and good sound for the money.  Also the remote is fairly intuitive.Amazon had a lower price than the stores, with shipping included.For LCD, my advice is at least to check out Samsung.", "Date": "December 29, 2010"}, {"Title": "Satisfied", "Author": "Geezy", "ReviewID": "R1BEW2Q0DP7QCP", "Overall": "4.0", "Content": "I am satisfied with this purchase. The price was right. Amazon shipped it immediately. The only thing I have noticed is that we seem to be changing the volume setting often(commercials,etc.)  That is a control feature I wish it had. Other than that, I like it.", "Date": "December 29, 2010"}, {"Title": "Great TV", "Author": "MNOutdoors74", "ReviewID": "R372P8LD22C3IM", "Overall": "5.0", "Content": "I've had this TV for 4 months now.  I love it.  The picture quality is great, the features are great, and I have not had any issues at all with it.  Highly recommended.", "Date": "December 10, 2010"}, {"Title": "Very good TV", "Author": "Adam", "ReviewID": "R2QEATUQA74YT1", "Overall": "5.0", "Content": "Great picture and plenty of options to fine tune for your viewing needs. It has very decent sound. No extra speaker needed for my needs. Got the best price at Amazon and the delivery time beat their estimate.", "Date": "October 28, 2010"}, {"Title": "Initial reaction:  WOW", "Author": "S. Weaver", "ReviewID": "R22LVG74G73UI2", "Overall": "5.0", "Content": "Basically, the deal is this:  this tv is super sweet - the video quality is incredible.  I have a Samsung 32\" LCD with a 60 MHz refresh rate, and the letters that swoop by at the bottom ticker on CNN/ESPN/FAUX News noticeably \"ghost\", leaving a little white afterimage.  This tv?  Barely, if at all, so the 120 MHz makes a differenct folks.The Auto Motion Plus - this setting does indeed make movies and shows look weird, like soap operas (just trust me) - but, my dear sports fans, when you have the game on it is awesome, just awesome.  (Wish the remote had a shortcut to cycle the AutoMotion Plus options!)Sound - good, and quite loud - I can only go up to about about volume 18 before it is too loud.  In my bedroom, I will not be needing a sound system, so I'm glad the sound is good enough out of the box.Looks and setup - no problems, it was trivial for one person.  The glass base and stand is an elegant touch.Remote - backlit keys, and thoughtfully ergonomic - too bad it won't control my Comcast box.Summary - the only lingering question is durability.  Rest assured that any problems I have will be dutifully reported here in this space.", "Date": "September 30, 2010"}, {"Title": "Great TV", "Author": "Charles Blythe", "ReviewID": "R35MPX7ZXYEHOF", "Overall": "5.0", "Content": "We use this TV in our master bedroom. The color is great and the swivel base lets view it from the bed or from the sittng room for maximum comfort. The price was the best part of this purchase.", "Date": "September 29, 2010"}, {"Title": "EXCELENT PRODUCT FOR PRICE", "Author": "vinmaur", "ReviewID": "RJVPDD2FOGVZF", "Overall": "5.0", "Content": "I Purchased this tv samsung LN-40-c630 on 07/06/10 & recieved it by 07/10/10 with very profcient delevery. The delevery people wanted to help with set-up but i declined. I had my cousin help me. IM 53 so i could set it up on my own. The tv has a outstanding picture for my nessesities. I have a X-box 360 & asamsung BD-5500 blu-ray player hooked up with Hdmi cables.I also connected a Samsung Hw-c-450 surround sound bar with wireless subwoffer.Excellent combnation for less than $1200.00 i got a reletivly cheap home theater system for pennies on the dollar. THANK YOU AMAZON for a great product", "Date": "September 18, 2010"}, {"Title": "So far, so good", "Author": "JacTrac", "ReviewID": "R1P42XAXZ9DQXN", "Overall": "5.0", "Content": "I already have a Samsung LN52A630 with an excellent picture but has some issues with the sound going out. I have to turn it off, then turn it back on to reset it. This TV has no issues. This product has an excellent HD picture and normal TV is very good also. Rather have the speakers somewhere else other than on the bottom of the TV. Glad I got it!", "Date": "September 17, 2010"}, {"Title": "Great TV for the Price", "Author": "David L. Ayersman \"deck farmer\"", "ReviewID": "R3MERRUWOWT3KD", "Overall": "5.0", "Content": "I've had mine for about 3 weeks and I am still totally impressed by everything about it. I use it in a back room where a 40\" TV is quite impressive. I agree that in a larger room you probably want 46\" or larger. I wish it had a headphone jack, but that is my only small quibble. I would still be thrilled if I had paid quite a bit more for it. By the way, the 2 year old 46\" LN46B610 model in the front room has been been just as impressive. I have had no problems whatsoever with it or I wouldn't have bought this one. No quality issues here.", "Date": "September 16, 2010"}, {"Title": "exceeding my expectation...well worth the money...", "Author": "A Texan", "ReviewID": "R2LVD1UMIFF6JY", "Overall": "5.0", "Content": "Exceeding my expectation both sound and quality.  Well worth the money.  When it comes to electronic products like a LCD-TV; in my experience, don't save a few dollars for something less and will be regreted later.", "Date": "September 13, 2010"}, {"Title": "A good buy", "Author": "James Hobson", "ReviewID": "RQDARF88CQLYA", "Overall": "5.0", "Content": "Have only had this flat screen for a week but for the price, it is fantastic. Picture quality far exceeded expectations. Very easy to set up. So far, can't say a bad thing about it. Works well, very attractive and definitely recommend it to anyone looking to buy a new tv.", "Date": "September 9, 2010"}, {"Title": "Samsung LNC40C630", "Author": "Richard Raleigh Miller", "ReviewID": "R3V83UAG2W8UID", "Overall": "4.0", "Content": "Great picture, great price from Amazon and delivery was right on time as well. Sound is great. I have not check out the Ethernet or wireless capabilities yet, but all else is great. I have already gotten compliments on the picture and resolution, even those who have 40\" Samsungs, but not this model.When I try out everything I will truly know what I got, but I don't explect any trouble since I have another 24\" Samsung in my computer room and it works great as well with everything working on it.", "Date": "September 7, 2010"}, {"Title": "OMG...My Family and me are in LOVE!", "Author": "MrsMas4Eva \"PsWife\"", "ReviewID": "R33T91BNQMDD9G", "Overall": "5.0", "Content": "We purchased this TV on Tuesday and since then my husband, kid and me have been stuck in our bedroom watching TV. This is not our first HDTV but it sure is our best! The picture and sound quality is unbelievable. My husband connected his PS3 to it and couldn't believe the difference; we previously had it connected to our livingroom TV which is a 52\" JVC-DLP. There are other features this TV had except I haven't used it yet but it looks exciting. Maybe this weekend I will get to really know my new", "Date": "August 19, 2010"}, {"Title": "THIS IS A GREAT TV!", "Author": "SJD", "ReviewID": "R15NI3851THZFM", "Overall": "5.0", "Content": "I was in the market for a bigger HD than I already had but was not wanting to spend over $1000.  I do not play games, etc. but watch lots of sports and movies basically.  I narrowed it down to the Samsung and two other brands.My final decison was made after seeing the TVs live in a store and realizing that I could get the Samsung fromAmazon and not pay tax.  Plus the shipping was FREE!  The delivery was scheduled for between 3-7pm.  He arrivedpromptly at 3:00.  He brought the TV into the house and placed it in the room where I requested.  It was easyto assemble.  The manual said it was a two person job but I did it myself (I'm a 50 year old woman). The set upwas easy and accessible, especially if you have done it before.  I was not prepared for the excellent picturequality, color saturation, and actually good quality sound without even a surround sound system.  I am so pleasedwith this TV.  I haven't read the entire manual yet so I am looking forward to other applications that I haven'teducated myself about yet.  I am also really pleased that I saved myself some money - Amazon is the way to goand I LOVE THIS TV!  I can hardly wait for football season!", "Date": "August 7, 2010"}, {"Title": "HDTV as it should be.", "Author": "Dana49", "ReviewID": "R15URIFTWFIA2Y", "Overall": "5.0", "Content": "I read the reviews, researched several HDTV sizes and models, and eventually purchased the Samsung LN40C630 40-inch 1080 p 120hz HDTV (black).  Why?  For the price and quality you will not find a better HDTV on the market.  There's a reason that Samsung is a leading name in high definition televisions.  The color, the sound, and the clarity make it a total viewing experience.  High definition television has never looked so good.", "Date": "August 7, 2010"}, {"Title": "Great experience so far!", "Author": "Kingston", "ReviewID": "R3UIWKC5SZLUEE", "Overall": "5.0", "Content": "I'm not a high-end user by any means, but I'm thrilled with this TV and the Amazon purchase (at a great price!) Out of the box it works fine for me, and I'm not even using it on HD. But again, I'm not very demanding, don't do \"home theater\", etc., just wanted a decent TV for general purpose viewing to replace an ancient dying CRT TV. For my modest needs, I could have bought other brands for less money, but I believe in buying great brands with good reputations even if I don't need their best stuff, and this model seemed a great balance of features, price and quality.I was amazed that Amazon's free super saver shipping included delivery AND setup, and all within about 3 days of purchase. You can't beat that from any local big box store.So, very pleased with purchase so far - time will tell, but Samsung has a good reputation in that regard.", "Date": "August 3, 2010"}, {"Title": "Awesome!", "Author": "Bill \"bmega\"", "ReviewID": "R3588OT6ODVBHZ", "Overall": "5.0", "Content": "I moved to this TV from a Toshiba 37\" LCD that I bought about 18 months ago.  The picture on this Samsung is so crisp it almost appears 3D at times.  I'm still tweaking the settings, but I am very happy with the purchase.  The only down side I can see is that the viewing angle is fairly narrow for the best picture.  Otherwise it's great.  Very satisfied.", "Date": "August 2, 2010"}, {"Title": "Samsung and Amazon can't be beat!!", "Author": "StereoGen", "ReviewID": "RYZF8TGNBK32T", "Overall": "4.0", "Content": "I was looking to upgrade to a 40\" LCD with quality picture, decent onboard sound, surround sound and internet/wifi capability and she wants easy on/off with remote volume control and with those requirements I did my research. My search ended at Amazon for the LN40C630 with the lowest price, free shipping and very good reviews. The LCD TV arrived safe and on the schedule date. Removing the Samsung LCD TV from the box and set up was a breeze. The hardest part was removing my old 38\" cathode tube tv that weigh well over 80 lbs.This Samsung TV is beautiful and classy looking and was definetely wife approval with all the necessary features for her and myself.  My first week of use with this Samsung tv was fairly good with a little blurring during fast actions and without the HD signal. The following week I had upgraded to the HD signal and here is where the LCD TV performed to what its designed to do. The color, detailing and action is top notch! I used recommended setting that a amazon reviewer poster had listed with a couple of my own changes. I found that all LCD have a little blurring during fast action even at 4 ms respond time, but the more you use the tv the more the blurring smooth out. The one itch I have is only when using the Directv remote, you have to press the on button twice to get the Samsung TV to turn on and repeatly press the volume to increase the sound. After 30 days of use, I really enjoy viewing with my Samsung LCD tv that I have decided to protect with investment with a 3 year warranty from Amazon as well. My ratings are conservative and I want to thank the good guys at Amazon for another happy purchase!!", "Date": "July 31, 2010"}, {"Title": "Good TV", "Author": "D. Downing \"Hexamerous\"", "ReviewID": "R3IBSU4JGU5X23", "Overall": "5.0", "Content": "I am very happy with my Samsung TV.  I like the ALLSHARE feature although when playing music files I have noticed not all file types are supported  - the MP3 files play fine.  This TV also has PIP which is great if you have a need for that or just want it.  The 24p is supported by this TV on playing blu ray discs.", "Date": "July 30, 2010"}, {"Title": "Outstanding TV", "Author": "Fuzzy Thurston", "ReviewID": "RQXYZCRX9DRBQ", "Overall": "5.0", "Content": "This is a truly outstanding TV.  The picture is incredibly life-like.  I have had the tv for a month now and there have been no problems with the setup or anything else.  I also have a 50\" Samsung plasma, one year old now, and it too is incredible.  The LCD weighs only 33 or 37 pounds -- just so easy to move around.  I was going to buy a slightly smaller screen but the price differentials between the 40\" and even a comparable 32\" were pretty small.", "Date": "July 29, 2010"}, {"Title": "Great TV, shipping info misleading", "Author": "fhmrs", "ReviewID": "RPIJSAP99C44C", "Overall": "5.0", "Content": "The television is great!  Although the delivery person didn't seem to know it was supposed to be white glove delivery, he did open it up, set it up on the stand and turn it on.  When ordering the tv however, Amazon misleads you to think you can get it in five days, when in fact that costs extra, and it took two weeks for it arrive.  So beware when ordering.  Overall though the television is great and the price couldn't be beat.", "Date": "July 26, 2010"}, {"Title": "nice and easy", "Author": "dgpena", "ReviewID": "R3L8HUZNGRB6HT", "Overall": "5.0", "Content": "Very nice and easy to set up and handle. No complains about this TV set. This is the best 40\" HDTV you can get at this price.", "Date": "July 26, 2010"}, {"Title": "Samsung LN40C630 40 is Excellent", "Author": "Kalyan", "ReviewID": "RYA7R2H3JW13I", "Overall": "5.0", "Content": "This TV is awesome. The setup was very easy. The picture quality and sound is excellent. The delivery was done by Pilot. They were excellent. They waited till I came back to my apartment, setup the TV and made sure that it was switched on before they left. AVOID the shipment from crutchfield. I had ordered LCD last month which was delivered broken, the screen completely shattered. I returned it and got this one.", "Date": "July 24, 2010"}, {"Title": "Double your pleasure, double your fun", "Author": "Leon A. Purta \"joemaamah\"", "ReviewID": "RA5ASJDW1XCJJ", "Overall": "5.0", "Content": "I owned a 40\" 60hz Samsung for the last few years, but decided to upgrade to 120hz when Amazon put them on special pricing this spring. I had high expectations due to my great experience with the 60hz model, but I have to say the performance of this year's model met and exceeded all my expectations. In fact I was so impressed, that I went out and bought another for my Dad for Father's day/his birthday. What does that tell ya? Believe me, you can't go wrong buying this TV at Amazon's price. The closest competitor was still $100 more than what I paid for mine, then they dropped the price another $35 when I got my dad's. If you are sitting on the fence about buying and LCD TV, now's the time to make the jump and get this now!", "Date": "July 22, 2010"}, {"Title": "Great Television!", "Author": "RJ's Mom", "ReviewID": "R383UH2ICTRGSA", "Overall": "5.0", "Content": "We've had this about 3 weeks now and we love it!  I decided on this model because of the recommendations of friends who also own Samsung and did all of the research.  We've been quite happy and we think the picture is outstanding!  Ordering from Amazon saved us delivery charges as well as tax.  The delivery was great...the man unpacked the box, set up the tv, and tested the picture and audio before he left!  Great experience, all in all!", "Date": "July 20, 2010"}, {"Title": "Excellent Item - Samsung LN40C630 40-Inch 1080p 120 Hz LCD HDTV", "Author": "jcconde", "ReviewID": "RGJ7BQK08QYLD", "Overall": "5.0", "Content": "This is an excellent TV. Picture quality and sound are terrific; i really like it.I would recommneded.", "Date": "July 20, 2010"}, {"Title": "Good for the money", "Author": "Funkytrojan", "ReviewID": "R1XBX5GXOES8BF", "Overall": "5.0", "Content": "Great bargain I love it replaced a 36 inch picture tube tv that was well over 100 lbs.  Came very quickly from amazon.", "Date": "July 20, 2010"}, {"Title": "Love this Samsung!", "Author": "Wiz", "ReviewID": "R18I3UD7V3482M", "Overall": "5.0", "Content": "We were so pleased with the quick and safe delivery from Amazon.com. Our Samsung 630 arrived in perfect condition.The picture quality and features are great. The sound quality is acceptable but could be improved.Overall the Samsung is a great product.", "Date": "July 18, 2010"}, {"Title": "Fantastic TV", "Author": "Glenn \"Glenn\"", "ReviewID": "R1VRXY0TA8OXWB", "Overall": "5.0", "Content": "I have a 55\" Samsung LED which is fantastic. This TV's picture is stunning also.I have never gone wrong with Samsung and Amazon.Delivery was quick and easy.", "Date": "July 15, 2010"}, {"Title": "Great TV for price", "Author": "Tammy Clark", "ReviewID": "R23F3TC18EYNGB", "Overall": "5.0", "Content": "This TV has a very sharp clear picture. Shipping was very fast. Set up was very easy.  Picture is as good as the more expensive models. Overall for the price, this TV is a great value!", "Date": "July 14, 2010"}, {"Title": "Great HDTV", "Author": "Douglas E Ford", "ReviewID": "R14R287FMONEXF", "Overall": "5.0", "Content": "I just received my Samsung HD-TV this morning and it is wonderful. The set-up was really easy from attaching the stand to the on-screen menu's The picture quality is great and the sound quality is better than I expected. The price is great and if you get the free shipping as I did then it is a really great deal.", "Date": "July 8, 2010"}, {"Title": "Great!", "Author": "Eric Davis \"Emoney\"", "ReviewID": "R31L72OAWIWOLL", "Overall": "4.0", "Content": "I upgraded from a CRT 1080i HDTV to this TV.  I was doing the upgrade for a safety issue (Massive cords sticking out of the TV and no console could hold the TV, isn't great for little kids)... I really wasn't thinking it would be that much of a difference going from one HDTV to another.  I was very wrong.  This is a fantastic TV that made regular DVDs look like HD DVD.  The Set-up was super easy.  The only knocks are the sound and the preset brightness levels.  The sound can't seem to level out the difference components of a movie or TV show.  For example:  The voice of the actor of the movie is the same level as the background noise, making it very difficult to hear the actor.  We have the benefit of having a receiver with a 5.1 speaker set-up, so this problem doesn't bother me, but it would if I didn't have this.  Second, the dynamic picture setting tends to be too bright but he movie is too dark.  So, it depends what I'm watching as to what I place the settings on.  Overall, I love this TV and the price is excellent.  I didn't know what I was missing in a picture till I bought this.", "Date": "July 6, 2010"}, {"Title": "The Best TV for the basic understanding and price.", "Author": "Jared Renshaw", "ReviewID": "RFNXMA83A88OZ", "Overall": "5.0", "Content": "HI everyone,Here is a great site that explains the auto motion plus on the Samsung TV, in addition what each mode means. Here is the link:[...]I don't know what KS's Review is talking about the picture not being great out of the box, mine looked amazing. However, KS is 100% right about the auto motion plus on clear mode. If you play a lot of games like me, i have a PS3, either have the auto motion plus on Clear or off, otherwise there is a lag in the gaming or weird look that we are all not use to, unless you watch soap operas, LOL. I have to agree with KS i only have positives about this TV. However, i wish the touch buttons on the front of the TV lit up or if they were a different color besides dark gray. It is impossible to see them, but that is why you have a remote controller :P. If you are thinking about buying this TV, DO IT, i swear you will not regret it.", "Date": "July 5, 2010"}, {"Title": "Loved everything I've seen so far", "Author": "A. Fry", "ReviewID": "R2SGANY7YWJOTS", "Overall": "5.0", "Content": "This is my first HD/LCD TV so keep that in mind as you read this review.  Given my limited experience with these TV for my money the picture quality is excellent.  The sound is better than I expected.  It's as close to surround sound as you could ever hope for from a non-surround system.  The TV is a great value.", "Date": "July 5, 2010"}, {"Title": "Works flawlessly", "Author": "distance runner", "ReviewID": "R2TPKT6RDOSVRS", "Overall": "4.0", "Content": "Shipping was arranged promptly and smoothly; set-up was easy on my own (although it took me a while to figure out that I had to loosen the screws a bit in the stand to allow the screen to swivel); and programming was fine using the manual. I put this down in our playroom so the kids would be willing to have thier friends down there and give us some space.  Although I am only an occasional TV and movie watcher, it is so enjoyable now to view programming in true high definition. I highly recommend this model if the specs meet your requirements. After spending many hours over a number of months researching various possibilities for my first HDTV, I zeroed in on this Samsung model, which fit all of my criteria and had received numerous excellent reviews. After two months, I am very pleased and completely satisfied with this TV's performance.", "Date": "July 5, 2010"}, {"Title": "Samsung are awesome", "Author": "Donald Wengerter \"Wengy\"", "ReviewID": "R3Q3BIUNKN3OV6", "Overall": "5.0", "Content": "As usual Samsung 600 series is excellent. Sound is getting better but it works for my daughter in her school apartment", "Date": "June 30, 2010"}, {"Title": "samsung is a hit", "Author": "Patti Pitney", "ReviewID": "R24E9KWHKMXV43", "Overall": "5.0", "Content": "I highly recommend this TV to anyone who values high picture quality, very little artifacting (stuttering, shuddering, etc). The bezel attracts a lot of dust, but we have 2 cats, so we probably have more hair/dust flying around than most people. Very nice TV for the price. I use my laptop with an hdmi connection to run the TV. Everything looks great and works well. The sound quality is definitely above-par for a TV, but ofcourse can't really compare to proper sound system. Lots of options and settings to tweak in the menus, which can be a little overwhelming, but I really appreciate them. Has a network connection (wired, or optional wireless), but it is only for media sharing capabilities, this TV does not support streaming Netflix. This was a bit of a disappointment for me, because I read a review where they said it does support outside movie rentals. Oh well, aside from that, I think it is a good buy", "Date": "June 14, 2010"}, {"Title": "Very happy with this TV", "Author": "J. Bailey", "ReviewID": "R2RD8FY7DK41ZN", "Overall": "5.0", "Content": "I've had it for 2 weeks and not a problem. It looks great and has everything I wanted. The price is a little higher then I wanted to spend but it was well worth it.", "Date": "June 14, 2010"}, {"Title": "2010 Samsung 40\" 1080P LCD  LN40C630", "Author": "marc", "ReviewID": "R2CJKOC6ZE0JY3", "Overall": "5.0", "Content": "The TV set was delivered within the time frame I specified. Delivery person was courteous. Now getting to the TV. I read the Amazon reviews on the 2009 models for the TV's in this series and was impressed by what they wrote. I went to a local store and checked out the TV there and compared it to the other major brands. I could not see any difference between this set and more expensive ones.After unpacking the set I  attached  the smoked glass base by myself though Samsung recommends 2 people. The set swivels which is a nice touch when you might want to sit off center. I did not have to make any adjustments to the picture, it was perfect (in my eyes) right off the bat. Flesh tones were perfect. The sound is good, it's not tinny, has a fullness to it. This is a good buy for the money. So far I've been very pleased with this purchase.", "Date": "May 23, 2010"}, {"Title": "Amazing TV for the price!!", "Author": "lessthanjake032", "ReviewID": "R2F09EV06MAHI3", "Overall": "5.0", "Content": "While looking to upgrade from my 720p 60hz 42\" Samsung Plasma TV, I did some research and came up with this as my final choice.  I waited a few days while it was $809 and it went on sale for $744 and free shipping.  Can't ask for more than that.  Received the television in perfect shape - box unharmed.  The guys even take out the television for you so you can make sure there is no damage.  I was a little skeptical about ordering a TV online, but there was no problem at all in the process.  Highly recommended!!", "Date": "May 22, 2010"}, {"Title": "Very Pleased", "Author": "B. Duffy", "ReviewID": "RXGIOKRP1KAN2", "Overall": "5.0", "Content": "After much research, we decided on this model and are extremely satisfied with our choice. The price was also the best around which helped clinch the deal.  The picture is so amazing it sometimes feels like the people are live in our room!  We purchased this for a Master Bedroom...and the 40 inch size was the best choice.Also, the service from Amazon was excellent from beginning to end.  I was initially concerned with how it would be delivered but it was extremely professional and accommodating.  I would highly recommend purchasing this TV and using Amazon for any big electronic expenditure.", "Date": "May 20, 2010"}, {"Title": "A Great TV", "Author": "B \"B\"", "ReviewID": "R2LZQFIT2L4XBW", "Overall": "5.0", "Content": "I thoroughly enjoy this tv. This is the 3rd Samsung in the house and so far every one of them has performed exceptionally well. I gave the sound quality 4 stars because I hook it up to my own sound system, so I don't really ever use the tv's speakers. This tv is really only used to play Xbox 360 and DVD's and you feel like you are in the action. I have compared this to other tvs my friends have such as vizio and panasonic, and I would choose this tv 100 times over. Definitely a good purchase.", "Date": "May 20, 2010"}, {"Title": "Good Value Great TV", "Author": "Kain \"Kain\"", "ReviewID": "R2CIQ5SIX0YR4U", "Overall": "5.0", "Content": "I've had my television for a few days now and while watching I decided i needed to hop on the computer and write this review. The picture is stunning with some minor tweaking although it looked pretty decent right out of the box.All the product specs were accurate and delivery by pilot was on time and professional. I wanted a nice television for the bedroom and this is perfect but if you care at all about the sound quality you should definitely get a sound system. I paired my TV with the Sony HTCT100 Sound Bar with Subwoofer - Black since i didn't need anything crazy for the bedroom I have my XBOX 360 hooked up and my tv. Nice feature of the Sony soundbar by the way is that the sub it comes with has multiple audio inputs so you don't need a receiver. I also got the Walker Edison Regal 42-inch 4-in-1 TV Stand with Mount which holds this TV perfectly if you're looking to have the TV mounted but don't want to bolt it to the wall it also has up down and left right swivel. The total setup cost me less than 1300 bucks and I couldn't be happier. Plus since i have Amazon Prime everything was shipped to me for free! This review seems like more of an advertisement but I promise if you're looking for something classy looking for the bedroom this is a sweet setup! Since I've plugged everything else i just bought I might as well mention if you're getting this in the bedroom i also picked up a couple of Brentwood Brushed Twill Bedrest, Navy for more comfortable bed watching and they are comfortable and cheap! THANK YOU AMAZON!", "Date": "May 8, 2010"}, {"Title": "Samsung LCD a good choice", "Author": "B. Moselle", "ReviewID": "R36XKYZQA55ESH", "Overall": "4.0", "Content": "I've had this Samsung LCD TV for about 4 weeks now, and I'm very happy with the purchase. There are a lot of settings, and different viewing situations (DVDs, live sports, regular TV programming) require a lot of settings adjustments to maximize picture quality. But fortunately, the settings are easy to change.I patiently waited and reviewed LCD TVs for about a year before finally settling on this one. For the amount I spent ($750), I couldn't be happier.", "Date": "May 7, 2010"}, {"Title": "Incredible value for the price point", "Author": "Mark Johnson \"Johnson\"", "ReviewID": "R1A6UR51B5N3SE", "Overall": "5.0", "Content": "Being our second LCD 1080p television I always thought our Sharp Aquos from 3 or 4 years ago was the best television for blu-ray I've seen.  But this Samsung takes it to a whole new level in terms of performance for the price.  1080p output is outstanding and the television is housed in a beautiful black shell which is pretty thin for the size.Would recommend this to anyone looking to get into the 40 inch market under $1000.  I bought this one from Amazon for 740 bucks.  Great price, shipping was a tad slow but I was in no rush, worth the savings compared to $900 at Best Buy.  Ceva did a nice job and carried the television into the house where I wanted it too!One of the best sub $1000 1080p televisions I've seen hands down.", "Date": "May 4, 2010"}, {"Title": "Very nice", "Author": "Buckaroo", "ReviewID": "R3D30C6OTVF6CK", "Overall": "5.0", "Content": "I'd buy it again.I will buy it again, since this one went to my Daughter.Even un-tweaked it is beautiful.When I get a chance to optimize the settings, I'm sure it will be even better.", "Date": "May 4, 2010"}, {"Title": "Fantastic TV at a super low price!", "Author": "Herbert E. Taylor \"World Traveler1\"", "ReviewID": "R3HHMU9HC67975", "Overall": "4.0", "Content": "We had a really nice 42 inch Vizio TV with 240hz.  However, one feature I wanted was the ability to watch netflix on the tv directly.  The latest model of that TV just came out with wifi connectivity and netflix as an widget.  However, I just could NOT get myself to pay almost $848 for that tv, which is the cheapest price that I found.  So I waited, then I waited some more, then I waited some more.  In my mind, a 40 to 42 inch 120hz tv should cost more than $600.  Well the waiting paid off.  Samsung's new LN40C630 recently came out with a price that dipped into the high $700's.  No it didn't have internet connectivity, but I found with the first tv that I could just hook the computer up to it and solve that issue. Better yet, a salesman suggested I get a blue ray player (Samsung) that had that feature.  Today after reviewing Amazon, [...], [...] and more, I went on a hunt.  Found the Samsung at an incredible 'in store' price of $619 at my local electronic shop. No prices on the web come close at all.  The store that I brought it from has a national website and on their own website the TV is $809.  That is a $180 saving which was enough to get the blue ray player!As the other reviewers have said this set is absolutely amazing and with the blue ray player I now also have the netflix access that I wanted, without my bulky computer sitting next to the TV.  Operating the tv was very intuitive, because I have a 24 inch Samsung tv with the exact same setup.  It is strong in pulling in all of the digital channels (more than 105) on my cable without that crazy set top box.  I'm very pleased.  Samsung rock!", "Date": "April 30, 2010"}, {"Title": "Love Samsung", "Author": "Beth T. Tippett", "ReviewID": "R10E3RV1H71FKT", "Overall": "5.0", "Content": "I love this TV.  We have had a great experience with not only the TV, but the price, shipping, delivery . . . everything.", "Date": "April 22, 2010"}, {"Title": "BEST TV EVER", "Author": "Mike Smyth \"letsgolakeshow\"", "ReviewID": "R26E5N803IPF3G", "Overall": "5.0", "Content": "Like any consumer I researched tons of HD tvs and was set on a 40 or 46\". I chose the Samsung LNC630 and it is the best purchase I have ever made. The picture is absolutely spectacular....so clean and clear with HDMI. I have an upconverting dvd player and 300 looked RIDICULOUS. The sound is great too, which I did not expect. Samsung has really made a top of the line tv and the 120 hz is the best way to go :)", "Date": "April 20, 2010"}, {"Title": "so pleased with purchase", "Author": "SanDiegoGal", "ReviewID": "R2XTCK9MXPXUU1", "Overall": "5.0", "Content": "This is the 2nd Samsung HD tv we have purchased in the last couple of years.  The picture quality, especially in HD, is like being in the movies.  Set up is a breeze with plug in and go format.  Our space limited the size of the screen, but we are extremely pleased with the purchase.  My husband is hard of hearing and, although, we have tv connected to dvd player, the audio from the tv is more than adequate, even without using the amplification feature.  Amazon's price and delivery service was great.", "Date": "April 19, 2010"}, {"Title": "First HD TV", "Author": "Ricardo Clemente", "ReviewID": "R30WPLY7KDYBZ1", "Overall": "5.0", "Content": "I've been shopping around and looking for a TV for my room. This 40\" HD TV works great! It's not too small and not too big. It was a huge upgrade from my 10 year old TV so everything seems to be awesome. I got this for $770 along with a PS3 with FF13. AMAZING! I can't find anything bad about this except for how long it took to ship.", "Date": "April 14, 2010"}, {"Title": "Amazon=Good.  Jury is in Samsung is Good!", "Author": "J.M. Boyle", "ReviewID": "R1SXK9W3L5FXWH", "Overall": "4.0", "Content": "I got this TV w/free delivery. It came quicker than I expected so kudos to Amazon.  I will be updating this review as things unfold because I want to be fair.  This is the first TV I've had in over 15 years so I'm no expert on TVs, but I am pretty tech savvy. Right out of the box I had a problem. The instructions said to assemble the stand first, so I did.  Then when I tried to set the TV on the stand the screw holes would not line up.  Long story short, they shipped it with the wrong part.  I called Samsung and the first service rep told me the part was on nationwide back order and wouldn't even guess how long it would take to ship.  When I get a red flag like that I usually rethink my purchase; I mean it seems clear to me that they deliberately shipped it with the wrong part.  So I thought about it awhile and called back, this time the rep said the part was not on back order and should ship in 7-10 days.  One of them has to be wrong.  I ordered the correct guide stand.  I managed to get temporary use of another mount in order to make sure the thing actually worked.  So I set it up and turned it on and installed theSamsung  WIS09ABGN LinkStick Wireless LAN Adapter (purchased separately).  After some time I got it to link to my home network, but with an error message saying there was a problem with my service provider, Bellsouth. I called BS and they wanted $29 for an \"Advanced Technical Support Issue.\"  I declined. I haven't got a dvd player yet and I don't have cable so I don't really know if the thing works or not.  I'll be contacting Samsung for help with the Wifi.  I'll let you know how that goes.Update 12/19/2012.  No problems at all so far. This has been a long time coming but I got the stand issue taken care of at no additional cost. Kudos to Samsung. Bought a Samsung Blu-Ray DVD player and with wireless LAN adapter the DVD player found my home network easily and has not really hiccupped since.  The picture is great, especially with Blu-Ray discs or streaming HD from my Mac. (I also got an HDMI cable so I now have a 40\" monitor)  Some old tv shows when streamed look grainy, but that is not the fault of the TV.  I had thought I'd buy external speakers but really I don't see the need. Sound quality is excellent and I sit a good 10 feet away and never turn the volume up over 50%.I still don't have cable, or even an antenna so I can't comment on how it works with that. But Netflix, Vudu, BBC News and You tube all work great over my wireless.", "Date": "August 24, 2010"}, {"Title": "nice tv but has problems", "Author": "wanted a good tv", "ReviewID": "RSB8XKU681EV0", "Overall": "4.0", "Content": "It is a nice tv.  However, it has a few pinpoint defects in the screen where it appears there are no pixels and clear light shines through.  I would never expect that from this calibur of tv especially at the price.  To return it is going to be a complete hassle and involve time without a tv...and it will need to be set up all over again...", "Date": "September 14, 2010"}, {"Title": "Nice while it lasted. But 15 months? Really?", "Author": "BearguyVA", "ReviewID": "R3FSLUDG2U0IYQ", "Overall": "1.0", "Content": "I finally caved in and bought an HDTV after my old Toshiba 32\" bit the dust. The rest of my family all love their Samsung TV's, so that's what I bought. I liked the picture quality, although I find it very annoying that using the HDMI inputs disables closed captioning.After 15 months, it started acting like it was posessed. It would change channels, change the volume, try to reset the picture, on and on. I thought maybe the remote had a problem, so I took the batteries out of it and went to bed (figuring I'd go get new batteries the next day.) The TV turned itself on in the middle of the night! So I know it's not the remote that's causing the problem.My local TV repair says that the main circuit board is shot (bad capacitors, apparently a common Samsung problem) and that it will be almost $300 to repair. In a TV that's barely over a year old? Really?And I wholeheartedly agree with other reviewers who have said that Samsung's so-called \"customer service\" is a joke. Non-existent is more like it.A TV that requires this kind of major repair after barely a year, and Samsung's total lack of customer service, is completely unacceptable. Needless to say, I (and the rest of my family) will NOT be buying Samsung again.", "Date": "November 5, 2011"}, {"Title": "SAMSUNG entertainment centre", "Author": "Murtuza Hashim \"hashimm4\"", "ReviewID": "R1LJY6VIKGG0U9", "Overall": "5.0", "Content": "I received my tv within four days of purchasing it from AMAZON. So far I am enjoying it very much. It has 4 HDMI inputs and 2 USB inputs. I connected my apple TV and am currently watching movies through my Netflix account on the TV. On the down side the TV does not come with a wireless LAN adapter. That is required if you want to stream directly through the TV instead of a device. I am streaming through my Apple TV so that was not required by me.  The picture quality is crisp. It has three picture modes Dynamic, Normal and Movie. The movie mode is meant to be watched in dark rooms to have less strain on your eys by dimming the backlight. The Dynamic mode is meant more for day time. My first movie I watched on it was TRON. and it was a great movie to watch on this TV as it shows all the good qualities about this TV.", "Date": "April 13, 2011"}, {"Title": "Dead pixel", "Author": "SSG", "ReviewID": "R20UJU25TFMB1V", "Overall": "2.0", "Content": "Tv was great for the first 4 hours then one of the pixels went out on the buttom right hand side of this tv. i was so disappointed because this was my second tv from samsung and the first one i bought was the 60Hz but i had sound issues. the sound would have audio dropage and clipping was very bad because you could not enjoy a movie without the voices dropping out.", "Date": "March 2, 2011"}, {"Title": "Lots of ghosting", "Author": "Robhuns", "ReviewID": "R1GRGM05FGRLJR", "Overall": "3.0", "Content": "I bought this because I'd seen a store display and next to a plasma of approximately the same price, the picture actually looked a lot clearer, and the glare was much less.  I bought it for both watching sports and blu-rays.  I'll say that watching football is pretty nice.  Football is set up where normally the camera isn't panning much, or at least the player you are looking at stays in the same position on the screen, and this TV works pretty well for that.  And a freeze frame looks great.On blu-rays it's a different story.  I don't know if it's because blu-rays (and all movies) are shot at 24 frames/second so maybe the 120 HZ doesn't help, but on blu-rays, there is an awful amount of ghosting any time the camera pans.  It gets so bad that it actually occasionally makes me a little sick to my stomach.  It honestly makes me think that it might be better to watch movies on my low def CRT I used to have.  I've never had another LCD to compare it to, but if you are getting an HDTV to watch blu-rays on, you really need to get a much more expensive one that doesn't have the ghosting issues (if there is one) or go plasma maybe.  Or just save your money and stick with your CRT.", "Date": "February 2, 2011"}, {"Title": "3rd and final C630 worked", "Author": "Alan I.", "ReviewID": "R1QNC0CMB5VFUK", "Overall": "4.0", "Content": "I studied online for two weeks before making my purchase.  I picked the C630 as my first flat screen TV because it was a middle of the line model with features I wanted.  My first TV arrived DOA with no video, but audio.  A call to Samsung for repair meant downtime for two weeks as parts shipped from NJ to CA.  After my frustration, I contacted Amazon for a return.  My second TV arrived overnight, but also DOA with no video, but audio.  After another round of phone calls to Samsung, I made the decision to ship back to Amazon and not wait another two weeks for repair.  Amazon accepted both DOA TV's with no questions asked, paid for shipping, and credited my payment card as expected.  I ended up buying my 3rd C630 from my local Best Buy for the same sale price (not the same take home price) and the TV has worked from moment one.  I would recommend a working Samsung C630 to friends and family.", "Date": "January 2, 2011"}, {"Title": "Satisfied with Samsung LN40C630 40-Inch 1080p 120 Hz LCD HDTV", "Author": "Youhcup", "ReviewID": "R1TS7WP4CL3K0T", "Overall": "4.0", "Content": "I am satisfied with my purchase of the Samsung LN40C630 40-Inch 1080p 120 Hz LCD HDTV.  This is an upgrade of the Samsung LCD 32-Inch TV that I had.  Good picture quality, DLNA connection, and a 3mm external jack at the back.  I can connect my earphone with a breeze but your phones must have its own volume control as it couldn't be controlled by using the external jack.", "Date": "December 4, 2010"}, {"Title": "Good TV, Internet Function is Useless Though", "Author": "Adam M", "ReviewID": "RPTHWOG6DNUFB", "Overall": "4.0", "Content": "I don't know why this TV has internet capability.  You can only use it for home network stuff, which you could easily do anyways with a normal TV and a laptop.  I didn't pay enough attention to the specs, and just remembered seeing another reviewer say he uses it for Netflix streaming.  But I'm guessing that is because he uses the TV as a monitor, and the Netflix streaming is simply through his computer (dude, you should mention that instead of giving people the wrong impression.)That said, it's a good TV.  Picture is great.  Just looked at a few DVDs of mine on my Oppo upscaler, they look really good.  The motion enhancement/blur reduction is nice too, although it can make movies look kind of like soap operas.  I had to turn it off while watching LOTR, but it made Finding Nemo quite nice.  Probably better for animated stuff, and live TV.For the price, it's an excellent TV.  I just wish they made it clear that this TV will never be used for anything on the web, rather than blur the issue by mentioning the fact that you can wirelessly connect to it, who cares?", "Date": "December 2, 2010"}, {"Title": "Beware the Samsung Flicker!", "Author": "a reader in Calif", "ReviewID": "R2R0LQW35IYA87", "Overall": "1.0", "Content": "You can benefit from my experience. Before purchasing, google \"Samsung flicker\" or \"Samsung capacitors\" (in each case, without the quotes). There is a lot of information on the Internet indicating that Samsung's off-shore manufacturers have used faulty capacitors in their unit power supply--apparently this problem affects both Samsung TV's and monitors. When this happens, you will not notice anything wrong at first, as it takes the capacitors time to fail (google \"capacitor plague\") but when they start failing you will experience flickering and dimness at first and can expect this to get worse over time and for the unit to finally completely fail.If you are lucky, you will have problems while the unit is still under warranty. However, the replacement unit you receive may have the same problems, and when it fails will almost certainly be out of warranty.My experience: Samsung replaced my unit on warranty, but the replacement unit they sent me failed (with the issues described) shortly afterwards and was \"out of warranty.\" While I didn't expect much I did call Samsung customer service to see if they had any program to address this. They do not. Once the warranty is over, you're on your own. At the price they quoted it really isn't worth fixing it, so it looks like I'm stuck with a very expensive paperweight. May you make better decisions and have better luck in your purchase!", "Date": "February 15, 2011"}, {"Title": "short life tv", "Author": "James Alumkal", "ReviewID": "RW9PUSZGQKD5B", "Overall": "1.0", "Content": "life of the tv is : 2 yrs and 10 months[power board problem]to repair you need to pay $350.Never buy !!", "Date": "October 2, 2013"}, {"Title": "HDMI ports died one by one", "Author": "J. Knight", "ReviewID": "R3UXJM818QW15N", "Overall": "2.0", "Content": "Switched cables and different devices. Last working HDMI connection needs to be jiggled to work. If you google Samsung HDMI there are others complaining as well.", "Date": "July 4, 2013"}, {"Title": "don't get 120hz, get the 60hz", "Author": "Mr. A", "ReviewID": "R1U0BJN5SOTAJA", "Overall": "2.0", "Content": "unless all you watch is sports, don't get the 120hz.  save yourself the money and get the 60hz version.  otherwise you'll be watching everything like a mexican soap opera.yes, you can just turn the \"smoothness\" off, but then you're just running at 60hz anyhow.this is not a dig on samsung, i got the 60hz version and it's absolutely great. this is an example of how upgrades just aren't always better.", "Date": "June 21, 2011"}, {"Title": "Excellent value for the price", "Author": "mustang65", "ReviewID": "R28QTHEVQUB9GM", "Overall": "5.0", "Content": "Arrived with free shipping in 2 days. Easy set up out of the box. Picture and sound quality is outstanding. I upgraded from a 34\" CRT HDTV.", "Date": "March 27, 2011"}, {"Title": "Good tv just misses the mark", "Author": "D. Kelly", "ReviewID": "R3DNSR1138S55B", "Overall": "3.0", "Content": "First I should say I am a Samsung fan I have owned a 32\" series 5 since they were first introduced. In comparison this set has more contrast, color control and runs at 120hz verses the 60hz of my series 5. These along with a much better back lit remote and a sleek glass front and other features like pip give this set a clear advantage over the series 5.Now to the trouble I have had. I have been viewing over the air broadcasts and when the signal is weak the tv freezes. The screen goes blank and all functions freeze. I can't change channels or switch to blue ray or pc. I have to manually shut off the tv and reboot it like a virus ridden pc. I have emailed Samsung about this issue and have yet to get a response. Frankly I am very suprised I have never had a day of trouble with my old set.The only other issue I have had is with the color. There are a lot of options for tweaking the color and it took me almost a week to find the right mix for the color orange. I watch a lot of football so I know when the color of any jerzy is off and found it a very frustating and slow process to get it right. My series five was much simpler and had better color right out of the box.If i did not use this set for pc and PS3 I would have opted for a plasma for about the same price I could have gotten a 50\" set, but I have friends that own plasmas and there are still burn in issues with even the latest models. Don't beleive the manufacturers or the sales reps.Overall a good set if I could get the freezing problem fixed I would give this set a four star rating.Pros:Good contast and 120hz makes football much smoother than 60hzNice intuitive backlit remoteSmart design that allow control of my Denon receiver through the tv so I can hide my receiverPip so I can keep an eye on the halftime show as I type this reviewBetter over the air tuner than my series 5 I pull in several more channelsCons:The aforementioned freezing issuePoor color out of the box with involved tweaking neededSome pixelation noticable in dark shadowsBottom line this is a good set for the six hundred I paid for it but if I didn't have the pc and PS3 hooked up I may have been better of with a comperably priced plasma that runs at 600hz.", "Date": "December 26, 2010"}, {"Title": "Sound", "Author": "Diana Smith", "ReviewID": "R3IKV0PQ2VXP9F", "Overall": "4.0", "Content": "Always takes a few seconds for TV to turn on and then a few more seconds for sound to come in.", "Date": "December 24, 2010"}, {"Title": "Excellent TV For The Living Room", "Author": "Kivanc Muslu", "ReviewID": "R2Y6KJOVIEMDQ5", "Overall": "5.0", "Content": "If you live in an apartment like me (a one with a small living room), then this TV will be looking great in your living room. Its design is very good and the delivery was perfect. I had a scheduled delivery from Pilot and they even bring the TV inside the house and tested it!PROs:- Many HDMI Outputs (it has 3)- 2 USB outputs- Ability to Play media from USB- Excellent Sound and Video- Elegant Design- 3.5mm headphone Output (I didn't think this was so important)CONs:- 120 Hz: Though I don't believe you can have 240 Hz even close to this price range, however it would be better.- Inability to record the playing into q USB disc or USB flash disc.- Inability to control the volume of the external speaker (e.g., headphones). This way you are left to a fix amount of volume if your headphone does not have a volume controller on it.", "Date": "September 17, 2010"}, {"Title": "Fabulous for home", "Author": "D. Mccauley \"Techie\"", "ReviewID": "R1IWYJPWZUYGCP", "Overall": "5.0", "Content": "Fabulous hdtv to own. Such HD quality I had not seen before. A worthy investment for home.", "Date": "September 10, 2010"}, {"Title": "Awesome TV", "Author": "It's Me", "ReviewID": "RJ0YMBS3ILUWD", "Overall": "5.0", "Content": "This is a great TV. It has great picture quality for the price. You'll love it!", "Date": "August 27, 2010"}, {"Title": "very nice TV", "Author": "Geneva", "ReviewID": "R2CQ84ADE5UPH4", "Overall": "4.0", "Content": "After a disastrous attempt to purchase a TV from another online company, I bought this Samsung TV from Amazon.  They said it would arrive on August 13 and it did.  Well, I got the call from Ceva to schedule the delivery on August 13.  They delivered it the next day - a Saturday.Set up was easy - I just needed a friend to help lift it.  It's a slick beautiful TV.  I'm happy with it.", "Date": "August 19, 2010"}, {"Title": "outstanding", "Author": "Cris", "ReviewID": "R30F07HV5ORQ84", "Overall": "5.0", "Content": "got it from amazon tax free, with free shipping for 709. great deal. looked all over for the same tv and all the other sites were more expensive. works fine, looks clear and has nice features.", "Date": "August 17, 2010"}, {"Title": "Samsung", "Author": "mjackwilson", "ReviewID": "R3S2HS1O3PQ5DF", "Overall": "5.0", "Content": "I haven't used this TV much yet, but the  picture is stunning.  I have seen a Sharp with 120hz refresh rate that stalled and jumped.  There is no picture degradation with this TV.  It was a bit smaller than I thought.  My parents have a two year old 530 Samsung, and its picture quality is largely why I went with a Samsung as well.  When I compared them side by side, the 40in I had was a good two inches smaller in diagnol screen size.  Regardless, this does not subtract from the picture quality OR the improved sound quality over previous Samsung models in my opinion.  Perhpas more so than 1080p or HDMI input, 120hz refresh rate is an amazing difference.  Anyone buying a TV would be wise to keep this in mind.  That said, I'm very pleased with the purchase and feel that I got a bargain for $709.  For HDMI cables, I would check out [....], as they have unbeatable bargains on cables.", "Date": "July 1, 2010"}, {"Title": "40 inch Samsung", "Author": "J. Geary", "ReviewID": "R2V6K3IDOKZ1BF", "Overall": "5.0", "Content": "I just have a question. What is lifespan? And why would you put it inwith a list of questions for a new TV?", "Date": "June 24, 2010"}, {"Title": "Amazon Verified Purchase", "Author": "Mary K. Lynch", "ReviewID": "R3NNZK1N47J8VR", "Overall": "4.0", "Content": "I have had the TV for about a month.  It was delivered as promised and set up.  I did not notice at the time of delivery that there is a crack on the case and I don't know who to contact to fix it.  The picture is clear and I receive more channels than I get with comcast because i also receive some HD channels.  I am not a sound expert so I am satisfied, although I have read other reviews that do not like the sound and add their own speakers.  I have not read all the directions but what I want is easily operable.", "Date": "June 7, 2010"}, {"Title": "Meets expectations", "Author": "B. Wallace", "ReviewID": "R35P6CV8AMQ2G1", "Overall": "4.0", "Content": "Purchased this TV for the bedroom based on price, size and another's review.  It meets all our needs as a second TV.  HD channels are the best.  Since not all our channels are available in HD, we're not getting the full effect the TV is capable of producing.  Videos are great.  Like how the controls light up at night.", "Date": "April 25, 2010"}, {"Title": "Great picture", "Author": "R. Mone", "ReviewID": "R376APS0ZRHS7E", "Overall": "5.0", "Content": "The price was the best I could find anywhere around.  Great picture,, very happy all around.", "Date": "April 14, 2010"}, {"Title": "C. Thomas", "Author": "C. Thomas", "ReviewID": "R9IOZHIMD11OP", "Overall": "5.0", "Content": "This TV has great picture quality and a great price.  You get a lot for your money.  It was delivered earlier than we expected and we are extremely happy with it.", "Date": "April 13, 2010"}, {"Title": "schicker", "Author": "Larry Schick", "ReviewID": "R2IO5L4Q1OIY5E", "Overall": "2.0", "Content": "I bought this set from Amazon after doing a fair amount of research.  It was highly rated by CNET.com, a leading consumer magazine and the Amazon reviews.  I also viewed it in a store.  The only poor reviews on Amazon dealt with reliability issues. When it arrived I also found that it produced an awesome picture either on a blue ray or DVD via HDMI connector.  It even seemed like the picture had a 3-D quality to it.  Unfortunately I have to watch it on a standard connection (NTSC).  In this situation the blacks seemed to run together with no definition.  You would see a man in a suit and not be able to pick out any detail in the suit.  I tried various adjustments and could not significantly improve this.  I then put in next to a old 40 inch Sony V series with the same inputs.  Their were even greens that were being projected as black.  On the Sony, the black details were clearly visible.  In Summary:  With HDMI or component digital input, awesome picture.  It you have to view it via a HTSC cable input, the blacks may drive you to distraction due to their lack of definition.  I finally returned it to Amazon.  Amazon was great about this!", "Date": "December 3, 2010"}, {"Title": "A word of warning for this Samsung 40\" TV", "Author": "Christopher J. Hammond \"christoc\"", "ReviewID": "R32AOI6HGOLSG", "Overall": "2.0", "Content": "A month ago I moved, and because of that decided that it was time to get a new TV for the bedroom, rather than moving the old CRT across the country. So I picked up a Samsung 40\" LCD TV that did 1080p and 120mhz, the model was LN40C630K1F and it was purchased from Best Buy. All seemed well at first, the TV performed great, until I noticed something, a blue pixel on the screen, when it shouldn't be blue. So after about a week (of the bad pixel) the TV went back to Best Buy to get exchanged for another of the same model.I brought this new TV home and hooked it up, everything was great for a few minutes then the TV was attacked by some red vertical lines, which eventually turned to black.I checked connections, restarted everything, with no change. Eventually the lines went away, but they came back a few times throughout the week.Today I took the TV back to Best Buy and picked up a 40\" Sony LCD. Thanks to Best Buy for the great customer service! They were extremely helpful throughout the whole process. I went ahead and purchased their 4yr protection plan for the new TV, just in case anything goes wrong with this one.", "Date": "May 15, 2010"}, {"Title": "samsung tv", "Author": "Daniel E. Wooden", "ReviewID": "R16A6B457C713E", "Overall": "3.0", "Content": "The picture is good....next time I buy a tv I will make sure to get one with a higher contrast ratio. Over all the tv is good. COD black ops looks good on the tv and blu ray movies look good as well. The only negative is the game mode you have to go to the menu screen and scroll down and choose this option....there should be a button on the remote to change it back and forth.", "Date": "March 30, 2011"}, {"Title": "Product Excellent, Delivery Very Poor", "Author": "William L. Sims", "ReviewID": "RYFC7V2IDHDIY", "Overall": "4.0", "Content": "After waiting approximately 3 weeks to receive my purchase, I have enjoyed the quality of the Samsung 40\" tv.  Price paid was fair, but not a bargain.", "Date": "June 6, 2010"}, {"Title": "This TV is not compatible with the Wii", "Author": "Nandito", "ReviewID": "R10RE8QXLK79VY", "Overall": "3.0", "Content": "This is a perfectly fine TV, but it is simply not compatible with the Nintendo Wii. There is a noticable lag during gameplay. While the TV has a Game Mode feature to address the issue, it only works with game systems connected with an HDMI cable, which the Wii does not have.", "Date": "May 11, 2010"}, {"Title": "motion problems + beware of free shipping option from amazon", "Author": "Joybomb \"Joybomb\"", "ReviewID": "R155CRCSRQL9ZG", "Overall": "3.0", "Content": "Amazon definately had the lowest price around for this tv, I have to give them that.The things I am happy about:the size of the tv is great. The color is also great. Watching anything that is mastered for HD looks great, generally. Sometimes there are motion issues, even in HD mastered material (newer tv shows and movies)(more on this below). Video games look great on it. Reduces the eye strain I was feeling with our smaller set.The things I am unhappy about:I was not home when my television was delivered - a week early with no notifation - and I found it in the hallway of my apartment building. AMAZON SENT IT UPS WITH NO SIGNATURE REQUIRED. The tv was ok, but I was astonished.Perhaps I am a sensitive viewer, but I see alot of motion issues - blur and jitters, when either the color is too intense or the motion is too fast. I must be a very sensitive viewer, since my boyfriend doesnt see this as often as I do, but I have seen people complain in online forums. Also, if you are watching an older tv show or movie (even on dvd, not bluray), 60% of the time it looks like total crap. For instance I caught \"The Notebook\" on cable the first night we had the tv, and it looked like a cheap student film. Think what you want about the actual movie, but I remember that it was beautifully shot. I have played with alot of the settings and have managed to make the tv look ok most of the time.So I guess this is what you get for a $700 120hz 1080p 40 inch tv. I thought I was smart for buying Samsung!", "Date": "February 3, 2011"}, {"Title": "Still getting used to it, but from what I see it's a great TV", "Author": "Martin Podjski \"martin\"", "ReviewID": "RUJQMXTQKWB5M", "Overall": "5.0", "Content": "I'm still trying for a perfect picture setting so right now I'm mostly going off other site review settings, and they all say this is a good quality tv and I can't complain, everything I see would say that too.  (sorry it's not a more in depth review, but I just don't know that much in depth about tv's).", "Date": "November 20, 2010"}, {"Title": "No picture after a month", "Author": "Shahzad Hasan \"Signature Dood\"", "ReviewID": "R1KDWQJCTF7WTT", "Overall": "1.0", "Content": "I had this TV for a month. Now there is sound but no picture and no back light. Samsung TVs have had this problem for a few years. If you google for the problem you will find it. Stay away from Samsung if you can. Now worth the trouble.", "Date": "December 28, 2010"}, {"Title": "Samsung overrated", "Author": "Franklin M. Warren", "ReviewID": "R25T1HFXPKGWS0", "Overall": "3.0", "Content": "The first TV I received was defective and took an extra week and multiple phone calls to get a replacement.I will not buy another expensive item online again because of the hassle.(Amazon.com not at fault)", "Date": "January 5, 2011"}, {"Title": "Unclear set up directions", "Author": "Dissatisfied Customer", "ReviewID": "R1YBA8EF0QXRSL", "Overall": "4.0", "Content": "Directions for set up on the stand are woefully lacking.  I called customer service and they sent a new stand each time I called.  The problem is that no one said that we should remove the plastice panel on the bottom of the TV to slide it on to the stand.Shame on them!", "Date": "October 13, 2010"}, {"Title": "Samsung LCD HDTV good show", "Author": "Kilowatt Kid", "ReviewID": "RFE8A0ONEMLF6", "Overall": "4.0", "Content": "Great TV. Light weight, easy to mount. Picture is sharp. Sound is good, not great. Haven't had it that long to comment on any thing else.", "Date": "September 7, 2010"}, {"Title": "Samsung LCD", "Author": "Dooman", "ReviewID": "RRQMKPUQAHNFK", "Overall": "4.0", "Content": "I purchased this set a few months ago for a much lower price (under $670). At that price I consider it a great deal. It was delivered by CEVA somewhat on-time (they did get the day correct) and it has performed flawlessly since setup. I have encountered none of the problems of other reviewers. After having used the set for some time now and comparing it to my Panasonic plasma which I have owned for 2.5 years, I can definitely comment on the differences. This Samsung looks good, HD over the air especially looks very good. But the image can be somewhat harsh and artificial when compared to the plasma. I have also noticed image stutter on it although I don't consider it a huge issue. I can say after comparison that I prefer the plasma. Apparently I got my Panny just before the rising black level issue took hold, because my set still looks as good as it did on day 1, excellent.I would encourage anyone to look into the possibility of receiving HD over the air using an antenna. I purchased an indoor antenna from Monoprice when I bought the plasma but found after experimenting that on old telescoping antenna from an old TV worked just as well. If you are near the towers you can get very good stable reception and best of all it's FREE!!! Plus the signal is not subjected to another layer of processing and compression from your cable provider, it is coming directly from the station to the tower to you. Go to [...] and follow the instructions for determining your ability to receive HD OTA.Also I mentioned Monoprice. Flat-out the BEST place to buy AV cables, adapters etc... I even purchased a internet router from them, very cheap, works like a champ.", "Date": "September 2, 2010"}, {"Title": "All but dead on arrival...still dead after Samsung repair call", "Author": "Steve_Austin", "ReviewID": "R2UN19X6BCMI1I", "Overall": "1.0", "Content": "Arrived, looked fine, but HDMI ports are all not functional, old fashioned cable input works, but not worth a **** for intended puposeSamsung will send a new main board, service person called, nice but just barey speaks English I could understand.Will wait for repair vs hassle and time of replacement.NOT a good experience!!Waited over a week for service call, he arrived with new main circuit board certain to fix problemNo such luck, he said replacement board was also faulty!!!!!Either  MAJOR Samsung quality control problems or there is a totally different problemIn any case my 1st Samsung tv continues to be a massive mistakeRealty wish I had tried a different brand", "Date": "December 15, 2010"}, {"Title": "Very Good", "Author": "sibrzon \"ssibr\"", "ReviewID": "R1ASFD6ANCS9NL", "Overall": "4.0", "Content": "We've had this monitor for three weeks now, replacing a 36\" Sharp Aquos that was mysteriously damaged (we have a two year old...). Our usage is modest, mostly just for broadcast channels and DVD's.Picture quality is overall at least as good as our previous TV, especially with DVD's . Channels change quickly, and the tuner seems to handle weak signals a bit better. The channel programming information (e.g., what's on next) is more convenient and menu screens and the remote are a bit easier to use too.Some minuses are some \"noise\" when watching fast moving action on broadcast channels, and no S-video input. However, as I mentioned above, video quality hasn't been an issue when playing from our DVD player, which previously used an S-video connection.", "Date": "October 17, 2010"}, {"Title": "TV", "Author": "DC", "ReviewID": "R1SYSRBMMPO54V", "Overall": "5.0", "Content": "Delivery person was helpful.  Instructions were easy to read and follow.  All connections were easily accessed.  Seems great!", "Date": "October 7, 2010"}, {"Title": "Samsung, please stop making tvs!", "Author": "Tanya Delgado \"Tanya\"", "ReviewID": "R11N3BYZ5PPS6U", "Overall": "1.0", "Content": "This is my third Samsung TV. The first one lasted all of 2 years, the second one less than that and the third lasted 3 years. I think it's ridiculous that you pay $1600 every couple years for a new tv because the one you bought is a piece of junk.We also had a Samsung refrigerator that busted one month after the warranty ran out and a microwave that was repaired 2 times before the warranty wore out and then died shortly after.I will be steering clear of their products.Notice how they stop making a certain model of tv after 6 months? It's so that people can't review their products after actually using them for a reasonable amount of time. Of course your tv works for the first few months.I can't even get parts to fix them, they were made to break and be replaced, not repaired.", "Date": "June 7, 2010"}, {"Title": "Buyer Beware", "Author": "john doe", "ReviewID": "R2V0XJB18BLDCQ", "Overall": "1.0", "Content": "Just go ask your local TV repairman. Samsung LCDs have to have their panels replaced more than any other LCD TV. The panel in my Samsung LCD HDTV went bad after only two years and it would cost more to replace that panel than a new TV would cost me. But I am not buying a another Samsung. I would recommend a Sony or LG LCD because the panel is going to last.", "Date": "September 8, 2010"}, {"Title": "Samsung TV", "Author": "nhb", "ReviewID": "R2YLBXUJKFZGTR", "Overall": "1.0", "Content": "First time ordering from Amazon Warehouse Deals.  Bad experience. I would have thought Amazon would have checked out the TV before sending it to me.  Details indicated \"may have cosmetic imperfections on sides or bottom.\"  What I received was a TV that had no picture; only sound.", "Date": "April 21, 2011"}, {"Title": "Samsung sighs", "Author": "Amazon Customer", "ReviewID": "R1T68DGQB13RFL", "Overall": "1.0", "Content": "This TV had a black vertical pixel line from the day I started it up, it never went away so I had to return the unit. Samsung is still rated as one of the best and there were no more of these in stock at Amazon so I now have to go elsewhere. Very disappointing.", "Date": "January 15, 2011"}, {"Title": "Disappointed by the Lack of a Headphone Jack.", "Author": "Miguel C. Rodriguez", "ReviewID": "RUE1VRELGGVBG", "Overall": "3.0", "Content": "I own this item and before I bought it I also had a larger 46-inch Samsung (model number LN46A750) that I am very happy with.  Oddly enough you cannot find this 46-inch version using Amazon's search, but thanks to Google, it was able to find it for me on Amazon's site, so here's the link:http://www.amazon.com/Samsung-LN46A750-46-Inch-1080p-Touch/dp/B0014175OI  The 46-inch version has a \"Headphone Jack\".  I love that I can hook up my Logitech 2.1 speakers to it.  By \"hook up\" I mean when the speakers are plugged into the headphone jack, the crappy internal speaker that faces away in the back cuts off and I can control the volume of my external speakers using the TV remote.  This 40-inch version (a newer model BTW) has a 3.5mm jack in the pastel green color we come to expect; but when I plug it in, the muffled internal speaker stays on and the external speakers stay at a constant volume despite me using the TV's volume remote!  I searched on-line and found this response from Samsung_HD_Tech on a CNet forum:  \"I'm sorry to hear that you're having trouble controlling the volume.The 3.5mm jack is a fixed audio out input, rather than a headphone jack, and isn't controlled by the volume controls on the TV. So the external speakers will require an amp for the volume control.\"  I'm sure for many of you here this means nothing to you because you're either pumping your audio through a proper Home Theater System (HTS) using a second remote or have cranked up the volume to 100 in an effort to discern the muffled dialogue coming out of this TV's internal speakers with everyone around you thinking your hearing aid is on the fritz again.  So, if you're like me and enjoy hooking up a cheap 2.1 sound system to your TV, then definitely pass on this one.  REMEMBER, it is not enough that the TV has a green 3.5mm Audio Out jack - it MUST say \"Headphone Jack\" in the specs and have a little round-shaped icon in the shape of headphones next to it on the TV.  As for the rest of the review of this TV, I can't get past the awful (and I do mean truly awful) sound to enjoy watching any programming on it.  It sits in the garage as a TV for those who lost out in musical chairs.  When we set it up, I noticed it was crooked (welded/glued/fused together) wrong, but it's not noticeable from regular viewing distances.  It tilts down and to the left, like it's turned a few degrees off.  I hear the picture is amazing from the rest of my family (but what else do you expect from a PS3 pumping 1080p to a 40-inch screen).  It is truly a waste of money for the way I want to use it.  I can't even give it away.  If I gave it to my grandma then I'd imagine poor granny trying to watch her tv novelas with the volume all the way up wondering why she can't make out what they're saying.  And I'm not spending 100-200$ on an HTS and teaching my family to juggle another remote.  This is the 3rd Samsung I've bought on Amazon, and everyone who visits the house loves them (they think I'm rich!).  I'll still stick with good ole' Sammy, but it was a costly lesson to learn.", "Date": "November 10, 2010"}, {"Title": "Very frustrated.", "Author": "Scottiepoppins", "ReviewID": "R1KLQPN6U0CBU2", "Overall": "1.0", "Content": "Going off of my experience with this tv I have no choice but to rate it low. I ordered the tv just before the new year, it got to me quicker than I would have ever expected. Unfortunately that's where my good news ended. I kind of blame both amazon and samsung for the issues that followed: I opened my tv like it was gold, making sure every thing was done correctly (not to destroy the contents). Placed the tv on the stand, put the batteries in the remote, and poured a cold drink. When I hit the power button nothing happened, okay lets try the power on the tv... Still nothing. Not to be out witted by my tv I try a different power cable, with no resolve. Okay, lets make the call to support and see what there suggestions a are; \"Thank you for picking samsung, how may I help you\". So long story short they tell me what I already know and tell me to contact amazon, but they will be more than happy to set up a service to come take a look. After searching the internet find a actual phone number for amazon (which was not easy), they stated that because the no longer have the tv in the warehouse that the can give me a refund and I can buy it from a distributer for more money... Ummm, no! Back on the phone trying to contact samsung only to find out that call centers can be effected by snow. It takes three days to get a hold of them, and the repair people can't come for another week. Okay, the repair guy is here, I get to watch tv right? Nope. So what happened is they didn't have the correct part, and that part if going to take a week and a half to come in, so I wait.... I think they forgot about me, its been a week a no update if they found the right part. \"Thank you for picking samsung, how may I help you\"Me: \"they haven't called, they didn't leave a number, oh and the took a part for reference\"Them: \"that's messed up, let me call them\"Me:\"thanks\"Them:\"they should have it, to install next week\"Me: \"okay\"What I didn't mention was I'm moving this weekend, lucky its just out of my parents house (yay for me!) so I didn't have to set anything else up, who knows how long treasury that would take. Today, after a month of waiting, its fixed with a new bezel. I have no idea how well it works because its at my parents place.Samsung: pick better contractors, your better than that. Better QC!Amazon: talk to your suppliers, tell them your customers want better quality controls.Contractors: that was just lame.", "Date": "February 1, 2011"}, {"Title": "Returning it to Amazon", "Author": "P. M. Gross", "ReviewID": "REH6VGU7851SE", "Overall": "3.0", "Content": "We always do a thorough review of big ticket items before purchase, so returning an expensive item is very unusual for us.This set has some good features.  We especially like the sound settings to send the music that frequently drowns out the dialogue to the background where it belongs.  We also like the remote control which is easier to use than most.BUT:We do not have a cable box.  The TV input comes from a direct condo-wide hookup.  It is digital but not HD.Most of the channels are cable channels; a few are local or \"air\" channels.  Some TV's allow the channels to be scrolled seamlessly.  This one divides the channels into two groups and several buttons need to be pressed to move from one to the oher.However, the main problem for us is picture qualtiy.  Not sharp; not clear; not vivid.  Slightly blurry or runny. Average or worse.  We have tried multiple settings including fine tuning on a channel by channel basis but the video is still unsatisfactory.Perhaps this set works best with an HD input but that is not an option for us at this time.We do note that the picture is significantly better when playing material from an attached computer which reinforces the idea that there is some sort of tuner issue or incompatibility.In any event and unfortunately, it is on its way back to Amazon and we are doing more and deeper research before replacing it.", "Date": "August 31, 2010"}, {"Title": "WARNING, AVOID SAMSUNG AT ALL COSTS", "Author": "Andrew", "ReviewID": "R1X6ED7Q10N8RQ", "Overall": "1.0", "Content": "I recently purchased the Samsung LN40C630 model after searching the web for months.  Amazon had the best price so I pulled the trigger. I received the TV very quickly and unpacked the box and started assembling the stand.  After assembling the stand I began to attach the bracket from the stand to the back of the TV. Unfortunately it did not fit and after looking at it closer it was obviously for a different tv. I began looking at the other items in the box a bit closer. It was then I noticed the owner manual, and remote were also for a different TV(5 series, 46 inch tv I later found out). The stand as it turns out was for yet another model. Frustrated I called Amazon and they advised me to contact Samsung which I did. SAMSUNG customer reps were useless and told me that all of the parts in the box (excluding the tv) were incorrectly packaged.... I asked them how could this happen, they of course never heard of this happening ever. Anyways they told me they would send new parts. 2 weeks later, after waiting patiently, the parts arrived and they were for the wrong TV.At this point I was furious so I called AMAZON and after explaining the situation they told me a replacement TV would be sent right away. A few days later I got a 2nd TV, opened the box and lo and behold the same thing, all different parts. I called AMAZON and told them I wanted a refund,(which they promptly did) and they sent someone to picked up the old TV's.Moral of the story save your money, time and energy and don't buy SAMSUNG products. Obviously they have serious quality control issues, customer service problems and other issues. Just google SAMSUNG problems/customer service and you will see I am not alone. Pray that you never have a problem with SAMSUNG products and have to call their customer service number.Best part of the transaction was getting my money back. Hope to buy a Sony or Panasonic soon..", "Date": "June 8, 2010"}, {"Title": "Samsung Quality", "Author": "Frank J. DeFelice", "ReviewID": "RAF0JY7XJ2PVA", "Overall": "5.0", "Content": "Samsung makes terrific products. This LCD TV was very easy to set up. I didn't want to hang it on the wall, so I bought a TV table (see my other reviews). This unit comes with its own stand which is easy to fasten to the back of the TV, and voila! it's good to go. The remote is easy to use, and allows you to select picture size, different zoom levels, various sources, etc. The adaptive contrast ratio is fine, so I can watch movies during the day or evening. It accepts VHS tape inputs as well as digital inputs from a DVD player etc. I ran the sound through my stereo so you need to turn off the TV sound to do that. What I like most is its slim outline, its easy portability. Reliability has been excellent. The resolution is great!", "Date": "October 30, 2010"}, {"Title": "Lucky purchased an extended warranty", "Author": "L. mollring \"svelte9\"", "ReviewID": "R3NGI62S4C64TW", "Overall": "2.0", "Content": "Purchased a LN40A530 1080p 120 in August '08.  Started having problems after original warranty expired.  Lucky I had an extended warranty.  Early 2010 only when manually turning on, sometimes black screen with a magenta colored line at top of screen would appear and stay on until I turned it off.  Then would turn back on, no problem.  As time passed it happened more frequently. It has been in and out of service since April up until now four times.  It has been in the shop since July 23rd.  The extended warranty tv service has replaced at least five parts, tv still has problem.  The tv works fine with the remote control.  Great color and sound.  Easy hook-up.  I am considering getting the Sony Bravia becuase the reviews are better, debating on another extended warranty.  Good luck on your choice!", "Date": "September 24, 2010"}, {"Title": "still looking", "Author": "Paul P. Hrehocik \"needy1\"", "ReviewID": "R36G9F05MEK7CI", "Overall": "3.0", "Content": "I've been using the tv for about ten days now and it works very good. Yesterday though there were patches of medium purple shades on the faces and heads of the people on the news. It seemed to be only on one station though so I'm not sure on what to do yet,but it was there and didn't fade away. I checked today and the picture was fine. I hope things work out fine. When I did change back to the station with the purple shades it eventually cleared up. I hope it works out.", "Date": "June 22, 2010"}, {"Title": "Redeemed themselves", "Author": "Curtis R. Mann \"crm\"", "ReviewID": "R1K3GE5HLR065Y", "Overall": "5.0", "Content": "They pissed me off right off the bat when their initial email said the item was on backorder and it was listed as in stock when I placed the order. Turns out their email was screwed up.An absolutely beautiful set. Setup is for idiots, took about 10 mins to attach the base, plug it in and get a picture. The picture is flawless. Then I read the manual and was thrilled and surprised to find out I could plug in a flash drive and play all my movies, pictures and music from my computer. Waiting on a wireless mouse to hook up my computer to it.", "Date": "October 6, 2010"}, {"Title": "Bad!!!", "Author": "H. Xu", "ReviewID": "R2LEQKY4PDI7V", "Overall": "1.0", "Content": "Guys, search online about \"samsung tv the volume goes automatically to zero\", you will find a long thread of discussion. We had the same problem only 5 months after buying the new Samsung LED tv. The problem misteriously was gone the other day and went back today after a few more months. I don't know if it will go away tomorrow. Really annoying. This issue is not solved by the manufacture according to the discussion yet.  I won't buy any product from Samsung again!", "Date": "October 9, 2010"}, {"Title": "false advertising", "Author": "Gene C. Harrison \"classics collector\"", "ReviewID": "R1H0M3OL95835N", "Overall": "3.0", "Content": "Don't buy this if you think you are purchasing a 120 Hz product. This product is actually a 60 Hz product. False advertising.", "Date": "December 8, 2010"}, {"Title": "Do NOT buy Samsung LCD TV's", "Author": "M. Kim", "ReviewID": "R3AR43SA4F0YSW", "Overall": "1.0", "Content": "google: samsung lcd tv pink dotsI purchased a brand new Samsung LCD TV in Jan 08 and the first year was great with no problems.  After about a year, I started encountering problems with it when I power it on.  I'll get these pink dots all over my screen, requiring me to turn it off, and then turn it back on numerous times.  It usually takes a good 5 minutes for normal picture quality.I've contacted customer service and they offered me NO help saying that it was out of warranty and they were not aware of this problem.  Considering how many people have filed complaints on here, the BBB, and other consumer groups, they should be more helpful with this common problem.Don't get me wrong, the picture quality is great and it would be a great tv if it worked.I'll never buy a Samsung TV again.", "Date": "September 15, 2010"}, {"Title": "Beware - Samsung uses cheap capacitors for power up that fail", "Author": "Mark Evans \"mark e\"", "ReviewID": "RQ7TTIP43S98A", "Overall": "1.0", "Content": "Many people are facing a black screen and TV repair bills as soon as 3 months after purchase due to poorly engineered power on circuits.  These are basically the same failures from 70's to current TVs that use super-cheap capacitors to boot up and commonly fail.  Worst problem is the Samsung customer service who will supposedly have it replaced \"for free\" (the 10 cent part) but only by their one authorized vendor at a substantial $$$ service charge.  Buyer beware.", "Date": "July 8, 2010"}, {"Title": "Samsung 52 inch LCD TV wont turn on", "Author": "jerred", "ReviewID": "R4R2B5IXSYCHK", "Overall": "1.0", "Content": "I have a samsung 52 inch LCD tv that i have had for a little over a year and now it will not turn on, you will hear the power up noise and then it will click off and do it over and over and over again all day long, apparently many other samsung owners have had the same problem and samsung is doing nothing about it..", "Date": "April 14, 2011"}, {"Title": "Amazon: SHIP IT, I HAVE ALREADY PAID THE AMOUNT.", "Author": "L. Khurmi \"LK\"", "ReviewID": "R3MO7XWWZVAIPV", "Overall": "4.0", "Content": "This TV is great and I have seen it at many places now. My issue is with AMAZON not shipping it after a week since I paid. Don't advertise FREE SHIPPING when it takes almost 2 weeks before you get your product. Not happy at all.", "Date": "April 24, 2010"}, {"Title": "Nice picture, but Samsung LCD failed after 15 uses, poor service", "Author": "drift \"drift\"", "ReviewID": "R3OF1KB7BOVBBJ", "Overall": "1.0", "Content": "After minimal use hanging on a wall for 22 months, the Samsung 40 inch LCH 1080p has severe red tinge and is unusable.  Buyer beware;$1150 down the drain. Buy Sony.", "Date": "June 19, 2010"}, {"Title": "DOA", "Author": "J. Clifton", "ReviewID": "R2LRJC4FYRTKYZ", "Overall": "1.0", "Content": "At long last, the tv arrived, only to be refused and immediately sent back out the door. It was DOA.  I'll give it one more chance and see if the replacement is any better.  I'm pretty happy I bought the extended warranty at this point.", "Date": "April 30, 2010"}, {"Title": "What about skin tone quality on these Samsungs?", "Author": "Pearl King \"purlie1\"", "ReviewID": "R32W1C5UK48UT6", "Overall": "3.0", "Content": "I've been reading a lot about reviewers' raves/issues with the various Samsung models, but have yet to see a comment on skin tone quality or how to adjust settings for it.  It's the one area I am not happy with (I have the 26\" C350).  What do you think?", "Date": "July 4, 2010"}, {"Title": "Buyer Beware - this TV will not turn on after a few years", "Author": "Phuong nguyen", "ReviewID": "R1EK1YNMDF5H5F", "Overall": "1.0", "Content": "I bought a Samsung 40 inch LCD TV from Amazon in 03/2007, it was great until a month ago when it suddenly won't turn on at all. It make clicking noise and turn the TV on about 10 minutes but now it is completedly dead.I called Samsung but was told this model was not on the recall list so I have to pay for the repair.Search on Google and you will see this is not a rare occurrence. Stay away from Samsung product.", "Date": "October 29, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Game Mode and Anynet+ (HDMI-CEC)\nConnectShare Movie\nTouch of Color design\nFull HD 1080p resolution with BD Wise\nExceeds ENERGY STAR standards\nConnectShare? Movie\nExceeds ENERGY STAR® standards\nFull HD 1080p resolution\nGame Mode\nTouch of Color? design", "Name": "Samsung LN40C630 40-Inch 1080p 120 Hz LCD HDTV (Black)", "ImgURL": "http://218.201.42.40:8080/ecx.images-amazon.com/images/I/51xJo8uhY-L._SY300_.jpg", "ProductID": "B0036WT3P2"}}