{"Reviews": [{"Title": "Panasonic TC-P50S2 Review by Plasma TV Buying Guide", "Author": "LCDTVBuyingGuide", "ReviewID": "RN2FB0CPAM37I", "Overall": "4.0", "Content": "1080p HD Picture Quality: The picture presentation of the from the 50S2 is still very bright and with the improved black levels much improved. Black levels are deep and strong with an HD signal input through HDMI. While not the best we've seen lately, they lose the dark gray haziness that the S2 can display with a 480i signal. Color is plenty saturated and dark shadow detail remains excellent.Picture Presentation from 480i signals: We always test every TV with a 480i resolution. It is a great test of a TVs upconversion and processing chip sets. The signal may be likened to what you would see with your normal digital cable or satellite signal.The TC-P50S2 series plasma contains the new an updated version of the NEO PDP (i.e. plasma screen) from Panasonic. This is the same screen used in some of the higher end Panasonic series which should make this model a good value if picture quality is your primary objective. We find the picture quality overall improved from the prior S1 series. The drives do a little better job of eliminating motion artifacts than the S1 series did. Color rendition is still with black levels being the primary progress area of the S2 series delivering more depth and solidity. As was the case on the S1 series, brightness is a strength of the these newer Panasonic plasma models.Calibration Notes: Overall, calibration to D6500K was very easy with this TV. Though there are no white balance adjustments available on the menu without entering the service menu, the 50S2 calibrated so close to D65 from the start that it would have improved the TV inappreciably. We started our calibration from the custom setting in the Warm 2 color temperature position. The S2 series TV does not contain the THX picture setting option. Follow the following settings to calibrate to a nearly perfect D65. These picture settings are best viewed in a controlled light environment fairly dark room:Picture Mode: CustomColor Temp: Warm2Brightness: +74Contrast: +75Color: +45Tint: -2Sharpness: +15Color Mgmt: OFFx.v.Color: OFFC.A.T.S.: OFFVideo NR: WeakBlock NR: OffMisquito NR: OffBlack Level: Light3:2 Pulldown: OffHD Size: 2Black Level/Contrast: Black levels were an area that the S1 series needed a makeover on. They got it with this S2 series. These are not going to be the best black levels we see this year and we dont anticipate them coming close to some of the Samsung plasma black levels. However, Panasonic has brought black levels back into welcomed focus. Final ANSI contrast measurement was 1261:1 which is a nice improvement over last year but far from what we want. One of the TVs greatest strengths lies in its white brightness which measured an average luminance of 31.50. This result nears LCD TVs in brightness and points to Panasonic's desire to compete with LCD TVs in this area.Dark Shadow Detail: Partly due to the high brightness of this plasma dark shadow detail is excellent. Panasonic plasma TVs have long been a favorite of ours in this important area.Color Rendition/Color Accuracy: Color rendition is much more saturated with HD content. The TV excels with HD content and is much more subdued in presentation with lower signals. Colors can seem a little weak and hazy at times with lower end signals. I will give them the thumbs up on reality however.Features: One of the key feature differences of the S2 series with the G20 series of plasma by Panasonic is the absense of The Viera Cast feature set, which enables online content via a web interface. As a result, there is also no Ethernet port. The included Viera Link feature allows the user to control other Viera link capable outboard equipment. Viera Image viewer is the Panasonic compatible technology which enables use of SD memory card viewing via the SD card slot.The S2 has discrete picture settings for each input as well as Panasonic's new \"600 Hz\" specification for blur reduction.This TV is Energy Star compliant due to an energy saver feature option. Power consumption for the S2 has been reduced from the S1. This is one of the main feature differences aside from improved black levels. Panasonic started improving efficiency in their plasma TVs in 2007 and have improved it 400% with this S2 model. They are now close enough to LCDs in energy efficiency that is should not matter.To see the overall ratings and full review of this TV head over to Plasma TV Buying Guide", "Date": "May 17, 2010"}, {"Title": "As Compared to Sharp 52LE810UN Edge Lit LED", "Author": "Joseph A. Barrow \"3rd Man\"", "ReviewID": "RDV1YEK11GXA5", "Overall": "5.0", "Content": "I bought and evaluated this TV for about two weeks before taking it back and purchasing the new Sharp 52LE810UN edge-lit LED.  I have since taken back the Sharp and will be picking up the TC-P58S2 tomorrow.  Here are my thoughts:Overall Picture Quality:  Overall the S2 has superior picture quality to the Sharp Edge Lit.  The LED's only advantage is the Film Mode/Motion Flow, which gives the picture a very smooth video like appearance.  Some people don't like this as it doesn't represent the film in the manner the Director originally intended.Black Levels: The S2 has great inky blacks.  These black levels hold whether in a completely dark or brightly lit room.  The LED edge-lit black levels were no where near as good.  In a dark room the Sharp's screen looked white/cloudy, even with the backlight turned all the way down.  A full LED set with local dimming would likely fair more favorably against the S2.Constrast: The S2's contrast was far better than the Edge Lit LED.  Again, in this area Plasmas still dominate.Bright Room Performance:  The S2's matte screen did an excellent job of handling bright rooms and it's backlight was plenty strong to handle even direct sunlight.  The glossy screen of the Sharp was very, very reflective and seriously detracted from the viewing experience, despite it's very powerful backlight.Viewing Angle:  The S2's viewing angle is phenomenal.  You can sit at any angle to this TV and still have a bright and vibrant picture.  While the Sharp LED had good viewing angles, it can't keep up with the Plasma and began to get washed out at about 70 degrees.Network Connectivity:  The S2 does not have internet connectivity like the LE810.  The LE810 has a host of internet widgets and features.  This was not an issue for me though, as I utilize my PS3 for internet connectivity and BLU-Rays, meaning the Sharp was redundant for my purposes.Connectivity:  The S2 does not have a d-sub input.  This could be an issue for some, but was not for me, as I have an HDMI output on my laptop.Design:  Thin Edge-lit LEDs have great visual appeal, but they sacrifice performance for looks.  The S2 is comparable in design to mid-priced LCDs, though slightly heavier.  The buttons on the S2 and its remote function well and are well laid out.  The buttons on the Sharp are \"supposed\" to be touch sensitive, but require A LOT of pressure to activate.  The Sharp's remote is stylistically and functionally similar to the S2.  Again, this sacrifices looks for function.  The Sharp's base is solid glass, whereas the S2's is plastic.Sound:  Surprisingly, the Sharp delivers great sound (for a flat panel) despite it's thin design.  The Sharp pumped out more volume at 25% than the S2 did at 50%.  The Panasonic has weak sound for large rooms.  I'd recommend using a HTIB or Receiver/Speakers with the Panny.  The S2 now sells for $899 on Amazon.  This is a great value!  The $1,200+ price of the 58 inch S2 is truly compelling.  With the Sharp, for $1,799 your getting the newest LED technology with internet connectivity in a slim design.Value: I purchased the S2 for $1099.  The Sharp cost $1,799.  The Panny outperformed the Sharp in almost every area and does so at over $900 less.I highly recommend the Panasonic to anyone looking for picture quality first and design second.", "Date": "September 8, 2010"}, {"Title": "Amazing TV at an Amazing cost!", "Author": "C. Freeman", "ReviewID": "R1VSL642ZMRFJZ", "Overall": "5.0", "Content": "I've been in the market for a new TV for a long while now, but finally my old 42\" bit the dust and it was time for an upgrade. I did a fair amount of research in regards to both quality and price and this tv was hands down untouchable. Amazing picture, great black levels, and finally an option for HD picture that allowed my mac mini to be connected without overscan, the picture ratio is prefect. Amazing tv, looks great, great price and a great picture. I'm very satisfied so far. Speakers leave something to be desired, but with a TV this big you're going to want to hook up a 5.1 or 7.1 anyway.", "Date": "May 7, 2010"}, {"Title": "I did lots of research", "Author": "Brian \"Brian\"", "ReviewID": "R1O0COBT82CISJ", "Overall": "5.0", "Content": "I did a lot of online research and spent a lot of time at electronic stores before I finally decided on this TV. Great features, great picture, great price, and Panasonic is the best brand name in plasmas in my oppinion. I've had this for almost 3 months now, and cant think of one thing I could complain about. I wish there was a PC hookup, but I knew that this model did not have one before I purchased, so I cant really complain there. I would make this purchase again if I had to do it all over again. I would strongly recommend this TV.", "Date": "April 21, 2010"}, {"Title": "Excellent, Large TV that's a Good Value", "Author": "JTL", "ReviewID": "R3CFCTUD04NR41", "Overall": "5.0", "Content": "I researched 50\" TV's for a long time before purchasing the Panasonic TC-P50S2 on Amazon.  Other reviewers have given technical reviews so I'll skip that.  The image quality is excellent, the picture is gorgeous and the quality is solid.  However there are lots of TVs that meet these criteria ... what makes the TC-P50S2 special is it's value.  There are many 50\" TVs of higher quality and better specs, (including some from Panasonic), however there is no other TV that delivers the features set and quality at the price of the TC-P50S2.  If you've got the dough, you can go out there and buy a better television, but it'll cost you.  As of October 2010, you won't find a 50\" TV of any brand or technology that offers 1080p resolution for the competitive price which can be found on Amazon.  I wanted a large, full HD television, but couldn't rationalize spending what most TVs in that category would cost.  If you want 50 inches, modern technology, maximum resolution and a trustworthy brand, while not breaking the bank, this is the TV for you.", "Date": "October 14, 2010"}, {"Title": "Happy Panasonic Purchaser", "Author": "F. Magnus", "ReviewID": "R29WEHLD61H5M9", "Overall": "5.0", "Content": "I bought this TV about 6 months ago. The refresh rate on this TV is excellent. The colors are unbelievable, especially with Blu Ray. Auto Racing is the true test though. I,ve never had any blur or bad picture. This TV is a fantastic buy at a fantastic price.", "Date": "May 3, 2010"}, {"Title": "Very satisfied with our TC-P50S2", "Author": "A. Channaveer \"kcanu\"", "ReviewID": "R28419U10S4VJ2", "Overall": "4.0", "Content": "We got our S2 almost 3 weeks back. They delivered it on time. We are really satisfied with the picture quality. I like the remote Control and it was very easy to connect with the Digital HD cable receiver. One thing I noticed is that when we switch off the lights in the room the picture changes its brightness... i dont know if there is some kind of sensor that changes the brightness depending on room light. You get used to it after some time.TC-P50S2 is a 1080p TV. But I heard that almost all cable providers only transmit in 1080i. So even though we bought better technology we are not able to take full advantage of it since the relay is only 1080i. I talked to the cable operator and he said they are more concentrating on 3d and may not change to 1080p transimssion any time soon. So that is a shame. If you have blu-ray disk player you can still enjoy 1080p.Untill now we love this TV and I would recommend anybody to buy this on Amazon as they were the lowest price when I bought it.", "Date": "June 4, 2010"}, {"Title": "Excellent TV", "Author": "Lee T. Maggione \"Lee\"", "ReviewID": "R2LJAS61JHZT95", "Overall": "5.0", "Content": "I bought this plasma TV last week. It was set up by a professional to my in wall surround system. The picture on this TV is really clear and crisp. I think it is much better than and LCD or LED that I looked at at Best Buy and Walmart.", "Date": "April 21, 2010"}, {"Title": "Panasonic TC-P50s2 great buy!", "Author": "Jinesh Karia", "ReviewID": "R1KTTYWPVPVZXR", "Overall": "5.0", "Content": "This tv is a great asset to our living room.  Aside from the GREAT picture quality that the other reviewers have attested too, the tv has a sleek look.  That is, the tv has a nice black finish surrounding the screen.  Also, this tv doesn't have a glossy finish on the panel(personal preference, I don't like the glossy finish on the screen).  Unfortunately, the tv doesn't come with a swivel stand.  Overall, we have have been extremely happy with this tv.  If you're on the fence about it, don't be, it's a great buy!", "Date": "June 23, 2010"}, {"Title": "Excellent TV for watching movies at home !!!!", "Author": "eringo \"eringo\"", "ReviewID": "R18AOG3UNIC8WQ", "Overall": "5.0", "Content": "Been very impressed with the picture quality this tv has been putting out and how good movie watching is on this tv.I was using a panasonic 37 inch LCD.I must say plasma is the best for picture quality.The screen is excellent,colorful and bright compared to LCD.I am not watching blueray movies on this tv yet.My standard dvd player is connected with HDMI and can upscale to 1080p standard dvd movies look excellent on this tv.The HD channels also come is very nice.My only complaint is the sound from the tv speakers are not that great.If you are buying this tv for the tv speakers I recommend adding a surround sound system.The tv speakers are not the best for listening to movies.The other complaint is no Pc input which I already knew this tv did not have from other reviews on amazon.I set the tv up by myself lifting it out the box with no problems setting up.The delivery service amazon uses is Pilot freight.They did an excellent job delivering the tv.You can also set the time of delivery which I thought was very convenient.Over all this is an excellent tv for movie and tv watching at home without going to the movie theater.With this tv it will be a long time until stepping foot into a theater.The only thing missing are the sticky floors and noisy people.", "Date": "May 17, 2010"}, {"Title": "I'm extremely satisfied.", "Author": "MrReviewGuy", "ReviewID": "R275KNDBQ86AV", "Overall": "5.0", "Content": "So i received this HDTV about 5 days ago.  I've read countless blogs and details on how to take care of this and all new Plasma TVs.  First off i put all the setting really low, and i'm in cinema mode.  I put all setting around 50, this is only for the first 100 hours or so.  Burn in process.  I'm making sure there are no static images on my screen for no longer than a good 10 minutes.  And i'm also keeping the entire screen full.So before i recieved my TV i called Panasonic to ask a few questions about the Television.  I got a human on the line in about 1 minute.  She was very helpful, she told me to do the things i listed above except for putting all setting around 50, i read that on numerous other sites.  She did say that cinema is the best picture setting, and to stay away from VIVID.  I asked her if its a good TV for gaming, I'm using 360 and soon my PS3 for Blurays; her answer was that plasmas aren't good for gaming because static images, like health bars and radar etc...  She uses an LCD for her gaming.  Then i thought to myself, Panasonic doesn't make LCDs, or do they?  Anyhow i thought to myself what does a woman know about gaming anyways, its 1 in 100000 that i'll find a woman who can keep up with me in COD, Halo, and any fast paced action shooter.  So i decided to go against her word on the gaming and i purchased this TV.  So far i'm 100% satisfied with the gaming experience.  Reach looks great.The only thing i'm waiting for is the burn in process to end.  After i break in the T.V.  I'll calibrate the setting to D6500, there is a whole website on which setting to use.  I will not access the service menu, only when my warranty is up.Anyhow i'll definitely update this review once i finish the burn in process, so far i probably have about 30 hours logged on the TV.  A cool feature i've been using on a daily basis is the image retention option in the menu settings.  If you have a ghost image from watching or playing games for to long.  You go to this option and the screen will turn black, a write bar will go left to right on your screen, the Panasonic lady said leave on for 15 min. if you have image retention/ghost image.  I haven't had one, but i'm just being very careful with this TV.  Its the first Plasma that i have owned.  And 2nd HDTV.Oh yeah, for each input you have to calibrate them independently.  I learned this when my 360 games were a bit fuzzy, then i switched to cinema and reduced the settings and it looks great.I'll write my age so other people can relate to me.  I tried finding reviews that would relate to me, and it was hard to find.I'm 25 Male, i've been a gamer since original Nintendo.  And i love HD Games/movies.  I always do my research on buying expensive products.  I decided to take my chances with this TV.Oh yeah you should check all inputs to see if they are working, i started doing that last night but fell asleep.  The Image viewer from the SD card is a nice feature.  But it takes way to long to load the images.  About 10 7 seconds to load one image.All in all i'm satisfied, hopefully i didn't jinx myself by writing a good review for this product *tapping mouth*.Update: 11/22/10Well I tweaked the settings to D6500, i think i'll use that for nighttime viewing or in a darkroom.  Its very bright compared to the cinema setting that i was using.  Now that i write this i'll go home and adjust the brightness when viewing.  I just played about 6 hours of gaming this weekend and it looked great.  The only thing that really is pissing me off is the price dropped $100 bucks 3 weeks after i bought mines :(Since its now about $800 i'd buy this asap.  If anything goes wrong i'll update.  But until then i'm digging the TV.UPDATE 12/19/11Image BURN!!!! :(  So this is my fault.  The first year with the television i was very careful, after hours of use i would go to menu and turn on the image retention to prevent burn in.  But Battlefield 3 all nighter happened and i forgot to do this, now there's image burn.  Its hardly noticable, but its my tv so i always glance at the spots where the burn in happened.  While watching movies i hardly notice, only when i turn on the image retention, i can see the burn in.  But overall i'm still satified, i'm hoping to get a year maybe two out of this TV before I sell it.  Just waiting to see if 3D TVs catch on.", "Date": "October 26, 2010"}, {"Title": "Great Picture", "Author": "W. Ciocco \"bciocco\"", "ReviewID": "R1VE180PIZNYCJ", "Overall": "5.0", "Content": "I purchased this set to put over the fireplace. We sit ~13 feet (~4 meters) from the TV and it has a great picture. There is a slight reflection from a lamp (if the lamp is on) that is just off to the side of the TV. Most plasma sets have reflectivity problems. I do not have any issues with window reflectivity when watching during the day. Although, I do not watch during the day very often. We have found that, due to the amount of light this size screen puts out, we enjoy watching with all of the lights off. We did not do this with our 30\" HD CRT.The set is connected to the Audio Video Receiver (AVR); so, I don't experience any sound issues. If one is using a screen this size, I would expect that it is going to be used in a home theater setup.Controls are easy to use. Setup and calibration went well. It works well with the Harmony remote.I have yet to see any 1080p content because I don't have any. Regular DVD (480i) and HD TV (1080i) look great.I only purchased the 1080p to be future proofed. If you do not have or want Blu-Ray you may want to save some money and go with the less expensive 1080i models.", "Date": "December 1, 2010"}, {"Title": "Great value.", "Author": "Gene J \"Gene J\"", "ReviewID": "R35NM5UIBIM31Z", "Overall": "5.0", "Content": "The box arrived and the TV almost set itself up when it was plugged in.  The instructions are good and it has all of the features I wanted such as multiple inputs.  The picture is great and far beyond what we had before.  The difference in picture quality if you use a BluRay player is amazing!  The sound is mediocre but I use a surround sound system anyway.Now the bad part.  The box arrived a week late.  It actually shipped a day early but sat on a local loading dock for a week.  It was only after a few phone calls with the shipping company did they promise to deliver it in TWO MORE DAYS!  They were supposed to call a half hour before they arrived but they did not.  The delivery guys could not have been nicer.", "Date": "August 24, 2010"}, {"Title": "good TV hickup with delivery", "Author": "Rabbit Hill Manor", "ReviewID": "R2U21EELQR5D5I", "Overall": "5.0", "Content": "Fine TV.  Very happy.  First TV arived quickly but had a dead screen (line with noise) discovered in the installers start test.  delivery installer took it right back.  Amazon replaced TV with no problem but with a much longer arival delay. So, all in all, it took 2 weeks to get the TV and many calls to Amazon customer service. They did the best they could.", "Date": "June 5, 2010"}, {"Title": "Excellent TV", "Author": "Lawrence C. Mellen", "ReviewID": "R2O5MDZIBBVXZD", "Overall": "5.0", "Content": "This is my 1st HDTV. I'm very pleased with this set.The picture is excellent; the anti-glare screen works very well.I bought a calibration disc, but did not need it. The TV settingswere right on the money. I do not have surround sound, but the TVspeakers work very well. Would definitely recommend Panasonic Plasma HDTV'sas being excellent TV's. Again, very pleased with this set!", "Date": "June 5, 2010"}, {"Title": "Great TV/ clear picture", "Author": "Jenny", "ReviewID": "R3G4WQFFGRVUNB", "Overall": "5.0", "Content": "I bought this tv at one of the few remaining electronic chain stores and I love it!  I researched LCD, LCD LED, plasma and for the sale price I paid (in the 700 range), this plasma (and panasonic plasmas in general) offered the biggest bang for the buck.  Other Samsung and Sony LCD LED's had nice pictures but their prices were more than double which tipped the scales.Comments/Benefits:-The colors are crisp.  If you go to the store, make them show you the tv in different settings -- some will put it on the brightest setting which is not where most people will watch regular tv viewing -- and look at skin tones and words.  This is where it is easiest to make the comparisons (in my opinion).-Does not have the weird, cheap soap opera look that some LCDs offer.  I know someone who purchased a Samsung LCD earlier this year (for around $1700 out the door with taxes) and it has the weird motion.  The salesman told me it was because LCD's do not refresh fast enough to keep up with the natural look but I do not have the expertise to determine if that is true or not.  It just makes programs look cheap to me.-Was easy to set up.  Unbox, attach to stand, plug in cable box, plug in wall.  Done.-Sound is great.  Please note that I am not a sound expert nor do I have surround sound so what comes out is good from my point of view.-I did purchase the 1080p so I could have the glare guard (or that is what I call it) because the tv is in a room with quite a bit of sunlight.  I am glad I did because I have had no problems with reflections and I think the reflections in the non-glare guard tvs would have annoyed me once in the room.  The best way to check thelevel of reflection/glare, is to have the store turn off the tv so you can see the natural black screen with no picture.  The plasmas without the glare were very reflective.-Energy Star and labeled by the local electric utility as an energy efficient product.  This may not matter to all but it is important to me.-The caveat to this is that I do not need to have the new technology items(e.g. no 3D for me)and I aimed for a price that would not make me regret such an indulgent purchase around Christmas.  Also, I have had this tv for one week and the true test will be over time and I am not a technological trail blazer.", "Date": "November 24, 2010"}, {"Title": "Crap!!!", "Author": "Matthew D. Krysinski", "ReviewID": "R127CMF6DA2HK0", "Overall": "1.0", "Content": "I bought this TV on January 1, 2011.  I did a lot of research and read a lot of reviews, and this one seemed like a no brainer, and it was fine, nothing earth shattering, but fine for almost 17 months.And then poof, it wouldn't turn on.  I am yet another victim of the Panasonic blinking red light of death.  Based on the myriad threads out there created by people like me whose Panasonic TVs just stopped working, they must have missed some critical quality control steps during a production cycle.I spent one thousand two hundred dollars on a brand new, beautiful TV, and seventeen months later, it just stops working?  My response to that, never will I buy another Panasonic product ever again.  My hard earned money is way too valuable to me to waste on a company who makes inferior products.", "Date": "May 22, 2012"}, {"Title": "Great TV", "Author": "Blake", "ReviewID": "R3CRUUQ2X0ILNF", "Overall": "4.0", "Content": "I would rank this a 5 but nothing is perfect.  Great tv coming from a 27\" tube tv.  This tv is worthy of being a home-theater tv.", "Date": "May 12, 2011"}, {"Title": "No Better Bang for the Buck", "Author": "G. Petersen \"Broadcast Professional\"", "ReviewID": "R4I0NAORDB3LX", "Overall": "5.0", "Content": "I purchased the 50\" plasma just before Thanksgiving last year (2010) and I have been very, very, pleased.  The packaging was ingenious as the box slips apart making the setup a breeze.  (Do save the box as you'll need it if/when you move.)PROS:  Color, Sharpness, Richness, Adjustability, RemoteCONS:  Sound (But every flat screen falls \"flat\" here.) and HDMI inputs. (Needs one more.)Once you get the colors calibrated and dialed-in, this set is great.  The blacks are still inky with 3 months of use -- about 6 hours/day.I am using the optical audio out into a Yamaha receiver and the sound that way is fantastic.  5.1 sound during football games is kind of an acquired taste (that I haven't acquired yet) so I use my receiver in 2.1 mode most of the time.  The subwoofer adds a lot of punch that the TV's built-in speakers can't nearly match.  My previous HDTV was a 34\" Sony with a Triniton tube. That box was big enough that they fit a 5\"subwoofer in the cabinet, making the sound excellent.  But flat screen TVs don't have that much room and the down-firing speakers leave a lot to be desired.Overall, I purchased this for the excellent picture and at a price of <$775, it was a steal.Oh, and the plasma \"burn-in\" problem?  Forget about it ... unless you intend to leave the same static picture on the screen for a day or two.This set uses the new \"NeoPDP\" plasma display screens.  A great explanation about that technology can be found here: [...]", "Date": "March 9, 2011"}, {"Title": "Pleased", "Author": "Sophie", "ReviewID": "R304MA2MBOVLT2", "Overall": "5.0", "Content": "Very nice TV.  Good picture.  Easy to setup.I was not impressed with the delivery process -- because the delivery company customer service was below average.", "Date": "January 19, 2011"}, {"Title": "Amazing!", "Author": "Christopher J Buchan", "ReviewID": "R2YT8JZ7P3949U", "Overall": "5.0", "Content": "If you can remember the awe at seeing HDTV for the first time, that is what seeing this TV is like.  The image has a lot of depth and realism, my wife watched \"Chicago\" on TNT in HD on it last night and it was like we were in the theatre!  A lot of reviews mention the picture being not so great out of the box but once you change the picture to cinema that issue is fully resolved.  I am upgrading from an eight year old 47\" projection Panasonic 1080i, I used it heavily with never a problem.  The quality and dependability of that set made me feel comfortable buying another Panasonic.The image is crisp and smooth, I played back a TiVo'd HD broadcast of the World Series on the TV and the picture remains smooth with no blurring or pixelation through full speed swings and fast motion action.  Hockey is fantastic as well!  Bluray movies are phenomenal, I ran \"Up\" from my PS3 using HDMI, the picture and colors are outstanding!The blacks are deep and clean with no graying out.If installing on a wall mount, make sure you have at least your power cord attached before hanging, it is located near the middle of the TV and is impossible to attach after hanging, I was too excited to get the TV up and running and found this out the hard way!I can't imagine finding a better deal on a 50\" 1080p HDTV.***UPDATE***I've had this for over a week now and I still stop and stare at how great the picture looks.  The new Star Trek film was reproduced beautifully on the screen.  No blurring, no lag, just an enjoyable viewing experience all around.I run my audio back out to a receiver and a Bose Acoustimass Series III system through the optical out on the back of the TV and I have not noticed any problems.  I tried out the TV speakers for late night viewing and they aren't as bad as other reviews say, just don't expect movie theatre quality.I have also been playing some video games on the set, Fallout New Vegas (Status bars display at almost all times during gameplay) and Gran Turismo 5 and have not had any issues with burn in at all.  I will say that the color settings in \"Game Mode\" are a bit too electric for my taste so I leave it in Cinema.", "Date": "November 24, 2010"}, {"Title": "GREAT PLASMA FOR THE MONEY BUT NEEDS TWEEKING TO GET THE BEST PICTURE", "Author": "Jay", "ReviewID": "RRO94RV59CCB", "Overall": "4.0", "Content": "I wanted a plasma TV and did lots of research and this TV fits my budget.What I like:Great DetailGreat colorsFull HD 1080P really works well with a good HDMI CableWhat I dislike:Circle Bands in the dark areas of the pictureSound could be betterI tried the warm setting, it really makes the picture too yellowHere are the settings that will make this TV get the best picture using HDMIPICTURE MODE: CINEMACONTRAST: 81BRIGHTNESS: 69COLOR: 45TINT: -2COLOR TEMP: COOLXV COLOR: OFFC.A.T.S: OFFBLUR REDUCTION: ONASPECT ADUSTMENT:FULLHD SIZE 2ADVANCE PICTUREBLACK LEVEL: DARK3:2 PULL OFF", "Date": "December 11, 2010"}, {"Title": "I can see why Panasonic stopped making Plasma TVs", "Author": "K. Koontz", "ReviewID": "R5AANUI0JA3E5", "Overall": "1.0", "Content": "I have had this tv for 3  years and four months. I turned it off December 22nd 2013 and heard a pop.  Tried to turn it back on and nothing but ten blinks of the red light on the front of the unit and a pause.  My extended warranty had just expired. Panasonic gave me the name of a local Panasonic service center and much to my surprise they had it going on Christmas eve.  Problem was blown SC card. Cost $250.00.  I am another person who will NEVER BUY PANASONIC AGAIN!!!!!", "Date": "December 26, 2013"}, {"Title": "Lasted less than years then PDP (plasma display panel) cracked", "Author": "Roger Dias", "ReviewID": "R1EJPALX3401IY", "Overall": "1.0", "Content": "Installed in mid 2011, picture was very good.However, PDP just cracked from the inside a few weeks ago.Product was out of warranty (one year from DOP).Had Panasonic contract servicer come out for $125 to tell me he couldn't fix it since the PDP was cracked.Called Panasonic back and asked if there was anything they could do to give me something towards a new Viera unit.After 2 days they called me back and said no....so I spent about $1400 for a TV that lasted me less than 2 years, and Panasonic wouldn't give me so much as a $50 coupon towards a new unit.Not only that, their technical support personnel were clueless (spoke to 4 different ones)...so I wasted a week for them to tell me essentially to take a hike...will never buy another Panasonic TV again, very disappointed they didn't stand behind their unit more.", "Date": "May 12, 2013"}, {"Title": "Awesome TV", "Author": "Mark L \"Mark L\"", "ReviewID": "R3I41XXU5H5EJR", "Overall": "5.0", "Content": "I purchased this TV hoping I wouldn't be disappointed and it has fulfilled and really exceeded all expectations.  The picture is absolutely fantastic.  Watching my Packers in Hi-def is almost as good as being at Lambeau Field.  The blacks and overall color is great.  The viewing angle is great with no loss of clarity when sitting off-center.  The sound is a bit weak but I have it hooked up to a home theater.  My son plays video games on the Playstation 3 and it looks great as well.  I have no complaints and would purchase this TV again.", "Date": "December 6, 2011"}, {"Title": "Great picture, confusing menus", "Author": "D. Allin", "ReviewID": "R3NH9K5M1RJQ4H", "Overall": "4.0", "Content": "I ordered this from Amazon, and was extremely pleased with the price and the delivery.  It was brought into my living room, unpacked, and tested.  Unfortunately, the cable had gone out just before the TV arrived, so the delivery man could only ensure that the the menus were visible.  When the cable came back later that day, I discovered the closed captioning was on, and the sound off, and it took me a couple days to get it working correctly.  That may have been a problem with my cable box, which has its own closed captioning and sound menus.  Between all the cable box menus, and all the TV menus, it was very difficult to find the ideal settings, but once I did, the picture was terrific.  I had also purchased a Panasonic home theatre system, with its own set of confusing menus, and a year later, I am still finding new combinations of settings between the three devices that affect the sound and picture.  The TV sound without the home theatre is very good, but the home theatre system sound is so much fuller and wider that we use it all the time.  Overall I am extremely pleased with the TV.  The picture is bright, sharp, and natural, without the hyper-realism that I have noticed on LCD TVs.  Live HD sports events are almost better than being there in person, and watching a blue-ray movie is like being in a theatre.  Figuring out all the menus and sub-menus, which have no logical arrangement, was initially frustrating, but once I got things set up correctly, the result is truly outstanding.", "Date": "October 9, 2011"}, {"Title": "Only lasted 7 months", "Author": "TV fan", "ReviewID": "RPE7S9XEOUQ9E", "Overall": "1.0", "Content": "This TV has a really nice picture.  However after the first 7 months the left part of the screen went out.  Panasonic replaced the TV with a new one.  After another 7 months the right third of the picture went out.  Now the TV is not under warranty.  This TV does not last very long at all.", "Date": "July 28, 2011"}, {"Title": "Buyer's Remorse, sorta", "Author": "Eric Prescott \"Go vegan\"", "ReviewID": "R1CIQMW4RE5PCZ", "Overall": "3.0", "Content": "I was in love with this thing when I first got it on 7/7/10. That honeymoon lasted until a couple of weeks ago, right before the warranty expired. One day, out of the blue, I noticed this minor banding effect. The next day it was worse, and far more noticeable using different inputs, particularly looking at natural images like the water on my wallpaper (computer) and flesh tones. Regardless of source and resolution (from sub-480i images to 1080p Blu-ray disks), suddenly I was seeing lots of banding, and a sort of smearing in the background, mainly related to lighting gradients and patterns or textures, like wallpaper and carved stone.I called Panasonic and received an appointment for something like 5 days later. As one might expect, the intensity of the problem decreased without me making any changes to the picture settings. The technician said what I was seeing was normal. :| Normal? I had the TV for a year. Yes, I am sitting closer to it now--closer than the recommended distance--but I've been living at this address since 2 months after I bought this TV (I had the TV in the living room at the old address and now I have a room dedicated to 'home theater', though it is admittedly small and would be better served with a 42-in set. Regardless, I've been watching the TV in that room for over 10 months without noticing any issues, having played around with my contrast and brightness over time in order to strike a balance between all the different types of content displayed on the TV, and not once noticing any banding. And yet this is normal. Apparently it's the refresh rate, or so he said when he came back a second time. I had pictures and videos I'd taken of the screen to highlight the more obvious examples of the problem, and he shrugged his shoulders at me. You know, he's been looking at TVs for 21 years, so my opinion counts for nothing. The only fix he could suggest (admittedly, after swapping out the entire logic board, or whatever it's called, even though he didn't see any problems) was to sit farther from the TV, though my couch is up against the wall.I'm hugely disappointed now. I will probably not buy another plasma (I was sold on it because I watch more movies and TV drama than just about anything else), and I am going to be a bit shy about getting another Panny, despite my first 10 months of enjoyment. Works about to more than 80 bucks a month! I'm going to look into LED or LCD again to see where viewing angle, prices, and all that are at, and make sure that my next TV has a much better refresh rate than this terrible 60Hz (is 600 overkill? I'll settle for 240).Oh, and while Viera Cast would be convenient, I have it on my Blu-ray player. Not as convenient, but as someone else mentioned, BD players are far easier to replace than TVs.UPDATE 9/19/2011: I sold the TV a week ago or so for a fairly good sum and bought an LED Sharp with the proceeds. Great picture (eventually, after calibrating for a while), but unresolvable audio sync problem. I'm returning it tomorrow, and I already have another Panasonic on the way, this time a straight-up LCD (42\"), which was far cheaper. We'll see whether I regret this, too, but I'm starting to wonder whether I'll ever find a TV that makes me happy. Anyway, I'm just updating because I said I would be shy about getting another Panny. Well, I was, but I did.", "Date": "July 14, 2011"}, {"Title": "Great TV", "Author": "Dave", "ReviewID": "R15MXZKQ7CP1YW", "Overall": "5.0", "Content": "This is an excellent tv set and I am more than happy with the picture quality and all of its added features.  The sound, while not great, is definitely serviceable.  No humming or buzzing.  At times it is just a bit difficult to hear, even when the volume is increased but definitely happy with it overall.", "Date": "June 27, 2011"}, {"Title": "Plasma TV", "Author": "TooZippy", "ReviewID": "R273S5GS49MXRZ", "Overall": "5.0", "Content": "I am very satisfied with this TV.  I hope to get many years of service out of it with no problems.", "Date": "March 16, 2011"}, {"Title": "Best 50\" Plasma and HDTV at the price range", "Author": "EMY", "ReviewID": "R2IY0U2KGQGMJ6", "Overall": "5.0", "Content": "If you want a 50\" flat panel HDTV without the fancy bells and whistles, then this is it.  I selected this set over LCD, LED, and other Plasma based on picture clarity and price and dependability (very low failure rate).  In my opinion Plasmas have a better and more natural picture than LCD and LCD/LED sets and motion blur is non existent.  I also don't need 3D (no content and I already wear eyeglasses so I don't need another pair), or any other type of apps or widgets that are attached to new HDTVs in order to justify crazy price increases.Buy a basic set.  If you want all the fancy gizmos get them through your BD player, PS3, or Xbox 360, or even Apple TV or Google.I paid $850 for my plasma and its picture is better or just as good as HDTVs that cost 3x the price.Save the money and spend it on a good AV receiver and speakers.Also, you don't need for than 50\" if your viewing distance is less than 12 feet.", "Date": "February 26, 2011"}, {"Title": "Great value for the price", "Author": "Ron Nordin", "ReviewID": "R2E9GFHUHRTFKJ", "Overall": "4.0", "Content": "This is not a $2000 TV so don't expect it to act like one. Aside from that the quality is excellent. I suspect most people with image or color problems have not properly configured the settings. Before you complain check out some suggested settings which you can find from other comments here or elsewhere such as this site:[...]", "Date": "January 17, 2011"}, {"Title": "Panasonic", "Author": "shangrila", "ReviewID": "R134AC2WSNQCHK", "Overall": "5.0", "Content": "My family and I find it to be a television of high quality in all aspects. We are very pleased.", "Date": "January 3, 2011"}, {"Title": "Good in all aspects", "Author": "Tom Frasier", "ReviewID": "R181KBEO6Q9AJF", "Overall": "5.0", "Content": "It arrived on time.  It was easy to unpack and to set up.  My great room has 2 large picture windows and the light during the day hampered the picture very little.  Since I'm not a sound nut the sound is very satisfactory for me.  I can't think of any cons.  I have no reservations in recommending this TV.  As always, my dealing with Amazon have been as expected or better than expected.", "Date": "December 28, 2010"}, {"Title": "Great price point with all the right features!", "Author": "P. Turner", "ReviewID": "RV2GHIKDJT98K", "Overall": "5.0", "Content": "This television was the right price for the features I wanted. The picture is great. Response time is awesome. Colors are vivid. The anti-glare is an important feature as I have a lot of natural light in the room. They've moved the SD card to the side and added easily accesible HDMI and component connections there. You can't see them unless you look but they're easy to get to which is great. The TV also has return audio channel which I'm looking forward to setting up when I buy a compatible home theater system.", "Date": "December 22, 2010"}, {"Title": "great TV", "Author": "Michael Salus", "ReviewID": "RRDMANAG0ITXS", "Overall": "5.0", "Content": "This is the second plasma Panasonic Tv for me. I have a 58\" in my living room. Excellent picture on both. I think Panasonic makes  one of the best and most reliable TV's out there. I will definitely buy more Panasonic products. Also got it for a great price. The next one I get will be the 3D plasma.... next year , when there is more programing and they come down in price..", "Date": "December 20, 2010"}, {"Title": "Good Choice", "Author": "Andrew G. Henderson", "ReviewID": "R2HZU6RLWHRSB", "Overall": "5.0", "Content": "This is my first plasma TV, and it is all I had expected from a plasma TV, all I can say for now is that it is wonderful, I'm hopeing it will last for a while, it's a 50'' Panasonic TC-P50S2 Plasma,and the price was not bad at all from Amazon, thanks .Drew Henerson", "Date": "December 17, 2010"}, {"Title": "Great TV", "Author": "Chrisc", "ReviewID": "R1DWTCCMI918QH", "Overall": "5.0", "Content": "Great picture and awesome black levels.  One issue that I found with my set, is that the standard picture setting seems somewhat noisy / grainy.  If you experience this, change to the cinema setting and make your adjustments there.  Blu-ray Avatar looks nothing short of stunning, and I am not aware of any of the lag that another reviewer described.", "Date": "May 11, 2010"}, {"Title": "Panasonic TC-P50S2", "Author": "DB2", "ReviewID": "R19NT27ZU3H1JT", "Overall": "4.0", "Content": "Great picture! Clear and sharp.  Free shipping from Amazon, and the product arrived 3 days before their estimate. You won't be disappointed!", "Date": "July 9, 2010"}, {"Title": "plasma tv", "Author": "Diane Black \"BlacksofRaton\"", "ReviewID": "R11X7VDOJIUDBO", "Overall": "5.0", "Content": "We set the tv up ourselves and it was real easy.  Timely delivery and we are happy with it.", "Date": "June 25, 2010"}, {"Title": "Novice TV User", "Author": "Jennifer", "ReviewID": "RQIDJDUB9VHNO", "Overall": "4.0", "Content": "Sure I've been watching TV all my life, but this is my first flat screen. I have no idea what tricks this TV does, but I know that it came out of the box, I plugged it into my converter and now I can watch all the sports I want in BIG HD with no learning curve. I'm sure I'll eventually learn more about the functionality, but for now, I'm happy -- though my other TV is a 30 inch CRT with a curved screen so I'm pretty easily impressed. Oh, the TV is in the basement and I use it for sports and I was told that with that combination I should go plasma.", "Date": "September 27, 2010"}, {"Title": "Panasonic TC-P50S2 great TV for the price", "Author": "Barron", "ReviewID": "R2YR49H83KTGNP", "Overall": "5.0", "Content": "This is my first plasma. My flagship TV is my 52\" Samsung LCD LN52A750 which was also purchased from Amazon for ~1800.00 in 2009. I was running from room to room comparing the picture with Sammy. Since they both are feed from a HDMI switcher, both cable signals were identical.  I tried every possible setting to get the pictures to at least parity but nothing could match the Sammy. Granted, I paid twice as much, in last years dollars, so I did get what I paid for with the Sammy. Where the difference really shows is in programs like football games and in TV shows like CSI, where a landscape shot of the city is shown just before the cameras switch to the inside.There is this chart around that shows what screen size you need for your eyes to be able to resolve all the detail for a given distance for a HD picture. We'll, for the Sammy I notice that I start having trouble doing this at about 8ft.. With the Pani, this distance is about 12ft.. Hopefully, this gives some idea of how much sharper the Sammy is.With the picture matched (as much as possible) between the 2 TVs, there is not much difference in the black levels... frankly; I expected more since the Pani is a plasma.TV speakers sound fine to me and have adequate volume. I run mine at 50-60 (0-100) in my 16x26x8 bonus room. The room has good acoustics. Of course they don't compare with my home theater speakers but I have no problems running them any time other than during a \"Saturday night\" feature movie.The screen is not as reflective as it is on the Sammy. This along with maybe the technology, perhaps unique to plasmas, might be the reason for the difference in PQ... I'm guessing here but I do notice that the colors and detail seem to \"pop\" more on highly reflective screens... my new laptop has such a screen too.I've managed to pull in a few OTA high-def channels and I was impressed. The analog (from my cable) is well, analog... but is definitely watch able.Even though these new plasmas output ~50% less heat, I believe this thing will keep my bonus room heated during the winter. The specs sheet says the TV consumes about 340watts. For comparison, the 30\" Samsung CRT widescreen that I had consumed about 190watts. I don't watch much TV during the summer so during these times I always have the option to watch my Sammy downstairs.This TV also supports ARC (Audio Return Channel) part of the HDMI 1.4 spec. It seems some newer receivers will require this for the HDMI passthrough to work properly when it's in stby mode. I haven't tried this yet as my Onkyo HT-RC260 hasn't arrived. One thing the TV does do, if fed a Dolby digital 5.1 signal from either the onboard tuner or received through the HDMI input, it sends this 5.1 audio to my Kenwood VR6050 older HT receiver. I have an optical cable running from the TV to the receiver. This rx has no HDMI inputs.To sum it up, the Panasonic puts out a really good picture but the Sammy is absolutely mind blowing. For a 50\" under 1000.00, I'm happy! The Pani is not a bad TV by any means, It's just that the Sammy is that impressive. I could not bring myself to dock a whole star for the slightly reduced PQ (Picture Quality).", "Date": "September 15, 2010"}, {"Title": "This TV is a lemon, do research before purchasing...", "Author": "Joseph D. Kumzak", "ReviewID": "R2YOC9DL7BT7BF", "Overall": "1.0", "Content": "I purchased this TV from the BX on Kadena Air Base last week, have had it set-up for 5 days and it's already dead!  My wife and I were very happy with the picture and quality.  Today my wife went to turn it on and it was dead!  The power button LED blinks 10 times, that's it, we can't get it to turn on.  We both immediately started researching this TV on the internet and found many people having the same problems with this line of Panasonic TV's.  It's called the blinking lights of death.  After much research, we have found severe hardware problems with this line of TV's.  We are lucky that we have only had it for less than 1 week and will be able to return it.  Most people's are dying just months after the warranty expires and essentially scrapping them because the repair costs exceed the cost of the TV.  I encourage you to research this TV before buying.  Type in the model # and blinking lights of death!  I am returning mine tomorrow.  I am sad because I was getting attached to it...", "Date": "December 6, 2010"}, {"Title": "Great buy on Panasonic 50\" TV", "Author": "marcisue \"msw333\"", "ReviewID": "R3FUQ69SZP81Q5", "Overall": "4.0", "Content": "We received the TV in a very timely manner, delivered by UPS in excellent condition.  Great buy!", "Date": "July 2, 2010"}, {"Title": "Green cast on bluray playback, graininess", "Author": "L. He", "ReviewID": "RXZAKWZVPVSFC", "Overall": "2.0", "Content": "Pros: natural looking face, not as fake as LCD. Good viewing angle. Anti-glare coating. Good price.Con: annoying green cast very prominent on blu-ray play back. The green become primary color of the back ground. If you look at the wall or back ground, the supposed white color wall becomes green, esp. night scene. Whatever color setting can't get rid of the green cast. I'm not sure if I got a defective item. Also the picture very grainy on blu-ray, let alone regular dvd up-conversion. It's supposed to very sharp and smooth on blu-ray, but if you stand close to watch it's very grainy. Also the previous reviewer's picture setting making the picture way too warm and bright. Not comfortable for eyes.Google panasonic green cast does generate some discussions, some users reports that it's not fixable. I will not recommend this tv. Considering returning it.", "Date": "July 30, 2010"}, {"Title": "Great TV for the $$", "Author": "IT_Jordan", "ReviewID": "R25TNZYB8B427", "Overall": "4.0", "Content": "This is a great quality TV for the price. In addition to free shipping and no tax from Amazon.com it made the decision easy.  The ONLY problem I have noticed thus far, is that the IR sensor for the TV is in the direct-bottom-center of the TV, further my front/center channel speaker on my surround sound blocks the sensor; minor problem, but I suggest they move the IR sensor to the left or right side.", "Date": "August 29, 2010"}, {"Title": "Good TV for the price", "Author": "gsunil", "ReviewID": "R2DIFR7KL0OX4A", "Overall": "4.0", "Content": "Good TV for the price;  however, not 3D compliant.  I guess if you wait for another couple of months you can buy one at the same price which is 3D compliant.  Well, you can never catch up with technology;  I liked the product at the price that I paid for at that time.", "Date": "June 25, 2010"}, {"Title": "Would be a perfect picture if not for the phosphor trails", "Author": "Mr Tom", "ReviewID": "RXFPLEMIX391T", "Overall": "3.0", "Content": "I purchased this TV locally. I've owned it so far for 3 days. Everything is great about it so far, except for the phosphor trails/lag. When I pan my eyes around the screen, I can see green & blue trails from the lag of the RGB pixels. Apparently each RGB pixel have their own decay/fade time. Very, very distracting. Visible with my home theater PC at 1080p or 480i, and watching my Tivo too. Seems worse with 480i. Visible in a lot of content, but mostly with white objects since they contain all RGB colors.While watching if I move my eyes from one part of the screen to the other I see a smudge of greenish/yellow/blue. NOT a very clear picture in my opinion. I would say ANY LCD TV would give a far superior picture clarity than this plasma. This is my first plasma I've owned, coming from a decent CRT widescreen tube TV. I thought plasmas were really hailed for their picture clarity/quality and are supposed to be better than LCD or other TV types. I am very disappointed about this model, as I thought I'd get great picture quality. But now I have regrets and wished I had purchased an LED LCD. I've even tried adjusting all settings too, but no change. I would return this in a heartbeat if it wasn't for the wife who would rather not, and that it almost didn't fit in the car for transport, it was very hard to get it out of the car too since it had to be transported vertically.Anyway, I'd recommend people to stay away from Plasmas altogether since they have this MAJOR FAULT of phosphor lag/trail which really distracts from the \"picture quality\" they think they're going to get from a plasma. I guess I was wrong in thinking the Panasonic NeoPDP display technology would be any better. :(", "Date": "December 2, 2010"}, {"Title": "Beware if you have to return to Amazon", "Author": "Mbna America \"itsmejs\"", "ReviewID": "R22PE2IPVGYSDK", "Overall": "2.0", "Content": "This is a nice flat screen but we had problems not only with the HDMI ports but also the cables we purchased.  We did order better quality cables but still have issues with receiving a stable connection.  When the TV would work the picture was very impressive.  We returned the TC-P50S2 for the TC-P50G25 just in case the model we received had a bad manufacturing run. The picture on the replacement set was even better and the best part is everything worked.  Back to the return. We returned the Panasonic TC-P50S2 weeks ago but Amazon stated they still haven't received. I called the carrier and was told that it was still sitting on their dock he believed because Amazon notified them to delay the return. In this situation the return was going to sit another two weeks. Since I complained they told me that they would release the shipment off of their dock back to Amazon. We'll see if that happens.  I'm wondering if Amazon delays the return to delay processing of the return payment?  As you can tell I'm more upset at Amazon concerning the delay of my return than having to return this TV.", "Date": "November 2, 2010"}, {"Title": "Very Good, but", "Author": "W. freeman", "ReviewID": "R18Y2O1T9NTYYC", "Overall": "3.0", "Content": "I got this TV because of all the hype surrounding the new Panasonic line of Plasma TV's, i use to hate them mainly because of the burn in, and most were only 720p. Upon buying this one i was leary because of the 600hz that is divided up into 60hz throughout the TV to (supposedly) reduce image judder and motion blur. Well i didnt notice much blur but the jutter is just awful and is the same as any old 60hz LCD i have seen on the market. I have been spoiled by the new 120hz motion flow on the new LCDs and must say that i just can't get use to the old style 60hz again. The picture i will say is amazing, while not as \"crisp\" as an LED, or newer LCD the black levels are just amazing and also makes for a superb gaming experience that you won't find on LCD models. So i thought i would try this out and see if i liked it or not, well yes and no, but i have to say i will probably take it back(to sears) and get the new Samsung LED 120 46 inch for a mere 189 dollars more. After seeing it in action with the motion flow and superior black levels i was saddened that this TV just didn't live up to the hype after hearing EVERYone rave about how great plasmas are. Some movies look pretty normal but some even in Hi-def have horrible lag, and it was proclaimed during fast action moments Plasma sets didn't have the judder problem, wrong. So its a personal preference i guess, if you don't care much about the increased frame rates for a smoother more realistic picture get this, if you want realism in your Blu-ray movies and HD TV get the LED's or newer LCD's. This set is superb for gamers but i only game a little, and not enough to spend over 1000 dollars on, sorry but i gotta get back to what i like.:d", "Date": "May 11, 2010"}, {"Title": "Low-end TV", "Author": "Josko A. Catipovic \"josko\"", "ReviewID": "R3VHM4FDTYSIB1", "Overall": "2.0", "Content": "This TV is becoming obsolete, but it works, has a decent picture, and we got it at a great price. Picture quality is inferior to higher-end, more expensive models, but we got the 50\" for the kid's playroom, and they are not too critical.Amazon's delivery worked great, and the TV was easy to set up.", "Date": "January 15, 2011"}, {"Title": "Sounds Bad!", "Author": "Scott Grunst", "ReviewID": "R3SOLGGNECJJUF", "Overall": "1.0", "Content": "I bought this TV as a special gift for my Dad so he could watch his favorite baseball team the Minnesota Twins in HD.He is a bit hard of hearing and has hearing aids. Because the speakers on this TV are facing backwards, he is having a hard time hearing the TV. We are trying to find some additional speakers to connect to the TV so he doesn't have to where his hearing aids watching TV. So far I have spent over $200 trying to get some additional speakers to amplify the sound. Nothing seems to work. He told me today that he like to sell this TV and buy something else. Wow, thanks Panasonic!", "Date": "September 10, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "50-inch Plasma HDTV with full 1080p HD resolution; 1080 lines of moving picture resolution\n600Hz Sub-field Drive technology for superb full-HD motion; 2,000,000:1 dynamic contrast ratio\nVIERA Image Viewer for JPEG image slideshows directly from an SD memory card\nInputs: 3 HDMI, 2 component, 2 composite, 1 digital audio output\nIncludes removable stand; measures 48 x 32.2 x 14.1 inches with stand", "Name": "Panasonic TC-P50S2 50-Inch 1080p Plasma HDTV (2010 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/51miEcrrHFL._SY300_.jpg", "ProductID": "B0036VO7WM"}}