{"Reviews": [{"Title": "Amazing TV", "Author": "B. Porter", "ReviewID": "R1R8ZA3HOV2U20", "Overall": "5.0", "Content": "I have had this TV for two weeks now.  Woohoo, I'm glad I waited!A little background... in October 2010 Amazon had this television at a substantial discount (<$4,000).  At that price, I got a tremendous TV.  I'm not sure I'd be so inclined to give it 5 stars if I paid substantially more for it.  At the end of the day, you can get a 63\" Samsung 3D Plasma for <$3,000.  You pay a couple bucks more a year in energy costs to run the plasma and have to worry about burn-in in the first 100 hours or so, but you arguably get similar or even better picture quality for less money.More background... I'm inclined toward LCDs and specifically Samsung LCDs.  I've always been scared off by potential burn-in issues on Plasmas.  I've also tried Sharp and Sony LCDs briefly and never got the same brightness or saturation out of them.  I own the  Samsung LNT5265F 52-Inch 1080p LCD HDTV.  If you read the reviews of that set, you'll find it is one of the highest rated sets out there.  I love mine.So the reason I've taken two weeks to review is that it took me that long to adjust the settings of the new 65\" so that I felt they were as good as the LNT5265FX that I have downstairs.  For a long time I was worried I wasn't going to be able to match the picture quality I had with that set for richness and naturalness of color.  The good news is that I have indeed matched it and this set delivers the same vividness and brightness to match what is arguably the best LCD set Samsung has every made.  At the end of the day, it all comes down to picture quality and if I couldn't get it as good as I have it with the 52\", I was going to be disappointed.Now the other positives... the set is incredibly thin and the screen is simply huge.  I watched Shrek in 3D and found the 3D effects worked great.  I found that depending on your settings you may experience some cross-talk, but adjusted properly it was great.  In particular, I found the dynamic motion enhancement seems to help 3D.  But I haven't experimented enough with adjusting the 3D picture quality to really say definitively.  The 2D->3D conversion works impressively well and my Comcast ESPN 3d channel worked great too.I've put it in game mode and the responsiveness seems comparable to a computer monitor (I have a Mac Mini hooked to the TV as well).If you read other online forums, you'll see other folks have had problems with uneven vertical light bands (this set is edge-lit from the top and bottom), flashlighting where portions of the screen burn brighter, warped bevels, and dead pixels.  I have one partially dead pixel, but otherwise I've had none of these problems.  If I put a very dark gray solid color screen on (easy to do with a computer) I can see some light output inconsistencies, but these disappear entirely for standard content.I also have the camera for on-board skype.  Skype app works great and you can receive calls while watching TV.  I'll caveat that the one skype session I did the remote party couldn't see me, but I'm not sure the reason.  I'm hoping there isn't an incompatible video codec with this particular camera.  For the cost though, probably would have made more sense to get a USB camera for the Mac Mini rather than bothering with Skype on the TV, though getting calls while watching is a nice feature.Overall I got what I wanted... a 3D capable 65\" set with comparable picture quality to my gold-standard 52\" Samsung LCD.Here are the settings I finally settled on for standard broadcast TV (YMMV):Backlight: 15Contrast: 90Brightness: 46Sharpness: 32Color: 46Tint: G44/R56Eco solution: offBlack tone: DarkestDynamic contrast: offGamma: 0Color space: nativeWhite balance: r-offset 24, g-offset 24 (all others 25)Flesh tone: 0Edge enhancement: offLed motion plus: offColor tone: warm2Digital noise filter: lowMpeg noise filter: mediumFilm mode: auto2Auto motion plus: offSmart led: standardHope this helps!", "Date": "January 11, 2011"}, {"Title": "Did not meet expectations", "Author": "Amazon shopper \"rk4321\"", "ReviewID": "R1QNZ8M4AQZT9U", "Overall": "3.0", "Content": "I've been purchasing LCD televisions for many years.  I have an old Sharp LC65D93U that I set up side by side for evaluation purposes.  I also have a Panasonic VT25 unit that I used for comparison.A major benefit of LCD over PLASMA has always been the lack of reflections arising from incident lighting.  This is my biggest beef with the Samsung, it is no better than PLASMA in this regard.  The reflections on this screen are severe.The off angle viewing has improved from older LCD generations, but it is still poor.  With a careful eye even at normal viewing distances on the large 65 inch screen, you can see these effects as you sway side to side.Defects:This is my second UN65C8000, the first had extremely bad \"flash lighting\" effects right out of the box.  The replacement had very little.  There exists on my set a small amount of spot lighting on the bottom mid-section of the screen which only becomes noticeable when watching in a completely dark room environment (visible in the black bar on the bottom when watching a widescreen movie).  A more significant defect is with something I've seen on the biggest screen sizes throughout time, banding.  It looks like someone took a dirty rag and swiped it across the screen top to bottom.  As the camera pans quickly left-right, it becomes quite noticeable especially with certain color and texture backgrounds.  Ignorance can be bliss, many people don't notice this until pointed out and I guess their superior brains just filter the defect out ... wish I weren't so caveman-like.  Eventually this defect gets worked out as the technology matures, but I'm not giving Samsung a break on this.  The banding I saw is more pronounced than it is on my past generation Sharp LCD.  And as usual Plasma's don't seem to have any of this.Some major plusses.  In side by side comparisons to a known reference (color filters etc), the Samsung's colors are much closer to true than those on my Sharp. And the contrast is significantly improved (certain shades of grey show on the Samsung were-as the Sharp can't distinguish).  The power consumption, which varies a lot depending on the video content and the settings, is around 145 watts for the Samsung, a major decrease over my Sharp which is reading 380 watts for the same content.  All the pixels are good, not one out that I could find.  Finally, the set weighs very little and is amazingly thin.  It's ideal for wall mounting, I suspect the feint spot lighting near the bottom is caused by pressure of the stand mounts on the panel.Thoughts on 3D and other special video processing options:By default, the set is configured for overly bright levels and cool un-natural tones along with a feature called \"auto motion plus\" enabled.  The result is a very fake looking picture that few would want to stick with.  To make matters worse, the motion plus setting cannot keep up with the processing demands which causes the video to skip and freeze especially where the video source is hand held and jerky (as in Modern Family).  It makes an already jerky picture very distracting to watch.  I found that this feature had to be disabled, to me it's like getting a few more horse power in your car but it sputters when you really accelerate ... I'll take smooth power (I thought the electronics were bad when I first got it, but thankfully you can turn this off and get proper video).  The set offers cool, normal, warm1 and warm2 color settings.  The warm1 option is spot on from my calibrations, though most reviewers seem to prefer warm2 ... warm2 is subdued and over saturated for my tastes.  Beyond these are many specific options that can be tweaked but I feel that one config doesn't fit all content sources, and only a few of the options make meaningful improvements.  Without a reference of what things should look like, making subtle tweaks is putting too much faith in the highly suggestive easily influenced human perception.  The 3D is effective, but I doubt anyone of quality would stand for the glasses and the considerable un-easiness that goes with watching it.  3D is by and large unpleasant though it is a great toy to play with for the time being.Build Quality:I must admit the build quality on this set is poor.  Looking closely at the unit, it has very liberal use of thin plastic and no proper restraints for cable harnessing.  The HDMI connectors are unfinished and look like they were made by hand, likely to fail if you plug/unplug too many times.  On all my other TV's I have never noticed build quality this low (brings to mind expectations of \"made in china\").The remote control is cute, but somewhat difficult to use due to the lack of button shapes to calibrate where your fingers are.  I'm not put off by it because it's not going to get much use with today's content boxes which control the real media.The access to the internet etc is a useless feature for me.  Today's content boxes are mostly enabled and I don't think the panel is the place for this stuff to live.  The speakers on the unit are fair, suitable for quick TV watching here and there.So, overall I have very mixed feelings on this unit.  The many positives are neutralized by the significant sacrifices in screen glare, banding, and minor spot lighting.  For less money you can get a plasma-TV free of defects in this size with a better overall viewing experience.  I would not recommend this set to a family member.", "Date": "January 13, 2011"}, {"Title": "Samsung still working out the 3D bugs", "Author": "Joe", "ReviewID": "R27CIV953B3819", "Overall": "2.0", "Content": "This is an exceptional 2D set with poor quality 3D capabilities.  I purchased a Samsung Blu-ray DVD and the expensive Samsung glasses.  The movie they ship with the unit was used as well and the 3D quality just wasn't there.  I was sorely disappointed with the blurred 3D image, almost as if you had not activated the glasses.  After service replaced the main board as well as the 'T-Con' board multiple times, they determined that the unit 'appears to work as intended' even though they agreed the blurred image was not right.  I unfortunately had purchased Samsung's UN55C8000 and their UN40C7000 3D TV's as well.  All have the exact same issue.  Even more disappointing than the 3D picture quality was Samsung's \"Executive Support Team\" which determined that \"we're sorry, but the unit appears to be working as designed and there's nothing we can do for you.\"For my money, I'd strongly suggest looking at other brands to determine if anyone has truly nailed 3D yet.", "Date": "February 10, 2011"}, {"Title": "Not Ready for Prime Time", "Author": "G. A. P. \"G.A.P.\"", "ReviewID": "R10NUWEEUTMMO0", "Overall": "1.0", "Content": "Very disappointed in this tv.  In their zeal to create the thinnest tv, Samsung's use of inferior edge lighting technology creates problems with uniformity of the picture that is particularly visible in darker scenes. Check out the internet reviews of this tv before buying.  The reviews almost universally confirm the banding and flashlighting problems associated with the picture quality. Considering the price, this tv fails to live up to expectations.  I'm hoping that the 2011 model (if and when Samsung announces a new 65 inch model) will have resolved some of these issues.  The 2011's will also be less expensive.  There are better choices out there in the 65-inch range if you do not feel like waitng for the 2011 Samsungs.", "Date": "December 30, 2010"}, {"Title": "I don't need to buy another TV for a long long time", "Author": "Scott Frimming", "ReviewID": "RLCWYV2I46LXD", "Overall": "5.0", "Content": "I know TVs will get bigger but I'm very happy with this at the performance and visually stunningthere will be no need to find another TVit has been a little over 2 years that I've had this TV and performs really well", "Date": "February 27, 2013"}, {"Title": "dark spots in back ground", "Author": "two-dogs", "ReviewID": "R9M5VQTLYM3V", "Overall": "2.0", "Content": "I waited for over a year for this tv and when I got it I was so excited.  Unboxed it and installed and noticed that that the screen had some darkened spots that ran vertically.  I called samsung and they sent out a tech and he told me that is just the way the tv was made.  Told me that samsung cut corners and installed inferior back lighting tubes. I will say the picture quality is superb and if it didn't have the bars it would be a great tv.  Wont buy another Samsung..............", "Date": "December 1, 2012"}, {"Title": "Smart choice", "Author": "soo kang lee", "ReviewID": "R1RN4XYEYY59MO", "Overall": "5.0", "Content": "Always love Samsung smart TV because It smart and past also colors are what we wanted it. It was a smart choice", "Date": "January 3, 2014"}, {"Title": "The most gorgeous picture I've ever seen!", "Author": "Jake the Snake", "ReviewID": "R17A0DAPF3VN01", "Overall": "5.0", "Content": "This television was expensive, but in this case you definately get what you paid for. I am not tech guru, but I'll tell you this set has the most beautiful picture I have yet to see on a television screen.  I have Directv, and the picture is so sharp with so much definition, that you'd swear it was shot in HD Video. I'm not sure if that explains it correctly, but everyone who has watched my television is amazed at the picture quality.  3D is really a novelty as far as I'm concerned, but the active shutter glasses on the set work brilliantly. 99.9% of the time I'm watching HD television snd Bluray disc. Trust me you will be very happy with this set. By the time you read this, I'm sure the price has dropped from earlier this year when I bought it.", "Date": "November 15, 2011"}, {"Title": "Great TV", "Author": "William Reinoso", "ReviewID": "R29LY6VA5F3ADM", "Overall": "4.0", "Content": "- Excellent picture quality and there is no flash-lighting.- Media Player is able to play almost all the codec's.- Multiple HDMI inputs and USB ports- The Edit Input function help a lot to use switch to desire input.- This smart TV works  perfect!!", "Date": "March 28, 2011"}, {"Title": "Finally Received it", "Author": "Paul F. Hakim \"hakim100\"", "ReviewID": "R274NEWKL0L8I3", "Overall": "2.0", "Content": "This TV has had a status of \"ships in 1-2 months\" since July. Several people who ordered it back in July have yet to receive it. Every time I call, amazon can tell me nothing more than it ships in 1-2 months.  Best buy has told customers this tv won't ship until after christmas.What is going on, has anyone received this TV recently? if you did receive it, when did you order it?Any word on why it continues to be back ordered from samsung?Are there issues with the TV, or is samsung just short on parts?So I finally received this TV in early December. Unfortunately I was one of the many people plagued by flashlighting. I had 4 round flashlights, the largest about 18 inches.  The flashlighting was very noticeable when the screen was all black with white images (during credits for example), but it was also slightly noticable during other content and very annoying.  Turning down the backlight helped this issue but did not fix it.  Amazon was more than awesome, and shipped me an exchange TV no questions asked and no charge. I also had some buckling at the corners of the bezel. Great service.As far as the TV goes, the new one I recieved has no flashlighting what so ever.  The 2d picture is outstanding after using calibrated settings (you can obtain those settings from cnet.com or hometheatre.com under the smaller un46c8000).  I previously owned the 65\" VT25 panasonic plasma, and although the plasma had a noticably better 2d picuture, you would be hard pressed to distinguish a difference unless they were right by each other.3d quality is another story.  The 3d on this TV is not that great.  It gives me eye strain, and has occasional ghosting.  The 3d quality on the pannasonic vt25 was much better.  This does not really bother me because it is still good enough, and there isn't enough 3d content right now anyway.  I think 3d on LED TV's needs some work and will improve with next years models.Form factor wise, you can't beat this TV. The bezel is silver and barily 1.5 inches wide. The TV is amazingly thin.  This TV looks just as good off as on.  Form factor of this TV stomps the panasonic vt25 which is bulky heavy and thick.Price wise, I think it is over priced. I don't think I would have paid the full retail price for this TV, $5999. I only paid $3400, which included free 3d starter kit and free 3d blu ray player.The app store and internet connectivity is awesome on this TV. It has built in netflix, vudu, blockbuster, hulu plus. Pretty much any streaming app you can think of.  It also has DLNA sharing support, and even plays the M2TS blu ray quality files I have on my network at 1080p and 5.1 surround sound.  Upgrading the firmware over the internet is easy.  The VUDU app even supports streaming trude HD 1080p movies (which isn't available with netflix or blockbuster).Although I loved the picture on the panasonic vt25, I experienced image retention the first week I owned it (the ESPN logo would stay on my TV for up to 5 mins after changning the channel), which is why I returned it and bought this.  Overall I'm happy with my choice.  The picture is pretty much as good, and I never have to worry about image retention or burn in.  I use my computer with my TV, so image retention had me worried.  Many people have experienced flashlighting with this TV (some have exchanged 3 times or more), but I believe that is why the TV was on backorder and the issue is now fixed (atleast that has been my experience).  For reference, some people have also experienced banding, every 8 or so inches. I have not seen that on the origianl or my exchange.FYI my original un65c8000 was built in mexico and required a firmware upgrade when I recieved it. The new one I recieved was built in canada and came with the most recent firmware.  It is version GA01. So I believe my exchange came from a newer batch.", "Date": "October 25, 2010"}, {"Title": "If you love films, stay away from this TV", "Author": "M", "ReviewID": "R1I2BI0J1B9F7F", "Overall": "1.0", "Content": "This TV is great for watching basketball and sports, but if you like watching films, stay away.  It makes the best films look like a cheap daytime soap opera.  The subtleties of shadowing that cinematographers and directors struggle to achieve is completely lost and the picture makes people look like cardboard cutouts.  It even makes old films look like cheap terrible home made productions.  We got fooled in the store, because the clerk showed us cartoons and sports.", "Date": "April 1, 2011"}, {"Title": "DISASTER", "Author": "KAMRAN NIA", "ReviewID": "R3TMU663TZ3S6I", "Overall": "1.0", "Content": "DISASTER !! SOAP OPERA VIEW ON ALL TVS AND MOVIES PROGRAMS, LIKE WATHCING  DOCUMENTARIES.  SPOKE TO SHARP CUSTOMER SERVICE MELINA  SUPERVISOR EMP ID 82113 AND SHE SAID TO HAVE OUR 65\" TAKEN OFF THE WALL  ($500 SERVICE CALL) SO A TECH COULD  COME AND  CHECK IT.  WHAT, REMOVE A 65\" BRAND NEW TV WHEN THIS IS JUST THE  QUALITY OF THE PICTURE.  DEANNA IN  CUSTOMER SERVICE SAID, YOU SHOULD HAVE CALLED SAMSUNG TO SEE IF IT WAS A SOAP OPERA  VIEW  BEFORE YOU  PURCHASED IT.  I  ACTUALLY ASKED IF IT WAS AND THE DEALER SAID  NO SAMSUNG SAYS NO AND THE DISPLAY TVS DID NOT LOOK LIKE THIS,THE WORST CUSTOMER SERVICE, THE INSTALLATION AND TV  HAVE COST ME CLOSE TO $7000  AND THAT IS THEIR ANSWER!!  FILMAKERS NEVER  WANTED YYOU WATCHING A SOAP  OPERA.  DO NOT BUY THESE TVS  UNTIL THEY FIX THIS AND STAY AWAY FROM FROM SAMSUNG'S HORRIBLE RIDICULOUS CSTOMER SERVICE.", "Date": "January 14, 2012"}, {"Title": "This TV is awesome!!!", "Author": "Homemaker", "ReviewID": "R922BG4KUB5YI", "Overall": "5.0", "Content": "Have had it a week and it is really wonderful.  I believe the problem with back order was because people learned you can turn ANYTHING into 2D and 3D with the click of a button and the 3D glasses.  We love this set.", "Date": "December 29, 2010"}, {"Title": "Awesome", "Author": "Grimmolt", "ReviewID": "RBNE2JB449IGJ", "Overall": "5.0", "Content": "Dude if you don't got one... well then you don't have 5 grand to get it lol. It's amazing what watching a movie on a tv like this does to you... it basically ruins your life forever... you can no longer watch a normal tv and be satisfied. :(", "Date": "January 18, 2011"}, {"Title": "Still waiting", "Author": "Nasi Nas", "ReviewID": "R1GW2XP0K4PALM", "Overall": "4.0", "Content": "Ordered my television on the 9th of October andstill waiting hopefully will get it soon now that amazon is saying it's FINALLY in stock", "Date": "December 9, 2010"}], "ProductInfo": {"Price": "$5,999.99", "Features": "ConnectShare Movie\n4 HDMI (ver 1.4), HDMI-CEC\nUltra Clear Panel Technoloty\nPin-Point Dimming\nSkype on Samsung TV", "Name": "Samsung UN65C8000 65-Inch 1080p 240 Hz LED 3D HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51KCUc90wSL._SX300_.jpg", "ProductID": "B003CFAPGO"}}