{"Reviews": [{"Title": "Great picture but ...", "Author": "aznpoet", "ReviewID": "R57433NC4O6ZY", "Overall": "4.0", "Content": "I got it at a great price under $500.  The picture quality is as good as units costing a lot more.  It doesn't have 120hz refresh rate or LED backlight at this price point but I don't play a lot of video games; therefore, high refresh rate isn't a must and the advantanges of LED is not that significant enough (100,000 hrs. LED life-span vs. 15,000 hrs. for fluorescent light source) to justify higher cost.  It is well-built and looks stylish. Full 1080p HD resolution - awesome!My only beef with this model is that it does not have audio output for use with headphones - only the digital output, which is totally useless. Still, for what I paid and considering the picture quality, it's not a deal breaker.Highly recommended!", "Date": "December 1, 2010"}, {"Title": "Good Decision", "Author": "Mark Losasso", "ReviewID": "R29XNWQBXP92EX", "Overall": "4.0", "Content": "After much research, I decided to purchase this TV and am happy with my decision. I previously owned a Toshiba set (http://www.amazon.com/Toshiba-26HF85-Widescreen-HD-Ready-Screen/dp/B000816XK2) that I was very happy with, but was looking for something with HDMI support to hook up my Apple TV. I took stock of what components needed to hook up to the set and with what types of connections (Wii with a component connection, iPhone/iPod with a composite connection, Apple TV with an HDMI connection, and a Blu-Ray player with another HDMI connection). I also had a space requirement that this set fit into perfectly, giving me the largest viewable area in the space I had available.Once I turned the TV on with basic cable, I was not that impressed with the picture quality. After a few minutes and getting all the connections set, I found that HD content looked great, especially at 1080p coming from the Blu-Ray player.I have resisted hooking the TV up to my old receiver (though it does have the inputs available to do so) and surround sound system to get a sense of the audio from the TV alone, and so far, so good.For the price, this is a good set. I have only had it for a week or more, so cannot review the longer term performance, but at this point, I am quite satisfied.", "Date": "October 13, 2010"}, {"Title": "Good value for decent TV", "Author": "Philip H. Tong", "ReviewID": "RBZPLM1JSYRV4", "Overall": "4.0", "Content": "This toshiba is a great TV for someone who has never owned an HDTV or just needs an extra TV. But if you compare this to Samsung and Sony, then this TV gets blown away. The remote feels cheap. The options on the TV are limited.But the picture quality is fantastic. I use it to watch netflix from my ps3, play ps3 games, and watch TV sports. All look great.The audio levels are fine, I'm not sure what the other reviewer is complaining about. I've had this TV for 2 months now and no problems so far.Summary: if you are want a no frills HDTV that gives good picture quality, at a good price, this is for you. But if you want more, look elsewhere.", "Date": "December 29, 2010"}, {"Title": "***UNBELIEVABLE*** picture quality!!! Looks better than TVs at twice the price or more!", "Author": "Robert Marriott \"a reviewer\"", "ReviewID": "R1U490117N1EEZ", "Overall": "5.0", "Content": "This is my first HDTV, and although I do have some \"HD\" computer monitors, they're nothing close to this experience. With an HD source, the picture is so clear it looks like you could walk through the screen and into the scene.At first I couldn't decide between LCD and plasma. After reading a lot of pro-plasma reviews, I figured the 1080p LCD would look pixelated and the plasma would look more dynamic and realistic even if only at 720p. Boy was I ever wrong!!!I was considering the Toshiba 37\" 1080p LCD and the Samsung 42\" 720p Plasma. Although reviews were raving over the Samsung's picture quality, people seemed to think the Toshiba was better quality, so I ordered the 37\" Toshiba. When I got to the store, however, I ended up paying the few extra dollars to get the 40\" after falling in love with it. The 37\" has the same quality, just smaller.They had the Samsung 42\" 720p plasma there, and while it was a decent TV in it's own right, the Toshiba just blew it away. The pixels (if that's what they are) on the plasma were clearly visible; whereas, I couldn't see ANY pixels at all on the Toshiba LCD!Games, particularly GTA IV for XBOX 360, at full HD resolution are beyond belief after playing them on an old 20\" CRT TV.Bottom line:I can't recommend this TV enough. Most of the reviews for the Toshiba 200 series LCDs -- as positive as they are -- understate the picture quality. It's that impressive! Plus, the unit looks and feels like a quality product. The worst things people can say are minor items like the lack of headphone jack or a silly mute button on the controller, which you can easily replace with a universal remote if you don't like it. No significant quality-related issues. Compare that the Samsung or other competitor TVs that have buzzing audio problems and don't even include the correct base and screws for the unit. Go with Toshiba!", "Date": "November 27, 2010"}, {"Title": "Great except for some annoyances", "Author": "ApeDrape", "ReviewID": "R24HXSRAD7FV03", "Overall": "4.0", "Content": "I like the picture quality of the TV.  A couple problems though:1) While watching netflix on xbox 360 if I back out of a movie or stop a movie while streaming I lose HDMI signal!  I have to cycle to a different HDMI (eg HDMI 2) signal, wait a couple seconds, then cycle back to my original input (HDMI 1).  Very annoying!2: Sound quality is a little sporadic.  A shotgun sound in Modern warfare 2 sounds pretty awful and crackly.  I need a sound system, but I expected the tv not to sound so awful at certain sounds.Otherwise the tv works great looks great.  Just some annoyances.", "Date": "November 1, 2010"}, {"Title": "An excellent TV", "Author": "J. Wilson", "ReviewID": "REPRKS6TH6SZJ", "Overall": "5.0", "Content": "I'll keep this one short and sweet. Ive had this TV for several weeks now, and couldn't be happier.The picture is awesome. Our other TV is a Sony 40 inch, which is another highly rated LCD, and I made my own comparison by watching a Stanley Cup Hockey game on both TV's and could not tell any difference. A Hockey game broadcast in HD is a very good test for your TV's clarity, and this Toshiba did not disappoint.The dynamic aspect ratio works great.The fact that Toshiba doesn't publish the contrast ratio should not be a deterrent for getting this TV. Contrast ratio is a marketing gimmick, and the determination should be that if you look at the picture, and it looks great to your eyes, who cares what the actual contrast ratio is? The blacks look black, and the whites look white, and there isn't much more to worry about.Good price for a great TV", "Date": "January 10, 2011"}, {"Title": "Decent TV", "Author": "Gerald", "ReviewID": "R1Q1Z7IP6IET29", "Overall": "3.0", "Content": "The TV case is beautiful and shiny like most other LCD's. The picture is not bad but not as good as I had hoped. The HD channels come in very nice and clear. The standard definition channels though were a little fuzzy. I played with the settings and got a pretty good picture in SD but wasn't satisfied. The colors were pretty nice but the black levels just weren't black enough.The sound was about standard for LCD's. The menu screen was a little complicated but managable.I ended up returning it and took a chance on the TCL brand 40 inch, which had a much nicer picture and was about $80 less. The only problem with the TCL TV is that there are no universal remote codes for it.Overall, the Toshiba 40E200U 40-Inch is not a bad TV for the price, but I think there are better options.", "Date": "December 27, 2010"}, {"Title": "Such a deal...", "Author": "Erin", "ReviewID": "R1WNGDVNXPWGSS", "Overall": "5.0", "Content": "I did a lot of research before I chose my first television and let me tell you the amount of information to digest was overwhelming. But after narrowing it down to just 2 possibles, I felt like the Toshiba was for me. I then took the plunge and ordered it with Amazon's 24-month no interest plan, which was a great deal. I had the television at my door step in 5 days I think.I'll be honest, I don't know much about all of the bells and whistles that come with new televisions but the Toshiba 40E200U is perfect for me. It has a great picture in both standard definition and HD. The sound is crisp and the look is sleek. A perfect choice for my narrow living room. As soon as I read the manual and learn about all of the fun features I'll add something new to this review.Overall for me a winner!!!!", "Date": "December 13, 2010"}, {"Title": "Fantastically crisp picture.  Very impressed.", "Author": "D. Griffin", "ReviewID": "R2DI9YC0TM807Z", "Overall": "5.0", "Content": "I picked this up for $399 during a pre-Christmas sale.  Couldn't be more impressed!  The 1080p picture is beautiful and even things like Wii look amazing.Tiny Nit-picks:Can't create custom names for the inputs.Only one coax input.", "Date": "December 28, 2010"}, {"Title": "Excellent HDTV!", "Author": "John Morgan", "ReviewID": "RTDZQIUIT8ET", "Overall": "5.0", "Content": "Toshiba 40E200U 40-Inch 1080p LCD HDTV (Black Gloss)This HDTV meets all of my requirements, and then some, for an excellent set.  No, it's not .33\" thin, it's not 3D, it's not LED and it's not a zillion Hz.  What it IS, is a basic, attractively finished HDTV that does everything very, very well and with careful shopping, can be had for a very good price. I love how simple and easy the setup is with it!  Had it out of the (excellent!) shipping packaging, base installed, hooked up to my existing entertainment center and digital cable, and setup program run in less that 15 minutes. No hassles, and everything very straightforward and easy.The picture: I've simply not seen better.  To me, it's as good or better than any Bravia or Samsung I've ever seen.The sound: Nothing to write home to mama about, but as good as any HDTV I've ever heard and better than most.  Now, when playing through my 1000-watt Yamaha receiver and Klipsch speakers.... well, it's theater-quality at that point!Connectivity: Four, count 'em, four HDMI inputs, plus every other kind you can think of, with the exception of an analog-out for headphones.  Big deal, I just use the one on my Yamaha receiver.Let's see, picture great, sound just fine, great connectivity... Hey, that's all I care about on a TV!  Hence, the five stars.My sister is looking for her first HDTV, and I've recommended this one to her.  Nuff said.", "Date": "March 25, 2011"}, {"Title": "Great Buy, Very Pleased", "Author": "JenniD", "ReviewID": "R21U9Q6LY2J5X9", "Overall": "5.0", "Content": "If you're like me, you're not at all interested in playing video games, comparing refresh rates, pixels, or any of that stuff. I just wanted a good television for my bedroom, specifically one that hangs on the wall. I was very impressed with the quality of the picture, and while I saw that other reviews were complaining about the sound quality, I don't have any issues with it. I bought this TV for watching \"my shows\" and the occasional DVD, and I'm highly satisfied with the quality for the price. The one bad thing is, my order came in the factory box without an outer carton to protect it, and the day my TV was delivered, it was raining heavily, and the FedEx driver apparently didn't shut his cargo door all the way and water got into the cargo area, and soaked the carton. I accepted the shipment anyway because I knew if it didn't work, I could send it right back. Thankfully, only about 1\" at the bottom was wet, and the TV was surrounded by styrofoam and was totally intact and dry. I think it's more the fault of FedEx than Amazon, but it's still worth noting that it wasn't in an outer carton to protect it better. Other than that, totally pleased, would definitely purchase this item again with no hesitations should I need another one.", "Date": "February 2, 2011"}, {"Title": "Does not go up to \"eleven\".....(update) UNTIL...", "Author": "John J. Gronkowski", "ReviewID": "R1BYUPYVJM8JV", "Overall": "4.0", "Content": "A great size, a nice picture and I hope that I just got one with a defective speaker because you can't put the set's volume level past ten (out of a possible sixty-three...I checked on an open hdmi channel) without getting distortion in low frequency notes or sounds.One would expect that the speakers in the set, small as they may be, would be capable of handling the audio that a TV normally encounters. I don't expect the same quality of sound that I would get out of an audio system and the treble and midrange are fine but this distortion on the low end ain't good.As I said, I may have received one with a bad speaker and may have to take advantage of the Amazon guarantee to ask for a different copy of the same set.UPDATE 2-4-11!Always check the internet to see if someone else has the same problem and if there's a solution! Just before I started to box this puppy up, I took a chance and searched the internet for the specific audio problem that I described. Lo and behold, it seems that it was a relatively common problem and that there was a firmware upgrade available from the Toshiba website. A download and following instructions and the audio is fixed. I assume that they programmed some kind of clipper into the audio output...there still isn't very much bass in the output but, when you think of it, the older CRT type tv's had a whole big box to generate resonance so they had better bass response even through the speakers are the same size and specs as those in digital flat screen sets. I'll probably find a way to add some kind of sound system to the tv eventually but it can wait...all we do is use it as a tv and don't do gaming or covet some kind of theatre quality experience so it's perfectly adequate for the time being.That being said...I hereby declare this tv to be quite nice and a good value!", "Date": "January 21, 2011"}, {"Title": "A Non-Expert Opinion", "Author": "Generic Personage \"euphoric52\"", "ReviewID": "R26O4P8HT9I5TG", "Overall": "5.0", "Content": "I own two Sony Bravias, and wanted a smaller, less expensive set for the bedroom. It arrived in perfect condition. Setup was a snap for the pedestal installation with HDMI cables for the HD input and Blu-Ray, and it immediately worked perfectly.  The picture is as good or better than my Sony flat screens, and the controls are intuitive.  The sound is in line with the original equipment from my Sony units, but in truth only four stars for the sound.  I've supplemented my other LCD's with Sony aftermarket home theater sound systems, and I might look for something like that for this one. You can spend more money on a 40 inch LCD set, but you'll need to be an expert to appreciate the quality difference.", "Date": "January 29, 2011"}, {"Title": "Very good buy", "Author": "Zachary Cochran", "ReviewID": "RBY4KX8WLR6V6", "Overall": "5.0", "Content": "I'm very pleased with this purchase. I've had good look with a variety of Toshiba products.  I'm not a fanboy by any means, but I like their stuff.  This TV is no exception.  The picture quality is quite good, plenty of inputs, and it really looks sharp.One of my favorite things so far? I love how well the thing handles scaling. Every source I've plugged in scales beautifully. I have an older DVD player but it looks just great. Standard def TV also looks quite decent, much better than other TVs I've seen. 720p sources look excellent too. This is a big deal for me, since I have a lot of standard def content still floating around, and it was a very pleasant surprise.I'm a big fan of the NBA (Go Jazz!) and the NFL (Go Colts!), and this set seems to handle motion quite well. No weird fluttery stuff going on, and no streaks or anything.It also does well with dark content. I watched The Dark Night the other day when it came on TV; looked great. Clear with distinct variation in dark scenes.In this price/size range, I can't imagine doing better for a TV.", "Date": "February 4, 2011"}, {"Title": "Perfect gift for parents", "Author": "E. Marie Logie \"EMLogie\"", "ReviewID": "R2QRAKH3VNXAQP", "Overall": "4.0", "Content": "My parents old CRT TV died and they needed a new TV for their living room.  Dad has tech skills but Mom can barely operate a remote.  Needed something to make them both happy.  My mom really liked the size and operation of the remote and switching between tv and dvd are simple.  Dad loves the picture quality, the usb port for photos and that low tech mom loves it too.  They couldn't be happier.  It's even stood up to some quickly stopped abuse from a two year old great-grandson.  It's really hard to get both my parents excited about a change in technology much less make them both happy with functionality but this fit the bill.  It was worth every penny to see the smiles on their faces.", "Date": "January 29, 2011"}, {"Title": "good for the price", "Author": "Matthew D Briscoe", "ReviewID": "R1WIQ2975JE02X", "Overall": "3.0", "Content": "The picture quality on this TV blows away my existing HDTV I've had for a couple of years.  Great for the price.  The TV has a lot of inputs and the ATSC air tuner is better than my older HDTV.My complaint is that the advertised QAM tuner doesn't really let me tune all clear QAM channels without a set top box.  I have connected this TV in exactly the same place as my other HDTV and can't tune all of the HD channels delivered over my basic cable package that my other HDTV tunes.  I am only getting 2 HD channels tuned.  I called customer service and the rep was surpised I was able to tune any HD channels without a set top box?????If you plan to purchase a digital cable or HD package that will include a set top box, you will be happy with this TV at the price point.  If you plan to use basic cable without a set top box you will be limited.", "Date": "January 13, 2011"}, {"Title": "I would recommend", "Author": "Frank", "ReviewID": "R1AD6PXJI94A56", "Overall": "5.0", "Content": "Awesome! I would recommend this hdtv. It has a great picture and is nicely made. It beats my other TV (vizio).", "Date": "November 25, 2013"}, {"Title": "This is an awesome TV !!!!!", "Author": "A. Zaharchuk", "ReviewID": "R3PB484YJ7TWGY", "Overall": "5.0", "Content": "I have had it for over a year now and it still performs flawlessly!!  Great picture!!  I like the size of it - not too big and not too small.  Overall a great purchase!", "Date": "February 24, 2013"}, {"Title": "Nice TV", "Author": "Johnnie C Cogburn", "ReviewID": "R22K91AAM2PYOA", "Overall": "4.0", "Content": "We have had this TV for a good while now , and have overall been satisfied with it . My only pet peeves are the remote control .... when you first turn it on , the remote wont work unless you are closer than five feet . After a few minutes , it \"warms up\" and will work normally , from across the room . We tried changing the batteries to no avail. Also , the mute button has a 1/2 mute , so you have to press it twice to completly mute the sound .", "Date": "November 28, 2012"}, {"Title": "Too Much TV - Never", "Author": "Beach Baby", "ReviewID": "R14AFKTQV0TZUF", "Overall": "5.0", "Content": "This is the perfect TV for our bedroom.  Toshiba has always done well for us withour electronics - just another reason for making this purchase.  Picture is incredible, it's easy to mount and we've had it on a stand as well.  Absolutely no complaints.  Actually bought a smaller one for the guest room too!", "Date": "November 26, 2012"}, {"Title": "Toshiba > \"Others\"", "Author": "Henri Dormoy", "ReviewID": "R2ZVDNH3YBTK63", "Overall": "5.0", "Content": "Picture quality is great.Sound could be a little bit louder, but with a surround sound system it is perfect for gaming, movies or just watching TV.4 HDMI portsso you don't have to switch from PS3,Xbox, Blue-Ray and DVR.I also hooked up my computer to it and got a portable keyboard.Perfect sizeI recommend this TV to everyone!", "Date": "May 8, 2012"}, {"Title": "great for the money", "Author": "Wayne Neill", "ReviewID": "R3G35EV6TZL6BR", "Overall": "5.0", "Content": "Great for the money picture is fine and so is sound. Bought warranty from square trade and still cheaper than regular stores.", "Date": "February 15, 2012"}, {"Title": "Great TV", "Author": "Lucky \"Casey\"", "ReviewID": "RWY4YQ3HZPMYT", "Overall": "5.0", "Content": "I've owned this TV for about 1 year now. This TV has excellent color scheme, excellent volume quality, and excellent picture quality. Blu-ray movies come in great, as well as low def. channels. I bought it from Amazon for a great price. I have a felling it will last me quite awhile.", "Date": "January 20, 2012"}, {"Title": "Jack Spicer review", "Author": "John A. Spicer \"Music Lover\"", "ReviewID": "ROC55YBYWB3GX", "Overall": "5.0", "Content": "This is my first flatscreen tv and I was concerned that the small speakers would sound tinny. But the sound is as good as my old 45\" crt rear projector, and it will play loud without additional amplification.  You won't need an a/v/ receiver unless you have a surround-sound system. The picture is as good as the source provided and I'm very satisfied with this purchase. This Toshiba tv was a steal at the under $500 price I paid for it brand new.", "Date": "May 26, 2011"}, {"Title": "Great Picture for the Money", "Author": "t.g. randini", "ReviewID": "ROBUH9THOCGBE", "Overall": "4.0", "Content": "Although the options on this TV are somewhat limited, the quality of the picture is truly outstanding, whether movie content, sports or other programming.  The audio quality isn't quite up to the picture quality but we've enhanced it with other speakers.The finish is attractive and we're quite satisfied overall with the aesthetics.Excellent value for the money.", "Date": "April 21, 2011"}, {"Title": "Excellent picture and excellent value", "Author": "mvdljca", "ReviewID": "R1TRMLBAMCZHD6", "Overall": "4.0", "Content": "This 40-inch Toshiba LCD is perfect for a medium sized room where you're sitting 10-15 feet away from the set.  The picture is great right out of the box, but I've experienced a little rattle in the sound on occasion, which I have yet to troubleshoot.  One thing you get with this LCD that you really want to have is 3 hdmi inputs.  I have Direct TV, my DVD player and a Roku player all plugged in, and just switch back and forth by changing the input.  No jumping around monkeying with cables.  If you're in the market for an LCD in this size range, you found it.", "Date": "April 7, 2011"}, {"Title": "Great TV", "Author": "sammi", "ReviewID": "RC19USABMZH6P", "Overall": "5.0", "Content": "I wasn't sure about buying a Tv on the internet, but i read all the reviews on this tv and decided to try it. It shipped super fast which was a great surprise. Setting it up was easy, from the box to all the hookups it only took about 10 minutes.  The picture is just beautiful and it is so easy to use. The HD looks better than i could have imagined. The sound is just right.  We have not had a single issue with this tv and i would recomend it to everyone.", "Date": "April 6, 2011"}, {"Title": "nice tv for the price", "Author": "teamweitzman", "ReviewID": "R2YCXSZKL0PYWV", "Overall": "3.0", "Content": "For $450 this is a solid tv. The colors are vivid and blacks and whites display very well. But, being that it's 60 hertz, scenes with a lot of movement looked digitized. Other than that, an excellent tv. The sound is average, but I wouldn't think there are many flat screen tv's with impressive built in speakers. Overall the tv was easy to use. I did end up returning it and buying a 42\" vizio that is 120 hertz. It looks way better and was only $100 more.", "Date": "March 24, 2011"}, {"Title": "Toshiba 40E200U 40-Inch 1080p LCD HDTV (Black Gloss)", "Author": "Gerardo Espinoza", "ReviewID": "RGQK88R5K552P", "Overall": "5.0", "Content": "I have had this TV for a short time and so far fulfills all my needs, basically this item meets my expectations in terms of Size, Image Quality, Functionality and Price.I reccomend this TV to anyone who is considering buying a TV under $500.", "Date": "March 24, 2011"}, {"Title": "Great TV Great Price", "Author": "Loren_ha", "ReviewID": "R3A7SI3KKDLF42", "Overall": "5.0", "Content": "I got this TV on sale for 430.00At40' and 1080p that was a sweet deal!The other guy who complained that it didnt register 1080p for his computer was probably using a DVI cable to connect.I hooked an HDMI up from my PC to the TV and it rendered a flawless 1080!Great for movies.  Those complaining about sound must have gotten a faulty unit.  The sound on this one is fine (for a TV).I do have my audio plugged into a small reciever with surround sound it it works fine (for movies and my computer...the TV channels I still use the speakers because it only has a digital audio out port).Great picutre quality and easy to use options.I couldn't be happier", "Date": "March 24, 2011"}, {"Title": "New TV", "Author": "Angela K. \"wonerdous\"", "ReviewID": "R14DMUH908TKVS", "Overall": "4.0", "Content": "We ordered this TV on a Thursday night and it was here Saturday morning. The box was a tad dinged up, but other than that everything was just as planned. The TV is light-weight, which made it easier to move into the entertainment center. The picture looks great. So far we have all been enjoying our new TV.", "Date": "March 21, 2011"}, {"Title": "Excellent product", "Author": "Sidds", "ReviewID": "R169PQDMSEJRJM", "Overall": "5.0", "Content": "I was looking for a 37 in LCD TV around $300-$350 range. I compared various LCD brands (Vizio, Samsung, LG, Sony and Toshiba). At this price, most others were giving 32in while I was getting a 40in Toshiba at around $380. I have had a good experience with Toshiba products (have owned 2 Toshiba laptops before) and just assumed that Toshiba LCD TV's would be good and purchased it. This TV has exceeded expectations till date. Picture quality in HD channels is amazing. Sound is well synchronized with the picture. The controls are easy to use out of the box.Highly recommended if you are looking for good quality HDTV at a low price. All the best!", "Date": "March 20, 2011"}, {"Title": "Great picture, sound could be better for movies", "Author": "D. K. Boyd", "ReviewID": "R2PMWNPCLZCO2I", "Overall": "4.0", "Content": "We were looking for a great picture at a low price, and this tv does not disappoint.  The HD channels look AMAZING, I can't believe the difference between this and our old tv.  AMAZING.  It was simple to set up, too.HOWEVER, as some people have said, if you don't have a receiver and speakers, the sound leaves a little to be desired.  For watching tv shows, the sound through the tv speakers is just fine.  If you put in a movie or watch a movie recorded from tv, however, the sound is AWFUL.  If you turn it up loud enough to hear the dialogue, you are BLASTED with the music and sound effects, but if you keep it low enough for the music not to hurt your ears, you can't understand half of what is being said.  Very tinny and disappointing.  For the several days we were without additional sound enhancement, we found it better to just forgo the movies and watch what we had recorded of tv shows.  Watching a movie was just too frustrating.That said, we now have a receiver and speakers, and it sounds great through them.  :)LOVE the picture, LOVE the price.", "Date": "March 20, 2011"}, {"Title": "40\" TV", "Author": "Tracy R. Richardson", "ReviewID": "R218LSCGX2Z58T", "Overall": "4.0", "Content": "This is my 1st flat screen for the living room.It is of good picture size,and is pretty easy to operate.Picture is clear and sound is OK.I have not made fine adjustments to the sound yet.Overall a good buy at the $450. sale price", "Date": "March 17, 2011"}, {"Title": "Couldn't Be Happier", "Author": "Livin_it", "ReviewID": "R2L6YDWNXKA0OL", "Overall": "5.0", "Content": "I'm not a professional tech geek by any means, but I did do a ton of research and read a bizillion reviews before deciding which TV to buy. I'm not a gamer, so that was not a factor. I was simply looking for a nice reliable LCD that sounds good, looks good with easy to use features at an affordable price range under 500.00.Amazon had a one day sale on this for 439.00 free shipping and no tax that I just couldn't pass up, and I am so glad I did. It looks great and the picture quality is perfect for my needs. It was a breeze to set up and tweak all the little features to my liking. The remote is a simple design and easy to use and find it well responsive. The sound is more than adequate, loud and clear at a very low settings. I have an L shape couch and I have very large windows and I have never had any problems viewing this from any angle or any blur or reflections.Highly reccommend this TV !", "Date": "March 17, 2011"}, {"Title": "Toshiba 40 inch 1080p LCD HDTV", "Author": "Brad", "ReviewID": "R14S1W0B7R5USP", "Overall": "5.0", "Content": "Bought this item about a month ago and item still going strong. Very sharp images for a LCD. I would compare the picture quality to my 1080P 50 inch Samsung plasma. The picture settings allows correct calibration of the black tones. The black tone levels can be adjusted with a choice of 5 different levels. Toshiba did a excellent job designing this TV with such a depth of contrast choices along with picture quality configurations. A must buy!", "Date": "March 15, 2011"}, {"Title": "Excellent TV for the Price", "Author": "V. Goins \"Zombieland Rule #2 - Double Tap\"", "ReviewID": "R7NUWVZ7BSX29", "Overall": "5.0", "Content": "I had an earlier model of this TV and needed a new one, so when I received an email on this with a great price, I jumped at it.  But I would have bought it, even if it wasn't on sale.  Very easy to set up, great looking and sounding TV with plenty of HDMI inputs.  I would definitely buy this one again.", "Date": "March 14, 2011"}, {"Title": "Great TV for the price, and then some.", "Author": "Chris Amos", "ReviewID": "R3BO8PJXZ794MY", "Overall": "5.0", "Content": "Bought this for around $450 about a month ago, and couldn't be happier. HD looks great on this thing, and component video looks pretty darn good. Standard def is pretty much what I expected, but since we don't have cable service, I don't really watch much SD programming anyway. The whole 60Hz thing isn't an issue for us--I don't notice any motion blur whatsoever, even on video games. The picture is sharp and clear.The sound is passable, but the addition of a soundbar has made the experience so much better.All in all, a happy customer here.", "Date": "March 11, 2011"}, {"Title": "Great TV, Great price!", "Author": "Khood3", "ReviewID": "R1DIAPGB14DR7G", "Overall": "5.0", "Content": "I did a considerable amount of shopping around before I settled on this tv to replace my old school projection big screen that dominated an entire corner of my den. The 4 HDMI inputs & 2 RCA inputs combined with a price tag of $450 & a number of glowing Amazon reviews made the decision easy. I've had the tv up and running for about a month now & absolutely love it. I regularly ask myself why I didn't replace the old one sooner. The picture quality is great, even on channels that aren't in HD. I have it wall-mounted & I haven't had any issues with glare. I was a little concerned over some of the reviews that mentioned the sound was a little lacking, but so far, I've been quite pleased. It's such a non-issue that I haven't even hooked up my external speakers yet. I was able to get it to sync easily with my Direct TV remote - it will even change the input, so I never have to use the remote that came with the tv. I've also watched a number of sporting events & have yet to regret purchasing a 60hz model. The different theater modes are handy & instaport does make transitions between inputs very fast.Bottom line, for less than $500, you can't do better than this tv. End of story. Even priced above $500, it's still neck and neck with the competition. Is it as awesome as my dad's 48\" Samsung? Probably not. But for a third of the price & a picture that at least rivals  it, I'm a VERY happy camper.", "Date": "March 11, 2011"}, {"Title": "Great TV", "Author": "Todd", "ReviewID": "R39HHBBW97R4VM", "Overall": "5.0", "Content": "I bought this unit after months of research. I was looking for quality, cost and a reputable brand. I was very fortunate to find a used one for under $300. Buying used is always a little scary but the seller had almost perfect feedback and I figured I would give it a try. The TV arrived new in the box. The box was slightly damaged. I assume that's why it was considered \"used\" since everything else about the packaging was factory sealed original.TV looks great. The gloss black is elegant and stylish. The SD picture is better than I have seen on most and the HD is great. PS3 in 1080p is amazing. While I agree with some reviews that the blacks aren't the deepest blacks out there, I refuse to complain about it. I've seen much worse on more costly models. The VGA input works great as well. I hooked up my Toshiba laptop to it and it looked great. Those complaining about the audio need to understand that there isn't really enough room for those tiny speakers to produce anything below 250hz, meaning you're not really going to get much bass or bottom end; however, they are still plenty loud and clear. If you choose to purchase this set, I recommend that you update the firmware as soon as you can and check regularly for any other updates from Toshiba. It's a fairly simple process and keeps the set working great. By the way, the USB port on the TV is just another added cool bonus. In my opinion, this LCD TV with 1080p resolution has to be in the top 10 for price vs quality. I don't think you'll be sorry you bought it, I know I'm not.", "Date": "March 9, 2011"}, {"Title": "WOW!!!!", "Author": "Pascale \"Franan\"", "ReviewID": "R2CGATXQ181M5Q", "Overall": "5.0", "Content": "This TV is HUGE and BEAUTIFUL!! I did under-estimate the size because I got it for my bedroom, and previous Box TV took up the entire bureau for a 27\" screen. Now, this gigantic TV takes up less space since it is so thin. Love it!!", "Date": "March 9, 2011"}, {"Title": "Great buy", "Author": "Mel", "ReviewID": "R3T9CVYEC4GRZF", "Overall": "5.0", "Content": "We love this TV! And at such a great price, compared to all the retail stores, and the Toshiba website itself. Has a great picture.", "Date": "March 8, 2011"}, {"Title": "Lovely Tv, Great Price", "Author": "toecat \"carpe diem\"", "ReviewID": "R1OHPMQZNZ7M0E", "Overall": "5.0", "Content": "I've had this tv for about two weeks now. It has a been a dream to use after the initial set up with our cable box. I was worried about picture quality because I hadn't seen this tv in a store while I was shopping around. But the picture quality is bright and crisp. I love being able to change the picture size on the tv depending on what I am viewing. The game mode enhances my husbands video games on the xbox. I find the speakers to be powerful enough for our living room. They sound good too! The four HDMI ports come in real handy. I'd recommend it!", "Date": "March 5, 2011"}, {"Title": "good", "Author": "Grewupon Movies \"GM\"", "ReviewID": "R1RWUH8IWG29T5", "Overall": "4.0", "Content": "Seems like a good solid tv so far. I've owned it for a few months. It was a bit tricky getting some of the audio to work (apparently it was set on some kind of total surround 6-speak system? I don't know). But a techie friend helped me and everything's working now. The picture quality isn't the greatest I've seen, but it isn't bad either. I'd say it's about average; but then for the price, it's what you pay for.Overall, a good set. I would certainly recommend it to others.", "Date": "March 3, 2011"}, {"Title": "AWESOME PICTURE!!", "Author": "Louie Bomb", "ReviewID": "RR7J1BLI9JVOW", "Overall": "5.0", "Content": "Used a $100 credit for purchasing a PS3 through Amazon during the holidays to get this set. After having it for a month and a half, I would have even bought it without the credit. It makes a fantastic bedroom tv, although I would not use it for a living room set (it's too small for that ((that's what she said))). The darks are dark, colors are vivid and HD is incredible! I've had no issues with the volume on mine. My bedroom is relatively small so I've never had to turn it up past 15 (I believe it goes up to 50.) I couldn't be more happy with my decision.", "Date": "February 25, 2011"}, {"Title": "great tv for the price", "Author": "alcalind", "ReviewID": "R2COXD4CURZYEC", "Overall": "5.0", "Content": "Purchased this to replace a 32 inch plasma in our master bedroom.  The Toshiba is slim and the black gloss frame is classy.  Looks and works great.  Price was right; delivery was on time; set up was super easy.", "Date": "February 25, 2011"}, {"Title": "Just Amazing.", "Author": "Justin", "ReviewID": "R3IDDRJOCY8Y57", "Overall": "5.0", "Content": "This freakin tv is a dang good buy for what I got it for.Everything else was EASILY another $50-$100.TV came wonderfully.Blu-Ray looks amazing.  1080 is definitely worth your money.I'm just speechless because it's just perfect!", "Date": "February 24, 2011"}, {"Title": "Excellent TV on a Budget", "Author": "DKChick7", "ReviewID": "RKXRB0MHNVJ4Z", "Overall": "5.0", "Content": "I recently purchased this tv on the recommendation from a friend (who has the same tv at home).  I was a little apprehensive because I'd read some of the reviews and they weren't all glowing.  The only thing that brings this tv down from being all around 5-stars is the picture quality.  I don't know if it's just because it's an HDTV and I don't have HD (which it probably is), but the picture quality is a little grainy and when you change the picture size from Normal to Full or TheaterWide1 it stretches out the picture quite noticeably (only noticeable at first though).  I was also really worried about the audio because several people had mentioned this in their review, but I can't complain.  We keep the volume in the mid- to lower twenties and have no difficulty hearing it.  I just found out today that when you hit \"Mute\" the first thing it does it mute the volume halfway and then if you hit it again it mutes the volume all the way and I think this is actually a pretty nice feature to have.  Additionally, the tv was easy to set up and the menu is VERY easy to navigate.  I got the tv when it was $449.99 and I'd say it is one of the best purchases I've ever made!", "Date": "February 23, 2011"}, {"Title": "So Glad I Purchased This TV!", "Author": "Nancy J. McConaghy", "ReviewID": "R1OYV2EFDZ0419", "Overall": "5.0", "Content": "After reading many of the reviews, I decided to get this particular TV.  I absolutely love it especially with the HD.  As was previously stated in some of the reviews, the only issue (if you want to call it that), was it does tend to vibrate or buzz sometimes. This only happens once in a while and for the price I ended up paying,to me it's a non-issue.  I've had the tv since 2/7/11 and hope to have this Toshiba as long as I had my old Toshiba (27\" wide back)for about 15 yrs!!", "Date": "February 23, 2011"}, {"Title": "Great TV", "Author": "R. Haldorson", "ReviewID": "RCJCL1CNWPNGG", "Overall": "4.0", "Content": "Set up for this TV was simple, ready out of the box. The picture is so-so with my dish signal but am hoping it improves after the HD is installed. Without it the picture is not that great. I have full HD on another TV and once you have it, it is hard to view anything else. The sound is fine.....not sure what complaints are about. The price was the best I could find anywhere...thanks Amazon. Great TV for a great price.", "Date": "February 21, 2011"}, {"Title": "Great for the price - one complaint", "Author": "San Jose Reviewer", "ReviewID": "R23I0PLJC01GB4", "Overall": "4.0", "Content": "I have only one real complaint with the TV, the VGA modes supported for the VGA port make it useless for playing movies or videos from a laptop or other TV.  I was psyched about the VGA port thinking I as gonna be able to use my laptop in a fashion better than the S-Video connection with my old tube. Unfortunately at the highest supported resolutions I can only leverage 2/3 of the screen, making it a 28\" screen for computer display. Yuk.But other than that everything else is as expected and it works fine.", "Date": "February 21, 2011"}, {"Title": "Great LCD TV", "Author": "Dan Middleton", "ReviewID": "R3GM5DFZ98UUF9", "Overall": "5.0", "Content": "I was actually looking for a 37\" to go in my office. The price of this TV was too incredible to pass up. Shipping was fast, unpacking and setup was done in 5 minutes. I chose to use the included stand rather than  hang it on a wall. The quality is good and it looks nice. It is possible to turn off the Toshiba sign below the screen, but I leave mine on. The picture quality is fantastic. I made a few minor adjustments to color saturation but overall it is flawless, bright, no motion issues. Just a great TV.", "Date": "February 20, 2011"}, {"Title": "Good TV", "Author": "M. Scharnagl \"SmartMike\"", "ReviewID": "R3CMMJ1GO83YQH", "Overall": "5.0", "Content": "Picked up this TV for our bedroom. It's great. Good picture. Easy to set up. Sound is ok, but I'm not aware of an LCD that has booming sound. Great item for the price. I immediately purchased a TV Screen Protector, just in case to protect the investment. Consider getting one for yourself.TV Shield Anti-Glare \"40-42\" Flat Screen TV Protector Screen", "Date": "February 19, 2011"}, {"Title": "Absolutely Amazing LCD TV!!", "Author": "optimusxcrime", "ReviewID": "R2QYGKO94NSM8N", "Overall": "5.0", "Content": "This tv was actually the third Toshiba that I've purchased from amazon.com over the past two years. Simply put, this tv is incredible. I love this tv better than the 55\" we have here. Slick design, beautiful picture...and the sound is awesome too but I suggest you get a toslink cable and go with the digital audio out and a nice surround system. I game a lot and the tv is unbelievable with all my systems. PS3 - 360 - even the Wii looks breathtaking. I love the lighted logo and the ambient color on the bottom of the tv's bezel it looks sick!! The first one I ordered, I actually had a problem with it. The screen turned really bright white, I had to unplug it and turn it back on and afterwards I had a lot of stuck pixels. I was upset because I never had an issue with any of the other Toshiba tv's I got from amazon. But, amazon has a remarkable return policy...they sent me a brand new tv - overnight delivery, even had ups pick up the defective tv and send it back. Talk about hassle-free. First thing I did with the replacement tv was upgrade the firmware. I've been in heaven ever since. Movies and games look utterly amazing. Cable tv looks breathtaking. I highly recommend this tv to anyone who wants more bang for the buck. What a deal, 449...unbelievable. amazon.com knocked it out of the park with this one!!", "Date": "February 18, 2011"}, {"Title": "Great for the price!!", "Author": "Kevin C", "ReviewID": "R1KGZISIVNW89W", "Overall": "5.0", "Content": "I got this in a Gold Box deal and thanks to Fed Ex for screwing up the delivery I got $50 back! The TV though is great too, my 95 year old grandmother has been watching the same crappy 27 inch tube for like ten years and now she thinks the people actually look like they are in the TV, hilarious. She and my mom love it. The captions show up a lot bigger too so my grandmother can actually read what's going on better. So glad I saw it on there and bought it.", "Date": "February 16, 2011"}, {"Title": "Great bargain", "Author": "hodderhansen", "ReviewID": "R19ZR0K4JVLFY", "Overall": "5.0", "Content": "The TV does everything I want and it did not break my wallet. Other TV's at this price are either much smaller or only have a resolution of 720p. The TV shipped extremely fast. I am very satisfied.", "Date": "February 15, 2011"}, {"Title": "Love my new tv", "Author": "Hunnie", "ReviewID": "R2EFDFTYKPKC20", "Overall": "5.0", "Content": "I love my new 40\" HD LCD Toshiba! It was a great deal and I was saving for a tv anyway! I love amazon for reasons such as this!", "Date": "February 15, 2011"}, {"Title": "40e200u great tv", "Author": "SkaeGottz", "ReviewID": "R329LO2XPKBD0U", "Overall": "5.0", "Content": "Bought this for our boys to use in the basement hooked up to both xbox360 and play station 3 as well as directv hd.This is our second toshiba lcd we love this one as much as the first one we bought 2 years ago this set cannot be beat for the price.", "Date": "February 15, 2011"}, {"Title": "TOSHIBA 40 Inch 40E200U Proves Great Quality", "Author": "MAURIE", "ReviewID": "R3VE4HMRO5BOYF", "Overall": "5.0", "Content": "The Toshiba 40 inch Model 40E200U 16 x 9 HDTV passes my test to be of great quality and picture perfect when hooked up to an HDTV receiver.  I am very pleased with the purchase.  Also when using TV to watch a DVD, whether the DVD is Blue Ray or regular, the picture is perfect.", "Date": "February 14, 2011"}, {"Title": "Love it!", "Author": "Brenda Stankoski", "ReviewID": "R3U1JIQ04WVT0K", "Overall": "5.0", "Content": "This TV was the easiest thing to set up.  Love the size, the picture quality and the overall look.  Great price, too!", "Date": "February 14, 2011"}, {"Title": "Happy with purchase", "Author": "ak momma", "ReviewID": "R2LDX4ZXQ15RHS", "Overall": "5.0", "Content": "The tv was everything that the description said that it would be. I've bought many different brands and had problems with most but toshiba has always been a reliable brand name for me as far as tvs go.", "Date": "February 12, 2011"}, {"Title": "Toshiba HDTV", "Author": "avril", "ReviewID": "R2XXAWQ6P0FFA9", "Overall": "5.0", "Content": "I received this HDTV for my birthday and have enjoyed it. The picture quality is terrific and the sound is fine for me. I have it in the bedroom and it is about 9' away from viewing so it fits rather well.  I do have a problem with the remote as the buttons are not well designed and awkward, i.e.sound control, return to last station etc. They definitely need to rethink the remote.Other than that, my next adventure for this TV is to hook it up to my computer so I can watch movies and such. I do not have satelite or cable just a HD attenna and the HD picture is really good.", "Date": "February 6, 2011"}, {"Title": "great tv for the bedroom", "Author": "happyamazoner", "ReviewID": "RVHT87I382K0E", "Overall": "4.0", "Content": "Happy with my purchase.  Sleek look, light weight, clear sound and easy to use remote.  Bought the Cheetah wall mount with it and just installed it the our bedroom.  Install was easy and looks great.", "Date": "February 5, 2011"}, {"Title": "Very nice TV for the value", "Author": "Dale V.", "ReviewID": "RL07ZV4LRJODL", "Overall": "5.0", "Content": "I purchased this set and I received it fast.  Amazon.com really is awesome...I really like this TV!  The picture is impressive even with Composite connections.  Set up was quick.  I really feel like I got a great deal!  If you are looking for a decent TV for a awesome price, I'd recommend this one.", "Date": "February 3, 2011"}, {"Title": "Great picture and good features for the money", "Author": "R. Hayes", "ReviewID": "R3C1HEPVO6P57B", "Overall": "5.0", "Content": "I am a new comer to HD TV. I did a lot of research and for what I could spend (550, I paid $ 478 on amazon) this set is great. I have my own home theater setup, so the tv speakers are not an issue.( they are like all the other tv speakers, mediocore at best) The picture is great, the adjustments are good and the set up was a breeze for a novice. The HDMI hookups are plenty for me (4).The only draw back, if you count this as one, is it is slow to start. takes several seconds for the picture to come up. I won't pretend to be a know it all on HD TV, but for the money this set is great. I would reccomend it to anyone who is looking for a reasonable priced tv.", "Date": "January 31, 2011"}, {"Title": "good product", "Author": "NAO", "ReviewID": "RQ2JHZ7SQV4EW", "Overall": "4.0", "Content": "The tv is good for a bedroom, but if you want for tv room you really want a better sound...size is good, ohh i remember this tv don't have alarm....sleep time yes...but not alarm....", "Date": "February 2, 2011"}, {"Title": "Not bad TV for the money.", "Author": "Keeppuffin", "ReviewID": "R2KFZU8C4LJ8JE", "Overall": "4.0", "Content": "Got this TV about two weeks ago to replace my stolen 42\" Phillips. Shipping only took two days. TV is light, extremely easy to set up and use. Not the best picture and sound quality, but for the price, i really can`t complain. Overall, a good TV for the money.", "Date": "November 23, 2010"}, {"Title": "Back to the Future", "Author": "M. W. Park", "ReviewID": "R2L2VXTBVLVSIQ", "Overall": "2.0", "Content": "IF you told me that this TV was a 2006 model, I would've been really happy.But as a 2010 model, it leave a lot to be desired.My review is in comparison with low to mid-level models from Sony, Vizio, LG, and Samsung..First, SDTV quality is pretty poor.. So poor that you want to go outside and enjoy the sun.HD quality is pretty decent, but it's still not up to PAR.The menu is pretty confusing, and it won't remember input settings last used.  This is very annoying.  Everytime I connected my computer to the TV using HDMI, I had to setup the TV again and againg..The remote looks cheaper than the universal remote from the 99-cent store.Yes, the price is cheap, but I didn't know the TV quality will be THIS cheap.I actually returned this TV at the end and decided that I rather be outside playing in the sun than watch this low quality display.BUT!!! if this is your FIRST HDTV, you won't know the \"bad\" parts of it.. you'll simply be AMAZED...", "Date": "February 28, 2011"}, {"Title": "Nice TV but problems with technology", "Author": "LeClaire \"Travel Nut\"", "ReviewID": "R2DCTBGCHNYIUQ", "Overall": "2.0", "Content": "The TV has a good picture and the sound if very clear however, the TV goes off or pauses for 3 seconds or so then comes back on. Sometimes it happens 10 times a night other times once or twice. I have called Toshiba about it and they said my cable can't keep up.I wouldn't buy another Toshiba TV.", "Date": "March 20, 2011"}, {"Title": "Just ok", "Author": "Ben", "ReviewID": "R27T93TULBUTGN", "Overall": "2.0", "Content": "This is a pretty nice tv. At least I thought that at first.  The picture is good, colors are vibrant and true.  It has a good wide viewing angle. The sound, however, is sort of shallow and tinny even with the base turned up to full. My old 32 inch tube television makes this one sound like a transistor radio.There are two things make be give this tv a 2 star rating and in one instance make me want to return the tv.  First ... no analog audio out, no headphone jack. I should have done more home work of this.  The only audio output is digital and according to Toshiba the digital output is a pass through. You cannot control the volume of the digital audio output from the tv. That means you have to have a remote for what ever amp you want to use.  What would it have cost them?  50 cents to add a headphone jack?Second problem ... you can't use the mute button without automatically turning on closed captions. The manual says that if you want to mute the tv without turning on closed captions you need to use the volume button and set the set the sound to 0. I use the mute button a lot and to me that's the stupidest bit of programming I've ever seen.  My little country cable system is really spotty on sound volumes.  Some stations I have to run at 35 volume.  It takes a while to get it to go to 0 from 35.  I think the engineer who thought that would be a great feature should be fired.I would send this back if I could.", "Date": "July 18, 2010"}, {"Title": "Toshiba 40E200U--Poor Quality Picture and Sound", "Author": "C. Chapman", "ReviewID": "RAU21QAHT05UL", "Overall": "2.0", "Content": "I have a few other LCD TV's, including those made by Sony, Samsung, and Vizio. I purchased this one to place in our master bedroom after reading many reviews here and elsewhere, and the price was certainly right for a TV this size with the needed features. I found out real quick that at least with this purchase I got what I paid for. I was not looking for a TV that would blow me away but just wanted a solid performer with a good picture and decent sound. Unfortunately I am returning the Toshiba. The picture is by far the worst of any set in the house and the sound is mediocre at best. I have Uverse and had this set connected via HDMI and on HD channels the picture was \"grainy\". The sound, even for a LCD was below average and I should not have to spend another three bills on a sound bar for my bedroom, especially when this is not a LED.Pros:Attractive cabinetGood menu functionsCons:Picture quality not close to sets with similar specs.Sound is poor. It is hard to hear and when turned up it distorts badly.While this does not affect the TV quality, it took 8 days to receive the TV (and I am Amazon Prime).My advice is to spend a few bucks more on a Sony or Samsung or Vizio.", "Date": "February 13, 2011"}, {"Title": "Comes with non-programmable remote", "Author": "kelly", "ReviewID": "R1BKE66LICTFSS", "Overall": "2.0", "Content": "This TV is okay, but it comes with a cheap remote that can't be programmed to work with other devices, such as a DVD player.  The remote has the buttons (rew, FF, skip, etc.), but the remote is not programmable.  There were no instructions in the owner's manual on how to program the remote, so I called Toshiba and they confirmed it can't be programmed.  This is disappointing, as now I will have to have more than one remote lying around.  If I would have known this, I would have purchased a different TV.", "Date": "February 26, 2011"}, {"Title": "Save and wait", "Author": "Exquisitely Sane", "ReviewID": "R2P3LAXRC5D58P", "Overall": "3.0", "Content": "It is true that you get what you pay for. While 1080p is awesome, it really isn't totally necessary until you reach screens with the size of 50 inches and higher. With that being said, don't get wooed in by the 1080 number. If you want this unit just for some extra TV in some spare room that you would rarely watch it may be worth it to grab at the mid $400 range. If you are searching for a main TV that you will watch sports, movies, or games on then this unit IS NOT for you. They totally FAIL to mention the refresh rate, which is highly important when dealing with LED or LCD HDTVs. This unit is a mere 60Hz. Garbage! If you are looking to save money but still want a decent unit, I suggest sticking with a plasma set. If it is 42\" or less, then 720p is fine. Also, if you view a lot of cable, keep in mind that many providers only give you up to 1080i resolution. The Dish Network provides up to 1080p, but they can be prone to drop outs in bad weather situations. LEDs still have a ways to go. If they were \"all that\" then plasmas would be history by now. Choose wisely.", "Date": "January 13, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "1080P Full High-Definition Cinespeed Display\nDynalight Dynamic Backlight Control For Deep Black Levels\nPhoto Frame Capability & Mp3 Playback Via Usb\nGaming Mode For Fast Game Controller Response\n40-inch LCD HDTV with Full 1080p HD resolution; slimming tapered bezel and attractive front panel Horizon design gradation\nDynaLight backlight control adjusts for deeper black levels for higher dynamic contrast and more realistic picture\nIncludes removable stand; measures 39.12 x 27.37 x 11.61 inches with stand\nInputs: 4 HDMI, 1 component, 2 composite, 1 PC, 1 USB, 1 optical digital audio output\nPhoto Frame capability for showing off your digital photo slideshows; USB connection for playing MP3 digital audio", "Name": "Toshiba 40E200U 40-Inch 1080p LCD HDTV (Black Gloss)", "ImgURL": "http://ecx.images-amazon.com/images/I/415SGLDXqnL._SY300_.jpg", "ProductID": "B0038JED7Q"}}