{"Reviews": [{"Title": "Great TV", "Author": "Raymond G. Abdalla", "ReviewID": "RXAU1TQP3NBZ6", "Overall": "5.0", "Content": "I've had this TV almost a week and like it more everyday.Bought it from Best Buy for $680 with free delivery and set up.When the delivery guys set it up, thye told me that in order to getthe picture that I saw in the showroom, that I had to switch outmy Direct TV receiver and dish to HD. Called Direct TV and had the HDdish and receiver installed. Boy, what a difference. I can't getover how great the picture is, and you can't beat the price. I playedBB against HHGregg, and they both fell over each other trying to get the sale.It listed for $800 at both places, but I got it for $680. I've read aboutbuzzing noise complaints, but I have not had this problem. This is the 2010version of this model. I'm a happy camper.", "Date": "March 19, 2010"}, {"Title": "Good TV for the price", "Author": "ALDO MARQUEZ", "ReviewID": "R1S08IKGL0ODWH", "Overall": "4.0", "Content": "Good TV for the price, but in SD the picture is not so good depending on the signal being used. When using Blu Ray (Panasonic BD60), images are excellent and the differences between Full HD and HD are imperceptible, as the Blu Ray does a good job in converting to 1080p. I calibrated the TV with Datacolor Spyder3TV with completely dark environment (night) the software generated the following results after more than 100 hours of use: Brightness: 60; Contrast: 82; color: 78; Tint: 1 Temperature: Warm; Sharpness 0.", "Date": "June 26, 2010"}, {"Title": "Decent TV but you get what you pay for sometimes.", "Author": "Moe Sizzlac \"Moe Sizzlac\"", "ReviewID": "R1AW59CPMV2L56", "Overall": "3.0", "Content": "Bought this TV because of the price and the reviews of the older generation model.  For the most part I am very happy with this machine.  My biggest concern is that several times a minute, the screen dims and brightens on its' own, which gets extremely annoying.  I called up Panasonic.  Their answer was basically, \"We know about the problem but unfortunately there is no solution at this moment.  Our engineers are working on it.  Here is your case number.  For now, make sure CATS is off and that you are watching the TV on \"Cinema\" setting and that should minimize the annoyance.\"  They don't know when they'll have a solution nor can they inform me when one is available.  If anyone else out there noticed this problem, please feel free to voice your opinion as well.  I'm a little upset because if I had known this ahead of time, I would have held off on buying this TV until a solution was found.", "Date": "April 25, 2010"}, {"Title": "medium quality trumped by great price and big screen", "Author": "Js Banks \"Retired at Last\"", "ReviewID": "R3DOXDQQT123KW", "Overall": "4.0", "Content": "Some reviews downgrade a product because of the high price. I have always thought one should review the product, not the price. and yet here I am UPGRADING from 3 stars to 4 based on the price. So I'm inconsistent. This set is such a value I purchased it from Amazon after about 5 minutes of soul searching; wallet searching was unnecessary.I took no chances and ran it at low contrast for at least 100 hours.If you calibrate for best black level, which is surprisingly good, your picture is too dim.If you calibrate for most accurate color, toning down the over-driven colors ,the picture is anemic.If the lighting is wrong, screen reflections are almost mirror-like.There is banding and overscan.And yet... 4 Stars!  This is a tremendous value for the money. Do not buy if you are a fanatic about specs, or watch in an uncurtained loft or solarium.I find that once I calibrate to the best the set can offer, and then deviate to taste, I forget all that stuff and just enjoy a 50\" plasma for a price that is 1/3 the price of Panasonic's top model. Reflections? I have curtains, moved the lamps a little, and angled the set down. I also find that I can \"mentally edit\"the remaining reflections out during dark scenes. Color accuracy? Might bother me if I were watching 2 sets next to each other, but most people can recalibrate in their head. works for me.When calibrating, the set can remember different settings for different pictures. Always set at \"warm\" I then use \"Standard\" for my daylight viewing, \"Custom\" for evening with room lights on, and \"Cinema\" for an almost dark room.I calibrated using the Spears & Munsil Bluray disk as a starting point only. I was going to give you all 3 calibrations, but then I deviated so much from them to compensate for my tastes that I believe you should just wing it yourself.I've had the set a couple of months now, and am more pleased, not less. A big 50 inch screen with OK picture quality is better than my previous 40 incher with great PQ... at least for the likes of me. Decide for yourself, of course.Update a year and a half later: set continues reliable. Took some cardboard and hung it on the bottom rim angled out toward viewer which improved the sound from the tiny, downward-firing speakers 100%, from terrible to just poor. Painted these little diy acoustic reflectors black and they are invisible. Materials needed: cardboard, tape, paint.Update: got a sound bar. Better. TV still going strong in 2013, but it is time for a 65\" VT60.", "Date": "August 25, 2010"}, {"Title": "Great deal/price for a quality television", "Author": "Brass Monkey", "ReviewID": "R1SDPF2G4XESPQ", "Overall": "4.0", "Content": "I originally bought this television through Target.com (twice before finally sucking it up and hauling it home myself from a local Target store.  Screen arrived smashed from both deliveries so if you can buy locally, that may just be your best option).  I'm certainly not an expert on what makes one television better then another but I can say that the television looks nice, was a breeze to set up (I did require the assistance of two strong men to help me with the lifting so I could have it mounted properly to it's stand) and I think the picture quality is very nice.  50\" was a whole lot more television then I had expected and people are always surprised to learn how little I spent on it.  The only thing I don't like is the super glossy/reflective screen.  It looks sharp but if you have any opposing windows or lights, you get nothing but reflection.  I'm not one who is typically bothered by a little bit of a glare but it's really excessive - even dim lights pose a nuisance.  Overall, can't beat the price - great buy.:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::Update::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::Well I've owned this television for close to a year now and thought I'd share how I'm feeling about it today.  I still think this was an amazing buy.  House guests continue to comment on my television and are blown away at how little I actually paid for it.  The image quality is excellent and my one roommate showed me how I could have images displayed across the entire screen (this is why it's great living with guys) - I had no idea I had only been using a small portion of the screen.  Although I'm still not 'tele tech savvy' I can say that one thing I wish this television came with were additional HDMI ports.  This television only comes with 2 and I really wish it came with at least three.  What 2 HDMI ports means to me is that one port is continuously in use by my cable box and the other has to be shared between myself and my roommates (I use the second port for my AppleTV and my roommates use it for their PlayStation).  It's a minor inconvenience to say the least as we just need to take turns to unplug/plug in our devices, but not a deal breaker by any means.  I'm still extremely happy with my purchase and would recommend this to friends and family.", "Date": "October 10, 2010"}, {"Title": "Good TV", "Author": "Maria", "ReviewID": "R18H2OTVD4UH2C", "Overall": "4.0", "Content": "Have had this TV about 6 weeks. It is a warranty replacement for an Insignia 50\" plasma that was displaying a degraded image. I agree with most of the 4/5 star reviews here. Good TV, great picture, sound is so-so (but a little better than the Insignia it replaced). Looks good, there is screen glare but it is rarely a distraction. So all the positives already mentioned I can second. There are negatives. Here are the two you might want to consider: 1) Very slow remote response time... push a button and wait... wait.... It's not like IR remote tech is new. It's almost like Panasonic throttled the response time, maybe because it is lower end. 2) Audio out is optical cable only. No RCA jacks.For most people the following will likely be insignificant: A) While some find the menu to be easy to use, I find there are too many sub-menus. You really have to drill down to get to some options. B) My biggest peeve... no OS program guide! I'm over the air only. With my Insignia I hit one button and there was a guide for all the channels in my line-up. Highlight a channel and there was that channels line up for the next 4-8 hours. C) In the same vein, when you hit the \"info\" button you get the name of the program. That's it. No description (like on the Insignia). And D) the favorite channel button doesn't cycle through your favorite channels.Overall, great picture, especially for the price. Viewing from more than 6 ft from the screen I (or you) won't see any difference compared to 1080.", "Date": "January 12, 2011"}, {"Title": "Great tv", "Author": "Chris B.", "ReviewID": "R30I4WGIFAKOQ0", "Overall": "5.0", "Content": "Bought this tv as my first plasma about a week ago (my other tv is an lcd) and I have nothing but good things to say about it so far.  Picture quality is great with blu-ray, from 6 ft away from the tv I don't see the point in paying more for the 1080. No motion blur or color problems so far, looks amazing! Speakers on the TV are decent, but if you will be watching movies or really want a good experience i'd recommend an external speaker setup.  I have had no problems with the tv dimming or anything like some of the other reviews.  The TV does get a bit of glare, but with the blinds closed I haven't had any problems watching movies so far.  I wouldn't pay the $799 MSRP on this tv, I bought mine on sale and would recommend anyone to wait until it is on sale to buy it if you're looking for a great entry-level plasma :)", "Date": "November 25, 2010"}, {"Title": "wonderful tv", "Author": "H. Chen", "ReviewID": "R2RP00RUF5BDAM", "Overall": "5.0", "Content": "This tv has newer technology that automatically adjusts brightness based on a room's lighting ( but if you don't like this feature, you can always turn it off). The colors are amazing. Great TV for a great price. :)", "Date": "May 16, 2010"}, {"Title": "someone dail 911", "Author": "spencer russell", "ReviewID": "R38EZ45QMKDXTP", "Overall": "5.0", "Content": "This is really a steal for the quality of this tv. I received this tv within a week of purchasing it, to my surprise. The picture quality is A+. No complaints here", "Date": "June 28, 2010"}, {"Title": "Great TV, just don't buy from MODIA", "Author": "R. Harkins", "ReviewID": "R1KRNMSPY5T7FV", "Overall": "5.0", "Content": "Could not be happier with TV.  Great picture compared to others which are much more expensive without that much of an improvement in picture quality.  My only regret was the merchant I purchase my TV from.  I bought my TV from MODIA because the night I ordered it they had the best price, the next day I found it for $100.99 cheaper.  I immediatlly emailed MODIA to ask if they would price match since it was to late to cancel.  Six days later I finally got a reply saying they do not price match and guaranteed all merchants were selling the TV for the same price.  They must think I am a moron.  Anyway, when asked to provide seller feedback I did and gave MODIA 2 stars.  MODIA then made 2 phone calls to me requesting I remove the negative feedback which I agreed to do in exchange for a store credit, it's been a week and have not recieved a thing from MODIA.  J & R Music allows 30 days for a price match and I am sure many other merchants do as well.  Amazon has had the TV listed for $599.99 since I bought mine also.  Great TV, just watch who you buy from, certainly not MODIA.P.S.  I had to write about MODIA in this review because once you remove seller feedback for any reason you cannot repost it even if they do not live up to their end of the deal.", "Date": "January 20, 2011"}, {"Title": "Solid, reliable, inexpensive TV with decent 720p picture", "Author": "Sajid Ansari", "ReviewID": "RX6ZMIBVYMU42", "Overall": "4.0", "Content": "Few would consider a 50\" TV as a secondary TV, but for those who do, this is the perfect TV for you.  The picture isn't going to blow you away and it has noticeable flaws in the darker tones and refresh rates, but if you're looking for a clean, solid picture at a great price, you're going to get it with this Panasonic.  You're also going to get a TV that's got a decent set of features and is easy to use with universal remotes, thanks to a fairly intelligent user interface.  It is easy to quickly and accurately switch inputs, and set up more advanced features like auto-dimming when the ambient light goes dark.  The location of all the input ports, and number of HDMI ports makes connectivity very simple and complete.  If picture quality is secondary to size, you'll probably want to go 720p vs 1080p, and at $599 with free delivery and no sales tax, it was a ridiculous bargain and one that cannot be matched.", "Date": "January 25, 2011"}, {"Title": "Best bang for your buck.", "Author": "M. Whitfield", "ReviewID": "R2GZ70VDVPOLZS", "Overall": "4.0", "Content": "I wasn't really sure what to expect out of this tv, I was unsure of this tv basically because of the low price. This is my first plasma television and I know this is Panasonics entry level tv, but I was pleasantly surprised at the image on this set.Is it the best picture out there? No, but it is a good picture, I mean I paid $650.00 for this tv and it is the best one I have ever owned. I just recently added a Sony S570 blu ray player and I can say I am happy with what I have. Again not the best out there, but does a good job. My only knock on this tv is the sound, its very tinny sounding, but I have it hooked up to my home theater so that problem is taken care of. If you are not looking to spend a lot of money and want a big tv with a good picture pick this tv up. If you are a videophile you would be better offwith one of the upper tier models.", "Date": "December 31, 2010"}, {"Title": "Awesome", "Author": "mike king", "ReviewID": "R14U40B8T9CTVR", "Overall": "5.0", "Content": "I received this tv a couple of weeks ago. It seems I am never truly happy with anything and I figured this Plasma tv would be no different. I absolutely love this tv. I was hesitant on getting the 720p but now I am so glad I saved the Money because the picture quality is just perfect. The gloss black frame looks real sharp and I am still blown away by the HD experience. I highly recommend this tv. If I really had to find a flaw in the tv it would be the sound, it's a little tinny. I have surround sound so I never use the tv speakers. I will still give this tv 5 stars because the picture quality makes up for the sound quality. Save yourself some money and forget the 1080 because you can't tell a difference. Blue ray is crystal clear and love watching movies on my new Panasonic Plasma.", "Date": "November 19, 2010"}, {"Title": "Great TV, okay sound.", "Author": "Malhar \"Malhar\"", "ReviewID": "R2ZI5EFQL0S5P1", "Overall": "4.0", "Content": "I love the TV.  The HD is great even at 720p.  The sound, however, is not the greatest.  I have to have a pretty high volume set for me to hear it.  Overall, for the value, this cannot be beat.", "Date": "August 31, 2010"}, {"Title": "Big 50 N Da House ...", "Author": "BiggToneDogg \"BiggToneDogg\"", "ReviewID": "RE777CF4YI33N", "Overall": "5.0", "Content": "I've had this TV (2010 model) brand new ... NO Issues ... Awesome Picture ... connected 2 Comcast HD ... Nice !!!", "Date": "January 20, 2014"}, {"Title": "love this", "Author": "Carol B. Kellogg \"Carol Kellogg\"", "ReviewID": "R3TJ3R87XQBJZE", "Overall": "5.0", "Content": "I have two of these exactely the same.  GREAT PICTURE.  I can only see good out of one eye and this is a MUST HAVE for me and I am so thank ful to have them.  They were both given as gifts but my son who used to work for Circuit City and does a lot of checking things out on the computer, said these were as good as any other made.", "Date": "January 17, 2014"}, {"Title": "GREAT BUY!", "Author": "JeepnDave", "ReviewID": "R16038IZDUT4WU", "Overall": "4.0", "Content": "I bought this TV from Target for $699, what a great buy!!!! I LOVE it, no complaints!! I've had it over 1 year. i am now looking to find a sound bar that will work with it's digital output.", "Date": "September 9, 2011"}, {"Title": "Excellent TV!  Very pleased", "Author": "Tazzmission1981", "ReviewID": "R2392WKBFWOMZN", "Overall": "5.0", "Content": "Purchased this tv 1 year ago.  Zero issues with it.  VERY pleased!  It's only a 720p, cable doesn't broadcast in 1080p anyways, so who cares!  Look for this tv in the Sunday paper, and get it onsale.  Def worth it!  Only con is the sound isn't the best.  I usually have to keep the volume up to 50.  I would recommend a sound system.", "Date": "July 11, 2011"}, {"Title": "Panasonic TC-P50C2", "Author": "Brandon", "ReviewID": "R1U18PF2JIG7N0", "Overall": "2.0", "Content": "Don't buy this.  If you are in the market for a TV .. do a LOT of homework on specifications before hand.If you are only looking at using this on tv, it looks \"fine\" with hdtv direct-tv.600hz refresh is misleading advertising.  It is a series of grilled panels that is locked at 60hz.  DVD, Blueray, and movies are filmed at 24 frames per second.  60 is not a multiplier of 60, and screen judder frame skipping is very obvious.  Enthusiasts on home media theatre pc forums even report the newer Panasonic 120hz modes just speed up and make the movie feel too fast.  You should really consider looking at LED/LCD options as it handles more like a pc monitor.MOST IMPORTANT thing that REALLY bugs me in the last year of owning this model.  \"Native Resolution: 1024x768\" .. That is a 4:3 screen ratio that stretches out to a 16:9 and upscales.  On Xbox I get a lot of jaggy stairstepping diagonals ...----****  etc.. and it is annoying because this effect causes a flickering effect during movements.  Newer \"1080p\" panasonic plasmas being marketed as 1080p have a native resolution of 1368x720, and that still gets upscaled, giving you a muddy picture.In conclusion pay close attention to Native Resolution and do your homework on what consumers experience with refresh rates (if you can get a multiplier of 25,50,75,120), NOT fake 600hz.  And if that \"120hz\" is faked as well just speeding up the input and not displaying as a fluid normal speed.With this TV all you are getting is a huge screen with a low resolution.", "Date": "June 23, 2011"}, {"Title": "Not a bad inexpensive buy!", "Author": "Christie McIsaac", "ReviewID": "R1ZKT2G3KQPK20", "Overall": "5.0", "Content": "I have had this tv for about a year and I really like it.  Works perfectly, no real concerns.  I play games from the PS3, hook it up to my computer to stream movies, and watch hdtv.  I also own a Samsung 46\" LCD 1080p, and there is really no difference in appearance of the movies and photos except when I play Blu-Ray (tiny bit clearer on the Samsung)or just the picture quality difference based on cable/satellite feed.  I think the Samsung has better input cable options (extra slot and an sd cable input the Panasonic does not have - I can stream on the Samsung with all my computers, but without the sd slot, had to buy a new cable to have it work on the Panasonic since one comp didn't have an hdmi output).  The colors are vibrant, no issues of the old fashioned \"burn in\" after I leave the computer screen active on the tv and walk out although you can see the image haze for a few minutes.  I like the automatic shut off feature in case I forget and leave the tv on.  I guess I would say it is an all around decent tv and I am very happy with my purchase, but if you're looking for the bells and whistles and are ready to cough up the extra money, other models might be a better choice.", "Date": "June 2, 2011"}, {"Title": "Do NOT purchase", "Author": "M.D.B.", "ReviewID": "RIQ4LGED73Y2", "Overall": "1.0", "Content": "Less than four months after purchasing this TV it died. I called Panasonic and they set me up with an electric company that could come repair the TV. The next day I got a phone call from the electric company telling me the part was on back order for 2 weeks! so I waited 2 weeks. No update. So i called again....still on back order for 2-3 MORE weeks! this went on and on with absolutely ZERO help from Panasonic. after almost 5 weeks without at TV they told me i was finally eligible to be reviewed for receiving a new TV or a refund. On that very same day the part finally came in (funny, huh?). Just like that they acted happy and felt the problem was solved. In their opinion my case was OVER. well, not in my opinion. I am still fighting for a refund because of how disgusting Panasonic's customer service is. They are a complete joke in my opinion. Not to mention the electric company they set me up with....they couldn't get to my house to fix my TV until 5 days after the part arrived! Terrible terrible terrible business. I will never give my money to panasonic again and I can only hope you don't either.", "Date": "April 11, 2011"}, {"Title": "Great Buy for the Money!", "Author": "50 incher", "ReviewID": "R37COXD53YRBXF", "Overall": "5.0", "Content": "I have shopped for 50\" plasmas for about 6 months and made a decision based on tons of research.  Of course there are other TV's that offer \"more features\" but at the end of the day I was looking for a good picture and a TV that would last us for several years.  I decided on the Panasonic 50\" 720p, for the money it is definitely the best option!  I could not be happier to this point with the decision.  The only thing that is not \"great\" is the volume which can easily be countered with a nice surround sound.  You will not be disappointed with this selection.", "Date": "February 9, 2011"}, {"Title": "Panasonic 720 is a great value", "Author": "Benny Z", "ReviewID": "R1P0XDPBCTXK6I", "Overall": "4.0", "Content": "This set is a great value and a very good TV, period. I purchased this set based on my experience with the Panasonic 42\" 720 Plasma I purchased 2 years ago. It has always had a fantastic picture and has been trouble free since I purchased it. I purchased the 50\" Panasonic plasma hoping for more of the same.Highs:* Picture....super* Plasma.....great image from any angle. No \"burn-in\" issues yet (no issues on my 42\" set either).* Price, Amazon was very competitive. Price beat Best buy and set was delivered 5 days after purchase. This set was purchased through Amazon, not an affiliate.* Shipping was free with a designated delivery date and time. All went as promised, the set was delivered on time and in great condition. The carrier helped unpack the TV and did not leave until it was tested and in working order.* Set up to DIRECTV HD/DVR was simple. I had all the proper plugs, etc to set this up by myself. (you do have to have DIRECTV activate the receiver, all completed with one phone call)* TV box, very well made, appears to be well put together. Quality box.LOWS:* Sound quality is just so - so (reason for 4 out of 5)....I purchased a sound-bar and sub-woofer that really enhanced the 50\" TV experience.* Glare, careful not to place in a very sunny room....you will get glare on the screen.Overall, I am very pleased with the purchase. I will continue to make Panasonic my TV of choice.", "Date": "December 28, 2010"}, {"Title": "Very Happy with my TV", "Author": "Moses M", "ReviewID": "R36RSX7Y1F1985", "Overall": "5.0", "Content": "This is the first Plasma TV that i have purchased and I am very happy with it. I wasn't willing to pay a premium to upgrade to 1080p resolution and the picture on this is very good plus I am not sure I'd be able to tell much of a difference between 780p and 1080p from where my couch is to the tv.  Besides everyone that has seen it has complimented me on the picture which I think is a good sign of the picture quality.  It also works very nicely with my Panasonic blu-ray home theater since they both talk to each other and you can control the sound for it using either remote. Also if you don't want to buy an optical cable for audio it can still get sent from the tv to the blu-ray player using ARC technology via the same hdmi that is sending video to the tv (You only need an ARC compatible player for this function doesn't need to be Panasonic).My one complaint is that this tv only has 2 hdmi inputs.  Right now its not an issue because I have the blu ray home theater and satellite receiver connected via hdmi and my xbox 360 via component input but if I were to upgrade to an xbox that has hdmi output I wouldn't have the input for it.  However I knew that going in and decided that it was a small concession to make because I didn't want to spend the extra money to go to the next class of plasmas that had more hdmi inputs.Note: I saw someone else mention that the sound quality of this tv isn't very good. I can't comment on that because I am using the aforementioned home theater speakers for audio.", "Date": "December 20, 2010"}, {"Title": "Panasonic 50\" Plasma", "Author": "Jason Bowman \"RAGMAN!!!\"", "ReviewID": "R22N0C18THJC5A", "Overall": "5.0", "Content": "I got this TV to replace an old 50\" Zenith Plasma at the beginning of August 10. One of the MAIN draws was the price. I got it for just under $700 (delivered, unpacked, AND set up). A 50\" Plasma for under $700!!! Amazon offered a 4 year warranty via Square Trade (ST) for $90. I've used them in the past w/o any issues. The manufacturer and the ST warranties run concurrent (Panasonic offers a one year warranty), but the ST warranty covers a couple things that Panasonic does not. Anyway, about the TV. It looks REALLY nice on the wall (I had to do THAT installation after delivery) above the fireplace in the man cave. It has a sleek look and the shiny black plastic that frames the screen looks surprisingly classy. With it on the wall, there is a lower amount of fingerprints on it (four kids like to touch things) and if there is one, it can be seen, but is easily cleaned. It's got MANY connections and the menus are really easy to navigate. I am not a \"gamer\" and my kids (all four of them) are upset that I don't allow them to hook up all their gaming systems to it. I, in an attempt to have some adolescent fun, connected the ORIGINAL Nintendo to it. They don't understand how Donkey Kong or Super Mario Bros can be fun. Yeah well. They don't have to play it if they don't want to! lol Back to the TV. The picture quality with a burned DVD,  actual DVD, and Blue-Ray are what you'd think. What surprised me most wasn't that the HD channels look so friggin great, but that the NON-HD channels looked great. It has A LOT more options that I assumed a $700 TV would have. I don't have anything bad to say about it. Overall, I am REALLY pleased with this and hope that adding this review doesn't jinx it! lol", "Date": "December 13, 2010"}, {"Title": "great TV but not Awesome", "Author": "Gringo A La Carte \"Marv\"", "ReviewID": "R101SUUFYZOJK9", "Overall": "4.0", "Content": "Got this tv to replace a Haier 42\" 1080p LCD and I'm totally happy with my purchase. Found a better deal at Vann's but since I shop at amazon periodically, thought I'd put in my two cents worth. Delivery was fast and fedex guy was very helpful being that's I'm disabled and needed a bit of help to lift the tv to a stand. TV is not that heavy and attaching the base is a breeze, no swivel. Setup was also a breeze, and I elected to turn off Viera Link, prefer to control my devices without help from a tv. Note that if you use VL and label one of the inputs with media lablels provided, it will and did interfere with me using my remote for Windows Media Center on my Windows 7 computer! Turning off the function worked as did not use any input lablels provided, but that's just my preference. I am leaving the contrast and brightness levels below 50 for 100 hours of use, then will adjust them more to my liking. As is, pq is great, not awesome but nonetheless it's still better than the tv it replaced. Watching hd satellite is sweet! Nature programming abounds and you can almost taste the air the picture is so crisp and clear! SD viewing isn't bad either, but the two do not compare obviously. I've watched a fair amount of Fox Business and news channels and have experienced no image retention or burn in described in great detail by another reviewer. I have the tv sound in surround mode and it is fine, not too weak or compromised etc. There's not many audio options, so work with what ya got. I also use a tos cable from my 5.1 surround to the tv for more sound depth and it's nice. So nice now I need to upgrade my surround system! There are only two hdmi inputs, so I use an hdmi switcher for all my devices and plug that into hdmi1, and then I use hdmi2 for my Roku box. Altho it's only 720p, there's not a big difference between that and 1080p, but there is a difference. The color are vibrant and leap off the set in certain shows or movies, like Avatar or Star Trek, Star Wars. The set is a highly polished glass screen and does reflect a lot of images in the living room, day or night but you adapt. It's nothing I can't deal with and eventually get involved in the program and don't even notice after a while. Overall,this is a great tv for the budget minded. For $599 I got a bigger screen, and an awesome plasma viewing experience! It's like watching art in motion!Update: after using this tv now for 8 months, i still love it, but... and that's a BIG but, 720p just don't cut it! i upgraded my sound system & also blu ray player, have a marantz bd7004 & action scenes or fast moving content, this tv will & does pixellate!!! that's the difference between this & 1080p i suspect. so now i'm bummed & will have to save $$ again & try out an lg 50pv450 & hope this solves my pq problem. imagine it will. but overall, still a great tv at the time for the price. dish tv is perfectly clear in hd, it's just movies have an issue now. meh. i'm running out of room to put unused tv's lol.", "Date": "December 10, 2010"}, {"Title": "Panasonic Plasma Value", "Author": "Sean Young \"Sean Young\"", "ReviewID": "RO2SA2RXGV8S6", "Overall": "5.0", "Content": "This is our 3rd Panasonic Plasma and by far the cheapest one. The picture is great, and the inputs/outputs allow for a lot of different setups. A nice design is putting the controls and some inputs on the side where they can be accessed but not see from the front. The best value on a plasma and I do not notice any difference with 720p vs 1080p.", "Date": "November 30, 2010"}, {"Title": "It sucks!!", "Author": "Knobsbrother", "ReviewID": "RS0UV4MZBRMZN", "Overall": "1.0", "Content": "Bought it 6 months ago and it stopped working 4 weeks ago and it still isn't fixed.  Supposedly there is a part on back order.  The automated help line is very frustrating, it's virtually impossible to speak to a human being.  When it worked it was awesome, I think, because that was so long ago I don't really remember.", "Date": "February 28, 2011"}, {"Title": "Beautiful TV... But \"Image Retention\" and \"Burn In\" are big issues.", "Author": "mac_24_seven", "ReviewID": "RF84TSU2QL58R", "Overall": "2.0", "Content": "Cliffs- TV picture is amazing.- Quality of TV is great.- Zero issues what-so-ever with how beautiful the picture is or really anything... Except...- IT DOES HAVE IMAGE RETENTION AND IT WILL BURN IN IMAGES!!!!!!- If you play games, be careful.- DO NOT BUY THIS TV IF YOU LIKE GAMES SUCH AS ROCK BAND OR GUITAR HERO.- The two star rating isn't fair, because the TV picture is beautiful, but I sold it because I didn't want to ruin it.. So two stars it gets.I purchased this TV about a year ago so I have a lot of time on it. I'll try to make this as straight to the point as I can.- The picture is beautiful. 720p is just fine. Avatar on Blu Ray is gorgeous. I have zero issues with the image/picture quality on this TV. The blacks are well, black. It's very bright, has good remote, nice menus. Everything is just perfect except....-----------------------------------------Burn in/Image retention.I read multiple times that those two things are no longer an issue. Thats total BS. You don't even have to play games, you can just watch a football game and where ever the lil score box or the channel logo is, it will be there later.With games, its worse.Even though this TV is absolutely awesome to game on, your radar or different stationary things on the game will be there for a while after you are done playing.And the worse is games like rock Band or Guitar hero. I got Bronchitis so I was down and out at home for a while. I put a good 10 hours or so within a couple of days playing rock band(RB). Later one day after playing earlier, I booted up my Xbox 360. While the Xbox logo was on the screen and everything was white, I noticed the bars that are on RB on the screen. I was heartbroken because I had watched a couple hours of TV since I had played RB. I had noticed Image Retention before, but it usually went away. After a good 25/30 hours of playing other games and watching TV those bars have 99% went away. I can still see that faintest of outlines there, only because I know they are there and know to look for them.That is totally unacceptable. I was heartbroken because I knew then if I continued playing games on my TV it would ruin it and within another year, there would be permanent damage.I have since then sold this TV to my parents who do not game and purchased a Samsung 46\" LED that does not have image retention/burn in issues... As its just not an issue with LCD's or LCD/LED's.Its a shame too, because I liked this TV a lot. But burn in/image retention are issues that it has.- I would like to point out that even while the Image retention is there, its only on white screens you can see it, like on the Xbox 360 dashboard. With normal TV viewing/movies/games you can't see any IR.... But it's still there.", "Date": "November 29, 2010"}, {"Title": "get a samsung", "Author": "Edu #33", "ReviewID": "R2Y3GA82ASN348", "Overall": "2.0", "Content": "Wow this is nothing compaired to a samsung. I bought this one first used for 600.00 and it had a defect. I then re-orderd a samsung for same price also used. There is a world of difference in quality. Samsung really goes the distance with evan their lover priced t.v. also AMAZON WAS SOOO EASY TO WORK WITH IN EXCHANGING!!!", "Date": "October 9, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "50-inch Plasma HDTV with 720p HD resolution; 720 lines of moving picture resolution\n600Hz Sub-field Drive technology for superb full-HD motion; 2,000,000:1 dynamic contrast ratio\nVIERA Image Viewer for JPEG image slideshows directly from an SD memory card\nInputs: 2 HDMI, 2 component, 2 composite, 1 digital audio output\nIncludes removable stand; measures 48 x 32.2 x 14.1 inches with stand", "Name": "Panasonic TC-P50C2 50-Inch 720p Plasma HDTV (2010 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/51XSk7ShfGL._SY300_.jpg", "ProductID": "B003926CUS"}}