{"Reviews": [{"Title": "Tech support is hard to find online.", "Author": "Kimberly A. Plath", "ReviewID": "R36MB58QKT4C96", "Overall": "3.0", "Content": "Need a code for remote for cable box to be able to use it. Can't find it anywhere online!! Anyone know where to find one, thanks!", "Date": "March 21, 2013"}, {"Title": "Great TV!", "Author": "Jackie", "ReviewID": "R11D5Z37V4M7ZQ", "Overall": "5.0", "Content": "I have had no trouble with this TV at all! Got confused at little bit when hooking it up to my cable box at school and such because the owners manual isn't as detailed as it could be, but it was easy to figure out what I had to do and it has been a great TV so far, especially for the price that I got it at.... I definitely recommend!", "Date": "August 31, 2011"}, {"Title": "I REALLY wanted to like and keep this TV! But wasn't meant to be", "Author": "Miranda", "ReviewID": "R2WJ244AC3P9A7", "Overall": "2.0", "Content": "We won this TV at a charity event, brand new. The picture is absolutely beautiful and perfect, the colors are amazing especially on HD cable channels. Watched a show on the Travel Channel and felt like I was in Tahiti and not watching it on TV.Unfortunately we had major problems with the sound, which was pretty low quality. We had to add speakers to make it work for us. The worst part is if I changed the channel too fast, the sound would go out. If I was watching something on DVR and hit the \"last\" button to go back to the Cable/TV mode, the sound went out. Sometimes it didn't matter how fast or slow I changed the channel, the sound still went out. The picture always stayed on, though. The only resolution was to turn the power on/off and then the sound would come back on.Read the manual cover to cover, no quick fix or even a mention of this problem. We tried to call the telephone number in the manual to see if maybe we had hooked something up wrong, the number was disconnected. We did searches online for information about the problem hoping to find a fix, and hardly found anything that was written in English. Practically everything was written in Chinese.  This Amazon review and one other online were all I could find, and the other reviews weren't really favorable.Tried it out for about four days. The picture quality was so great that I actually considered dealing with the sound issue. But life is too short for that, so we returned it, paid an extra $53.00 and got a Maganavox 37 inch flat screen instead. Picture isn't as dynamic but still looks good and most importantly, it works properly.Perhaps when Hidear works out their sound issues and gets some U.S. customer service support I can reconsider purchasing their product in the future because if the sound were working properly, I would have happily kept this TV. Since there were so few customer reviews available online when we purchased it, I wanted to write this. Hope that if you buy and keep this model, you have better luck than we did!", "Date": "May 25, 2012"}, {"Title": "awesome", "Author": "justin", "ReviewID": "R13CORDOPZMPMV", "Overall": "5.0", "Content": "I jumped the gun on my last review as soon as Mr. Wyatt seen i was disatisfied with my order he immediadly sent a replacement and  a return label for the broken product the new one is on its way again i dop apologize mr. Wyatt for jumping the gun on my review but awesome customer service", "Date": "August 7, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Set your eyes on 720p high-quality resolution\nWatch movies in privacy via the headphone jack\n6.5ms fast response time minimizes blurriness\nSet your eyes on 720p high-quality resolution Great to place anywhere in the comfort of your home", "Name": "Hidear LD32J88US 32\" 720p 60Hz LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/413mCwpHUdL._SX300_.jpg", "ProductID": "B004XZCHK4"}}