{"Reviews": [{"Title": "amazing TV", "Author": "kathy drakos", "ReviewID": "R1RVO4RMYMBNNO", "Overall": "5.0", "Content": "I was a more than a little aprehensive about buying this TV since I did not find one review prior to purchasing. I had done a lot of research on Natural (passive)3D LED-LCD HDTV televisions. I even bought a subscription to consumer reports to gain more information. I read reviews on as many models that I could find that fit my criteria. I wanted a passive 3D system, I wanted a screen at least 46 inches and after researching I decided I needed at least a 240hz refresh rate to avoid the \"ghosts\" I keep hearing about. Unfortunately most of those TV's were expensive and I wanted to keep my price point below $1300.00. Then I found this Toshiba. The price point was great, no tax, and shipping was only $25.00. Set up was easy (my 19 year old son did it...may not have been easy for me). I heard on other reviews from many of the other televisions that the default picture settings needed adjustment but all I did was turn it on and was AMAZED. This picture is crystal clear. I have had the TV for about 2 months now and it still continues to amaze me. Although I don't watch a lot of the 3D channels, but this is VERY COOL. I have never had a ghost issue, even when watching sports. It feels as if you are in the picture...I wish I had more 3D programs available to me. I did watch the british open the other day and thought I saw a trail after a putt of the golf ball...but it didn't happen again. Interestingly my kids brought home a set of 3D glasses from an imax theatre the other day (I am NOT encouraging people to do this...) and those glasses also worked with this TV. Another reason I wanted natural...I did not want to spend $100 dollars for more glasses. My father owns a Sony HD LCD and he is impressed with the picture I have vs his.My only two complaints are: there is a big lag time between channel changes. It feels like a minute or so after you change the channel until the picture comes back but I am sure it is only 20 seconds or so, I am just used to that function being instantaneous. The other is the sound. I read reviews on all of the other comparable TV's and they all said you need to get a decent sound bar or surround sound because of this so it was expected and I will eventually invest in an up to date system.All in all, I am very happy with this TV...I made a big leap of faith that it would be everything I had hoped for and have not been dissapointed. I thought about giving it only 4 stars because of the sound and channel issue but it is such a great TV otherwise I didn't think it was fair. Hopefully this review will help someone else take the plunge!", "Date": "July 20, 2011"}, {"Title": "All-around quality performer", "Author": "Wood B. Hermit \"Seeker of the one pure and cl...", "ReviewID": "RDPJWC847PECY", "Overall": "4.0", "Content": "I have had this Toshiba TV since late July 2011 and so far have been extremely pleased with my purchase. It seems to be unjustifiably underrated. Crutchfield likes this set and they're no technology dummies!I purchased this television after first having had a look at the comparable 47\" passive 3D LG TV (Model: LG Infinia 47LW6500 47 Cinema 3D 1080p 240 Hz LED-LCD HDTV) which - overall - did not impress me as much as I expected based on the opinions of certain overly enthusiastic members of the LG True Believers Club here on Amazon.com who are apparently experiencing something akin to an ersatz orgasm as they continue to post monotonously uncritical, over-the-top, positive reviews about this set.\"How many ways can I say wonderful and amazing? Oh dearest LG, let me count the ways!\" I think that some of these people must be paid or unpaid shills intentionally getting the good word out for LG on the Internet.Although the 47\" 3D LG TV does indeed have a beautiful picture, I personally disliked the following and thus would rank it a neutral 3 out of 5 stars:1) Stand quality/design - especially flimsy and wobbly plastic with removal problems - not an easy on or off. Attach the stand and you may very well not be able to remove it in the future due to an apparent mismatch between the screws provided and the drilled holes.2) WIFI implementation via external dongle with suboptimal throughput - the LG would repeatedly ask me to establish my Internet connection when this had been done successfully a long time ago.3) The second remote provided with the LG is essentially superfluous; there's rarely a need for more than one remote per electronic device. Why unnecessarily contribute to the multiplication of remotes around the house?4) Both LG remotes also did interfere with some other electronic devices that I have in my living room, turning them on and/or off when this was not desired (digital picture frame, Internet radio, etc.). Panasonic and Toshiba remotes do not cause this problem.NOW CONCERNING THE TOSHIBA:The integrated WIFI connection on the Toshiba TV is rock solid. I have had absolutely no problems with having to repeatedly input my network information due to a lost wireless connection or anything of this sort. Just set up the WIFI connection once and then forget it. Streaming from the Internet - either through the TV itself or via my WIFI-enabled Panasonic Blu-ray player - is smooth and flawless, which it should be with the now 50 Mbps download speed that I have available at home (as of May 2013). And the integrated WIFI means that both of the provided USB ports are available for other things - no need for a USB WIFI dongle on this set!Picture quality is great as far as I am concerned. I am by no means claiming that this TV has the absolute best picture quality available anywhere and this is unnecessary. I don't get too obsessed about the picture of one TV being technically 10 - 30% better than that of another. In most cases we're not dealing with truly good versus bad image quality, just different levels of goodness. Choose the set that's good enough for you overall; that's all that matters.When first receiving this TV be sure to perform the software upgrade/update and then do NOT leave the television on the default AutoSave picture settings which emphasize energy savings over picture quality. Instead select the Standard picture settings. If you do all of this, you should end up with a very nice picture. And if you are so inclined, the Toshiba has a large number of settings that you can tweak to approach whatever your idea of picture perfection may be. Personally, I'd rather spend my time doing other things, but the potential to do this is readily available.The Toshiba TV certainly more than meets my needs of watching the occasional over-the-air TV program and then streaming on-demand content from the Internet via WIFI. I have also had the opportunity to try out the passive 3D effect/experience of the set and it is very realistic; the images appear to pop right out of the screen - works fine for me.Sound quality - although acceptable for built-in TV speakers - certainly can be improved and I have done so by adding a soundbar system with wireless subwoofer to the set (Panasonic SC-HTB520 2.1-Channel SoundBar Speaker System with Wireless Kelton Subwoofer, see my review). The combination works like a charm, a great sound upgrade! And everything can be controlled with the Toshiba's single remote control.I give this Toshiba TV a rating of 4 out of 5 stars in light of the following things that I felt could be improved:1) Stand implementation could be better. I would prefer a stand with more metal parts and less plastic (see Panasonic TVs) that attaches to the bottom/base of the LCD panel - better weight-bearing functionality and less strain (again see Panasonic) - instead of a stand that attaches directly to the back of the LCD panel. If one of the attaching screws does not come out easily, you may have difficulty removing the stand if you ever want to wall mount the TV in the future.2) The design/layout of the Toshiba remote control is not optimized. Of the two remotes that I regularly use (Toshiba & Panasonic), I like the Panasonic remote much better: There are fewer buttons overall and they are larger, more colorful and easier to actuate while the Toshiba remote for the most part has smaller, monotonic black buttons making it difficult to find the desired function. In short it takes longer to get properly oriented with the Toshiba remote control, but it's not an insurmountable problem and you'll get used to it.3) Changing channels is a bit too slow for my taste (as another reviewer already has mentioned). They do all switch, but the time delay is longer than expected or needed. The original start-up of the set from a cold start at about 27 seconds or so is also on the long side. You might wonder whether or not anything is happening during this time: nothing but a soft click is heard after hitting the power button on the remote and then a tiny green light - as the only sign of life - starts flashing after some 15 seconds have elapsed. These are essentially minor inconveniences - not deal breakers.4) The Internet apps provided with the Net TV function need to be expanded. The selection so far is very limited, but this does not bother me, because I have other streaming-enabled devices (Blu-ray player, etc.) available to provide additional choices. This is something that Toshiba can -and hopefully will - improve in the near future.STATUS UPDATE ON 11/20/2012I have now been using this Toshiba LED TV daily for about 16 months - no problems whatsoever, no repairs. It is still going strong just like on the day in July 2011 that I first plugged it in.STATUS UPDATE ON 07/20/2013After 2 years of regular daily use, this Toshiba LED TV still continues to function flawlessly - no service needed.", "Date": "August 13, 2011"}, {"Title": "Great TV", "Author": "Joe P.", "ReviewID": "R9NN5CILWQBY8", "Overall": "4.0", "Content": "Size, weight, appearance are fantastic.  Picture is not great until tweaked, but WAY better than just ok.  Same for the sound.  You'll have to tweak it - there are lots of settings...once tuned, it performs really well.  Wi-Fi connect is perfect.  For the price, screen size, features - this TV is a great buy.  Packaging was terrific.  I am *very* satisfied with this purchase.", "Date": "July 1, 2011"}, {"Title": "best 3D bang for your buck", "Author": "carlo", "ReviewID": "R2OG8F4JEDVRLN", "Overall": "5.0", "Content": "first off, IMO, active 3D is garbage tech. headaches, pricey glasses, noticeable flickering with some viewers, heavy uncomfortable glasses (not so much with the newer 2011 active glasses), glasses that aren't cross compatible with other manufacturers, newer active glasses may not be compatible with older active TVs from the same manufacturers, reduced brightness; all are negatives against active 3D.after trying out a friend's panasonic 3DTV last year, i didn't believe in any 3D technology. i dismissed 3D until i tried LG's passive 3D at a local best buy. i then researched passive TV sets by LG, vizio, and toshiba. i was set on buying a lower cost vizio but after seeing the TV in person at walmart, i couldn't pull the trigger. the edge back lighting was extremely noticeable inside the well lit walmart store. i feared that watching TV on the vizio in a dark room would have been an awful experience. so i was back looking at the LG, the priciest of the 3 but after reading several reviews from gamers and many pointing out that the LG has noticeable lag while gaming, i couldn't pull the trigger on that either. so then there's toshiba, there isn't as many reviews on this set but some have mentioned that the gaming lag that's on the LG isn't on the toshiba. this may not matter to some but to gamers, that lag is a big deal. the toshiba also has pretty much all the features the LG does but for a couple of hundred dollars less. the vizio was about $150 cheaper than the toshiba but does not have a 2D to 3D feature. this is a feature which can convert any 2D signal, including live TV, into a 3D signal. a feature i was looking forward to but after playing around with the 3D feature and the 2D to 3D feature, i found that the conversion feature doesn't really come close to a real 3D signal.enough comparisons, this toshiba is an awesome TV. the 3D is just as good as the LG's that i've seen. i only have avatar 3D on bluray and have to say that this TV brings the 3D theater experience at home, all with comfortable, lightweight, inexpensive, passive 3D glasses (includes 4). for 2D viewing, it's an awesome TV for an LED LCD. i say that because i still feel plasmas have LCDs beat but since they don't make any plasmas with passive 3D and 3D was my primary reason for this purchase, this purchase made the most sense for me. oh, i should point out that i also own a 2D only panasonic plasma.i'm giving this TV a 5 rating because i feel that this TV is the best 3DTV you can buy for under a grand. it's not without its flaws; edge back lighting is uneven but only noticeable in a completely dark room, the remote control is nicely backlit but the buttons feel too stiff for my liking, the netflix app isn't as good as the app in my bluray player or xbox, and it takes about 20 seconds to start up. if you do purchase this TV be sure you upgrade the firmware asap. the upgrade will make navigating through the menus much smoother and will also fix netflix which did not work before the update.edit: have had the tv for a couple weeks now and love it. volume is low though but that's expected with most thin profile tv's these days. also, this tv has played every video format that i've thrown at it via the usb port, a very welcome feature.", "Date": "November 20, 2011"}, {"Title": "Good TV at a great price", "Author": "darwin", "ReviewID": "R2D56P7HF33C8S", "Overall": "4.0", "Content": "This is a Good TV at a great price.  I shopped this TV against the Sony KDL46EX720 and the Samsung UN466400.Pros:-Fast Refresh Rate-240hz versus 120 for both the Samsung and Sony.  The Sony has the number 240 everywhere I looked; however, this is not a true 240hz refresh rate.-Passive 3d-This was a big one for me.-I have 3 young children and I am hesitant to hand over a $60.00 pair of glasses passive glasses are significantly cheaper.-Eye fatigue, personally I felt like the active glasses caused eye fatigue significantly quicker than the passive- I felt  like I was getting a headache down the center of my head any time I wore the active glasses for more than a few minutes.-Active glasses are kind of a pain- they are heavy, you have to recharge them which I tend not to stay on top off and I felt there was a lot more visual noise (not syncing properly via bluetooth and crosstalk)-Active 3d is well entrenched with the top brands (Sony and Samsung) and you will find that every salesperson will tell you it is significantly better; however, I recommend reading this article: ([...])the author of the study referenced in this article is very highly regarded in the HDTV world and it provides an in depth comparison of active versus passive 3d.-Matte screen-I have a bright room and this is one of the few LED LCD TVs that is not using a glossy screen which reflects light.-Price-I was able to find this TV at a very reasonable price versus the Samsung and Sony.-Built in WiFi-This is huge and anyone purchasing a TV should make sure it is internet connected as you can receive software updates that can correct issues with the TV. There is one out of the box that I hope will be corrected soon and I'll cover that in cons.Cons:-The picture is good on this TV; however, I felt both the Sony and Samsung did have a slightly better 2d picture.  You will absolutely have to tweak this picture out of the box as it defaults to power saver mode which sacrifices picture quality for energy savings. I am all for being green, but I think this was a huge mistake by Toshiba-I can only imagine all the returns because people take it out of the box hook it up and the picture is lackluster.  I recommend going to AVSforums-dot-com, searching for the model number and trying out some of the users recommended settings. That is what I did and I have an excellent picture on this TV.-Incredibly long time to power on (This is the issue I am hoping is corrected via a software update)-This TV takes 20 seconds to go from hitting the power button to a picture on the screen.-Speakers are awful- This was across the board on all brands-If you are going to purchase a 3d HDTV you should have a sound system.-Lack of reviews-This has nothing to do with the TV per se, but there are not a lot of reviews on this TV and I like to research.All in all this is a good TV at a great price-I have watched 3d movies, played 3d games and watched sports on this TV and have been very happy with the picture and refresh rate.60 Day UpdateI am still happy with this purchase, some minor annoyances with the 20 second to picture delay when starting up and changing channels, particularly when going from an HD to SD channel.  I also notice that sometimes it does not seem to recognize other inputs and I have to restart the device associated with that input.Other than those annoyances, I still recommend this TV- 3D, gaming, movies all look excellent.", "Date": "October 12, 2011"}, {"Title": "Exceeds My Expectations!!!!", "Author": "LB", "ReviewID": "R2OTGF9ASAHA7D", "Overall": "5.0", "Content": "I was on the market for a 3D television for the sake of bluray 3D and xbox 360 video games. Stumbled over this one, and I cant regret my decision. I am not a video guru, but once you calibrate the tv to your preference it will be great. May want to experiment with the different options for the best picture quailty for daytime and nightime viewing. Must I add that when you put the smooth video option on and leave the edge enhancer off (unless u really want to be part of the movie set), one will be astound at how live and real your bluray and/or bluray 3D will be. No wonder this set is described to be having a natural picture. Freaked me out at how great the bluray 3D video is. Cant tell rather its half resolution far as being passive 3D. Everything is crisp as can be. No charging required for glasses that are included. Noticed that it has four slightly lit corners on screen when pitch black, but when content is displayed, it fades down to normal. Using the 3D button to convert 2D is not really convincing, helps a little with the resolution on DVD for some reason, other than that I rather watch it in 2D unless the native content is 3D. Haven't tried 3D games yet, but very confident that it will perform well.Pros:  Excellent Video  Light up RemoteCons: Speakers are a little under quality  Time lag to turn on tv (~22 sec.)  TV stand wobbles when touch or bumped", "Date": "September 26, 2011"}, {"Title": "pretty good", "Author": "D St", "ReviewID": "R2M49USMYXM2V1", "Overall": "3.0", "Content": "I'll make it short and to the point:Pros:+ very nice picture quality (I'm using my PC with this TV as well, it looks amazing when connected through HDMI)+ whites and blacks looks incredible+ quite a few features for the buck+ gaming mode is good, it reduces the input lag to an acceptable point. I play fighting games, so every ms counts, in gaming mode I was doing almost just as good as with my old monitor. Definite plus.+ PriceCons:- Right off the bat I see backlight bleed in top corners it's annoying- I don't like the remote, buttons are crappy in my opinion. Even though it has back-lighting, I would prefer a touch screen remote. Not really a minus, but worth a mention.- no HULU+. I'm referencing it, but apparently every TV out there has extremely slow apps and you are better off using your PC or a console anyway. Not really a minus, but worth a mention.Summary: if you aren't afraid of some backlight bleed, go for it.To AMAZON: Fedex just dropped it off by my house, on a RAINY DAY and there was no one there to sign for it. It's a $1000 TV, I don't trust my neighbors that much... It worked out for me, but this type of service will back fire at you one day. It's too expensive to just leave at someones door.UPDATE:After several days of owning this TV, I decided to return it. Backlight bleed proved to be far more annoying than I anticipated, slow tv start up time is also a drag and input lag in games proved to be a bit more than I figured at first, due to additional lag that you get from playing online (it's still fine for casual games, just not Fighting games and FPS players that take their games a tad more seriously). I tested the 3D feature, it worked well, but 2D to 3D is a pure gimmick, I found it to be useless.UPDATED SUMMARY: it's an OK tv, hence I gave it 3 stars, but I think there are better options out there to consider.", "Date": "November 30, 2011"}, {"Title": "Amazing!", "Author": "Maverik", "ReviewID": "R3NBUVF5J3DOHF", "Overall": "5.0", "Content": "Before I got this TV, I bought the LG 5600.  That TV's tuner would hardly pull in any OTA HD channels, maybe 4 or 5.  Picture quality was decent but there was some noticable backlight blooming.  I returned the LG and got this Toshiba 47TL515U.Right off the bat, the TV is receiving all 26 OTA HD channels in my area.  A big improvement over the LG.  The TV features a very stylish design and is a lot sturdier on it's base which is solid glass instead of plastic.Now for the picture quality...totally amazing!  OTA broadcast channels in HD look awesome!  The Black levels are amazing, color is perfect, all in all, an incredible picture.  Just change the setting from the default \"autoview\" to \"standard\".  Blu ray looks great and 3D is among the best.In my opinion, this TV blows away the LG.  I've always used Toshiba products and have a 55 inch Toshiba LED TV in my main media room.  This one was for our living room.  I should have gotten this TV from the start.So, if you want an awesome just about perfect picture right out of the box...forget LG, really forget Vizio....and get this Toshiba.  You won't be sorry.  There's no need to spend the high prices that Samsung and Sony charge you.  Get the Toshiba.", "Date": "December 11, 2011"}, {"Title": "Mostly great, some tiny annoyances", "Author": "Seth I Levine", "ReviewID": "RSE4I4DCYCSLB", "Overall": "4.0", "Content": "I've had this TV for a little over a month at the time of this writing.  It's proven to be very nice.  The picture is super clear, bright in the right places, crisp, and the 3D performance is very good and fun (I have nothing to really compare the 3D performance to, but it works as I expect it to).  There are a few things about this set that could use some improvement; It takes a VERY long time to warm up when first turned on! There is practically no indication that it's doing anything during this period, other than a tiny, nearly inaudible 'click' and a tiny LED indicator that doesn't stay on the whole time.  The set is quite slow to change resolutions! I use a DirectTV HD DVR as my source/tuner. Any time the source changes from one resolution to another, the TV goes blank for what seems like a long time (probably 10 seconds or less, but it feels longer).  Also, when changing from 2D programming to 3D programming, or when turning on the virtual 3D rendering on 2D sources, this lag exists.  Also, when using Netflix or other online features, the set is quite slow to get to where it needs to go.  Once there, it works fine.  I've watched one Netflix movie, over my home wireless network, where the access point is in the same room.  Initial buffering took what I thought was a long time, but I had NO dropouts or delays for buffering once the movie started, and the picture quality was quite acceptable to me.  I am not an audio/video-phile, and my standards are probably lower than some, but I have been in the AV business for 30+ years, and find this set to be a very good value for the money.  I've continued watching prices, and even during the sales season, I have not seen another 47\" or similar 3D LED-LCD TV on the market from any manufacturer at a better price than I paid here, especially considering 2-day shipping to my door and 12-months same-as-cash financing!  Time will tell if this set will outlast the one it replaced; a Vizio that died after about 3 years, but so far, I'm happy with my purchase, and with the service I received from Amazon!", "Date": "December 8, 2011"}, {"Title": "Toshiba 47TL515U 47-Inch Natural 3D 1080p 240 Hz LED-LCD HDTV", "Author": "L. Berrios", "ReviewID": "R1117L2ICJIM34", "Overall": "4.0", "Content": "Yesterday I received my Toshiba 47TL515U 47-Inch Natural 3D 1080p 240 Hz LED-LCD HDTV and quickly set it up for viewing.I was a bit apprehensive about buying such an expensive product over the Internet for home delivery. No issues. The unitarrived in good shape. Although I have not yet explored all of its capabilities I am very happy with my product:- Power up time: I kept reading that it would take a long time to power up. Not so. It takes about 5-10 secs maximum so no  issue with me there.- Support pedestal: I read that it was unstable and that screws did not align well with holes. Not so. I mounted the pedestal  very easily and it is very sturdy. Sure it moves a little but it is to be expected since the TV is fairly heavy for its size.- Picture quality: I read it was questionable compared to Samsung. Not so. It is excellent. You do have to calibrate it but we  all do that one way or the other to adjust it to what we like. Recommend URL: [...]  to research by TV model and get feedback/recommendations on calibration settings. Recommendations are subjective as I have  tried some of them and either liked them or not so it's ultimately up to what YOU like.  I am very happy and impressed with all of this product's capabilities (NetTV, Netflix, Yahoo Gadgets, Pandora, YouTUBE). I  am only scratching the surface with this TV and am looking forward to continuing to calibrate it to my liking. At the end  of the day it is not what CNET says but whether we the users are happy or not. Right now I am a believer, 'two thumbs way up'.- Footprint: For a 47\" TV I was afraid it would be too big for placement in the corner of my living room. Not so. It has a  deceivingly small foot print for its size. Although it is recommended the unit be placed at 'eye level' I converted my  previous TV cabinet (designed for picture tube TV's) and am now using it as a platform to put my new TV on top of it. Sure  it is a bit elevated but because of the TV's screen size, IT LOOKS GREAT from anywhere.- User's manual: It is included. Read that you would have to 'download it from the internet'. Not accurate. The packaging does  come with a hardcopy of the manual which is very user friendly.I did extensive research on this and other TV's that are similar and all in all this is a safe bet and excellent purchasefor its price, given how many attributes/features it has. Perhaps I am bit biased because I have always had Toshiba TV's butit's like comparing apples to oranges because my previous units were picture tube TV's. This is the first Toshiba HDTV LED-LCDunit I have purchased and once again, it rocks. You will find no better TV for the price, picture quality/calibrationattributes, and features when you compare it to other brands side by side:Links to find more information on this TV:[...]Enjoy!!!!!", "Date": "February 10, 2012"}, {"Title": "Unbeatable for the price, but not perfect", "Author": "Sono", "ReviewID": "RKWB8JQET4GA9", "Overall": "4.0", "Content": "Here is a general description of the Toshiba 47TL515U 47-Inch Natural 3D 1080p 240 Hz LED-LCD HDTV with Net TV, Black.- Its bezel has a black-aluminum look to it and is outlined with a reflective glass trim when viewed from the side.- The bottom trim of the TV (where the Power-Volume-Channel controls are located) is extremely glossy.- Its base is a rather large solid plate of glass (7-8 pounds by my estimate) with rubber feet that raise the base about 1/4 an inch off the tv-stand's surface.- Weighs just about the same as my outgoing 42\" LCD TV (~45 pounds) I was impressed how much thinner and deceptively heavy this LED TV is.- Remote control has a backlight feature, glossy black, loads of buttons.Pros:+ Clean & crisp images you expect from a 240hz LED TV.+ Low cost of passive 3d, uses the same 3d glasses used in movie theaters.+ Built-in WiFi, 2d->3d capability (more of a gimmick than a stunning 3d display), loads of adjustments can be made to your liking.+ Loads of apps, Netflix TV, Pandora, Yahoo! apps (ie weather, finance), Skype, Facebook, Twitter, able to download and install more apps if wanted.+ USB input is able to play movies right from the flash drive. I've thrown .avi, .mp4 format movies at it and it plays flawlessly.+ Low power consumption. $18 a year when used 5 hrs a day everyday for a year as estimated by the FTC.+ Features voice enhance, it really helps to bring out a voice from background noise. Very practical for hearing news reports.Cons:- Massive TV start up time. Powering it up from a night's rest is between 20-40s at times.- Channel lag, takes about a full second at times to change from channel to channel.- Menu proves to be a little over-complicated. Pressing the menu key will launch a plethora of tabs/sub-menus. There are 3 different ways to program the WiFi connection.- The bottom panel with the power-volume-channel controls are touch-activated, on a glossy panel that is very prone to lingering finger prints. (design flaw?)- The sound is very tinny, high pitches will sting ear drums. Motive to enter sound-bar market.- AutoView screen preference (adjusts color-brightness-backlight-contrast-dynalight automatically) is really annoying, it brings noticeable changes to the picture every second on a dynamic scene.- Initially the WiFi was very finicky, it would disconnect often and I would have to reestablish a WiFi connection, after a few days this has stopped and now has a stable connection.- Wobbles nervously when I plug in HDMI/USB.- Hardwired and very short power plug. (~3-4ft)Overall I find this TV to be very sleek, affordable, and functional. Once you get past putting up with the initial start up lag, this is the TV to buy in this current LED TV market.Update: I have discovered that at times this TV is unresponsive to channel switching/volume changing and even power controls. After a solid minute it will just shut itself off. Will update if this TV poses a serious problem.Part 2: Does not support my 32gb Corsair flash drive, however I went around this problem by plugging the flash drive into my router to use it as a media server. From there I can watch videos out of the 32gb flash drive.", "Date": "January 22, 2012"}, {"Title": "Great TV!", "Author": "Jeff", "ReviewID": "R2RFV7Q963FVKU", "Overall": "5.0", "Content": "Well after my 3 year old decided to take a wrench to my Samsung 51\" active 3D plasma I was in the market for a new TV.....After looking at a lot of different sets I finally settled on this Toshiba and let me say I'm glad I did!Pros:The 2D picture is amazing colors look crisp and blacks are dark.The 3D picture is much better then expected(more on this below)The apps on it are useful and I like the netflix button on the remote makes it very quick to get to. The youtube app also works great.Very thin would look great on a wallPlenty of connections with 4 HDMI and the L shape that they are arranged in makes hook up easy.I had the entire thing unboxed and adjusted in about 45minBeing able to convert 3D>2D is great! Especially if you have children.Cons:It does take about 30 sec to turn on not a huge deal to me but may be to some.The remote is a bit cramped and some buttons are hard to read.The sound is standard LED/LCD sound IE bad but I use an external receiver/speakers.Navigating the nettv menu is a bit slowNow as a person who had an active shutter plasma for a year then switching to this I can say with out a shadow of a doubt go with the Passive 3D. I had read quite a bit about losing resolution on passive sets vs active but I honestly couldn't tell a difference. We sit about 8 ft away and the picture looked sharp and I could only see the interlaced lines if I walked up to the set. The biggest difference between the 2? You could actually sit comfortably and watch the passive set with no issues of ghosting, the room being too bright, losing sync with glasses(this was really annoying), no headaches, didn't have to be right in front of the set, no batteries to worry about, and my daughter could actually watch Tangled in 3D with out me worrying about her breaking 100 dollar glasses. Another note on headaches, my wife couldn't watch the active set for more then 30 minutes before experiencing a headache but with this she watched it for 2 hours last night with out an issue(not even eye strain).In conclusion if your looking to jump into the 3D world of entertainment this is a great starting point for a TV that will give you a amazing 2D and 3D experience. Even if you decide this set isn't for you I implore you to go with passive over active 3D especially if you have a family.", "Date": "February 3, 2012"}, {"Title": "Great 3D LED tv", "Author": "Juker77", "ReviewID": "R2MPJR3MF9TV4U", "Overall": "4.0", "Content": "I ordered this tv because I was looking for a tv with 2D to 3D converting plus cheaper 3D.  My boyfriend has a Panasonic 3d plasma with active glasses but it's missing that feature plus it's at his house! lol Anyways I got the tv the other day so I haven't really got a chance to calibrate it yet but I was trying out the 3d with old hdmi cables and it didn't work.  I didn't realize they couldn't pass 3d so I had to wait to today when I got a high speed hdmi cable to try it out......and boy is it great!!  I don't understand what people are talking about that it isn't really 3d HD.  I can't see any loss in definition....It doesn't look anything like SD.  I've read it's only 540 lines (which is just above SD resolution)  Anyways, I put in Avatar, Monsters vs Aliens, and Kylie Aphrodite 3D and they all LOOK AWESOME!!!  Only thing I can't figure out is why HDMI input 2 doesn't work on my playstation????  Can someone let me know what I'm doing wrong?  Must buy if you are looking for a cheap way into 3D!!! Oh hint if you do have a playstation make sure you go through the display settings again to make sure it recognizes you have a 3d display before trying.... Hugs!!", "Date": "February 21, 2012"}, {"Title": "newbie", "Author": "Dennis M. Patt", "ReviewID": "R2KS8HRDZ2Q09I", "Overall": "5.0", "Content": "Well, haven't checked out the 3D yet, and maybe never will, but the picture on this set is fabulous....I mean the best I've ever had in all the years I've bought tvs, and that's over 40!  Now I agree with some reviewers that the set, especially in HD, has an annoying hesitensy when changing channels, and it takes awhile to come on-line from start up, but the picture quality makes up for those draw backs.  For the value, this set is as good if not better than the currently best rated sets on the market, and I've seen all of them.  I only wish it would have been delivered with a complete manual versus the short setup document.  You have to go on-line to get the complete manual and I'm not about to print out 80 + pages.  Never the less, the price and quality cannot be beat.", "Date": "November 29, 2011"}, {"Title": "Toshiba 47TL515U", "Author": "P. Revesz", "ReviewID": "R2W1DHEGEXEA2N", "Overall": "5.0", "Content": "I am very happy with this TV. Colors, 3D functionality - excellent.Originally, I thought to use wired LAN connection, but when I tested the WIFIit worked so flawlessly, that I decided to keep using it.A common complain of the edge-lit TVs is flash-lighting.  In this setI did not see any.Two minor things to mentions: The USB connection  recognizes only a limitednumber of Web-cams. Why a laptop will recognize *any* USB web-cams,but a TV cannot?The second thing is a general to most HDTVs: the text entry using the remoteus so clumsy.  What would it take to make a USB keyboard do this simpletask?All-in-all.  I do recommend this TV.  Peter", "Date": "February 14, 2012"}, {"Title": "Toshiba TV review", "Author": "Nam Hoang", "ReviewID": "R2XD56IQMUW2P5", "Overall": "5.0", "Content": "This TV is the best value of all the Black Friday TVs for sale.  The passive 3D technology that convert any 2D TV show, movie on DVD, and Netflix into 3D works really well.  It is really nice not to have to buy battery powered 3D glasses.  The color is crisp and sound quality is good, but I hooked it up to my surround sound system speakers.  Wifi works will and easy to set up.  For this price you of a 2D , 120hz LED TV you can get this 240 hz and 3D.  Great TV and value!", "Date": "December 10, 2011"}, {"Title": "4 Months old and Screen went out! 17 days, part on backorder!", "Author": "grandmommak \"grandmommak\"", "ReviewID": "R211LZX4ZPDL8G", "Overall": "1.0", "Content": "I bought Dec, 2011 and 4 months later the picture went out. Called for warranty service, diagnosed on phone , gave me a ref number and the phone number to the repair place.  I called the repair place after they called and left a recorded message saying they got the work order, nothing else. When I called them they said the part had been ordered and it could take 1 to 2 weeks to get.  It's been 17 days and no call so I called the repair place back.  The part is on back order and they can't do anything about it and to call Toshiba. I called Toshiba and they escalated the call to a Case Manager who told me the part was on back order and he could not give me an estimate at all of how long it would take. I asked him to just replace the tv and he said he couldn't do that now.  That the only thing I could do was wait for the part.  I asked if they were having a problem with this tv with the screen going out and he said no- not to many with this one but more with the 50 inch and 40 inch.  I will comment again when they finally repair the tv to let you know how long before they get the part. I will not buy another Toshib product if that is how their warranties are.", "Date": "March 28, 2012"}, {"Title": "Great!", "Author": "F. Janini", "ReviewID": "R3F02NC90XN9AF", "Overall": "4.0", "Content": "This TV has excellent features, but requires a lot of workto tweak, especially if you have an eye for details and colors.The picture is not that good right out of the box, to be honest,mainly because of a red hue, I also found that a lot of the\"auto\" picture adjustment features cause contrast glitches in the picture,once you turn them all off you're good.3D movies on this panel are excellent on the other hand.", "Date": "May 17, 2012"}, {"Title": "excellent", "Author": "Kindle Customer", "ReviewID": "R1URRYGGZKBOJB", "Overall": "5.0", "Content": "After reading the reviews by other purchasers, I decided this Toshiba 47inch was my choice.  It was bought at Christmas and we all enjoyed it very much over the holidays.  The picture quality is great, 3D quality is great, and it is quick to change the ratio, full screen, 3/4 etc.  I like the 1/2 mute and mute feature.  It works perfectly with the recommended Panasonic 3D blu-ray player.", "Date": "January 3, 2012"}, {"Title": "At first it looked amazing, but soon became frustrated...", "Author": "C. Aall \"caall99\"", "ReviewID": "RWX866K1JC0UK", "Overall": "2.0", "Content": "Backlight bleeding, slow to respond clunky interface, and the TV remote all of sudden not working anymore ultimately resulted in my returning this defective product. Though there is alot of bang for the buck here, the fit and finish is sub-par and back light bleeding was very irregular and lacked any sort of uniformity. I picked up a Panasonic 50GT50 instead, and boy, was that worth the money!", "Date": "December 25, 2012"}, {"Title": "WARNING - Do not buy Toshiba", "Author": "The Carrot Dude", "ReviewID": "RWXK2V8OJ2WB", "Overall": "1.0", "Content": "Something tells me that these people who gave this tv a 5 star rating wrote the review after only owning the tv for a couple months.  About 5 months after owning it, it was nothing but trouble.  As I write this review, I am depressed because I put so much money and time into this tv.  It is not every day you buy a $1,700 tv.I do have to admit.  The first couple of months this tv was amazing.  Super crisp picture.  I had no complaints in fact I loved showing off my tv.But after about 5 months, it lost it's wireless capabilities.  It even, lost the ability to switch from tv to blu-ray to net tv to video games.  I called to complain about that and at the same time I noticed the picture was not as impressive.After a month or so later, a repair guy came out to fix the wireless/input switch.  He did that.  It works now, but he did not do anything about the picture.  He said call back and schedule another appointment to get the picture problem fixed.  He did not have the parts.  Five months later I was still waiting.  I would call every couple days because my part was supposed to come in on X day, nope pushed back again, it got pushed back again and again and again.  I was told it is on back order.The problem I was having was the picture became grainy, but also when there was fast movement on the screen the picture became very pixelated.  After about a 5 month wait I had enough playing Mr Nice Guy.  I started demanding to talk to people.  I demanded action.At this point they said they'd give me a refurbished tv.  I was just happy to get something.  I figured if they fixed my tv it would be refurbished anyways.  SO they finally delivered and I got my refurbished tv.  The deliery guy dropped the tv off then later that night I watch it.  The pixelation on the refurbished tv was just as bad.  The problem is that the processor in the tv can not process the picture fast enough and you get blurring boxes in spots where there is lots of movement.  So now I gotta call them back and figure the next step.  Stupid me, the repair guy company told me I should of taken the money because I would most likely experience the same problem.  Obviously the processors on all these tvs are poor.In summary, excellent picture at the beginning.  Went south 5 months later.  I spent $1,700 on this tv and expected quality.  Customer Service, while they were nice people they had no sense of urgency and I got no results.  It got tiring calling them for what is now 6 months.  It seems that Toshiba has not developed the technology to produce hi-tech tvs.  Look to another brand.", "Date": "November 10, 2012"}, {"Title": "Fantastic", "Author": "Kings", "ReviewID": "RVJ35HOSHWAWD", "Overall": "5.0", "Content": "This tv is Fantastic. I have been using it for six months. I was very doubtful about getting this item as the HDTVS were swamped with so many models. I  feel I made a really good choice. This is my first review of any kind. I thought I should let all the future buyers know that this is a really good TV. I have watched the new avengers and resident evil, Spiderman movies on 3d. It was really good. I love Resident  evil and Spiderman lot more than I did before. Sound is ok. My bedroom is not too huge. So I feel sound is adequate for me. If you are planning to have it in Living room (big) you might need speakers. I watched it in broad daylight and also in dark env. Overall I am very happy with the purchase . Did not let me down. HD movies are a treat to watch. Have fun everyone. If I observe anything important in the future I will update.", "Date": "October 25, 2012"}, {"Title": "Toshiba doesn't warranty cosmetic issues", "Author": "timandag", "ReviewID": "R16ANM9EJ0PBBU", "Overall": "1.0", "Content": "Purchased this TV on 6/25/12 and was amazed at the picture quality. Upgrading from a 720P plasma it has a much better picture. I've told my wife the quality of the picture is just like being on the set watching the actors because everything looks so real. Yes it does take a while for the TV to turn on which didn't bother me, but you just watch a very tiny green dot at the bottom of the screen and then it comes on. The only internet app that I use on the TV is netflix, the rest I don't care for. Now it has been almost 3 months with the TV, still great picture and everything else works, but the casing on the TV has begun to warp. No, I didn't drop it and no it didn't get wet. My wife noticed it and pointed it out to me, the front bezel has pulled away from the screen allowing dirt and dust to get at all the electronics. I called Toshiba and they don't warranty their cosmetics on the TV, I tried explaining to them that it was a manufacturing defect but they didn't want to hear it. So then I have purchased the square trade warranty and they can't honor what toshiba won't. Pretty sad when you have to tape the bezel on a 1000.00 TV so it won't get ruined from dust. If the TV would of stood the test of time I would of rated this 5 stars but since Toshiba can't stand behind their work it is the last Toshiba product I will ever own.", "Date": "September 18, 2012"}, {"Title": "It's the Bomb Diggity", "Author": "Prudence", "ReviewID": "R9AU13VY49VJ0", "Overall": "5.0", "Content": "I researched it. The closest counterpart I found was a mac daddy Sony that cost $2300. I am very happy with this TV, and got an amazing deal. It has capabilities to do more than I'd ever use it for, but I still like knowing I have the option should I suddenly get tech savvy. The built in sound isn't going to blow you away, but you'll most likely have a separate sound system anyway, as I do. The 3D option is especially cool. You do need to sit center and at eye level in order to get the full effect. The fact that its Natural 3D(as opposed to Active 3D) is also a plus, since I'd rather not have signals flying at my face for a pair of $70 glasses to decode, that my kids would surely break in short order. The idea of that alone could possibly give me a brain tumor.", "Date": "September 13, 2012"}, {"Title": "Toshiba 47 3d led", "Author": "paul p", "ReviewID": "R17TH6SL8SWXAU", "Overall": "5.0", "Content": "Great picture and response time. Have no problem with bleed through on this one. The speakers do leave some room for improvement but that means nothing if you have surround sound like you should if you are buying this tv. 3D is a bit tricky to set up properly but is great when done. Haven't used the 2d to 3d and don't plan to. HDMI-CEC works well. Overall this is a great buy for the price. Oh yeah great pricture!", "Date": "August 6, 2012"}, {"Title": "Great Picture, Great Looking, Minor Annoyances", "Author": "PaddyOh13", "ReviewID": "R2JKHKYS5H4OA4", "Overall": "4.0", "Content": "This TV is really nice looking, very thin and chic.  The picture quality is terrific, and the WiFi capability is awesome.  Has cool internet apps like netflix and pandora among others.  We like the Apple TV interface for netflix better, but if you don't have another way to catch netflix, this works just fine.  Streaming Pandora is great too.It has many video and HDMI inputs for all the devices you may want to hook up to it.The annoyances we have with this TV:1. The sound quality is tinny, as mentioned in some of the other reviews.  I recommend to anyone thinking about purchasing this TV to either have or get an alternate speaker system for it.  I'm no \"audio snob\" but the sound from the TV is unforgivable.2. Also as mentioned in some of the other reviews, turning on the tv, changing channels, inputs or functions on this TV seem to take an unnecessary amount of time between the time you click the remote to the time the tv responds.  This is also unforgivable.If you can get past those two issues, you'll love this TV.", "Date": "August 6, 2012"}, {"Title": "Excellent TV, but problems with an easy fix", "Author": "Mike", "ReviewID": "R3FTI3KQE22DNJ", "Overall": "5.0", "Content": "This is an excellent TV, but I do have some major headaches before I had the TV set up and working. To begin with I ordered it from Tiger direct. It took them two weeks to make delivery. The set was in broken condition. I didn't realize this until I had it totally unpacked. The set was also delivering by a local trucking company. It took another week to return the set. Toshiba does not do a good job in packaging the set. I would do whatever it takes to have the delivery driver wait, while you open the package and check for damage. The second time I ordered through Amazon. The set was delivered by UPS and was undamaged. It took less than a week. I have a strong suspicion that those people that gave the TV set, bad reviews had a TV sets that were damaged in shipping.Positives. Television has an excellent 2-D picture the 3-D picture is very good. However for 3-D only the angle of view should be straight on, otherwise the 3-D image will be distorted. In 2-D mode, angle of view was not a consideration. It is best to hang this TV on the wall so you can adjust the angle. If you plan to put it in an entertainment center. The TV should be at a height that is dead center of your viewing position while sitting.Negatives the set does not have a very good sound system. However most TV's in this category don't. So to get maximum enjoyment a home theater sound system is a must. I bought a Sony home theater sound system and a Samsung smart Blu-ray player. It took me quite a while to adjust everything. Of course I was looking for the best sound system for the money and the best Blu-ray player for the money. I got what I wanted but I had to do a lot of tinkering. So if you're going to buy the Toshiba TV, buy the Toshiba home theater sound system and smart Blu-ray player. While mixing and matching can work excellently. It is a lot of extra work unless you are a fanatic when it comes to sound.It does take an extra few seconds for the TV to turn itself on. And another couple of seconds when you turn the home theater sound system on. It is obvious that these components are talking to each other and making adjustments depending on whether you're watching 2-D or 3-D or Blu-ray or PlayStation or whatever.In closingMy system is all hardwired together including my computer. Wi-Fi is acceptable but I hardwired system always Works best. Make sure you get quality cables for your components. There are many other TV sets on the market, which you will pay a lot more money for. But you're not going to get a better picture. Occasionally this set is on sale for less than $900. I bought mine for about $850, so be patient and you can get a really good deal.", "Date": "May 9, 2012"}, {"Title": "Great 3D LED TV for Gaming!", "Author": "B.H.", "ReviewID": "R2H0XE9VQ5C7N7", "Overall": "5.0", "Content": "This Toshiba TV is an excellent choice for gamers looking to get into 3D. It offers features seen on higher end models from other companies for significantly less than the competition without sacrificing quality. I absolutely love the bezel- it is a brushed metal frame with piano-black accents on the bottom and stand rather than the all piano-black appearance which has become the standard for most new TVs. It does most things right, and the negatives are all fairly minor.PROS:-Breathtaking picture when properly adjusted. Colors are vivid and really give the picture a nice amount of pop. The TV offers a number of presets that you are then free to adjust to your liking, with the exception of \"Game\" mode.-Matte screen. This one is a matter of personal preference, but I love the fact that this TV has a semi-matte screen. I absolutely hate the trend of TV's with super-glossy reflective screens. If I want glare and reflections, I have my mirror for that. You still get some reflections, but it's not distracting to the point of being a deal breaker.-240 Hz. This helps prevent resolution loss during scenes with fast motion as well as reduces the amount of blur with said fast motion scenes.-Passive 3D. This is the same kind of 3D you see in your local movie theater with the same glasses (the movie theater glasses work with this TV). Glasses are light, don't require batteries, and best of all, are inexpensive unlike active glasses, which can cost upwards of $50 a pair. Detractors of passive 3d claim that resolution is halved due to the nature of the technology, but sitting 6 feet away, the picture is definitely not inferior to active 3D and may even be brighter and punchier.-2D to 3D Conversion. I am using this feature a lot more than I figured I would. While it doesn't magically make all 2D content 3D, it does add an interesting layer of depth. Great for sports and gaming.-Nearly UNDETECTABLE gaming lag. This one is extremely important to me, and what ultimately lead me to purchase this set. It was either this TV or the LG 47 LW6500, and the reports on gaming lag comparisons made the choice clear. Lag is virtually zero with this TV and that's without even using the \"GAME\" mode. Even using the \"Smooth\" setting on the Film Stabilization Menu, games were smooth and lag free. It's like a free performance boost. I would however recommend setting Film Stabilization to \"Standard\" while playing timing-sensitive games (First Person Shooters, Rock Band, Fighting games, etc.)-Plenty of inputs for all your home entertainment gear.-Price: I purchased this TV on Amazon for $949.99 with free 2 day Prime Shipping (I am an Amazon Prime Member). When you consider the size and wealth of features of this TV, the price and service are hard to top. I was a little concerned ordering something so major over the internet, but kudos to Amazon for their excellent service.CONS:-TV start up time is between 15-20 seconds even with the latest firmware update. May be a nuisance to some, but doesn't really bother me since I did my research on the issue ahead of time.-Internet apps and widgets are weak. The only useful app on board is Netflix. Even then, I don't plan on using it since I can stream through my game console. It would be nice to have Hulu Plus and Amazon Video on Demand.-Menus are not as well laid out as some competing models. Settings have no descriptions as to what they actually do, and the manual is not very helpful in explaining much of it. Definitely not a big deal, you can figure out most of it on your own.-No adjustable blur or dejudder. The settings only allow you two choices: On or Off. Again, not a deal-breaker by any means, but it would be nice to have the option to adjust them to your preference.-Mediocre TV speaker sound. Common sense dictates that a TV with such a thin frame would suffer in the speakers department, which it does. Not a big deal if you use a sound bar or sound system, but something to be aware of.Having used the TV for several weeks now, I would say that this TV is a great deal, even more so if you plan to do any gaming on it.", "Date": "March 14, 2012"}, {"Title": "Don't buy a Toshiba TV.", "Author": "Xini", "ReviewID": "R3VGJTUE34MZ7V", "Overall": "1.0", "Content": "I've owned this TV for almost two years now and it's caused me more frustration than any other item I've owned in my life.Pros:-Decent Picture, when it works.Cons:-\"Smart\" features cause too many problems.-Black trim pops off on it's own-The picture has a problem with repetitive horizontal lines being displayed, like a building with windows or a picket fence...  If the camera is moving, these move around and don't look right.-DOA remote control that was replaced by Toshiba right after I bought it. (I couldn't even set it up until a new remote was mailed to me taking over a week)-Takes a long time to turn on or power off.-Mine bugs out and the screen turns completely grey.  This started after owning the TV for a few months.  It took several months after that to finally get Toshiba to back order a new screen for a technician to come out and replace.  After them making me wait 3 months to repair my TV, they replaced the screen (the bulk of the cost of the entire TV) and it didn't fix the problem.Luckily, I still have a Square Trade Protection Plan to try to get to help with the repairs/replacement.  I couldn't rely on it while the TV was still in warranty because of the plan policy.  We'll see how this goes...  I'll update in the future, possibly giving kudos to Square Trade.Even after the run around with customer service redirecting me to different representatives and making me repeat my problem over and over, if they replaced my TV instead of making me wait three months for a back ordered part that they were wrong about needing to be replaced, I would have been more satisfied, but as it is, I'll never buy from Toshiba again.  I'd recommend the same to anyone else.", "Date": "January 5, 2014"}, {"Title": "Great TV for the Price", "Author": "D. Jenkins", "ReviewID": "R18LEZEB7WPRH8", "Overall": "4.0", "Content": "I purchased this in March 2012 for $899.  For the most part, I am very satisfied with the television.  It is packed with features, has a very good picture quality, and is fairly easy to set up and use the various menus.  There is a 20 second delay, and the screen appears to be a little darker, even after adjusting and calibrating the settings, but I do like the crispness of the picture and the ability to see it from angles without much degradation in quality.  The sound is marginal, but no worse than any of the other LED televisions on the market...10 watts per speaker is the standard.  So...if this is going to be the centerpiece of your home entertainment, you will want to invest in a soundbar or other home theater alternative to get the most of this television.Overall, very pleased with the build quality, features, and price of the Toshiba.  I would definitely recommend the purchase.", "Date": "January 20, 2013"}, {"Title": "Worked for awhile", "Author": "Lorrennon", "ReviewID": "R3M5Q13YA9KY7R", "Overall": "1.0", "Content": "The TV has a warm up period just enough to be annoying but if you get past that, it works OK. Great picture, but never used the sound as I have stereo hook up. The NET TV leaves a little to be desired as the choices and options are quite limited. Just because it connects to the internet do not expect to go anywhere on it or add apps such as amazon prime to it. I do enjoy listening to Pandora on it and the 3D is great. Now on to the horror story...I bought mine in February and it died in November. I have been working to have it fixed or replaced and it is now the middle of January and now Toshiba is only offering a refund minus depreciation. This is NOT how a company should handle customer service. If Toshiba cannot honor the warranties that come with the product then I must recommend against buying this TV (or any other Toshiba product) as once it breaks, you are truly on your own.", "Date": "January 18, 2013"}, {"Title": "Good price, but picture is not very good", "Author": "dc11219", "ReviewID": "R2CV5T84YNBQAX", "Overall": "2.0", "Content": "it is very slow to turn on the TV, and change between channels, it's very slow.Picture quality is not as good as other brand,like LG which have similar price, but better picture.I don't recommend this TV.", "Date": "August 9, 2012"}, {"Title": "Toshiba Horror!", "Author": "Aditya Kedia", "ReviewID": "R1O0SYFHG6T5E2", "Overall": "1.0", "Content": "Toshiba...lets see..TV out of service for the 4th time in 11 months...everytime its the same issue- main board...takes 6-7 weeks for Toshiba to send some one to replace the main board. Also, Toshiba outsources the job to some local company which take their sweet time to come to your place. Their Customer service is nothing short of a disaster. I don't know how they are still in Business..need to be reported to Consumer Act. Never buy a Toshiba product again. They only wait for your warranty to get over so that they can close your case. This company treats their customers as shit..they are 10 times worse than Dell.", "Date": "April 6, 2012"}, {"Title": "Not Completely Satisfied", "Author": "johnnyjewel \"jackandhank\"", "ReviewID": "R3AJMUAFSPKADJ", "Overall": "2.0", "Content": "Pros:  - Excellent picture  - Simpler 3D glasses  - OK soundCons:  - When TV is at \"centered\" position on the base, the TV is at a 20 degree from the base (the centering detent is off that much in the base). Attempted to disassemble base to see what was up: 3 screws came out fine, the 4th was impossibly tight. So 2 strikes against Toshiba's quality.  - Impossibly long start-up time  - Impossibly long time to change channels  - Never have been able to connect to the internet; Here is a summary from my Toshiba Forum communication:  I have now connected TV to router with network cable; I can connect this way. To make another attempt at connecting wirelessly, I have also now done the Easy Setup using PIN, entering that PIN to my router. My router thinks I am now wirelessly connected. Would that it were so; as before, the Network Connection Test tells me that I am not connected.So I have now performed Wireless Setup:  Easy Setup using PBC  Easy Setup using PIN  Assisted Setup  Manual Setup  IP Adress Setup (Manual)  DNS Setup (Manual)When I go to Wireless Information, the Status shows connected. It also shows Authentication as WPA2-PSK and Encryption as AES (even though, in Manual Setup, it said it couldn't connect because those 2 items were incorrect).Even wired to the router, I can get Netflix, but the \"Widgets\" function tells me I'm not connected.Forum response was to disable all router security and try again. Didn't work.I just received a Panasonic Blu-Ray player which I was able to connect wirelessly in 5 minutes.  So, the response I get at the Forum is: \"It sounds like there might a hardware problem with the wireless in your TV.I'd suggest contacting support at (800) 631-3811.\" We all know the nightmare that will be; they tell you to do all the things you've already done and end up being no help at all. It appears that I will be sending back this WPOS.", "Date": "December 16, 2011"}, {"Title": "still waiting", "Author": "shirleybal", "ReviewID": "R2VO1TDBH2CQ5H", "Overall": "1.0", "Content": "I ordered this TV on March 21.  It showed up March 29.  Set it up and nothing works.  Called tech support, maybe waiting for a part.  Still waiting for tech to call back and schedule something.  I was soooo disappointed.  I researched for a long time, read all the reviews but it seems I should have paid more attention to the bad reviews.  I went into a local electronics store and had experience with another brand of passive 3d and was expecting the same thing from Toshiba.  This is my first time with this company.  I am starting to think this was a mistake.  So much for all my excitement.  :((", "Date": "March 30, 2012"}, {"Title": "Last one", "Author": "Tawni L. Sliger \"bbfan\"", "ReviewID": "R1HCH4D23CZM8O", "Overall": "2.0", "Content": "At first it took about 40 seconds to turn on. Now it only sometimes turns on. I have to keep trying. The volume button won't work a lot of the time. Color is good but the picture will change from filling the whole screen to just having a square. All and all I didn't make the best buy.", "Date": "May 1, 2013"}, {"Title": "Muy bueno", "Author": "Cesar", "ReviewID": "R3I56HT1GY7E8F", "Overall": "5.0", "Content": "Muy buen televisor 3D, realmente tiente buenos colores, el diseño innovador y elegante, con respecto al 3D lo mejor es que puedes usar lentes pasivos y la profundidad en los efectos son buenos, claro los efectos y la profundidad dependerá de las películas.", "Date": "March 27, 2013"}, {"Title": "HDMI inputs are a weak link for this TV", "Author": "F. Nelson", "ReviewID": "R1L4IBEDHCAWDB", "Overall": "1.0", "Content": "TV worked great for 14 months.  Two months after the warranty expires, one of the HDMI ports goes out.  ( I am only using one HDMI input).  It appears that all the HDMI ports are controled at a single point of failure on the motherboard.  I tried all the other three ports and none of them would work.  This TV does not have composite inputs so all I have now is the input from the Coax Cable which give me a picture about one third the size of the screen.  I had a similar problem with an old Panasonic TV when one of the HDMI ports went out.  Just moved to another port and everything was fine.  This is a problem with the Toshiba.  One problem and all HD capability is lost.  It should be able to lose an input port and NOT lose use of virtually the whole TV.  WOW!!! I am so disappointed in Toshiba.  I can guarantteeeee that its replacement will not be a Toshiba.This is the one to buy if you want one that will last just long enough for the warranty to run out!!!http://www.amazon.com/Toshiba-47TL515U-47-Inch-Natural-LED-LCD/dp/B004MFFD5Q/ref=sr_1_4?ie=UTF8&qid;=1363278984&sr;=8-4&keywords;=toshiba+47+led+3-d", "Date": "March 14, 2013"}, {"Title": "Not  happy at all!!", "Author": "Reel Happy", "ReviewID": "R2HFJL4VEI3L5T", "Overall": "1.0", "Content": "I do not like this TV at all.  Now the screen has gone totally black.  Takes forever to turn on and seems like forever between channel changes.  This is my second HD TV from Amazon.  I totally love the first one from Samsung, but this thing is no where near the same quality. The sound is not good either.  wish I had done more DD.", "Date": "July 17, 2012"}, {"Title": "Great Toshiba TV", "Author": "M. Shamshad", "ReviewID": "RFUJ6DQL3U0OE", "Overall": "5.0", "Content": "This is a great Toshiba TV. I have to say that Toshiba is getting much better in technology. I give it 5 out of out of 5.", "Date": "March 5, 2012"}, {"Title": "Great price great saving and great performance", "Author": "Hector", "ReviewID": "R3MJLS3SAKI7HF", "Overall": "5.0", "Content": "I bought this  tv 47 inch at  the begining of November 2011 but I opened it right before tanksgiven, I put it on my masterbedroom because my wife won't let me place it in the livingroom anyways, I have directv satellite and wifi Internet went I hook it up everything. I was amazed at how good this tv performed in hidef,Internet,3d channels,[3 free and 1 ppv on 3d] best thing the price compare to the Sony,samsung and lg wich are way more expensive than toshiba.if you are looking for one like this you won't be disapointed.", "Date": "December 14, 2011"}, {"Title": "Missing parts and then extremely poor customer care", "Author": "Nikunj", "ReviewID": "R1SXRMG7JIJ9MD", "Overall": "1.0", "Content": "When the product got shipped it is missing a part for pedestal assembly. To return it is a big pain (it's a quite heavy) so I decided to call Toshiba for shipping the missing parts and they are taking about than one week for placing the order and haven't yet confirmed shipping the item.", "Date": "May 22, 2012"}, {"Title": "Toshiba 47TL515U-47\" TV", "Author": "M. Grabski", "ReviewID": "R2XMEN9Y4HSL13", "Overall": "2.0", "Content": "I purhased the TV new in August 2011, in September 2011, I noticed their was something wrong with the sound, so I called the cable company out at least 5 times, the last time the tech cam out and changed the entire box and wires. So it was still happening so I called Toshiba, they gave me a number to call for appointment. The service tech came out on December 15, 2011 and found the problem was the sound board and the speakers. They orderd new parts. I had a house full of people in for Holiday's to see the new TV and the sound didn't work. Then on January 6, I called the service tech wondering what was going on, they were still waiting for the parts. So I called Toshiba and was referred over to Customer Service Manager Kim, she was mean, uncaring person, who didn't care about us! So I called again today on January 13, talked with Steve and they are still waiting for the parts, Call again next week.Instead of putting WiFi on the TV, maybe put better parts in there TV.  This is not a very good thing for Toshiba, I had a Magnavox for 16 years with no problems.JUST want TOSHIBA to do the right thing", "Date": "January 13, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "1080p Full HD, the highest level of HD picture quality available today.\nBuilt-in Wi-Fi\n3D capability Natural (Passive)\nLimited Warranty: 1 Year Parts & Labor\nEnergy Saving TV. Vesa Wall mount Support: 200 x 200", "Name": "Toshiba 47TL515U 47-Inch Natural 3D 1080p 240 Hz LED-LCD HDTV with Net TV, Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51jZDF8z55L._SY300_.jpg", "ProductID": "B004MFFD5Q"}}