{"Reviews": [{"Title": "Great picture, poor sound, poor interface,,,,", "Author": "elguapo", "ReviewID": "RXHFJ7CCUMSJ8", "Overall": "3.0", "Content": "I picked this up at Conns for 499.00 which is a steal for a 42\" LED LCD.  The picture is perfect.  No complaints.  The sound was so bad, I thought that I left the protective shipping plastic on over the speakers (I didnt).  It sounds like a 1974 transistor radio powered by a 9v battery.  I hooked up some external speakers I had laying around and the sound problem is resolved.  The user interface sucks.  Sucks bad!!!  Its like working with a late 80's tv interface.  You also have to call Westinghouse to get an activation code just to get it up and running.  You cant use it without the code.  They offer a web activation url but it didnt work for me so I had to call it in.  When I asked why they did that, they said it was to make sure I got a fresh TV.......whatever.......I use this with a ROKU box and external speakers and I am happy with it.  I cant understand why they wouldnt spend a couple extra dollars on the OEM speakers and a bit more time on the interface.  If you are looking for a good picture and can scrap everything else, I would recommend this.  If you want a standalone TV, stay away.", "Date": "March 12, 2011"}, {"Title": "Good buy for price, but not top performer", "Author": "erkme73", "ReviewID": "R31NK9S4EEO7G0", "Overall": "4.0", "Content": "I purchased this unit from Costco on sale for $550.00.  It is being installed in the master bedroom of my RV - so I wasn't particularly concerned about it being the best money can buy.While there is a USB port on the back of the set, the manual clearly states it's for \"service only\".  Despite this claim in the product description here at Amazon: Easy connection for cable, Blu-ray or DVD player, game console, USB device, and PC - it will not play media content from a thumb drive.The power supply for this TV is an external 19VDC 4.74amp power brick - just like most laptops have.  This helps to keep the set thinner and lighter.  At first I didn't like the idea - but, given my application in an RV, it's actually a big plus.  I purchased a separate 12VDC to 19VDC automobile notebook charger - so now this set will run off a cigarette lighter plug!  No need to run the generator.  And at 80 watts, it'll run all day.The remote sucks.  The speakers suck.  And, the menu system looks like a 1980 Atari.  Compared to the fluid, almost Windows XP-like menus on the latest Vizio, this is really lacking.  But, for an EDGE lit LED TV,the picture really is superb.  On black scenes, in a dark room, you can definitely tell it's edge lit - as the black is very uneven.  But at only 80 watts power consumption, this is a limitation with which I can most certainly live.There is no way to calibrate the picture settings (beyond basic contrast, brightness, sharpness and temperature).  There is also no way to turn off 120Hz - which can be distracting with many non-sports broadcasts.At <30 lbs and 1.5\" thick, it's no problem to mount on a thin, no-stud RV wall with simple toggle bolts.Still, I recommend the product if it's not your primary home theater show piece (i.e. guest or master bedroom).", "Date": "November 21, 2010"}, {"Title": "Crap", "Author": "Virginia K. Underwood \"K. Underwood\"", "ReviewID": "R1LU09B0VA2DRL", "Overall": "1.0", "Content": "We purchased this tv at Costco for $449 in Feb.  The quality of the sound is horrible and the picture is really bad.  We replaced it with a LG LCD TV that is also being phased out.  It is an incredible difference.  Don't waste your money on the Westinghouse.", "Date": "March 24, 2011"}, {"Title": "Beware of Westinghouse TV's", "Author": "A&R", "ReviewID": "R28G81IXFWQ8JT", "Overall": "1.0", "Content": "In March of 2011, we purchased a 42 inch LED Westinghouse television for  what we thought was a fantastic price and thinking Westinghouse to be an established and therefore dependable name brand.  The TV worked fine for the month we had left at our winter residence.  When we returned this December, it would not turn on.  Upon contacting Westinghouse, it took close to 40 minutes to get through to Customer Service who went through their troubleshooting  without success.  We were told we would need our receipt for the warranty since the serial number showed the unit warranty was expired.  Upon faxing that and not hearing anything, I called to find out the warranty was good and they would arrange for their outsourced repair company to contact us.  This happened 3 or 4 days later when we were called to confirm the problem and again repeat the numbers on the back of the set and told that their techs would assess the problem and determine if it could be fixed and what parts were needed.  We were to be contacted in about 2-3 days.  After 5, I called to be informed that a main board was needed and it would take a few days to locate one.  After another 4 or 5 days I called to be told that the part was not available and that Westinghouse had been informed that the set was not fixable.  Upon calling Westinghouse, the customer service person put me on hold and we were disconnected.  Calling back, I was told the replacement set had been put  on back order and they did not know when it would be available.  I requested a larger TV or a refund, I was told they would not give us a bigger set and the replacement TV had to be on back order for at least 30 days for a refund.  That will put us past Super Bowl Sunday and  half way through our Florida season without the set.  Beware if you are considering a Westinghouse set unless you only need it for a VERY short time.  Or consider buying an extended service contract  from the seller that will allow you to return it to the store instead of dealing with Westinghouse's Customer Service.", "Date": "January 15, 2012"}, {"Title": "GOOD PICTURE BAD DURABILITY, READ THIS", "Author": "Dan", "ReviewID": "R3DITLP8MV9FU4", "Overall": "1.0", "Content": "This TV has a great picture, but the one problem is its durability. I had this for only 5 months before the picture just stopped working. I was fortunate enough to be within the 1 year warranty to get it fixed, but I am guessing it will happen again from the looks of all the reviews on here and on the official website, yeah even the official website is full of complaints. I think Westinghouse should think about re-building their televisions for the ideal of longevity instead of being built as cheaply as possible. When people say the picture is bad, I strongly disagree. My only issue is a durability, not picture quality. I use HDMI hook ups to my TV to my Alien-ware Aurora, it displays amazing pictures, and I use this TV to play my video games on. I am happy with my TV I'm just afraid its life span its very short. BTW THIS TV ONLY USES POWER EQUIVALENT TO A 9 Volt BATTERY, so that's pretty impressive technology, they aren't all that bad, just need to re think how they build these television.", "Date": "October 19, 2011"}, {"Title": "Nice Picture", "Author": "MadHatter", "ReviewID": "R1KSRV1JMDFF6U", "Overall": "4.0", "Content": "PROS: Great picture and color. Very thin and light weight. Matte screen helps with glare. For those of you that like glossy, this may not be the TV for you. Great price here on Amazon. For the price, this TV is VERY comparable (to me) to other higher priced LED-LCD tv's. BLU-Ray is fantastic, sporting events look great on this tv. Do not have a gaming system, so cannot comment on that aspect.CONS: First off, please let me say that there have been a lot of reviews with the sound quality of this TV. It isn't by any means great. If you are going to invest in a large screen tv, do yourself a favor and get a sound system. They aren't that much now a days and make a HUGE difference. So if sound is a concern, get a sound system or live with the sub-par sound. Picture customization screen isn't that robust.Remote range isn't all that great. Not sure if it is the remote itself or the TV. I have yet to program this TV into my cable box remote. That may be the difference.Third, the first 2 tv's shipped were defective. First one had severe banding issues on the right side of the screen. The second one would power on, but the screen remained black. The tv's arrived structurally intact, but you never know if it was a manufacturing defect or rough handling somewhere between the factory and the delivery. Box looked undamaged. Amazon was very courteous and issued prompt replacement and the shipper was great as well, working with me to have the tv delivered when I was home.For the money, I would definitely recommend this TV. LED-LCD is usually more expensive.", "Date": "January 30, 2011"}, {"Title": "DONT DO IT", "Author": "L. Ashley ~ \"fashionbug\"", "ReviewID": "R3PKUW1A9HHF18", "Overall": "1.0", "Content": "To whoever reads this please please do not waste your money on a Westinghouse TV.I waited online at Target for this tv on black friday. 1 year and 1 month later it BROKE!.. Just stopped working no picture, no nothing! Westinghouse will not even entertain the idea of fixing it! 1 year Warranty that is it!How do you sell a TV that stops working in 1 year!!! Not worth it!!I spent all my christmas money on that tv and now I had to spend another $300 to get myself a new telvisionRead the reviews of Westinghouse online, they are all horrible horrible reviews.Take your money, go to best buy and buy the extended warranty on any TV you buy for a very cheap price! trust me!!!", "Date": "March 24, 2011"}, {"Title": "Westinghouse LD-4255 42 inch TV review", "Author": "R. OLary \"Macintosh Fan & photog\"", "ReviewID": "R1337VQFT2UTTV", "Overall": "4.0", "Content": "I bought this TV from CostCo for $558.00.  Never owned a Westinghouse before, but its SPECs were compelling.  I was very pleased with its picture, and ease of set-up. No surprises, and worked well out of the box. I have now ordered Hi-Def cable option, and await the HDMI capability from it.  Sound is rather poor, but attaching its sound output to my home stereo system fixes that issue.  Also, when I click to change channels, there is a 2.5 second delay before the screen presents the next channel. Annoying for a channel hopper like me. Otherwise, I am pleased with the image quality, and the presentation of the pixels. I also look forward to the electricity bill dropping from the HUGE CRT model this replaces!  YaYY! 80 watts is a dream-come-true for a widescreen TV voltage draw!", "Date": "December 6, 2010"}, {"Title": "It was good until it crapped out", "Author": "Nathan C.", "ReviewID": "R74F7WF23NVRH", "Overall": "1.0", "Content": "I bought this TV in Feb. 2011.  The sound was never great, but the picture was good.  After 6 months, all of a sudden, there is green pixel artifacts all over the screen whenever a black or a dark color is supposed to be on the screen.  After checking my various television/cable/game console connections, I noticed that the problem was still there.  I looked into it, and it appears that a common feature of all Westinghouse LCDs is defective YSUS boards. I was reading up on consumer complaints, and it seems most of Westinghouse's products crap out after a year (just out of warranty).  In cases such as mine, customer service has been of little help, and there are cases of people never receiving their TVs once they've sent their TVs in for repair (while under warranty).  If I had known of Westinghouse's shoddy work prior to buying this piece of crap TV, I would have bought either a Sony, Samsung, or an Insignia (Best Buy) brand TV.  The crappy part is that according to Westinghouse's own warranty policy, the consumer is responsible for all shipping costs to have this TV repaired.  It did not say if there was a charge to repair the device under warranty, but I wouldn't be surprised if this is the case.  In the end, it might be cheaper for me to just buy a new TV rather than getting this one fixed.", "Date": "August 11, 2011"}, {"Title": "After First One Broke, Westinghouse Sent the Replacement DOA", "Author": "donkeysquirrel", "ReviewID": "R20EHRAYSMAMGM", "Overall": "1.0", "Content": "I'm an optimist, and generally assume the only people that write reviews are people that are angry about something. But I'm writing this as a warning to anyone considering buying this TV. Please, save yourself the frustration and DO NOT BUY this TV. I purchased one on Woot, and it worked OK for about 3 months. Then a small blue/black dot appeared at the top of the screen. Eventually the spot grew to the size of a baseball. I called Westinghouse and they referred me to a 3rd party repair company for the warranty repair. The 3rd party then had me send a digital photo of the screen to them via email. A week went by, never heard anything back, so I called the 3rd party repair company. They told me Westinghouse had decided to send a replacement, and that Westinghouse would contact me to schedule delivery. Another week went by, no word from Westinghouse, so I called them. They told me the replacement TV was on backorder...indefinitely! Finally, a month after I first called, a replacement TV shows up, with no warning, and it is dead on arrival. Now I get to start the process all over again, and still no working TV! Not only is the TV complete crap, if you roll the dice and buy one and it fails, Westinghouse customer support is even worse than the TV. PLEASE, DO NOT put yourself through this! Don't buy this TV!!!", "Date": "October 25, 2011"}, {"Title": "Great picture terrible sound", "Author": "newfierebel", "ReviewID": "R35IBEYMNDBO0W", "Overall": "3.0", "Content": "I had read reviews about poor sound quality but was still suprised about how bad it really is. Like listening to old transistor radio from across the room. The louder you turn it up the worse it sounds. if you do not have an alternative sound source, factor buying one into the cost of this TV. Picture great, backlighting works well.Another con are the connections. No component connection, and VGA and sound need special cords. 2 HDMI cords present though and work well.", "Date": "March 24, 2011"}, {"Title": "Amazing Value - Great Picture!", "Author": "NY22", "ReviewID": "R1UNS42TDZ6LQ0", "Overall": "5.0", "Content": "I love this TV! I upgraded my living room and replaced my 32\" LCD with the 42\" LED and was shocked by the difference it made! The TV is ultra light and has an extremely clear picture. Couldn't be happier.", "Date": "October 5, 2010"}, {"Title": "Great picture, excellent value", "Author": "CA Riley", "ReviewID": "R2UUK1SC4M5XM8", "Overall": "5.0", "Content": "I'm glad to see this product is on Amazon.  We have a smaller LED from Westinghouse that we've been very happy with, so we decided to upgrade to LED in the family room.  My partner bought this TV online (actually from another retailer).  Got it set up via HDMI to the HD cable box and surround sound.  I tweaked the settings a bit and am very pleased with the picture quality - I think that it is just as good as TVs that cost hundreds of dollars more.  Seriously, it's an excellent product for the price - I didn't think I could actually afford a 42\" LED!", "Date": "October 5, 2010"}, {"Title": "Good and Inexpensive", "Author": "Serge Kavetsky \"Mr. Fix-it\"", "ReviewID": "RT1WDK0CY1RHC", "Overall": "5.0", "Content": "This is a revised review, after a year of use, I upgraded this to 5 stars.My last television was a 32\" Westinghouse and it was a nice solid inexpensive unit.  I used it for 4 years and then gave it to a friend of mine when I bought this 42\" TV.  This latest one I purchased, is thinner, lighter and uses less energy, because it is lit by LEDs.  The sound is a little thin, so you will have to use external speakers, but most people run their sound through their stereo to get the surround sound effect anyway.But the best feature is the price, it was half the price of my equivalent Samsung TV, and the Samsung is already broken.  It broke after only 13 months of use.  It was only guaranteed for 12 months. I replaced it with another one of these Westinghouse units.  The picture is every bit as good as the Samsung and it does not break like a Samsung.  Not only would I recommend that you buy this set, but I would buy it again and again if I need another.Update: still going strong a year and a half after the last post. Still happy.", "Date": "June 24, 2011"}, {"Title": "Poor sound quality", "Author": "T. Assent", "ReviewID": "RAXF1348Q3O5X", "Overall": "3.0", "Content": "Don't get me wrong, the picture quality is great on this television (not better than Samsung of course)...and for the price, its an okay buy.  What I can't do is forgive them for putting these terrible...terrible..speakers on this tv. They sound like some old Coby headphones from 1997. Gotta do better Westinghouse....you gotta do better.", "Date": "April 25, 2011"}, {"Title": "Lasted a week", "Author": "S. Thompson", "ReviewID": "R1128GD7EU6640", "Overall": "1.0", "Content": "We purchased ours from Best Buy and within 10 days the picture no longer worked.  We checked the connections and finally got a picture,  but it only lasted a couple more days.  We are returning it today!  For what it's worth, it did have a nice picture while it worked.", "Date": "February 4, 2011"}, {"Title": "nice pic...terrible sound", "Author": "jayden63", "ReviewID": "R4WU1V2XCA4R7", "Overall": "3.0", "Content": "Like the title says great picture but the sound is terrible...It sounds like you are in a bandbox...you definately need a home theatre system with this tv", "Date": "April 25, 2011"}, {"Title": "Hardware seems great.  Software could be updated. Price is unbeatable", "Author": "Chris Amato \"Gumbletoad!\"", "ReviewID": "R2M2D9DQDZK9DH", "Overall": "4.0", "Content": "The specs on the TV drew me in... I figured as long as it gave me what it claimed on the box, as long as I get an extended warranty, should be good to go.  I have only owned it for one night.  I work for geek squad and see MANY televisions.  Got to admit that I would be very impressed to see a 400-600 dollar led, 120, 1080p tv.... I mean... With my discount I wasn't able to get a 60hz led to get under 600!While it is ONLY EDGE LED lit.  The picture is superb.People complain about the remote.... I really don't feel like this issue needs a comment.The only thing that I can complain about is the sound, and that issue will be fixed by getting a sound system.Apparently the power consumption of the television is amazing. I guess I will have to wait for the first power bill to see the change.So far, for my one day haha, its a great tv", "Date": "February 18, 2011"}, {"Title": "waste of money", "Author": "wma", "ReviewID": "RW1DS4B95XLX5", "Overall": "1.0", "Content": "Picked up the tv at Costco just over a year ago. Within a month of the warranty expiring it lost the picture ! Now trying to find someone to repair it is turning into a headache . What a waste of money ! Apparently the old saying that you get what you pay for is true. My recommendation would be to STAY AWAY FROM WESTING HOUSE TVS!!!", "Date": "December 4, 2011"}, {"Title": "Bad Purchase (Advertised as 120hz, when not 120hz)", "Author": "Shinko", "ReviewID": "R3BU6XUQ7VFMPG", "Overall": "1.0", "Content": "Bad Purchase.  Compared this TV to a Sony Bravia (which really is a 120hz TV) and the difference is amazing.  One is actually 120hz, and the other isn't.  I guess you get what you pay for.  There is no blur on his while there is still extensive blur in certain parts on mine.", "Date": "July 10, 2011"}, {"Title": "Don't expect much", "Author": "jordan", "ReviewID": "RRAGSUGZWMFP1", "Overall": "2.0", "Content": "Please let me preface this review by admitting that I don't actually own this TV, but I see one just about every day and had to set one up for a store display.  I can certainly say my experience with this unit is a bit more in depth than the person who received their TV two days ago and decided to wrtie a review.  Take that for what it is, and this will be a fairly brief review.The design of this Westinghouse set is actually pretty nice, but that's probably because it's aped from 2009 model year Samsung LED sets (see the UNXXB6000 series to see what I mean).  The remote is probably the worst remote I've ever seen.  Oddly, it's about the same size and shape as Toshiba remotes, so perhaps they're sourced from the same OEM supplier for their clickers.  The buttons are cramped and the labels are confusing - I looked for a good two minutes for a \"menu\" button only to realize that the menu button is actually just labeled with a picture of a list.  Yup, a picture of a list, seriously.  As soon as I hit the alleged menu button, my pupils imploded and ran down my shirt like hot molten lava from the sugary spectacle that is this TV's GUI.  Rather than being labeled with something crazy, you know, like clear text descriptions, this cartoony interface represents menu options using pictures of things like stars and rainbows.  Perhaps a good selling point if you have a young child who is a budding A/V nerd or tinkerer?  Otherwise, it's dreadful.As far as picture quality is concerned, this TV certainly doesn't look bad.  It just doesn't look good.  I think what most people don't seem to realize is that the term \"LED\" is not synonymous with \"good\" or \"better.\"  The edge-lit LED array this TV employs can often look inferior to regular ol' flourescent-backlit LCD sets.  The advantage of LED being mainly slighly reduced power draw and thickness (or lack therof) of the display, because we all know the cool thing to do is watch TV from the side nowadays.  I mean, can you imagine what your neighbors will think when they come over and see the bulging, unsightly 3 1/2\" girth coming from your hideous new TV set?  This brings me to another point: the off angle view is not great, but neither are most LCD-based televisions.  This one just didn't seem to hold up quite as well as other sets around it, losing color fidelity and pop as you moved off-center.  Perhaps the biggest problem I saw on this particular TV was its poor black level, and even worse, the flashlighting of the LED edgelight.  Under bright store lights, I can see uneven brightness distribution coming from the edge.  The fact that it was very noticeable in a bright room does not bode well for its dark-room performance, and I'd imagine it would prove distracting when watching a letterboxed Blu-Ray in the dark.It has 120Hz, and I can't attest to how well it works or doesn't work.  I will just note that not all 120Hz is created equal, and the implementation of the algorithm used by Westinghouse is probably not as advanced as found on Sony/Samsung et al. sets.If you value style over substance, this is probably perfect TV for you.  If you care about picture quality, I'd choose a CCFL-backlit LCD from a more reputable brand.  Trust me, you'll come away much happier.", "Date": "March 24, 2011"}, {"Title": "Don't Buy this TV", "Author": "Band Geek Mom", "ReviewID": "RYX578FX3W6QN", "Overall": "1.0", "Content": "I purchased this TV in December 2011 and 11 months later it failed to power on.  The local technician says it cannot be fixed.Westinghouse wanted me to ship the TV back to them.  Ship a 46\" flat screen TV??? Yep, they no longer do in-home diagnostics as stated in the warranty. Do not buy a Westinghouse TV.  Read all of the negative comments on line about their TV's, then buy a better product.", "Date": "November 20, 2012"}, {"Title": "Buyer Beware", "Author": "remy02", "ReviewID": "R3ACZSRFZCQ4ZF", "Overall": "1.0", "Content": "Purchased product on 11/21/11, loved it, great image, however it died onn 9/14/12.  Today it is 11/2/12 and after calling, emailing or live texting everyday and getting a different answer from customer service from Westinghouse Digital I was told my unit could not be repaired.  I was told it would be 10-12 weeks for a replacement or I could request a refund which would take the same amount of time.  I have read many review, this seems to happen to MANY of the customer who bought the same product.  You get what you pay for, spend the right amount of money for a product that will last and for a manufacturer who will stand behind their product.  I will never be cheap again!", "Date": "November 2, 2012"}, {"Title": "Westinghouse does not stand by product.", "Author": "scoob", "ReviewID": "RB7OMC39HZE7I", "Overall": "1.0", "Content": "Bought a tv on Black Friday from Westinghouse. TV defective. Westinghouse will not stand by warranty. Product is subpar. Customer service ineffective.", "Date": "October 2, 2012"}, {"Title": "Exceeded my Expectations", "Author": "21st Century Hermit", "ReviewID": "R2PLAGBG78CC3B", "Overall": "5.0", "Content": "Pros:- Price, I paid $399- My Dish remote did basic controls (On/Off, Volume, Mute)- Vibrant LCD colors and contrast- Color presets or individually adjustable settings- Matte screen- Low power (74 watts)- Easily attached external speakers- Useful manual- Great image via HDMI from Bluray, DVD or Xbox- Good composite image from my DVR- Power brickCons:- Terrible speakers- Slow start up, ~5-10 seconds- No auto recognition of aspect ratio- Power brickI got this from my local Small Box a couple of days before BF, so I've had it about 5-weeks. I had been considering the LG 47\" 3D bundle, but virtually no 3D content and half the price from a local store and I bit on this in spite of the many low reviews.At first I had weird color patterns, orange bands in the green grass, watching football. The manual's troubleshooting section suggested it was a composite cable problem. Checked the cable, too much strain causing the connector to be skewed, fixed that and not seen the problem in 4-weeks.The power brick is a double edge sword, another block to deal with, but OTOH possible to have no cables attached to the TV when moving, not even a power cord. Speaking of power, I measured 74 watts when on, less than 1 watt off. That's about as good as it gets with any 42\" LED LCD TV.As to speakers, instead of a $100+ sound bar, I opted for a pair of computer speakers, I had 3-pair laying around. One problem, computer speakers have a single 1/8\" (3.5mm) plug whereas all TV's have RCA jacks. To quickly convert you need this inexpensive part from Amazon: \"2 x RCA Male / 1 x 3.5mm Stereo Female, Y-Cable, 6 inch\". Radio Shack does not carry an equivalent part, bah humbug. I ordered two and give the second to my local Radio Shack.One other step in the speaker situation, you need to disconnect the TV's internal speakers, else their terrible distorted sound will add to whatever external speaker you select. If you simply turn off the internal speakers with the menu command, you no longer have volume control with your remote. You'll need an A/V receiver or some other solution. To disconnect the internal speakers, I disassembled the TV cabinet and posted photos.I have this sitting in a corner next to and almost touching two large windows, the matte screen and LCD image combine to make for a very viewable picture in the middle of the day.This TV does not auto recognize the aspect ratio of TV content, don't know if this is possible, sure would be nice. Perhaps if I get a HDMI DVR then this will be a non-issue. Currently I scroll through 4 settings on the remote to select the best aspect ratio for the content I'm viewing. In the grand scheme of things not a big issue.Overall I'm very pleased and if it dies in a year I'll only be out $400, OTOH if it lives 5-years it'll be a great bargain. Time will tell.", "Date": "January 1, 2012"}, {"Title": "Nice TV but sound not that great", "Author": "MDM", "ReviewID": "R1PZWFX0L8SXXW", "Overall": "3.0", "Content": "Sound quality is poor, features are basic and picture quality is okay. I got it becauseit was light and thin... adequate for a bedroom TV because I rarely use it.", "Date": "April 30, 2011"}, {"Title": "DO NOT WASTE YOUR MONEY!!!!!!!!", "Author": "K. Fosberg", "ReviewID": "R1O14SZSZX1MP9", "Overall": "1.0", "Content": "i purchased this TV and in three months the bulb stopped working.i called them and overa month later a tech came out.he was not able to fixt this and had to go back to WD to get a replacementwhich.. it is their policy that all they ship you is REFURBISHED MODELS!! you will NEVER EVER get a new TV like what yuo paid for.and be ready.. to WAIT 2 months to get it, and have it STILL NOT WORK.and then be ready again.. to jump through hoop after hoop after hoop, and still have no TV, just be stuck waiting for a refurbished model.DO NOT BUY ANYTHING FROM WESTINGHOUSE!!you pay less but get crap.", "Date": "November 10, 2011"}, {"Title": "Nice Picture but Complete Junk", "Author": "HJ", "ReviewID": "R1T3TO4MQBA8UO", "Overall": "1.0", "Content": "We bought at Costco for Christmas. We are on our third TV, the previous two died one after the other.  The first one lasted 15 days, the second in just 6 days.  Costco folks say these are defective and are all being returned.  I got the last one today, so I think they are done.  We will wait for this one to die, and then return to Costco and buy something else, by which time prices will come down on the other models.  Somebody is losing a lot of money on these things - don't let it be you!  Happy shopping!", "Date": "January 29, 2011"}, {"Title": "remote issues", "Author": "NotHappy", "ReviewID": "RXVK8DRUYUNPZ", "Overall": "2.0", "Content": "I just bought the westinghouse ld-4255vx,. The picture is nice, the tv is light as a feather, but the remote does not work unless I'm 4 feet away from the tv.  I programmed my cable remote to control the tv but it didn't matter. I still need to be 4 feet or less to get the tv to see the remote signals.Has anyone else experienced this? Is there a fix?Thanks!", "Date": "February 6, 2011"}, {"Title": "Terrible, quit working after two years.", "Author": "R. Baker", "ReviewID": "R1N36JVGUZ3P2E", "Overall": "1.0", "Content": "I know it's not the most expensive TV on the market, but wouldn't one reasonably expect it to last more than two years?  I have never moved it since the day I bought it, so it's not an issue of misuse or abuse.But today, almost two years to the day from purchase, it just quit working.  Won't come on, won't do anything.What's more, Westinghouse doesn't seem to care in the least.  They offer a one-year warranty, that's it.  I don't know, maybe that's standard for TV manufacturers; but the lady on the phone didn't seem surprised that it died this quickly, and certainly didn't seem to care that her company's product was of terrible quality.  You would think they might be interested in at least knowing a bit about the problem in order to ensure it doesn't continue to happen, but she didn't even seem to want to hear anything about it.I was warned about this company, but ignored the bad reviews because of the great price.  \"You get what you pay for\" is a cliche, but it's sometimes true.Save yourself the hassle, save up a few more hundred dollars, and buy a TV that won't die on you after a short period.", "Date": "March 5, 2012"}, {"Title": "Excellent for the money...", "Author": "Samjax", "ReviewID": "R10PGZD4OPGKBD", "Overall": "4.0", "Content": "Purchased this 42\" TV to use in our \"rather small\" living room replacing an old Sony 32\" WEGA CRT. The unit was purchased locally at BB and we are still within the 30 day return/exchange period. We live in a small home, complete with a small living room - a rather large window is part of this room along with an adjacent kitchen area that is usually lit up during the day. Due to the rather considerable amount of light in the living room during the day, a plasma didn't seem to be the best option due to potential glare issues. The plasma that I did consider was the Panasonic Viera 42\" TC-P42S30. The Panasonic is favorably reviewed and apparently the TC-P42S30's screen design is more of a matte finish and reflects light much less than similar models from Samsung and LG (at least on the showroom floor at BB).Back to the Westinghouse...First - the sound is truly horrible on the TV; not just bad or \"substandard\" but truly horrible. Very thin and tinny and without additional audio, this TV would be a complete waste of money. My solution was to purchase a Vizio Sound Tube for $99 along with a Monster Fiber Optic Digital cable. Sound, at least for our listening environment, is now exceptional.So far I'm out $499 for the TV, $99 for the Sound Tube and $30 for the cable. I already own a Blue Ray player and HDMI cables, so those aren't factored in. In my mind, you are buying the monitor for $499 and if you own a sound system already, you are golden. If not, you will absolutely need to purchase additional audio equipment for this to be a viable option. In my case, this turned out to be a $630 purchase.The TV remote takes some getting used to, but is not a deal breaker as such. You can adjust brightness settings quite easily by choosing a dark, medium or bright room. I normally leave it on bright room - which gives you the brightest picture.The presets are fairly decent - so far, the best overall setting seems to be the Sports setting. This gives the best balance of color saturation, black levels and vividness/sharpness. The Sports setting is also a bit brighter. My second choice is the Gaming setting, which darkens the brightness level a bit, but provides what appears to be a bit \"richer\" coloring on screen. My least favorite is the Showroom setting, which in my opinion provides a picture that is too bright and appears \"overexposed\" for a lack of better description.Seating for this TV is at 6 1/2 feet (my chair), 8 feet (couch) and 12 feet (loveseat). Picture quality is very good for all distances and the sound (thanks to the Vizio Sound Tube) is more than adequate.We are using Knology as a cable provider and of course have their HD/DVR box and their HD TV channel package. I will say this, once you are used to watching the HD channels, it is nearly impossible to drift down to the non-HD channels. The difference in quality is considerable.For now, as the system stands, the picture quality is bright, blacks are deep, saturation is excellent. Sound quality with the Sound Tube is very good.I am still deciding whether to keep this TV or return it for the Westinghouse 46\" model for an additional $200. I have $630 or so in this system and of course I wonder if $630 would get me anything else that would provide a better picture and similar sound without the Sound Tube. The 46\" Westinghouse will certainly need the Sound Tube. Other TVs in the $650 range, I'm not sure of.In any event, for a relatively bright room such as ours, the $499 invested with the Westinghouse provides you a huge amount of \"glare free\" high quality viewing pleasure.", "Date": "April 21, 2011"}, {"Title": "Great Picture!", "Author": "AB71", "ReviewID": "RPOCY1VVAXXO0", "Overall": "5.0", "Content": "I purchased this tv from BB, for $599. Clear, bright image after fiddling with contrast setting. Perfect for my blu ray, ps3 gaming, satv, anything non 3D. Best value at 42\" and 120hz. Bad speakers, but there are 2 digital audio pass-thrus with the HDMI, for connection to a receiver.", "Date": "March 20, 2011"}, {"Title": "Works but not a great tv", "Author": "Matt \"Custom\"", "ReviewID": "R3AGNRY8N1U697", "Overall": "2.0", "Content": "How did this tv get all positive reviews initially and then all negative reviews as time went on? Were the reviewers paid for the initial reviews? Were they all employees of a marketing firm?", "Date": "May 19, 2013"}, {"Title": "GREAT picture LED sound not so great", "Author": "Chris B", "ReviewID": "R2Q0G0S3GVNO2I", "Overall": "4.0", "Content": "I use my local cable company for service, HDMI cable and this picture is as clear as any I have seen.  VERY cheap to purchase.  Sound quality is about as good as the old AM radio in the cars of the 1960s.  If you are into the sound you will need to hook up your own audio.  It's well worth the price especially for sports!", "Date": "October 26, 2012"}, {"Title": "good value", "Author": "Primevil60 \"Prime\"", "ReviewID": "R1CHWWHUFZU5WV", "Overall": "4.0", "Content": "PRICE & VALUE:  I bought this TV for 400 dollars, which is a great deal for an LED.  Being an LED the picture is amazing, but of course isn't quite on par with a Sony or Panasonic.PICTURE:  This LED is very bright with excellent color saturation and dark blacks.  However, I had two problems with the default picture settings.  The first was very bright reds bled into the picture a little bit.  This was easily fixed by changing the color setting.  The second was that the contrast in this TV was a little too good for gaming.  I can't see in dark corners on video games no matter what I change the settings too.  Haven't found a happy medium with this yet, but I must say even though it is hard to see it is very realistic and looks great.SOUND:  Absolutely horrible.  Bought a ONKIO surround system the day after because I couldn't deal with it.  Dialogue was impossible to hear.INPUTS & OUTPUTS:  You have the average array of inputs, however they are limited in number.  Plenty of HDMI (4), but lacking in component inputs and digital audio inputs/outputs.  If it wasn't for my ONKIO receiver I would have to be switching stuff out in the back of the TV every time I wanted to use a different device.STYLE:  Average looking TV, looks better than my old Toshiba 46\" but nothing to get excited about.QUALITY:  Haven't had any issues, have never really noticed any issues with Westinghouse televisions, from my experience they are of high quality.", "Date": "February 8, 2012"}, {"Title": "this tv is made in the USA and it has a crisp picture.", "Author": "marc", "ReviewID": "R3GF48ONN23595", "Overall": "5.0", "Content": "I couldn't tell the difference between the Sony and Samsung it was sitting next to once we adjusted the TV back to its factor default settings.  The store (BestBuy) had the colors contrast and brightness set in some absurd way but when fixed it was clear that this TV was the best bang for the buck.", "Date": "November 19, 2011"}, {"Title": "Turning out to be okay so far.", "Author": "Ian M.", "ReviewID": "RDVR695JV6EGI", "Overall": "4.0", "Content": "I bought this TV at BB for $479, a great deal for a 42\" LED 120hz tv, better than any other deal I could find.  Initial setup took no more than 30 mins, including assembling the base to the tv and getting it all hoooked up to the cable box, xbox360, my PC and doing the TV menu settings.  The picture is amazing, but like all the other reviews state, you better have an external sound system because the default speakers are poor.  All around I am very happy with this purchase, and would buy again.", "Date": "November 14, 2011"}, {"Title": "Very good TV", "Author": "Rob from Terre Haute", "ReviewID": "RTFL3PZPIDV8N", "Overall": "4.0", "Content": "Contrary to the negative reviews, not only does this TV have a beautiful picture, the sound is just fine. The sound comes from small speakers, so don't expect theater-quality sound. I'd rate the sound as average. Also, the menu graphics are fine as well. Perhaps it depends on where one buys the TV. I purchased mine from Walmart.com in August of 2011. Overall a good bargain TV. Would definitely recommend it.", "Date": "August 21, 2011"}, {"Title": "Incredible Value", "Author": "Joshua Edelman", "ReviewID": "R3PHCYZBFATLFN", "Overall": "4.0", "Content": "Yes, the sound is horrible. Get over it! You will not find a better deal. This picture is bright and crystal clear. The colors are vivid, and the quick response time helps to minimize ghosting.I have played PS3 games and watched blu-ray movies. It plays the 24fps @ 120hz no problem.Regarding the sound, I hooked it up to a little stereo box (it has remote) and it works perfect. NOTE: if you hook up external sound and turn off the TV speaker, you are unable to adjust the sound with the TV remote. Dumb design.Buy this TV and take the extra money you saved to buy a great surround sound system..you will probably have some left over. The tuner is incredibly slow, but most of us use a box of some sort anyways.Take advantage of their dumb mistake, because it is worth the minimal hassle!", "Date": "June 13, 2011"}, {"Title": "Good Price + Bad Sound = Poor Value", "Author": "robert e mclaughlin", "ReviewID": "R1WPEFDXTVKKTJ", "Overall": "2.0", "Content": "Good picture, great price but, alas, you get what you pay for as reflected in the extremely tinny sound.  Now if the manufacturers only suggested compatable sound bars, systems that would work with their screens instead of pretending the sound was acceptable...", "Date": "April 25, 2011"}, {"Title": "Westinghouse 42 led", "Author": "Stevec", "ReviewID": "R2AQ60WAR6HH6Y", "Overall": "4.0", "Content": "The quality of the picture is good.  As noted in other reviews, the sound is not that good, but acceptable.  I bought it for my sunroom.  So I was willing to settle for a good picture at a good price for an LED HDTV knowing the sound was not going to be as good as my 42 LCD LG HDTV.", "Date": "April 25, 2011"}, {"Title": "Great TV--Great Price", "Author": "Keith Mickelson", "ReviewID": "R3JMKCHOK0IFCH", "Overall": "5.0", "Content": "I bought this TV direct from Woot.com. I discovered later that it could have been purchased from Woot by ordering it through Amazon for the same price.Upon uneventful delivery of TV, followed the instructions and had TV unpacked and working in about 30 minutes.  I agree with other reviewers the speakers are not the best quality, but I by-passed them with stereo speakers already in place from previous TV installation.Picture is vivid and we are very pleased--especially considering the delivered cost of $495.  Unbeatable value IMHO.TV is astonishingly light-weight (28 lbs) compared to the old 25 inch \"portable\" CRT clunker I hauled to recycling.Had no issues with the remote control and TV responds to commands to at least a distance of 25 ft (as far as I can get from it and maintain line-of-sight).", "Date": "April 24, 2011"}, {"Title": "Great Buy", "Author": "raphael11cr", "ReviewID": "R1OW7TM8ZCLJZ4", "Overall": "5.0", "Content": "I have a few days using the TV, nice picture, regular sound but is OK, for the price the best buy ever. I will buy another one.", "Date": "April 20, 2011"}, {"Title": "run", "Author": "contrascout", "ReviewID": "R18ROIXUGU4I7F", "Overall": "1.0", "Content": "It doesn't work out of the box without getting a code from their website or phone number....pay a little more and get a real brand.", "Date": "December 29, 2011"}, {"Title": "2 Stars is being nice", "Author": "Pacifus", "ReviewID": "R2FOPVELQFCG3O", "Overall": "2.0", "Content": "I was very excited when we got it. But before long I noticed pixelation on almost every advertisement and TV show. Sports looked very good, shows looked poor and gaming was at best 'ok.' The showroom is not a good place to see how this TV works. If you see it at a big box retail outlet you will be floored, but after more than 3 hours, you'll begin to see why the rating for the Westinghouse is so poor.", "Date": "September 5, 2011"}, {"Title": "Run", "Author": "L Shaw \"Zoe's Mommy\"", "ReviewID": "R1RF9ZNBYDZCSD", "Overall": "1.0", "Content": "I would give zero stars if I could. We bought one and was excited. It developed a problem. We sent it back and it took them 6 months to replace it. We needed to get the BBB involved to get it back.", "Date": "March 24, 2011"}, {"Title": "Westinghouse- Be cautious", "Author": "sparkler74", "ReviewID": "R23YHR8OVQVZGX", "Overall": "3.0", "Content": "Be careful with Westinghouse.  I had a 42' plasma two years ago.  The picture went out after 13 months.  Too costly to ship and repair. . . . wish I would have bought an extended warranty.  Researched the problem and found that many others were sharing my Westinghouse frustation.  Be cautious unless you don't mind paying for a disposable tv.", "Date": "March 24, 2011"}, {"Title": "horrible tv avoid at all costs!", "Author": "sooners765", "ReviewID": "R25MVR4DS79GHO", "Overall": "1.0", "Content": "dont be drawn in by the low price for this piece.. this tv doesnt have component hook ups, its sound is the worst ive ever heard on a tv, and the picture sucks as well, if you buy this tv you will be sorry like i am! the lcd tv i bought 5 years ago is better than this tv..", "Date": "May 6, 2011"}, {"Title": "Flawed TV", "Author": "Rene Molina", "ReviewID": "R1HN1142OM51M9", "Overall": "1.0", "Content": "the tv cannot display hd content without a white line dancing on the bottom. received a replacement and returned that one because of the same problem. sound was also terrible.", "Date": "April 16, 2011"}, {"Title": "Sound is awful but everything else was good", "Author": "maskinator", "ReviewID": "R1UEDFOXCXRM7I", "Overall": "2.0", "Content": "We currently have a Westinghouse LCD in our bedroom and the the TV is great.  So when I found this one on sale at Best Buy I thought great, a LED for the price of a LCD so I purchased it.  Everything was good, except the sound was awful.  I am not really picky, but we had to return this tv a week later.  Eventually we will invest in surround sound which would probably help, but could not at this time.  I am amazed that Westinghouse shipped these out the door like that.  And from the reviews I am not alone in this thinking.  Buyer beware of the sound here.  The only reason I gave it 1-2 stars is because the remote and everything else was simple and easy to use and the picture was good.  (Then when I returned it the associate tried to talk me into buying computer speakers to enhance the sound since we cn not at this time buy surround sound.  He also told me most LED's are thinner and therefore can not have the greatest speakers.  I went somewhere else and purchased a tv with sound that is far better than this one)", "Date": "April 10, 2011"}, {"Title": "Waste of money, DO NOT DO IT", "Author": "MEga SPeed", "ReviewID": "R7EQXDPA2ISIE", "Overall": "1.0", "Content": "I bought it on deal of the day on amazon by woot, the only positive thing I can mention is the price.the speakers sound like a Walkie-talkie speaker, even my grandmother noticed that.the picture is acceptable but not that good.I would NOT recomend it for any body.", "Date": "April 7, 2011"}, {"Title": "Do Not Buy This Television", "Author": "HDScooby \"HD Nut\"", "ReviewID": "R4LAH7P6KJG4", "Overall": "1.0", "Content": "I can't believe Westinghouse is still selling LED TVs.  I bought the previous model 3 years ago and it didn't even last 18 months.  I would say we put around 2000 hours on the TV. At first the screen developed some dark spots, then the unit's power failed altogether.  The problem was the design made the unit WAY too hot.  It also consumed a huge amount of electricity.  I replaced it with a Sony and the Sony is MUCH cooler to the touch, on both the screen and the back.  Don't be lured by the price (like I was!).  Pay a little more and get the Sony.", "Date": "March 6, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "1080p LED HDTV\nSlim - 1.0\" edge design and feather light 27.8 pounds\nEco - Energy Star 5.0 compliant, uses 20% less energy than a 100 watt light bulb\nVivid color - 100,000:1 contrast ratio, 22% increased color gamut\nNo Mercury, No lead, recylced/recyclable packaging printed with soy-based inks", "Name": "Westinghouse LD-4255VX 42-Inch FHD 1080p LED HDTV, Black (2010 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/31H6NkiGyKL._SX300_.jpg", "ProductID": "B0045I8ATG"}}