{"Reviews": [{"Title": "Almost Perfect", "Author": "Trvlr1700", "ReviewID": "R2PGZF1P3UF9K5", "Overall": "4.0", "Content": "Bought this TV a few weeks ago. Overall its pretty awesome - easy setup, great picture, good on energy. The sound is good for general use, but if you are picky about it you may want to get a set of speakers for better sound. Also, don't know if this is just our internet connection or not, but Netflix is constantly reloading on this TV when I hardly ever had a problem using it with the Wii on the old TV. My biggest concern is the amount of time it takes the TV to actually turn on - about a 10 second lag time. I would have also liked to see space for multiple component units. Without a switchbox, we are constantly having to switch out the cables for the DVD player, N64, and Wii, as they are not hdmi compatible. Don't let these few kinks deter you though; its good features outweigh the bad for me. I love being able to wirelessly connect to the screen (great for showing online videos or pictures)and there are so many great preloaded apps. I'm not sure I'll have enough time to learn enough to use it to its potential. Overall, great buy and a great price!Pros - picture, easy setup, user friendly, built in applications, features, economicalCons - slow loading, lack of non-hdmi component inputs, Netflix reloadingRecommended accessories - hdmi cables, component switchbox (for older electronics), wireless keyboard for typing on applications, a good vision insurance plan (for how much you are going to want to play with the tv!)", "Date": "December 9, 2011"}, {"Title": "Wonderful TV", "Author": "Christopher Allison", "ReviewID": "R2XV8A5IVCVB1M", "Overall": "5.0", "Content": "Bought this TV mainly because it has built-in Wifi, but I have been very impressed with every aspect of it.  The picture quality is excellent, it is VERY energy efficient ($14/year in energy cost), and the extras and internet apps are awesome.  This is my first Philips TV, and I think my next TV will also be a Philips.  I am overall very impressed.", "Date": "November 24, 2011"}, {"Title": "better than expected", "Author": "careful shopper", "ReviewID": "R3LB2NH8SBFK5B", "Overall": "4.0", "Content": "will continue to work on this review, but after owning for 24 hours, i like this set.downsides already noted: takes a ridiculous amount of time to power on (seriously, like 15 sec).  it's pretty heavy at 33+ lbs hanging on my wall.upsides: awesome picture, less motion blur with a football than other LED sets.  sound is a bit better than other sets, which may not be relevant for those with a receiver, but for me in my kitchen, it is nice to have.overall it is a 4 star due to my comments above.update 1/13/2012: still slow to turn on and still heavy, but i'm keeping it (after having returned two others).  by the way no issues with picking up my wifi.", "Date": "December 19, 2011"}, {"Title": "Philips TV 40PFL4706/F7 cannot use Headphones or connect to Hulu or Amazon movies", "Author": "a0188279 \"Engineering Mom\"", "ReviewID": "R35AEPO6MYTGXZ", "Overall": "3.0", "Content": "I keep finding another piece of missing technology on this \"Smart TV\"I bought this locally on clearance about 4 months go. First, Hulu was not in the \"Smart TV\" lineup, although Netflix and Blockbuster (pay-per-view) were. So I bought an external Roku-like device for $60.I just bought headphones so I could watch TV without disturbing anyone. I could not get them to work, although there is an audio jack in the back. Looking online on the Philips site, Philips indicates that there is no way to use headphones with this model directly. You have to buy an external receiver. I quote from the Philips site: \"Hi. The only possible way is to connect an external Receiver via HDMI ARC or SPDIF and connect the Headphones to this Device.\"Another device to connect to HDMI and convert it to analog for me with RCA jacks is $25. This TV is half-baked. No wonder why it was on clearance.If you know you will never use anything but NEtflix and Blockbuster Pay-per-View (not a monthly Blockbuster subscription, but pay per view) and never watch anythign via Amazon or Hulu, AND you know you will NEVER use headphones, then buy it.", "Date": "January 12, 2013"}, {"Title": "Good but some flaws", "Author": "cesaric", "ReviewID": "R3A4G8G46ZBENA", "Overall": "3.0", "Content": "Overall, I'm pretty happy with the TV considering I paid less than $500 for a refurbished one.  The time that the TV takes to start wasn't really a concern unlike some other reviewers here.  My views are mainly based on the Net TV usage since I don't have cable hooked up to this TV.Pros:- Even though the speakers are on the back, the sound quality is pretty awesome in my opinion for this type of TV.  I haven't noticed any tinny sound.  We have it sitting on a stand (the box it came in, lol) about 3 inches from the wall.- Smart TV- Crisp picture with little to no motion blur.Cons:- Too many of the Net TV channels error out when you try to play them.  Considering I bought this TV for our bedroom (no cable) and only use the Net TV, this is really annoying.- The Net TV GUI isn't the most intuitive or friendly interface.  It doesn't appear to allow you to rewind or fast forward any vTuner videos/channels.- You can't set the sleep function when you're using Net TV.  You have to go back to the tuner, set the sleep and then go back to Net TV.- You can see white light bleeding at each corner of the TV on a black/dark screen.  There's also blotches of white bleeding through on the entire screen that you can see on a black background and I can also faintly see it bleed through to the color.  This is the biggest annoyance for me considering how great the picture would be w/o this flaw.If the TV didn't have the white light bleed, I'd rate it a 4.  If the Net TV wasn't as buggy & I could set the sleep function from anywhere, I'd give it a 5.", "Date": "May 17, 2012"}, {"Title": "Awesome Prouduct !!!", "Author": "Delta", "ReviewID": "R1SOOR3S4S77GY", "Overall": "5.0", "Content": "While searching for a 40\" LED TV, I was about to spend around $900.00 to purchase one. We threw DISH Network out of our house in Decemebr because they kept raising their monthly fee and really didn't have much to offer in the way of programming. Local cable (MEdiacom) is equally as bad.My original intent was to connect this new TV to my laptop with an HDMI cable so we could watch Netflix. I've done that previously and it worked fine except we were using a conventional CRT TV and the picture didn't have the clarity, sharpness and detail that we wanted.A coworker of mine suggested a purchasing a TV with Netflix capability built in. I searched around some more and stumbled across this TV. And am I ever glad that I  took the time to do some more searching !!This TV is EXACTLY what we wanted !! The price was 'right', the features included Wi-Fi as well as a Cat 5 cable input for the Netflix feature. There are also about a dozen other 'apps' (including Facebook) that I'll probably never use, but they're there is the user wants them. Picture quality is also supurb as well as the sound quality.While I find accessing Netflix on a desktop or laptop somewhat 'cumbersome', Netflix on this TV is a 'whole new ballgame'; much easier to navigate by simply using the TV's remote. Also forget about paying a high price for high speed internet to get Netflix to work on this unit; I'm paying $14.95/month for 1.5MB download and Netflix works just dandy; no pausing, no jerking, no 'buffering'.While Amazon didn't have this unit in stock, they forwarded my order to one of their suppliers. I ordered the unit on a Tuesday, paid an extra $48.00 for 'expedited shipping' and received the unit on the following Friday afternoon via FedEx.Setup was quick and easy and within thirty minutes of unpacking the unit and rearranging the furniture to accomidate our new purchase, we were wathing this wonderful piece of an electronic marvel. And stayed up until after midnight watching 'over the air' TV and Netflix. Highly unusual for us.There was also very little information in the owner's manual about the remote control. But after looking at the remote control more closely, if somebody can't figure it's simple (but efficient) operation, they won't be capable of appreciating and comprehending what a great piece of electronic entertainment equipment this TV truly is.HIGHLY RECOMMEND buying this TV !!!In short, GREAT unit, GREAT price, QUICK delivery and you know that you can put your faith in this unit because you'll be ordering it through AMAZON.com.", "Date": "March 8, 2012"}, {"Title": "Great overall purchase", "Author": "Stu", "ReviewID": "RLEODBAQ374FP", "Overall": "4.0", "Content": "I bought this TV a few weeks ago when the price was down to 489 - couldn't pass it up - there were no sales taxes or shipping charges, so the purchase was an easy decision after looking around online and in tech. stores.The Net TV (wireless internet access) works well and I can connect to Netflix and YouTube easily. The picture set up is user-friendly, but if you're like me and like to tweak the picture a bit more after the initial install,just go to the menu and happy travels.I gave this a 4 star rating for two reasons: (1) The MedicaConnect option for laptops is NOT compatible with Macs, which was not advertised on Amazon and required some research. If you are planning to watch videos through your laptop or just browse the web using the big screen and have a Mac, choose elsewhere.(2) The other fault I found is with the difficulty of screwing in coax cables for cable or antenna TV - the input is vertical with the TV and placed around a plastic shell, making it a bit difficult to screw the cables in (this is a very minor detail)However - the USB port allows for easy video, pic, and audio access (it only plays MP4 vids, so get a converter on your computer if you want to watch MKV or AVI files)and the picture is EXCELLENT.Overall, great value and great purchase.Cheers, and happy buying!", "Date": "March 21, 2012"}, {"Title": "This is our 2nd Phillips TV", "Author": "RN", "ReviewID": "R20VLID2EU3JEH", "Overall": "4.0", "Content": "This is our 2nd Phillips tv and we are very pleased with its picture and performance. We did read reviews for this particular TV prior to buying it and the one thing that I read and will confirm is the fact that it takes several seconds for the TV to turn on, but that is a small inconvenience. The Wifi feature is very nice for watching netflix without anything else hooked up.  I would recommend this TV for it performance and price point.", "Date": "February 13, 2012"}, {"Title": "Will not work with a Philips Soundbar", "Author": "Book Enthusiast", "ReviewID": "R32YQQ8M0A15QW", "Overall": "2.0", "Content": "I just bought this TV a couple of weeks ago. The picture is pretty good but the audio is TERRIBLE.  The speakers are on the back so unless you're standing to the back of the TV or to the sides, you get a tiny, almost mono-like sound quality and you have to turn up the volume WAY up to hear anything.  Yes, I did try various settings on the TV, to no avail.  I don't understand how people can rave about the sound of this TV unless they connected it to some speakers or a soundbar.  If you did, please let us know specifically what brand/model of speakers or soundbar you are using and how you connected them because I had the worst experience doing that.  Read on:In desperation, I decided to buy the Philips CSS2123 Soundbar to try and improve the sound. I figured that by buying the same brand, I would avoid any connection problems.  What a mistake!1) This TV does NOT have digital optical audio output (the soundbar does have that).2) This TV does NOT have analog audio outputs connection either (confirmed by a Philips Audio technician).3) The only audio output this TV has is for Coaxial Digital Audio.4) This TV does NOT have the option to change the audio to \"PCM\" or \"Standard\" as it required for the Philips sound bar to work.  It only has its default Dolby Digital setting.5) Connecting the soundbar to the TV with a coaxial digital cable may or may not work. I didn't even bother trying because:  a) the Dolby Digital might cause the soundbar to hum loudly while playing the audio (according to various Philips sources, including the Philips Audio technician)  b) I watch over the air TV (I don't have cable so I don't have the option to connect the soundbar to a cable box or anything) and was told by Philips Audio technician that some over the air stations only broadcast in Dolby Digital so I would NOT getting audio on those channels at all (though the soundbar).So in the end, this 2011 Philips TV will not work with a 2012 Philips soundbar.  How does this even make any business sense?I am returning the soundbar and will probably return the TV too. I didn't buy them through Amazon but since most people come here to check the reviews, I figured I'd put in my 2 cents and try to spare the same experience to someone else.Another note about the TV is that the MediaConnect option was useless for me.  I could NOT play any videos from my external GoFlex drive on the TV, HD or standard.  The connection would drop automatically. I COULD look at my pictures though.  Similarly, I could NOT watch any videos playing from our computer on the TV over the Wi-fi.  This is a problem since my husband specifically picked this TV so he could watch his online sports events on the larger TV via Wi-Fi.The NetTV option is also useless for us because we do have a Roku 2 XD to stream Netflix, Pandora, and others.  I guess it's useful if you don't have such a device.EDITED TO ADD:  a few hours later... thanks to Roberto at my local Target who told me on plain terms that the only soundbar that will work with my TV is one that plays Dolby Digital (since that is the only audio setting for the TV) and that I would have to use the Coaxial Digital Audio cables (which they sell, Amazon also sells them).  I ended up going to Best Buy and picking up a Yamaha YAS101BL Soundbar.  It's more than double the price of the Philips, but guess what?! It works with this TV! It even lets the TV remote \"learn\" the operation of the soundbar so I can control the sound with the TV remote and it turns on/off when I turn the TV on and off. I don't anticipate using the separate remote much.  The only \"glitch\", which is a Philips problem, is that if I use the TV remote to control the sound, there is a message that appears on the bottom 1/4 of the screen for a couple of seconds warning me that the speakers are set to \"off\". Well, duh, it's supposed to since I have a soundbar connected!  Best best didn't have the coaxial digital audio cable so I went back to Target to get it.So I'm still not happy that I had to buy a soundbar to get a decent sound from this TV, not happy that I couldn'tuse the Philips soundbar, not happy that there aren't any warnings anywhere on the Philips website or documentation for the TV or the soundbar, but at least I didn't have to return the TV, which would have been a PITA.", "Date": "June 18, 2012"}, {"Title": "Cannot Fault this TV", "Author": "djl", "ReviewID": "RXXK681YWK671", "Overall": "5.0", "Content": "Great value HD TV, very easy to set up and connect online. I found the sound was a little inconsistent (volume wise) but after running a software update that issue disappeared.The start up time that others have reported was not an issue for me (approx 5 seconds is nothing!!!).Netflix works seamlessly on my modest 2MB home internet connection.All in all a great value product - definitely recommended.", "Date": "April 30, 2012"}, {"Title": "Good picture. Slow to turn on.", "Author": "Golfer", "ReviewID": "RDFKGU3IOE9R2", "Overall": "4.0", "Content": "This TV has an excellent picture.  The main drawback is something I read about in other reviews and that is it takes a long time to power up, which is true.  But, it seemed a small price to pay.", "Date": "December 29, 2012"}, {"Title": "Philips 40PFL4706/F7 40-Inch 1080p LED LCD HDTV", "Author": "KDennison", "ReviewID": "R2N3HMQEQ5PKJI", "Overall": "5.0", "Content": "I purchased this TV through Amazon several months ago and at the time, I only paid about half of the list price plus free shipping.  I gave 5 stars, but it probably only deserves 4 1/2 because of the wireless MediaConnect feature, which is what initially made me choose this and I have been very happy with other devices made by Philips.  I think that Amazon does a pretty good job of detailing all of the pros in the description, but I'll go through a few of the cons.1.  I purchased a dual band internet router so that I could use my laptop and TV at the same time without too much lag.  The downside is that the TV only runs the 2.4 Ghz band and not the 5 Ghz.  Nice for my laptop to run 5 Ghz, but not so nice for the streaming YouTube or Netflix on the TV.  It works okay, but some YouTube videos have to be paused before they will load completely.2.  MediaConnect...I had high hopes for this program, but it has been a bit let down.  It would probably work fine with a faster computer and not a laptop, which constantly overheats when running the program and will often disconnect.  Also, since I don't own a DVD or Blu-ray player, I watch all movies through my laptop, but MediaConnect says, \"You can't project commercial content from DVDs and Blu-ray discs because they are copy-protected.\"  I ended up just buying an HDMI cable and keep my laptop around the TV if I want to stream from the PC.3.  The TV only plays certain types of media files, which is probably the case for most televisions, but it still makes things difficult.  This TV allows you to access the media files on your computer by choosing PC from the source menu and you can also plug in a USB thumb drive.  Again, it will only play certain files and they must be on the same band.Everything else is wonderful!  I like the size, the appearance, the weight, and the ease of functions.  The Net TV is what I use the most since I don't have cable or satellite.  Software updates are quick and easy (usually if the apps aren't working properly, then it needs an update).  The sound is not bad, the speakers are just located in the back, so I'm thinking of making something that will project the sound to the front of the TV.  The VUDU app is great for watching your UltraViolet movies and Flixster films.  YouTube app is great for watching music videos and free movies; you can also navigate through your subscriptions and playlists for easy access to your favorite videos.  I hope that in the near future, Hulu Plus will be added.Overall, I'm really pleased with my purchase and I don't think I'll be purchasing another TV for a very long time.", "Date": "November 14, 2012"}, {"Title": "Love it!", "Author": "patti", "ReviewID": "RRUX1QWEJYFKD", "Overall": "5.0", "Content": "I purchased this tv after Christmas and it is awesome! Perfect picture, wifi works great-netflix and lots of other apps.  I couldn't be happier, and it was a breeze to hook up.  I have absolutely  no complaints.", "Date": "April 8, 2012"}, {"Title": "Manufactured in Nov 2011 but stopped working April 2013", "Author": "Sjelefred \"Freddie\"", "ReviewID": "RW3VUX9K52ULB", "Overall": "1.0", "Content": "My TV powers on, displays the Philips logo and then powers off immediately.  We spent a lot of money for Philips to bombard us with branding and nothing else. When it worked, it had a great picture. Sadly, now that the power will not engage, our only viewing choice is a black screen. Because my set is no longer covered by warranty, Philips's takes the position that repair is the responsibility of the consumer even though one of their customer service agents agreed that circuit board issues are unexpected and atypical for a TV manufactured in Nov. of 2011.  They keep offering discounts on refurbished TVs as a solution to their poor manufacturing. I chuckle as they blithely and continuously offer more of their product to someone who has lost faith in the quality of their technology and customer service. This particular Philips TV model proved to be a lemon. My past experience with Philips products has always been favorable so I am very surprised by our user experience regarding both the TV and customer service.", "Date": "August 22, 2013"}, {"Title": "Poor network connection, automatically restarts", "Author": "Simran", "ReviewID": "R1VPP4G4KV7VW7", "Overall": "1.0", "Content": "I had tried 2 of these TVs and both TVs had problem with the network. I use my TV with netflix and I have to wait for several minutes for the TV to recognize my wireless network. My 2nd TV at 1 month had issues with the wireless. It was too big for me to return, so they had to service it (it was under warrantee at that time ofc). The TV now also has issues with cable. It automatically restarts and sometimes gets frozen frames. Very unhappy with this product. Will not buy this brand in future.", "Date": "July 16, 2013"}, {"Title": "Great product", "Author": "shockwave", "ReviewID": "R4SJKC9RA47I8", "Overall": "5.0", "Content": "Very nice TV. Great buy for the money.  I would recommend it to everyone. Great picture and sound. The sound has a surround sound feel to it.", "Date": "March 4, 2012"}, {"Title": "Very good TV", "Author": "Ahmad Hirbawi", "ReviewID": "R37W0WC6HAFW7R", "Overall": "5.0", "Content": "Its a very good TV, great picture and sound. connect easily to WIFI internet. some reviews said that its slow when start or turn off, but for me i found it normal (not fast and not slow too), it maybe doesn't contains too many HDMI inputs but its not that big deal. as a conclusion am very happy with this TV.", "Date": "February 26, 2012"}, {"Title": "Amazing TV", "Author": "Fred", "ReviewID": "R2Z0CJ1NOEWMU7", "Overall": "5.0", "Content": "This tv is amazing, awesome picture and great network options, speakers are awesome. Only thing missing from the tv is digital audio input or output. Still a great buy", "Date": "February 20, 2012"}, {"Title": "Worst TV i've ever owned", "Author": "Palin Estupido", "ReviewID": "RM3F8R4SRPYBN", "Overall": "1.0", "Content": "Takes way yo long to start on power up, too long to turn off (image goes off but sound continues for several seconds).  Turns on randomly at times. Netflix is incredibly slow to load over wifi and with direct ethernet connection. Neyflix also cuts out at times. I know this is the tv, because a wii on my other tv has no problems at the same time. The image and sound are fine, but the software and remote are so horrible that they've ruined this TV for me.", "Date": "November 18, 2013"}, {"Title": "Very Weak WiFi Reception", "Author": "Sebastian Rutigliano", "ReviewID": "R16V88DETXZOO6", "Overall": "3.0", "Content": "Very Weak WiFi Reception!!!  Your wireless router has to be very close to the TV... no way to update the apps on the net tv (like adding Amazon)", "Date": "June 20, 2013"}, {"Title": "ambitious but unfinished product", "Author": "Harutyun Avagyan", "ReviewID": "R1DRS4QM38JNMA", "Overall": "1.0", "Content": "I bought it assuming the MediaConnect option will help with wireless mirroring of the computer screen. It appeared that MAC is not supported, so I had to get a windows laptop and after all it didn't work properly also under windows.", "Date": "August 11, 2012"}, {"Title": "philips 40pfl4706", "Author": "ALB", "ReviewID": "R2JHEZ7IRV64M7", "Overall": "5.0", "Content": "I just purchased this TV in February of 2012. This model comes with the Wi-Fi LAN adapter, which makes the TV Wi-fi ready . It is Internet-enabled and does access online content, but does not offer full web browsing capability. Contrary to some comments, the Wi-fi MediaConnect operates just fine (know how to configure your firewall setting to allow incoming/out communication between the the tv and pc).The primary reason why I purchased this TV is because it is Wi-Fi-capable. You can connect it to your home network wirelessly. Once you figure out how to setup the features on your computer to browse on your tv, it's like being a kid in a candy store with $100 to spend. I would also recommend using a 11n wireless card or better for optimal streamimg.The SRS TruSurround HD sound quality is also pretty impressive. I haven't hooked up my 5.1 receiver yet, but if I didn't I wouldn't mind having the TV stand only as my sole audio source. The picture quality is what I expect from a LCD/Led 1080p resolution set, which is great. If you're \"in-turn\" with today's technologies, this TV is the one for you too. Especially for the price. I don't see it getting any better than this!!!", "Date": "February 19, 2012"}, {"Title": "excellent tv", "Author": "kurt z", "ReviewID": "R12V0AFC1MXC4S", "Overall": "5.0", "Content": "great picture, easy to set up.  connects to wi-fi very quickly.  highly recommend.  very good sound quality when not connected to home theater.", "Date": "February 15, 2012"}, {"Title": "Has No FlashPlayer", "Author": "CulinaryGate \"OrganicArts\"", "ReviewID": "R140UHAWXUKYIR", "Overall": "1.0", "Content": "The majority of videos, movies, series & shows available on the internet today are viewed in FlashPlayer.Philips has no FlashPlayer & doesn't allow you to add it.You're paying big money for the computer part of this tv with limited functions designed to be that way by Philips. You can surf the internet, but you cannot enjoy videos in flash. For example no video.pbs.org to watch the NewsHour.The RAM is too small which makes it slow.Recommend:buy a large monitor for your PC & upgrade.", "Date": "October 8, 2012"}, {"Title": "Philips customer services sucks", "Author": "Reviewer9970534", "ReviewID": "R1PGGQ8KYHJ1ZT", "Overall": "3.0", "Content": "I am writing this review without ever having turned this television on. I am doing so because I have owned this product for over five weeks and have yet to receive all of the components necessary to turn it on. I received the package with a television and stand, but no screws, power cord, or remote control. I have called many, many times and each time I am told the parts are on there way. Spoke to a manager today and they just repeated that there is nothing they can do, they have sent the order to the parts department and that is that. Rad. Thanks Philips. My $600 box is looking sweet leaning against a wall in my basement.05/20/13--Some follow up on my experience: I received the parts I needed after about 10 weeks. After some frustration trying to set up the wifi capabilities of the TV, I figured out this product does not work with Mac so I can't link to my computer wirelessly as I had wanted. I am able to link up via HDMI to watch shows off my laptop or phone. As for its qualities as a television, I would say I am pleased. It has a good image quality and the sound is good enough as is to watch movies without using a stereo. I did try to hook it to my stereo and found out that this TV only has digital audio out. My stereo does not have a digital audio connection so I am going to by a converter off Amazon and give that a try.", "Date": "March 22, 2012"}, {"Title": "advertising on box?", "Author": "Paul D. Hillman \"phillman5\"", "ReviewID": "RXBDZU94BOSYZ", "Overall": "2.0", "Content": "I looked at one of these at Costco.  There was a sticker on the box promoting MediaConnect, which I found hilarious.  It says Media Connect is compatible with WIndows 7/XP/Vista, yet the symbol above the 'o' is what MacOS X uses for WiFi signal strength, and the picture is of a Mac Book Pro laptop.  So Mac owners beware, I don't think this MediaConnect is Mac compatible.  My two stars is for the completely stupid advertising/box design team, and the product not being Mac compatible.After searching Phillips site, I found a FAQ, the summary says only windows, but opening the FAQ says MediaConnect does support Mac OSX 10.5 or later.  Very poor on Phillips part.[...]", "Date": "June 2, 2012"}, {"Title": "Phillips media ready tv 40PFL4706", "Author": "frranny \"frranny\"", "ReviewID": "R1F6NM92T8WF1C", "Overall": "2.0", "Content": "Phillips 40PFL4706 is NOT media ready...have spent hours trying to install and connect the media- connect software, still says it cannot see the tv.... save your money...bad Sound, mediocre picture. Chat agent said they were not familiar yet with this technology???? TV CANNOT SEE NETWORK AND BRAND NEW LAPTOP CANNOT FIND TV.", "Date": "December 11, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "40 inch 1080p Full HD LED display\nPixel Precise HD for extremely sharp and clear pictures\nSRS TruSurround HD for powerful sound\nBuilt-in internet TV that connects wirelessly\nConnect a PC to a TV wirelessly with Media Connect", "Name": "Philips 40PFL4706/F7 40-Inch 1080p LED LCD HDTV with Wireless Net TV, Black (2011 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/51B2mGXtSIL._SX300_.jpg", "ProductID": "B004SP1390"}}