{"Reviews": [{"Title": "Visio E551VA HDTV", "Author": "Coffee Drinker", "ReviewID": "R3B9V8ZDWFMORF", "Overall": "5.0", "Content": "This is actually a review of the E551VA rather than the E551VL, but they are very similar. In fact, in terms of the picture itself, I don't think there's any difference at all. Visio's website refers to them both as \"55-inch Class LCD HDTVs.\" Also, I did not buy my TV on Amazon but I'm reviewing it here anyway because I heavily relied on Amazon customer reviews before buying a Visio TV in general and a Visio 55-inch Class LCD HDTV in particular.Picture wise, I don't see how it could be noticeably better. Just in case you don't yet know: Both \"LCD TVs\" and \"LED TVs\" are really LCD TVs. The difference is that SOME LCD TVs use LEDs for backlighting the edges, instead of fluorescent backlighting. Some manufacturers call LED-edge-lit LCD TVs \"LED TVs,\" but they're really still LCD TVs. So why did I choose a fluorescent-back-lit LCD TV for my first flat-screen TV? (1) They're a lot cheaper; (2) This Visio LCD was the brightest, sharpest, overall best looking TV picture of the dozens of LCD and \"LED\" TVs that were on display at Costco; (3) Specifically, the brightness from extreme side viewing did not diminish at all like many others did, even on the edges--a big plus for my installation; and (4) I could not have cared less whether the TV had a 2\"-wide black plastic frame around it (like \"LCD\" TVs have) or a 1\"-wide black plastic frame (like so-called \"LED\" TVs have).This review was entered on February 17, 2012. My son and I mounted it on the wall. The power cord and HDMI cables to all of my components (DirecTV, DVD/Blu-Ray player, and VHS player) go through a 2.25-inch hole in the wall behind the TV into a closet in the next room. All you see in the living room is what appears to be a wireless flat-screen TV hanging on the wall. We've only had it a month now, but we think it's terrific. Zero problems. I'll amend this review after several months and after a couple of years to let you know how it holds up.[EDIT June 21, 2012: After four months, this TV is still operating perfectly.][EDIT November 28, 2012: After nine months, no problems at all.]", "Date": "February 17, 2012"}, {"Title": "Great Value and Great Picture", "Author": "David Underwood", "ReviewID": "R1NKYS5V09QRWO", "Overall": "5.0", "Content": "This is our second Vizio.  The first one, I won in a drawing 4 years ago. It is a 37 inch.  It has a great picture and has preformed perfectly.  That had alot to do with our purchasing this Vizio 55 inch.  It fits right above the fireplace and has a great picture, easy controls and I hope we get several years of service from this one too.  Amazon had the best price... we shopped!  Delivery was on time, to my den where the gentleman helped unpack, test and place the tv where it is now.  Thanks Amazon!!!", "Date": "December 13, 2011"}, {"Title": "Best Picture I Have Seen in A  TV", "Author": "Charles W. Vanwagner", "ReviewID": "R1DT5ASZEX1R3S", "Overall": "5.0", "Content": "The E551VL has the best picture of any TV I have Seen.Very easy to set up,and has all the conections I need. Colors are excellent as they are in defaut settings.I did my reasearch online, did not find a better price online.I would recomend to anyone, Buy It At Amazon.", "Date": "November 11, 2011"}, {"Title": "Fantastic", "Author": "hapydee", "ReviewID": "R2BM5TUU2HYD4T", "Overall": "5.0", "Content": "We are very pleased with this TV.  The picture surpasses our Sharp TV.  It's almost like 3D.  The tv was recieved in great condition & the delivery man helped set it up to make sure everything was A-OK.", "Date": "May 22, 2012"}, {"Title": "Excellent value for money", "Author": "Brian Henderson", "ReviewID": "R3UU99ZX0S9I9P", "Overall": "4.0", "Content": "The picture quality is as good as I can discriminate. The sound quality is very good, and can go much louder than I require. The TrueVolume function does not appear to do anything, which is only a real problem when playing movies as the dynamic range on movies is very high. That's the reason for knocking it down to 4-stars...I did however buy the 'wrong' model. I got the one with PIP not the one with WiFi and Internet Apps. Turns out PIP only works with TWO sources (I.E. Two or more HDMI inputs, and I run off only my HDDVR.", "Date": "May 10, 2012"}, {"Title": "vizio hdtv", "Author": "el-n", "ReviewID": "R264XY4VDSKV43", "Overall": "5.0", "Content": "i was nervous buying a big-screen tv thru the internet, but as usual, amazon amazed me and i am very happy with my purchase.  i'm no techno-geek, just a mom that wanted a nice hdtv with a great picture for a fair price, and i got all that with my vizio 55\" tv.  very happy all-around with my purchase, and i would definitely recommend it!", "Date": "April 10, 2012"}, {"Title": "Excellent TV", "Author": "Penelope Smith \"penross\"", "ReviewID": "R8NG0TQ5C80NT", "Overall": "5.0", "Content": "After spending a lot of time researching 50\"-60\" TV's, we selected the Vizio E551VL 55\" LCD TV.  Amazon had the best price on this model.  The TV arrived when promised, in perfect condition and has been beautiful from the moment we connected it.  We find the sound to be as good as our unsophisticated ears could want without any additional sound equipment to run it through.  The picture is vivid and well-defined after very little adjustment.  We are enjoying DVD's as well as TV and couldn't be more pleased with this purchase.  I have no reservations in recommending this TV.  It is an excellent value.", "Date": "April 25, 2012"}, {"Title": "Buy a better TV - Customer service is terrible", "Author": "A", "ReviewID": "R32FOIJ5SHJOK5", "Overall": "1.0", "Content": "I've had 2 major problems with my Vizio within 2 years of purchase. About $100 less than the cost of the TV each time. Their customer service is TERRIBLE. Save yourself the trouble and buy a better quality TV.", "Date": "April 12, 2012"}, {"Title": "Vizio 55 inch HDTV", "Author": "James Hamlin", "ReviewID": "R3GMFYRDCKAVZX", "Overall": "5.0", "Content": "I recommend this HDTV to anyone, and I have a 37 inch, and this 55 inch, and they are Wonderful!!!!!!You can't go wrong with a HDTV Vizio!Thanks for your Prompt delivery!Bought on Amazon.com!", "Date": "September 15, 2012"}, {"Title": "POP Feature a Big Plus", "Author": "MTommy", "ReviewID": "R1YY7600TMCY8O", "Overall": "4.0", "Content": "I'd probably go 4.5 stars if I could, I think this TV is very nice for the price point. My only hang up is that sometimes the picture looks great and other times it looks a bit dull or faded. I guess maybe I haven't quite got all the settings correct. Anyway, the reason I chose this TV is the ability to watch TV on one side and play PS3/Xbox on the other side at the same time. This was honestly THE major factor in my decision to go with this model. Overall happy with it, just wish I could get a little more consistency out of the picture quality.", "Date": "August 21, 2012"}, {"Title": "Awesome!", "Author": "Sherie Safford", "ReviewID": "R1PL70RO5VUXSI", "Overall": "5.0", "Content": "Great product, love the picture and we hooked it up to surround sound and WOW cant imagine ever going to the movies again! Its more fun at home!", "Date": "March 13, 2012"}, {"Title": "wow", "Author": "just me", "ReviewID": "RDB0JL1WQY3LL", "Overall": "5.0", "Content": "I love this Visio tv.  The refresh rate offers a very clear crisp picture.  Very pleased with purchase and I would never buy anything other then Vizio.", "Date": "January 2, 2014"}, {"Title": "great picture, but not full screen", "Author": "J. Ferras-Nuckles", "ReviewID": "R3TF9XW3FWJVD7", "Overall": "3.0", "Content": "I have played with the settings on this thing over and over again, and cannot seem to get the picture to go wide screen unless we are watching in HD.  Some of my kids cartoon channels aren't in HD, so this is a little disappointing.  Otherwise, the picture is good.", "Date": "December 26, 2012"}, {"Title": "Google \"Visio TV Black Screen Of Death\" Before You Buy Visio", "Author": "D. Bitz", "ReviewID": "R1C48O1O8I7PAT", "Overall": "1.0", "Content": "I bought a Visio LCD TV from a warehouse store 3 years ago (but I do a lot of purchasing on Amazon also). The same day I got home from total knee replacement surgery the thing wouldn't come on. The light changes from Orange to white, but nothing but black on the screen. I had been planning the knee replacement some time and had spent the previous couple years accumulating things like this TV and an adjustable bed so I would be comfortable so you can Imagine my frustration.I unplugged it and all that stuff to no avail. Next step was a Google search to see if anyone had any suggestions. OMG, see for yourself, Google \"Viaio TV black screen of death\". That's right, there's a name for it affects various models and sizes.Visio's response? \"One Year Parts And Labor\" $800 repair quote.Under no circumstances would I ever purchase a Visio product again. ZERO STARSGoogle \"Visio TV Black Screen Of Death\" Before You Buy VisioI have recently purchased a Sony 55\" Bravia, FAR better picture than the Visio, no comparison.", "Date": "March 7, 2012"}, {"Title": "AN AFFORDABLE QUALITY LCD HDTV", "Author": "Jacob Mathew \"KODATH\"", "ReviewID": "R1442L9N6ZHASN", "Overall": "4.0", "Content": "I AM SO FAR IMPRESSED WITH ITS PICTURE AND EASE OF OPERATION. PLEASE NOTE THAT IT HAS ONLY 3 HDMI IN PORTS AND ONLY 1 COMPONENT VIDEO OUT PORT WHILE MOST OF TODAYS LCD HDTV HAS 2 COMPONENT VIDEO OUT. SELECTION THE VIDEO IN SOURCE IS TRICKY ....", "Date": "June 20, 2011"}, {"Title": "It was ok", "Author": "Keyalaing21", "ReviewID": "RX116QTTE1KWI", "Overall": "3.0", "Content": "I can't really say much about the tv because I only had it a short time before it was stolen. However, my initial thoughts of the tv was that it was sort of bulky, and the dimensions were actually less than expected due to excess panelling. But overall the picture quality was good and it also allowed me to view digital channels I didn't know I even had.", "Date": "November 5, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "1080p Full HD\n120 Hz refresh rate\n100,000 to 1 Dynamic Contrast Ratio\nSRS TruVolumeTM and SRS TruSurround HDTM audio\nAmbient Light Sensing technology", "Name": "VIZIO E551VL 55-Inch 1080p 120 Hz LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41REllQk3OL._SY300_.jpg", "ProductID": "B004QZ9Y8E"}}