{"Reviews": [{"Title": "Amazing TV", "Author": "Author Ty", "ReviewID": "RPS7SJWEGIPN7", "Overall": "5.0", "Content": "I've had this set for almost 3 weeks, and I absolutely love it.  The picture is amazing; I compared it to sets with 1080p, and I like the picture on this one better.  The sound is also fantastic; loud, clear, and with several different settings for TV, movies, etc.  Speaking of settings, the menus are easy to follow and allow you to set the picture just the way you like it.  The remote is easy to use, and the only thing I don't like about it is that it has a slightly curved shape and tends to fall off the coffee table or sofa from time to time.  Otherwise, I'm really happy.  I did research for about a month and had a hard time deciding between this set and a Panasonic, but I'm glad I went with this one because it's fantastic.  One other note---do not buy overpriced cables for this or any other set!  I bought a $4 HDMI cable from Amazon and it works perfectly.  Why pay $20, $30, or even $50 for an overpriced cable that doesn't work any better?UPDATE APRIL 18:  I'm still loving this set, but I like it even more now that I've learned how to tweak the picture controls.  The default settings have the brightness controls set very high; once I turned that down, the picture looks even more amazing.  I also learned that I can set the picture and sound controls for each input device (cable box, dvd player, etc) and those settings will be saved and reappear each time that device is used.  This is really handy if you like to use different settings when watching a movie, for example.  My advice is to spend 10-15 minutes reading your manual carefully to learn what all the picture settings do, then adjust the picture to get it just the way you like it instead of using the default factory settings.  It makes a big difference!", "Date": "April 5, 2011"}, {"Title": "Best Plasma Deal", "Author": "Don G. Connell \"Blu-Ray Nut\"", "ReviewID": "R11DCC0UFNPYE7", "Overall": "4.0", "Content": "I have tried to by a Plasma TV for 3 years now, but I always ended up with a LCD.  I recently have been looking for either a Panasonic or Samsung 50\" Plasma for either my office or bedroom.  I have a 52\" 650 series Samsung 1080p LCD in my Home theater Room that has great color, HD Detail and overall quality.  I have done alot of research on Plasma TVs and found that the fore-mentioned brands above, are the best rated. I debated the 1080p VS 720p issue and came up with the truth that, 50\" and below sizes,720p will give you as good a picture on HDTV as 1080p.  Reason, most signals that are sent, are originally 720p anyway.  If you are not using a blu-ray player often and if you are 4-5' away, you will tell no difference. Finally, almost a month ago, I got an email from Amazon that had the 2 brands on their Sales Ad.  I really wanted to try the Panasonic Brand, but the best deal was on the Samsung.  Being that I have several Samsung Products now and know the top quality of the brand, I chose the Samsung PN51D450 51\" 720p for under $700.00 and ordered it.  Delivery was about a week, timed appointment, white glove delivery and a nice knowledgable friendly delivery person.  I had read about the \"burn in\" issues with Plasmas, but with pixal shift and a scroll bar, that is not a issue any longer if you follow the 100-200 break-in period.  Yes, it is a pain, but it is well worth it.  You can find written instructions online on how to setup your Plasma before the seemingly, never-ending break-in time.  You need to find a channel that doesn't have a logo in one place, like a cable information channel, and just let it run.  I put mine in the bedroom, so I was running it 17 hours a day and with that, it was almost 2 weeks before the 200 hours was done.  Most experts recommend the 200 hours.  Once that is done, you may go in and adjust all of the settings to get the UNBELIEVABLE PLASMA PICTURE YOU HAVE HEARD ABOUT, from the experts !!!!!The Samsung is about 20lbs lighter than the Panasonic and that is a plus.  This Plasma is one of the lower priced ones that Samsung has, but you are only missing the \"add on features\" that have nothing to do with the picture.  The most debate for me was, did I really need 1080p.  For the usage I have for this set, 720p is great and it saved me several Hundred Bucks and that is a plus.If you don't have the desire to wait a couple of weeks to \"break-in\" the set, buy a LCD. If you want to own and see why all of the experts say that the Plasma is the best picture, try this set.  I think that you will be happy with the picture and I know you you will find a use for all of the money you are saving.Overall, I believe I made the correct decision, 1. as good a picture as you can find2. over 20lbs lighter than comparable brands 3.a 51\" Plasma for under $700.00 !!!Just another fine Samsung Product.", "Date": "May 12, 2011"}, {"Title": "Quality TV for the price", "Author": "JPotter", "ReviewID": "R1E2IU8J2079YO", "Overall": "4.0", "Content": "I had been holding out for the 2010 42\" Samsung Plamsa model to drop in price which I had been patiently watching since early November.  When the price was still the same come March - I decided it wasn't getting any cheaper.When to my surprise Amazon wasn't offering Free Shipping on that TV any, I noticed the 2011 Samsung Plasma's were available and with free shipping - I actually go the new model (which is now +1\" to 43\")for cheaper than last years Plasma.Out of the box the TV appearance is a nice liquid glossy-black finish.  Very thin TV - probably 1\" deep in most spots (excluding where the mount attaches).  The input panel required plugs to be plugged in horizontally - so expect to have to have a punch-panel or hole in the wall on the lower left side of the TV screen (lower left if facing the TV) to get the connections to hook-up.  Why TV makers won't allow vertical input connections on TV's like this is beyond me.If not wall mounting it comes with a good quality stand - though one of the mounting holes on the TV was stripped on my mount out of the box - something I didn't discover until days later.  Since the free stand is temporary for me and I'll eventually wall-mount, I was not concerned.Picture quality is what you'd expect from a plasma - bright colors, good blacks, and a little bit of a glossy (reflective) screen.  The screen isn't too bad - I use it in a highly lit room and only if the sun is right on it does it bother me.This set is 720p - and after reading 1000 different opinions/tech articles on 1080p vs 720p and it doesn't matter because you can't really tell the difference unless you are too close.  I can say this - you CAN tell a difference if you are coming from 1080p to 720p.I have a bigger 50\" 1080p TV in a different/home theater room.  It is also a Samsung - but a much older rear-projection LED (YES - LED, they offered it one way back year - new LED TVs are not rear-projection LED; they no longer make them).  The 1080p picture is silky smooth compared to this new Samsung.  Don't get me wrong, this set looks really good - if I hadn't spent 4 years watching TV on my other TV I would have never known.  But side by side looking close at the 720 screen you see clear pixels - there are no pixels on my 1080p 50\" screen - no matter how close I look.  On this screen you can see pixels/not-that-sharp of an image from about 3' away.  That not-that-sharp image can be see from a distance - the picture just isn't as 'liquid' as my old 1080p.  However, until I saw it side-by-side I wouldn't KNOW better to complain - can you see the difference - yes.  But my point is you won't know any better till you've seen then side by side.  You don't know how clear it can be until you see it.That said it's still really good for the price and I'd would buy it again since ~$500 was my price range.Bottom-line this is a good 720p Plasma for the price, but if you are looking for that GREAT picture quality hold-out for a 1080p set.  If my 5 year old 1080p looks better than this brand new 720p, the new 1080s have to be even better.", "Date": "March 22, 2011"}, {"Title": "My first Flat Screen", "Author": "R. perisian \"Rogerslake\"", "ReviewID": "R3PPKUJFEIJHOS", "Overall": "5.0", "Content": "I paid $679 for this 2011 model of 51\". After my 100 break in period, i turned up the contrast, brightness, and sharpness levels. I absolutely love it, and the sound is really quite good to me. While watching a movie on regular DVD, there are about 3\" of black screen on the top and bottem of picture. After 2 hours of watching this, I turned off the movie, and noticed some burn in from it. After watching regular HD tv for about 10 minutes, it was gone. I have watched or left the tv on cnn for hours on end, and the ticker going across did not burn in.. There is no ghosting on plasmas either. Gonna go get me a blu ray now.", "Date": "March 28, 2011"}, {"Title": "Samsung PN51D450", "Author": "Jon N", "ReviewID": "R1J1Z9K36NK1ZX", "Overall": "5.0", "Content": "I have bought a number of flat panel tvs in the past and was looking a new tv with decent performance with a small bezel and fairly light as I needed to fix the tv to a plaster/concrete wall. Plasmas tend to give significantly better bang for the buck compared with LCD, so while the LCD TV were typically 10lb lighter for a 50\" screen, the cost was in the region of 50%+ higher for the same form factor.I did look at the LG plasmas as I have a 60\" LG 1080p in my main viewing room, as I found them to be solid quality and good value. I nearly bought the 1080p LG 50\" which was only 10%-15% more than this unit, but was put off by the fact that it weighed 60lb v 50lb for the Samsung.I don't need internet connectivity as I get internet content from my TiVo, so the base model suited my needs. As for 1080p v 720p, at my viewing distance of 12' I understand its not possible to tell the difference - this is certainly consistent with my experience. The picture quality is very good - the biggest constraint is the quality of the feed from my cable provider. I avoid watching SD content where possible so have limited experience of how the Samsung does here.As for plasma burn-in issues, I have had a bunch of plasmas and have never had an issue with them watching regular TV. I can't comment on the sound quality as I use a separate receiver.All-in-all, this is a great tv, with very good picture quality and smallish form factor for a great price.", "Date": "April 14, 2011"}, {"Title": "Samsung 450 43\" 720p Plasma TV", "Author": "Crusher", "ReviewID": "RPOW1NZN9L3RY", "Overall": "5.0", "Content": "This Plasma TV is INCREDIBLE!!  I have been researching HD TV's for 2 years and kept going back and forth between LED & Plasma.  Trust me, if your primary reason for purchasing a TV is picture quality there is not comparison to the RICH colors of Plasma.  If you are a sports fan, this is the TV to buy!  Just keep in mind where you locate the TV in a room that you do not have a window or excessive brightnes behind it but the colors are \"real\" and PLASMA is definitely the way to go.  Oh ya, lets not forget the price at Amazon $539.00 with no sales tax & free shipping.", "Date": "May 1, 2011"}, {"Title": "Solid TV for the Price", "Author": "C. Brown", "ReviewID": "RST8STN39B6I", "Overall": "5.0", "Content": "I wanted to buy a 42\" flat screen for my bedroom and was deciding between this TV and the Panasonic VIERA TC-P42X3 42-Inch 720p Plasma HDTV. I don't watch that much TV in my bedroom so a 720p is just fine and I've read you can barely tell the difference between 720p and 1080p. I have also heard that plasma is the way to go over LED and LCD (best picture quality of the 3). The Panasonic model does come with an ethernet port which can take a separately purchased wireless adapter so you can get apps like Netflix, Facebook, etc. on your TV screen. However, a lot of the reviews complained about screen glare. Plus, I bought a Samsung 50\" 1080P plasma for my family room in 2008 and it works beautifully. So I went with the Samsung...The TV looks great out of the box and the stand is very sturdy. The only problem with the stand is that it does not swivel from side to side so you have to pick up the tv and move the stand if you want to change the viewing angle. The plug and play setup is a breeze and you can be watching TV within 30 seconds after plugging in the power and HDMI cable. It only has 2 HDMI ports but for me that's not a problem because I have one going into my Direct TV and the other into a DVD player. I watched Band of Brothers on DVD last night and the picture quality looked great. You can notice a window or sunlight glare if it faces directly on the screen but just close the blinds if this really bothers you. If I put it up side by side with my Samsung 50\" 1080p plasma I might be able to notice a slight difference but I doubt it. Overall this is a solid TV for the price and is a perfect TV for the bedroom.PS - remember to buy the cheap HDMI cables on Amazon. They work just as well as the expensive ones!", "Date": "June 17, 2011"}, {"Title": "Plasma is the way to go!", "Author": "E. Soboll \"Eddy\"", "ReviewID": "R1V54WMUB5Q0K8", "Overall": "5.0", "Content": "Just got this TV! Was wondering between Panasonic and Samsung and LCD vs. Plasma. I bought this one to replace my Panasonic Viera 32\" 720p LCD. My room to watch is not so big and the space to place the tv was just right. I don't have a home theater and just use HD from the Comcast source.The sound is great! The colors are bright and the image response is incredible fast. For sure is not a 1080 (which for this price, still the best buy!)And this is 43inch!No regrets in getting this! The price, no sales tax and free shipping!! It came in time fashion and right when they told that was going to be here.If you still wondering about this, pull the trigger, you will NOT regret!!!", "Date": "May 12, 2011"}, {"Title": "Great TV, but it doesn't play Videos from USB", "Author": "Emily", "ReviewID": "RB9JAVM2227EC", "Overall": "3.0", "Content": "The TV is wonderful. Great size, great picture, easy interface. It makes a cute little song when you boot it up and when you shut it off. I just want to point out that the 43\" does not in fact play videos from the USB (just confirmed with tech support and everything). This is really annoying because that was one of the major perks I wanted from a new TV. Looking at the product description now, I realize that the feature list applies to the D450 series as a whole, and that each model's capabilities are listed below. Kind of a dumb oversight on my part, but it's equally stupid to put an description that does not apply on the listing for a very specific model. Just sayin.", "Date": "September 24, 2011"}, {"Title": "D450 or D550", "Author": "kohut", "ReviewID": "RFX10T4QRGQQS", "Overall": "5.0", "Content": "I've recently purchased both this tv and the D550 from Best Buy, spending a few hundred more on the D550. This tv replaced the old tube tv downstairs and the D550 replaced a 37\" lcd in our living room. After bringing both of these mammoths home, setting them up, and watching a few movies on each of them... both my wife and I decided that we can't tell any big difference the D550 has over the D450 picture quality wise. In fact, I think the blacks are deeper on this model! Long story short, we returned the D550 and purchased this model for the living room too, saving a few hundred bucks! The only advantage the D550 had was the 3D display, which will only make you spend more money on 3D equipment. This tv offers unbelievable value!", "Date": "July 21, 2011"}, {"Title": "Beautiful and high quality", "Author": "MuleHeadJoe", "ReviewID": "R2CNWL9NSBQJ0Z", "Overall": "5.0", "Content": "Absolutely no trouble at all. The picture is beautiful, the casing is beautiful, setting it up was easy as pie. This is the second Samsung plasma I've bought and I'm impressed with their quality and ease of use. If you can get this on sale and/or with free shipping, then you can't beat this tv for quality versus price.", "Date": "May 31, 2011"}, {"Title": "All good things...", "Author": "Robert Hale", "ReviewID": "R16KWGHU4YR2LX", "Overall": "5.0", "Content": "So be aware that I'm not a videophile that is going to notice every little detail. I wanted a TV for the living room, not a product that I would obsess over and proclaim it's vast technical superiority to everyone I bump into. It's for watching movies; I don't need to marry it.With that said, it's been a great TV. It's sharp, (in some ways, too sharp... actors are more attractive when you couldn't see their pores) and the color is great. I've never noticed blur or anything else that anyone might complain about. I've used it for the occasional video-game session as well, and there's no issues; it works well.The TV mounted perfectly, has enough connections, and the menu system is simple enough to figure out. It's a solid, quality product, and people who come over to watch a movie aren't complaining. Neither am I; I'm more than happy with it.", "Date": "October 8, 2011"}, {"Title": "Best Bang for Your Buck", "Author": "Anrthony M. Wirz", "ReviewID": "R1OWN1KLUH9V47", "Overall": "5.0", "Content": "I have been TV shopping for quite awhile before settling on this unit. I looked at LCD, Plasma, LED and TVs from Samsun, LG, and Panasonic. What it came down was that I wanted to Stay under 550$ while getting the biggest screen I could.I was nervous about going with plasma because I am accustomed to LCDS but the picture is gorgeous, the display is very thin, the speakers are good enough, and the remote is responsive(more than I can say about my brothers 40 and 50 inch Samsung LCD remotes)I have had my laptop, apple tv 2, and an htpc hook up to it all flawlessly and I am very happy with my choice. The only thing to complain about is it only having 2 HDMI ports but that has not been an issue for me at all so far.Great TV for the Money, no doubt about it.UPDATE: I have owned the TV for nearly 3 months now and it is still treating me very well. Its been great. I could only wish for another HDMI port or two", "Date": "May 25, 2011"}, {"Title": "The best I've found in the price range", "Author": "K. Poole \"kylefpoole\"", "ReviewID": "R2CGEK0TI86HPP", "Overall": "5.0", "Content": "I'm not an videophile, but I am a geek.  I research everything way too much, obsess over minute details, and just generally put too much effort into purchase decision. I'm also cheap, and a bit proud that we only have 1 TV in our family of 4, and no cable.So when our 6 year old LCD bit the dust, I started obsessing over a new TV.  ~40\" was the largest size that would fit in our entertainment center, and I didn't want to spend more than around $500.  I have an HTPC, so I didn't need a 'smart TV'.  I also find 3D annoying at the movies, so I didn't want that either.I started researching and settled on LCD.  I decided I needed 1080p, 120ghz, LED lighting and all the other buzz words out there.  I ended up buying 3 different ones, and taking each one back within a few days.  While each was nice, there was always something that was a bit off.  My price limit kept increasing, hoping I'd find the TV that looked good, had great picture quality, speakers good enough that I wouldn't have to run the stereo all the time, and would fit into my entertainment center.  After not finding what I was looking for, I went to Amazon, clicked on 'plasma tv' on a whim and sorted on 'average customer review' - the Samsung PN43D450 was at the top the list.The price was right.  Size was good too - and it offered a bigger viewable screen than anything else in the price range.  The TV looked good with the narrow bezel.  I was a bit put off by the lower resolution - after all 1080p is 'critical', and didn't know much about plasma - but the reviews were great, and I'd been disappointed in everything else so far, so I decided to give it a shot.  I'm glad I did.Picture quality is superb.  Yes - the 1080p LCDs are sharper, and brighter - but that's only part of the story when it comes to overall quality.  The colors on the plasma are superb.  The contrast is amazing.  Blacks are really black.  There's no weird motion stuff going on like I saw on some of the 120hz LCDs I brought home.  The speakers on the TV are excellent as well - miles ahead of anything else I tried and no need to use my stereo unless I really want a lot of bass. Our living room is set up in a way that we rarely are sitting directly in front of the TV - and the view angles on plasma really are better.  Netflix and Amazon Instant video through the HTPC, in both SD and HD look great.  Broadcast TV through my HTPC also looks superb.  Blu-ray is beautiful, too.  From a pure, visual, 'does this look great' standpoint, this TV rocks.  And it's the largest screen that will fit in my entertainment center, so it gets extra man-points for that, too.I did obsess for a while over 720p vs 1080p.  I considered raising my price limit again in order to get a 1080p Plasma, but in the end, I decided to just stick with the PN43D450.  It's great as is, and once I stop obsessing over the minute technical details, I won't be able to tell any difference between it and a more expensive unit anyway.So, in short - if you're looking for a TV with superb picture quality, great sound, in a great looking package at a very reasonable price - then put aside concerns over 1080p vs 720p, Plasma vs. LCD, etc - and just get this.  It's ranked high by real users for a reason. It does a phenomenal job at being a TV, and that's what really matters.  I'm very happy with my purchase.", "Date": "December 6, 2011"}, {"Title": "Fantastic TV", "Author": "S. Weld \"musicman\"", "ReviewID": "R2FG1SN8R7IPOX", "Overall": "5.0", "Content": "Product was shipped and protected. The day after I placed my order I got a personal call from one of the store owners and he personally thanked me for my order and asked if I had any concerns or questions. I was very impressed and pleased and will repeat my business with him and that company.After looking for a TV for little over a year, reading comments in Amazon from regular Joes and Janes and from all the TV aficiandos and listening to my co-workers, I decided upon this TV mainly for the price and that it was a plasma.I have experiences with LED/LCDs and decided against them because of the \"fake look\". The new plasma's such as this Samsung is incredible. The picture is beautiful for movies on Netflix, Hulu, and Dish TV. Playing Xbox 360 such as Halo Reach, Battlefield 1943, and Call Of Duty 3 is flawless.Of course the price was unbeatable for little over $600.00 for a 51\" TV and the price for the extended warranty was priced right also. I bought it the moment I saw the price. This TV replaced my 2007 57\" rear-screen Hitachi which still works, but some issues prevent me from enjoying it such as the TV shutting itself off. Very strange. This does not bode well with me especially after watching a horror flick. lol.The only thing that I didn't think about was that the new TV has only an audio jack for an fiber optic cable. I have a 2001 Sony 800 watt surround-sound system so my first thought was, \"there ain't no way that my Sony has a fiber optic input\". Well, there was one although I had never noticed it or I didn't know what that plug was for. So I got a 12' FO here at Amazon for $10.00.If you haven't heard sound through a fiber optic, you're missing a big part of the picture. Since I've been in high school (late 70s) I have only used RCA jacks. But the fiber optic is incredible. The sound replication is about as good as it gets. The first show that I watched with this new set-up was \"Cheers\". Now knowing how many times I have heard this intro song to this show is no big deal to me but upon listening to the show through my surround-sound / FO cable was like listening to a brand new show. I could hear the arrangement of the song that I had never heard before and it was crystal clear and very well produced. Same goes for many shows through Dish TV and Netflix. It improves the TV watching experience.One last comment. I didn't do the 100 hour break-in. I don't see a need with this new model but the only thing that I did was turn up the brightness slightly so I could watch TV. The day I had my TV I was watching it preset controls and nothing but dark scenes which made it unenjoyable. I treat my electronics with respect so I don't see any problems with doing this and no problems have arisen. All is good.", "Date": "June 26, 2011"}, {"Title": "pn51d450", "Author": "o0om0nkeyo0o", "ReviewID": "R2S6E2ZR6FPC9U", "Overall": "5.0", "Content": "I HAVE HAD MANY SAMSUNG PLASMA TV MY OTHER TV IS SAMSUNG PN50D450 WITCH I LOVED THE BRIGHTNESS AND THE PICTURE AND SOUND IS GREAT.BUT THIS 2011 PN51D450 IS BY FAR THE BEST SLICK BLACK LOOK 1 INCH BIGGER SCREEN AND THE PICTURE QUALITY IS GREAT I WOULD RECOMEND THIS TV TO ANYONE WHO IS SHOPPING FOR A NICE PLASMA TV IN THIS PRICE RANGE.SAMSUNG WENT ABOVE QUALITY ON THIS ONE.AND I WOULD PUT IT UP NEXT TO A HIGHER PRICED PLASMA ANYDAY.JUST THOUGHT I WOULD PUT MY REVIEW OUT.", "Date": "March 18, 2011"}, {"Title": "the most bang for your buck", "Author": "emile vitella", "ReviewID": "R2G0V9Y7ZGEES9", "Overall": "5.0", "Content": "Have never reviewed anything before, am writing this to help anyone out there having trouble making a decision. The picture is just incredible, can't imagine anything clearer or sharper than this. I had a new Samsung 1080 lcd which I returned because I was disappointed in the picture quality: this blows that picture away. My son has a new expensive lcd (xxxx) and this 720 plasma is better than his. Can't comment on anything other than picture quality, but if you want an amzing experience watching tv and movies there is none better.", "Date": "October 22, 2011"}, {"Title": "Good purchase", "Author": "Ashwini Pandey", "ReviewID": "RTMRVEVLCSAQM", "Overall": "4.0", "Content": "Very good picture quality and price point. Thin bezel makes it look attractive in addition to add extra real estate and this makes the design double successful. 720p is fine with this size and does not look grainy at all. However, any size above this must be purchased with a minimum of 1080p. Overall, I am happy with the purchase....", "Date": "September 12, 2011"}, {"Title": "Incredible", "Author": "FrankZot", "ReviewID": "R12T4W36MLGDA1", "Overall": "5.0", "Content": "I will be brief. Forget the over priced LED`s. Plasma has surpassed LCD`s in picture quality and this set proves it. Not a lot of bells and whistles, but for the price the picture and sound quality is stunning.I did my research before this purchase and I am very well satisfied in my decsion. An incredible TV at an amazing price.", "Date": "May 10, 2011"}, {"Title": "Simply Amazing", "Author": "Anna", "ReviewID": "R21HP2XUA2O51X", "Overall": "5.0", "Content": "I received my Samsung PN43D450 today around 12:35pmI had to leave before I could setup the TV so when I came back around 3:10pm I opened the box and finally saw this beauty :)It also seemed a little large lolOnce I installed the stand which is very stable, I plugged in the power and HDMI cable, and that is when the Magic really started!!!This TV accepts 1080p 60Hz from my Denon AVR-1910 and it converts the picture to its native resolution which is 1366x768 @ 720p, but I am telling youthat nobody will notice the difference between this 720p Plasma and an LCD, LED or DLP 1080p.I sure dont see any difference, but that is because this is a Plasma TV and its sure that for movies, sports and videogames nothing is better period!!!!I cannot express how happy I am with this purchase, and Samsung is the best on the market.My next TV will also be a Plasma and maybe 1080p but as of now I do not need it :)Also at 43 inches this TV is pretty huge compared to my LG 32 inch LCD TV.I am so glad I went with Samsung and I am fan for life.Go buy this TV and trust me when I say, you will not regret it at all, especially when its videogames and blu-rayBUY IT NOW!!!!!!!!!!!!", "Date": "June 27, 2011"}, {"Title": "Be aware!!", "Author": "MrMarkyMark", "ReviewID": "R559E1Q8D4KR7", "Overall": "3.0", "Content": "Before buying this TV or any Samsung brand TV, do a Google on Samsung auto turn off and on. My Samsung 43 plasma was 7 months old when it auto turned off one day and made clicking noises and wouldnt turn back on. This is a widespread issue and there are class action lawsuits. For now, I would look to another brand.**update** Samsung service was excellent - TV was fixed in less than a week and warranty was extended by 90 days. I'm glad because the TV really is nice especially in this price range.", "Date": "October 6, 2012"}, {"Title": "Excellent purchase for $430 @ TigerDirect.com, Black Friday 2011", "Author": "ShiraKashi", "ReviewID": "R31Z81A755P9SK", "Overall": "5.0", "Content": "Easy assembly & setup.  Beautiful screen & picture.  Remote & menu are easy to navigate and adjust settings.  Yes, a 1080p would be a notch better but I viewed this 720p TV alongside more expensive 1080p units and it rivaled them in every category.  Our home has no lighting/glare issues which I considered before purchasing.Advice from a pro video engineer I know: Never view a TV closer than the diagonal dimension of the screen.  So that should put to rest complaints about the picture when right up to the screen or 2 feet away, etc. Flaws can be found on any screen that close.Speakers are good & better than I expected especially for a unit only 2.2\" thick.  I think some people expect too much in that regard.  That's why they make sound bars & home theatre systems.Regarding a reviewer's concern over screen damage by a child's sippy cup:  That's an unfortunate incident but child sippy cups are made of very durable plastic, often weighted at the bottom and with liquid make a formidable object when tossed whether they hit a plasma TV, LCD screen, a human being, etc.Blu-ray is dazzling to watch.  I  use the Panasonic DMP-BD210 blu-ray player and it's awesome.  Sports action is seamless.", "Date": "December 17, 2011"}, {"Title": "Absolutely worth the money", "Author": "techguy", "ReviewID": "RS9233RDKLS5T", "Overall": "5.0", "Content": "I've had this TV about 6 months, and I absolutely love it.  It was bought to replace a HD tube TV, and I am glad I bought it vs. an LCD.Picture quality is great.  Plasma is better for movies and sports; due to its greater ability to produce deep blacks and blur free motion.  Some LCDs and LEDs now have higher refresh rates, but if you've ever paid super-duper close attention, you'll notice they make things look a little surreal, almost dream-like.  It's just not natural.  If you love movies and sports, Plasma is the way to go.  In regards to the 720 thing, most HD stations are 720p.  About the only realy 1080p source you can get is Bluray.  In my home, you sit about 6 ft from the screen, and you can't tell.  If you sit further away, you probably can, but like I said, it's perfect for our home.  Also, next to my cousin's 40\" LCD, the picture is just so much smoother.The sound is adequate (it will never be great on such a thin bodied machine) and the menus are easy to use.  I wish the digital tuner was a bit stronger, but whatever.The two HDMI ports disappoints me.  I wish it had just one more.  To be honest, that's my only major complaint.  I know I can get a better TV with a better picture, but then I'd be spending A LOT more than what I did on this one.  It's your choice.", "Date": "November 14, 2011"}, {"Title": "An amazing HD performance for its price!", "Author": "Kim", "ReviewID": "R14QTSLOGL5EBG", "Overall": "5.0", "Content": "Right off the top I'm going to say that this set was the absolute value winner for me over TVs in its class and price range at area stores where it was sold. No question about it, I am thrilled I selected this set over LED and LCD TVs that were in the 42-47\" classes and for its incredibly sharp picture, rich color reproduction, crystal clear and full-sounding audio, and ease of setup, it gets 5 stars.I had owned a 50\" Samsung DLP for almost nine years and had replaced the lamp three years ago and continued to produce a decent (but not great) picture up until recently when the set finally died. It would have cost us $300 to repair a nine year-old set that was built on outdated technology. I decided to shop for a new set to see what I was up against. I dreaded that the prices would be out of our range, but was blown away when I spotted this set sitting on a shelf in between other LCD an LED TVs at our local warehouse club.The old DLP set had a matte screen that did nothing to ease sun glare in our living room. The audio was not that clear and we had fluctuating audio levels all the time. You also could not view it well at an angle. The new 51\" plasma set had none of those issues. The screen picture is bright (on Standard setting), and even though it has a glossy screen, sun glare does not affect the viewing even close to as much as the matte DLP screen did. I can be in the adjacent living space and look over at the TV at an approximate 10 degree angle from the front of the screen and make out all the details. The sound is very crisp and rich for built-in TV speakers. I had never heard such good sound come from an out-of-the-box set before.I watched a college football game on it this afternoon and was blown away at how well the set handled fast motion. Truly, being a 720p set made me not care so much about 1080p. I don't even have to go in to all of the other good features for this set. My only wish is it had another HDMI port (the set has only two). I got a Blu-Ray player for my birthday a couple weeks ago and the picture from it is absolutely stunning.Just get this set. You are not going to find another HD set of comparable quality in this size class.", "Date": "September 24, 2011"}, {"Title": "I LOVE THIS SAMSUNG TV! GREAT TV!", "Author": "I. J. S. \"John\"", "ReviewID": "RXIW0E4FNW39I", "Overall": "5.0", "Content": "I love this Samsung TV! Great TV. Great picture and great sound. I bought it from Amazon.com on June 18, 2011 and received it on June 23, 2011. It works great. The remote control is easy to use. It changes channels very fast. It only takes 1 second to change channels.  I have no problem with glare. I watched TV during the daytime and nighttime and I see no glare. I was always worried about glare but I see no glare. Let me say my #1 choice was a Sony but it was too expensive for my budget and it was also a smaller 40 inch TV. Panasonic was my second choice because I already own a 32\" Panasonic standard tube TV. Samsung was my third choice and cheapest price of the three brands. But I am very happy with my purchase. I always wanted a 42 inch TV and the Samsung TV is 1 inch bigger. I got FREE shipping from Amazon.com. Amazon.com Pilot services delivered the TV and set up the TV in 10 minutes. The sound is great. I usually watch regular TV shows with volume set at 20 volume level and I hear clear sound. I have my regular DVD player connected to the TV using an HDMI cable and the DVD picture and sound is amazing. I use a 5.1 surround sound system to watch DVD movies. I use the TV speakers to watch old classic TV series on DVD. The TV has bright beautiful colors if you set the picture control to DYNAMIC MODE. Turn off the SRS surround sound on TV and set sound mode to MOVIE MODE for loudest volume sound from TV speakers. The Samsung customer service is very friendly. They helped me connect my DVD player using an HDMI cable to the TV set. You will not regret your purchase. I didn't.", "Date": "July 29, 2011"}, {"Title": "Do not buy this junk!", "Author": "Elizabeth Armstrong \"bunwhisper\"", "ReviewID": "R31L5C6S856K9N", "Overall": "1.0", "Content": "A week ago, I would have said I loved this TV. Oh how things change in an evening. Last night, my four month old tv blew up. Was just sitting there watching HGTV and KEE-RACK! Horrible cracking noise, the picture goes black, sound goes dead. TV is now deader than Elvis. So I call Samsung, as it is still in warranty--they will not authorize an exchange or anything until a repairman sees it. So they set me up with a repair place that does no speak no Ingles. Guy says he will order parts, but *wont come out to see what is wrong with the tv*. How do you know what is wrong without seeing the set--and also, Samsung said they cannot do anything until the repairman looks at the set. \"Is no problem, I fix.\" I call Samsung back, and ask how someone can order parts *when he has no idea what is wrong with the set*. They don't know, and have now sent me to another repair place, who *also* orders parts before seeing the tv, but at least speaks English. Any odds that when/if the part gets here and when/if they come out to see the set *it will be the wrong part*? Yeah, I wouldnt take that bet either. Avoid this junk!", "Date": "January 25, 2012"}, {"Title": "Decent TV, ideal only as secondary.", "Author": "Jon Knocks", "ReviewID": "R38H7U3A0CLB3M", "Overall": "2.0", "Content": "Now to start this review off I'll admit that I didn't do enough research on the product before purchasing it so many of my disappointments could have been avoided with more research.First the good:pretty slim around 2\" in depthnice screen size fitting a 43\" screen in a 42\" base600hz refresh rate good for fast motionGreat contrast (of coarse plasma)and that's about it...The no so good:For some reason plasmas aren't 1280 x 720 or 1366 x 768 like LCD 720p televisions but rather 1024 x 768. This translates to a picture that looks like a early 2000's crt computer monitor...just stretched out, so this really isn't a good choice to use as an external display for a computer because your losing 200+ pixels horizontally.Not only for a computer, but other devices will look kind of awkward on this unit also. I must say the xbox 360 formatted the image pretty well though.The next issue was the constant buzzing sound that came from the back of the tv. It wasn't mounted on a wall and we sat about 8 ft. away...but when the sound was low you could here a buzzing CRT TV's usually make (was very annoyed by this).Next issue was the ports.... 2 hdmi, 2 component and a digital out....I was okay with it at first but using this tv for the family room with many devices just wasn't the best fit. In addition when we would try to switch hdmi inputs the TV would have problems adjusting to different devices and would give a message saying \"display mode not supported\". This was only resolved by using only 1 hdmi and switching the cable from one device to another.And make sure you a dark room for this TV otherwise you'll be watching yourself half the time, the screen is glass so its highly reflective.Also didn't like that the stand doesn't swivel, and the remote is cheap feeling compared to our other Samsung.As you know by now...we sent it back and thanks to amazon for all the assistance. We'll be getting a 1080p LCD.I'd only recommend this unit as a secondary tv or if you have few devices to connect, other than that....get an LCD.....they use less power too.", "Date": "December 7, 2011"}, {"Title": "Great Picture !!  Samsung PN51D450 51-Inch", "Author": "K. Keller \"KenK\"", "ReviewID": "R174MGBCGZCBYM", "Overall": "5.0", "Content": "This Plasma HDTV has the best picture I've seen in this price range and above, it took a little fiddling around with the picture settings out of the box, but the results are assume. The picture is so clear, bright and sharp you would never know it was a 720p Plasma if no one told you. I have another Plasma TV a 43 inch Panny that also has a Great picture but the picture on this Samsung is just that much better. I would like to mention the sound from this Tv is also very good, I have the Tv in a really large room and I have it set on 6 and it fills the hole room with sound, its loud compared to other sets I looked at, many sounded like tin cans.  The only complaint I have is there is only one sound out option, which is optical audio out, I have a pair of wireless head phones I use when watching Tv so I don't bother my family when I watch Tv and they need there quite time(they claim I'm def). The only option is to buy a optical to analog audio converter to hook them up, what happened to RCA, 1/8 audio jack connections? I see many Tvs are coming with only this optical audio out now, the converter companys must be happy about that.  Buy this set you won't be disappointed I know I'm not.", "Date": "April 16, 2011"}, {"Title": "Finally a high end plasma with a low end price.", "Author": "Kakaido", "ReviewID": "R1Y7ZOPXEP93EE", "Overall": "5.0", "Content": "I am very tech savvy and know a lot about tech, So I will be very short with this review just trust me. This tv may not have tons of controls and only two HDMI but it's picture is worth the price. I did not buy this from Amazon I bought it from Fry's Electronics for $414.00 an AMAZING PRICE, Trust me get this tv you will be very happy.", "Date": "March 29, 2011"}, {"Title": "Clear images and good sound (with Good Price)", "Author": "John L. Kelly \"John L Kelly\"", "ReviewID": "R14B1PD0H89HA0", "Overall": "5.0", "Content": "This TV was viewed at Best Buy, along with several TVs. It was as sharp and clear as any TV in the store. The picture has great blacks and striking realistic picture and colors. It has good sound even though I usually listen with a Onkyo 7.1 surround system hooked up to it.Pros:1. This TV has no buzzing sounds often noticed on older Plasma TV's.  2. TV has a very clear picture with great color and even better Blacks.  3. My old 2008 Sony 52 inch TV cost approx 4X THE PRICE OF THIS TV.  4. This TV looks more realistic than my old Sony with colors that are not overstated or phony looking.Cons 1. This TV is only 720p not the 1080p I was looking for. Yet it is clearer and sharper looking than the SONY when it was new.  2. This TV has no internet capabilities, but this is OK because I own a Play Station 3 and get the internet (Netflix etc.) though it.  3. First TV arrived with broken screen, but in two days I had a new TV that worked wonderfully.If you have to have the status of owning a 1080p TV then do not get this TV. If you just want a great picture with great color than buy this soon.PS. Almost no TV's on the market today show a 1080p picture. They might have 1080 capability but in 2011 no cable or satellite company brings 1080 into the home (they broadcast 720p). Indeed. only a Blue ray player showing a movie filmed with a blue ray camera has true 1080ip All of these movies you could count on one hand in 2011. It will be 8 to 15 years before the cable subscribers all go to 1080p, and that the movies on Blue Ray are not just remastered DVD's. By that time you will need a new TV.", "Date": "May 11, 2011"}, {"Title": "I like it, BUT....", "Author": "azfreediver", "ReviewID": "R1285ALMOZP15H", "Overall": "3.0", "Content": "I have had this TV about a month.  First, the negatives....Amazon emailed me the name of the company that would deliver it.  I guess for big ticket items, this is normal.  That company gave me a 7 day window for delivery.  Not much help, since I can't take 7 days off work for it, and who wants it left on their porch?  Repeated attempts to call were put on endless hold.  Emails were not replied to. Now I'm in the delivery window.  Stressed.  Finally got someone (in their collections dept-which seems to have more staff). They gave me the name of another company that they assign to deliver it!! I can call them to get an appointment for delivery.  Great?  No!  Eventually got someone (after 3 days of calling, and now 4 days into delivery window).  Speaks broken English.  They TELL me a date for delivery (outside of the window I was given) and a five hour window.  They said they'd call an hour before delivery (didn't).  Amazon emailed instructions that I should open the order and inspect for damage in the presence of the driver.  But the driver would not wait and just dumped it and dashed off in a hurry.  Bad experience all round.  But the TV is a beauty.  Easy set up.  If you play around with the settings, the image becomes even more superb. Sharp colors jump off the screen. Simple controls.  Does not have as many options for connecting DVD and VCR as some TVs.  When I connect my computer via HDMI, the TV says \"mode not supported\" and won't work, unlike my other TVs which I can play my computer through.  Wal-marts had the same TV in store but $50 CHEAPER last week, and no delivery stress.  Just pick it up and go...save money and hassle! Will not buy big ticket items through Amazon again. Amazon is great.  But not ancillary companies they use.", "Date": "January 31, 2012"}, {"Title": "Best Value 51\"  Plasma...STILL!", "Author": "Michael A. Musa \"mikeE\"", "ReviewID": "R37AA4NV79RBKB", "Overall": "5.0", "Content": "I am sure a lot of people are happy with this set, just thought I'd put my cent or two. and so the story begins...I was on the market for a 42\" HDTV for our Master Bedroom. I recently switched our 32\" Sharp Aquos to the kids bedroom for their Panasonic 27\" Analog TV. I know, what a downgrade but it's for the kids. To my surprise, the only input working are the RCA's in front of the TV (Input 2). I was like \"eeehhh! what the heck, it's only for the bedroom, we'll wait for a sale when the time comes and get ourselves a 42\". So while I was working, nature called and I had to empty my bladder. I went for a bathroom break and on my way out came across the local NY Daily News in the locker room. Skimmed through the pages and seen the Samsung PN51D430 advertised for $499.98 at PC Richards. I was like Wow! Told my wife the news when I got home and told her I was intrigue. We are a bit tight on cash but just want to look. Stopped by later that night and the salesman (of course) told me the model is discontinued but they have the newer version PN51D450 for $599.98, 25% off MSRP. He offered to drop the price to $549.98 if I take it that night. I said no and headed to another PC Richards to continue my search for the TV advertised.When I got there, sure enough the salesman told me the same story. 430 discontinued. They only have the 450 but its supposedly newer  and better model. To my surprise, he said I can have it for the same price of $499.98 and jokingly asked how many should he write up. I smiled and told him I'll think about it. What made me reluctant? 1. The display of the TV they had out on the floor is somewhat blurry as compared to the other sets, namely LED TV's. 2. As mentioned earlier, $$$ is tight, it's almost Christmas and good of a deal as it may, my account will definitely get a big dent. So I went on my smartphone and read more reviews on this set. I was caught in the Point of No Return, A Do or Die Situation. The deal is too good for me to pass on. Doing so will end up in nothing but regret. I know I will kick myself in the butt forever. So I came back to the floor and told the salesman I am ready. He finalized the sale and I went home  with the set. My wife just shook her head when I arrived but I can tell from her smile and her eyes of her approval and and  support.It wasn't until a few weeks later that I powered it up (One week before Christmas). The picture and clarity right from the factory settings is nothing compared to the way they had it displayed at the store. As a matter of fact, it was too bright for our eyes. Does it matter that its only 720P? No! the picture on this set is so clear and crisp. So far so good with our Scientific Atlanta Optimum HD cable box. It interlaces 1080 channels with no problem. At 600hz Sub-field motion, no  blur whatsoever on fast moving subjects. I'm sure it will be great for gaming. For the moment I have our Philips Progressive Scan DVD player via HDMI. Will be adding blu-ray soon. Our viewing distance from this set is a little more than 6 feet. Yes, its pretty big for a bedroom some may say but its perfect for ours. It is now mounted on the wall with all the wires hidden.As mentioned earlier, factory settings were set too bright. Had to turn the cell light down to 5, Contrast to 65, Brightness to 55, and Sharpness to 60. Also set the Eco-sensor on to automatically adjust the brightness when the lights are off.  Break-in - a rule of the thumb for all Plasmas is always suggested along with proper calibration afterwards. My other set - Samsung PN63B550 Full HD 1080P mounted in our living room went through this period. The same will be applied to this TV. Present settings seems to be just right in our eyes. The colors are vibrant and skin tones appear natural. I recently went to a Best Buy and showed my brother two sets of the same TV. One calibrated and one not. He likes the other set which was brighter. I pointed out the unnatural color and skin tones of the subjects and told him the one he didn't choose was the calibrated set. Our society seems to think the brighter, the better. Not necessarily true. I mean to each his own but then again, I would not want to view movies or shows that seems over exposed. I like the natural colors as if you were to see it in real life. (Funny how the \"Goldfish\" commercial just came on and I am comparing the colors to the one I am snacking on right now - Colors are on the money, All Natural!..lol.  All HD channels looks great on this set, especially The Food Network, HGTV, and ESPN.Recently just hooked this baby up with our aging Philips MCM-530 micro stereo system via RCA to Optical Toslink converter. It's not HD 5.1 but I can testify on the improved sound, especially in the bass area. Sure saved me $$$ from getting a soundbar.Cons of this set,Glare. Solution: Go figure. We are using this set in the bedroom so this is not an issue.Not enough HDMI input. Solution: HDMI switcher.Not a Smart TV. Solution: Buy one at a much higher price.Look at the reviews! The negative reviews on this site are just nit-picking. Anyway, If you are looking at this product and thinking of purchasing a TV this size, Go ahead and buy it!  This set delivers the picture clarity and crispness one look for on an HDTV. Trust me, it can rival most of the 1080P sets out there. I know, I own one. Guarantee you will not be disappointed.For the price I paid for, this one is practically a steal! Only problem now is that the kids are now claiming it..lolCheers! =)FOLLOW-UP: 10/10/12TV still Rocks! I have now hooked up an HDMI switcher ($14) and just using one HDMI port in all of my equipments. I added Roku stream player along with our Progressive Scan DVD player and we now switched to FIOS, so that means cable picture clarity is so much better. TV is probably on around 10 hours a day total. No burn-in, No issues whatsoever.", "Date": "January 22, 2012"}, {"Title": "Great Value, Flawless Picture.", "Author": "K. Coleman", "ReviewID": "R12CI6WI9R5HLR", "Overall": "5.0", "Content": "This was a great purchase! I paid over $100 bucks less by using Amazon as opposed to my local box store. The delivery was free, and right on time. I could not be more pleased.As for the quality, you will not be disappointed at all. I cannot tell the difference between this picture and my 1080p Samsung in another room, and neither could my techno geek friends who all assumed it was a 1080p until I told them it wasn't.", "Date": "November 9, 2011"}, {"Title": "Big Bang for the Bucks!", "Author": "Phil Purdin \"MacMan\"", "ReviewID": "R16R7IU5T567KX", "Overall": "5.0", "Content": "I bought this after a lot of research on 42\" class sets. I use it in a guest bedroom that doubles as my football mancave. My cable hookup does not include a box with any high def capabilities in this room. I have that setup in my living room with a 1080 set. I was concerned that my picture quality would suffer, especially at 720p. Boy was I wrong. This set has some new technology that picks up all my favorite stations in a DTV Cable mode. The picture absolutely rivals my 1080 set with high def. Not exaggerating. That being said, the stations that are standard broadcast signals do suffer picture quality in comparison to the others, but not enough to warrant negative feedback. I was also concerned about plasma vs lcd etc., no problem since this is in a room I can darken with blinds to eliminate glare. I love the thin frame which provides a little more picture image and looks high tech compared to most. I really appreciate that there is no pixelation lag during fast motion live action.Connection options and overall features are great. I have no problem with sound quality in a small room, but would quickly add an external audio system if this were my primary entertainment system.When it comes time to replace my living room set, I will seriously consider a larger Samsung plasma unit with 1080p. I couldn't be happier with this purchase so far.", "Date": "October 16, 2011"}, {"Title": "Great for The Money- Hands Down: Advantage-Amazon", "Author": "believeinthestars", "ReviewID": "R32JKGPSMH3JM9", "Overall": "4.0", "Content": "A trip to WalMart ended up in my purchase of the 43\" Samsung Plasma from Amazon. I'm big on researching what's out there and most all the reviews for Samsung put it up there with the best. I always check reliability and again Samsung scores big there.  The rest comes down to scoring the best price. That's where Amazon came thru for me.  Amazon matched the WalMart price so the only other two factors where sales tax and shipping. Strike two, strike three:  no sales taxes and free shipping right to the living room!  Can't beat that.  I think I saved nearly a hundred bucks when factoring in those expenses. Samsung picture and sound are AMAZING and, if you can connect the unit to a sound system (even just your stereo receiver) you'll experience the full effect - awesome! The only downside to this unit is in the Plasma screen.. if it's in the wrong room, the shiny screen mirrors other objects in the room that can be distracting.  I just turn the lights off to watch and its all good. Overall this 43-inch is a noticeable step up from 40\" units but the pricing is the same. Take advantage of it!", "Date": "October 16, 2011"}, {"Title": "Change PS3 Display to 720p/1080i", "Author": "Ha Dang \"HQDeezy\"", "ReviewID": "R24STTTA8GDDUU", "Overall": "5.0", "Content": "I was running Netflix through my PS3 and the audio wasn't synching with the stream correctly. So I went ahead and started to tinker/troubleshoot the problem and turns out that my PS3 was running at 1080p. Once deselected 1080p from the list of the displays the pixels and movement of were much more fluid and clear.EDIT: I just hooked up an AntennaCraft amplified OTA HDTV antenna to it last night and was able to pick up all the major local news channels in HD and it looks amazing with a 1080i feed! Wow. I am blown away with the picture quality. Now I can enjoy watching football in HD.", "Date": "September 26, 2011"}, {"Title": "Very nice TV", "Author": "mb", "ReviewID": "R3E04EVHYKT8AO", "Overall": "4.0", "Content": "I like this TV very much. I looked at plasma, LCD, LED, and the plasma looked the best (rich colors, deep contrast, no motion blur). I paid $449 at HHGreg, a very good price compared to the other units.  The sound quality is very good; much better than I thought it would be (better than my last TV). This is important to me because I watch a lot of concert DVD's.  The only reason I gave 4 stars instead of 5 is because when you view a video that was shot in 4:3 picture and you select 4:3 the bars on either side of the screen are grey?! not black. You can sellect between light grey and dark grey, but not black?! I would like black. In all I would recomend this TV if you don't use the 4:3 view a lot.", "Date": "September 14, 2011"}, {"Title": "Lots to Like about this TV", "Author": "Brian Wiebe", "ReviewID": "R2ORYFXYJAU888", "Overall": "5.0", "Content": "We've only been using this for a few days, so I can't give this any long-term feedback. However, after having shopped both online and in-store for quite awhile, I am pleased to say this is a great TV.We had actually purchased an LCD 40\" 60Hz Sony Bravia from Costco, because we were nervous about the glare issue on the Plasma, but the LCD just didn't look right and the kids complained about it being blurry (due to the slower refresh rate, I presume), and back it went. We were really trying to keep our purchase to about $500, so that limited our choices.About this Samsung:Picture - beautiful, and much cleaner images than the LCD, even thought this is 720p not 1080p. We also do not have HD cable, and only a regular DVD player, not blu-ray. Still, it's very good.Gaming - the kids are happy, what can I say?The Glare - Yup, it's a problem. But we have curtains on the window which virtually eliminates the issue.Sound - just okay, but not terrible. We run sound through the stereo anyway.Features - nothing seems amissInput/Outputs - they really should have an analog (RCA) out, but the DVR, DVD player and Game Console can all be run to the stereo too. There are only 2 HDMI inputs, so far not a problem for us.So, having tried both types of TV's, I'm pleased with this choice.", "Date": "July 22, 2011"}, {"Title": "Awesome TV!", "Author": "PM", "ReviewID": "R3B8J7RVEPZLDC", "Overall": "5.0", "Content": "I had the 2010 version of this TV. Loved it but the cleaners broke the glass after only 9 months. Repairs ran at $1000 so had to get a new TV. Found this one on Amazon. Picture quality is absolutely superb (as good as LED TV's priced 3 times). This one is thinner than its predessor and an inch larger. All in all a great buy!", "Date": "March 31, 2011"}, {"Title": "Great flatscreen", "Author": "Ticojon", "ReviewID": "R3OSV52PDIBOYS", "Overall": "4.0", "Content": "Like most, I tended to shy away from anything that was 720p.  By chance I saw this one on sale at BJs after black Friday and the deal was too good to resist.  I own a 1080 television and this one has equal or better picture.  Come to find out...most broadcasts are 720p upscaled to 1080p (especially live broadcasts)...what a gimmick.  I don't think you'll find a better television (plasma, LCD or LED) unless you spend double the price of this one.  I'll mount mine later this week.  Don't fall for the super expensive HDMI cable 'gimmick' either.  Just get a fair priced, good quality cable from Amazon (read the reviews).", "Date": "December 14, 2011"}, {"Title": "Look No Further in this Price Range......Purchase This !!", "Author": "Andtiques Owner", "ReviewID": "R3JMXHSIUQA0XY", "Overall": "5.0", "Content": "I've only written two reviews of any kind before as I either have to be really upset or really impressed.  This is one impressive TV in this price range! Believe me when I say I did tons of research and reviewing before purchasing this TV.  When you add Amazon's Free Shipping and No Tax, you will set this up (in about 20 minutes or less) and feel like you've robbed them.  Shipped two days earlier than advertised with shipper bringing this into my home and my unpacking for inspection before he left! That's service!  Setup is very well illustrated and described and easy to understand and install. I'm using this in our Master Bedroom and it's the perfect size for that. I've ordered the wall mount but as now using on it's stand which is plenty sturdy.  Basic Picture tweaking is very easy and the results are superb.  I have a 52 inch LG in my \"man cave\" and while the display is larger, it isn't any better. Sound is very good with some decent Equalizer controls. The sound can be very loud, but the lower volume is quite comfortable.  Both Digital Regular and HD has deep blacks and vivid details.  A real joy to watch! I've used the photo and MP3 USB port for background music in my home and both the JPEG and MP3 player are awesome. I'm a bit enhanced as I have a Bose Surround Sound Theatre and wireless home system that really sets this baby off.  But this TV is great without any sound help as well. The remote works great from our distance of about 12 feet.  This set doesn't have a lot of Bells and Whistles, but it has all the essentials with 2 HDMI ports, 2 HD Component ports and a PC input if you have proper DVI hardware.  I only need the 2 HDMI's so these weren't important.  There is one note however from the advertisement that is wrong.  The USB only plays MP3's and JPEG photos, it DOES NOT play any videos at all. Again, this was no issue to me. Lastly, for the size and watching distance of a second television, the 720 dpi rivals my 1080 52\" LG. If I were wanting big room display, I may not choose this one, but for this size, this is the very most bang for your buck out there.  Trust me, I researched and reviewed many long and hard hours before this decision and it paid off.  I've done all the researching for you..........if you are in the least tempted by this TV........buy it for Price, Service, Quality, Ease of Use, and Free Shipping. You won't go wrong with this TV at this price!!", "Date": "October 12, 2011"}, {"Title": "What a television!", "Author": "E. Hungerford", "ReviewID": "R1TI7O2W0DWSRJ", "Overall": "5.0", "Content": "My husband and I had heard from other friends who had recently purchased a television that we should not buy a plasma tv, that the gases would dissipate and that the tv would not last as long as an LED or LCD.  Well, we read reviews on Amazon and decided this television was worth a try.  I mean, the price was so tempting!  At least 3 times cheaper than the LED and half the LCD.It's been a week, and we could not be more pleased.  Why are people buying the more expensive ones when this tv is so terrific?  The picture is clear, the sound is true, the screen presents no reflection problems. We feel that we could just step into the picture and join in the action.Try this tv; it's a winner!", "Date": "June 3, 2012"}, {"Title": "Awesome picture, very good all overall.", "Author": "Wineguy", "ReviewID": "RDPH6MV2Z2TGW", "Overall": "5.0", "Content": "I've had this for several months now. This TV can usually be had for $400 to $500. Don't be afraid of the plasma, this TV's picture is much better than any LCD at anywhere near the price. Its thin, adequately light, and has a thin bezel. It also avoids all of the dizzying motion issues that the LCDs have. This is great for general HDTV watching, Blueray looks incredible. You will have to crank up the color and contrast settings, but the color and motion displays on the this thing are the absolute best. Be careful depending on the exact model you buy that the amount of HDMI hookups vary from what you may see in a store, mine had only two which I luckily knew about ahead of time. Sound is clear and decent overall for this type of speakers.", "Date": "April 13, 2012"}, {"Title": "Samsung 51\" Plasma blows panel after 2 years!  Worthless..", "Author": "Steven H Galloway", "ReviewID": "R1W7DW5DAC7K9N", "Overall": "1.0", "Content": "Beware of this product.  After just 2 years my 51 inch Samsung Plasma HDTV blew a panel resulting in a black horizontal line splitting the screen.  Researching this online I find that the problem is common with Samsung plasma products.  Unfortunately, I am outside the limited warranty and Samsung could not have been less helpful.  The replacement cost exceeds by far buying a brand new one!  I loved the TV until this happened.  I would not buy Samsung products again because of this.", "Date": "March 30, 2012"}, {"Title": "Couldn't Be Happier With This TV", "Author": "Wesley D. Sheffer", "ReviewID": "R23T3LJ43RBLJJ", "Overall": "5.0", "Content": "I've had this TV for about 5 1/2 months now and am still thrilled with it. I had been looking at a 42\" 720p Panasonic with IPTV capabilities for about $700, but when I looked at my new living room, it was just going to be too small. So I shopped some more and found this 51\" beauty for $650.I've never seen a picture this good that I can remember. The colors are perfect, the blacks are deep, the viewing angle doesn't cut out until you're behind the TV, the sound is good. If this TV gives up anything to a 1080p unit, I can't tell. I've seen some (expensive) 1080p units that were just flat out disappointing or distracting to watch. No such complaints with this TV. It has all the sharpness of HD with the richness of a tube TV.One real detractor: glare is a problem in the daytime if you have a lot of windows, but it's not enough of a problem to make me want a different TV.Note: I'm glad I did not buy a TV with internet capabilities. There's no need to sink that cost into a TV when those functions will probably be duplicated and surpassed by any number of blue-ray players, cable boxes, other set-top boxes, or HTPCs that you will own between now and when the TV dies.", "Date": "January 20, 2012"}, {"Title": "Great deal for price", "Author": "phota syravong", "ReviewID": "R19I5D7UL5TQL6", "Overall": "5.0", "Content": "I somehow got this from Amazon for $499 so I added to cart and was able to save over a hundred. The appearance of the plasma is a glossy piano black with very slim profile. Very modern look and lightweight compared to others. The quality is great and watching blue rays is awesome. Tried gaming on this system (PS3) and very clear at gaming. The TV has different settings for which type of mode i.e game, etc. The only drawback of this tv is it only has 2 hdmi ports, but I got around that by hooking up a hdmi 5 port. For this price its a great deal.", "Date": "December 12, 2011"}, {"Title": "WONKA VISION", "Author": "Justinthemovies", "ReviewID": "R16B6SBE2PHRKG", "Overall": "5.0", "Content": "The picture on this TV is miraculous...rich...sharp..vivid..Colorful, bright hues, so realistic it looks as if the movie is coming in to your living room! LOVE, LOVE, LOVE THIS TV! Easy set-up, easy hook up...I am thrilled with it absolutely thrilled! My kids were watching Sponge Bob and it reminded me of Willie Wonka (the original of course) so much color!!!", "Date": "December 4, 2011"}, {"Title": "Graet Value for the dollar!", "Author": "rouse5369", "ReviewID": "R1I5H3HQFH4L8R", "Overall": "5.0", "Content": "This Tv has a bueatiful picture! for 720p and in high definition I dont see how you could get a better picture. I have read reviews saying the sound could be better. I agree out of the box it does sound a little cheap. You can adjust the sound settings with equalizer and surround sound and it then comes to life. I havent tried adjusting or tweaking the picture yet as it looks very good out of the box but im sure you can tweak it. i bought mine for 619.00 no tax and free shipping and couldnt be happier.I dont think you could find a better tv for the price!", "Date": "November 13, 2011"}, {"Title": "No complaints", "Author": "pudgsicle", "ReviewID": "RLRC1DESOG7EO", "Overall": "4.0", "Content": "I can't think of anything to complain about. It came, assembled easily, it worked and the rest is history :)", "Date": "October 22, 2011"}, {"Title": "Just what I wanted, arrived immediately", "Author": "libertyville", "ReviewID": "R1ZRA7AFC6MMGK", "Overall": "5.0", "Content": "I moved up from a big old heavy TV to this Samsung.  It exactly fits the corner cabinet and has just the right connections I need.  I have only had this 1 month, but so far so good.", "Date": "October 21, 2011"}, {"Title": "First defective, second great", "Author": "Jacob Stambaugh", "ReviewID": "R2W0WQFTLG7QX3", "Overall": "4.0", "Content": "For the price, this tv is awesome. The stand is, in my opinion, sturdy for the weight of the tv. The screen, although 720p, (and i think it's supposed to be 60hz...), looks fine. I suppose if I sat like a little kid at the foot of the tv  I could notice some pixilation. However, I don't, and it looks fine from 4 feet on.The only problem I did have was a pixil turned green and wouldn't change colors. This would seem to be a major problem, but samsung was unexpectedly helpful in getting it repaired, at no cost to me (as it was under 30 days. If it had been over I suppose it would have been a different story). Anyways, the screen was replaced and within a week I had a fixed tv. The tv repairman said I was lucky samsung allowed a new screen to be put in, as only one pixil was out. Apparently, other companies require a certain number to be out before they will do the repair. This could be wrong, but something to look into.So, plasma 43 inch for the price: I feel happy.", "Date": "October 9, 2011"}, {"Title": "Spencer", "Author": "spencer", "ReviewID": "R3LHN1W35MKYFK", "Overall": "4.0", "Content": "Right out of the box this Samsung picture was great. The one concern is that the auto level setting doesn't work. The commercials are still louder than the program being watched.", "Date": "October 3, 2011"}, {"Title": "A Winner by Samsung!!", "Author": "E. Arroyo \"Jazz Lover\"", "ReviewID": "R1BUJ2DBY09T3T", "Overall": "5.0", "Content": "Picture quality is superb and sound is very good. Has minor reflection issues in lighten room, but this being a plasma screen, it is very minor.Biggest bang for your buck. Brightness and contrast controls are excellent.I recommend this TV 100%, glad I purchased it. Thank you Samsung!", "Date": "September 8, 2011"}, {"Title": "Great TV for the Price!", "Author": "April", "ReviewID": "RKZ4KZHZTBV5Y", "Overall": "5.0", "Content": "We purchased this TV from our local Wal-Mart on July 3rd to replace our Panasonic plasma that died after 2 years. Could not believe we got a Samsung for $499! The slimline of the frame is good and it runs much cooler than other plasma TV's I've seen. After a few minutes of tweaking the settings, we got a beautiful picture with vibrant colors and deep blacks. You will not be disappointed with this TV. Don't forget the extended warranty. It\"s always worth it on expensive electronics.", "Date": "August 31, 2011"}, {"Title": "Great TV", "Author": "Richard Reynolds", "ReviewID": "R2DL75U3G5JSOQ", "Overall": "4.0", "Content": "The picture and function of this TV is great.  BUT, I have three issues people should be cognizant of before buying.Issue #1: \"Internet connectivity.\"  It doesn't have any.Issue #2: Hooking up a surround stereo.  Unless you have a fairly new receiver which has a Digital Audio input you are out of luck.  I \"assumed\" it would have the \"normal\" RCA jacks for the audio, but it doesn't.  You'll need a new receiver if you don't want to use the TVs speakers.  The speakers are pretty decent, but it was a disappointment to find out I would have to spend another $200 for a surround sound receiver.Issue #3: No VGA input so don't plan on hooking your computer up to it.  None of thee things are advertised on the box, but buying a new TV can be a bit overwhelming to a lot of people. Just wanted to make this clear for people so they know what they're getting into.  I'd looked a bit longer had  I thought about these issues beforehand.  Its a great TV as far as picture goes.", "Date": "December 9, 2011"}, {"Title": "Bad Warranty Service", "Author": "ABE \"Abe\"", "ReviewID": "R3AESM6OJE6E3C", "Overall": "1.0", "Content": "Bought this plasma tv in Oct 2011. It is August 2012 and the screen has a red haze in the middle of the screen. There are vertical bars on both sides of the red haze. The red haze is solid and consistent and has no other ghosting image.Well, I sent in a repair request and received an email from ther authorized service department. They asked if I could send pitures of the issue and I did. Shortly after their response was that it is a burn in issue and not covered under warranty. I called Samsung directly to dispute their findings and Samsung directed me to their executive customer relations. Long story short - they also claim the issue is burn in.My point - I have 3 plasma TVs, this is the newest of the 3 and only this has a problem. Samsung never sent out a technician to even look at my tv or have me send the tv to them. They just concluded the problem based on pictures I sent them. (Somehow this makes me feel foolish). I know what most burn in/ghosting look like. I have had them on my other plasma TVs and easily removed. Never permanent.I will never buy another Samsung product because I feel that they don't stand behind their product.", "Date": "August 13, 2012"}, {"Title": "Died after a little over a year.", "Author": "Chris", "ReviewID": "R22QPQPC1F52MP", "Overall": "1.0", "Content": "TV worked fine when I had it working! A couple weeks ago the unit just decided to not turn on. The light just stays red and makes a clicking noise when I try to turn it on. Silly to have to replace a unit barely over a year old. Samsung won't do anything. Had a surge protector on the unit, never moved.", "Date": "August 8, 2012"}, {"Title": "Very nice bedroom TV", "Author": "Just a guy", "ReviewID": "R1W47THPH4AXJE", "Overall": "4.0", "Content": "We have this in our bedroom and like it a lot.  The TV has a really nice picture and - although there are no web services - it is perfectly adequate for everyday tv viewing.  We have it hooked up with a cable box and a roku box.  The firmware and interface are common across all Samsung tvs - give or take a few features.  I find the menus clear and intuitive. We use the turn on timer as a daily alarm clock.  It works fine.  The clock keeps decent time.My only complaint is that the inputs on the back stick straight out the back - thus your cables inhibit the ability to mount this close to the wall.  Other Samsung models - even the 22\" model - have the inputs run parallel to the screen, so the connectors don't interfere with a mounting bracket.The sound on this is pretty good.  Since it is in our bedroom, we dont have it hooked up to a home theater - we actually use the included speakers. They are pleanty powerful and certainly good enough for everyday viewing.  We even use the \"music stations\" from our cable provider when we want music in the bedroom.  The sound is acceptable for that.I like this tv a lot.", "Date": "June 29, 2012"}, {"Title": "WHITES FLICKER", "Author": "lothar", "ReviewID": "R1BAKTJNFTISWJ", "Overall": "1.0", "Content": "Samsung PN43D450 43-Inch 720p 600 Hz Plasma HDTV (Black) I had heard of some Samsung flickers  in their plasma but thought can't be real. Well it was. Do the picture test, look just outside the TV frame and you will see light colors, green yellow and esp white, vibrating pretty fast. At least on my unit. The problem was more evident when watching hockey or news when they may have charts or dynamic contrasts and whites.The low rating is due to the BS I experienced with Samsung Canada customer service, service center asking me to do more testing, and eventually the easier solution was still taking it back at BestBuy...", "Date": "February 1, 2012"}, {"Title": "No Analog Audio Out", "Author": "J. Orvis", "ReviewID": "R14XKWY4H152JJ", "Overall": "4.0", "Content": "I don't have much to say yet about this TV as I have barely used it so I'll do an update later.Right now I just wanted to point out that there is no analog audio out.  The description says there is analog out on the side but there isn't.This means that unless your audio system uses digital audio or you have a converter you won't be able to hook it up to this TV.The description also lists an Ethernet jack but clearly there isn't one.", "Date": "January 28, 2012"}, {"Title": "great TV!", "Author": "JBergevin", "ReviewID": "R3C53DLDJHURXL", "Overall": "5.0", "Content": "I have the 51\" Samsung plasma (PN51d450) and absolutely love it! I was concerned that 720p would diminish my viewing experience but after reading the reviews decided to give it a try.  When seeing it next to others in a store, the video didn't look as good as some of the other sets...then I read about the \"tricks of the trade\" stores use to push certain products over others.  One of them being changing hues and contrasts to display a less than optimal picture on sets where the profit margins are lower.I ordered this set and am thrilled with its picture quality and its sound.  The only draw back I can think of is the fact that it only has two HDMI inputs.  I currently only have the need for one anyway so I'm nit picking here.  Great set at the best price I have seen.  You won't be disappointed.", "Date": "January 11, 2012"}, {"Title": "Samsung Plasma PN43D450", "Author": "Trebor", "ReviewID": "R4QV32GQ739ZD", "Overall": "5.0", "Content": "Purchased this as a B-Day Present Sept 2011 for mum she upgraded from a 15yr old 25\" Sony. Worked great for a week then the power board blew, Samsung tech was out in week said All the new plasma tv's are running too small of power boards. No problems since mum really loves it, great picture esp w/HD cable hooked up much more real looking picture compared to an LCD I think. Going to purchase one for myself soon.", "Date": "January 6, 2012"}, {"Title": "Top Notch Picture Quality", "Author": "Logan", "ReviewID": "R11T0E85QGKLSZ", "Overall": "5.0", "Content": "I researched tv's a lot before coming to the conclusion that this was the best buy in this price range. After finding that the plasma had the edge over the lcd in many aspects(more viewing angles, darker blacks, brighter colors, etc.) I chose to go with plasma. If you're worried about burn in, don't be. Just do the precautionary break in and you will be completely fine. I have this hooked up to a home theater system and I couldn't be more happy with the outcome. The picture quality is stunning. It has definitely made me a fan of samsung. I would absolutely recommend this tv.", "Date": "December 23, 2011"}, {"Title": "Purchased at a GREAT PRICE from amazon", "Author": "Franky Franks", "ReviewID": "R2F1MOX8IZ31KV", "Overall": "5.0", "Content": "The picture is great, the colors are deep and vivid. You will have to do a little adjustments to the settings, but it's easy. The 51\" screen size is nice and I purchased this for a great price of $499. Amazon has some great deals, you just have to check often because they might only last for an hour or two. This was the best price anywhere!", "Date": "December 10, 2011"}, {"Title": "Get 'em, coach!", "Author": "Kevin", "ReviewID": "R11HKEBUK9JRDS", "Overall": "5.0", "Content": "Alright, here's the skinny: I bought this set during the black friday sales this year at BB for $399. I was debating between this set and a 47\" Panasonic for the same price. After being able to see set, I decided to go for this set because the panasonic, despite being 1080p, had a very grainy picture. Fast forward 2 weeks, and I am happily viewing a plethora of TV shows and movies on this television. Browse AVSforums if you want further insight on how to improve your viewing experience when using this set.Personal gems that I would like to point out:- while \"breaking in\" this plasma, I accidentally forgot to loop playback of the color transistions. So after 40 minutes, the video stopped and the tv displayed my windows 7 desktop... for 6 hours while I was asleep. I was terrified when I woke up, fearing burn in/image retention. Alas, none were to be found.- touch screen buttons on the bottom left (they don't stick out so people used to CRTs, like myself, will be searching for protruding buttons for a while)Do yourself a favor and upgrade your old/smaller tv to this one. The picture is amazing!", "Date": "December 9, 2011"}, {"Title": "Beautiful picture, great value", "Author": "John C", "ReviewID": "R3X75FUEPJL9S", "Overall": "5.0", "Content": "I've had this TV for about a week now and I can't say enough good things about it! The picture on this is absolutely awesome! The colors are rich and deep. Black blacks. I've watched quite a few sporting events on this and there's no problems with fast moving action. The screen is pretty reflective so that could be a problem for some people. I have it in the brightest room in my house(none of them are particularly bright though) and it hasn't been an issue for me. If you want to put this in a room with a lot of windows and lots of light you may want to look at some other options. The only other drawback is that there are not a lot of connections. There are 2 HDMI and 2 component connections. Of course, you can always pick up a switch/hub to rectify this so it's not really a big deal. Aside from the picture being great, the sound from this TV is surprisingly good. Most of the value priced flat panel TVs that I've heard have been lacking in that category. For around $500 you really can't go wrong with this TV. This is a great buy!", "Date": "December 9, 2011"}, {"Title": "deal!", "Author": "Harold Bowen", "ReviewID": "R7ISVN8TYY4XM", "Overall": "5.0", "Content": "Purchased this unit (43\") on Saturday after Black Friday for $350.00! Store (Meijer's) had a LOT of discounts going on.  This looks great so far and give a great HD picture quality. Sound is pretty good but wish it did have a \"sound jack out\" for sound for my old amplifier. It only has the digital sound output option. I solved this by running the sound through my cable box, then to the older amplifier. I will update this after I have it for awhile; so far it looks great in my rec. room!", "Date": "November 28, 2011"}, {"Title": "great plasma", "Author": "Lee", "ReviewID": "R263MHVNETQW8X", "Overall": "5.0", "Content": "It is a very nice tv for less. TVs are getting better and better and prices are getting lower and lower every year. No need to get the expensive one.Comparing to what we had few years ago. It's a perfect TV.settle with one nice TV and save some money in this economy.", "Date": "November 25, 2011"}, {"Title": "Great Value", "Author": "CraiginCali", "ReviewID": "R2ZRGWINXC6F2W", "Overall": "5.0", "Content": "I have never been able to tell the difference between a 1080i and 1080P picture with regards to quality of the picture. This TV has a crystal clear picture and is great for watching sports, which is the primary function for is set since it is located in the \"Man Cave\".  For the price, this is an outstanding value. I was really surprised at the quality of the sound that this unit produces. Very pleased with the product so far.", "Date": "November 5, 2011"}, {"Title": "Great Deal for Quality", "Author": "Timothy Mitchell", "ReviewID": "R1ZCXK2495YY26", "Overall": "5.0", "Content": "For this product being my first flat TV it been like having front row seats at the movies. Keep in mine for this TV is all H.D. it will require newer equipment so I bought a PS3 to watch shows and play a little. It has great picture and sound, I do not need some kind of sound system to enjoy every thing I do also it is vary simple to set up any HD device in to it. So if you get a chance to get this deal, it is worth it.", "Date": "October 15, 2011"}, {"Title": "good TV", "Author": "Zelron", "ReviewID": "RWV7VT844WGJV", "Overall": "5.0", "Content": "This is my first HDTV and the build + picture quality is outstanding. I went to a local store to look at it side by side with other Plasmas and LED TV...this one looks the best in terms of design and picture (for its price range).The screen can output an awesome black...and the built-in speaker is sufficient for regular TV watching.This is a basic HDTV that offers good picture and sound quality. Perfect for a bedroom or if you just want to stream stuff to watch online. I would get a bigger / higher resolution TV for blu-ray viewing though.", "Date": "October 11, 2011"}, {"Title": "awesome", "Author": "jake j", "ReviewID": "RDKY1OTB2WWR", "Overall": "5.0", "Content": "i confess i paid $478 for this one at walmart(had to have it in time for the lsu v oregon game)...but it was worth every penny.  you might be thinking 'only 720p?' but of all the tvs i looked at(and there were quite a few)this one had the sharpest contrast,brightest colors, and overall best picture of any i saw except the extreme high end tvs.  the sound was not theater quality, but surprisingly better than i expected after some reviews i read.  it is a plasma, so you do have a glossy screen--just adjust room lights so you don't get glare.  and while i don't enjoy doing it, going into the settings and tweaking the picture to your liking will greatly improve the picture(factory settings weren't the best for me).  oh, did i mention that in price vs size vs quality i think it beat any led/lcd that i saw?", "Date": "September 15, 2011"}, {"Title": "Impressive qualtiy HDTV for the money", "Author": "Amazoned", "ReviewID": "R1UWC4VG7FANN7", "Overall": "5.0", "Content": "We bought this as simply a TV monitor, with video source coming from cable (720p HD), and Xbox Kinect.This Samsung may not be the cheapest in its class, but its price still very attractive. I chose to spend $50 more for its better \"surround\" sound - good enough that I don't have to buy a sound bar. It certainly was the right decision as far as the sound goes - good enough for a 15ft x 20ft family room.The plasma display is very good. It is bright (brighter than my 50\" THX-certified LG) and its picture is sharp.I mount it on the wall using a low-profile mount. It weighs about 50lbs, which is a lot easier to handle for one person than other TVs in its class!The only thing that might be an issue for some folks is its reflective glass. During the day with bright sunlight, I can see the reflection from the screen clearly when the TV is off. Much less when it's on because the TV is quite bright.Family members are pleased - a beautiful TV to make family room nice place for casual TV viewing, without breaking the bank.", "Date": "September 14, 2011"}, {"Title": "Audio outputs", "Author": "S. L. Valent", "ReviewID": "R1OV6WQVNQSMYU", "Overall": "1.0", "Content": "Advertised as having a analog audio output but it only has an optical audio output so be aware that you will need an adaptor.UPDATE:  After only 6 months the plasma screen cracked.  Samsung refuses to repair saying it was \"physical damage\". Yes, physical damage caused by thermal expansion of the screen. It is a well known problem, I now have a $700 paper weight.  Do yourself a favor and Google Samsung cracked plasma screen.", "Date": "August 26, 2011"}, {"Title": "Love it!", "Author": "Undecided Major", "ReviewID": "R1H5CYT82O7P8R", "Overall": "5.0", "Content": "Only have had it for a few days, but so far I LOVE IT. Great TV, great deal...... life is good. Amazon simply rocks. Loved the white glove delivery by CEVA who called to tell me when they were coming a few days later and came when promised. They removed from box, set it up, made sure it worked well, showed me some basic features and asked if I wanted the empty box removed. Hassle free, and a great TV!!!!!!! Get one!! :)", "Date": "August 17, 2011"}, {"Title": "Great Plasma TV (with issues.. for me, at least)", "Author": "Philip J. Park", "ReviewID": "R1SX89ZY9TEEI0", "Overall": "4.0", "Content": "Just want to say how impressed I was with this TV. I replaced my ANCIENT 51\" projection TV from the 90's after the colors were offset (it served us well though). The video quality (depending on its source)is as good as it can be on a 720p TV. I am currently watching the Man U vs. Barcelona match live and the refresh rate is stunning.. man, I can't wait for the football (both NFL & Premier League) season to start!My problem is that the technical description on Amazon is a little deceptive. it says something about a PC input but I can't find it, unless they're considering the HDMI as a PC input. I was hoping for a DVI or VGA connection so I could hook up more HDMI sources but that didn't happen. FINE. At least I could use the USB port to playback my video files like the technical description says, right? WRONG! This model being a low-end model, it doesn't support video playback via USB (it only supports Photos & Music).Overall, I'm very satisfied with the purchase. I watched a couple of DVDs and Blurays to check out the quality and it's great! I mean, C'MON! you can get 2 of these for the price of one 1080p. It's $650 (with free shipping) for a 51\" TV from a quality brand.", "Date": "July 30, 2011"}, {"Title": "Best tv for the money", "Author": "everlasting1832", "ReviewID": "R3EMWY6DFC3L9I", "Overall": "4.0", "Content": "1 Word. SAMSUNG...#1 tv company...The color and contrast ratio on this tv is stunning...I love 720p vs 1080p because when i watch standard definition tv or even DVD's they still look sharp and crispy not all smudged up like 1080p and then when i watch HD the 720 kicks in and really I cannot tell the difference between 1080p not until you look really really close. This tv looks great playing call of duty modern warfare 2...the only downfall about this tv is only 2 hdmi ports and only and optical audio out which makes it harder to find a home theatre system...only new hometheatres can hook up to optical inputs/outputs. get the namebrand and the quality for a good price..i recommend this tv.", "Date": "November 1, 2011"}, {"Title": "Ode to a Plasma TV", "Author": "Daniel Wilson", "ReviewID": "R1IGDCL8IMM8D0", "Overall": "5.0", "Content": "I grew up in the age of CRT,It seemed quite good to me,Yet I have heard of late,A technology described as great,That shows a picture more profound,With vibrant colours that astound,But I did so love my CRT,The old reliable technology,Still my friends did insist,Alas, I could not resist!And so fate I tempted,Since, I have but lamented,All the many years wasted on thee,Ailing, aged, and pathetic CRT,Now I know true joy,With my new televisual toy,I will watch until I can watch no more,All videos with plasmonic glory galore!", "Date": "October 4, 2011"}, {"Title": "Great TV, just not for me.", "Author": "MChief576", "ReviewID": "R3TGFGEJIEJSDH", "Overall": "2.0", "Content": "I recently moved to a house, which has a bigger living room.  I have a 40\" Samsung 720p LCD, which I still love.  I just wanted something bigger.  After several weeks of research, I decided to buy this Samsung Plasma.  I read lots of online discussions regarding the issues with Plasmas: Image Retention, Sun Glare and the break in period.  I contacted Samsung regarding the break-in period, they said this TV does not need a break in period.  The TV also has built in Screen Burn-in protection and is Energy Star Compliant.  Plus, I couldn't ignore the amazing price, free shipping and great reviews.Amazon shipped the TV within 3 days.  The movers brought the TV upstairs and made sure it worked.  As soon as I turned it on, the picture was great.  Even though its a 720p, its an amazing picture.  The plasma appears to be a nicer picture then my LCD.  I can't comment on the sound, since I use a HTIB.  At first I was very happy with my purchase.  I have 3 large windows to the right of the TV; sun glare was not an issue.  Unfortunately, there is one major item I did not notice when researching Plasma's - Reflection.  Anytime there is a dark image or color, I can see my reflection, the couch and anything else in front of the TV.  I thought it was because of all the windows in the room.  But, I can even notice my reflection at night, with no lights on.  I had some friends over to get their opinion.  All of them noticed the reflection, but it didn't bother everyone.  For me, I find it distracting.  This will be going back to Amazon.  Too bad, the TV produces a great picture.", "Date": "August 21, 2011"}, {"Title": "Stopped playing", "Author": "Mary Ann \"Mary Ann\"", "ReviewID": "RRR2AKB2YT7OX", "Overall": "1.0", "Content": "After 2 years and 1 month the picture went completely black and won't come back up. Tv still has sound. You can no longer buy this model, and I guess for good reason. But I also wonder how long the other Samsung plasma televisions will play without having a major issue such as mine!", "Date": "August 17, 2013"}, {"Title": "Deserves 5 stars, but I'm bitter right now...", "Author": "Shawn", "ReviewID": "R1NB92N46GA2YI", "Overall": "1.0", "Content": "Was a great TV right up until it broke two weeks after the warranty expired.  If Samsung will still honor the warranty, then I will give it more stars and continue to buy Samsung products.  If not, then I'll leave it at 1 star and forever curse the name Samsung.", "Date": "January 2, 2013"}, {"Title": "Great TV, misleading product page", "Author": "Nadav Samet", "ReviewID": "R2PRWOEOKOUUQ", "Overall": "4.0", "Content": "When I read the technical details on this product page, I had no doubt it fits my needs. Ethernet port, PC input, USB port that play videos and more. Yeah, it's only 720p, but a 51'' Samsung TV with these specs for $645 is quite a bargain.The TV arrived and I was (and still am) very satisfied of its quality, size and color depth. No question about that.However, I was disappointed of the misleading details that I read on the page. I found out there was neither Ethernet port, nor PC input. Only HDMI ports, component and optic inputs. The USB, of course, could only play music or show images. No video option exists nor a way to upgrade the firmware. I spent an hour on the line with a special Samsung technician that gave up saying that he can't find a way to do it.The bottom line is that the TV is great, but know what you order, ensure it ships with the components you wish for, and see if it's worth the price after that being take into account.", "Date": "January 1, 2013"}, {"Title": "Great TV for a light controlled room. 720P is not a problem at this size", "Author": "Kyle E. Henderson", "ReviewID": "R26A08A4FFSTQD", "Overall": "5.0", "Content": "When I was searching for TV's I had a budget of $1000. I researched for a lot longer than I should have looking at LCD's vs. Plasmas vs. LED/LCD's. I wanted a TV that would give me the most accurate colors, best image quality, best gaming experience (Xbox 360), and best movie watching experience. Time and time again I saw that Plasmas deliver the best for these uses. You go to Best Buy or some other big box retailer and see all the TV's on the wall and the LED/LCD's look the best by far. But that's because they're on super eyeball-bleeding brightness because those stores are so bright. The Plasmas look terrible there. But bring a good Plasma back home and put it in your living room and it will give you amazing colors, rich blacks, and amazing detail. LED/LCD's for the most part make things look to fake I think. Anyway, I ended up with this TV for about half my budget price and couldn't be happier. The community at Avsforum.com is what won me over. Everyone raves about how good the panel is in this cheap TV. And they're right. I've had this TV for about a year now and its been awesome. 720P, even at 51in, looks great. You seriously won't see the difference unless you're watching a Blu-Ray movie that is very graphically intense and made for Blu-Ray watching. If you have this TV you really need to check out the owners thread at avsforum.com for calibration specs and details: [...]Only con I can think of about this TV is that it does NOT have normal audio out. The only audio out is optical. At this point I'm sure there are newer and cheaper models but this TV has been great. (I see its $749 right now, I got it for around $500 last year).", "Date": "December 3, 2012"}, {"Title": "Amazing TV", "Author": "Jesse13", "ReviewID": "R3MLH65E664E8J", "Overall": "5.0", "Content": "I've had the tv for over a year now and it still operates like a champ. I know that there are people that complain about certain features about the TV, like the usb hook up and internet user interface, but if you want a TV for a great price (got mine for 500) then this is your TV.It does well what a TV is supposed to do. To be honest i have this thing hooked up to my receiver so i can't vouch for the TV speakers but again if you're just looking for a great TV then this is your buy. No big TV is going to have amazing speakers built into it for less than a couple grand, so screw that haha.", "Date": "September 7, 2012"}, {"Title": "Incredible Value", "Author": "TSR3000", "ReviewID": "R1J4F1V2IWS4X", "Overall": "5.0", "Content": "Bought two of these bad boys.  Samsung is my brand for tvs.  This tv does the job.  Great picture, good sound and amazing value.", "Date": "July 22, 2012"}, {"Title": "Samsung PN43D450 43\" 720 Plasma TV", "Author": "dj lucky two", "ReviewID": "R1FDBC9W0HCDON", "Overall": "4.0", "Content": "This TV is just great. Did not really trust Plasma TV's with all the bad rep. they where getting. This model is just great for my living-room. The only bad thing about it is that it does not have a audio output in the back to connect to your stereo.  It does not have the red and white connecters to connect your stereo. Besides that, the TV is just great. The sound is a lot better than expected. It was given to me as a gift and I am loving it except for that one problem.", "Date": "March 21, 2012"}, {"Title": "Little details that matter", "Author": "Guillermo", "ReviewID": "R3MIYKOHLTQ8MH", "Overall": "4.0", "Content": "Some things you would not know until you use this:1. Image quality is superb. No need to pay extra for 1080p.2. Aspect Ratio is a little wide compared to other TVs.3. Sound is OK. Not bad, not impressive. You should use an additional sound sysyem with any TV of this size, anyway.4. Sleep function is not good, the minimum setting is 30 minutes, next is 60. I find this very annoying, as I like to set the timer to only 10 minutes.5. Remote control range is terrible. You have to point the remote directly to the screen in order to get a good signal. Even then, buttons are hard to use and you cannot press the buttons several times in a row and do what you intended. The delay is terrible.Overall, this is a great buy. I paid $649.00 on Amazon and Im happy with my purchase. 51 inches and great image quality for less than $700 is hard to beat.", "Date": "March 15, 2012"}, {"Title": "Only minor quirks", "Author": "ColtonMilne", "ReviewID": "R6T7I0RXAWAJZ", "Overall": "4.0", "Content": "I purchased this tv on sale at best buy for $425 a few weeks before black friday and i am thoroughly impressed for what i payed for it. i waited until now (March 3, almost 4 months later) to write this review just to see how it performed over time.Pro's:Great Picture, Great Price, Deep Blacks, Vivid colors, amazing sound for a flat screen, very thin for a plasma, small bezel, Aesthetically pleasing.Con's:TV does have a minor \"buzz\" sound while on, but as long as you are playing a game or watching tv or a movie you dont notice it. this is the only downside that i have noticed.Overall, AMAZING tv for the money. almost as thin as a LED, but with better lighting and picture quality. Plasmas are still the best for sports and movies (although LCD has gotten better) and burn in issues are almost nonexistent anymore. i would recomend this product to anyone in the market for a low price flat screen.", "Date": "March 3, 2012"}, {"Title": "F'n sweet", "Author": "mattyboy", "ReviewID": "R1BXSO6SUYBJJZ", "Overall": "5.0", "Content": "This Plasma is awesome I use it for my PS3 and Xbox 360 if you are iffy on getting this just get it trust you won't regret it its pretty sweet.It works pretty well with my Ps3 i can turn my PS3 on and by doing that the tv will turn on as well and even switch to the right channel source for the PS3 if it isnt on there already.", "Date": "March 1, 2012"}, {"Title": "Amazing for the price", "Author": "C. Smth", "ReviewID": "RDKXRXUUW3KR8", "Overall": "4.0", "Content": "Been stuck choosing between LCD/LED/Plasma. After much comparison, great reviews and seeing this on sale at BB for $399 I had to give it a try. The whites looked weak in store compared to LED but the colors were so rich and the contrast was great. As I looked at LED/LCD I saw even top end models show strange artifacting and breakup in certain screens like smoke or fog, or lights shinning thru smoke, etc...but most all Plasma's looked perfect showing same. Set up was a breeze. Did some tinkering and found the Dynamic mode which really makes this TV pop. After some more calibration, I have the whites looking pure and the blacks go as deep as the frame color, this TV amazes everyone who sees it. Only 720p? Wow...and it's not even really a full 720p, how did Samsung pull this one off? Played Rio on BD and never seen such a great PQ, and BD of Titanic blew me away. Then I tossed in the DVD (upconverted) of Dick Tracy, this movie will test color contrast to the max, it's one of the best test movies to use as the sets are the most unusually vivid colors, anyway, it looked so good it almost overides the bad acting, then played the Crazy88's scene of Kill Bill, the colors and contrast showed every detail. These new Samsung Plasma TV's are just amazing, unless you have a bright room... then the reflections on screen and washed out colors dont do it justice. Also it looks really quality when off too.", "Date": "February 24, 2012"}, {"Title": "Beware, this not on a PN43D450 it's for.....", "Author": "6lumbar", "ReviewID": "R3DBQZR9RKWRL5", "Overall": "3.0", "Content": "It is for PN51D450A2D, after reading these reviews I see there are 2 different models which is causing some confusion.It seems the PN43D450 is getting all bad reviews and (now we see why)  PN51D450 is getting the good reviews, not sure why Amazon allows reviews for a different model.I went to Samsung and found a link that might help you folks who purchased models PN43D440, 450, 490. There is firmware update for your sets:[...]For the PN51D450, I am very happy with the picture quality, the sound is very good after some adjusting, the cons, NO swivel base, cheap remote, no light, needs more HDMI AV inputs.", "Date": "February 15, 2012"}, {"Title": "Awesome TV", "Author": "edwards", "ReviewID": "R1DEKC09MU65DY", "Overall": "5.0", "Content": "It is the perfect 51 inch. Is large and and thinner than I thought it would be. I weighs about 60 pounds which is good for a plasma and the color is great. The speakers do well but I didn't buy the tv for the speakers. Everything else is great from the way it looks on both picture and overall. Meaning the border edge of the tv is a perfect size. The tv was delivered and opened for me inside my apartment on the second floor and they tested it.", "Date": "October 24, 2011"}, {"Title": "no complain...", "Author": "E. Espino", "ReviewID": "R17O8OSPTOMPDH", "Overall": "5.0", "Content": "great, pic. and super color is in my basement and fits perfect, great price, and was like always on time, and in one  piece  great services, and the price was right...", "Date": "October 16, 2011"}, {"Title": "lovin my big 51 inch", "Author": "House123", "ReviewID": "RU6OX46GEN9N6", "Overall": "5.0", "Content": "I have researched 50 inch tvs for 2 years. The Samsung was well reviewed and the price was right. It was best price online and it was lower than Costco.", "Date": "October 1, 2011"}, {"Title": "Great for the price", "Author": "RBH110", "ReviewID": "R36O872MODP0GP", "Overall": "5.0", "Content": "For 478 can't be beat.  Nice sound, uses a lot less power than previous plasma.  720p from 11ft away is fine. Save 100s over LCD.", "Date": "September 28, 2011"}, {"Title": "Great tv for the money", "Author": "Kim", "ReviewID": "RV9I0ZTGI0LPN", "Overall": "5.0", "Content": "Great tv for the price. I couldn't be happier with the choice we made. The tv has a beautiful picture and was easy to set up.", "Date": "September 12, 2011"}, {"Title": "Great Buy", "Author": "stew", "ReviewID": "RMFSA3939WYH3", "Overall": "5.0", "Content": "The TV is exactly as described.  In my opinion for our use a 1080p version would be a waste of money.  Our HD signals show beautifully on this set.", "Date": "September 10, 2011"}, {"Title": "Good value for a low price.", "Author": "LasVegas", "ReviewID": "R2Y8M4CFH52Q9D", "Overall": "4.0", "Content": "Picture quality and sound are very good.  Some, but not all, of the more expensive tvs will have better pictures; but for the price, this is a great buy.  If your budget is limited, you will not be disappointed.  I purchased from Amazon and it arrived exactly at the time it was scheduled.  Very satisfied with this tv.", "Date": "August 28, 2011"}, {"Title": "Samsung PN51D450 51-inch 720p Plasma HDTV", "Author": "ptc golfer", "ReviewID": "R3TMIZTPZECY4E", "Overall": "5.0", "Content": "I'm not a techno-freak, but I do know a good picture when I see it and good sound when I hear it. This set has both.  I was a little concerned about the 720p vs 1080p, but I can't imagine a better picture than this.  Plus, the price was very inviting.  The set is very thin and light.  I'm very pleased with my purchase.", "Date": "August 17, 2011"}, {"Title": "Best Picture fot the $", "Author": "hard1099", "ReviewID": "R3F526DZLK3XWT", "Overall": "5.0", "Content": "I was thrilled when I got to compare this TV to the larger 1080 side by side and couldnt believe how great the picture was for 1/3 the price. I too was hung up on the 1080 P thing until I got the TV home and couldnt believe how great it looked. My other TV was a sony that I paid over 4 times as much and it only lasted 3 years and 8 months. So for the money this is a great TV that you will be happy with.", "Date": "July 24, 2011"}, {"Title": "Awesome for the price", "Author": "Theodoros", "ReviewID": "R3H1JIIGPBYVEI", "Overall": "4.0", "Content": "Great TV, awesome picture, would buy 3 more. Only inconvienience is the fact that it only has 2 hdmi ports.", "Date": "July 9, 2011"}, {"Title": "Exceptional Buy", "Author": "Surfin San Diego", "ReviewID": "R2JAO8USXTEC6O", "Overall": "5.0", "Content": "No better value for the money. Great picture quality. Great size. Real home theatre experience. Sound can be customized to your preference and get a deeper richer sound . Slim, sleek and modern. Best value ever.You can't go wrong.", "Date": "April 22, 2011"}, {"Title": "Great Plasma", "Author": "bcd74", "ReviewID": "RDXQLZJIXE036", "Overall": "4.0", "Content": "Cheap, great design and great colours once its calibrated.You cant really ask for more, maybe one more HDMI port, but its not a problem for me.", "Date": "October 27, 2011"}, {"Title": "Great TV, great price, great tech", "Author": "M. Rogish", "ReviewID": "R2JPU3JXWC4YLU", "Overall": "5.0", "Content": "I'm a big fan of Plasma (I have a 50\" Panasonic plasma) and was considering a second TV for the bedroom. Although this is bigger than we had wanted, the tech is great (plasma > LCD!) and it's such a great price/performance I couldn't justify getting a smaller 32\" for nearly the same price... and should the 50\" go belly up, we've got a really nice replacement.", "Date": "May 23, 2011"}, {"Title": "Awesome TV!", "Author": "m.randowjr", "ReviewID": "R3Q3LR1M2DTIJO", "Overall": "5.0", "Content": "This is my first flat screen TV purchase since I've only ever had the ole Tubes, and I love this thing! Sure you may balk at the fact that it's only got 720p for a 43 inch, but unless you are extremely anal about your picture clarity, this TV does just fine.", "Date": "June 9, 2011"}, {"Title": "Very disappointed", "Author": "Justin", "ReviewID": "R8D3RXWS47Z6G", "Overall": "1.0", "Content": "So I just setup my Samsung tv last night and it doesn't work.  No video, it will power on and I can hear audio but nothing but black screen.  The Samsung online troubleshooter is useless but the tv is in parts and labor warranty so they will be sending a tech out to fix it free of charge.The tv came in perfect condition so Samsung must have cheaped out on some part's.This will definitely have a negative impact on any future purchase of Samsung tv's.", "Date": "February 17, 2012"}, {"Title": "plasma beat lcds", "Author": "L'l Abner", "ReviewID": "R3JCHD7QDAKQO9", "Overall": "4.0", "Content": "Delivery of this was a problem, but not the fault of Amazon. The subcontracted shipper apparently \"lost\" the shipment enroute and it finally arrived two days late. But better late than never I guess. The Tv produces a fine picture (after tweaking the regular settings) and beats LCDs (even the 1080p sets) big time. Just expect that you will probably have to fine tune the picture for your individual taste./", "Date": "December 30, 2011"}, {"Title": "Great Buy", "Author": "Willy", "ReviewID": "R35AOW88PE6EXW", "Overall": "5.0", "Content": "This is an awesome TV. It comes with all the latest amenities and has a very crisp sound. Shipping was no problem and i must say that it looks great.", "Date": "December 26, 2011"}, {"Title": "samsung 51\" tv", "Author": "Michael Tulett", "ReviewID": "R2PK2RJ3ADE7CM", "Overall": "4.0", "Content": "I love it! great pic, great sound, perfect size for my basement living room.  Only thing is that the picture is a little fuzzy when not on the HD channels.", "Date": "December 24, 2011"}, {"Title": "Great tv !!", "Author": "Carelessranger", "ReviewID": "RQ46ML3KQPA0U", "Overall": "5.0", "Content": "Great tv. Picture is amazing!I I have owned alot of TVs and this is by far the best! Younwill not be disappointed!", "Date": "June 15, 2011"}, {"Title": "Great picture", "Author": "S Long", "ReviewID": "R3OZDWGWKBKWWT", "Overall": "5.0", "Content": "The picture is great and so was the price!  I've had no problems with it and it was easy to set up.", "Date": "November 27, 2013"}, {"Title": "The Way to Go", "Author": "monk3y", "ReviewID": "R3UPI1J4RM228J", "Overall": "5.0", "Content": "Very good, HD, easy function, and I still have it in a very good condition after 2 years. Easy to maintain and clean :)", "Date": "November 8, 2013"}, {"Title": "great tv", "Author": "Atheist1696", "ReviewID": "RKIWFPSBZU2HB", "Overall": "4.0", "Content": "I bought two of these for rental units. They are a bit heavier than the same-size LED, but still are supported by a one-stud TV wall mount. Good size for a standard size room, 12 foot width. I got mine from Wally world.", "Date": "October 15, 2013"}, {"Title": "Loved it!", "Author": "Montgomery", "ReviewID": "RSRFW03N8QEIM", "Overall": "5.0", "Content": "This was my first hdtv that I bought. I LOVED it...that is until my grandson threw a remote and cracked the screen.  We recently replaced it with the \"newer\" version of the model and it's not even close.  The picture is not as crisp, nor is the sound as great as the 11 samsung model.  It took me three to four hours picking out the screen that looked right to me.  We hadn't had it for even  year and warranty didn't cover it.  I want one back, searching for the same model, the newer model doens't come close in my opinion!", "Date": "January 20, 2013"}, {"Title": "Working great", "Author": "Syuen Ferreira", "ReviewID": "RVUZLBDQDM72A", "Overall": "5.0", "Content": "We bought our TV in January of 2012. I have no regrets it works really well. I also connect it to my computer and watch my online movies. Good price for such a good product.", "Date": "December 4, 2012"}, {"Title": "so far so good, :)", "Author": "kevin dai", "ReviewID": "R2CS9HOUM1WZLM", "Overall": "5.0", "Content": "i bought this tv last yr around november.  Up till now, this tv looks amazing, the pic quality is superb, the sound, everything i mean!  Maybe im just lucky, but unlike some of the other customers, i haven't experienced any issues w/ this tv at all.I read about that the plasma uses more electricity than the led ones, but i haven't seen a dramatic increase on my electricity bill since i bought the tv.  the tv is on during the wkend most of the day, and 3-4 hrs/day during the wk. maybe im paying 3-5 bucks a month more in electricity, but thats no big deal.  The only thing that i can think of is glare, but thats just something that you have to live with when you decide to go w/ a plasma.  Plus, im not home during the day anyway, so, it doesn't bother me that much.all in all, im a happy customer who is extremely pleased with the tv, the price is right, the image quality looks amazing, cannot ask for anything more, :).", "Date": "November 2, 2012"}, {"Title": "Excellent for the price", "Author": "M.", "ReviewID": "R3706JVAPWAOBY", "Overall": "5.0", "Content": "Excellent TV! This TV is connected to my HTPC. I play mostly HD movies and online HD videos. The picture quality is nice, blacks are good. This is a great purchase for the price !!  IT is also quite stable I think. The pedestal is glossy, like the frame of the TV, so it does pick up dust. Other than that, I'm a very happy customer.", "Date": "April 1, 2012"}, {"Title": "Love this TV", "Author": "Vaughn G. Stewart \"toothwiz\"", "ReviewID": "R197HHA2THBRPP", "Overall": "5.0", "Content": "I bought this TV a month ago, I wanted a 1080p LED but couldn't afford the one I wanted. I researched for a couple of weeks, went to stores looked and asked questions. I realized that this 720 Plasma would be all I needed for my bedroom. I have been very pleased with the picture quality and the sound. I don't have light reflection issue in that room which made it easy, plug and play!", "Date": "March 4, 2012"}, {"Title": "Best plasma under $500", "Author": "Efrain Ruiz Jr.", "ReviewID": "R4WULASCB433J", "Overall": "5.0", "Content": "I bought this TV ($399) with eager anticipation knowing it had a great reputation and glowing reviews for what it was: an entry level plasma with no \"smarts\", no internet connection, no 3D, but an awesome picture.It really looks a lot bigger in person as I was afraid it would be too small for my living room but it looks great replacing a 32\" CRT that served me well but was increasingly the odd man out in a digital world. The bezel on the TV is very thin so almost all of the TV itself is pure digital picture which makes it fill up a room nicely. The TV is not heavy and the remote is easy to use.I immediately set the picture settings according to some other knowledgeable owners that have found the perfect video settings and was FLOORED by the clarity despite it only being a 720p HDTV. Of course I am feeding it pure OTA HD signal (free!) via antenna and have my trusty Roku hooked up via HDMI for HD movies and programming. I also bought a cheap Blu-Ray ($67 Panasonic DMP-BD75)to watch my huge DVD collection and the occasional \"wow\" Blu-Ray (Avatar) that I would want to own. I streamed Tron Legacy on my Roku as a 720p signal for a test and was very pleased and excited to see the detail on the uniforms, the inky blacks, and the smooth almost glass-like environments glowing in crystal clear glory.Now let me slow down for bit though, this TV is NOT the best plasma that Samsung makes nor is the best money can buy, but for the PRICE there is no equal! Please remember that this TV is perfect for consumers like myself that want quality but without the frills and the latest tech of the month that drives up the price on everything nowadays (3D, Bluetooth, SmartTV, Wi-Fi, Apps, you name it). For the price you can't go wrong, Enjoy!", "Date": "February 22, 2012"}, {"Title": "great product for an exceptional price!", "Author": "kaydeecee3", "ReviewID": "R2QWIGU99QE046", "Overall": "4.0", "Content": "I am very satisfied with this tv. I was a little nervous to order from Amazon but so far the television works great!it is also very easy to set up. I had the help of my teenage daughter. I have to mention though, that it was poorly packaged. I'm surprised there was no damage. Overall it has been a great buying experience.", "Date": "February 21, 2012"}, {"Title": "Samsung 51\" Plasma 720P", "Author": "Andrew Morris", "ReviewID": "RZ6S3HN9988NL", "Overall": "5.0", "Content": "Where to begin?  My birthday fell on the Super Bowl this year.  I decided it was time for a new TV as my old one had crapped out.  I had originally purchased a 55\" LCD.  The picture was incredible.  It was full 1080 (my first of this stature) and pixelation was nowhere to be found.  What it did have though was this new motion interpolation technology and no way of turning it completely off. If you're familiar with what I'm talking about then you know how much it sucks.  It makes everything look super fake and cheesy as if it were shot on a home video camera or entirely in front of a green screen.  This includes major hollywood movies.  They looked like crap and were completely unwatchable.  Enter the Samsung.  I returned the 55 (not Samsung) and got the Samsung 51\" Plasma.  I was worried about downgrading to 720p from 1080.  Non issue.  Plasma burn in has not been an issue at all either.  For those of you wondering if this is a good TV and a good choice in the world of hi def 1080 vs 720 - I say yes it is.  It's got an awesome picture that is every bit as clear as my 1080 set was.  The only time I notice any pixelation at all is when there is smaller text in commercials and even then with my 20/15 vision I have to be making an avid effort to just stare at the outer edges of letters to notice it (who does this under normal circumstances?).  I could not be happier with this Samsung.", "Date": "February 18, 2012"}, {"Title": "Happy Birthday to You!", "Author": "puddyfoot", "ReviewID": "R318D6EQNEVRPX", "Overall": "5.0", "Content": "This gift was purchased as a birthday present. The price of the Plasma TV was reasonably priced. I was concerned that the TV could possibly be damaged during shipping.But not to worry. The TV was delivered, and arrived in great shape.This television made a wonderful gift, and made my friend very happy.", "Date": "February 17, 2012"}, {"Title": "Thrilled", "Author": "J. Richards \"jeff_from_wr\"", "ReviewID": "R1FHT91OORGQ0Z", "Overall": "5.0", "Content": "I purchased this unit as a replacement for a 9 year old 12\" toshiba TV DVD player.  Obviously this is a huge step up.The packaging was solid and secure, but easily removed.  Set up took just a few minutes.  We love the screen size and overall picture quality.  The built in digital receiver is very welcome.  We have a WII and Blu-Ray player attached and still have more options for input.  We have had the Samsung for about two weeks and thus far it has been the perfect fit for us.", "Date": "February 16, 2012"}, {"Title": "Great set, positive reviews were mostly  accurate", "Author": "Paul M Mailloux", "ReviewID": "R3AF5XKQT6IANS", "Overall": "4.0", "Content": "I almost  bought this set from Amazon, but after it was mislabeled \"Prime\" I found out it was going to  add 100.00  for shipping, heck with that. So I searched around, found it at sears for 399.00  and 5% off (almost  equal  to sales tax, and drive it home)The set was easy to  set up, and after very little fiddling got my hdmi cord from the digital  box to  the tv, and wow! at first  it seemed dark, but that was before I set the brightness to  dynamic and hooked up  using hdmi  instead of the cable. Now it's plenty  bright and I'll  never watch anything that  isn't HD ever again.I highly  recommend this set and will post in a month  or so to  let you  know how its going.", "Date": "February 15, 2012"}, {"Title": "Samsung PN43D450: wonderful", "Author": "Joseph", "ReviewID": "R2KJ86OZAQHNJI", "Overall": "5.0", "Content": "This unit is wonderful. My 43 inch set supports 1080p even though it stated on the box that it only support 720p. Love it. Wonderful sound and quality. Don't hesitate, you wouldn't regret your purchase.", "Date": "February 12, 2012"}, {"Title": "Oh yeah baby", "Author": "Michael Doggett", "ReviewID": "R2CPG616U0LUH1", "Overall": "5.0", "Content": "I saw it was 43 and have never heard of a 43 inch TV. Who cares when it looks this good. Great looking TV for the price. Terrible shipping but it was resolved by Amazon in a nice way. If you are looking for a 720p TV that looks good and is thin, this here is your TV. No regrets for how inexpensive it was at 499. Makes babies scream at how real it looks.", "Date": "January 31, 2012"}, {"Title": "Christmas Gift", "Author": "dhawk", "ReviewID": "R3MQZB96WRTE2V", "Overall": "5.0", "Content": "The TV arrived on the scheduled delivery date. It was a Christmas gift for my son who lives out of town. He was very impressed with the delivery set up and he has repeatedly expressed to me how much he loves everything about his new tv from picture to sound! Thank you so much!", "Date": "January 14, 2012"}, {"Title": "awsome", "Author": "Sara Etchells \"sara sherwood\"", "ReviewID": "R1IHWBXF1343ZD", "Overall": "4.0", "Content": "i love my new tv and i think its perfect and im amazed at how inexpensive it was for the tv and home delivery. i would recommend it to everyone", "Date": "January 12, 2012"}, {"Title": "get more pay less. great TV.", "Author": "Joeb", "ReviewID": "R12RVO4NC91W5R", "Overall": "5.0", "Content": "I paid this TV for $499.00 excluding tax.  Pics quality is perfect with a little custom adjustment. I would say this TV beats other LCDs out there on the market. The only drawback is, it should have more inputs(hdmi, RCA,). The sound of this unit is more than i need for now. This tv unit will work fine with me because I only require my ps3 in which i used it for movies and games. And for the future, planning to purchase a sound bar. I didn't purchase a warranty, so hope this tv will last me at least 5yrs or more so my $$ is all worth it for the $$ i paid. I would recommended this unit to someone.", "Date": "November 6, 2011"}, {"Title": "great television", "Author": "Barney", "ReviewID": "R3NSTIQ1EXP0XB", "Overall": "5.0", "Content": "do your homework and if thistv fits your needs you won't be disapointed with it. it has a geat picture and I have not had a single issue with it.", "Date": "November 2, 2011"}, {"Title": "Great Product for Excellent Price!", "Author": "Pablo", "ReviewID": "R2U55Q0MAZ5X4S", "Overall": "5.0", "Content": "Great Quality, speakers not so bad. Overall very happy with what I paid for the product I got. People think I spent at least 1k on this.", "Date": "September 19, 2011"}, {"Title": "Great TV for the price", "Author": "Carlos Vasquez", "ReviewID": "R1W2DRXJ19GZMP", "Overall": "5.0", "Content": "TV arrived before expected!  It perfect condition.  Plug and Play.  TV colors and sharpness are the best you could get for $649.00.  Best purchase of the year so far!", "Date": "September 3, 2011"}, {"Title": "dead or stuck pixels?", "Author": "sandman44", "ReviewID": "R1H8RE2485QYKK", "Overall": "5.0", "Content": "This TV has a great picture when using an HD source or playing video games. Sound is good. Lightweight and great for hanging on the wall. The only thing I have bad to say about this plasma TV is that it can get hot after awhile but that's normal for a plasma. The reviewer that gave it 1 star for dead or stuck pixels doesn't know what there talking about. Dead or stuck pixels only occur on LCD TV's. This is a plasma television. So far I'm happy with my purchase and would recommend it.", "Date": "September 3, 2011"}, {"Title": "Simply Amazing what $649 can buy", "Author": "M&A; \"Mike from Long Island\"", "ReviewID": "R268HJHDIH6NHK", "Overall": "5.0", "Content": "This is my second HDTV. I was so impressed with my Samsung PN42c450 that I bought last year (in my bedroom), I was trying to get it's big sister, the Samsung PN50c450 (for my living room) for several months before I gave up due to lack of availability. I then went into current mode and decided to go with the big brother and this years model, the Samsung PN51d450 instead. Sometimes, a year difference in similar TV can be a bad thing. I took the chance and I bought this based on my current research & personal needs. I am not sorry I did!!!!!!!!!!!!!!!!!!Setting up out of the box was so simple it took me less than 10 minutes this time to get a picture on it. First of all, the way it was boxed was great. All you have to do is undo a couple of plastic releases towards the bottom of the box and the bottom of the box opens and the TV slides out safely. The TV slides onto the stand and the 8 screws went in a bit too easy. A Philips head screwdriver was used to secure the TV to the base with no problem whatsoever. The TV is so light and it lifted easily onto my electric fireplace media center in the corner of my bright livingroom.I hooked up my standard def cable box & old VCR to it through the coaxle input. I added my regular DVD player through the A/V jacks on the VCR (yeah, I know you are not supposed to hook it up that way but it plays fine that way). The TV only has 2 HDMIs (not used by me at this point)--last years model had 3 so this concerned me a bit for future needs, 2 component jacks, one of which shares the composite A/V jacks, PC input & a USB (on the side). As I said this whole process took under 10 minutes from opening the box to watching TV. The standard def picture through the cable box (Verizon FIOS) is so amazing I may never upgrade to a high def cable box. The audio is sensational and goes from 1 to 100. I'm keeping it between 10 & 25 based on outside noise & show source, etc and it feels like we are in a movie theater. Our heads are about 11-12 feet away from the TV. There is no hissing noise we noticed as others did. We are blown away by the quality of the video & sound and there was no need for us to tinker with the settings although there are tons of them should you desire. The remote is easy to use but for the most part we use the cable remote for most features and only use the TV remote for the sleep timer and the source changing.Some very, very, very minor drawbacks. First, only 2 HDMIs. Who knows what the future holds? Second, it only has one composite jack (A/V) that shares one of the 2 component jacks. It should really have one more on the side for convenience sake. Third, beware of very bright rooms & windows as this reflects off the screen and is a little bit distracting. We have a very bright livingroom with the main windows opposite the TV but we really don't notice any glare--guess we got used to it. Fourth, the base does not swival so getting to the back of the TV is not easy once you have it in place. But I can live with these minor inconveniences.This Samsung 51 inch plasma HDTV is worth triple the great $649 price we paid for it. Our friends have bigger TVs and they don't believe we don't have a high def box. Don't believe the 720 dpi knock as you can't notice any difference unless you stand 2 feet away from the TV and who would do that? Go out and get one of these today--you won't be disappointed. You can't beat the quality & price on this thing. Even if it dies in a couple of years, it is still worth it.Pros:Built-in speakers, Bright display, Inexpensive, Realistic color, Lightweight, Easy setup, Great boxingCons:Beware of very bright rooms, No swival base, Needs 1 more a/v jack, May need more HDMIs", "Date": "August 22, 2011"}, {"Title": "Great TV at a great price", "Author": "Geoff M jones", "ReviewID": "R3J543QHCOKVBM", "Overall": "5.0", "Content": "This TV doesn't compare with a high end LCD or 3d TV, but for the price it looks amazing.  I couldn't be happier.  Shipping was really fast and the delivery guy set everything up for me.  If your looking at buying the largest tv at the cheapest price, this is it.", "Date": "August 21, 2011"}, {"Title": "Nice Plasma Good Price", "Author": "I-Do-Review", "ReviewID": "RPTRL7Z0XETCD", "Overall": "4.0", "Content": "Great picture quality.  Light weight compared to many other plasmas this size.  My cable company only offers 720p and I don't use Blu-ray so this TV was a no-brainer for the price.  I wish the tv supported video playback via the usb, but out of the box it does not (perhaps it can be upgraded - tbd).", "Date": "August 15, 2011"}, {"Title": "Great TV for the price.", "Author": "B. Moore", "ReviewID": "R1206ZKTTKDRVY", "Overall": "5.0", "Content": "Ordered this TV for the bedroom and couldn't be happier.  While the picture is not quite as sharp as the Sony XBR in the living room, it's also only a fraction of the price.  If I was hooking it up to a more modern receiver I'd be disappointed there were not more HDMI ports, but it's fine for my setup.  Also, the delivery was faster than expected with no issues.", "Date": "August 8, 2011"}, {"Title": "Great TV!  Great Price!", "Author": "G. Atha", "ReviewID": "R2A1GSX1SSSLZ3", "Overall": "4.0", "Content": "We love the tv and got it for a great price.  Still haven't figures out all the adjustments so it can look as good as it can but we are still thrilled with it!", "Date": "August 2, 2011"}, {"Title": "Great TV", "Author": "Wotlos", "ReviewID": "R1CAILRIFUSM85", "Overall": "5.0", "Content": "This is a great tv for the price. Replaced a 3 year old Sanyo 1080p LCD with this Plasma 720p and the picture is just as good. Buy a replacement policy thou cause any tv these days, plasma or lcd, is probably going to break down right after the manufacturers warranty is up.", "Date": "July 5, 2011"}, {"Title": "nice tv", "Author": "Adrian M. Ringenbach \"rngnbch\"", "ReviewID": "R1M3DTXWK2PNXE", "Overall": "5.0", "Content": "i recieved my sampsung 51 tv in good condition it was packed really well. it was easy to connect and plays really good the picture is great and i got it at a relly good price.also the shipping was really fast.  adrian r", "Date": "June 21, 2011"}, {"Title": "Samsung 51 inch plasma tv", "Author": "Keith Flury \"Keith Flury\"", "ReviewID": "R2Z0R5X9Z8XRN5", "Overall": "4.0", "Content": "I am not a techi but I found this set  at Amazon and it was the best price around. It has a great picture and the sound is not bad at all. I like it very much. If you dont need all the bells and whistles then this is a good choice.", "Date": "June 18, 2011"}, {"Title": "Samsung 51 inch plasma", "Author": "nathanb75", "ReviewID": "R2H8CWCY0TOB3M", "Overall": "5.0", "Content": "The TV was delivered to my home . The delevery men placed the TV in my home where I wanted it. They removed the and  top portion of the box and inspeced it for damage, there was none. The 51 inch samsung was easy to set up and place on the table for use because of its light weight compared to other large screen TVs. The picture is excellent and the sound is great. I would recomend the TV to anyone.", "Date": "June 10, 2011"}, {"Title": "No PC/VGA Input or PC Audio", "Author": "ARinaca", "ReviewID": "R23D0BOYEXC7YZ", "Overall": "3.0", "Content": "Great TV, however you should know it does NOT have PC/VGA input and PC Audio input as indicated in this product description. There is a 3.5mm DVI Audio input but no PC inputs at all.", "Date": "June 15, 2011"}, {"Title": "Good Budget Flatscreen", "Author": "Charles Chen \"Keyboard Jockey\"", "ReviewID": "R30MWSJ0I2F0JL", "Overall": "4.0", "Content": "After reviewing many options online and in local stores, I purchased this as a secondary television for my basement as it hit the sweet spot in terms of size, price, and features.  Delivery was through Ceva here in NJ and the very friendly delivery man helped me bring the set into my basement, unpack it, and helped me set it up to ensure that the set wasn't defective (wish I had some cash on me to give him a tip!).The set itself is aesthetically attractive -- very thin and generally light.  The setup and installation were easy to do (mounted to the base) and the general operation of the set is simple and straightforward from the inputs to the menus to the remote.As far as 720p vs 1080p, I am primarily using it with our FiOS HD cable box and I would say that for the HD channels, from the distance that I am sitting at -- about 7 feet away, it is very, very difficult to tell the difference between my 1080p LCD -- I would say nearly impossible if I didn't already know that it was 720p (the scaler will automatically resample the 1080p signal).  I also popped in a DVD I had nearby (Vicky Cristina Barcelona) to see how it looked and it looked pretty solid, even though it wasn't an HD source.  From anything more than roughly 7 feet, it looks identical to the LCD (but with better colors and black levels).  Yes, if you get up and close, you'll see that difference much more markedly, but then you should consider buying a smaller set (37\" or so) to match your expected viewing distance.Additional thoughts broken down into PROS (+), CONS (-), NEUTRAL (=):---------(+) Great price(+) Beautiful set(+) Construction seems _generally_ well built and solid(+) Black levels and colors are excellent(+) Remote and menus are easy to use and navigate(+) Makes a chime when it turns on and off -- a handy feature as it let's me know when I've turned off the cable box but missed the power on the TV before walking out of the room---------(-) Glossy screen is a distraction and takes some getting used to as our primary set is a matte LCD.  Even in the basement and with recessed lights (NOT over the set), there is a strong reflection.  You have to force yourself to not look at the reflection until you adjust to it.(-) Some faint \"ghosting\" (or light blurring) during action/panning shots that I've noticed.  I wonder if this goes away over time with use?  If you are planning on using this for gaming, maybe you'd want to reconsider.  I guess you can't compare the \"120Hz\" LCDs with this \"600Hz\" plasma.(-) Somewhat wobbly on the base -- the base is simply secured with 4 small screws to the panel and it does wobble a bit if you press on the panel while plugging/unplugging cables, for example.---------(=) No wireless device connectivity, no USB inputs, but I generally would not expect these at this price point eitherOverall, a good purchase and I'd highly recommend this set for most general viewing purposes.  If you're sensitive to reflections, then I would highly recommend skipping this set for one with a matte screen.UPDATE: After checking again, it does indeed have a USB port on the left side. Now I need to go RTFM and figure out what it's for :D", "Date": "August 24, 2011"}, {"Title": "Samsung PN51D450", "Author": "Don", "ReviewID": "R17BCKG3LNCLD5", "Overall": "4.0", "Content": "I very good TV. Picture is bright and crisp. 5 stars except for the sound quality that could be improved. I later installed a surround sound system that solved the problem.", "Date": "June 17, 2013"}, {"Title": "One Year Service", "Author": "Natalie Baird-humphrey", "ReviewID": "R2F6TXCGW74GY9", "Overall": "3.0", "Content": "In a total state of shock right now.  It is now one year and 10 days since I purchased this television and less than a year since I have it (I had delayed shipping due to the fact that my mom was out of the country at the time).  I was just looking at a show on my lovely television and poof!  darkness.  all I hear were a few clicks. the power light is on but no picture, no sound nothing.  Don't have a clue what is wrong and also a bad time to not know where the manual is.", "Date": "June 8, 2012"}, {"Title": "Great picture", "Author": "Anthony", "ReviewID": "RXKB3XQIP5XV7", "Overall": "5.0", "Content": "I've had this about 2 months and Wow! I was a little leary about going plasma, just from what I had heard about \"burn in\". Although i was told they dont do that anymore I still followed the istructions on how to avoid burn in. This TV is very thin and very light. It has an amazing picture and the sound is good without a sound bar. For the price I could not be happier. I would buy this TV again without question.", "Date": "April 13, 2012"}, {"Title": "I am a happy camper", "Author": "Margie Read \"magnoliamansions\"", "ReviewID": "R1FCPB1DWV29BC", "Overall": "5.0", "Content": "Many of the reviewers go into great detail about technical matters. That is well and good for those who put much stock in such things. My reason for buying this particular set was the good price, the free shipping, and the fact that the Alabama-LSU championship game was coming on and I wished to see it on a big screen. I was literally ducking to keep from being tackled the result was so satisfactory. (Also being a Bama fan helped--Roll Tide). I also enjoy other sports and basketball is just as exciting on this Samsung. One other reason for this purchase was my confidence in Samsung. Every item by them that I have ever owned has been completely satisfactory. They make excellent products. And now, back to my show.....", "Date": "January 18, 2012"}, {"Title": "Lousy picture", "Author": "Cheryl Hayes", "ReviewID": "RJUIBETPOMXWX", "Overall": "2.0", "Content": "I have to return this television. I have spent hours trying to get the picture good, and can't do it. Bleary is the word my daughter used. No sharp lines, colors aren't great, and trying to watch a football game on it is painful - no matter what adjustments I make.  Very, very surprised with the poor picture of this Samsung.", "Date": "January 16, 2012"}, {"Title": "Very nice for the price", "Author": "Steve in Fla.", "ReviewID": "R1Y5795VRA033D", "Overall": "5.0", "Content": "Very nice TV for the price.Great picture and easy tuning.The worse thing about purchasing this item was the delivery service hired by Amazon.Home Direct was very unprofessional,if I knew what I know now about them I would not have purchased this item from Amazon.", "Date": "July 25, 2011"}, {"Title": "Just don't buy it AFTER a Bravia", "Author": "Chris", "ReviewID": "R20F3RY9B1FPH6", "Overall": "4.0", "Content": "First off, I've got to say I bought this TV (for the living room) to replace a 40\" Sony Bravia that has now been relocated to the bedroom.  Comparing it to the famous 1080 pixels of my Sony, there's no real comparison-perhaps it's just the brightness factor since I haven't changed settings yet (100 cycle), but the Bravia is by far more crisp and clear.Otherwise, Samsung has made a great TV.  The 51\" for the price (around $700)  is a steal.  One problem I found besides the apparent picture quality (well, not quality-crisp factor I'd say) is the stand construction.  In 2011 I expect the TV stand to be an easy thing to utilize and connect (as in \"here's the stand all ready to just snap into the TV\"), not something that requires screwing in with little black screws.Overall, Samsung has the best bang for the buck.", "Date": "July 20, 2011"}, {"Title": "My First HD PN51D450", "Author": "C.Orona \"quesoclan\"", "ReviewID": "R3Q1EE2IBNXCIH", "Overall": "5.0", "Content": "So far so good.  I cant even begin to say how long it took me to purchase a TV because of all the comments I was reading on this or that.  I finally just broke down and got this for one of the family rooms.  I still planned on getting a bigger and higher quality TV for my main room, so I was ok with getting the lower end model first.  The first and most important thing I'll say is that it's definitely worth the money.  The HD looks great.  I dont think I really have any bad thing to say.I was of course worried about that break in period that everyone talks about.  So, I did go ahead and let the TV run with the contrast and rest of the settings around 50 (based on some comments I saw on AVS Forum) for the first couple of weeks.  I mean, I watched what I wanted, but I did leave it running on lets say that Starz channel when I wasnt watching the TV.  I didnt leave it on games too long, and I didnt watch many channels with the black bars on it.  If I did, I hit the zoom mode on the TV to avoid it.  Of course you lose a little picture quality when you do that, but at least I was being safe for the time being.  It has this pixel shift option that you can set to work every minute or two minutes, which helps you feel secure about it.So in all, Im very statisfied.  I was going to consider getting a Panasonic for my next TV to compare, but I noticed the edging on the Samsung looks way smoother and since I didnt have any problems here, I'll be getting another.  maybe the 6500 model though.", "Date": "May 24, 2011"}, {"Title": "Clear Sharp Picture", "Author": "sandy", "ReviewID": "R11IV2L3Y6GAYD", "Overall": "5.0", "Content": "I received the Samsung shortly after ordering it.The box was in good shape and the TV suffered no damage.We plugged it into the cable box and the picture was excellent.My only suggestion would be that they include more ports for audio and video devices.Otherwise an excellent TV for the money.", "Date": "May 14, 2011"}, {"Title": "For a budget 51\" Plasma, you will find nothing better", "Author": "Jefe", "ReviewID": "R1VAEXANYEN1WG", "Overall": "5.0", "Content": "Bought this from Best Buy 2 weeks ago. I sat in front of this TV and the Panasonic 50\" S30 for over an hour comparing features and picture quality. After matching the settings up and comparing both with a Best Buy rep, we both agreed the Samsung was much better. He talked up the Panasonic for 5 minutes before we changed the settings and then changed his mind.Did a small break in period but after reading the threads on the AVS forums, its no longer needed on the '11 Samsung Plasma models. Plugged in my HDMI cord and went through the settings. WOW!!! Never owned a Plasma before but I am blown away at the quality. For a $700 51\" Plasma this thing is amazing!Research: [...]Supposedly Best Buy can send a rep out to fine tune the picture settings as well", "Date": "May 13, 2011"}, {"Title": "I like this TV", "Author": "ojcvnerp kpjrfc \"OK\"", "ReviewID": "R1F5JPQR9BR4YY", "Overall": "4.0", "Content": "Well, the price was right, and the picture is quite acceptable, and it's pretty big.  The specs said it was PC input compatible, but they neglect to say only if your PC has HDMI out.  I think for the price I got a nice TV.  As for internet, it does not have the internet access built in (which is why I wanted PC input), but it does not matter, I got a samsung blueray with wireless and internet gadgets and the total price is way less than the TV with wireless built in.  You do have to make sure to upgrade your firmware for the combo to work properly, but it is all on screen menues and not too bad.  No problem with set up, not too heavy.  It gets the broadcast channels easily, there are just so many broadcast channels (I didn't know there were so many), all with nothing on them, just like cable TV, so why pay for cable?  Just use youtube and boadcast TV, and you are just as bored as if you spent over a 100 dollars a month for cable!!", "Date": "April 26, 2011"}, {"Title": "Samaung 51-in ultra slim full HD180P", "Author": "john charles \" chuck\" \"john c scharri...", "ReviewID": "R1OS2GYP6OE0J6", "Overall": "4.0", "Content": "This particular Samsung Tv. is comparable to my Samsung. Both Samsung's are great. We invested in a divice so we were able to watch Netflix on the Tv. Its just like being in the movies except I can watch what I want in my underwear or robe. I'm in the process of purchasing a surround sound. My wife said we didn't need it. It sounds great already.ha' just wait and see the system when I finish this last step to perfection. WOW!!!! That's all I can say. Except come on ESPN.", "Date": "July 27, 2012"}, {"Title": "Love love love it!!!", "Author": "Shary", "ReviewID": "R1Z8CX3EMHEG7Y", "Overall": "5.0", "Content": "In the age of LED-LCD tvs, I was skeptical about buying a 720p plasma but gave it a shot as Rooms To Go was offering this TV with their furniture package. I am so glad that I got it, I was worried about the \"reflection\" some reviews were complaining about but I have no issues with it. My living room is not dark by any means but as long as the TV is not pointed towards a window or lights it is all good.", "Date": "March 4, 2012"}, {"Title": "Great Tv", "Author": "gregggg", "ReviewID": "R3I40MWFIW9TVZ", "Overall": "5.0", "Content": "Great tv, got it for 500 from amazon. Setting it up was easy, the TV only weighs about 45 pounds or so, i set up the stand and mounted it on top of my dresser in my room. Plasma picture quality looks really great, especially for ps3 gaming, it is a really good setup for any room.", "Date": "May 31, 2011"}, {"Title": "It took long enough but I'm finally happy with it.", "Author": "J. Mcconnell \"huffmaster\"", "ReviewID": "R1PXZI4AQ7AXDO", "Overall": "4.0", "Content": "Let me start with the good part of the review, the TV is great and looks awesome.  Got a brand new blu ray player with it as well and the picture and sound are GREAT.Now the bad portion of the review.  I ordered the TV and as with all items you get from Amazon there is an estimate on when the item will be delivered.  As it got closer to the date I began tracking the item to see for sure when I'd receive it.  Long story short it made it to my city in time to be delivered \"on time\", but the delivery company (Home Direct) used a local agency that held the TV for 3 days without making any attempt to contact me about delivering the TV.  So I had to make contact with them and on this initial phone call they wouldn't schedule a delivery time with me, the person I was talking with insisted that someone who wasn't there would have to call me back later.  That call never came so I called back the next day.  I received no apology, nothing, it was not until I threatened calling Home Direct that they were accommodating.  After that I finally got my TV, about 3 days after they received it.Now, at this point I've taken the TV out of the box and set it up but now it's broken.  I would love to say it was damaged in shipping and lay the blame on the delivery agency but it was an internal issue.  Within 24 hours of getting the TV I called Samsung and had to schedule a tech to come out.  That soonest appointment was over a week after my call.  The tech came out, fixed the TV in no time, and now I can watch it.  It was under warranty so I didn't have to pay for the tech coming out but all of this was just a HUGE pain.Like I said earlier, I love the TV now but getting it was awful.", "Date": "July 18, 2011"}, {"Title": "PC Input ?", "Author": "Customer", "ReviewID": "R8002KZ4Y7GZC", "Overall": "3.0", "Content": "I am sure it is a great screen and the price was very affordable.  I ordered the screen because the specifications indicate there is a PC input for the screen.  But it doesn't tell you that it is not a VGA/RGB monitor cable connection.  I was able to return the screen for a full refund.", "Date": "May 11, 2011"}, {"Title": "26 pixels gone withing the year", "Author": "mark", "ReviewID": "RZSFA10IG2OJU", "Overall": "4.0", "Content": "I love this TV, however, I just noticed that about 25-30 pixels have gone though I ordered it 28 Jan 2011, so i should be within the warranty period. If these pixels hadn't have gone, this would have been a 5 star review. The picture is amazing. I'll repost after I talk to Amazon and see what the path forward is.", "Date": "January 1, 2013"}, {"Title": "Great TV", "Author": "KP", "ReviewID": "R2KOQM0VNY9M5P", "Overall": "4.0", "Content": "Love the product, the white glove service and installation was not what I expected and not what I received during my last purchase of a TV from Amazon. The guy dropped the TV off at the front walk in, and left. I carried the TV upstairs, had to configure and set up. Not a big deal, but the first white glove service was off the charts amazing, and so my expectations were a little off.", "Date": "May 1, 2012"}, {"Title": "Awesome TV!!!!", "Author": "Beverly Bender \"BBender\"", "ReviewID": "R1C3A72ZSC0MPB", "Overall": "5.0", "Content": "This is a fabulous TV for the money and better. We are pleased with every feature, looks, picture quality, etc. Thumbs up!!!!!", "Date": "November 8, 2011"}, {"Title": "TV", "Author": "David Wheeler", "ReviewID": "RTL6MSWT8P0D0", "Overall": "5.0", "Content": "The customer service that I received was amazing.  The man I talked to understood the problem completely, knew I wanted to bypass any sort of bull...ogna, and worked with me to get me my product.  In the future, when I get another TV, going out of my way and finding the TV I want and having it come from Modia is a possibility of 100%.", "Date": "June 20, 2011"}, {"Title": "Ok, not great", "Author": "Joseph Chandler", "ReviewID": "R1NIBM02375NPK", "Overall": "3.0", "Content": "Returned it for another panasonic. I thought I would try a samsung plasma rather than the panasonics I have had. Samsung has a good name for tv's so I thought I would be happy. Not the case at all the colors are a little off and you can't get the contrast ratio right, the blacks aren't that deep. Also like most tv's nowadays the screen is just too bright and after playin with it still couldn't get it right. But if you are like most consumers and don't care about a true realistic picture you will like it. I like my tv to look like real life not an overbright playgrond game, so I will be sticking with Panasonic and their THX certifed picture settings.", "Date": "November 14, 2011"}, {"Title": "Great picture but it has signal drop out with HD DVR", "Author": "Prof100 \"I hate bad quality\"", "ReviewID": "R2UYENLEZUCBBN", "Overall": "1.0", "Content": "Fantastic picture and clarity.  Great value but...This HD Plasma represents a great value, but when watching HD TV it will have the signal drop out (goes black, no sound, and then reconnects and shows image info on the upper left of the screen such as 1280x720 @ 60hz).  I use Wideopenwest cable as a cable supplier.  They use Scientific America (now Cisco) 8642 HDC DVR cable boxes.  I am now on my fourth box.  Box one worked with my now dead Sony projection TV.  HD was fine.  I bought the Samsung Plasma because of the value it offered.  HD cable box 1 one drop the signal 4 times a minute.  I called my cable company out and they replaced.  HD cable box 2 worked great for 5 mos until its hard drive crashed. HD Cable Box 3 was installed and all looked good but it started dropping the signal once per hour so I called my cable company and they replaced it with Box #4.  Tech leaves and now Box 4 drops out over 30 times in less than an hour.  I have tried both HDMI and component input.  IT ONLY DROPS OUT IN HD MODE.  It is worse when using HDMI.I called Samsung customer support and they say they know they have a problem but don't yet have firmware upgrade for this model.  I own four Samsung TVs.  Two are LCD, one DLP, and one Plasma (this turkey).If you use a Cisco or Scientific American HD DVR as supplied by your cable comppany for signal input be warned .  You might be relegated to watching  TV on low resolution480i not 720p.  You might as well cancel any HD cable service or put up with the signal dropping out once a minute or more frequently. In the last ten minutes of watching ESPN2 HD the signal dropped out 12 times.", "Date": "September 1, 2011"}, {"Title": "All's well that ends well, 5 stars for Amazon", "Author": "Pete", "ReviewID": "R22SMU9BISLVVX", "Overall": "5.0", "Content": "The set is a 720p 600HKz Plasma HD but I had read a 1080 would not give any noticable improvement. I have not watched the set as it was a gift to my daughter and her family but they are extremly pleased with it's performance. I was able to purchase this Samsung for about the same price as a 42\".  The set was stolen while in transit and Amazon had another set delivered after I used their program to inform them of a problem. Amazon took care of everything. No additional charges.", "Date": "January 12, 2012"}, {"Title": "OK TV......", "Author": "Toddler Teacher", "ReviewID": "R3S5VK0AH77TQN", "Overall": "3.0", "Content": "Bought mine a week ago, and it is going back to B*** B** this weekend. It is an okay TV, but I bought it b/c I thought my PC could be hooked up. What they dont tell you is it is a HDMI port that can use a DVI to HDMI cable if your computer has a  DVI port, but a lot of computers have VGA (dvi is digital based, while VGA is analog) soo it was going to be more expensive to get VGA hooked to this tv than spending an extra $200 to get the 55\" VIZIO that has a digital tuner (this one doesnt have), wifi capable, with apps, AND a VGA port. Yeah this one is going back. If you aren't looking for all those things, and really just want to save 200 then this is a good plasma. Just not what I want. Wish I had known this a week ago and would have saved the hassle of returning it, but live and learn =)***What I didn't like about this tv***Watching sesame street elmo and other characters were pixelized (being run through a hdmi cable, it shouldn't have been happening).This TV has a lot of glare, and even with adjusting the setting for the colors to be vivid, it  reflected everything in my den.Not the connections I want. The computer hook up is dvi to hdmi, and I planed on using a older desktop to hook up to the tv to let the kids do learning activities on it. (which was one of my big reasons for upgrading tvs).**The Better things about this TV**Even though its a 51\" it is longer then wider, the 55\" I have seems like it is about the same length on the bottom but taller on the sides.The sound was really good for a flat screen, I have read different people saying you need a sound bar. With this model (and the one I got to replace this one)you dont really need it.This TV is thinner then the LCD one I replaced it with.Over all it is a OK tv as I put in the title, just wasn't what I was looking for. This one was fine but if I am going to spend a lot of money on a big ticket item I am going to make sure it is exactly what I want, and this fell short.Oh and just FYI if you havent bought a plasma tv before, you arent supposed to lay them down (not even to go in your trunk to take it home) Best Buy wouldnt let me do it, but they did hold it till Papa could bring his truck that evening and bring it to our house. I hadnt read anything about that, so if you are planning on bringing it home yourself plan accordingly.Happy shopping!", "Date": "January 27, 2012"}, {"Title": "Beautiful TV - not tough enough for small children", "Author": "Sad, sad, sad...", "ReviewID": "R3IDE88MESN81V", "Overall": "3.0", "Content": "I got this TV as an early xmas gift.  We love-love-loved it.  It was Fantastic with a capital \"F\" - but it didn't make it to New Year's.  My 6-year old somehow accidentally (??) flung a rubber-soled slipper a few feet through the air.  You know the rest....giant spider crack, no picture, and now only the shell of our Samsung PN43D450 remains in our desolate, but refreshingly quiet living room.  Working through the 5 stages of grief now.  If/when I hit acceptance, I will be buying a Sony with Gorilla glass.  And maybe installing some sort of cage or moat or something around the entertainment center.", "Date": "January 7, 2012"}, {"Title": "Buzzing Noise - No DVI or computer connections", "Author": "Travis", "ReviewID": "R1PXRP3C0ZJA6U", "Overall": "1.0", "Content": "I expected more out of this tv.  I received it with a buzzing noise and a static picture.  I do not feel like dealing with the return process since I had already tossed the box.  Do some more research before buying this.", "Date": "January 17, 2012"}, {"Title": "Great picture quality, EXTREMELY delicate.", "Author": "Efarrings", "ReviewID": "R1TMIJ7H486459", "Overall": "3.0", "Content": "In all technical aspects, this TV is great. The sound is crisp, the color is sharp, the functionality is fantastic. However, it is incredibly easy to break... as I learned this afternoon. After only have this television for three, short weeks, my 2 year old son haphazardly threw his juice cup over his shoulder as he was running to get into some other kind of trouble. The cup hit the screen and cracked it. Over the course of six hours the crack grew, the plasma bled, and then the screen just went out completely. The cost to repair is more than the cost of the TV.As my husband and I were taking it apart to repackage it, he lightly touched the screen to lift it and it shattered again. When all was said and done, the TV screen now has five spidery cracks in it, all from relatively harmless touches.It is my personal opinion that plasma TVs are not meant for families with small, athletic children (or even with a dog that has a particularly active tail-wagging agenda). The slightest bump can yield unfavorable results and probably a few tears. I'm not saying this TV has any sort of manufactural defect, I'm just saying that when you buy plasma, you buy at your own risk.", "Date": "October 4, 2011"}, {"Title": "Quality warranty period zero zero ...", "Author": "jung", "ReviewID": "R1XAUA0TVDDEY7", "Overall": "1.0", "Content": "Was one year over a scary failure.The power does not come on suddenly.How the warranty period expires no sooner had a breakdown.One that did not make so want to contribute to the development of the company from the TV. Ever I believe only the phase of the Samsung brand was mostly prefer the Samsung stuff.Samsung, the quality is excellent and the service is ... Rejects is 15 months to write but this product failed.Minute service equivalent, or past the warranty period to three months or be a paid service.I purchase this product in the last year, about six hundred fire.Staff came out to estimate the tax as a separate $ 60.00. And estimates come check should be.I just had to buy a new product. Absolute non-Samsung products ... Cheap throwaway one year ...Now sold a lot of heat when writing on the screen flies. And it is also very tired eyes. Luck would have it, like me, you may receive a defective product, you be careful. One year after write failure, the service should be paid", "Date": "September 17, 2012"}, {"Title": "Don't buy for the great reviews!", "Author": "Glenn Coco", "ReviewID": "R1UFZS3IGGHRR4", "Overall": "1.0", "Content": "Pros: 1) ordered from Amazon so I get hassle free return, just waiting for them to come get it 2) Sound is good as on my older plasma, better than the sound on my Samsung LCDCons: 1) Horrible picture quality! All these reviews saying you have to tweak it or turn off energy saver does not change the actual clarity or quality of this tv.  2) Even though I do not have HD it should still give you a decent picture. I should have the option of watching it with or without HD. All of my other tvs have such greater picture quality. You can find a better picture on the old box style tvs.Bottom line I regret this purchase greatly. Wish I did not go by the great reviews. Are we all watching the same tv? Watching it just makes me nuts. Just a blurry picture, unless you are watching cartoons or commercials, everything else is so annoying. And the motion hurts my eyes, other reviews say the motion is great. I can't understand how we can be reviewing the same tv! Why they make such bad quality items nowadays is unbelievable. I didn't think buying a new tv would be such a task. I will have to keep shopping around", "Date": "January 24, 2012"}, {"Title": "Horrible Glare!!", "Author": "Mo Mo", "ReviewID": "R1YCU6QH1TFG2G", "Overall": "1.0", "Content": "I just bought this tv and I turned it on and WOW this tv is bad.  My tv room is pretty normal as it just has two windows and two lamps.  However, this tv generates a ton of glare on it from the lights and ANY sunlight.  The tv is not in a particularly sunny room either.  This TV also has a very dark picture to it.  Another issue is this TV is a mirror.  When u turn it on u can see yourself in the tv.Despite all this the biggest issue with this tv is the glare.  I have heard there are different \"modes\" you can put the tv on.  I have not tried them yet as I just used the standard pre-sets that come with the tv when you turn it on.  I am really disappointed with this tv.  I got it for a good price but it is totally not worth it and I will be returning it.  I dont know much about plasma tv's but this one can not be in a room with ANY light or the picture suffers terribly.I am really disappointed.", "Date": "December 31, 2011"}, {"Title": "Picture failed", "Author": "JJ", "ReviewID": "R3LCQGCC03IV9M", "Overall": "1.0", "Content": "I purchased this T.V. from ABC warehouse 10/1/11 and set it up in my basement, all in preparation for the BIG GAME (MSU vs UofM)Oct. 15th.  Crowd was here but we didn't make it till halftime when the left half of the screen got this black hazy covering over it.  You could still see the game but ended up bringing my 20 inch T.V. down from my bedroom to watch the game clearly.  Then when I tried to return it to ABC for a refund, they would only give me store credit. I will be researching TV's better and replace this TV but what if I had just changed my mind and wanted to return the T.V. NEVER BUY FROM ABC.  The return policy sucks, not like Best Buy or Costco.  Now I have a huge credit at ABC and not sure what T.V. to purchase.", "Date": "October 16, 2011"}, {"Title": "Has NO dedicated composite Video or S-Video inputs", "Author": "Skyhawk", "ReviewID": "R1I8OVBYB2NVGO", "Overall": "1.0", "Content": "In order to save about two dollars, these inputs were left off.This severely limits the equipment you can connect to this television.Defective pixels are considered acceptable:  From the owner's manual: \"there may be a few bright or dark pixels on the screen. These pixels will have no impact on the performance of the product.\"", "Date": "July 17, 2011"}, {"Title": "This TV is $H*T", "Author": "Frank Braeutigam", "ReviewID": "R20718XGTRKQTF", "Overall": "1.0", "Content": "I bought this TV at Walmart a few months ago. I have also returned it FIVE times since then! every Samsung 450 I have TRIED to own were all defective and all suffered from either dead or stuck pixels (If you don't know what that is, look it up, it's when a pixel on the screen either dies and creates a black spot on the screen or when a pixel gets stuck on one of the primary colors creating a green spot on a red background or a blue spot on a green background and so on). This defect existed on five of these TV's in a row. if you live in mid to higher elevation This TV is crap and should not even be sold. I finally gave up on the Samsung 51\" 450 and got my cash back to buy a 47\" VIZIO E series LCD and couldn't be happier. There is absolutely no way I could ever recommend this 51\" Samsung 450, No way at all.Samsung,Stick to your inferior cell phones, you make a crappier TV.", "Date": "September 1, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "It has 51-inch plasma display panel with 720p HD resolution (1366 x 768 pixels)\nFive separate HD inputs (two HDMI, two HD component, one PC)\nUSB port for enjoying videos, music, or pictures from your USB devices\n600Hz subfield motion and ultra-fast response time for clarity during fastest-moving scenes\nDynamic Contrast Ratio: 10 M DCR", "Name": "Samsung PN51D450 51-Inch 720p 600 Hz Plasma HDTV (Black) [2011 MODEL] (2011 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/51nAjsMb9AL._SY300_.jpg", "ProductID": "B004MKNQGY"}}