{"Reviews": [{"Title": "46 inch flat screen Westinghouse TV # LD-4655VX", "Author": "Sophie Shopper", "ReviewID": "R1UH8OJL4RHQO4", "Overall": "4.0", "Content": "I won't give this TV at 5 star rating simply because I've only had it for a short time. In a few months I may come back and review my original report.However I must say right now that we got it for a good, fair price. I was impressed by the Engery Star rating at approx. 17 dollars per YEAR (for elec.). I loved the 46 inch size and the fact that it was a 1080P (full HP). Plus it was not the standard 60Hz TV that you find at most of the stores with the exception of the 3D TV's. We had no interest in 3D television - but we did want the refresh rate to be faster and at 120Hz, this TV should be great.We did not want a \"Smart TV\" either - the kind where you can get Internet inside the TV so you can go to Netflix or Hulu, etc. Those are nice. However, what if that feature goes bad after awhile? Then what? We opted to buy a Sony Blu-Ray DVD player that has the Internet feature so we can use our Netflix on that. If you have a game player then you could also use that too. Therefor no need for the extra money spent on this \"Smart TV\" feature we don't want anyway.For the price we paid (under 600) we are very pleased. We didn't want to pay over a thousand dollars for a TV. And that was the bottom line. Our other TV is a Panasonic Plasma and it is very nice indeed. However, it cost nearly 2 grand, and we didn't need a 2nd TV like that. It just depends on what your needs are and the depth of your pocket book. Ya know?Back to this TV - It was packed well and was very easy for 2 small women to carry from the van to the house and set up. We just had to apply 4 screws to the base and it was sitting up. Then we plugged it into the wall and plugged in the cable and turned it on. It ran through an automatic set up process which took a few minutes as it scanned in search of the various channels. Then it was up and running. The book of instructions was simple to follow. The remote control was fairly standard and easy as well.The picture was great and we played around with the contrast and brightness a bit to see what we liked. And we set the aspect ratio to what we wanted the viewing area to be. Simple.I was concerned about the audio at first only because I had read about so many people complaining about the audio on this TV before we went to finally buy this one.However, the salesman in the store turned it up for us to listen to while we were there in the store and it sounded pretty good there. When we got it home it was perfectly fine too.Now.... our living room is not the size of a football stadium - that's for sure. We have a med. size room. I don't think we need a surround sound system or even a sound bar for this TV. I think it's just fine for what we need right now.As some people have pointed out on other various sites - these new super thin TV's have no where to put big speakers (esp.woofers). Okay? None of them have that. So if you need extra loud sound with heavy bass - then perhaps a sound system would be nice to have. But for us...we don't need that and I really don't see what anybody else is complaining about. It probably depends on the size of your room and any other noise factors you might have in your house (snoring spouses, screaming kids, barking dogs, etc.).I see that the one other person who bought this TV and then put up a review on here was very negative about this TV. I don't really think that was helpful because it doesn't explain the situation. Sometimes I think people just don't know how to hook these things up and they get frustrated.True - I haven't had to call the support people. Yet. I hope I don't have to. If I do and I don't get the help I need - I'll report that here later on. Fair is fair.Hopefully this review gives another side to the story on this nice TV now.", "Date": "September 26, 2011"}, {"Title": "Excellent HDTV For The Money", "Author": "GumbyTheCat \"Gumby\"", "ReviewID": "R3GGO0JN7CLCEN", "Overall": "5.0", "Content": "I picked up the Westinghouse LD-4655VX recently to replace my 32\" 720p LCD HDTV, which was too small for my living room. I got it at a \"big box\" electronics store for under five hundred bucks, which is an excellent deal.Like most TVs are these days, this was simple to set up. Attached the base to the set with the supplied screws, put the batteries in the remote and plugged in the HDMI cable from my Yamaha home theater receiver. The base of this TV also has a screw hole so you can screw the base directly into your TV stand. Considering I have a cat, this nice touch was appreciated.The TV itself is very thin, as LED models tend to be. According to the specs it is only 2.14 inches thick, which makes it a natural for wall-mounting. It weighs less than 50 pounds (22.7 kg), including the base. The screen's border is about 1.5 inches in width, which isn't bad, although not as stylish as more expensive TVs that have pencil-thin borders. The sole indicator light is a small power indicator LED that is installed in the bottom edge of the unit. You don't see it directly; rather it reflects off the base pedestal in a very unobtrusive way. That method is much less obnoxious than the big honking LED indicator lights on some models (such as the TV I replaced).Unlike most electronics these days, this TV comes with a detailed, comprehensive paperback-book-style manual that explains all operations of the TV and remote in a thorough fashion. This is important to me, because when I'm fiddling around with a piece of equipment for the first time I like an actual manual handy. I hate having to run to the computer in the next room and read instructions off a .PDF on a CD-ROM, or some website. The manual is divided into English, French and Spanish sections, with the English section being 67 pages long. Don't worry though, setting this unit up doesn't require a thorough study of the entire manual.When you power up the TV for the first time, it will prompt you through a few basics, asking for time zone, default display mode (it uses \"Showroom\" display mode out of the box), default language, things like that. All these can be changed at any time after initial setup if desired.The setup menus are simple and straightforward icon-style choices that appear at the top of the screen as a ribbon of icons. The main menu is comprised of Picture, Audio, View Mode and Settings icons. The Picture submenu is where you will spend the bulk of your time setting this up. It contains the usual brightness, contrast, sharpness, color saturation, color temperature and hue choices. The current levels of the various settings are shown as simple progress bars, which is one of the few quibbles I have with this unit. It would have been nice to have a numeric 0-100 percentage number provided with the various progress bars, so that various display settings can be quickly jotted down for reference if you want to experiment with different settings. That way, your original desired display settings can quickly and accurately returned to if your experimenting goes awry.There are four display presets in the View Mode submenu - Showroom, Movie, Game and Sports - as well as a Custom setting that saves a custom range of settings for each input (HDMI 1, HDMI 2, Video 1, TV, etc.). For my taste, I found the pre-programmed display presets to be awful, and went straight to setting up a custom display profile. For this, I used my Avatar (Three-Disc Extended Collector's Edition) Blu-ray. With its vivid colors and razor-sharp photography, Avatar is a great movie to use as a calibration tool for a TV (and your sound system for that matter). It took me about two hours, but I finally got a combination of display attributes that produced just the picture I was looking for.There are only two HDMI inputs for this unit, but since I run everything through my Yamaha RX-V367BL 500-Watt 5.1 Channel AV Receiver, I only needed one HDMI connection.So how are the picture and sound? Well, I haven't heard the built-in speakers and don't need to. In the review just about every HDTV advertised on Amazon you'll see reviewers who have issues with the speakers. So, sub-par speakers seem to be the standard. However, picture quality is what counts these days, and in this department the LD-4655VX excels. There were no dead pixels on the panel. The colors are crisp and vibrant, the 1080p focus is razor-sharp, and the characteristics of 1080p LED panels almost seems to give an illusion of a very slight 3-D effect. The 120 Hz refresh rate gives fast action a smoother look than typical 60 Hz refresh rates found on cheap TVs, although to be honest the difference is not as much as one might think after looking at advertising blurbs.  The contrast ratio is wonderful, and the 6.5 millisecond response time is more than adequate for everything I've thrown at it. In short, the picture on this TV is awesome, and you won't be disappointed.The last thing I'll mention is the remote. It's small, without a zillion seemingly unnecessary buttons, and is easily operated with one thumb while holding it in your hand.Bottom line - this may not be the best TV out there, but if you're looking for your first truly large LED HDTV, you really can't go wrong with this unit. I've seen lesser TVs that cost more than this one!", "Date": "November 13, 2011"}, {"Title": "Owned it for less than a year, broke twice.  Made in China, bad TV.", "Author": "James G. Dotson \"Dotson\"", "ReviewID": "R3VP6JGBDWFG1G", "Overall": "1.0", "Content": "My fiance purchased this TV while I was deployed in July 2011.  She had used it often and it worked well until I got home.  One morning, I turned the TV on and half the screen was dim.  I attempted to reset the settings and power off/on and it still remained dim.  Since we purchased the TV from BestBuy and we found out that BestBuy honor's the Westinghouse warranty for one year after the date of purchase, we had Geek Squad come out and take a look at it.  Sure enough, the screen was broken and had to be replaced.  This was free of charge for us because we bought the TV through BestBuy, but if we had to pay out of pocket for the repair, it would have cost over $700 for parts and labor.In June 2012, I was watching TV and the television suddenly turned off - for no apparent reason.  I assumed perhaps there was a power failure but then realized a light down the hallway was still on.  I investigated the outlets, power supply, and made sure everything was intact and I found no problems.  Attempts to turn the TV on were futile and I came to the realization that, once again, the TV was broken.  Since the warranty was coming close to ending, I immediately contacted Geek Squad and they came out to investigate, come to find out the screen had once again broken!  Geek Squad attempted to order the part, which again would have cost over $700, but the part no longer exists.  In fact, if you go in to BestBuy today you will not find a single Westinghouse brand TV; the entire product line has been dropped.Since we had less than a year with this TV and Westinghouse no longer makes the parts for it, BestBuy let us trade it in for the full purchase price and we bought a Samsung LED TV, which we love and haven't had any problems with.  I cannot stress enough the reasons why you should not buy this TV.  If you do, it is a total gamble and will likely leave you with a broken TV with no repair options and out $650.  Pay the extra money to buy the South Korean brands, you'll be much happier.Still no convinced?  Some interesting facts about Westinghouse is the fact that the company is going through a massive class-action lawsuits for failing their customers.  A quick internet search can take you to the massive complaint list with the company.  Westinghouse is also presently going through the process of \"General Assignment\" with the State of California, an alternative to bankruptcy.Buy at your own risk.  Remember, parts for this TV no longer exist.  If it breaks, you will not be able to fix it.", "Date": "July 25, 2012"}, {"Title": "Westinghouse LD-4655VX -- WARNING - Don't Even Think of Buying!", "Author": "Sonja Jones", "ReviewID": "R36F907MSP0J44", "Overall": "1.0", "Content": "My wife and I received a Westinghouse LD-4655VX TV for a Christmas present. Just after the warranty was up (by 2 weeks) some of the edge lit LEDs went out.  This was a $550.00 TV, and lasted 54 weeks.  I called customer service and was given a Case#, and was told that someone would call me back within 24 hours.  That was 5 days ago. I have called back 3 times, and I might as well been talking to my cat. From reading the above comments, it seems that even if it was under warranty, I would be in the same position.  Westinghouse...used to mean quality.  What a shame!  NEVER buy Westinghouse products...NEVER!", "Date": "February 25, 2013"}, {"Title": "Great TV for a Great Price", "Author": "Hentercenter \"TV Lover\"", "ReviewID": "R149ND4KOPUT8C", "Overall": "5.0", "Content": "This is a superb TV for the price. I got mine for under $600 from Best Buy and have not had a single regret. I've even had to call support (my own stupid fault, decided just try to go through the setup without actually reading what the screen said. If I had just read what the TV said, I could have gone through without help) to have them help me and they were fantastic and not condescending about my simple problem (thankfully since I felt like an idiot after we were through). The picture quality is up to par with my dad's 52\" 1080P Sony and he spent over twice the amount I did on mine. The sound is great, too. I don't have it in a huge room primarily, but when I move it into my larger room (with a very noticeable echo in it), the sound makes it through, and I have never had to go over halfway. It is just fantastic. I think my favorite part is how light this TV is that I can literally carry it myself from room to room and set it up in minutes. This is certainly due to the thinness of it (VERY THIN) and I love that about it. I could not have asked for a better first HDTV! I recommend this to anyone looking for a larger TV without the budget (or with the frugalness) to not spend $1000+ on a TV. It's worth the price I paid and then some.", "Date": "December 1, 2011"}, {"Title": "Broke after 10 months", "Author": "jmstacey", "ReviewID": "R2W71W35VQN3WV", "Overall": "1.0", "Content": "Originally bought at Sam's Club January of 2011. It worked well enough for 10 months, although it always took around 15 seconds between the time the power button was pressed and the time the logo would appear on the screen. There was no other indication that the television set had been turned on. No light or nothing.However, beginning of November the set just up and dies. Refuses to turns on. It took 3 months to get a replacement through Westinghouse. Their support is nonexistent. Very difficult to reach anyone, and when you do they don't know anything about your case [even with a case number] and you get to start all over again.After 3 months, we finally received the replacement [a LD-4695 version], with a broken bezel out of the box, and it refuses to stay turned on for more than a minute or two at a time. Time for another round of shenanigans with support.Based on the number of reviews on the internet, perhaps we should pull together for a class action lawsuit. At the very least I'm considering filing an breach of warranty suit because it's already been 3 months without a television that stopped functioning under warranty. 3 months for a broken replacement is way too long.", "Date": "January 7, 2013"}, {"Title": "IR issue", "Author": "Sammy", "ReviewID": "R195P2AAZY4J04", "Overall": "3.0", "Content": "My tv will randomly power off or go to the setup menu and will select things in the menu on it's own. It is very frustrating when trying to watch movies and play games. It also sucks that it doesn't have a composite hook up for my wii.", "Date": "February 23, 2013"}, {"Title": "Worst TV ever made from a company that doesn't care", "Author": "Bisjoe \"Joe\"", "ReviewID": "R19U2JYVK77LB", "Overall": "1.0", "Content": "I gave one star only because 0 is not an option. TV died after 8 months and was unrepairable after shipping to the factory. Westinghouse Digital (now rated F by the Better Business Bureau) response is non-existent. Eventually got a refund after 3 months of constant work to get them to pay attention. Hundreds of others have reported the same, in fact there is now a facebook page \"we hate westinghouse.\" This model seems to be the worst but from the comments it looks like all of their TVs are poorly made.", "Date": "January 4, 2013"}, {"Title": "lousy customer service", "Author": "babybear", "ReviewID": "R3GLY787N6YN3Z", "Overall": "1.0", "Content": "We've had our TV for 11 months and it suddenly quit too.I called customer service and was on hold for 1:20 hrs. ,then she sent me to parts for another 27 minutes before I finally gave up. I called the # in California and the operator at least got me a tech to speak to.I told him that after the tv shut down we checked the ac/dc power convertor ,it was very hot to the touch so I told him to send me a new power supply.He said that is probably what's not wrong with the tv and I told him I would rather start there then to have to  send it back to California! I also told them they should have changed the wording on there warranty as they no longer  have in home repair for tv's 46\" or larger.They told me it was because no one could do a good enough job at fixing them.Maybe, It's because there tv's are just junk!", "Date": "November 30, 2012"}, {"Title": "Terrible customer service and short life TV", "Author": "Steven C. Reefer", "ReviewID": "R1QK1RTS7S5Z9L", "Overall": "1.0", "Content": "We bought this TV in Nov. 2011 for around $650.  In Aug 2012, the TV just shut down. We contacted Westinghouse and they had us send it in for repair.  They sent an RMA but We were responsible for packaging.  After several phone calls and almost 7 weeks we finally received a Refurbished model.  I not sure who thought it was a good idea to package a TV with only 2 airbag style corners on top and 1 int the middle on the bottom.  but, They should be fired.  The TV works. But, the bezel is separated on the entire right hand side and bottom left corner.  This is happening because the plastic the the screws fasten into broke.We will never buy another Westinghouse product again after seeing how bad there products are built.  It's a shame that a company with the name brand and lineage like Westinghouse has to sell and build poor products like this.", "Date": "October 1, 2012"}, {"Title": "Warrenty is a nightmare", "Author": "MicahinTN", "ReviewID": "R1L4FVRFVUOYB9", "Overall": "1.0", "Content": "The price and size was great.  The video quality was well enough for most, but the reason for my low rating was when the tv failed within 4 months we had to deal with westinghouse themselves in order to do anything for a replacement..  Its going 2 months now, and the only thing they sent us was a badly, badly beaten up to that looked like it was dropped for a replacement..  We have sense sent that one back and are awaiting them to obtain an \"approval\" for sending us another..  We actually found out that they are looking for one to send..  Apparently they realized their product has too many cheap parts and the warranty service has been overwhelmed by returns...We may end up having to sue in order to get our money back being they do not offer a tv of this size anymore..  They actually tried to get us to settle for a 19inch tv after many calls in exchange for our broken 46 inch...  Westinghouse is a joke and will be permanently blacklisted from our family", "Date": "May 31, 2012"}, {"Title": "Didn't last very long", "Author": "Colorado Hermit \"ColoradoHermit\"", "ReviewID": "R1QOTUXNZW1EO7", "Overall": "1.0", "Content": "Ended up settling for this one after problems with 3 others from local store. Figured it would be alright since Westinghouse used to be a good quality brand. First thing the clock was a spazz. Set the date & time, turn it off and back on and not only would the time be wrong but the date would change. Every time I turned it on the date would be anywhere from a couple weeks off to several years ahead or behind. I figured Oh well, I have plenty of other clocks and it doesn't matter if it has one or not since the picture was good. And it did have a great picture! Just before I bought this one a friend had got a 42\" Vizio and tried talking me into getting one. But comparing his Vizio to this Westinghouse, this one had a far better picture. His Vizio was like watching TV through a screen door compared to this Westinghouse. I was pretty happy with it. It could have a couple more HDMI plugins on it and the speakers could be a little better. And for the price it should have WiFi built into it. But it wasn't too bad of a TV. Until a couple days ago.The drain for my kitchen sink got hopelessly clogged the other day and I was working on that while the TV was on. Then I noticed the sound quit. Turned around and looked at it and it was turned off. I thought. Now the thing wont turn on. I unplugged the power converter from the surge-protector power strip and plugged it in a different wall outlet. Still wouldn't turn on. Took the power converter out to my workshop and tested it with my electrical tester and it was putting out the voltage that the sticker on it says its supposed to put out. So there's nothing wrong with the power converter. I've emailed Westinghouse customer service, 3 days ago. I got a confirmation email from them that they received my email but haven't had any other contact from them. So tomorrow I'll start the game of Phone Tag with the automated phone system and see if I can talk to an actual person and find out if this thing has a reset button somewhere or a little fuse somewhere that can be replaced. Usually that's all is need when something like this just shuts off and wont turn on. Unfortunately I cant find the extended warranty I think I bought for it. By my receipt its 6 months past its Westinghouse warranty. Any which way I look at it I'm screwed out of $584 bucks I paid for it. 18 months of use just ain't worth that much. That comes out to just over $32 a month to have it. I ain't going to say what the cable company is screwing me for. But for $32 a month I may as well of had one of the rent to own things. Then it wouldn't cost me anything to replace it.So, if you already have one of these, good luck. Maybe you will have one that will last for years. I just wish I could have read some of these before I settled for this one because it sure didn't turn out to be worth what I paid for it. Specially since I had saved up my money for 2 years to buy the stupid thing. Being on SS disability what I paid for it is over half of months income for me.", "Date": "October 27, 2013"}, {"Title": "Should be put out of business!", "Author": "S. W. Busch", "ReviewID": "R2QSNSPIWC84O3", "Overall": "1.0", "Content": "Make a TV, make it cheap (although I wouldn't consider the price tag at $ 500 cheap!!!) , sell to easily fooled consumers and when the public outcry becomes big enough the company executives close shop and walk away grinning with billions in their bank accounts!This company has no pride nor has it integrity and does not back up their products!Do NOT buy a TV from Westinghouse unless you only need for a year (or less) !", "Date": "August 6, 2013"}, {"Title": "Garbage RUN!!!!!", "Author": "Rich", "ReviewID": "RRGNYHU6OACO4", "Overall": "1.0", "Content": "Tv turned itself off and wont turn back on. out of warranty by 2 weeks, support non existent and rude. DO NOT WASTE YOUR MONEY ON A WESTINGHOUSE PRODUCT!!!!!", "Date": "July 11, 2013"}, {"Title": "STAY AWAY from Westinghouse! SERIOUSLY.", "Author": "Karen Adrian \"TheMaidenAnnabelLee\"", "ReviewID": "R2ZJ0EO0NNKOWA", "Overall": "1.0", "Content": "I purchased this TV 13 months ago and it started to have issues with the picture at the 6 month mark. There were discolored patches and weird halo effects. it was resolved when the tv was turned off and then on again. I called for a service tech to repair the issue and nothing was done. The tech told me that tv's just weren't made to last long and he didn't really see an issue and fixed nothing. He didn't even open the tv up and look inside of it! Should have been my first warning.Well, exactly one month after the warranty expired, the entire set just wouldn't turn on. It completely died. I called an independent service tech and apparently it's the main board that it not feeding power properly. Great.I'm sorry, but if you spend hundreds of dollars on a television set it should last you more than a year. I purchased an off brand television years and years ago when flat panel tv's were first becoming popular from of all places, Crazy Gideons, and it lasted me nearly a decade! I wanted to think that an established name like Westinghouse would provide superior if not comparable quality. i am very disappointed and a quick google search will show I'm far from alone with these issues and feelings. I wish I had taken more time to read reviews of their televisions before purchasing them. NEVER AGAIN.This is seriously a brand I will NEVER even entertain the idea of owning again in my entire lifetime. And honestly, the issues are so pervasive I'm surprised a class action lawsuit isn't shaping up by now. Definitely buyer beware in this situation. It's a great looking set, and the price is fantastic, but like the old saying goes - if it's too good to be true, it probably is.Westinghouse, you just lost a very brand loyal consumer.", "Date": "May 6, 2013"}, {"Title": "worked well then:::", "Author": "nomo", "ReviewID": "R36QUQKTRKMJK1", "Overall": "1.0", "Content": "Worked well for 11 mo. then stopped! I'm 70 yrs. old, Only tv I ever owned that did not last for years.", "Date": "January 4, 2013"}, {"Title": "Customer Service is terrible", "Author": "J. Newton", "ReviewID": "R2OJYN715UF0I4", "Overall": "1.0", "Content": "Well, I turned off the TV Sunday night and it would not turn on Monday.  After reading other reviews of the problems they've had, I wish I had done so before.Contacted the help line and waited for over an hour with no one coming on the phone. Tried phone chat. Said I must send it to California for repair. Can't even imagine how much that would cost.  Then the chat guy, would not give me further info such as a phone #, address or if they would pay for the shipping.NEVER buy Westinghouse again. It used to be a very good product...no more. : (", "Date": "November 7, 2012"}, {"Title": "Westinghouse 46\" TV 4655VX: will not last", "Author": "B. Mingst", "ReviewID": "R21E0ZJXTM65DR", "Overall": "2.0", "Content": "The TV was great, while it lasted. Picture was excellent and sound was OK -- as expected for speakers on a flat panel TV. However, after 13 months the picture and sound simply turned itself off while in use. It is now dead and out of warranty. According to the other reviews that I have (belatedly) read, there are no longer parts to fix it with. What a shame that Westinghouse has come to this.", "Date": "March 16, 2013"}, {"Title": "You get what you pay for", "Author": "kevinhirsh", "ReviewID": "R3QH9RWIA8AWLE", "Overall": "2.0", "Content": "I purchased this TV from Walmart.com for $540. While the price is great considering the size, the picture quality was greatly lacking. The viewing angles were horrible and the TV suffered from terrible backlight bleed and lack of color uniformity. In other words, you can see white spots throughout the TV, especially when watching something with dark colors. I decided to return the TV and spent an additional $300 to purchase a Samsung. Worth every extra penny in my opinion...", "Date": "May 18, 2012"}, {"Title": "This is the one to have, if you have don't want to invest in new sound system", "Author": "James Jager \"CorsairJock\"", "ReviewID": "R17TE8ZJKKLKQD", "Overall": "5.0", "Content": "Our first Hi Def, large screen TV, so it's difficult to campare it's picture to others in it's class, but my wife and I are totally impressed with it. We DID compare many TVs in the stores, and noticed that the LED versions were brighter, and definately more vivid than the CFL versions. The size is just right for us. Now that we have it, we hate going to other people's houses to watch their smaller, less sharp TVs. We didn't want to 'spend an arm and a leg', yet wanted a good picture, in a unit that would likely last a very long time (hence: LED). While there are several others in the size that were comparable in price and quality (including Vizeos and LGs), the deciding factor was this was the only 'modern' TV in that still has dual RCA 'phono' outputs for connecting to a hi fidelity stereo system. All the others have some sort of digital sound output ONLY. The Westinghouse has the digial output also, but we wanted to be able to use our 18 yr old Sony stereo system (we even have a turn table connected to it), so we can have high quality sound when we are watching movies. Thus, we chose this TV. Only negative comment: only 2 HDMI inputs, so we are having to run our X-Box 360 thru the VGA input (which is no big deal). In my opion: 3 HDMI inputs should be standard.But let me just close by stating: the picture is AMAZING, and you will immediately become spoiled by it if you have never owned a Hi Def, large screen TV before.", "Date": "December 27, 2011"}, {"Title": "DON'T BUY", "Author": "Timothy J. Campbell", "ReviewID": "R1LLXZ4EG4C57N", "Overall": "1.0", "Content": "I bought this TV.  It worked ok for a few months then the board burned out.  Upon inspection, one can see that the TV is poorly made.  The PCB is made in China and is of poor quality.  I remember when Westinghouse stood for quality. Those days are long gone.", "Date": "December 14, 2013"}, {"Title": "Westinghouse Blues!", "Author": "Mauricio A. Rosales", "ReviewID": "R1DFBW1EKRQDEU", "Overall": "1.0", "Content": "Worst television I have ever spent good money on! I bought this LED model from BestBuy on sale for $600 about two years ago. Well, we have had three different Geeks attempt to make repairs - on three separate repair requests for the same issue!Problem: the screen will intermittently turn very dark with blue hue in the middle of viewing a movie and the only way to get around this is to power OFF then back ON. Very Frustrating - but relieved since I purchased the extended warranty plus BestBuy honors their No-Lemon policy.Buyer beware on TVs manufactured by Westinghouse! It is garbage!", "Date": "November 26, 2013"}, {"Title": "She's a Brick!!!", "Author": "DG", "ReviewID": "R18KZ5NYFOET42", "Overall": "2.0", "Content": "Like many of these posts, the TV was great as a first-time thin-profile HDTV after having a very large 10 year old tube TV for a long time.Turns out the sound was better and the old TV still works just fine after all these years.  The Westinghouse... not so much.  Time to play around with it now that it's a brick and I can't break it any further (won't turn on at all).This TV should be sold for less that $150 given the quality of sound and internal components.Stay away from Westinghouse!!", "Date": "October 25, 2013"}, {"Title": "This television is junk", "Author": "907 Chevy", "ReviewID": "RX0UJWCJLFT17", "Overall": "1.0", "Content": "I bought this TV at Best Buy, and about a year later half the screen began going dim intermittently and then one day it just refused to turn on. Apparently this is a very common issue with Westinghouse televisions...a ribbon cable that runs from the motherboard to one half of the LED edge lighting along the bottom of the TV screen becomes abraded and shorts out on a strip of aluminum the LED light strip is attached to causing the TV to not turn on. Awesome.I really wish I would've looked online to find reviews on this TV before buying it...lesson learned. I suppose I should count myself lucky though, considering many people don't even get a year out of these televisions before they stop working!You suck, Westinghouse. You suck.", "Date": "September 18, 2013"}, {"Title": "Short life", "Author": "Bgiblets", "ReviewID": "R7AV32TH79BG6", "Overall": "1.0", "Content": "Purchased this TV 13 months ago. It was a great TV while it lasted but it just shut off one day in the middle of a show. It wouldn't turn back on. After replacing the power supply it still doesn't work. Pretty unhappy that my $500 purchase is now an ugly wall decoration. The Insignia I purchased in 2009 however is still working nice. Will never purchase this brand again.", "Date": "September 15, 2013"}, {"Title": "Another Westinghouse ld-4655VX landfill contribution", "Author": "Mikey", "ReviewID": "R1R7HB30CK7YAV", "Overall": "1.0", "Content": "Had this big screen tv for two months.  Powered off and would not start up again.  The power supply was extremely hot and it is apparent that this either failed or the tv did something to make the power supply fail.  If you're looking for something that is a mediocre tv at best, and expect a functional operating life of little more than a D-cell battery, this is the tv for you.  Otherwise, spend a little more and get something that has a name brand that carries today's expected level of quality, not something that relies on a product brand name that was made in years of the great depression.", "Date": "July 25, 2013"}, {"Title": "DO NOT BUY!", "Author": "Ryan", "ReviewID": "R1ERCBPFRCOYSG", "Overall": "1.0", "Content": "I purchased this Westinghouse LED 46\" TV back in December 2011 for a great price of $550.  It was a nice price, but turned out to be a bad 1-1/2 year investment.  The picture was great, but the sound is subpar.  The TV stopped working in July 2013, and of course no warranty in effect.Back when I bought the TV, there were really no reviews on the set, and I always check reviews before I buy, so you have been warned.  There are numerous problems with this set, and Westinghouse TVs in general.  I personally will not ever purchase a Westinghouse TV again.  It seems they use cheap components that are improperly rated (voltage wise) and do not last.", "Date": "July 18, 2013"}, {"Title": "6 months and done", "Author": "Craig Lounsbury \"craig11152\"", "ReviewID": "R326L0Y56NA5SS", "Overall": "2.0", "Content": "I bought this TV December 23 as a Christmas gift to my wife and I. I knew the sound was mediocre going in and I was fine with that. I ran sound through my stereo speakers. I was very happy with the picture quality, though it was my first ever HD TV replacing a 15 year old analog. But it just stopped working completely July 10. I shipped to them July 11 despite the warranty page saying a 46\" TV was eligible for in-house  repair. Evidently that service is no longer available but they can't/won't update their website. They received the set on July 16 according to FedEX. As of today,  August 2, in a \"chat\" I initiated I was told my TV was not going to be fixed. They would send me a replacement but they were on back order 2-3 weeks. The only reason I give this a 2 star instead of a 1 star is the set worked to my satisfaction right up until it stopped all together. In hindsite I would have paid more for a better brand. The 46\" LED 1080/120 specs for under $600 was too good to be true I'm afraid. I am now hoping Westinghouse will send me a workable replacement. I will never pay for a repair for this TV, I have lost confidence.", "Date": "August 2, 2012"}, {"Title": "The worst customer service I have EVER experienced!", "Author": "ToddG77", "ReviewID": "R3UMN2DOJTHBUH", "Overall": "1.0", "Content": "My review will be similar to others, purchased this 46\" TV and it lasted 6 months before it just died. Picture quality was so so and sound was horrible on this set. Put in warranty claim with Westinghouse and they are flat out useless, I had to wait 30 days to see if they could get parts in, then I had to wait another 30 days to see if they could find a replacement (ironic the manufacture has NO TV's in stock!) They authorized me to send the TV back for a refund, and now they refuse to respond to calls, they claim there is nobody that can assist, and when I request to speak to a supervisor or somebody with authority they deny your request. I am still awaiting a response after shipping the TV back 3 weeks ago on a refund.....(and from other reviews I probably will be waiting a long time!!)I urge all retailers including Amazon to please stop selling an inferior product from a company that does not support their products or value their customers. This will be the LAST purchase of anything from Westinghouse, and I urge others to purchase with extreme caution.", "Date": "August 1, 2012"}, {"Title": "Simply Junk", "Author": "ken beck", "ReviewID": "R22KS3Q0THK6X8", "Overall": "1.0", "Content": "This TV has a manufacturers defect, the power from the board to the LED lights is encased cheaply and wrapped tightly around an metal bar, that will eventually short out.  Westinghouse does not carry the 20 dollar part to fix.  You cannot get the parts anywhere, Westinghouse will do nothing for you.If you have one of these pieces of junk, take it to a expert that can put a piece of electrical tape between the bar and the cable on each end so it does not short out because once it does its not worth a nickle.I would also recommend never buying not just a TV but any product made by a ONCE quality American company and now one that makes China's products look superior!Places that carry westinghouse need to stop, its junk and the service is worse than the product", "Date": "January 13, 2014"}, {"Title": "TV lasted 2 years, 9 days", "Author": "Jan Payne", "ReviewID": "R1SFIQ04GOU4CF", "Overall": "1.0", "Content": "The LED panel went out 9 days after the 2 year warranty expired.  Neither Costco, the seller, nor Westinghouse, the manufacturer were willing to help us in any fashion.  My last TV was a Sony which seriously lasted over 30 years, until I accidentally dropped it.  Lesson learned, don't ever buy a WESTINGHOUSE TV.", "Date": "January 9, 2014"}, {"Title": "A Quick Review", "Author": "Hinano", "ReviewID": "RV4OUGSW5LE7", "Overall": "3.0", "Content": "We didn't buy this expecting LG/Samsung quality, we got this on sale for under $400 and so far it's been worth the money. It's big enough for a medium sized room. The picture quality is nice. The sound isn't great, but it usable. We did notice there a light leak at the top of the screen. It's a common issue with this television. If you are looking for a budget friendly, nice looking, meh sounding television, then come on down!Sound isnt aa big deal to me, that can be replaced with some awesome speakers... yeah AIWA baby! lol.", "Date": "November 30, 2012"}, {"Title": "Their warranty is FRAUD", "Author": "vivek", "ReviewID": "R1YYHQI43LCYQ8", "Overall": "1.0", "Content": "I bought a TV on the thanks giving day of 2011. At that time, to configure and to start watching they had this process of customers calling a 1800 number and register the TV with the serial number. Now the TV is showing dark spots on the left bottom side. When I called them up they said it is still under warranty and stuff. I also gave them the Serial number, ID (which I had to give by the time i bought to configure the TV), proof of purchase as my credit card statement. Now they are saying it cannot be considered as i have to have the receipt which i lost. It is very disappointing that I put in this kind of money and getting bashed like this. PFA the pictures and decide whether you want to buy the TV.", "Date": "September 25, 2012"}, {"Title": "Good for the price", "Author": "willow \"Mary\"", "ReviewID": "R3TWLCCPN118AZ", "Overall": "5.0", "Content": "This is our first HD flat screen tv.  It seems to be very good, and has all the basic stuff that we need.  We think it`s great.  Hope it stays that way.", "Date": "December 7, 2011"}, {"Title": "Avoid like the plaque", "Author": "Karl", "ReviewID": "R3MK4HSVN3596X", "Overall": "1.0", "Content": "Buy this item if you like wasting money.Buy this item if you enjoying going to manufacturer websites thathas faulty engines.Buy this item if you enjoy going to the telephonic resources and finding that theytoo are faulty.", "Date": "May 21, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "16:9 LCD panel With 1920 x 1080 full-HD resolution\n46\" class screen size 46\" screen measured diagonally from corner to corner\nWide 176-degree vertical and 176-degree horizontal angles See a clear picture from anywhere in the room on this 120Hz model\nBuilt-in digital tuner Watch digital broadcasts, including HDTV programs where available\nHigh brightness of 300cd/m2 with 6.5-ms. response time Place your Westinghouse 46\" LED-LCD 1080p HDTV anywhere\n100,000:1 dynamic contrast ratio\nHDMI Inputs: 2 Enjoy a superior HD experience with the HDMI one-cable solution\nWall mountable VESA 200mm x 200mm", "Name": "Westinghouse LD-4655VX 46\" Edge-lit LED HDTV", "ImgURL": "http://218.201.42.40:8080/ecx.images-amazon.com/images/I/41xO9SQEr6L._SX300_.jpg", "ProductID": "B004SMX0ZS"}}