{"Reviews": [{"Title": "Great LED/LCD TV!", "Author": "K-Dogg", "ReviewID": "R2NAKVZXIB9L0F", "Overall": "5.0", "Content": "After set up you will need to calibrate the picture to make it look the best, but once complete the picture is beautiful! As far as sound quality from the internal speakers goes this tv is really good when compared to some other brands of LED/LCD tv's (LG TV's sound like an old AM radio), but not as good as the speakers in my old Sharp Aquos LC45d40u. As with all flat panel tv's you should invest in a good surround sound system or sound bar to get the movie theater experience. It's nice having Netflix on the TV as I can search for movies faster than I can on my TiVo Premiere. When watching HD you will also probably want to turn down the Film Mode to Standard to eliminate the \"Soap Opera\" effect which makes it look as though you are on the set watching them film live, but will also show some \"judder\" as people move around, especially on Advanced High. For DVD's Leaving Film Mode on Advanced Low will lessen the \"judder\" but will also make DVD look like Blu Ray!", "Date": "July 2, 2011"}, {"Title": "Great Product!!", "Author": "S P K", "ReviewID": "R1YYCUZ5J9NQ4X", "Overall": "5.0", "Content": "I purchased this item a little over a month ago and I could not be more pleased with the decision. Before making the purchase, I kept switching between Plasma and LCD but I settled on LCD because it was going to be in a room with several outside light sources. The step up was easy and the picture quality is excellent. I love the built-in Wi-Fi, which was a feature that I wanted in a new TV. There are plenty of input/output ports so that you can connect whatever equipment you may need (i.e. cable, surround sound, DVD, gaming console).", "Date": "July 17, 2011"}, {"Title": "LED TV worth the money", "Author": "Poke", "ReviewID": "RA7XU48SJC2KT", "Overall": "4.0", "Content": "I originally purchased this TV for myself and had it shipped to my grandmothers house so it could be stored while I was in the process of moving across country. Once the TV was delivered and set up it was put in the family room so it could be tested out and my grandmother fell in love with it. I have now given her the TV and purchased another one for myself. But, the TV is great and you can see the difference in the brightness with the new Yellow pixels that Sharp has integrated into their TV's. The picture is amazing even without HD you can see a big difference in picture quality. This TV would receive 5 stars if the sound quality was not so poor. Sharp made a very good TV but dropped the ball on the speakers. I would recommend adding some kind of sound system if you buy this TV.", "Date": "June 29, 2011"}, {"Title": "Top of the line picture quality for middle of the road price.", "Author": "GK", "ReviewID": "RWQG36APBDMFH", "Overall": "5.0", "Content": "This is TV is a phenomenal value compared to other really good quality LED-LCD displays. I have always felt that the Sharp Aquos and Samsung LCDs had the best picture quality (clarity, color, movement, etc). It used to be that they were price similarly, but Samsung prices have sky rocketed. While still great TVs I don't believe they are that much better (I really believe that they are equal) to justify paying a higher price when the Sharp is just as good (and possibly better) for less.The picture quality on this set is top notch. It has a clear picture with vibrant, crisp colors and it is not over saturated. The motion is sharp and smooth without a hint of so called jutter. As for the people who said that they have experienced jutter with this set they either didn't have it set up right or had a bad source/connection for the video. Sports and fast action wild life are a pleasure to watch on this TV.I highly recommend that any person looking to buy and LCD either get a Sharp or Samsung. And right now with the Sharps being significantly cheaper the only real decision that there should be is what size/model of Sharp you should get.", "Date": "August 29, 2011"}, {"Title": "BE AWARE", "Author": "Gilliane Brodeur", "ReviewID": "RFG1PEOZWAUGR", "Overall": "5.0", "Content": "I love the TV. I had a Sharp Aquos before but this new Quattron set has an amazingly clear picture!NOTE: When I ordered the set, I called in to Amazon to enquire about details on the WiFi. I have an NHL streaming subscription and much of the reason I bought the new set was to enjoy cable less viewing of the hockey games, streamed from my computer. The new set only goes to \"preset\" URLs and you cannot (at this time) enter any new ones. Bottom line: I am back to cables again,which I had to buy more of because there is no S-Video plug on the new set.(I am using new SVGA cables and the picture is great.) Its just that I have cables running from the office and across the Hall to the TV in the bed room,which I have to hook up for each game. The lady at Amazon was certainly not aware of the limited functionality of the built in \"browser\". PS: The Sharp techs say they will pass on my comments to Management. There should be a way to customize the presets,even for a fee.", "Date": "October 15, 2011"}, {"Title": "Great TV - Sound Could Be Better.", "Author": "nlc71", "ReviewID": "R1WRDKZZFULFHL", "Overall": "4.0", "Content": "Picture on this TV is exceptional.  Set-up was easy.  The manufacturer apparently assumes this TV will have a sound system added to it as the basic sound system on the TV is not very good.", "Date": "June 21, 2011"}, {"Title": "Sharp never disappoints me!", "Author": "Yuki Z.", "ReviewID": "R3K4P3GGZNI6KF", "Overall": "5.0", "Content": "had a Sharp 42inch LCD TV for the past 4 years till my toddler accidentally damaged it with his toy. after comparing in stores many times, I decided to stick with Sharp, since it's the leading brand for LCD panels even with LED back/edge lit. I got this TV delivered at my door 3 days ago, and WOW, the pic is superb! and It did not have a LCD/LED screen glare problem as bad as other brands like Samsung/Sony. I would give this TV a five star rating, however sharp does need to improve its apps, since there are not many really useful ones on there yet. Luckily, what I care about the most is the TV picture quality itself, and all I can say is, its crystal clear, specially when you play HD content, e.g. Blu-ray, or any other 1080p mkv videos~~ Wi-Fi built in is awesome, easy hook-up to Laptop as well, just love it!", "Date": "December 16, 2011"}, {"Title": "Decent LCD TV", "Author": "TOM PITERA", "ReviewID": "R35P6DZ3LI3K0N", "Overall": "4.0", "Content": "There was a line of dead pixels on the LC46LE830U shipped to me, but Amazon made it easy to get it exchanged. They shipped the replacement by next day air and had UPS pick up the \"defective\" unit at no charge, which was very cool. The last LCD TV I bought was a good 7 years ago so some things noticeably changed. The advertised refresh rate (in this case is 120Hz) is very misleading since the pixels do not switch at that rate. Beyond the actual pixel response time it's just the backlight that switches at a higher rate. If there is any benefit, 120Hz avoids the 3:2 pulldown that needs to happen when playing a 24 fps movie on a 30/60 fps. Also 30 fps broadcast evenly divides from 120 Hz so cross support for each format is seamless. It's definitely not worth spending the money for anything beyond 120Hz though. Switching the so-called \"Motion Enhancement\" feature on does not seem to make any noticeable difference, but this TV seems to give that soap opera look for anything you watch regardless. This is pretty annoying for movies and I never figured out whether it can be changed. The smart TV features could have been done better. The built-in Netflix, Vudu, and Blockbuster apps are okay (albeit a bit slow to load) but the browser is terrible. I never figured out how to actually enter text into the URL field. Youtube, Skype, and MMS support would be nice. Apparently the TV will take online updates but that so far has never happened in the 3 months I owned the TV. That just means that these things that would be nice to have can be had, but it's only a question of whether Sharp is willing to do anything about it. One nice feature is the black levels. I don't understand why this is never advertised but it's just about the single most important spec! Grrr... Needless to say, this TV does quite well with that. the picture quality is very good though the illumination seems a bit uneven.", "Date": "March 15, 2012"}, {"Title": "Great Sharp LED TV", "Author": "Laura", "ReviewID": "R3CR53MWJJ0PQC", "Overall": "5.0", "Content": "I researched HD TV's for months when I decided it was time to purchase an HDTV. Had a number of TV's in mind that had all the spec's I wanted in a TV.  I decided on the Sharp since my previous TV that is 15yrs old is a sharp and still works great.  I was very nervous since I could only go by what was advertised and didn't have the opportunity to see the picture. I've had my Sharp TV for almost a month and all I can say is...I love it!  I purchased a 40in. since I was nervous on spending this much. I like it so much that I sold my 40in. to a friend who was also impressed with the TV and I bought a 46\". Great TV. You won't be disappointed.", "Date": "October 26, 2011"}, {"Title": "Like it", "Author": "Richard C. Prima, Jr.", "ReviewID": "RN89S2ZX6BAI3", "Overall": "5.0", "Content": "We have been very happy with the Sharp TV which we use in our bedroom.  We particularly like it with the Sharp BD player & HDMI connections so we can take advantage of the Aquos Link and get by with only one remote for the two units.  We also like the TV sound feature in which the output can go to an external sound bar and the volume can then be controlled by the TV.", "Date": "August 4, 2011"}, {"Title": "Great TV", "Author": "Cane Cover", "ReviewID": "R3JLIHLIAOF4FF", "Overall": "5.0", "Content": "Picture is terrific. Sound is more than adequate in our large den. No detectable motion blur watching HD quality football. Wireless access to Netflix has worked well. Easy to set up. Plenty of settings for TVholics. Quite frankly, I've been surprised at the overall quality and my satisfaction level. Did purchase extended warranty to guarantee longevity.", "Date": "January 23, 2012"}, {"Title": "No captions when streaming tv", "Author": "Cynthia Waller", "ReviewID": "R32FH8ALX4FD98", "Overall": "4.0", "Content": "I really like this tv but just today found out that one cannot have captions when streaming television through the wireless access point.  We use closed captioning all the time.  Otherwise, it has been a good tv.  My husband has macular degeneration and likes the size of the closed captions on regular programming and dvd's; we do not have digital tv so cannot control all sizes and fonts but the basic is good.  Picture is also great.", "Date": "January 15, 2012"}, {"Title": "Very Pleased after several months", "Author": "Ellory Wells", "ReviewID": "R14TK30EQ2X9PU", "Overall": "5.0", "Content": "We purchased this TV from Best Buy and have loved it. Easy to setup wifi; plug in the power and you're good to start watching streaming. Easily wall-mounted. Great picture. If my wife would let me, I'd buy the 70\" for upstairs!", "Date": "January 9, 2012"}, {"Title": "Sharp Quattron", "Author": "Diane J Vogt", "ReviewID": "R2GXTUF39SARC8", "Overall": "4.0", "Content": "Easy to set up. Clarity is a little less than my old Sony.  Easy to connect camera to play photos", "Date": "January 4, 2012"}, {"Title": "Sharp TV", "Author": "Jeannie", "ReviewID": "R3VSWAD0GJ12CC", "Overall": "5.0", "Content": "We absolutely love our new Sharp Aquos HD LED TV.  The picture is clear and sharp and the size is perfect along with the stream line shape.", "Date": "November 17, 2011"}, {"Title": "Sharp Quattron 46 Inch flat screen", "Author": "Louis Sauer Jr.", "ReviewID": "RP5PCDQ28613Q", "Overall": "5.0", "Content": "My Sharp Quattron 46 Inch flat screen has the best picture I have seen on a TV. When we watch the Ravens, it is like you are at the game.", "Date": "August 29, 2013"}, {"Title": "simply the best", "Author": "Jason g", "ReviewID": "R2FE8T6JBBHS83", "Overall": "5.0", "Content": "This TV is amazing. The extra pixel does wonders for contrast. Colors look better on this display. Better than any TV, period. The effect is similar to using an AMOLED display in a galaxy phone. Except it's 46 in. Best 2d picture I think I've ever seen.", "Date": "March 31, 2013"}, {"Title": "Great TV", "Author": "Weldon", "ReviewID": "R2S01VLL6YCZ8M", "Overall": "5.0", "Content": "Bought this TV for my mother. This TV was new and the price very low. It arrived quickly. I will do business with Amanda again", "Date": "December 11, 2012"}, {"Title": "Picture 5 stars, sound 3 stars", "Author": "review", "ReviewID": "RS6QBWF7ZIH1N", "Overall": "4.0", "Content": "The picture looks great, but the sound quality is sub par if not poor. My old 36\" tube Sony Trininon sounds a lot better.", "Date": "May 30, 2012"}, {"Title": "Excellent TV", "Author": "J. Mullins", "ReviewID": "R2VXC8PTXIBMXB", "Overall": "5.0", "Content": "I had a hard time choosing between a Panasonic Plasma or an LCD, my room was too bright, but in the long run I'm glad I chose this particular brand of LCD. This TV has so many features that it will take me a day or so to fine tune them all, which is a good thing. I also purchased a Sanus wall mount kit which me and my brother installed in about 30 minutes time, the point being is that this TV has an option in the audio settings just in-case you decided to do such a thing.The colors are bright and vivid, I still think the addition of the yellow pixel is a gimmick but that's just me, and the audio projects and fills a large room. So far I've only messed with a few of the apps, Vudu and Netflix, but as time goes on I may play around with more if the firmware addition adds more. All in all I would highly recommend this TV.", "Date": "May 29, 2011"}, {"Title": "best picture I have seen", "Author": "T. Ritchie", "ReviewID": "R1UIUSJCQVV5PA", "Overall": "5.0", "Content": "I love this tv with the added fourth color you really do get to see colors you have never seen on a tv before. The picture is crisp and clear great sound for a really thin tv.", "Date": "August 20, 2011"}, {"Title": "A princess in dirty clothes. Not ready for the party yet.", "Author": "N.S.", "ReviewID": "RW35XKJO0MPS8", "Overall": "4.0", "Content": "We have owned this TV for less than a week. Replaced it with a smaller one, as it was too big for the intended use. Still, the qualities and defaults of this set can be seen in less than 30 minutes, and are repeatable on the smaller one (40\" 835 series).First, the good stuff:- Image quality is top notch. Nothing bad to say about it.- TV set just looks gorgeous. And it's soooo thin. It's amazing.- Features are ok. Netflix, web browser, Vudu and so on. Wireless and wired connections available. No complaints.- Comes with a sound limiter for those loud advertisements. Good stuff.Now, for all the stuff SHARP missed:- The sound quality with the original speakers is way beyond horrible. It's simple - it borders to the unusable more often than not. When the volume is cranked up, the sound manages to be both loud and still not understandable. A total joke. And a bad one.- The remote control. Well, where to start. It's counter intuitive. It is not lit. It accepts codes for other brands, if you need to control something else with it, but it won't pair with my Philips DVD player no matter what. Come on, it's a Philips, not a JaiWinGaiBun-ChataPang from the $0.99 store, is it ?!?- Even worse (remote control again) - this setup beats my personal record of the WEAKEST remote (receiver ?) EVER. You do have to POINT the remote to the exact, very EXACT spot where the IR receiver is, in order to control the TV. To be clear: That means that if you point your remote not at the base of the TV, but at one of the corners of the screen - it will not pick up the signal and you will not have any control over the tv. It's like trying to shoot a spot on the tv with a laser pen, without the laser dot.- TUNER: I don't know if it's tuner related, but switching between channels when using the Channel + / Channel - button takes several seconds. The TV will \"think\" for several seconds before displaying the channel. If you have 10 channels to sift through, you're looking at a good minute of your time.- BUGS: The TV went into power saving mode (TV on but no image) at least once in such a way that the only way to fix it was pulling the cord off the power outlet and plugging it back in. No turning on and off with the remote could fix it.- Start Up time: Remember your old, old lamp TV from back in the 70's ? The one that took 15 seconds to turn on, as it needed to warm up ? You don't ? Turn on this TV. You will.", "Date": "July 7, 2011"}, {"Title": "Nice TV", "Author": "M. Oakland", "ReviewID": "R1F7I8COMFG5VI", "Overall": "5.0", "Content": "We just got this TV,but so far we are very impressed with it. We were going to get a Samsung,but with all the reviews and people that i talked to that have a sharp said it was a good tv with a very clear picture. they were correct, it has a perfect clear picture. you will not go wrong getting this TV.", "Date": "May 12, 2011"}, {"Title": "Sharp 46 IN TV", "Author": "LSM", "ReviewID": "R3M87Q3GKZ4KME", "Overall": "5.0", "Content": "It has only been 10 days but TV is working fine.  The first TV came broken.  The replacement seems to be fine.", "Date": "August 20, 2011"}, {"Title": "Sharp; worth every penny", "Author": "Scotty", "ReviewID": "R1CHINT92K78R8", "Overall": "5.0", "Content": "You pay more for a Sharp HDTV but you get a trouble free product. You can't beat the quality that is built into this unit.", "Date": "June 1, 2011"}, {"Title": "Love my 46 inch sharp 830 tv.", "Author": "William J. Kent", "ReviewID": "R18YBDQH54U6OS", "Overall": "5.0", "Content": "First of all, the tv came sooner than expected.  The box it was in was in excellent shape.  The only thing I am disappointed in is that I can't hook up my infrared headphones to it.  Otherwise, we love the tv.  The picture is great.", "Date": "September 11, 2011"}, {"Title": "A Terrible LED Television", "Author": "Disappointed", "ReviewID": "RD52NORL8CQ5D", "Overall": "1.0", "Content": "After playing around with the 46\" Sharp Quattron for about a week, I decided to return the television because of a few major flaws in the design.Physical Appearance: This is an incredibly light and thin television, and size is a definite strong point for this television. It's a plain-looking television, but all of the ports are easily accessible.Picture: Picture is the most important aspect of a television, and this television fails on several levels. The general picture quality is acceptable at best. The colors do not look natural, and the overall picture is inferior to an old Sharp LCD television I have in my house. At this price I expected the tv to have a crisp, clear picture, but there is a general fuzziness that pervades the entire viewing experience. Ghosting/flashlighting are also significant problems for this tv. I know that a side-lit LED display is going to have some light bleed, but my television had two 6-8\" glowing circles on the left side of the television that made it almost unusable in all but the brightest of viewing situations, and the black levels on the rest of the screen were no better than a traditional LCD television. Even a slight shift in the deflector plates during shipping will cause the lighting to ruin the experience of using this television. Having a thing tv is not worth the trade off in lighting and picture quality.Sound: Sound is the best aspect of the television. By including small subs in the speakers, this television does a much better job of producing deep bass and quality sound than any other flat panel tv I've ever used. I would still recommend upgrading to external speakers, but Sharp is ahead of the competition in terms of sound quality.Apps: The Sharp apps are relatively limited compared to other major companies (Sony, Samsung, Vizio), but it has all of the necessary basics (Netflix, Pandora, etc.). You can do much better if you are looking for a television that will allow you to stream from a wide variety of sources.Support: Sharp's support is difficult to deal with, and they are unreliable unless you live in a large city with Sharp authorized repair centers.Amazon: Amazon's 30-day return policy has been a life saver because I imagine a lot of these units are going to have defective deflector plates or other lighting issues that render the television defective.Final Thoughts: I'd stay away from Sharp's Quattron line and LED televisions in general. Unless you have to have a super-thin television, the poor picture quality and inconsistent lighting is not worth it. For roughly the same price, you can pick up a 51\" Samsung Plasma television with 1080p resolution and 3D , and there are cheaper deals on old-style LCD televisions that will give you uniform blacks and crisper picture.", "Date": "July 21, 2011"}, {"Title": "Una excelente imagen!!", "Author": "M. Fagundez", "ReviewID": "R2FV117MW4QED2", "Overall": "5.0", "Content": "Este TV me parece excelente, la calidad de la imagen es fantástica y posee buen audio (Con unas cornetas 5.1 tendrías un cine en casa). Recomiendo este TV para los que les encante ver películas en alta definición y les fascine los videojuegos ya que posee una característica llamada Vyper drive, la cual elimina el \"LAG\" que se presenta en esta clase de TVs permitiendo jugar tus juegos favoritos sin ningún tipo de desface. Estoy muy contento con la compra de este TV y me parece una buena inversión si quieres tener entretenimiento en casa con la Máxima calidad ofrecida hasta ahora. Producto A++", "Date": "May 29, 2011"}, {"Title": "Not as good as I was hoping for", "Author": "Jeremiah6", "ReviewID": "R1VA6TSQUH9ZJV", "Overall": "3.0", "Content": "I bought this Sharp HDTV thinking I was getting brilliant picture and colours with good sound. It's a good TV but not at the price point. With fast motion including sports this TV is not for you. I don't have an HD box with HDMI, only composite HD, so maybe I would get better quality if I did. Right now I wish I spent the extra $300 and went with a 240hz tv.One of the biggest problems I had was the TV looked used or a display model. There were marks where the screws went in on the back and one screw would NOT go in at all. I had to go to my local hardware store to buy another screw and washer to make it work. My first HDTV experience wasn't all that it bragged up to be. I haven't watched a Blu-Ray or HD movie on the TV yet but I imagine that will be high quality. For those of you looking to watch HDTV though this tv does show \"noise\" even on HD channels in dot by dot format. I am use to using a Macbook Pro screen all day so coming home to my HDTV is a downgrade to say the least. FYI - LG currently makes MacBook Pro screens. I may be a stickler because I am use to ultra sharp images on my computer screen all the time but if you expect perfect like me than you won't be overjoyed with this TV.I think this is a good TV, but not a great one. I'm going to try to calibrate it at some point but I was expecting much better results by just adjusting the settings and playing around with it.", "Date": "July 7, 2011"}, {"Title": "Let down", "Author": "Greg", "ReviewID": "R22ORT7BU0GWSM", "Overall": "1.0", "Content": "The TV was delivered to my house last night and I was excited to set it up in time for the Patriots game today and after I took the TV out of the box and set it up it wouldn't turn on.", "Date": "October 16, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004NOXMHC"}}