{"Reviews": [{"Title": "My daughter LOVES it!", "Author": "Jen", "ReviewID": "R2IC0SFLEM2L9J", "Overall": "5.0", "Content": "Bought this for our 7 month old and she loves it. It is super cute! Comes with an HDMI cable so that right there saved me $25! It is perfect for a kid. It has inputs for DVD players or video game systems. It is a HD TV but it doesnt have the best picture in the world but it is perfect for kids. It is actually pretty sturdy and super easy to put the legs on and take them off. They snap right in place. I have it sitting on a changing table I dont use anymore and have bumped into it several times and it has not tipped or anything. Its a great TV and an awesome price! It came a day earlier than expected so fast delivery and perfect packaging. I was hesitant to order a tv online but it turned out great! Thanks", "Date": "March 12, 2013"}, {"Title": "Amazing", "Author": "Stacey", "ReviewID": "R21WQUHP2ZF5KC", "Overall": "4.0", "Content": "I love this Tv. I bought it as a christmas gift for my 6 year old son and it has been wonderful. His first reaction was oh its a bear and then petted its head. It was easy to put together and very light weight. The only issue I really had was the fact that the cables plug upward into its back instead of easily just being put in, guess this makes it easier for wall hanging. I however, have it standing on the legs and its hooked up just to gaming consoles.", "Date": "January 6, 2013"}, {"Title": "The Bear Went Over the Mountain....!", "Author": "Cactuswren", "ReviewID": "RNZKKITGXC09R", "Overall": "5.0", "Content": "Hanspree really had a wonderful idea when creating the animal TVs.  They are too cute.  I purchased a Polar Bear TV for my granddaughter and one for me.  Who said that seniors can't enjoy these?  Besides, they are light enough for older people to lift without getting back injuries.  I suggested to Hanspree that a brown bear TV be created, so maybe that will appear at some future date.  These TVs are easy to set up, have great pictures and color, and add warmth and fun to any room.  Most importantly, everyone will enjoy them.  Also, for people to like to collect the soft-drink collectibles that the Polar Bear represents, they will love this cutie. I purchased mine from another source, because they were sold out on Amazon.", "Date": "December 19, 2012"}, {"Title": "So cool", "Author": "R. Samantha \"Sam\"", "ReviewID": "R2EID3E7GK6HBH", "Overall": "5.0", "Content": "I love this T.v Great price,awesome color looks wonderful its perfect for my animal loving daughter i wanted to update my daughters room she has a small space so  put this tv in her room & it looks great so happy with my buy.", "Date": "March 5, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Product Name: Hannspree Hannspolarbear 19\" LCD TV | ST19PMUW\nProduct Number: ST19PMUW\nPower Consumption Operational: 60 Watt\nDiagonal Size: 19\"\nResolution: 1440 x 900", "Name": "19\" HANNspree Polar Bear LCD TV", "ImgURL": "http://ecx.images-amazon.com/images/I/51l15PfUHbL._SY300_.jpg", "ProductID": "B004D64X14"}}