{"Reviews": [{"Title": "Haier LE32N1620", "Author": "vickiesok", "ReviewID": "R1Z82RY2TVND53", "Overall": "4.0", "Content": "I paid $249.95 for this TV.  It is for a guest bedroom and therefore doesn't get used often.  The set up was easy.  Out of the box the picture settings were better than I expected but the audio quality was awful.  The sound seemed to be coming out of a tin can and almost unlistenable.  After turning the treble setting down to 35 and the bass up to 60, the sound improved immensly.  While the sound still isn't world class, it is a huge improvement.  The Netflix setup was simple.  I put in my username and password once, and it has remembered it every time I've used it since.  For an ultra thin LED TV that was less than $250, you can't really go wrong.", "Date": "July 14, 2012"}, {"Title": "Buyer Beware", "Author": "M. Shell \"FFury\"", "ReviewID": "R2BVM48NDMLMRN", "Overall": "1.0", "Content": "I  purchased this TV with the knowledge it had a 1 year warranty. I let it sit 60 days before setting it up in my office. The remote did not work at all. I called Haier customer support and talked to Shelly. Her boss Larry said the remote was not covered because it was not inside the TV. The warranty says one year parts and labor. It excludes rechargeable batteries and cosmetic blemishes. I guess the internal electronics of a remote are not considered parts. A replacement remote is $40.Buyer Beware!  Buyer Beware!  Buyer Beware!  Buyer Beware!  Buyer Beware!  Buyer Beware!BBB gives Haier an \"F\"", "Date": "January 18, 2013"}, {"Title": "LE32N1620  TV is a Disaster", "Author": "R. Karch", "ReviewID": "R2IRCS5B67VJV9", "Overall": "1.0", "Content": "This TV has so many bad features it is not worth the time fooling with it.!. It doesn't hook up to Netflix as promised. ( Did work for a month or so)2 The sound is  worst than terrible. Sounds like it coming from behind and down in a cave.3. The remote is almost impossible to work. Duplicates numbers no matter how light you touch.4. TV takes a good 30 seconds to come on after pushing button on remote.5. Customer service was responding originally and now does not respond. Netflix is impossible to get info from.It was our first flat screen and we are basically stuck with it because we were assured by HAIER that the Netflix issue would be resolved and this took over a month. It was fixed and we used it for several weeks and now it wants our codes and will not accept what we put in. ( We do not have to put these codes in when we use our computer.) Also the codes are excruciatingly hard to imput using the too sensitive remote. Haier L32B1120 32-Inch 720p LCD TV -BlackA Big Disaster of a TV.", "Date": "July 8, 2012"}, {"Title": "Very Disappointed", "Author": "Dooter", "ReviewID": "R1JOICEIW54VFF", "Overall": "2.0", "Content": "I have had this TV for at least a few months now...  Let me start with the things I liked about this TV initially:1. Price/Features.2.  The picture is OK for a low cost TV, and although the native contrast is pretty bad, the dynamics of the LED backlighting do a pretty good job of making it seem OK most of the time3.  The netflix application is more responsive than my WDTV live on my main setupHere is the bad:1.  Audio and video both stutter regularly and on every channel when the wireless dongle is attached and network is enabled. It works fine when the wireless dongle is not connected to the USB port.  This problem does not happen when using the Ethernet port, but then you obviously have to run a cable to where the TV is.  I contacted Haier, and after a couple weeks finally got the TV setup for repair.  The repair center replaced the main board.  The problem still occurs.  IT IS A DESIGN DEFECT2.  Recently, the netflix app has stopped playing videos.  It connects, but says 'sorry we are having trouble trying to play this title.  Please try again later' or similar.  According to the device the firmware is up to date.  I have sent Haier an email on the issue and am waiting to hear back.Even if they fix the problem, I would not recommend this TV.  The headache thus far would have gotten me to spend $100 more up-front for a reputable brand.", "Date": "January 27, 2013"}], "ProductInfo": {"Price": "$649.99", "Features": "WiFi ready\nDLNA certified\nNet Connect\n720p Full HDTV\nIntegrated ATSC/NTSC/QAM Tuners", "Name": "Haier LE32N1620 Net Connect 32 720p 60 Hz LED HDTV WiFi", "ImgURL": "http://ecx.images-amazon.com/images/I/3105jQhZyCL._SY300_.jpg", "ProductID": "B004Q0PWMG"}}