{"Reviews": [{"Title": "I'm happy", "Author": "Matt S.", "ReviewID": "R2V1TGVIDMCFTA", "Overall": "4.0", "Content": "I'm not a videophile nor an audiophile. This is my first hi-def tv, and I really like it. The only fault is that the speakers max volume is weak. It is great for most media, but I have to max out the volume for some things I stream on netflix.It doesn't come with an HDMI cable, so if you're using the tv without an HDMI cable your first few days, the programmed color/brightness/contrast display settings will need some tweaking. With an HDMI cable, the pre-settings all look good and the picture is sexy crisp.", "Date": "July 9, 2011"}, {"Title": "Purchased As A Gift", "Author": "JUST-JIM", "ReviewID": "R3VPOKRKUSC2T0", "Overall": "5.0", "Content": "I purchased this as a gift for my daughter along with the Sharp bluray player # BD-HP28U.She says that the TV arrived in pristine condition as did the bluray player.Set has brilliant color, decent sound and only minor adjustments to the color, contrast etc.were necessary according to her. The TV remote will also power the bluray. So fareverything is working properly and she is well satisfied. The Amazon prices were a bargainas were the Prime shipping prices. Well done Amazon.UPDATE: Price dropped by $50.00 in less than a week. Its now $279.00 instead of $329.00.  I take back my statement that \"Amazon prices were a bargain\".UPDATE 7/3: Amazon came thru and refunded me the difference. Thank you Amazon.", "Date": "July 1, 2011"}, {"Title": "Excellent value for the price", "Author": "Jeffers", "ReviewID": "R1NEO4WBYH2K3C", "Overall": "5.0", "Content": "I bought this as a replacement for a 26\" Sharp that just failed. In 2004 I thoroughly researched HDTV technology and settled in on a 50\" Sony and a 26\" Sharp TV. At the time they were the best I could find in their respective sizes. You can see them both simultaneously from one point in our breakfast nook. The reasons that I initially picked the Sharp were picture quality and color richness, wide viewing angle and no distracting reflections in our brightly lit nook. In searching for the failed replacement at the local TV stores, nothing had these same features so I went looking at Amazon. This 32\" Sharp was easy to assemble and hook up and has the same good characteristics of the original Sharp. But I was unhappy with the initial picture color quality. I called customer support and in fifteen minutes the picture was wonderful. This TV is a real value for the price.", "Date": "January 19, 2012"}, {"Title": "Fine Product", "Author": "T-Way \"T-Way\"", "ReviewID": "R2CKWFQL4YS2K", "Overall": "5.0", "Content": "Was as advertised when I recieved it, arrived on time as stated at time of sale, fine product looks just like picture on web site.  I looked at reviews of tvs and saw many broke down later after warrenty.  I have 5 sharp aquos tvs in my house, have never ever had a problem with any of them.", "Date": "January 2, 2012"}, {"Title": "Pretty decent out of the box", "Author": "Faiz A. Chaudhry", "ReviewID": "R3CWAERV16D39F", "Overall": "4.0", "Content": "Pretty decent out of the box.  Sound is OK also not bad at all for a small room.  Still having few issues about the skin tone but I am sure tinkering w/ the setting I can get it to my liking.  Overall for 279 shipped can't complain.", "Date": "July 2, 2011"}, {"Title": "Good quality but some design drawbacks", "Author": "J. Xu", "ReviewID": "RWSVWOR6M61MT", "Overall": "3.0", "Content": "Very enjoyed watching this TV. Very clear picture and beautiful sound system. The only part I don't like is that TV is fixed to the stand, and you cannot move the TV on the top in different angles when you need to connect cables from the back. I put the TV in my cabinet, and every time I need to conncet HDMI from my computer to TV, or use the usb port on the side of TV, I have to carefully carry the TV and turn it around. Not very convinient for this part. Generally I am happy with this TV at this affordable price.", "Date": "August 2, 2011"}, {"Title": "Poor design", "Author": "Panama \"Panama\"", "ReviewID": "R1WCWCYFHSTUFW", "Overall": "4.0", "Content": "The TV looks great.  The problem is the plug sticks out about 1 1/2 to 2 inches and will not mount close to the wall.  I have now ordered a right angle plug and will see if this solves the problem.  I do do feel a person should have to buy a new wall mount (and have the TV stick out further from the wall) every time I buy a new TV.  Don't they expect these Tv's will be wall mounted.", "Date": "September 23, 2011"}, {"Title": "Love Love Love it!", "Author": "OC shopper", "ReviewID": "RHQPKTAJWKEZ0", "Overall": "5.0", "Content": "This is the best TV I've ever owned. The color is crisp and bright. It does everything it says it does at a very reasonable price. It was well worth the investment.", "Date": "May 24, 2012"}, {"Title": "Couldn't ask for a better 32\" TV!", "Author": "ZackKon", "ReviewID": "R3VT8GHH4PLHSA", "Overall": "5.0", "Content": "This was my first tv, and I was quite happy to get it home and hook it up with my PS3. Games looked great, and same with movies whether they were in Blueray or standard definition. My favorite moment was when I found it was actually 1080p :) Very easy menu, and lot's of picture settings to fine tune the picture, including individual color adjustment. The sound was actually quite good, and not tinny like a lot of TV's. Remote looks great too. If you have an opportunity to get this tv, get it. Don't bother with Samsung, Sony, Philips, or others.. Get the Sharp!", "Date": "November 18, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Sharp LC32D59U 32-Inch 720P CCFL LCD TV\nHigh Brightness\n6 HD compatible inputs; PC Input\nAQUOS LCD TV, PC Input\n6 HD compatiable inputs\n720P CCFL LCD TV", "Name": "Sharp LC32D59U 32-Inch 720p LCD TV, Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41OdjuwTnbL._SY300_.jpg", "ProductID": "B004NP3CXK"}}