{"Reviews": [{"Title": "Madashell", "Author": "Erika", "ReviewID": "R2KTYUN5OMQQFE", "Overall": "1.0", "Content": "We bought this TV from tigerdirect here on Amazon after some research.Great picture and we were happy with it until the unit crapped out on us after owning it for 6weeks.The lcd panel went bad according to Toshiba tech rep in India (good luck if you have to call them!!). Called Tiger Direct and they would do nothing for us.They WOULD sell us another TV and give us free shipping!!! You can guess what i told them to do!! Next I tried toshiba customer service and they wont replace the TV unless it is deemed\"unrepairable\". I actually got to talk to somebody in the states and they were no help.Next, I tried to get the thing repaired by the local Toshiba service rep and it seems that the part is currently unavailable and he wont know how long it will take to get or even if he can get it. So I will never buy a Toshiba product again and Tiger direct will never see me again.These ----- companies will take your $$$ in a NY minute but there customer service is Non existant!!! Do yourself a favor and spend a couple extra bucks and buy from your nearest Mom and POP store!!! At least you can keep the $$$ in your community and have a face to talk to when things go wrong!!! signed,MadasHell", "Date": "August 17, 2011"}, {"Title": "Very Happy", "Author": "spyac3", "ReviewID": "R2ZXW7GMLZ8KBV", "Overall": "4.0", "Content": "Saw this tv in an ad for 749.99 1-01-12 did some research and decided to purchase, I have found you will drive yourself crazy with professional reviewers since most everything is based on intricate measuring instruments now if they flat out say its junk I believe them. anyways after setting up the set I started to wonder if I made the right chose,since instructions are weak... but I started troubleshooting what I thought was a poor picture and found that everything that contributed to it was not the settings in the tv rather all of the settings in the dish/cable box once I set my receiver box to the correct settings and installed a new hdmi cable the picture on this set is MIND BLOWING... makes it seem as if your in the studio watching them film the episode or news events... I watched Avatar on dvd and was stunned with the picture I then watched the movie 2012 on a HD dish station and it seemed as if the plane was coming out of the screen at you!! Sound is decent but I am using a home theater anyways. I would strongly recommend this product, and if anyone that does purchase has image problems check all of you box/receiver settings before you give it  up... I am extremely happy with this unit", "Date": "January 3, 2012"}, {"Title": "gotta like toshiba..", "Author": "gjcv", "ReviewID": "R34S1B95VMF3X6", "Overall": "4.0", "Content": "i bought the tv a month ago and so far it has been a better tv than the sony or samsung i looked at before i bought the toshibapros.its easy to use.has enough inputs for my needs.sound is loud and clear.theres the optical output for my surround sound.picture is great thanks to cinespeed and clearframe technology esp when watching movies. dont need 3d bec feels like your actually watching it while they are taping it.gaming mode.regazalink works for the ps3native mode is awesomepricecons:no internet but not a big deal coz i have ps3it freezes at the beginning but hasnt happened lately..regazalink doesnt work for xbox 360. it could be an xbox issue.a little faded if youre on the side but not noticeable unless your looking for it", "Date": "July 20, 2011"}, {"Title": "***Best bang for your buck***", "Author": "J Branson", "ReviewID": "R1Q4ERMNHC0SQU", "Overall": "5.0", "Content": "I spent weeks shopping for televisions.  I visited many different stores.  I had decided on buying a 60\" Sharp LED that was priced at $999.  I was told it was not in stock.  I came back to look again, and was once again disapointed.This Toshiba television also was priced $999.  Clearly the Sharp was a better TV for the money.The employee at the store told me they had an open box that didnt fit into the customers living space and would sell it to me for $699.  Great deal!  I took it home and hooked it up.TO BREAK IT DOWNIf you have $1000 to spend on a TV, there are better options.If you can find a deal on this TV for what I paid, $699, you should buy it.PROS:*Clean Design*Solid Construction*3 HDMI Ports*1 Optical Audio Out*Link system that allows remote control to function on HDMI connected devices (NOT XBOX 360, but works great on my Sony Blue Ray Home Theater)*Flawless 1080p Picture*Very Decent 120Hz*Not a plasma*No nonsense menu navigation*Simple Easy to use remote*Blue Ray disk looks great, Xbox looks great, HD broadcast looks great.CONS:*Any non HD input or standard definition really looks terrible on this large 55\" screen.  720p input at minimum is required for a decent picture.*Speakers are weak.  Fortunatly you can turn them off, and make the volume from the remote control your home theater volume instead!*Picture angle could be significantly improved.  Looks great head on.  I do notice fading from the side view though (Deep blacks begin to turn grey).*Initially I had a GREEN Screen from xbox source.  After investigation, changing the xbox HD output color settings fixed this immediatly, no fault of the TV.*Factory picture settings are poor, fine tuning does resolve this but takes a few attempts to get it right.Additional thoughts:If you have a modern home theater system, xbox 360, or PS3 that run internet applications like Netflix, Facebook, Hulu, Pandora, etc...  Do not waste you hard earned money on buying a TV with these options also.  This TV is a great display for all your current gadgets to operate on.  It would likely make a weak package all by itself though.Even though my sony home theater supports 3D, I just find the whole 3D thing a hoax and refuse to participate in wearing goofy glasses for my home entertainment.  It is simply not worth it to me to spend hundreds more for 3D.PC running HDMI out looks fantastic.I use mine for mainly Sports / Gaming / Blu Ray / Netflix / Hulu and am more than pleased with all the pictures these provide.", "Date": "February 4, 2012"}, {"Title": "Bought a defective product", "Author": "larry", "ReviewID": "R3HTS5V7A4037E", "Overall": "1.0", "Content": "I bought this TV from Costco and was initially pleased with the product. Had it less than a week when the screen suddenly turned green. The images looked like green ghost. It started during a commercial break and lasted until the next commercial break. Then it appeared to return to a normal picture but upon closer inspection that proved not to be the case.Green dots infected the picture permanently after that. It gave the appearance that the images were bleeding green blood on their faces. Fortunately we bought it from Costco. They took it back and we replaced it with another brand.", "Date": "September 12, 2011"}, {"Title": "3rd breakdown in 8 months", "Author": "kathy", "ReviewID": "R7RMMS7F66QQ2", "Overall": "1.0", "Content": "Bought the TV in June, needed the inverter kit in October.  Four months later, another breakdown, another inverter kit.  The day after the repair, another breakdown, this time the tech says mother board.  All together, about 8 weeks waiting for repairs so they used up at least 2 months worth of my original warranty, which, of course, they won't extend.  Stuck with this piece.  Their customer service is just as bad as the TV!  They just don't give a damn once they have your money.", "Date": "March 9, 2012"}, {"Title": "Very Pleased", "Author": "Charles Georges", "ReviewID": "R393QORZAOL6G8", "Overall": "4.0", "Content": "I purchased this about a month ago and have been very pleased and has exceeded my expectations.  Normally I am a Sony person yet I purchased Toshiba occasionally.  Easy set-up, amazing picture, excellent volume and easy to switch between video feeds.Great value for the price.Kiley", "Date": "April 9, 2011"}, {"Title": "Great TV", "Author": "Calyhine", "ReviewID": "R385YJCDD0EKY0", "Overall": "5.0", "Content": "I don't understand all the negative reviews I've read about this TV. BestBuy delivered our TV this morning and set it up within minutes. We are using an HDMI cable and the picture is awesome. Of course to get the full benefit, only watch HD channels. But, even the SD channels look good. Sound is good, too. Love watching this huge TV. Do not see any blurring watching sports. Absolutely amazing!", "Date": "January 7, 2012"}, {"Title": "So far...So good!!", "Author": "Todd", "ReviewID": "R3V5NIKGYDFVIJ", "Overall": "4.0", "Content": "About a 2 weeks before Thanksgiving, i went and checked out the website from a popular electronic store, i won't name them but they rhyme with \"Schmest Smy\" and they had this T.V. listed for $800 with the regular price at $1,2000I wanted a plasma but after seeing this ones size, specs and price and figured with no interest for 18 monhts...ill go get it.After getting it, i mounted it up, hooked up my external speakers, hooked my Wii to it after getting HD cables for it, got The DISH Network to come give me a HD cable box and *POOF*  got my new T.V. kicking @ss.I really don't know what half the people here are whining about but it looks awesome to me. The internal speakers are decent, but majority of people are going to hook it up to external speakers anyway.The color is nice and bright and im pretty damn happy i got this T.V. along with a 4 year warranty for less then $1,000Its been up and running for a month and i have had no problems or concerns. Since im not a electronic guru, im sure a plasma would look bigger, brighter and more vibrant, but for the price......IT WAS A HELL OF A DEAL.", "Date": "December 16, 2011"}, {"Title": "Excellent", "Author": "Isa Leri \"Amazon First\"", "ReviewID": "R308BX6LA014F3", "Overall": "5.0", "Content": "I recently purchased this TV and i have to say i normally favor Plasmas because i enjoy the vibrance of color that usually comes with them. But this tv definitely made me reconsider my idea of LCDS! my last LCD was definitely not capable of such an excellent picture! and the sound for this TV is superior to many other models. for the price this is an EXCELLENT buy!", "Date": "August 3, 2011"}, {"Title": "Toshiba 55\" LCD", "Author": "BTS", "ReviewID": "RBOXTM74VDSCE", "Overall": "4.0", "Content": "So far, so good on this television!  It has a great picture, and it hasn't any lags in motion so the 120hz refresh rate is sufficient for regular TV action and football/sports.  I'm not a gamer either, so Ihave no opinion on that.  The price was great, most other brand-name 55\" LCD HDTV, 1080p w/120hz refresh are $200 to $500 more.  Compared to people I know with other large flat screen TVs, this is a ringer on price and quality. If the delivery would have been quicker, I might even have rated this a 5 for total purchase satisfaction.  As with any electronics, only time will tell if this TV will last but I'm confident it will.  I bought a 46\" Toshiba about 2 years ago, and it is working beautifully yet.  That's also why I felt good buying another Toshiba TV.", "Date": "January 24, 2012"}, {"Title": "55 inch toshiba tv", "Author": "charles dorsey \"chuck\"", "ReviewID": "RA9I57IF8D16A", "Overall": "4.0", "Content": "the picture is great, but I'm very disappointed that there is no audio out rca jacks to attach to my external amplifier.", "Date": "September 7, 2011"}, {"Title": "Great product and service", "Author": "TSOFan", "ReviewID": "R2HZC1OYRZSW33", "Overall": "5.0", "Content": "I bought this as a gift. It arrived in two days. Amazon has enhanced delivery. It was free with my order. TV was installed and works great. Price was very reasonable. Highly recommend.", "Date": "August 5, 2011"}, {"Title": "Insane annoyance", "Author": "M. Hung", "ReviewID": "R10XIYP34VFRTL", "Overall": "2.0", "Content": "When I got the TV, I hooked up the hdmi cable, and was really impressed with the picture quality.  The sound is pretty good too for conversations.  However, when I deviates from this simple setup, the TV gets insane.By default, the TV crops out the outer 5% of the picture, and skews the pixes.  This is easily fixed by setting to PC mode.The default setting also causes a delay of > 0.5 second.  Setting to the Game mode reduces that to < 0.1 second.  And here's the biggest annoyance:  every time I turn on the TV, I have to turn on the Game mode again manually!To add more bass and treble, I try to hook up an external speaker.  Even with the Game mode, I can still hear a slight  delay between the TV and the external speaker.  So I can use a separate analog audio cable, and connect the TV and external speakers to the same analog source.  To my astonishment, there's a delay of 0.5 sec on the TV speaker!  This means the TV actually digitizes the analog input, and intentionally adds a delay!This TV could have been simple and perfect.  Sadly someone in Toshiba decides that the TV must the have image cropped and the audio delayed, and actually forbids the TV to be used in a normal manner.", "Date": "October 11, 2011"}, {"Title": "not bad, but could be better.", "Author": "tonyclark444", "ReviewID": "RIPPM2PIYT353", "Overall": "4.0", "Content": "I ordered this TV from Abt which is an excellent seller. Their customer service is impeccable the only problem that I have with them is that they are in Illinois and I am in California. Because of the distance it is difficult to have them resolve the one issue that I have with the TV that I bought from them.  There is intermittently a grayish spot in the center of the TV when the shade should be black.  Abt informed me that it would be best to take up the problem with Toshiba's warranty department and have the problem fixed locally. The blemish is not too bad and Toshiba is taking care of the problem as I write this review, so it is being resolved and I will have an excellent TV soon enough. I would have given this TV,and the seller five stars if not for this one minor stipulation.  The TV is awesome and is everything that is was supposed to be according to the Product specification.  My Xbox, Blu ray, and PC are all hooked up with HDMI and look amazing on this TV, the optical audio puts the sound in perfect synchronization with the picture(without using optical audio you might have a problem with that)and sounds amazing.  I highly recommend this TV and highly recommend purchasing it from Abt.", "Date": "November 14, 2011"}, {"Title": "awesome", "Author": "Reb11", "ReviewID": "R28Q0D73JS8T", "Overall": "5.0", "Content": "I have had this TV over 2yrs now. Not a single problem with it. I bought mine at Best Buy. I had it mounted on the wall and then on the stand it came with. It has survived two kids and a big move to Florida. Let me tell you this tv is built very solidly. Now I'm trying to find a place that will let me trade it in for a good price. I want a smart TV. But either way if you want a good tv this one is it.", "Date": "December 24, 2013"}, {"Title": "Mixed", "Author": "Thomas", "ReviewID": "R2K3LBPY91BDH9", "Overall": "2.0", "Content": "This is a beautiful TV, my family and friends all loved it. However, after owning it for approximately 2 years and a couple months it just died on me and turns out the mother board is burnt out. I had no voltage surges and no thunderstorm within 100 miles of the night that it stopped working. After 4 weeks now of calling around and trying to see who is going to be reasonably priced. Best buy refuses to accept the tv \"its too big\". Even though that is where I bought it. And every one else requires a large deposit before even looking at it. So it appears that I am about to go and buy another tv after spending almost $1000 on this one becuase I wanted to have a good named tv that would last me.But the cheaper similar walmart brand tv has lasted me now 4 years with no issues and it is used more than the toshiba brand was.So overall its an awsome tv if it keeps working.", "Date": "September 10, 2013"}, {"Title": "Bad panel -- unfixable", "Author": "jarenger", "ReviewID": "R3HJ6YP7LM4RJD", "Overall": "1.0", "Content": "Never worked with video games, too slow.Just outside the warranty period, the screen developed a bad flicker.  I took it in to be repaired and the repair man told me that the inverter had gone bad and melted the wire harness.  He said he has seen this before and if you just replace the inverter, it will break again in a month or so.  The problem is the screen which some how fries the inverter.  He can't repair it.  So much for Toshiba.", "Date": "July 2, 2013"}, {"Title": "awsome tv", "Author": "Luis Sanchez", "ReviewID": "RNUZVANKQJ4J6", "Overall": "5.0", "Content": "This TV is spectacular, I've had it for a while and it has not disappointed me. Every thing is hooked up to it, my pc, PS3 and surround system. All HD images and sound quality are fantastic. I just love it.", "Date": "March 28, 2013"}, {"Title": "Great picture, slow channel changing, fair audio", "Author": "Always Looking", "ReviewID": "RRPJ1JVNTEB2W", "Overall": "4.0", "Content": "Purchased 8/2011, Reviewed 3/2013solid 4.0 average score.Great picture.  I push 720p to 1080p out to this and it works wonderfully.  The viewing angle is great, we have the TV at a slight angle and can view the screen very well off to the side around 50 degrees from one chair.  I definitely give it a 5 of 5.I would rate the audio average for a tv based audio.  We used the tv audio for awhile after moving before we got the surround wired.  Was no worse than I expected so no downgrade.  3.5 of 5.Channel changing is slow, very slow.  I have a Toshiba Regza and it changes channels much quicker.  They had to cut costs somewhere.  3 of 5.Hookups are pretty good, so 4.5 of 5.", "Date": "March 17, 2013"}, {"Title": "55 Inch TV", "Author": "Pokesalad1952", "ReviewID": "R25TKKKMODDEKU", "Overall": "5.0", "Content": "I couldn't be happier with the 55 inch TV. I can sit and watch it all day, if work didn't interfere. I absolutely love it.", "Date": "January 26, 2013"}, {"Title": "Good TV.", "Author": "Scrambled Eggs", "ReviewID": "R3NPQKDZOYBTKP", "Overall": "4.0", "Content": "We have been using this TV for a few months now and it works good.  We had really wanted to get a LED but at the time we couldn't beat the price on this TV of $800.  We haven't had any problems with the TV.  The picture isn't the greatest but it isn't the worst either.  The sound is horrible but we bought a Vizio sound bar which improved the sound a lot.", "Date": "August 4, 2012"}, {"Title": "Great TV!", "Author": "David", "ReviewID": "R3TYGY7NFSCXEH", "Overall": "5.0", "Content": "I bought this Toshiba about 10 months ago and it still runs great! I have my computer hooked up through HDMI as my monitor, which means this TV gets daily use. I play a lot of PC games and have my PS3 hooked up to it. Used a lot for Netflix and blu-rays too. It took some tweaking of the video settings when I first got it, but the picture is beautiful now. I have no complaints whatsoever!", "Date": "June 2, 2012"}, {"Title": "Great TV", "Author": "georg1434", "ReviewID": "R2GEVHV09CJ6UW", "Overall": "5.0", "Content": "Very happy with this TV. Did not want 3D or all those apps running on my TV. Most of the apps reviews I read about were not that good. Have my computer connected through a 25 foot HDMI cable and can do everything I need from the comfort of my chair with a wireless keyboard and mouse. Netfix is great on this 55\" screen.", "Date": "May 13, 2012"}, {"Title": "Not very durable", "Author": "Dalone59", "ReviewID": "RFR6AIQPEFDVR", "Overall": "2.0", "Content": "Bought one of these at a local Pricesmart store in Trinidad. The picture quality and sound are very good. However after 1 year of intermittent use (about 6 hours per week) the screen started to show some flickering. Initially I thought it was a bad connection. But after 14 months the picture became a skewed image to the left corner with vertical lines on the other half. Having passed the one year warranty, I had to get it checked by a third party for repairs. The main circuit board had to be replaced at a total cost of US$615 - half the original price of the TV.I have lost confidence in Toshiba products - I have had two Toshiba laptops with screen issues.", "Date": "April 7, 2012"}, {"Title": "Never Again!", "Author": "Aditya Kedia", "ReviewID": "R360XBEUJ6VK28", "Overall": "1.0", "Content": "Toshiba...lets see..TV out of service for the 4th time in 11 months...everytime its the same issue- main board...takes 6-7 weeks for Toshiba to send some one to replace the main board. Also, Toshiba outsources the job to some local company which take their sweet time to come to your place. Their Customer service is nothing short of a disaster. I don't know how they are still in Business..need to be reported to Consumer Act. Never buy a Toshiba product again. They only wait for your warranty to get over so that they can close your case. This company treats their customers as shit..they are 10 times worse than Dell.", "Date": "April 6, 2012"}, {"Title": "Very nice TV, but...", "Author": "imhowie", "ReviewID": "R3BTYLQPTBGA5J", "Overall": "4.0", "Content": "All-in-all, this TV is pretty good. The only issues I have with it are that the settings menu looks out-dated and isn't very intuitive. It would also be nice if it had a feature to be able to configure the audio as it is a little off, as I experienced with my previous Vizio TV, but there is a setting on that TV to tweak the timing of the audio. Also, though it has basically the same specs as my Vizio TV (aside from the size), the picture quality is not as good as my previous TV. It's not bad, but could be better.", "Date": "March 15, 2012"}, {"Title": "Tweak it...", "Author": "Nurse Kristine", "ReviewID": "RNZQ345W4KWHQ", "Overall": "4.0", "Content": "I bought this TV because my plasma TV quit working... It was the black screen of death problem. I had read many complaints about plasmas doing this, so I decided to try something different, which is why I bought this TV. I didn't want to spend too much money, and this TV was priced in my range.I had some problems when I first hooked the TV up to the Dish Network. I would set the color and backlight to where I liked it, but then the remote on the Dish Network would not work. If I changed the settings to where the remote would work, the picture was awful. I was very disappointed. I thought I had bought a lemon and it would never work well...Online, I found that the problem is that the TV interferes with the IR remote.  But there is a solution. I called Dish, and they sent me a brand new UHF remote! (Some remotes have a little switch inside the battery casing to change to UHF - but mind didn't). It works wonderfully and I can now watch a beautiful picture on my TV.I give it a 4 because the manual is awful (but you can get one online), and I had to mess around with it so much.", "Date": "March 10, 2012"}, {"Title": "Great TV at a great price", "Author": "Fred M Quinn", "ReviewID": "R32CLMU7PBYX10", "Overall": "5.0", "Content": "We've had the TV for 3-weeks now and are more than pleased with the picture quality and features.The price we paid was only $800 on Amazon, actually lower than it is selling for now. That doesn't happen too often!I would suggest that you look online for settings to calibrate the TV when it arrives. The changes we made to the settings made the picture simply phenomenal.", "Date": "March 9, 2012"}, {"Title": "Incredible", "Author": "Matthew Bennett \"p7fl\"", "ReviewID": "R31I77672DV8RT", "Overall": "5.0", "Content": "I was keeping my eye on this TV for a few days due to the price ($799) a couple of weeks ago. I am not one to buy such an item sight unseen, so I went to one of the big box stores to see it live, and was very very impressed. I know in store displays in DEMO HD, I anticipated some differences at home. I went home and ordered it online here at Amazon. I set up a delivery date and waited. The delivery day came and they arrived about an hour early. I got it all set up and was quite impressed, but I only had a Standard Def receiver, the HD receiver hadn'd arrived yet, but still this rocked in 480 quality. The HD receiver finally arrived a few days later and it totally blew me away, the color in both SD and HD was spot on, with no adjustments necessary. The setup is very easy. The sound is amazing for a Flat panel, I was planning on getting a sound bar, but there is no need, it is quite loud, but if you are an audiophile, maybe you will modify it. The only thing that some people may not like is the HDMI ports, it as three, two straight, and one on the side. The one on the side kinda makes the cable stick out, but I don't have many HDMI pieces, so that doesn't bother me. Overall, it is a beautiful looking and acting TV, glad I got it.", "Date": "March 3, 2012"}, {"Title": "Happy Customer", "Author": "Rosemary Warner \"nccookie231\"", "ReviewID": "R37NLE9GG70Y5D", "Overall": "5.0", "Content": "I just replaced my 52-inch plasma with this Toshiba LCD and what a difference.  Totally better picture.  Easy to access all the connections and easy set-up.  Have encountered no problems whatsoever.  Very satisfied.", "Date": "February 12, 2012"}, {"Title": "Great flat screen for the $$", "Author": "John Davidson", "ReviewID": "R10LQ1Q281MY8A", "Overall": "4.0", "Content": "Really nice tv for the money. Great picture, very bright for a LCD. TV was easy to set up and use. You have to use HDMI cables for your componants and a HD input to get the most out of the picture quality. Sound is OK, pretty comparable to other flat screens. Depending upon the accoustics in your room you may want to consider a sound bar.", "Date": "February 7, 2012"}, {"Title": "Great product for the price.", "Author": "Noel", "ReviewID": "R3URD5MAN9G5PZ", "Overall": "4.0", "Content": "Great product for the price. With the exception of a bad remote when the product arrived, Toshiba replaced it with no problems.", "Date": "December 5, 2011"}, {"Title": "$800 whaaaat?!", "Author": "Sunkist", "ReviewID": "R3NNZA15102S10", "Overall": "5.0", "Content": "With the Amazon card, I payed $800 for this TV. EIGHT HUNDRED DOLLARS! That's way too little. The TV is massive, the picture is beautiful, the back lighting is even, no complaints. I'm a bit of a TV snob and I have to say I couldn't be happier. Even at full price ($880), you're getting ripped off if you don't buy it. So quit reading this wonderfully written review and go buy it. Then we can be TV brothers. Or brother-sister, if you're a girl. And if you're a girl, who cares about TV size and quality, I suggest you drop me a line. We can romantically compare aspect ratios and stuff.", "Date": "September 1, 2011"}, {"Title": "GREAT!", "Author": "etterbaby", "ReviewID": "R30HIFKL3S0K8F", "Overall": "5.0", "Content": "great picture. Easy to hang on wall. I would buy another television just like this one. over all quality is excellent", "Date": "August 30, 2011"}, {"Title": "55 inch LCD overhyped", "Author": "TH", "ReviewID": "RT8D7228BTGG1", "Overall": "1.0", "Content": "When I first saw the price for this tv, I thought to myself \"Wow, what a bargain!\" I got the TV sent to me and when I first opened it, I was very excited. I hooked up the TV to my cable box via an HDMI wire, as well as my Xbox. Sitting in front of the tv it worked well. When viewing it from the side, it was terrible. The colors got very light on the left and right. I walked around and around the tv to see if I was just seeing things but my friend saw the same issue. With regards to playing Xbox, I do not recommend this unit for any game console. There is a lag within the images. I have a Plasma and thought an LCD would be an uprgrade. Needless to say, I went and bought another 50 inch plasma and I am extremely happy. Too bad this LCD did not meet my expectations!!", "Date": "February 28, 2012"}, {"Title": "Good TV", "Author": "Peter", "ReviewID": "R2FVBS3V0T8JO1", "Overall": "4.0", "Content": "After owning this TV for 2 years, I can say that it's a solid TV.  The picture quality is great and the rare times we actually use the 3d, it's very fun.  The lack of the 5th star is because the \"apps\" on this TV are not very good.  Apps load very slowly and don't provide a smooth interface as you would expect on a TV versus an Xbox or cable box interface.", "Date": "November 10, 2013"}, {"Title": "PC input - not 1080p", "Author": "Andy", "ReviewID": "R3SGRC2N815UOE", "Overall": "1.0", "Content": "I purchased this tv, and I am disappointed.- 2 stars => First tv I received did not have working display- 1 star  => Toshiba used misleading advertising for pc input- 1 star  => Toshiba support rep badSo 1 star, and I would like to give less 'cause Toshiba also didn't let me post a negative review on their site.The first tv I received had an obvious problem.  An oval about 2 feet wide in the middle of the tv was blue instead of black.  So I returned it for a new one.Then I tried to hook up a laptop through the pc input.  I was hoping to watch tv/movies from it.  And after fighting with it for awhile, and getting multiple laptops to display 1080p on other monitors (and tvs), was unable to get 1080p on this tv.  The resolution is awful.  I ended up calling Toshiba, and the rep said that the pc input doesn't support 1080p.  Which wouldn't be that big of a deal if they didn't advertise it as one of their top features.There were 5 \"key features\" described on the front page of the toshiba product description.1) 1080p2) Clearframe 120Hz3) Hi Res PC input...That's right, the PC input was the 3rd \"key feature\" after 1080p and 120 Hz.  Which would make any consumer assume that 1080p worked.  False advertising.  I expect better from a brand I used to consider reputable.  And the toshiba rep basically said tough luck, there's nothing they are going to do to help.If you're planning on hooking up a laptop to it, don't buy this tv.", "Date": "October 31, 2011"}, {"Title": "Sorry no XBOX OR PS3 on this TV!!!!!", "Author": "Len J. Bartush \"p0k3\"", "ReviewID": "R3H5HXDPE06RQE", "Overall": "1.0", "Content": "This TV is terrible. I'm putting mine on Craigs List and will never buy another Toshiba product again. Absolutely ridiculous it does not save your settings!!!!!!!!! With out Game Mode on Gaming is impossible. Wish I could give it 0 stars cause it really is useless as a gaming TV.", "Date": "December 6, 2011"}, {"Title": "Vertical lines are coming", "Author": "jtech50", "ReviewID": "RPDII510XU7QV", "Overall": "1.0", "Content": "Toshiba's are known for what's called vertical banding so you can expect to begin seeing them in 18-24 months. Good luck with Toshiba's support because it's non-existent!", "Date": "November 15, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Technical Information--Screen Size--55\"::Technical Information--Backlight Technology--CCFL::Technical Information--Aspect Ratio--16:9::Technical Information--Features--Channel Labeling, Sleep Timer::Technical Information--Media Player--Yes::Video--Digital\nTuner--ATSC::Video--Analog Tuner--NTSC::Video--Video Signal Standard--HDTV 1080p::Video--Standard Refresh Rate--60 Hz::Video--Frame Refresh Rate--120 Hz::Video--Maximum Resolution--1920 x 1080::Video--Scan Format--1080p::Audio--Speakers--Yes::Audio--RMS O\noutput Power--14 W::Interfaces/Ports--Number of HDMI Ports--3::Interfaces/Ports--Composite Video--Yes::Interfaces/Ports--Component Video--Yes::Interfaces/Ports--HDMI--Yes::Interfaces/Ports--USB--Yes::Interfaces/Ports--VGA--Yes:Physical Characteristics-VES", "Name": "Toshiba 55G310U 55-Inch 1080p 120 Hz LCD HDTV, Black (2011 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/417APHv7mgL._SY300_.jpg", "ProductID": "B004MFDL2I"}}