{"Reviews": [{"Title": "Excellent edge-lit LED TV", "Author": "Jimbo", "ReviewID": "RMWUMKVOVUE8X", "Overall": "4.0", "Content": "After several months of using this TV, here are my impressions. Note that I'm using Antenna HD, PS3 Bluray, and DVD.Design:The thin bezel design and glass(stem) stand is gorgeous, it feels like the picture is floating on the stand. The thin bezel really enhances the picture by minimizing reflections. It's really refreshing to not have a thick glossy bezel shining at you when watching TV; although the bezel itself seems to get mighty hot after several hours of use. The screen is glass and it does have reflections in daylight. It will probably annoy those of you that have a lot of glare coming from windows.Picture Quality:HD picture quality is outstanding while SD ranges from good to OK. The SD quality really depends on your broadcasting source; higher quality SD means good SD picture. Blacks are good, but I believe the processing engine goes a bit overboard and saturates the blacks to a point where details are lost. I haven't found out how to tone down the blacks, even after shutting off all the processing.  Colors seem to really pop out, if it's too much one can adjust RGB in the menus.  Initially, this TV did not exhibit any noticeable clouding for several months but now I can clearly see clouding on a completely dark transition screen. I'm a bit disappointed it has developed clouding over time, but it's not bad enough that you'll notice it during tv viewing.  This is an edge-lit LCD and there are inherit weaknesses. Motion picture quality is very smooth and artifacts are kept to a minimum; in fact, this is the smoothest picture I've ever seen on any HDTV.Adjustment Controls:This TV has quite a few options for tuning the picture. There's standard, dynamic, natural, and movie modes. Each mode has it's own saved settings. For my normal viewing, I started with the movie settings while in Standard mode and made a few adjustments to brighten up the screen. Movie mode has a \"warm2\" color tone that I changed to \"standard\" since I don't like warm colors for normal viewing. For movies, I use the movie mode where the colors and brightness are toned down, with relatively few adjustments made. The natural and dynamic modes are horrendous, don't even go there. There's some fine adjustments in each mode with backlight, contrast, sharpness, hue, brightness, color, etc.Connections:Has HDMI 1.4 connections, which allow 1 Audio Return and single Ethernet connections (with specific high speed compatible HDMI cables and other HDMI 1.4 devices).  Has 1 composite connection and 1 component (both use supplied extension plugs). Switching between sources is a tad slow to me, wish it was bit faster. Note that the optical out connection will transfer Dolby Digital sound from the antenna input, but it will only transfer stereo sound if you are connecting a device from HDMI and outputting the sound using optical out.Sound:Sound comes from the back panel and these kinds of tvs always sound odd. It's definitely loud enough, but not as good as a tv with good front speakers. You can use simulated surround sound and it's not bad at all. The one annoying thing is your sound settings are kept the same as you change your input sources; even after you've configured one input source as having movie sound settings. You can use the equalizer to adjust the sound to your liking. I might buy a sound bar to accompany this tv.Internet apps:I took a little while to play around with the apps, they're ok but respond pretty slow. Just your standard apps, nothing impressive. It does have an app store where you can purchase more apps but I didn't try that. I found youtube to be a bit odd. I started up youtube and it showed me the annoying orange video on startup; really strange it just loaded up with that video.Other apps:The photo viewer is pretty decent, seems a bit slow in rendering the pictures from a USB stick. I've also played some AVI and MKV files on the TV and it looks good to me. MKV files do not seem to have subtitle options.3D:I bought the Samsung SSG-3100GB bluetooth glasses for 2011 3D TVs. The glasses are great and much better than the old versions I tried out on a 2010 TV. It syncs up really well and I don't notice ghosting. There is a 3D button on the remote where you can convert 2D programming to 3D; this is done on the fly using the TV's processor. The 2D-3D is applied minimally so it isn't great; you will barely notice the 3D effects on the conversion. However, watching true 3D movies is great but 46\" is really small for 3D. What others say about having a 50\" plus TV is true if you want to experience the depth of 3D. What truly blows me away is playing 3D games through the Playstation 3. I started Wipeout HD up and I was giggling like a silly schoolgirl for a while. It really blew my mind how the 3D enhances the fun of games.Remote:Remote is pretty decent. It has a your standard TV buttons as well as a way to control playback on other sources with fast forward, rewind, stop, play. Remote has a backlight you can activate.Settings:Here are some basic calibration settings I used.0) Standard Mode1) Backlight: 132) Contrast: 933) Brightness: 454) Sharpening: 10 (keep this low!)5) Color: 456) Tint R/G: 50, 507) Color Tone: Auto8) Dynamic Contrast: LowAdditionally, I nearly turned off all the processing (including motion plus)Verdict:Very good TV with an inherit weakness in edge-lit LED technology in that you will find some uneven lighting and clouding. This might be as good as edge-lit LED is going to get. I gave it a 4 star here but it's really more 4.5 out of 5. I won't give it a 5 because true local-dimmed LED TVs have better contrast and color consistency, but you'll be paying a lot more (unless you buy the ugly Vizio LED TVs).Update 1/13/2012:I upgraded to the newest firmware and noticed after rebooting it reset all my settings. I don't see anything different except I noticed how crappy the picture was. It's important you do not leave the it on the default settings as the picture quality is pretty horrendous. Use my settings as a baseline, especially keep sharpening low, turn off motion plus, and you will see the potential of this tv.More notes:I recently noticed that my tv was tilted down to the left a little as it sits on the supplied stand. I took out a tape measure and noticed the left end was nearly 1/4\" lower than the right side. This really bugged me so i took apart the stand and slipped a piece of paper folded several times in the gap where you screw in the stand. This helped balance it perfectly.", "Date": "April 1, 2011"}, {"Title": "Absolutely Amazing!  What Else Can I Say?", "Author": "Jeff H", "ReviewID": "RUYWR9LQB1ETD", "Overall": "5.0", "Content": "I have only had the television for 3 days now, but here are my initial impressions:The picture is absolutely stunning.  I upgraded from a 50' Samsung DLP that I'd had for about 7 years.  I truly didn't realize what I was missing with the technology advancements of 1080P LCDs and LEDs over the last few years.  My wife and I will be watching HDTV in either 1080i or 720p and look at each other and say this doesn't look like \"normal\" TV.  We finally figured it out last night.  The picture is so clear that television shows truly appear to us as if we're looking through a window into somebody's home or perhaps watching a live performance/sporting event.  We can even start to decipher how \"fake\" some of the sets are that the producers are using on many of the sitcoms.Watching a Blu-ray is almost like watching a video game.  The frame rate and clarity are so much improved over previous generation sets that it really gives you a whole new movie-watching experience.  Blu-rays might take some getting used to for me because they are so life-like that I tend to just stare in awe rather than paying attention to the movie.The 3D function of the television also blew me away.  I really wasn't sure what to expect here, but took a leap of faith because the price was so incredible.  Not only does the 3D create depth when you are watching 3D blu-rays.  The picture actually comes at you as if you were in the theater.  So far the only experiences I've had with 3D are with a couple of the IMAX 3D blu-rays that I purchased on Amazon.  The 2D to 3D function is a bit gimmicky.  I've used it to watch baseball games and the NHL playoffs and it does add a little depth to the picture, but probably not enough difference for me to have to wear the glasses all the time.The one knock against LED televisions has been black levels.  While I do notice that the blacks are not quite as deep as other TVs, it really is overshadowed by the beauty and clarity of the rest of the picture.Overall, this is a definite 5 star purchase for me.  If bought 100s of items on Amazon and this is the first thing that has really compelled me to write a review if that tells you anything?", "Date": "May 20, 2011"}, {"Title": "Oh Boy!", "Author": "SalPro", "ReviewID": "R1Q5VCTS9Z15M3", "Overall": "2.0", "Content": "The good:Gorgeous appearance. Unusually slim bezel. Very thin. Barely warm when used (very low power consumption). Lots of apps including Vimeo streaming.Glossy screen to my surprise appeared reasonably dark and without interfering glare even in bright sun lit room.The bad:First and major one - absolutely unusable for 3D viewing. Crosstalk is unbearable, totally spoiling 3d immersion. Originally got 3100 glasses. Samsung support told me to get newer, 3300 glasses for this TV. Over hundred bucks later - exactly same issue. I'm convinced that there is no difference, at least for this TV, if 3100 or 3300 glasses are used. For this thing alone this TV does not worth it's price.Second - uniformity. Very bad on black (light spots), and even mid gray has some problems - one dark blob. (I did not notice any problem on bright white). On black both lower corners are bright to almost unbearable interference with picture. Samsung support told me to hold my conclusion till after over 600 hours of use, auto conditioning supposed to take care of it by then. Well, I don't think I will have 600 hours on this TV even after one year and I don't have intention to tolerate it. If screen conditioning required - it should be done at factory before shipment to customer. I call ... on it.Third - dynamic local dimming. Not advertised but it is obvious to me that this model uses local dimming. It is poorly implemented and I see no option to turn it off in any video mode. As it is dynamic - there is many way it appears and spoils the picture. When used for apps - local dimming is disabled.Minor thing - out of the box all picture \"enhancement\" stuff turned to the max producing unpleasing, pasterized image. Takes some tweaking to get it back to normal. \"3D\" settings has no explanation what it does (settings -1, 0 and 1) other than it says that it \"optimizes 3D\". My guess it tweaks glasses sync timing as I can notice very slight crosstalk change, but to me it is absolutely useless.It is very nice 2D TV (except black uniformity), though overpriced for that. In my opinion it should not be sold as 3D. Samsung's customer support quick and polite but absolutely useless.I'm trying replacement, will see if the one I got is just unlucky fluke or if there is some systematic problem with this model. So far Amazon appeared supportive.Will follow up...Here it is: replacement was pretty much identical in every way to original one. So sad, it's a beautiful set. If you really like it for 2D - get D6000 instead, same guts but without 3D and few hundreds cheaper.Amazon service absolutely superb. I will continue my shopping for 3D TV set.", "Date": "May 7, 2011"}, {"Title": "Even better than my 2010 Samsung 50\" plasma!", "Author": "Big Kid \"Robert\"", "ReviewID": "R14OVFS2QQO3M8", "Overall": "5.0", "Content": "I have 13 TVs, from 19\" to 62\".  Four of them are Samsung (32\" LCD, 32\" LCD, 50\" Plasma, and this 40\" LED), most of the others are Sony, Panasonic, or Mitsubishi.  Every one has been a great TV, but each one is better than the previous. Make sure you understand this TV is the 2011 model, not 2010.  It is a UN40D6400UF, not a UN40C6400UF.  It is so new that you can't easily find support at Samsung if you use the Product Model Finder. You must search the sight with the correct model number, and only then will you find a path to the support page.I can only rate this TV on 2D picture quality. I have no use for 3D-TV until they don't require glasses, even though both my PS3's, TV, and a couple of Blu-rays support 3D. As another user noted, the box is slim and that's no joke.  I bought my kids a 40\" Philips LED TV two weeks ago and that box was slim, but this box was 2\" thinner. This TV weighs 22 lbs, while the Philips is 30 lbs. The thin bezel is amazing and makes the TV look like it's all picture.The menu system is slightly better than my plasma, both well laid out and intuitive.  Setup was a breeze and the settings were NOT all maxed out. The remote is pretty well laid out, but not as nice as my plasma and the back-lighting is not as bright as it should be. The picture and sound are superb! Off-angle viewing (vertical and horizontal) is amazing. All my Samsung TV's have touch-sensitive controls on the front of the TV - they look great but are hard to use in most lighting situations. This TV has real buttons on the back of the TV, but you have to memorize the locations by feel. (UPDATE) When you touch the buttons on the back of the TV, there are icons that appear on the front of the screen showing all of the buttons and which button you are touching, by highlighting that button.  Very Cool!I would recommend this TV to all my friends and family!! I am so glad I spent the extra $100 to get the 6400 instead of the 6000.UPDATE: OK, I broke down and bought a pair of Samsung 3D glasses and Resident Evil: Afterlife 3D.  The glasses paired with the TV like magic.  The 3D picture was quite amazing with none of the problems described by another reviewer.  I still don't like the glasses, and I felt some eye strain and a minor headache during the movie.  You can actually still watch the movie without the glasses - not very well, but a 100 times better than the old red and blue 3D movies.  The glasses also fit a big head like mine, but still fit my children (nice design).Also I got tired of the soap opera appearance of the standard 2D video, so I adjusted the Auto Motion Plus based on forum comments (Blur at 10, Judder at 3).  The picture looks normal again, and the fast motion is no longer jerky.  I recommend making this change, or going crazy watching strange, unnatural video.  It might sound silly, but this adjustment is night and day!IMPORTANT: All documentation about this TV's wall mount size is incorrect. Maybe the 2010 model took VESA 400x400, but this 2011 TV takes VESA 200x200.NETWORK UPDATE: Unless I misread something, there is not supposed to be a LAN port on this model. Just look at the specs for inputs, no LAN port. But this 2011 model does have a LAN port and it works perfectly. I hooked up an old D-Link DWL-G820 as a wireless access point (gaming adapter) and the TV now has Internet. Still loving this TV!!!!", "Date": "June 1, 2011"}, {"Title": "Awesome LED TV!", "Author": "Anthony Gomulka \"Tony\"", "ReviewID": "R2KDXL847Y9XTZ", "Overall": "5.0", "Content": "My family just redid our family room and it was time to throw out our old CRT TV...My parents don't know anything about tech so they asked me what would be a good TV to buy. I chose this one. I'm happy with it. :DI got a small nettop with this TV with the intent of using it as a HTPC to stream video from our other HTPC in the basement and surf the web. The picture looks nice! :D I fired up a 1080p rip of The Dark Knight with all the lights off and the picture was nice and crisp. One thing I noticed is picture looks unnaturally smooth. I honestly don't know if its a good thing. I haven't bothered looking into it, but I want to believe its the motion plus. According to the other review, its something you can just turn off, so no foul. :)I love the ultra thin bezel. Other TVs say they are like 37\" when the actual screen size is only 32\", obviously just an attempt to cut down on production costs. With this TV, there's none of that. :DThe sound quality is good. Its enough to play any movie at a good volume without distortion in a smaller room. I had XBMC going and I was playing some of my heavy electro, it sounds great, except the fact that the sound lacks the strong bass. But how can I complain? Its a TV. Not a sound system.As far as the other review pointing out the edge lit \"weakness\" I have to stand about a foot away from the TV to see a very small amount of light bleeding. I couldn't even notice it sitting on the couch cruising the web. :)This TV is great. I love it. I have no complaints. :D--Things that might save you some headaches--You need to turn the sharpness WAAAAAAAAAY down. Yea the other review has it at like 10, thats where mine is too.For people plugging in a computer into this TV, don't freak out when the picture over scans the desktop and it gets cut off all around the edges. You need to press menu, go to picture -> picture adjustment, then change the \"picture size\" from 16:9 to \"fit screen\". This is not the only TV I've had to change this setting on, but it really bothers me that manufactures don't have that set as default. Because people will resort to changing the desktop resolution to something lower, than complain about how the picture looks fuzzy. (Sorry mini rant) :DWe all mounted our TV. The wall mount kit that we bought didn't have the right length screws for this TV. You need an 8x25mm screw. Had to run to the hardware store to grab some. :( Make sure you have some washers on hand to avoid torquing into the back of the TV. :)", "Date": "April 10, 2011"}, {"Title": "Excellent 3D LED TV, internet ready & great apps (Netflix!)", "Author": "Patrick", "ReviewID": "R2FLRG02B9H3A2", "Overall": "5.0", "Content": "This is a fully-featured, 3D capable, internet ready, LED TV from Samsung.First, a quick comparison of similar models: - The D6300 model (Samsung UN55C6300 55-Inch 1080p 120 Hz LED HDTV (Black)) does not have 3D capabilities. - The D6400 model (Samsung UN60D6400 60-Inch 1080p 120Hz 3D LED HDTV (Black))has 3D and wired-internet and you can purchase an optional WiFi adapter. - The D6500 model (Samsung UN60D6500 60-Inch 1080p 120HZ 3D LED TV (Black)) has 3D and is wifi ready.In selecting a TV I wanted one that had good quality, was 3D ready, was internet ready (particularly for netflix streaming), and was aesthetically pleasing. This TV met all of those features. My location was close enough to run a wire to the router so I did not need WiFi, making the 6400 the model for me.Out of the box, the picture was great. After spending a little time and adjusting the picture settings, the image is fantastic. Blacks are dark and colors are bright. There is no blur in fast action scenes, thanks in part to the 120Hz refresh rate. There are several preset selections and a myriad of settings to adjust if you want to further customize your picture.The 3D function works amazingly well. The tv uses active 3D glasses, like Samsung SSG-3100GB 3D Active Glasses - Black (Only Compatible with 2011 3D TVs) (not included), and the picture is amazing. The 3D technology will likely continue to evolve, but the TVs with the best images are the 3D tvs, so even if you don't care about 3D and you're just looking for the best image, 3D is probably the way to go.The TV has a simple recessed area for connections, making it easy to mount on a wall without interference from the plugs. There are plenty of inputs to keep you covered:  4HDMI inputs, as well component, composite, PC, and USB.The TV is also energy efficient, exceeding EnergyStar standards with an estimated energy cost of only $17 per year.The \"Smart TV\" feature is the internet capabilities. A dedicated button on the remote control brings up the internet menu, allowing you to select an app to run or to download new apps. Popular apps include Netflix, Pandora, Blockbuster, Hulu, YouTube, ESPN, as well as social networking with Facebook and Twitter. The Netflix app works quite well, allowing you to browse your queue and offering suggestions based on your viewing patterns. The streaming picture quality is also good. It's not quite as good as a DVD, but I've not experienced any buffering or pauses in the playback.Aesthetically, the TV is also quite nice. The ultra then bezel nearly disappears while viewing and makes the screen seem even larger than the already-large 60\" size. The included stand is also quite attractive if you are not planning on mounting the TV. The TV does have standard mounting points, making it quite easy to hang this TV on a wall or mount it in a stand.Overall, I'm quite impressed with this TV. I've not yet experienced anything negative. The TV is full-featured but the interface is simple and intuitive. The picture is amazing and the 3D capability and internet apps should meet the expectations of nearly every user.", "Date": "August 19, 2011"}, {"Title": "Complete accessory set up shopping list", "Author": "Gregory \"M\"", "ReviewID": "R9AI3LJHKMND1", "Overall": "5.0", "Content": "After weeks of research, I have ultimately found the greatest combination for 3D home viewing entertainment and it is written here to help you easily put together a stunning 3D home theater system in a snap. This I wish would have existed to help me consolidate an A plus television combo. Here is my list to you for one of the best television experiences you'll have, including the option to invite 3D films and images into your living room right in front of you. This is a bit lengthy but super informative.Copy and paste the headers into the Amazon search field to find the recommended products being reviewed.** Samsung UN55D6400 55-inch 1080p 120Hz 3D LED HDTV **Start with the 3D LED television size of choice. A big one is the best. We purchased this 55-inch screen without regret. From many angles Samsung is the leader in clarity, bright streaming color, sharp imaging, plus the most up to date features on the market today. This television does it all minus a built in processor for accessing the Internet. Which is no big deal because there is a PC input port where you can connect a PC and set up a wireless keyboard and mouse to then use the television as a computer Monitor. HDMI and USB ports galore as well as standard connections for those out of date devises. This Television also has a specific button on the hand held remote that allows standard movies to be upgraded in 3D. Mind you it is not as superior as the actual movie filmed in 3D, but it is pretty darn close. The remote is back lighted and easy to use.** Samsung SSG-3100GB 3D Active Glasses **The best choice in 3D viewing glasses as they work in conjunction with the 2011 Samsung Televisions. These are battery operated so eventually a battery replacement will be required, however inexpensive compared to other versions and perfect for getting started at a reasonable price. These we chose because they actually communicate with the television. When 3D is activated or a 3D DVD is detected in playback mode, a splash screen on the monitor will advise you to switch the glasses on. When you stop the 3D Movie or return to standard 1080 TV viewing, the glasses automatically turn off. A great feature. No worries of leaving them on and wearing down the battery. Rechargeable glasses are available from Samsung, but if you have a large family, it can get a bit pricey, so these battery operated glasses are great for starting out even if there is only one or two pair needed. They are lightweight and accessorized with a cleaning swatch. Store them out of sight in a felt lined book box to keep them clean and damage free. I picked up a box that resembles a leather bound book from a craft store and it houses them perfectly and sits on the shelf with the other books.** LG LHB536 1100s 3D Blu-ray Home Theater System with Smart TV integrated Wi-Fi. **I know it is not a Samsung, but this one had all the features to provide a great sound experience and more. This unit actually boasted the best sound over Samsung or any other brand at a midway price. This system is serious. It allows all your necessary devices to be connected to it with the need to only connect a single HDMI cable to the television. This is set up brilliantly and speaks perfectly with the Samsung Television and satellite accessories. This thing also reaches out to my home computer and displays all my shared network files on the television screen. Photos, Movies.... anything stored on your home PC can be transferred to the television screen wirelessly with the internal Wi-Fi connection. It also has the capability of connecting your PC to it for direct Internet access. Cool, I know. The one thing I really liked about this unit is I was not guessing at sound selection as with other brands. This selects the best overall surround sound and transmits it to the speakers. When a Blu-ray disc is played, HD standard or 3D, the sound is absolutely incredible. There are several speaker modes that can be manually set, such as Natural, Voice Clarity, Movie mode and best of all Equalizer. Each speaker has a volume control as well to optimize the sound per speaker depending on where you are sitting. All the speaker settings are saved until you choose to make a change. No need to set them each time you flip on the tele. On that note, the Television and Theater System returns to the last setting you turned it off at when you switch it back on again at a later time. Others take you back to a home menu and requires a few steps at selecting your choice of TV viewing, music, radio or DVD. That was way too annoying. This LG is much better as you go to the Home screen by depressing the Home button only. Aps are also available on this unit. IPod connection comes with it too. The remote control is simple to use as with any. The receiver has a few necessary soft touch keys that in my opinion should have been illuminated. They are not lit, so the DVD functions, such as eject, play and indexing forward and reverse from the receiver are a bit difficult in a low lit setting. The panels soft touch keys are not used much anyway as the remote control is ultimately the control center. This is the ONLY teensy disappointment I found with this system. Most other players had this same issue. Rectified easily by using the hand held remote control.** Mediabridge Ultra Series - High Speed HDMI Cable with Ethernet **This 10.2gbps HDMI Cable is fast enough to flawlessly transmits 3D images from your devises to the 3D television. This cable supports the Highest Refresh Rates Available. This includes - Transfer Rates of Up to 340Mhz or 10.2gbps - True HD Dolby 7.1 and DTS-HD Master Audio - Ethernet Channel For Sharing Internet Between HDMI Devices. We purchased three additional cables because it worked so beautifully. Nothing wrong with a spare or two.You will need one that connects the Satellite or cable box to the LG Home Theater system and one between the home Theater to the Samsung Television. This will give you Ultimate picture and sound at a prices WAY below any brand if purchased at a local electronics store. These work perfectly and you will not be overspending.** Monster HTS 1000 MKIII 8-Outlet Power Center With Clean Power stage2 **This I recommend, as it will act as a power surge protector during storms and unexpected bursts of dirty power sent to your electronic units. It handles up to 8 devises as well as your Coaxial cable (included) and an Ethernet connection (not included). This Power Center also reduces the electrical noise that can channel to all your electronics that are connected to it, which will increase the life of your units by years. This I suggest for all that is listed above especially your LED TV. The LED electronic devices need and survive on clean power. Trust me, I have learned from experience. This will save your products from harm and add years of use beyond the manufactures documented life expectancy.", "Date": "August 14, 2011"}, {"Title": "Amazing Potential, Some Minor Complaints", "Author": "Del Mar", "ReviewID": "R3EGHTB3FPVDZ5", "Overall": "4.0", "Content": "To start, I'll offer you my calibration settings I found on the AVS forums, copied over from Cnet's site:--Picture menuMode: MovieBacklight: 12Contrast: 92Brightness: 45Sharpness: 0Color: 48Tint: G50/R50Screen adjustment submenu:Picture Size: Screen FitPosition: [no change]Eco Solution submenu:Energy Saving: OffEco Sensor: OffNo Signal Power Off: OffAuto Adjustment and Screen submenus: [Grayed out]Advanced settings submenuBlack tone: OffDynamic contrast: OffShadow Detail: +2Gamma: +1Expert Pattern: OffRGB Only Mode: OffColor space: CustomWhite Balance: [see below]10p White Balance: OnFlesh tone: 0Edge enhancement: OffMotion Lighting: OffxvYCC: OffLED Motion Plus: OnColor Space submenu:Red: Red 59, Green 5, Blue 0Green: Red 20, Green 55, Blue 3Blue: Red 0, Green 5, Blue 100Yellow: Red 57, Green 50, Blue 0Cyan: Red 14, Green 51, Blue 55Magenta: Red 50, Green 5, Blue 59White balance submenu:R-Offset: 24G-Offset: 25B-Offset: 26R-Gain: 31G-Gain: 25B-Gain: 2510p White Balance submenu:Interval 1: Red 5, Green 4, Blue 4Interval 2: Red 0, Green 0, Blue 0Interval 3: Red 1, Green 1, Blue 2Interval 4: Red 0, Green 0, Blue 0Interval 5: Red 2, Green 2, Blue 1Interval 6: Red 0, Green 1, Blue 0Interval 7: Red 1, Green 1, Blue 1Interval 8: Red 2, Green 2, Blue 3Interval 9: Red 0, Green 0, Blue 1Interval 10: Red 0, Green 0, Blue 3Picture options submenuColor tone: Warm2Digital Noise Filter: OffMPEG Noise Filter: OffHDMI black level: Normal [grayed out]Film mode: Off [grayed out]Auto motion plus: Custom-- Custom settings:Blur reduction: 10Judder reduction: 0-End Calibration Guide-Note:  USE HDMI PORT 3 --- It makes a huge difference, though I'm not sure why.With that out of the way...Physical aesthetics:B-E-A-utiful.  Tiny glossy black frame with an unnoticeable clear (plastic?) bevel edge.  Against a dark wall, you'd only recognize the screen's edge due to the video images coming to an abrupt halt.  Wide, sturdy brushed-metal style base that's only slightly annoying to put together, though not difficult or really inconvenient.  Screen can potentially have a slight sheen to it, but this time of the year (winter) I'm not getting any direct sunlight on it.Image Quality:Amazing picture.  Vivid colors, deep dark blacks, bright, light whites.  Really, truly phenomenal, whether in a brightly lit room during the day or midnight darkness.  I did notice some very minor motion blur in the bottom middle of my screen, maybe 2-3 inches wide at times, but the images that blur there are usually complex items (say, a cell phone with buttons showing).  No noticeable flashlighting, no recognizable edge-bleed. Netflix streaming HD movies look amazing, and HD channel broadcasts are stunning, be they NFL football games or a show on TNT like The Closer.  I've been going through, rewatching older movies, everything from Indiana Jones and the Temple of Doom to 2009's Star Trek, and they all look phenomenal, regardless of their source (DVD, streaming, or television).Controls & Settings:Auto-adjusts picture for cable channels, has a mountain of visual adjustments (see top of this review), great remote overflowing with options, and easy to follow guides.Sound:Rating sound, this Samsung would probably receive 1 star from me.  The vertical speaker bar (built in, obviously) runs along the top back of the unit, projecting its empty sounds against the wall.  In an enclosed room you may manage to pick up decent sound through wall-bounces, but for anyone without a component system, you'll have the volume turned waaay up, just to hear characters effectively speaking in the next room.  If you don't have a component system, expect to shell out anywhere from $50-$300 for an audiobar to direct sounds toward you.General Negatives:  Sound is horrible and some/most of the Samsung audiobars will not work with the Samsung television remote.  Were it not for the Harmony One remote I purchased, I'd be stuck using an additional remote.  3d-capable screen, but no 3d glasses included.  Setup isn't difficult, but image quality suffers if you're not running general video through HDMI3.  A lot of people miss that.  Additionally, you'll have to spend around 75 bucks to purchase the Samsung Wifi adapter if you wish to update your software or firmware.  I believe the wifi also controls most of the smarthub content... so keep that in mind if you're planning on using Netflix, Pandora, or other services through your television. Between sounds and wifi, you're looking at a potential $300+ added to the cost of the television if you want to really enjoy it for all it's worth.Overall though, I really do love the UN40D6400.  4 stars.", "Date": "December 27, 2011"}, {"Title": "Great picture! Audio sync problem in some situations when using a home theater & doesn't always handle fast motions smoothly", "Author": "Lynn", "ReviewID": "R1MBN6TUXV61NH", "Overall": "3.0", "Content": "The Samsung UN46D6400 replaced our 42\" DLP. We have a limited space for this TV; because of the ultra slim bezel, we were able to purchase a larger TV. This 46\" TV is only 2\" longer than the 42\" DLP it replaced. We love the clear picture & didn't have to make any adjustments to it. We purchased the Samsung WIS09ABGN LinkStick Wireless LAN Adapter so we could access the internet w/o using wires. The stand was easy to put together. We didn't have a table to lay the tv on while attaching the stand; so we put the tv on the box it came in & had no trouble  attaching the stand. The manual off/on button along with a few others are on the back of the TV. If the tv is on &  you put your fingers in the correct place behind the tv, the buttons show up on the front of the tv.  The button you're touching will have a  glow around it.On poorly produced 3D movies, I sometimes see a ghost image, otherwise 3D looks great to us. The 3D depth can be changed. Apparently everyone sees it differently.  One person might see the image pop out very close to them...another person will see the image pop out, but not as far. 2D to 3D is a fun option. You can watch any program in 3D using this feature. It's not as good as a movie that was actually produced in 3D...so don't expect a lot. I'm told watching sports using 2D to 3D makes the game more exciting especially the close-ups.There are several apps to choose from, many are free.  If you don't have the 'Explore 3D' app (in the Smart Hub), be sure to update your tv. I used the remote - Menu - Support - Software Upgrade.  Currently Samsung is offering free 3D movies & some 3D music videos through this app. I played around with other apps for a while &  I think they're fun, but I'll probably use my laptop for the internet. By the way, this tv does not have a web browser nor does it have Skype.We don't have any blurry spots, color leakage or any problem around the edge of the screen that others have mentioned. When the screen is dark, it's all dark...no problems whatsoever, and black is really black.  The screen is glossy & does cause a bit of problems in our bright living room. We see reflections when the screen is dark or when it's mostly one color.  So far, no one has complained...not even me...and that's saying a lot.The 3D active glasses are lightweight & fit over our eyeglasses. We rec'd two pairs free, and I purchased 2 used, like new pairs, from Amazon sellers. So far we haven't experienced any problems. You won't want to work on the computer & watch a 3D movie at the same time because the glasses will cause a flickering effect. I even see the flickering during the day when I look out the window. Supposedly, the batteries will last 80 hours.We purchased theSamsung Electronics HT-D5500 Home Theater System to go along with the tv, a 3D BluRay player is included with this sound system.  Recently we tried the sound system while watching a tv program. I usually multi-task while watching tv; when I looked up, I couldn't believe what I saw. The audio was not in sync with their mouths.  We turned the home theater & the tv off, started them again & the problem cleared up...that is we thought the problem cleared up...after a few minutes the audio slowly got out of sync again until it was obvious to everyone watching that their mouths were moving but the words weren't the same. We put up with it for a few minutes & just when we were going to turn off the home theater, the audio was in sync again. The system corrected itself. We'll test this more as the days go by to see how much of a problem this is.We didn't experience any lag or problems when we played Wii. When we play Kinect, I'll add that info. Update: We didn't have any problems when we hooked  Kinect to this TV.  Gameplay was great.Except for the lip sync problem, we don't have any complaints about this tv...except, I wish we would've purchased everything from Amazon. The prices are much lower...I would've gone up a few model numbers too. (read the comments for more on the audio/lip sync issue)I'll continue to update my review with any findings.Audio sync issue takes my star rating from 4 to 3(after searching the web, I'm beginning to think this is a common problem with home theaters and television)Update: A few weeks ago, I tweaked the 3D settings so the images would pop out farther. Not everyone sees 3D the same; as a matter of fact, part of the population can't see in 3D at all.Update: We've owned this set about 4 months now. I am noticing that in some instances  fast motions will be jerky. It doesn't always happen, & it doesn't bother me, but I thought I'd mention it.  My hubby doesn't notice it.", "Date": "June 30, 2011"}, {"Title": "Great Looking TV", "Author": "blue 9 yun", "ReviewID": "R3EINEEZ652RK7", "Overall": "5.0", "Content": "Pros: Great picture quality out of the box, super slim bezel, SmartTV apps are good but somewhat limited.Cons: It should have come with built-in WIFI.I didn't buy Samsung's expensive LinkStick, instead got a Asus WL-330GE working as a wifi adapter(it's 4-in-1 router/repeater etc.) which is working out great for me: cheap, light weight, and can be powered by USB.", "Date": "May 23, 2011"}, {"Title": "Important for ALL Samsung TV buyers!", "Author": "P. Aynesworth", "ReviewID": "R4H6B4OZBU6ZV", "Overall": "5.0", "Content": "Something people buying this set should know, and I believe that this applies to all of the Samsung tvs, and that is that these sets come with a default \"eco\" setting that can cause the set to DIM after being on for some time as an energy saver. This happens while you have been watching it for some time and by itself. It ONLY happens on the \"standard\" picture mode, which is also the default setting as it is shipped. So, if you happen to buy a Samsung tv and watch it for a while and the screen starts to flicker a bit and go darker, don't panic! Simply go to MENU on the remote, then SYSTEM, then ECO SOLUTION, then ENERGY SAVING and turn the ECO SENSOR OFF. You will see that it's ON by default. Bingo...problem solved. Now you can use the standard picture mode with no problems. Amazon is aware of this situation now and I confirmed this with the Level 2 techs at Samsung. I hope this saves at least one person from sending the set back thinking it is defective. It's not. This set has a beautiful picture and is everything I had hoped for.", "Date": "January 10, 2012"}, {"Title": "BEST TV FOR THE MONEY", "Author": "MrMoston", "ReviewID": "R28PVH0NUBXW9S", "Overall": "5.0", "Content": "Boy was i like a kid on christmas when the UPS guy showed up with this baby. When it came in the door i was SHOCKED at how slim the box was AND THATS JUST THE BOX ! After unboxing and set-up, i was instantly sure i had made the right choice. You'll hear me repeat over and over again how nice this tv is and im sorry but i need to get my point across :) The super slim bezzle or edge is great. Picture quality is stunning, colors pop and although the 120hz auto motion plus isn't for everyone, it's still spectacular. On that note i have to say, after reading so many comments from people who dislike the auto motion plus (or soap opera affect) i think it's important to note that turning all the setting to the max will look odd...it's not meant for that. i have my blur at max but my judder at only 4 or 5....i find it needs to be adjusted based on programming.  My one and ONLY gripe is that it doesnt come with 3d Glasses.....i know it's not a huge issue but you think paying that amount for a tv they'd be able to throw in some $40 glasses no? One more thing...not a con just a point....BUY THE QWERTY REMOTE ! it is a royal pain trying to use T9 on the SMART Hub.Im sure i've missed a lot but there's to much to talk about.... it's a fantastic T.V for the money.", "Date": "May 9, 2011"}, {"Title": "WOW......what a nice TV", "Author": "colleyrj", "ReviewID": "R3PJXBDZJIF4FZ", "Overall": "5.0", "Content": "Recently purchased this tv after having a projection for the last 11 years. The tv is very nice, very sleek looking, exceptional picture clarity and very lite.Pros:1. Very thin2. Picture is clear, vivid and bright3. Can watch from any angle4. More than enough HDMI and USB plug ins5. Smart Hub is a nice featureCons:1. When you first start watching the picture seems as though your in the show, it is very unsusal because the picture is so clear.2. Slow to respond when swapping functions3. Speakers are very small", "Date": "August 11, 2011"}, {"Title": "2 Free Pairs of 3D Glasses", "Author": "tigermurphy", "ReviewID": "R23KHX3MY2MF9G", "Overall": "4.0", "Content": "I had read a press release that Samsung would be including 2 free pairs of 3D glasses with all of their 3D enabled TVs purchased after April 24, 2011.  So I was disappointed when I ordered this TV from Amazon, but the free glasses did not come with the set.  When I wrote to Samsung customer service, they told me to take the issue up with Amazon, even though I had a feeling it was more Samsung's fault than Amazon's.  Fortunately, a few days later I saw that Samsung has set up a website for people to get their free glasses who didn't get them from the retailer where they bought their TV.That website is: w w w . s a m s u n g . c o m / u s / 3 D g l a s s e s(I don't think links are allowed in Amazon reviews, so hopefully that displays properly above. Just remove the spaces and it should work)Overall, I'm very pleased with this TV.  The picture quality is great, as well as the design of the set.  However, when there is a nearly all black scene, like during credits, I can see that the 4 corners of my set are a little bright.  I can usually only notice it when all the lights in the room are off and the scene is very dark.  I can be pretty picky, but it really doesn't bother me much.  I was also concerned about how reflective the screen is.  I got used to that pretty quickly and it doesn't bug me much, but could be a problem if you have bright light sources in front of your TV.When I first turned the TV on, the sound quality was pretty lousy.  But turning on \"SRS TruSurround HD\" in the Sound Effects options makes a world of difference.  It's still not fantastic, but it's not bad.  I'm considering buying a sound bar to go with the TV, but after turning that option on, I'm not in a hurry to do so.Overall, it's a great value for the money.", "Date": "May 30, 2011"}, {"Title": "For the money the best 3D 46\" TV you can currently get", "Author": "User PN", "ReviewID": "ROGHK4ERZI55J", "Overall": "5.0", "Content": "I purchased this TV two weeks ago and the picture is really awesome. As already mentioned by some other reviewers the edge backlight technology has some drawbacks, which means if you are looking at the full black screen, there are some light blury spots at the edges. However, when watching TV or a movie you will not find these disturbing, because you will not be able to see unless the full screen is black. You can always dim the light intensity and they will nearly disappear. But the powerful light is just a strength of this TV. Even watching with direct sunlight shining on the screen is possible. And the black is the darkest black I've ever seen on a TV with LED or LCD.I did buy the 3D glasses. Got them from Fry's for $150, the package of 2 including the 3D movies Shrek and Megamind. I guess they also recognized that the full price close to $500 is way overdone. They also reduced the prices for single glasses. And this is really nice. With the bluetooth technology I did not even once experience any outage, it's just working smoothly. And the 3D effects are stunning. Yes, the TV can also calculate 3D, it works, but is not as good as real 3D directly from disc. The TV calculates the different layers, but objects would appear to be somewhat flat. Nevertheless, with the right movie this is great fun. 46\" is big enough if you can sit about 8ft away from the screen. Otherwise you should go for the bigger size.I can only recommend this TV. There might be even better ones but only for much more money. But then, why not buy a new one after some years, using the saved money, and getting always the best technology? I am using an Oppo BDP-93 for playing 3D Bluray. It matches perfectly.", "Date": "April 25, 2011"}, {"Title": "Samsung 55 inch 1080 HDTV", "Author": "Marte", "ReviewID": "R13DA9DAIGCOL3", "Overall": "5.0", "Content": "The picture is very clear and detailed. The flat screen is super thin and looks great mounted on our fireplace wall. I wondered whether there would be glare from our window on the screen. There is not any glare. I'm very pleased with my selection.", "Date": "June 6, 2011"}, {"Title": "excellent buy", "Author": "billy", "ReviewID": "R2RQMKP6Q1PPO1", "Overall": "5.0", "Content": "Amazing picture quality especially with HD movies. Very good design considering the very thin bezel and extremely thin profile. The sound quality is good enough for watching regular TV programming.The only thing i would like samsung to do a better job on is the included product user manual w/c is very short and is not written in very good english (some minor mistakes in grammar and sentence construction).As always, extremely good customer service from amazon.com. TV arrived as promised through super saver shipping and I was able to avail of thier low price guarantee. Customer service is very quick in responding and resolving all my concerns regarding this order.", "Date": "June 30, 2011"}, {"Title": "\"Biutiful\"", "Author": "Khmer", "ReviewID": "R3CVK7HJ0L6TEG", "Overall": "5.0", "Content": "Yes i know i misspell that, anyhow, i wanted to write this review mainly beceause there is no other one and beceause i am completly satisfied with Amazon and Paul tv's. I bought two of these from Paul's tv's fullfiled by Amazon, they arrived just in time, well 1 day later than schedule but just in time for my plans.I decided to upgrade my tv set from my not too old Vizio 42 inch 120 hz to this one after a visit to a SAMS store, they had like 10 TV's from different brands, this one on a 55 inch model next to a Sony 55 inch, the Samsung was far better than the Sony image wise, on that moment i decided samsung was the way to go, then i saw some 60 inch models from other brands like sharp and other, so i also concluded that 60 inch was the way to go, so that is how i decided to buy this samsung un60d6400 model, one for my self and one for my brother.I never understood the concept of deep blacks at least until now, this tv set has showed me what deep blacks are all about, and boy, they look good.After wacthing Michael Jackson's \"This is it\" for the \"n\"th time i can say that it looks way better in this Samsung than in my old Vizio...I cant wait to receive my new Home theather after the old one burn out within a test going wrong...I can also say,that i never watched dish standard definition signal so well before this tv... not even with the so aclaimed anchor bay 2010 chip which turn out to be a deception, anyhow my new audio receiver was bought on audio basis only and not video chip, athough it states that it has the new Marvell chip, i plan to have all my connections direct to my tv through HDMI. HD from dish looks awesome.I have only wacth one 3d movie, Megamind it looks ok... i need to see more...I have also tested the wired lan conection from the SMART TV. The Rango HD trailer from the smart lan conection looks superb!!!, I dont know why but it looks far better than Dish HD... anyhow 80% of the time i will use this set with my pc trough HDMI so i have access to all the web, but you tube works ok on smart tv, the remote doesnt have a keyboard but i dont care as i am not planning on using this frequently.The TV is so slim that it looks so nice hanging on my wall with an ultra slim mount that i also bought from amazon, great buy also...The TV screen is just 1.5 inches from the wall.Conclusion: i am one happy camper with this tv set,it is not cheap but it worths it.I would recommend this over the sony or the sharp aquos quatron.", "Date": "August 10, 2011"}, {"Title": "Very Very Pleased", "Author": "RCarg", "ReviewID": "RYN45RT2ZQ2D7", "Overall": "5.0", "Content": "Summary: The UN40D6400 series has exceeded my expectations. The display is absolutely beautiful with blurays and gaming has never been smoother.The only issues I have found are uneven back lighting (hardly noticeable except during extremely dark scenes) and ghosting due to blur and judder reductions being too high, and my theory is its slowing the processing down. If you can get past those two small things then I can say you will not be disappointed with this TV. If you can't then keep away.Real Review... kinda :PFirst off I would like to say I have had this TV since Christmas and overall I am very satisfied with this purchase.The Good:Unbelievable clarity and smoothness to Bluray movies and on my Xbox.It is very customizable when it comes to settings for Color, Contrast, all the way up to Blur and Judder Reductions.Ultra thin bezel makes looking at it (even when off) very prettyThe swivel stand works and is very sturdyRemote makes sense (Buttons aren't put in weird places)Many inputs, HDMI and likewiseMany othersThe Bad:I was already aware of most of the not so spectacular things with this TV when I bought it, but there are a few which more picky TV viewers should consider.The first is uneven back lighting. I do believe there is a picture already depicting this. There are some splotches in the middle of brighter light and the corners are also quite bright compared to the rest of the back lighting.The second is Ghosting of some faster moving images. There is also a picture of this another owner uploaded. From what I've found out from playing around with the settings, this can be fixed by turning down the Blur and Judder reductions. So it is basically a processing problem if you have these settings cranked up to the max. The processor just can't keep up, but I am only guessing that is the issue.The third is no tilt on the swivel standAll in all, This TV was worth the $839 I spent for it (yay black friday deals!!). Me and my roomate have guys come in and leave with their jaws on the floor. I look forward to watching this thing for years to come.Thanks for reading,-Ryan", "Date": "January 22, 2012"}, {"Title": "Fantastic!!", "Author": "B.T.", "ReviewID": "R2GO55NKJHPTKH", "Overall": "5.0", "Content": "I purchased both the 46\" and 55\" and each have amazing picture quality as others have attested to. I returned the 46\" and kept the 55\" because of the ridiculous deal on Amazon and the class size fits much better in my living room. Right out of the box the picture quality is quite amazing, but it can be calibrated (as others have also mentioned) for an even better viewing experience when watching different shows. All in all, a great buy for a fantastic TV.-----------------------------------------------------------------------UPDATE (1/10/12)I still find this 55\" TV (UN55D6400) to be absolutely amazing in all respects; however, I have noticed crosstalk/ghosting when watching 3D through my DirecTV-3D channels. It is semi-resolvable through adjusting the 3D Optimizer setting so long as the scene or program doesn't change. Once it does, I am back to recalibrating. I am using the SSG-3100GB glasses and have my directv hdmi connected to HDMI Port 1. I don't recall this issue when I owned the 46\" (UN46D6400), but perhaps it is a result of the larger screen, making it more noticeable. I'm not sure if this is me being oversensitive, my glasses or a display defect. I'm going to give it a few more days before deciding to exchange it.  Still a 5-star HDTV at this point.--------------UPDATE (1/20/12)I received my replacement a few days ago. Amazon was great in shipping it immediately. The new, replacement TV has much better image quality in all respects with virtually no crosstalk/ghosting on 3D. Very happy I made the decision to get a replacement! 5 stars for sure.", "Date": "January 3, 2012"}, {"Title": "Samsung TV", "Author": "islandliving", "ReviewID": "R2QJXEXBD7WTDC", "Overall": "5.0", "Content": "The picture is awesome on this tv and the 3D is also great. You feel like you are right in the room with the actors. I will only buy Samsung tv's from now on. I am very happy with my purchase and the clarity of the picture.", "Date": "July 22, 2011"}, {"Title": "Great TV yet missing a Key Feature", "Author": "JoeT", "ReviewID": "R1AUN6D005UZ69", "Overall": "4.0", "Content": "This TV is wonderful with great picture quality and many features except Wifi. This TV is Wifi ready but never states that you need to purchase a separate adapter to receive Wifi which can range from $55 to $90 more. The model up UN40D6500 has built in Wifi. So just weigh your options and check the price difference and decide on that.", "Date": "May 31, 2011"}, {"Title": "Amazing TV !! You'll Love it !", "Author": "M. Bawazir", "ReviewID": "R2SKCZRW2SKNCS", "Overall": "5.0", "Content": "I don't know from where to start, but this TV is one of the best TV's I have ever seen. First of all, I had to chose between this TV and the Samsung UN46C6300 46-Inch.In terms of price, this TV has a reasonable price as to have a lot of features, which includes Samsung apps. The Samsung UN46C6300 46-Inch has less features and cost nearly the same (I paid $65 extra for this TV which also included 3D compared to Samsung UN46C6300 46-Inch).Its design is also really nice and smooth, it is also really thin which makes also look really nice. You'll get the feeling of a 46-Inch TV once you install everything. If you think you have time, check this TV in person in any store that carries Samsung TV's, it is definitely worth it.The thing that I liked about this TV is the color level specially the black level. Sometimes when you are watching TV you'd think that the TV has shut down! This is how good is the black level in this TV. Also the picture quality is really high (of course by watching HD movies...etc), and really smooth (120Hz), which makes you really enjoy what you're watching.This TV has a good feature also which is converting non 3D movies and videos to 3D (you must purchase the 3D glasses which comes separately), but I must note that non-3D movies will not be the same as actual 3D movies, there will be a big difference, (but it is worth a try to play with the settings of the 3D).Of course there are better TVs out there, but If I would to recommend a TV with a really good quality, features and price, this would definitely be one of them.", "Date": "April 30, 2011"}, {"Title": "Very disappointing.", "Author": "Jennifer_K", "ReviewID": "R1M4CAW8O1H46M", "Overall": "1.0", "Content": "After many trips to Fry's Electronics and some extensive review reading, I broke down and purchased this TV on black Friday. On December 30th (yes, 35 days later) the picture went out. After multiple visits to my home to repair by Samsung techs, and numerous \"I need to order a part so we'll call you to set up an appointment and come back and install the new part\" promises it is still not working. Samsung was supposed to bring out a brand new TV to my home and take the broken one but instead have called several times to say, \"we're ordering the new product today!\" I am still waiting. They refuse to reimburse my cable bill for the month, they will not issue a new, free, warranty for the new product (if I ever receive it). Very disappointing.", "Date": "January 20, 2012"}, {"Title": "Simply Outstanding", "Author": "Michael Richings", "ReviewID": "R3PE9LHQOY54SL", "Overall": "5.0", "Content": "My Wife and I purchased this TV on Cyber Monday through Amazon's daily deals, and we're more than satisfied with our purchase! Astounded is more like it!We were able to pick out the time for delivery (two hour windows - which in itself is fantastic these days) and the delivery man arrived a few minutes prior to the beginning of the time slot. The delivery man was exceptionally polite and helpful and the box was undamaged. Kudos to you delivery man!Right - onto the TV:Wow - just wow.We (sadly) changed out our Panasonic 1080/120hz/42\" Plasma for this Samsung - and I really didn't think LED would compare to the Plasma. But oh boy was I wrong. The slimline design is elegant and sophisticated and looks amazing. It's not all that heavy, so moving and mounting it on the TV Stand was a breeze also. There's plenty of sockets on the back for pretty much anything and everything you need.Turning it on for the first time is just pure pleasure! Hooked up to our DirecTV, and it started on Phineas and Ferb HD show which was as crisp as anything. OK - a cartoon. Young kids - couldn't help it :PWe watched in awe for some time skipping through channels when we noticed (well I did) some blurring happening. No big deal though, as I had read that this could happen a little. I used the settings from one of the other reviewers posted here, and it fixed everything. Out of the box settings are just like that sometimes - everything needs tweaking a bit. Then we sat down and watched James Bond - Quantum of Solace (blu ray), and it was breathtaking.We purchased a Samsung BD-D5500 3D Blu-ray Disc Player (Black) also from Amazon and it was here before the TV. This syncs well with the TV and it's nice to have one remote to control them both without purchasing a universal remote for everything.I also purchased a Rosewill RNX-N1 Wireless-N 2.0 Dongle 02.11b/g/n USB2.0 instead of the Samsung specific dongle and figured I would give it a go. It works like a dream with my AT&T; router and it is much cheaper!The online app's etc for the TV I have messed with a little, and checked out the Netflix which works seamlessly. I also hooked up my laptop just for fun  - and there's nothing quite like having a 55\" Monitor!Basically - this is high end electronics. This thing does a fantastic job and looks absolutely stunning in both design and functionality. You can't go wrong with this TV.I feel less sorry for the Plasma now being retired up to the loft area.", "Date": "December 10, 2011"}, {"Title": "Samsung UN46D6400 LED", "Author": "blacksea", "ReviewID": "R3BKVS40UWIOZF", "Overall": "3.0", "Content": "Nice TV, but my unit's screen had a problem. After 45 min. a blank vertical line appeared on the screen. Samsung replaced it with the same model. The whole process took about 30 days.There are audio sync problems  when I use a receiver.The color presetting is too strong, it's fairly difficult to adjust it to a balanced setting.The 4 corners of my set are a little too bright you can see white spots there.", "Date": "August 8, 2011"}, {"Title": "great tv great 3d quality", "Author": "calchill", "ReviewID": "R3PTZYP7ZUMPQS", "Overall": "5.0", "Content": "Well first off i have only had this tv for a day and so far i have tried everything on it and it's just fabulous. We have directv and with the high def package you  have access to a 3d channel.  I have the standard ssg-3100gb glasses put them on and wow the 3d was amazing.  I saw an earlier comment that someone was saying the 3d is useless, they couldnt be more wrong.  Not sure what content they were watching but it stood out and i let my family try it and make sure they saw what i was seeing.  They all agreed it was great.  Then i put a 3d movie on (tron) and same result  was excellent in every way you'd want 3d.  As for the rest of the options on the tv, smart apps are great more then enough for u to have a good time with, picture quality is perfect in hd and the tv itself is very compact.  For a 1,000 it is defintly a tv worth having anywhere in your house...", "Date": "May 27, 2011"}, {"Title": "Samsung 3D glasses promotion for this set not honored by some vendors.", "Author": "faust \"fausttiger\"", "ReviewID": "R2NRMFSR3BFMSJ", "Overall": "4.0", "Content": "FYI...\"April 6, 2011 Samsung Press Release:  Samsung will provide two pairs of 3D active glasses for its entire 3D TV lineup at no additional cost with the purchase of any Samsung 3D LED TV or 3D Plasmas TV\" However,  some vendors, such as Best Buy, are not honoring the offer on this 2011 TV (and some others)", "Date": "April 28, 2011"}, {"Title": "Great picture, bad elsewhere", "Author": "GearGeek", "ReviewID": "R39K5PUMGGESN1", "Overall": "2.0", "Content": "As other reviews have hit on, this TV set has a phenomenal picture, and makes any input source look spectacular, especially blu-ray.  It's truly top of it's price class for picture quality.  I won't go further into this as other reviews have already covered this topic.Now the bad.  If you are using an external receiver for audio, you will experience a large audio sync problem due to the video lag for the picture processing. This is especially noticeable on 1080p/24 signals from a blu-ray.  Despite claiming to be 1.4 compliant and sporting an ARC HDMI jack, this set does NOT support the \"auto lip sync\" feature.  This means you will be manually correcting the audio delay on your receiver all the time.  This is particularly annoying due to the fact that the TV itself is obviously capable of calculating the delay, since the TV speakers are always in sync with the video, they just didn't bother to support the function.Additionally, if you are a gamer, this is probably not the TV for you.  The video lag is pretty substantial.  \"Gamer mode\" does improve this, but at great cost to picture quality, and there is still a perceptible lag.", "Date": "June 23, 2011"}, {"Title": "Defective product", "Author": "OKC Adonis", "ReviewID": "R2C41B6LJSE302", "Overall": "1.0", "Content": "I have owned the TV for 18 months and it has a thin blue line down the right edge of the TV.  It only has a 12 month warranty so it is out of warranty.  Needless to say I am not happy.  When the TV didn't have the blue line the TV was great.  Obviously if you spend a lot of money on a tv and it has a defect less than 2 years in you won't be happy.", "Date": "November 11, 2013"}, {"Title": "Did not last the 2 Years", "Author": "Luis Spagnuolo", "ReviewID": "RCZLTAHL3RYKN", "Overall": "1.0", "Content": "Beware all interested people in this Tv, it is very important to view all reviews of products before buying them. I am writing this review 18 months after buying this product. If you read the rest of the reviews fro this Tv, you will definitely see that other buyers have had issues with this Tv as well. My problem basically started with the display pannel as it lost a few pixels in the upper part of the screen. Didn't give it too much importance, until 2 weeks ago that the screen dissapeared completely. I have no image display at all, and the warranty for the product is for 1 year so Samsung won't take responsability for this. So of you read other reviews, you will see that this has happened oftenly with other buyers. Good luck with your purchase", "Date": "October 15, 2013"}, {"Title": "Not even 18 months!", "Author": "James", "ReviewID": "RKPF210EV87TL", "Overall": "1.0", "Content": "For the first time I bought a Samsung product after a lifetime of using Sony.  I bought this unit in May 2011 and in less than 18 months use as a secondary unit it has failed! The power keeps going on and off and Samsung says that the only thing that can be done is to have it serviced? How can their not be a reset to factory settings option on the TV?  All I can say is that I will be going back to Sony.  I know they cost more but they last forever!  I would recommend that if you are thinking of purchasing a Samsung TV, make sure you set aside extra money to take care of the repair costs that are sure to come in the first couple of years.Update:  I called Samsung support after no luck with the live chat and after explaining the situation, they stood behind their product and will cover the repairs.  This gives me a lot more confidence in the Samsung line.  I still wish I didn't have this issue after 16 months of owning the TV but I am glad that they are backing their product.", "Date": "November 2, 2012"}, {"Title": "Take the time to tweak it", "Author": "tourists", "ReviewID": "R3JT7QX4ZDSVCZ", "Overall": "5.0", "Content": "As of this writing, we've owned the 46-inch version of this set for exactly 5 months and have used it continuously for a few hours almost every day.Although I've given it a 5-star rating, on an absolute scale, the picture quality is probably a 4 or 4.5, mainly because I've seen a Panasonic plasma GT50 series set with an arguably more accurate picture. However, the latter wasn't available in 46-inches (the largest size we could accommodate) and the presentation was too analytical to enjoy watching. By that I mean, on newscasts, live studio presentations, and the like, you could easily see how the total image was composited from various sources (which I found to be distracting), while the Samsung presented everything as a seamless whole.In reading over past reviews of the Samsung LED models, you'll notice random criticism of uneven tones, especially during dark or black scenes, as well as \"flashlighting\" -- the appearance of light shining from the corners during dark or black scenes. We've experienced absolutely none of these. Either the quality control has improved or there have been design upgrades or we've been lucky. Most of those complaints seem to date from 2009, so hopefully the absence of these issues was more than luck.Regarding color, with a cable set-top box (STB) the set was quite viewable out of the box at the factory defaults. However, it still benefited from following the c|net recommendations reprinted in other reviews. A major caveat, though, is that every input source has to be independently adjusted and then tweaked even further.For example, while the c|net settings were pretty close for the STB, the contrast was way off for a pair of DVD players (a Toshiba and a Denon) and our PVR (a homemade Tivo, based on a PC) also needed it's own settings that differed from the others. Ditto for a vintage Pioneer LaserDisc player. It helped to have a set of Red, Blue, and Green filters from the Video Essentials DVD to optimize the color and contrast. The set's built-in test patterns were also useful. Take nothing for granted -- you really need to experiment to get the right settings. There are literally dozens of menus and sub-menus that give you a an amazing (and confusing) amount of control over the image quality. Get them wrong and you'll wonder what all the fuss is about. Get them right and you'll marvel at the superb quality of this picture.Speaking of of image quality, DVD and HD cable channels are clearly the best sources. The lower channels (2-128) really suffer, as do non-HD PVR recordings and, surprisingly, LaserDiscs. We don't have a Blu-ray player, but expect the quality will be high with that, as well.Further thoughts -- It only took 20 minutes to unpack, assemble, and start watching. The first thing I did was to upgrade the firmware via our home network. Every room is hardwired with RJ-45 outlets and the upgrade went smoothly. However, I've been warned that future firmware updates will wipe out all custom settings, so be sure to keep a log of every input adjustment you make.My only real pet peeve is the inability to put your own remote control labels on each input source. There are a hand full of default names to choose from, but LaserDisc Player (among others), is not one of them. Otherwise, the remote and menu are among the best I've ever used.Beyond that, as many people have commented, the visual presentation, in which the picture seems to float in mid-air, is a big plus. We've never liked sets that have wide bezels and, considering what a visual element a wide screen TV is in any room, it was worth spending the extra money to get a set with a minimal border and clear supporting pillar.To sum it up, when properly tweaked, this set really gets out of the way and allows you to enjoy your movie or show without feeling distracted by the equipment.", "Date": "August 8, 2012"}, {"Title": "Amazing TV from all angles!", "Author": "MJ", "ReviewID": "R2RYXBH9YR7WYR", "Overall": "5.0", "Content": "Review is after 2 weeks of use, approxmiately 4 hours a day, utilizing HD-Cable service, bluray, and Hulu+ via the TV's SmartHub.Pros:+ Amazing picture and brightness.  The first test I ran this through was the first 20 minutes of Casino Royale bluray, as it would test all the colors and motion.  One word to sum it up would be \"stunning\" -- as my old man put it \"I never realized just how blue Daniel Craig's eyes were...\"  (He then proceeded to demand the model # of the TV so he could order it.+ Nigh-bezeless display - Its hard to explain why this is important, other than that certain je ne sais qois of not having one. It gives the tv a 2500$ luxury feel despite being much less.+ Inputs inputs inputs!  I am utilizing a mini display-to-HDMI, sound-bar HDMI, bluray HDMI, cable HDMI and still probably have some to spare!  There are even two USBs.  Not sure why you would need this but still pretty neat.Cons:- Kind of have to stretch this since there aren't any glaring weaknesses, but I wish all these SmartHub TVs came with a QWERTY remote because searching for stuff on Youtube and Hulu can be a pain with the d-pad and enter button.- SmartHub could be a little snappier.  I suppose given this is all cloud computing its to be expected that the response can drag a bit, especially when loading apps.  Still, I can dream right?", "Date": "January 23, 2012"}, {"Title": "Another Great Samsung", "Author": "KC", "ReviewID": "RQ7INC624SHAU", "Overall": "5.0", "Content": "This is our second Samsung TV purchased from Amazon. Samsung keeps making their products better and cheaper, which is the curse of the electrical engineering business, as confirmed by all of my former students (I am an EE professor). I did not intend to purchase a 3D TV and may never take advantage of this functionality, so this review applies only to 2D. My wife and I like it very much. It is a beautiful design with a clear, bright image that is easy to watch in our sun room with windows on the east, south and west. We were even surprised by the quality of the sound. My only complaint is not a big thing. I ordered this as a surprise Christmas present for my wife. Unfortunately, it was delivered while we were out running a couple of errands and ended up in front of the door of our condo where she saw what it was. It was still a surprise, but I had an elaborate scheme worked out where we would use it to Skype with one of our daughters so we could open presents together. This was the first year our daughter was not able to join us for Christmas. Of course our Skype experience also showed that it works well as a computer monitor.", "Date": "January 4, 2012"}, {"Title": "Very pleased!", "Author": "R. Tripp", "ReviewID": "R1KA2VTEIQKU8O", "Overall": "5.0", "Content": "I have been a Samsung owner for a number of years and have always enjoyed the quality of construction and design in previous models.  The Samsung 6400 was purchased just in time for Thanksgiving and all I can say is that Samsung did not disappoint.  It has an amazing picture image right out of the box with brilliant colors and excellent contrast even in a well lit room.  What is also remarkable about the TV is how thin it is.  We used the Samsung wall mount system that treats the TV set like hanging a picture.  Surprisingly lightweight and looks terrific mounted on the wall.  Very pleased with the purchase.  My only disappointment is that WiFi is not built into the set but requires the Samsung wireless adapter.  A small price to pay in my opinion.", "Date": "November 30, 2011"}, {"Title": "Excellent TV", "Author": "Jet", "ReviewID": "R1484MBJ9L2MAK", "Overall": "5.0", "Content": "We purchased this Samsung TV from Paul's TV via Amazon. It was the best price we could find and the shipping was free, well packed and arrived quickly. We are very pleased with the picture quality and all the features tha TV has available. Would not hesitate to buy from this source again.", "Date": "August 21, 2011"}, {"Title": "Amazing product", "Author": "sntennis", "ReviewID": "R11TK0M6WHN594", "Overall": "5.0", "Content": "I really love this TV.  The stand is great, it is light, think, strong, brilliant color.  I would buy it again.  Got a great deal on here as well.", "Date": "July 29, 2011"}, {"Title": "So close to being great, if not perfect", "Author": "W. Rivera", "ReviewID": "R1TTW69A4J7UST", "Overall": "4.0", "Content": "It was between this model (Samsung UN40D6400) and the LG 42LV5500, which at the time of purchase was similarly priced. I chose this model simply because of the slim .5\" all-around bezel; it surely affects your viewing experience (the slimmer the bezel, the better). I absolutely would give the tv five stars if it wasn't for one simple flaw: it does not come with the Amazon Instant Video widget. I prefer to use AIV over Vudu or any of the other included streaming services. I read somewhere on a forum that apparently some models, depending on their manufacturing date, do come with the AIV widget. I contacted Samsung and they informed me that AIV was not compatible with my particular model. It's basically another gimmick by tech companies to force you to buy higher-end models. You'd think that paying almost $1,100 for a television would get you a simple MAJOR streaming service such as Amazon Instant Video. I considered returning the tv, but the return period had ended. The tv is great nonetheless; Samsung not including AIV in this model, from a consumer's point of view and a techie's POV, is blasphemous.", "Date": "May 29, 2011"}, {"Title": "Amazing quality/Technology still nascent", "Author": "S. Rajan", "ReviewID": "R1R5GTEHWURJQH", "Overall": "4.0", "Content": "I have this TV for over a week, I am like a bull in a china shop exploring the features of the TVThe TV HD quality is amazing, I have basic cable with only the basic HD channels, got this TV for accessing content via internet. I had to invest in a Linstick,the Samsung USB adaptor for net access, it is pretty much plug and play but my 802.11g router was not fast enough particularly for 3D channels, had to invest in 802.11n after which access to the SmartHub improved a lot. The apps available in the SmartHub are quite a bit but expect for the movie channels (Vudu, Netfix, Blockbuster, CinemaNow, Huluplus) rest of the content is still ordinary however emerging, with all the reviews I have read Samsung TV apps are ahead of other brands. I intend to use the TV primarily accessing high quality video and streaming content from the web and will not mind paying per view if the content is good, I hope Samsung continues to lead the pack with contentFinally watched the 3D movies with the 3D app- the quality is astounding, the technology is still new and with the active 3D glasses what they are able to achieve is quite good, watched it from 10ft distance, the Grand Canyon and the dinosaur movies- though it was not a IMAX experience it definitely was a decent 3D experience. The sound quality in 3D mode was poor as the audio setting changed to Low 3D but maybe I needed to hook the TV up with additional speakers.The value this TV provides vs. peers has to be the best, if the apps content keep improving this might be the way I will watching all TV/internet content, bye bye 22\" screen and sitting in front of the computer!", "Date": "July 16, 2011"}, {"Title": "Don't buy this TV", "Author": "L. Hartley", "ReviewID": "R2N2XBIE7OQA86", "Overall": "1.0", "Content": "Don't buy this TV!This TV had and I stress HAD a beautiful picture and after 19 mos there's no picture.  We went online with Samsung and did some troubleshooting, etc.......no warranty after a year and we are out of luck.So we are hauling it off to be looked at......may not be pretty.", "Date": "November 26, 2013"}, {"Title": "Loved this TV until...", "Author": "HyT3kR3dn3ck", "ReviewID": "R1JKUW4BPNILVC", "Overall": "1.0", "Content": "I got this TV less then 2 years ago and it has been fantastic.  Great picture,  sound and features (love the Internet enabled features but disappointed that you had to buy a wifi adapter for it; that should have been built in).  However at less than 2 years old it broke.  Was watching TV one evening and the picture went blank but sound continued to work. Called Samsung went through some basic troubleshooting questions and they said that they weren't willing to help me because it was outside of the measly 1 year warranty and it would need to be repaired at the cost of 600 - 1000 dollars.  The TV was never mistreated. I'm highly disappointed in Samsung's quality, warranty length (i don't care if that is the average length warranty,  if you have quality products back them up accordingly) and their support.  If you get this TV beware and make sure to get the extended warranty.", "Date": "June 27, 2013"}, {"Title": "Samsung tv", "Author": "Hawgman", "ReviewID": "RD77PWL6CX0IK", "Overall": "5.0", "Content": "Received the TV on time and in good shape. The picture quality is outstanding straight out of the box. I'll probably tune the contrast settings but will wait for a rainy day when I have nothing else to do. For now, the picture is great.", "Date": "June 2, 2012"}, {"Title": "gorgeous picture", "Author": "Ernest J. Lunsford", "ReviewID": "RCKYW76EFEI5Z", "Overall": "5.0", "Content": "I love this t.v.! The picture is sharp and clear, the colors are true, everything about it is first-rate. Highly recommended.", "Date": "May 27, 2012"}, {"Title": "Beautiful 60\" led HDTV", "Author": "Vladzilla", "ReviewID": "R1U7W5NKZX3KQ3", "Overall": "5.0", "Content": "If your couch is 12 feet away from your tv like mine is,  you can't go wrong with this 60\" led. Is as thin as my Android phone and has a clear frame which allows your wall color to show through - ultra modern design. I did my research and looked at a ton of tvs in this class. Nothing comes close to the picture quality, and the price is low compared to other tvs of this size and quality. Smart TV is a little quirky but it mostly serves its purpose. All in all its a great buy.", "Date": "May 27, 2012"}, {"Title": "Upmost Clarity, But Still has issues", "Author": "J. Veenker", "ReviewID": "R3AYHZAJ7ZQEOL", "Overall": "5.0", "Content": "The Clarity on this T.V. with HD T.V. Shows, Blu rays, DVD's and Video games, is great. HOWEVER, There are some ghosting issues with the 120hz on, I find it to be minimal, but for a keen eye, can be annoying. With that being said, you can turn down the 120hz or turn it up depending on what you're watching. It works extremely well. The 3D works fairly well actually with the 2d to 3d on my blu ray player doing the conversion, as well as the T.V. generating it on the spot. Playing Battlefield 3 with the 3D, I could tell that it was 3D, but, not to the same level as you see in the movies made for it. Overall, this is one outstanding T.V. The Remote is nice, the stand is nice, My friends can't believe how great my t.v. looks even compared to their new Sony's and other brands.Pros: 2d to 3D for movies works fairly wellClarity, AmazingEasy to use menutouch sensitive buttons in the back that glow on the screenNavigation on smart t.v. easy to useblu rays = awesomeCons:Minor Ghosting with 120hz2D to 3D on Video games- so-so (to be expected)I've owned for appox 5 months now.", "Date": "March 26, 2012"}, {"Title": "Best picture I've seen in TVs, 240 Hz works!", "Author": "Paul Mos.", "ReviewID": "R1HF166B1FD9E1", "Overall": "5.0", "Content": "Very nice picture, acceptable sound. The initial reason to buy was very narrow screen frame, which allowed us to squeeze the unit into the space we had. \"Smart\" features are somewhat slow to \"boot\", but works just fine: Netflix, etc.", "Date": "February 24, 2012"}, {"Title": "Wonderful TV", "Author": "Sam", "ReviewID": "R2LZCUAZIXVZPW", "Overall": "5.0", "Content": "I bought this TV after researching LEDs for over a month.  I am very happy with it.  I also bought a Samsung Blu-ray player w/ WiFi at the same time.  We don't have cable so we just use the LED TV for Apple TV  and Blu-ray w/ Hulu+.  The 3D is OK, but I bought it for the thin bezel.There was a setting that I needed to change in order to get some \"ghosting\" or \"lag\" to disappear.  The reviews here helped with that.Update:Almost 2 years later and I'm still very happy with this TV.  Use the \"Picture Perfect\" tutorials from AVForums to help you choose the right settings for your home.  It ships with \"showroom floor\"-ready settings which aren't ideal for home viewing.", "Date": "February 15, 2012"}, {"Title": "Amazing TV, Great for gaming, movies, and television!", "Author": "Wayne R. Bruce", "ReviewID": "R3T49Q5FX4BJ77", "Overall": "5.0", "Content": "I highly recommend this LED tv.  Did much research on LEDs before purchasing.  The 3D feature was secondary, in fact, at the time of my purchase the non-3D version was more expensive.  I have not used the 3D feature yet so I cannot comment on that.I use this tv for movies/cable/games.  It makes me want to re-watch all the great movies I have already seen but in HD/Blu-ray.  Games look amazingly sharp and clear.  I play many FPS shooters and have yet to see any blurring.  The refresh rate and contrast ratio were the main factors in my purchase.I love the thin bezel.  Makes set extremely attractive, like one big screen window.  I use a 5.1 sound system connected via optical, but the native speakers are very respectable.The viewing angle is not an issue at all with this tv.  Image looks great at all angles.  The screen is glossy, so it will reflect light.Blacks display true, no bluing.  The edge lighting is only noticeable when all lights are out and when watching dark images.  Even then, it's not very noticeable.  In normal lighting conditions it's completely unnoticeable.I have never been disappointed with Samsung monitors/TVs, make quality products.  Completely satisfied with my purchase, would recommend to a friend.", "Date": "December 28, 2011"}, {"Title": "Superb", "Author": "Lenny", "ReviewID": "R3D8MTRZFVIAV5", "Overall": "5.0", "Content": "No problems so far.  Picture quality is excellent, as long as the source is up to it.. my low def analog cable doesn't look especially awesome, but digital sources and HD video do.  The 3D is better than I had expected, in my limited usage of it.  Currently just have 1 PS3 game in 3d, but it's pretty cool.  The built in converter feature is good, not infallible.  Some shows/games work well with it, others not so much.  COnsidering my cable TV quality, I mostly use it for Netflix, Blurays, or connected to the computer for streaming.  I'm using a cheap DVI->HDMI converter and an HDMI cable for this, works fine.", "Date": "December 12, 2011"}, {"Title": "Gorgeous picture!", "Author": "Jlange \"Music Lover\"", "ReviewID": "R1W4LY6S974KWH", "Overall": "5.0", "Content": "I've just installed my first HDTV, the Samsung un40d6400; this replaces a 9-year-old Samsung CRT. I chose a Samsung because I and some friends have always had good experience with them. I got this model because it is so good-looking even when the picture is off! That was important, since this TV will not be hidden behind entertainment center doors like the old TV: it will always be 'on display' in my living room. I love the very thin bezel, much nicer than the thick frames on some flatscreens. I debated about a 46\" TV, but my living room is small. This 40\" TV is perfect. Instructions to assemble the base were clear. The flat base is very wide and seems quite stable; I was worried my cats would knock the TV over, but I don't think they can with this base.When the TV was first connected to my AT&T; U-Verse box, the picture was terrible: it was standard definition. After I upgraded to the HD signal (another ten dollars per month please), the picture was much better but not great. Then I reset the U-Verse box to deliver 1080 instead of 720, and the picture is simply amazing! It is awesome! I now understand what all the fuss about HDTV has been about.As always, Amazon delivered promptly. My only complaint is that the price dropped $50 between when I placed the order and before the TV got delivered. Amazon won't adjust the price on a TV.", "Date": "November 22, 2011"}, {"Title": "I'm picky about image quality, and i like this tv a lot", "Author": "Mark Kawakami", "ReviewID": "R14XA8W4EDJ735", "Overall": "5.0", "Content": "I ove this television. The image quality is great, I was able to run advanced calibrations on it easily, with lots of room above and below ideal white and black, so I'm not getting any clippied whites or muddled blacks. The TV itself looks great,  super thin, tiny bezel, etc. The viewing angles are very good, 3D works well if you're into that sort of thing. I wish wifi was built in so I wouldn't have to connect to my network over Ethernet (don't feel like springing for the wireless adaptor).My biggest complaints are that the advanced picture options (many of which I have turned off or turned down) aren't described very well, so if you're picky about getting the best possible image and motion quality, it's hard to know what each of the various options actually do without a lot of trial and error. But on the upside, they have an on-screen manual, which is very helpful.", "Date": "October 16, 2011"}, {"Title": "Owned for 3 weeks and love it", "Author": "David Breuer", "ReviewID": "R23MIZE5JK2PD", "Overall": "5.0", "Content": "I have owned the UN46D6400 for about 3 weeks and love it. The picture is gorgeous, the setup was easy and it plays very well with the Samsung D6500 series Blu-Ray I purchased at the same time. I really like how close the picture comes to the edge of the TV. I am using the TV with basically no changes to the 'out-of-the-box' settings except that I set the AutoMotion to the \"Smooth\" setting which I love. Some reviewers say they aren't a fan of this setting. I believe that it takes a bit to get used to, but once you start watching the TV this way, you will really like the smooth, 3-d feel and continue watching your TV this way.For the price I paid, I believe this TV is a wonderful value and will make your family and friends pause and open their mouths when they see a high quality blu-ray or other 1080p images. The TV & blu-ray are connected directly with an HDMI. The two devices communicate with the BD-Wise setting that I believe is specific to Samsung. The remotes are basically interchangeable and the Blu-Ray movies look fantastic.The sound is excellent for such a thin TV. I can't find anything mediocre or negative to report. It is quite easy to change the TV's settings and then set them back to the 'out-of-the-box' default if you want to know where the settings once were.Initially, I was going to buy the UN46D6000 instead of this TV because it received many more 5-star ratings on amazon.com. However, once I looked at both of them in the store, I went with the UND6400 TV (only $150 more for a better overall picture and 3-d capability). I can't comment on any 3-d capabilities at this time as I don't own any glasses.In summary, I think this TV deserves more 5-star ratings based on what you get for the money. Happy hunting,", "Date": "October 14, 2011"}, {"Title": "Good product", "Author": "Ann Jeffcoat", "ReviewID": "R1IHAPUK5LJ9MX", "Overall": "5.0", "Content": "I picked the 46 inch Samsung 3D for two main reasons.  The size worked for me and other Samsung products have been good. The glasses and Hdmi were a bit slow coming but otherwise it was as promised.As usual getting it through Amazon was good.CJ", "Date": "August 23, 2011"}, {"Title": "Awesomest TV ever", "Author": "Florin", "ReviewID": "R1J117JZS6P4T", "Overall": "4.0", "Content": "I've had this TV for about 2 months now, and I'm very happy with it. Here's a summary of my impressions.Pros:-the TV is very light and thin and the picture quality is excellent-TV can play files from an external hard drive or from a USB flash drive. I'm using a Seagate FreeAgent GoFlex 1TB drive .  This drive only worked in the bottom most USB port marked HDD-supported file formats: mp3, jpeg, and most of the VOB, MPG, MOV, WMV, AVI I tried.  Some codecs are not supported.  Audio tracks are available for VOB files, but subtitle streams are not-there is 1GB of space on the TV for downloading apps-you can connect a camera to one of the USB ports and the TV will play a slideshow of the pictures-after reading the negative reviews about the sound quality, I was surprised how good the sound was-you can download side by side (SBS) 3d videos and 3d stereographs to your USB drive and watch them in 3D.  Just push the 3D button while playing these movies or displaying these photos.  You can experiment with the 3D capabilities of the TV this way, if you're not sure about investing in an Blu-Ray 3D player. There is a 3D explore app that will also play 3D content, but my DSL connection could not handle streaming that content, which need at least a 4 Mbps connection.-the free Netflix app is good and essential if you're already subscriber. However, it has fewer features than the Apple TV or Wii versions-digital tuner is very good and shows all the programming for the available channels-comes with 2 pairs of 3D glasses that you have to request from the Samsung website. It took Samsung about a couple of weeks to mail the glassesTV Cons:-the channel list does not show what programs are playing on each channel unless you've already watched that channel.-whitish corners are noticeable when displaying a dark picture-glare during daylight can be pretty annoying.-once every few days it just reboots itself while you're in the middle of watching something.App Cons:Since apps are just software, it is possible that all the following issues could be fixed with a software update, but I'm not holding my breath. I've only looked at the free apps.-most of the free apps are lame, like the 50 MB screen saver that plays short loops of spinning disco balls and crackling fire places.-most apps take over the TV and you can't do anything else while you're in the app. This is annoying because, for example, you can't stop Netflix, check one of the TV channels, and then jump back into watching Netflix.  You have to start the app again. The one exception is the ESPN Score Center app, which shows game scores on screen while you watch regular TV.-there is no app for the popular Amazon streaming service-often when you try to start Netflix or Pandora, you get this very annoying error:  \"Network Interference Occurred. Please try again later\", even though the Internet connection is fine.-there are occasional one second blackouts when watching movies in the Netflix app-the Pandora app stops after a couple of songs", "Date": "August 3, 2011"}, {"Title": "Overall a great t.v.", "Author": "parot 161", "ReviewID": "R3S007RNGV0BY9", "Overall": "5.0", "Content": "I bought this t.v. to replace our 27\" crt.  I did a lot of looking before buying.  I've had it a little over a week.  I have not had a chance to try out the 3-D yet.  It is a great \"smart t.v.\" but with a few minor flaws.My Samsung UN46D6400 television is connected to a Samsung BDD6700 Blu-Ray player (excellent!), Amazon Basics high-speed hdmi cable (excellent!), and an ethernet connection to the t.v. (not wireless) at 12 to 20 or so mgb.Pros:Design:  This t.v. looks great in the living room.  I was afraid it would overwhelm the room, but it doesn't.  Glad I went with a 46\" instead of a 40\".  Love the glossy screen.  Reflections are not a problem and the lack of a matte finish I think enhances colors.Sound quality:  Excellent (for a t.v.).  I was worried that it would sound completely awful (since the t.v. is so thin) and I can not afford an hdmi capable receiver at the moment.  I'm glad I didn't let that keep me from buying the t.v.  Keep in mind, though, that a few reviewers have noted a sound-sync problem when running the t.v. through an external audio unit. I have not done this yet.Picture quality:  The picture quality is excellent (but I have not tried out the 3-D yet).  Blu-rays look great, dvds look great (after adjusting the automotion a bit), high-definition television looks great.  Watching home photos and movies by attaching an external hard drive to the usb port is a lot of fun.  Video quality from our point and shoot 720p camera looks great on this t.v..  This t.v. makes most Youtube videos look better than they look on my laptop.  Picture sizing options are on the remote to maximize video quality depending on the source.  The Wii looks fine on it even at full-screen.  The quality of streaming movies from Netflix varies from very good to excellent, but any fault lies with Netflix, not Samsung.Off-angle viewing:  I've read some professional reviews that note \"poor off-angle viewing\" quality.  We haven't noticed the picture degrading except at the most extreme of angles.  We think the picture looks great from just about anywhere in the room.Apps (Smart Hub):  Smart Hub has a lot of potential, but it's not totally there yet.  Some apps are outstanding (such as Vudu, Pandora, and Googlemaps).  Other apps (such as Vimeo) definitely feel \"half-baked.\"  The Youtube app on the t.v. stinks.  It automatically loads a video when you start the app.  I can't figure out how to stop it from loading a random video.  If you've got kids in the room random Youtube videos chosen by the app are NOT a good thing.  On the other hand, the Youtube app on my Samsung bdd6700 Blu-Ray player is great.  It does NOT load a random video on start-up.  It just sits there nicely until I search for something or choose to play something.Interface:The t.v. settings menus are well laid out and easy to use.  App interfaces vary, but are generally very good to excellent.Cons:The backlight:  This is an edge-lit led t.v. and has some of the problems that come with that technology.  I have noticed some flashlighting in the bottom left corner of the screen.  It is not there all of the time and it is not bad enough to return the t.v. or mess up the picture.  Most of the time I don't notice it at all.  Also, the backlight has uniformity problems when using some Smart Hub apps such as Youtube.  This uniformity problem does not seem to be there when watching Blu-rays, dvds, or cable television.  In the daytime or in a room with a light on it probably wouldn't be noticed.  If you like to watch Youtube videos in the dark, it will probably drive you bonkers.  This problem only seems to there when using some of the apps.Bottom line:  A great smart t.v. with a ton of capabilities and a great picture for the price.  Sure the \"backlight uniformity with some apps problem\" is a disappointment, but this t.v. does such a great job with so many different input sources that I'm willing to cut Samsung some slack for that.  Pair this t.v. with the Samsung BDD6700 Blu-Ray player.  They \"play well\" together.", "Date": "July 12, 2011"}, {"Title": "Good TV for the price", "Author": "V \"Val477\"", "ReviewID": "RO5KEI7WXAQL2", "Overall": "3.0", "Content": "I purchased this TV, but due to my personal pickyness I am returning it. The color on this TV is great, and I have no complaints about the outer design it looks very good. They say most people won't notice a difference between 120hz and 240hz, but I guess I am one of those people. I am very sensitive to motion blur and watch sports that are particularly hard to draw for screens, Soccer and hockey. This TV does a wonderful job of smoothing out images on the screen as long as they do not move to much. People talking and some action, great. Fast action or a puck moving, a bit blurry for my taste.Pros:-Design-Color-Thin-Great picture controlsCons:-Rendering fast motion-Small amount of flashlightingI wouldn't stop most people from getting this TV. If you do get it, do yourself a favor and look up the advanced picture settings through cnet or avs forum.", "Date": "August 16, 2011"}, {"Title": "Excellent Television, Stingy Samsung", "Author": "D. Hallowell \"Davomatic\"", "ReviewID": "R1FE6VT5IIX87T", "Overall": "4.0", "Content": "This television is incredible: Absurdly low profile, lightweight, unobtrusive bezel, brilliant engineering with on-unit buttons and input array. The image is incredibly clear and vibrant, and the sound is astoundingly good for native speakers (best on any set I've seen).The Smart Hub has an attractive operating system, and the potential for the Samsung App store seems to be great, especially with the possibility of 3D apps, but at the moment there is hardly anything in the store, and the website couldn't accept my credit card info because their drop down menu for cities in my state was non-functional (I tried multiple browsers with the same problem).Despite all of these positives, Samsung has still managed to alienate me as a first-time buyer of their products. I've spent what for me is quite a bit of money getting the 3D television and a Samsung 3D blu-ray player, and neither unit came with a single pair of 3D glasses. I understand the benefit to selling the glasses separately for retail, but the sour taste left in the mouth of the consumer is largely what prevents 3D from becoming more widely adopted. Consumers see 3D technology largely as a gimicky way for producers to generate profit with little value (unlike high def which has such a clear advantage over standard def for the extra cost), and companies practicing in this manner will continue to undercut their own goals as they alienate people like me who want to believe in the added value, but feel swindled in the end. I will certainly be telling a lot of my friends about my experience, and I am the first in my group of upper-middle class folks to attempt the upgrade. I am completely dead in the water for a couple months concerning 3D as I have to save up to buy glasses for my family of three, which costs over a third of the television price. There are rumors that Samsung will be lowering their prices on glasses and changing their practice of not including glasses with their units in the very near future, and this will only alienate me further if it proves true, as I will have bought the product in good faith at the wrong time.", "Date": "April 17, 2011"}, {"Title": "TV stopped working in 3 months! A new non-reliable product?", "Author": "JJ", "ReviewID": "R1GWXUKGNX7VIJ", "Overall": "2.0", "Content": "It stopped working within 3 months! when I power on the tv, I hear a continuous tick, tick sound from the back and no pic display.Called Samsung customer service and it took 1.5weeks for them to showup and told that they need to order the parts, which may take another 2 weeks. This is a new model and it doesn't look to have reliability. I'm going to retun it now than waiting another 2 weeks to get it fixed!", "Date": "July 19, 2011"}, {"Title": "Very Satisfied...Thumbs up!!", "Author": "Eric J. Oliver \"Eric-n-Bama\"", "ReviewID": "R1N45TLZ2DB1SS", "Overall": "5.0", "Content": "I am well pleased with the Samsung UN55D6400.  It is the lower end of the 3D models, and I have not seen the more expensive ones in person, so I can't help on comparing 3D models.I like to watch my friends trip out on the 3D. The images look like they come off of the screen and are right in front of you. It also looks like you could reach out & touch something.I used the Super Saver free ground shipping. The shipper called & scheduled delivery.Again, Very Pleased.", "Date": "June 11, 2011"}, {"Title": "Best yet!", "Author": "Allan Johnston \"Amazon guy\"", "ReviewID": "R2EWXOMT31KDH", "Overall": "5.0", "Content": "I have a LN46A650 Samsung that I purchased 2 years ago and thought it was the best ever.  Wrong.  This UN46 is even better.  As far as I am concerned, Samsung has the best tv's out there.  And, I had to contact customer service about something lately.  They were prompt, helpful and knowledgeable.  I see a lot of negative comments about Samsung's customer service and question those who write the comments.", "Date": "March 7, 2012"}, {"Title": "very good picture, but......", "Author": "L. Barclay", "ReviewID": "R2QWDPY0GIZJ3F", "Overall": "4.0", "Content": "I bought this TV 2 weeks ago, and while the picture quality is very good, I've noticed that it quickly declines as one moves from directly in front of the set toward either side.  Just move three feet off of center while seated about nine feet from the screen, and the picture is noticeably faded.  I have another Samsung LCD (LN52A650) which I purchased in 2008 which is an LCD model (before LEDs became common), and it does not display this characteristic.  I would give that model a definite 5-star rating.  I wonder if this is characteristic of LED TVs.", "Date": "December 20, 2011"}, {"Title": "Review for SAMSUNG UN40D6420", "Author": "tyinatl2011", "ReviewID": "R19C77UYQ4G6D9", "Overall": "3.0", "Content": "After much contemplation, pulled the trigger on this unit (UN40D6420).  First one I brought home from BestBuy had a bad pixel.  After using this TV extensively for a month I am somewhat pleased.  I do see some some graininess in motion scenes.  Sound is OK, but speakers face the rear.  There is a LOT of customization required to get the full use out of this set.  It does however, offer many options.  I can't imagine anyone like my elderly father using this set to anywhere near its potential.  I am constantly adjusting the picture, sound, etc. when viewing diff. things.  The 3D is somewhat impressive looking at the 3D Channels on Direct TV.  I bought this unit for an antique cabinet in a family vacation home, sure wish I could have fit the 46' in there...  The glossy screen DOES reflect all the lamps in the room, effecting what you are going to have on when trying to watch TV.  It is my understanding that now most bright leds, like and including the samung will have a glossy led screen.  Not to sure about the factory settings, as I said diff. content looks better with diff. settings.  Possibly check CNET for calibrating options.Pay the extra money and get the 46'.  I would have love to have waited for the new 40' model with 240MHZ to come out and would have gladly paid the difference.  The 3D glasses that I received for free seem a little fragile, they are also somewhat hard to turn on and off.Overall I have enjoyed this TV, but I do think it is overpriced.", "Date": "October 3, 2011"}, {"Title": "The screen is black; not covered under warranty", "Author": "Laurie", "ReviewID": "R31WQGSU6V0C1", "Overall": "1.0", "Content": "I purchased this TV just 2years and 8 months ago.  I especially liked how thin and light the TV was.  Initially, lots of good things to say.  However, just like all the others here, I was watching the TV, I got a double image for about one minute and then it went black.I called Samsung and jumped through their hurdles; they finally told me it had to go to a repair center and it's not under their unforgivable one year warranty.  What, I paid $1400 for a TV 2+ years ago and it doesn't work!Samsung stated they were not aware of this TV model having any issues (I guess they have not seen the reviews here).  Also, if you google Samsung TV, you will see other models have problems with the capacitors (something like that).When I go to the Samsung site, the nearest service center states it's 84 miles away.  Well, I plug the address into mapquest and it's over 150 miles away.  So, what, I have to drive 150 miles to hear it's going to cost me some unknown amount of money.  I am concerned when I read online where people are gouged at these service centers because there are so few of them.So, for now, I will pull my little 20 year old 13\" Sony out of storage while I figure out what I want to do with this 46\" piece of junk.", "Date": "January 13, 2014"}, {"Title": "Excellent picture, but did have a \"blowout\"", "Author": "Lee Tyler", "ReviewID": "RUJ5IY5QSPXP6", "Overall": "4.0", "Content": "Great picture, but after about 18 months, had a big \"pop\", and unit was dead.  However, I blamed myself for not having the TV on a surge protector.  And I have several other Sammy HDTVs, some as old as 7-8 years (most, but not all, on surge-protectors), and they are all running perfectly.  Being a DIY type of person, did research, bought a new main board ($100), popped it in, and all is well...of course, on a surge-protector this time...after a year, still working perfectly.  Only give a 4-star in case the known \"bad capacitor\" issue of which Samsung settled a couple of years back, and perhaps what really happened.", "Date": "January 12, 2014"}, {"Title": "Great TV, but back light died out on it fast.", "Author": "Pen Name", "ReviewID": "R246U8FHYHCNNL", "Overall": "4.0", "Content": "Great tv, the only bad thing is that the back light on it died very fast after getting it. Besides that, this TV is amazing.", "Date": "December 6, 2013"}, {"Title": "GREAT TV", "Author": "AdamsBQ06", "ReviewID": "R2Y41M9MTVJOV9", "Overall": "5.0", "Content": "Great Features, Great Picture.  Great Quality.  I bought this TV as an upgrade to an older Samsung DLP.  I love it.  It is great in all lighting situations.", "Date": "November 1, 2013"}, {"Title": "AAA+++ Excellent", "Author": "Robert S. Trenholm \"RSTFamily\"", "ReviewID": "ROIQ05NLY45NG", "Overall": "5.0", "Content": "Owned for 2 years now...excellent, no problems.Picture is the sharpest then any other TV I have come across to date, Smart function is the best...kiss expensive Cable good bye.  Several Automatic Updates to software/hardware already, no problems.I recommend to my friends!", "Date": "August 19, 2013"}, {"Title": "Best TV ever made!", "Author": "Ryan K Locke", "ReviewID": "R3IBNZ39T38RKI", "Overall": "5.0", "Content": "I bought this TV at Sears in 2011. Someone broke into my house and stole it in 2012. I went back to the store to replace it with my insurance money and they were no longer being made. So I bought the Samsung similar to this one (only it was brand new) and immediately I was angry. Samsung replaced this model with a much sleeker looking model but the image on the screen was not as clear or bright as the old one, the features were annoying (such as beeping every time you turn the volume up or down), and they got rid of the outputs for older electronic components (such as RCA video components). Even the people at the store told me that Samsung electronic products made in 2011 work and operate much better than the newer products. I wont mention any names or stores (because I visited so many), but they all agreed that if I wanted my old one, you'd have to order it.So, when I couldn't find this TV anywhere, I got on Amazon.com and found a seller. I immediately bought it and have been using it every day I've had it! Great television and anyone who says otherwise is just trying to sell you something new; not better!", "Date": "July 21, 2013"}, {"Title": "Una Imagen excelente para ser un TV de Gama Media", "Author": "Elvis Jesus Luzardo Quero", "ReviewID": "R46XOGEWHL2KG", "Overall": "5.0", "Content": "Was looking for a Samsung Tv To integrate it into my ps3 and this was perfect. Very good image and design, in sound is not very good, but acceptable for the price. I recommend", "Date": "July 13, 2013"}, {"Title": "good picture", "Author": "sb", "ReviewID": "R8GU2PY6O6YUU", "Overall": "3.0", "Content": "i have owned this for over a year now.  i had to replace the screen (under warranty) at about 11 months. i have 2 other samsungs and never had an issue. the customer service showed up in about 2 days and replace it.", "Date": "February 16, 2013"}, {"Title": "Nice Television", "Author": "JME", "ReviewID": "R147B94I25D6IA", "Overall": "5.0", "Content": "Extremely low power consumption. Great picture. Minimal motion artifacts and good viewing angle for an LCD television. Network ready. I like this very thin television.", "Date": "January 25, 2013"}, {"Title": "Best picture goes to . . .  .", "Author": "P.Gallagher, 50s Housewife \"Pam Gallagher\"", "ReviewID": "R141SATXD44LAA", "Overall": "5.0", "Content": "This TV is AMAZING.  It feels like you are in a movie theater whether you are watching a movie, TV show or a commercial!  Are you sure you need the 3D glasses?", "Date": "January 14, 2013"}, {"Title": "I love this tv", "Author": "Christopher de la Paz", "ReviewID": "R1Q51LK0R150SH", "Overall": "5.0", "Content": "It's perfect. 3d is nice. Clear as can be picture. Sleek design with almost no border. Looks great mounted on the wall. Highly recommend this tv but don't recommend the 3D. I have use it a hand full of times and that's it. The glasses have dust on them from lack of use. I recommend this tv but without 3D.", "Date": "November 13, 2012"}, {"Title": "My first LED TV", "Author": "Ripu Daman Singh", "ReviewID": "R2JIK55VLY54DX", "Overall": "4.0", "Content": "After 7 months of use i thought it's time for me to share a few things about this TV. I did a lot of research and Amazon probably had cheapest price when i bought it. I was very skeptical about letting anyone handle my TV but now i am fan of Amazon service. TV was delivered in excellent condition and on time. LED TVs have the best picture quality and this TV delivers. There is nothing which beats this TVs quality (at price ~1000) when watching movies and TV shows. Looks sharp!!! Apps are very important for a companies success in modern era, to name a few this TV has HBO, Netlix and HULU Plus but this is where i am a bit disappointed they have some basic apps missing - HULU and AmazonPrime.Some disappointing news for sports lovers - SPORTS channel are not that great (nowhere close to movie quality). The bottom area which shows news on ESPN lacks quality (flickers and not that clear). When the camera is zoomed out and players are moving picture quality is not that great for my expectation but once camera zooms in and doesn't cover all the payers its good. I think its all because this TV is 120 Hz.Color quality is great but i noticed a few dots specially on black color (just a few), again it's a byproduct of LED TVs. One weird thing which could just be with my TV, after a few hours of Netlix (6-7 hrs on a lazy Sunday) TV automatically restarts. I haven't seen it ever happen when i not using apps i.e. watching cable. It seems to me more like a software problem rather than hardware problem. It is just like as if by mistake you restarted your computer.More or less LED is still growing technology and overall i would recommend this one if some is looking for LED in less than $1K. Happy shopping!!!!", "Date": "October 10, 2012"}, {"Title": "Initial Disappointment", "Author": "Edanba", "ReviewID": "RRVVUR79QCT69", "Overall": "3.0", "Content": "The TV (along with its great picture) died after approximately two months of ownership.  I learned that flat panel TV failure typically involves the replacement of the mother board, or the screen (flat panel)itself. In my case, it was determined that the panel had to be replaced.  Outside of Amazon's replacement window, I defaulted to Samsung's warranty service for repair.  Under warranty, it took Samsung approximately three weeks to diagnose problem, receive part, and send out a service technician to do the on-site installation. Since the initial frustration associated with buying a new but defective TV, and the hoops you have to jump through to get service, diagnosis, and repair, the TV has been working fine.", "Date": "September 19, 2012"}, {"Title": "contact me", "Author": "Paez L", "ReviewID": "R1MITDNR7NNP67", "Overall": "3.0", "Content": "The 3d glasses was not in the box and in the list of items indicate that it is supposed to be together with the TV mapex-intl@hotmail.c", "Date": "June 4, 2012"}, {"Title": "amazing picture", "Author": "SkyPro", "ReviewID": "RKLRI8OZJNDX5", "Overall": "5.0", "Content": "I owned two Samsung TV, this is my 3rd one.I love the picture quality, it even betterthan the LED 60' TV I bought 2 years ago.Completely satisfied with the product purchased.", "Date": "April 29, 2012"}, {"Title": "Excellent TV once you fix the settings", "Author": "Kurzy Surfer", "ReviewID": "R1C7EBP9OQIHBU", "Overall": "5.0", "Content": "This TV has a beautiful picture, but only after you fix all the factory settings.  When I first turned it on, it had a rather muddy looking picture and watching it actually made me dizzy due to the auto motion settings.  Several other reviewers recommended settings that were very helpful.  I started from those and adjusted to my preferences and now I am very, very happy with this TV. Picture is amazing, sound is pretty darn good and I love the thin bezel.", "Date": "April 12, 2012"}, {"Title": "Nice full featured TV at a nice price.", "Author": "Chris", "ReviewID": "R1AYHJFFPEUY44", "Overall": "5.0", "Content": "Nice full featured TV that fit our requirements at a nice price. Received the TV within 2 days even with the free shipping option. Setup very fast, updated firmware, calibrated with some settings found off a TV forum and the TV looks great. Hooked up to our network directly through our router and the ability to stream movies/music/Netflix is great. Haven't tried out the various apps but it's nice to have them there if and when we do. Solid TV that fits our needs perfect. Will update review as needed once we've spent more time with it.I also have to commend Amazon for their customer service on this order. I initially ordered the wrong TV and the process in which we returned the TV, got the right set and dealing with refunds was a breeze.  I had to call them on 3 separate occasions and each time the representative was courteous/professional. The price of the TV was dropped nearly $70 in the time since we ordered and since I received and Amazon easily refunded the purchase price with no hassle. In the 10+ years I've shopped with Amazon, I've never had an issue with orders that I had to contact them directly. This was my first time and I was fully satisfied on all counts of having to deal with their customer service. Thank you Amazon for making things so simple for a satisfied and happy customer.", "Date": "December 18, 2011"}, {"Title": "Simply Outstanding - UPDATED 10/22/12", "Author": "Josh", "ReviewID": "R14XH27BJ1DJJ0", "Overall": "5.0", "Content": "UPDATE TIME - It's 10 months later and I couldn't be happier.  This TV turned out to be one of the best investments I have ever made.  I love it...This is an EXCELLENT television.  I am a bit of a tech head, though not crazy, and my primary objective is an excellent picture. This TV has an outstanding picture and the slim design is by far the nicest looking out there(nothing close in this price range).  I was incredibly impressed with the quality of the 3D.  My only constructive criticism is that it takes a bit to tweak the picture settings to get them perfect.  I have had the TV a week and find myself constantly playing around with the settings.  If you are in the market for a TV and you have done all of your research and want a \"lux\" looking and performing TV without paying upwards of $1500 this is hands down the TV to get.  I can't say enough about how pleased I am with it.I purchased the Interion large mount for $49 to go with it and it didn't come with the correct screws because of how slim the TV is.  I had to run out and grab the M8/25 screws at the hardware store.  no biggie.I also am using the Samsun battery operated glasses for the 2011 models.  They are also fantastic and about 1/4 of the price of the rechargeable glasses.", "Date": "December 13, 2011"}, {"Title": "Very nice TV", "Author": "Steve O", "ReviewID": "R386FTSUH6DGM2", "Overall": "4.0", "Content": "I like everything about this TV.  When we started watching 720p and 1080p media the first thing we notices was how ridiculously clear everything was.  Most shows were like looking through a window.  Everything is great.  However, I have a few issues with it.1. For some reason the sound won't go through the TV to the reciever in anything but Dolby Pro Logic II (I'm using Optical out and the signal is coming from an XBox 360 over HDMI).  I HATE ProLogic.  DTS is far superior.  I'm sure I'm missing a setting somewhere, but you would think it could default to the 'good' surround.  I may have to just go straight through from the XBox to the receiver over optical.  I dunno.2. The net apps, etc are useless.  I bought the 6400 for the small bezel size, but I technically also bought a \"Smart TV\".  My XBox, Roku box, and home computer serve video perfectly to the TV from Netflix, Youtube, Hulu+, etc in 1080p, however the TV's Netflix, Hulu, and other apps can't seem to even play in standard def.  The interface is super slow to boot, (bordering on unusable).  If this sort of thing is going to be included, it should work well enough to make it usable.3. Probably the least of my worries, but when playing most 360 games there is a portion of the screen in the lower corners that seems to display just off.  It might be the particular games I'm playing, though.Anyway, I'd give it five stars if it weren't for the Smart apps being so useless.  I haven't tried out any 3D yet, but again, I bought this model specifically for the smaller bezel.  I've never liked the 3D experience.", "Date": "December 5, 2011"}, {"Title": "Samsung", "Author": "bevs", "ReviewID": "R3A7G3O8RZFN7F", "Overall": "5.0", "Content": "Great TV.  Good 3D and love the size. Fits the room well and am impressed with the quality.  Clear picture.  Love it.", "Date": "November 28, 2011"}, {"Title": "Awesome", "Author": "Gloria Dapolito", "ReviewID": "R1283KM6XQW5ZY", "Overall": "5.0", "Content": "I purchased this TV a month ago and I am still in awe at the quality of the picture.  When I purchased it, my intention was just to use it to watch some 3D movies; but is has become our primary TV because of the fantastic picture and other features.  It is connected to a high quality surround system that provides a wonderful theater experience,  and a HD smart blu-ray, that brings smart TV features like FaceBook, YouTube and other social net works to another level.  It is awesome viewing \"friends\" photos from FaceBook on this large 55 inch HD TV, and browsing YouTube and watching videos is fantastic, you have to see it to believe it, it is just that great of a TV experience.  I was questioning myself for spending so much for a TV I was only going to use every now and than, as it turned out, it was one of my better purchases.", "Date": "November 9, 2011"}, {"Title": "Beautiful Piece of Technology", "Author": "Abeszta", "ReviewID": "R9RSRIZ9ERUHI", "Overall": "5.0", "Content": "Purchased this TV after I returned the Sharp Aquos 830 52\" and noticed a HUGE difference.  Picture quality is amazing, style is great, and the Samsung Apps seem reasonable.  I haven't used the 3D option and never really planned on using it.  Just wanted a decent TV, and 3D happened to be included.  The only complaint I have is with the PIP function.  It only allows the cable or over-the-air connections as the other PIP input.  This means I cannot connect my computer and watch my HD cable box at the same time without rigging up my connections through different cables.  Also, I hooked up a Polk Audio soundbar at the same time so I never really got to hear the speakers, but from what I understand they are pretty weak.  Soundbar sounds great though!! Since that is my biggest complaint, I am extremely happy overall and wouldn't have selected any other TV.", "Date": "November 3, 2011"}, {"Title": "GREAT!!!", "Author": "Shirley", "ReviewID": "R3U687FDEX7ZVK", "Overall": "5.0", "Content": "Upgrading from a 46 inch Samsung to this was a snap. Main concern I had was not tv quality since Samsung is outstanding it was will this tv fit my wife's New entertainment center's tv spot. The measurements given in the product review where perfect. Delivery man carried it in and opened then plugged in to make certain all was well. Then I placed it in the new furniture and WOW it fit. And yes 3-D is impressive. Fast delivery also.", "Date": "October 13, 2011"}, {"Title": "Samsung LED Tv. 3D", "Author": "brutus", "ReviewID": "R3EZXBQIEPXFOB", "Overall": "5.0", "Content": "The Tv. Arrived when it was supposed to. Setup was very easy. The picture quality was as good as I thought it should be. I hooked up a Bose surround sound to it so I do not know true quality of Tv. sound . On some HD. tv shows the picture almost looks 3D.I have not played a 3D movie yet so I can not rate that aspect.", "Date": "August 9, 2011"}, {"Title": "Great TV!  One little issue", "Author": "GolfGryl", "ReviewID": "R1EYJJKOHW19O2", "Overall": "4.0", "Content": "This TV is GREAT!  Picture quality is absolutely AMAZING. My PS3 connected to the TV is addictive. I am like a little kid with a major new toy. The only problem I have is trying to figure out why my display says 60hz on the TV - not 120hz as advertised on Amazon.  Still trying to figure that out.  If I did not already have the PS3, I would have purchased the 6500 with the integrate web browser.  I can always purchse the dongle later.  Amazon delivery was fast as usual.  I am a Prime member so received the TV in one day.  My other items orders arrived in two days.  Amazon I love your service.", "Date": "July 24, 2011"}, {"Title": "Awesome buy!", "Author": "Shyam", "ReviewID": "R2DRANYQV5I0BH", "Overall": "5.0", "Content": "I think this is the best product that I have bought, and that too at the perfect price. Its got all the features a latest TV should have.There is just one negative, on connecting external speakers to the TV, you cannot adjust its volume using the TV remote, which can be done in other models. But I am sure there will be some workaround for this problem, and its hardly any problem.I simply love this TV. Proud to own it!", "Date": "June 19, 2011"}, {"Title": "Samsung Television", "Author": "M.M.Loris", "ReviewID": "R3M68ZA7LH7QUL", "Overall": "5.0", "Content": "We are very happy with our purchase.  We received the item in the time promised.  The picture on this television is incredible!  I would purchase from this vendor again and would recommend this vendor to my friends and family.", "Date": "June 17, 2011"}, {"Title": "3d works great (with 2 updates)", "Author": "Louie the Italian Jew \"Lou da Joo\"", "ReviewID": "RCNQAZJ0AWF4A", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moFWE33JUQ2XOIembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moFWE33JUQ2XOIrefresh_preplay() {\n\ndocument.getElementById(\"cv_moFWE33JUQ2XOIchiDiv\").innerHTML = document.getElementById(\"cv_moFWE33JUQ2XOIhiddenPre\").innerHTML;\n};\ncv_moFWE33JUQ2XOIrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moFWE33JUQ2XOIso;\t   \n\n\nfunction cv_moFWE33JUQ2XOIloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moFWE33JUQ2XOIso = new SWFObject(swfLocation, \"cv_moFWE33JUQ2XOIAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moFWE33JUQ2XOIso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moFWE33JUQ2XOIso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moFWE33JUQ2XOIso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moFWE33JUQ2XOIso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moFWE33JUQ2XOIso.setAttribute(\"height\", swfHeight);\n          cv_moFWE33JUQ2XOIso.setAttribute(\"width\", swfWidth);\n          cv_moFWE33JUQ2XOIso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moFWE33JUQ2XOIso.write(\"cv_moFWE33JUQ2XOIflashcontent\")) {\n          fp_resizePlayerSpace('cv_moFWE33JUQ2XOI', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moFWE33JUQ2XOI';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moFWE33JUQ2XOI', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moFWE33JUQ2XOIloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moFWE33JUQ2XOI\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3UAOXRPQPCWT0\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3UAOXRPQPCWT0\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RCNQAZJ0AWF4A\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3UAOXRPQPCWT0/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moFWE33JUQ2XOIduration')) {\n      document.getElementById('cv_moFWE33JUQ2XOIduration').style.display='none';\n    }\n    cv_moFWE33JUQ2XOIloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moFWE33JUQ2XOIloadSwf(movieID, playerVersion) {\n   return _cv_moFWE33JUQ2XOIloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moFWE33JUQ2XOInewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moFWE33JUQ2XOI', 0, h);\n}\n\nfunction cv_moFWE33JUQ2XOIresetPlayer(w,h,bw,cc) {\n  cv_moFWE33JUQ2XOInewHeight(h);\n\n  cv_moFWE33JUQ2XOIso.addVariable(\"resetBandwidth\", bw);\n  cv_moFWE33JUQ2XOIso.addVariable(\"cacheCode\", cc);\n  cv_moFWE33JUQ2XOIso.setAttribute(\"height\", h);\n  cv_moFWE33JUQ2XOIso.setAttribute(\"width\", w);\n  cv_moFWE33JUQ2XOIso.write(\"cv_moFWE33JUQ2XOIflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moFWE33JUQ2XOIRollOverImg = new Image();\ncv_moFWE33JUQ2XOIRollOverImg.src = \"http://ecx.images-amazon.com/images/I/718USNAvxzS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moFWE33JUQ2XOIpreplay = document.getElementById('cv_moFWE33JUQ2XOIpreplayImageId');\nif (cv_moFWE33JUQ2XOIpreplay) {\n  cv_moFWE33JUQ2XOIpreplay.onmouseover = function() {\n    cv_moFWE33JUQ2XOIpreplay.src = \"http://ecx.images-amazon.com/images/I/718USNAvxzS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moFWE33JUQ2XOIpreplay.onmouseout = function() {\n    cv_moFWE33JUQ2XOIpreplay.src = \"http://ecx.images-amazon.com/images/I/718USNAvxzS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moFWE33JUQ2XOIpreplay.parentNode;\n\n  var cv_moFWE33JUQ2XOIcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moFWE33JUQ2XOIcurrentClick) {\n      return cv_moFWE33JUQ2XOIcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 1:03 Minsproper hookup is required. check out the brief video where I discuss a couple other attributes of this 3D LED TV.3D Blu-Ray player must be hooked up to HDMI 2 port (3-D button on remote works with TV turning 3D on and off). I haven't seen any ghosting, just amazing crystal clear 3-D video. MY friend put on the 3-D glasses and he's purchasing the same set as we speak. the 3-D experience is phenomenal.I have doubts that the other reviewer actually turned on the glasses because the power button is a little difficult to find. When the glasses are on, the glasses dim on purpose for the 3-D effects to take place.UPDATE: May 29, 2011- Yesterday, the TV power would not turn off when I pressed the power off (pressing the power button). Even after I unplugged the TV, the TV powered on(without pressing the power button) once I plugged it back in. The TV picture would flicker on and off. I returned the TV, and the customer service rep suggested I pick another TV. There was another box with the same TV behind the counter, but the rep told me that particular customer already left the store. I wanted to find out if the other person had a similar problem. I walked around the store and didn't see anything I liked. I went and exchanged my TV for the same TV (hoping that the other customer just figured he paid too much). It honestly is all that, and a bag of chips (but with reliability issues). I'm really crossing my fingers on this, and hoping the other one was just a lemon. I'm lowering my review to 3 stars because I know I would have been furious if this happened on the 31st day instead of the 7th day. Since my initial review I've seen a couple more 3-D movies, and am so impressed. I know some that praise this TV may find this unhelpful. I just wanted to put my experience out there. As you can see, I own the TV. Take it for what it's worth. I just don't see any other TV's that I like as much as this one. The design and picture quality are better than any other TV(LED, LCD, Plasma) I have seen. If there were other TV's as nice as this, I'd probably give it a 1 star rating after my negative experience. I'll keep you updated, and will not sugar-coat anything.  Again, I'm hoping my last TV was a lemon.6/17: I waned to hook this TV up in another room through a speaker system bought 2 years ago. BAD IDEA! this took the 3-D effect away. Hook up your 3-D Blu Ray player DIRECTLY to your TV, or a receiver that has 3-D pass-through if you want optimal results.Update 11/26: the same model TV I replaced this is working well. I stuck with it, and I'm glad! I'll give another update in 6 months for those that are interested. raising from 3 to 4 stars.Peace, Lou", "Date": "May 23, 2011"}, {"Title": "disappointing", "Author": "raybee \"raybee98\"", "ReviewID": "R2QCY4IJWBEEH4", "Overall": "2.0", "Content": "Very disappointed in the picture quality of this tv. Images jump and stick when scene changes and there is a visible drag quality to movement. If the scene is still the picture is great though, but who needs that? A very expensive pciture viewer. Should have gone with a Sony. Going to try to return this. What a pain.", "Date": "September 10, 2011"}, {"Title": "Excellent for the money", "Author": "hsirahrian", "ReviewID": "R23YRMWZGWR4ZQ", "Overall": "5.0", "Content": "Excellent TV for the price !! No frame makes the TV very elegant to look at.Great for watching movies and 3D content.2D-3D feature is also very impressive. Calibration helps in eliminating LED bleed completely. Samsung has improved their sound quality from previous models.", "Date": "January 30, 2012"}, {"Title": "Great TV for the money", "Author": "Nick T \"Nick\"", "ReviewID": "R2XY5W5KFJQXRN", "Overall": "4.0", "Content": "I recently received this TV and I am very impressed with it. The picture is excellent and the design of the set itself is just remarkable. It's extremely thin and light (so much so that I easily mounted it to the wall by myself). The menu structure has been redone as compared to older Samsung TVs and is very intuitive and easy to use. My one gripe, and reason for 4 stars instead of 5, is that this TV does not have built-in wifi, and to get that you need to order a dongle from Samsung. I think that's a bit cheap, but oh well.", "Date": "January 16, 2012"}, {"Title": "Great Picture", "Author": "Nancy Hemmerich", "ReviewID": "R2W3HBCIYQZ0U2", "Overall": "5.0", "Content": "Amazon's price was $100 less than other vendors.  Delivery was as stated and the delivery staff (both office and actual delivery men were very courteous.  I haven't figured out how to use all its features but the picture is very clear and the color is balanced perfectly.", "Date": "December 30, 2011"}, {"Title": "Best Picture So Far", "Author": "Walter L. Martinez", "ReviewID": "R25H9KEXW6SRV9", "Overall": "5.0", "Content": "This is my second HD TV, the first being a 32\" Panasonic.  In a nutshell, this is the finest TV I have seen anywhere.  After having this TV for a little over a month, nothing else comes close in picture clarity and color. The program material I have been viewing is broadcast which is very clear for all the big networks with my setup.  This model is ultra modern with the thin bezel. I am glad that I went with this new sleek design. I am a very happy with this purchase and recommend this Samsung model.", "Date": "December 26, 2011"}, {"Title": "Fantastic picture...super thin profile", "Author": "J. D \"JD\"", "ReviewID": "R12YCVTM4ITEOF", "Overall": "5.0", "Content": "I am ABSOLUTELY loving this super-thin, super-bright LED-backlit 55-inch HDTV set! I bought this to replace an older Samsung LN52A650 52-Inch 1080p set that was mounted on the wall of a room we called \"the man cave\". I sold that house and needed a replacement set. Samsung was once again my first choice.I could not be happier with the UN55D6400 model...the crystal-clear quality of the HD video is AMAZING. This set is primarily tasked with XBox 360 gaming for my teenagers, and it looks superb from any viewing angle.Like many others, I spent hours and hours researching these sets before pulling the trigger. Based on the quality of my previous Samsung HDTV, I felt confident in the Samsung brand. At the time I made the LN52A650 purchase in 2008, that particular model was ranked #1 by Consumer Reports for 50-inch+ sets. I'm VERY glad that I made the decision to buy another Samsung set...I'm equally happy with this UN55D6400 set. I love it so much I'm considering buying another one!I definitely HIGHLY recommend this set. Go for it! You'll be glad you did.", "Date": "October 24, 2011"}, {"Title": "Awesome T.V.", "Author": "Bryant", "ReviewID": "R2QGEPJ8STZSO8", "Overall": "5.0", "Content": "No complaints! AWESOME T.V. One of my favorite things is it can play .MKV files off of a USB drive.", "Date": "June 19, 2011"}, {"Title": "great TV", "Author": "Chris", "ReviewID": "R16PXWBE0I3LJ8", "Overall": "5.0", "Content": "for the price this is a great tv. i originally purchased an LG tv but then quickly returned it because i was not happy with the quality.  the 3D is good for the most part. i can occasionally see some ghosting but nothing like other people have reported.  it seems like they could add more adjustment functionality in the future through internet updates.  overall i was extremely happy with the picture quality. the blacks are so incredibly black and the colors are so vivid.", "Date": "May 31, 2011"}, {"Title": "Samsung UN40D6400 40-Inch 1080p 120 Hz 3D LED HDTV...yes, it's that good", "Author": "Thomas P. Huggins", "ReviewID": "R1IYUIAOUMYYEA", "Overall": "5.0", "Content": "I highly recommend this TV over all other brands (besides maybe LG), especially if you want a 40\". I spent a while researching this and even went into several stores to see and compare the TVs in-person (which you should ALWAYS do if you're buying a TV!). One of the complaints I heard about his TV is the back-lighting bleeding through the screen and it's most apparent when there is a darker scene. This is true, but don't let it deter you. You may be able to see it, but it is hardly noticeable.I haven't used the 3D capability yet because I don't have the glasses BUT what I can tell you is that I have seen this model next to the D6300 model (doesn't have 3D capability) and you CAN tell a difference in picture quality. You probably couldn't tell the difference if they weren't side-by-side, but after seeing the clarity difference between the two I thought that if I was going to spend around $1000 on a TV I might as well get one of the best ones on the market so I don't have to buy an new one again for a while.I RECOMMEND THIS TVAs a side note, considering the high quality of these products I also got a Samsung blu-ray player (Samsung BD-D6500 3D Blu-ray Disc Player). It's great how compatible the TV and blu-ray player are, though I'm sure other blu-ray players work great too; however, I wanted a seamless experience between my products and that's what I got!", "Date": "March 15, 2012"}, {"Title": "Miserable Experience, lousy service", "Author": "Robert T Marcom", "ReviewID": "R2BT3C3O4C64ZA", "Overall": "1.0", "Content": "We've owned this TV for about 8 months and it has never worked correctly.  It has so many bugs, I don't have time to list them all, and if it was possible to give zero stars, I would do so.  The first TV was replaced by Samsung and the replacement soon developed an inability to find attached devices (the satellite DVR and a Sony Blu-Ray player). Next, it began starting up with a washed-out picture in green tint.  then, we started getting a myriad of nonsense error messages.  We did everything that Samsung service recommended and it only got worse.  We're now in discussion with them demanding a refund.  This thing is a lemon. We replaced it with a Sony Bravia and it has worked perfectly so far.", "Date": "July 12, 2011"}, {"Title": "great buy", "Author": "Art   Morales", "ReviewID": "R2GP73VUWGDWQO", "Overall": "5.0", "Content": "Bought the 6400 for less than $2k. No regrets. Great picture: like 3d even in 2d. Love the smart tv features. Worth getting.", "Date": "April 25, 2012"}, {"Title": "Great TV and very versatile", "Author": "N Patel \"Diamonds\"", "ReviewID": "R2M6QNGIUWJR8", "Overall": "4.0", "Content": "The picture quality is fantastic, Love that I can watch my videos from my computer directory to the TV's build in media player.  One this is that, I would love to see a Amazon TV app for the SmartTV, so I can stream Amazon Movie's directly to the TV.", "Date": "December 23, 2011"}, {"Title": "Best purchase, EVER!!!!!!!!!!!!!!", "Author": "Tennessee", "ReviewID": "R34MZDOLS4O0XW", "Overall": "5.0", "Content": "Great tv, great picture, great service, great experience. This tv has brought a wide range of variety to our family time. From HD to wireless internet, our movie viewing is satisfied.", "Date": "December 20, 2011"}, {"Title": "Nice Looking LED TV", "Author": "SMBDS", "ReviewID": "RNQ2G53G8W4UX", "Overall": "4.0", "Content": "I must say, a very classy looking LED 3D TV. But it desn't come with 3D glasses. Picture (Blue-ray) very clean. Good buy.", "Date": "August 25, 2011"}, {"Title": "So much potential", "Author": "NickisratingstuffonAmazon", "ReviewID": "R2ZSBBQOOTBRI7", "Overall": "3.0", "Content": "After less than 2 days of putting this set through its paces, I ended up sending it back. Very promising TV after reading professional and user reviews, but an odd video issue and lackluster Samsung support had me return it.The quality of the video overall is fantastic. Crisp and clear, and the 3D content I tried with it (a couple PS3 games and a Blu-ray movie) were better than I anticipated.The problem that arose for me was every 20-60 seconds or so, there was video lag where the entire image would stop momentarily and then run as normal. It appears to be some sort of processing issue where the set would hang, reset the video. Went though the settings making sure all the enhancements were off, tried with all on, limited one by one to try to find what the culprit could be. I was able to replicate on the 3 different HDMI inputs. Made sure software was updated. Contacted support, but no solution was found.I wanted this to be my next big stupid purchase, but I ended up with a bum TV. I would have ordered a replacement, but spending the money on shipping back to Amazon had me in the hole and would be even worse off if I got another one with the same issue.", "Date": "November 13, 2011"}, {"Title": "A huge letdown from Samsung...", "Author": "Jack \"Jack\"", "ReviewID": "RXK7ZMVJJHFLG", "Overall": "1.0", "Content": "How can Samsung let something like this go to market?Thinking that I got a bad unit and that this can always happen when machines are concerned I went through two exchanges of this so called \"Smart TV\".Ghosting, Flash-lighting, light leaks, uneven screen uniformity; you name it this TV has it all. I would get something else if I had more time to waste, but unfortunately I do not.Either a lot of people got really lucky with their units or they don't know any better.Mind you, I have loved all my past Samsung TV's but they really messed this one up.This is the most expensive piece of garbage I have ever purchased.On the plus side it looks very nice on the wall \"When it's turned off\"...", "Date": "May 14, 2012"}, {"Title": "Good TV", "Author": "SAS", "ReviewID": "R1I1FP69XLQRB1", "Overall": "4.0", "Content": "Great picture! The 3D is awesome!! I don't understand why the clock on the TV is soooo tiny! Also, I was hoping Amazon would be one of the apps on this TV but it isn't! Too bad!", "Date": "February 5, 2012"}, {"Title": "Awesome picture!", "Author": "JPSM", "ReviewID": "RD64DJO4E71PF", "Overall": "5.0", "Content": "The picture quality is awesome! Installation and set up was easy.  We did buy monster cable to connect to our Direct TV HD satellite.", "Date": "January 2, 2012"}, {"Title": "Very Nice TV", "Author": "Walterab", "ReviewID": "R1S0QKLVMH90EI", "Overall": "4.0", "Content": "Very nice TV. Apps are pretty much useless to me since my PS3 has the apps I need. The picture is beautiful although somewhat dark at times. The 3D works ok, for 3D. No free glasses for me. Had to pay $50 ea for a couple of them. The set itself is beautiful but the HDMI inputs are kind of a tight fit, but ok. It will be a great buy, as long as it lasts more than a couple years.", "Date": "April 30, 2011"}, {"Title": "ATTENTION! This TV does \"NOT\" have Full HD 3D as they advertised!  Who ever paid for this TV, here's some info for you", "Author": "Anthony5362", "ReviewID": "R3G3XPXKT2VLPI", "Overall": "1.0", "Content": "You should be getting a new TV or refund due to \"False Advertising\"  This is for the D6400 model which does NOT have Full 3D HD!  I also heard of many getting refunds for this.Consumerist.com has an article about this.  Google \" Samsung 3D false advertising class action lawsuit\" and the attorney out in CA that's handing this should come up so you can contact them.  I tried to post the link to the Attourney, but \"Possibly\" Samsung made Amazon take it down, so hopefully you can find it from a google search.  Good luck :)", "Date": "April 21, 2013"}, {"Title": "Would someone verify width dimension, please?", "Author": "Patrick K. Mckillip \"PKellyMc\"", "ReviewID": "R2HVBRMORNJU7B", "Overall": "5.0", "Content": "The Amazon write-up page for this TV lists conflicting dimensions (36.6, 37.6), and the difference is critical for it fitting (or not) in my entertainment center. Would someone grab a yo-yo and measure the face width for me? Please email me @ pkellymcATyahooDOTcom", "Date": "December 14, 2011"}, {"Title": "SAMSUNG HD 3D TV (  Stupidly without 3D glasses to view with)!!!", "Author": "Alan I. Conway", "ReviewID": "R3JVK7T1XT4B0R", "Overall": "3.0", "Content": "A HD 3D LED TV. Very slim and very lightweight.Quite slow to bring a picture to the screen after initial turn on but then it gives you everything you need for today's TV viewing.Including very  high volume control, which is better than most for such a slimline tv. I can't comment on the 3D capability as the glasses didn't come with the set which I find quite strange. The glasses as an extra cost seems to defeat the whole point of purchasing a 3D option. Why do manufacturers do that? Wouldn't you think \" this is a 3D tv but you cannot watch this feature unless you shell out some more bucks to buy an integral part of it's features\" VERY WEIRDA good buy and value for money.Except for the very negative missing 3D glasses.", "Date": "November 7, 2011"}, {"Title": "Poor Tuner, Additional burdens on Consumer", "Author": "KingD", "ReviewID": "R1VI8M19QKWFZ8", "Overall": "2.0", "Content": "The onboard tuner for this unit is horrible! The only channels that come in clearly are HD channels. Basic analog CATV are the worst; representing bad washed out watercolors. DTV channels are also poor quality; they remind me of trying to maximize a window on the web where they attempt to magnify an image intended for an 8 inch screen, grainy with a heavy dose of tracing. Spending 30 minutes going through the motions with Monique (Costco Concierge) and Jamie (Samsung) left me with me with the impression that Samsung was aware that their tuner was sub par (although Jamie would not admit to it) she just suggested that I purchase a component with a HDMI output. I was left with the feeling of getting the run-a-round; Jamie suggested that I had poor quality coax, not so, I have quad shield RG6, and my 36\" CRT Sony had a crystal clear picture off the very same cable. I am very disappointed; I was planning on watching more than DVDs and 4 HD channels on this not-so-inexpensive piece pf equipment.It is also disappointing that this not-so-inexpensive television is not integrated with WiFi, it is WiFi capable, however, you must search out and purchase a proprietary Samsung dongle ($80) and it will also cost you one of your USB ports.Please consider including two sets of four bolts to accommodate 98% of wall mount brackets. My wall mount kit included hardware however; they are too long or too short as this unit has created an irregular situation in that their screw receivers are recessed by approximately 5/16\" (8mm) in addition to the screw stops - which I understand prevent damage to the unit. However, I must now run out and purchase hardware of the proper length and thread and hope that is not of a dissimilar metal.Incidentally, the picture from my blue-ray DVD really is beautiful-if that is all you plan on using it for.", "Date": "January 14, 2012"}, {"Title": "Great TV BUT...", "Author": "Cody Aaron Berning", "ReviewID": "R113DRU8VXOBXU", "Overall": "3.0", "Content": "got this tv a while ago, just know it's not True 120htz, its really 60htz untill you turn on \"game mode\" where the picture quality drops drastically but over all a great tv for day to day use!", "Date": "December 13, 2011"}, {"Title": "Packaging and Shipping Problems!!!", "Author": "Stephen Lau", "ReviewID": "R38G9K8J3A3K8S", "Overall": "1.0", "Content": "Brought this item during the holidays. Arrived on Jan 5th. A big dent on the front of the box. Not a good sign. Opened it. Obvious something punctured the box and the screen was cracked as anticipated. Filed a return form and waiting for a replacement. Hope the next one is better.The funny thing is that we also ordered a TV stand and it had 10 times more padding on steel frames and thick glass than on this TV. The manufacturer may want to rethink about their packaging and Amazon about their relying UPS to handle this delicate item. Will update more later... Not quite the way I wanted at this time", "Date": "January 8, 2012"}], "ProductInfo": {"Price": "$2,399.99", "Features": "3D glasses not included in box, must be purchased as optional accessory\nAuto Motion Plus 120Hz with Clear Motion Rate\nIt has full HD 1080p Resolution\nIt is Samsung Smart 3D HDTV\nIt is 3D HDTV", "Name": "Samsung UN55D6400 55-Inch 1080p 120 Hz 3D LED HDTV (Black) [2011 MODEL] (2011 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/31kuVg-rAlL._SY300_.jpg", "ProductID": "B004NZBAF2"}}