{"Reviews": [{"Title": "Must respond to bad reviews", "Author": "CMM \"cmmullin\"", "ReviewID": "R35IJKUJ481BGR", "Overall": "5.0", "Content": "I have bought more than 20 flat screen tvs, from plasma to lcd to led over the past ten years.  Every brand included. Just got this one because it fit perfectly into a 35 1/2\" wide cabinet.  I understand the frustration of the others with the misinformation about the wireless.  So beware if you intend to stream wirelessly.  However, this tv produces a beautiful picture.  The preset calibrations (vivid, standard, etc.) are not of much use.  Go with vivid, reduce all settings 10-15% except for hue, which you will want to increase into the green range (Apologies to the videofiles out there). Might want to change setting from cool to normal, but not big difference Picture excellent and as good as my LG 5500 led, Sony w4100 lcd, Samsung 630 lcd (model numbers not exact, recalling from memory).  The reviewer reporting terrible picture likely either has it miscalibrated or has a bad input signal. I have LAN hard wired to my router, works great.  Very happy with this purchase.  Arrived in 3 days even with free budget shipping.", "Date": "March 31, 2011"}, {"Title": "Best Bang For The Buck!", "Author": "Finch", "ReviewID": "R1N83XFDZHHFYP", "Overall": "5.0", "Content": "Outstanding HDTV for the money!  Before getting this one, I tried a top-of-the-line 37\" HDTV that cost over a grand but this one is just as good for my uses (TV, BR, Xbox/Wii, Netflix streaming) and cost about half.I wanted a backlit remote control with my new TV.  So I did some research and found that you can buy replacement parts for Panasonic TV's very easily.  You can even get them directly from Panasonic!  Google panasonic parts and accessories to see the details.  Anyways, a backlit remote that works great for this TV is part number N2QAYB000486.  Cost me about 20 bucks.A few of my favorite features that may not be easy to find:Physical power/input/channel/volume buttons on side of TV (Not those stupid touch buttons that you can't see or feel where they are)Netflix works great!  I'm not sure the actual resolution but it looks like 720pPros:EXCELLENT viewing angles from both sides and topNot the fanciest design but it's the most functional. Solid, well balanced, no annoying lightsGreat picture (I'm not an expert but it looks just as good as my plasma and better than almost all LCD tv's I've seen)HDMI USB and SD card inputs on left side (in addition to the ports on the back)Generates almost no heatCons: (I'm stretching to really find very many of them)Power cord is permanently attachedIt's relatively heavy, especially with the base (which is pretty heavy compared to other TV's)No backlit remote out of the boxIt doesn't brew beer!If you value functionality over marketing gimmicks, this TV is the best bang for the buck!", "Date": "October 14, 2011"}, {"Title": "Wonderful Picture, Exactly What I Hoped For and Expected!", "Author": "Steve in Seattle", "ReviewID": "R39F4D6ML0BZ3O", "Overall": "5.0", "Content": "I researched all the flatscreen TVs in the 37-40\" size category due to cabinet space requirements.  Bought a Sony 40\" and had to return it because my wife wouldn't let me take the doors of the furniture...  Looked at Vizio due to price, performance, cabinet size, and having owned one.  Did not find a model that met all the criteria.  Found the outgoing Panasonic 37\" model that came before this new model but it was getting hard to find at the firesale prices.  I saw that the new TC-L37E3 was being release soon and put it in my basket and waited for release.I liked that it had an ISP (In-Plane Switching panel) and the reviews of the previous model were favorable.  The cabinet width was perfect at 35.1 inches.  The fact that it was wi-fi ready did not matter to me since I already had an Apple Airport Express for the entertainment system and could feed a CAT5 cable directly to the TV.  Have watched Netflix, Amazon VOD, listened to Pandora, all works great.  The picture colors, sharpness, contrast, blacks, and viewing angle are fantastic and my wife and college age daughters have given positive comments.  I only had to tweak a couple settings to get it matched to the room lighting with windows/blinds to the rear.  Since it was a new model the first week out in release, my Logitech Harmony One remote did not have the canned codes available.  A little training and the fact that the channels and volume are usually changed through the Cable/DVR and the A/V receiver result in no impact.  I also like the optical digital out for playing internet music out to the stereo.I am getting used the the small delays in the HDMI handshaking going on between the Motorola DVR, NAD T747 Receiver, and the TC-L37E3.  Bottom line is that now that they are all hooked and set-up, they are working fine together.Very Happy with the purchase!", "Date": "March 24, 2011"}, {"Title": "Not great, but not that bad either", "Author": "Titohov", "ReviewID": "R2TA5LLDUBZMUL", "Overall": "3.0", "Content": "Things I like:The picture/color are good. Like the 1080p for bluray. Menu screens are decent. Physical appearance is attractive. Seems fairly well made.Meh things:My unit has some serious light leaks around the top and bottom. I do notice it while watching the TV in dark scenes sometimes. It's annoying, but I'm living with it.Sound on this TV is typical of any flatscreen. Sound comes out of the bottom of the unit so it's a little muffled and not great. I've gotten used to this over time though.The specs on this TV say it's 1.7\" without the stand. This simply isn't true! I'm not sure how they get away with this. They don't show you a profile picture of the TV, but the bottom actually protrudes at the bottom and it actually 2.75\" at its widest point. I have my unit mounted on an articulated arm so it doesn't matter for me, but this should be noted if someone else thinks this thing will sit 1.7\" from their wall because it won't. Very misleading IMO.Power cord is permanently mounted to back of TV so you can't attach a longer one directly. This was bad for me because I have mine wall-mounted with the cord fed down inside the wall. I had to use an extension cord which is attached halfway down the wall. This isn't ideal. I would have preferred to buy a 10' power cable from monoprice to run the whole distance.Overall it's a fine TV. I found it hard to find decent 37\" TVs out there. It seems like it's a weird size that there aren't a ton of models of. If you get this one, hopefully yours doesn't have light leaking as bad as mine. Good luck!", "Date": "June 25, 2011"}, {"Title": "Excellent LED LCD television", "Author": "monkeybrains", "ReviewID": "R295SO145JZKKP", "Overall": "5.0", "Content": "I purchased this television for our bedroom, and we're quite happy with it.  I highly recommend using a calibration DVD (I used Avia) to set the picture settings, as the ones from the factory are indeed crap! (like almost all modern TVs.  Why is that?)  The \"standard\" setting is way too low contrast / washed out, and the \"vivid\" setting has contrast so high that the shadow details are completely lost.  I found that the \"Game\" setting tuned to [Contrast +90] [Brightness +57] and [Color +40] was about perfect, now that I have it calibrated the picture is even better than I anticipated.Pros:Incredible picture!Embedded Pandora & Netflix players work fineLots of HDMI inputsIt's SO LIGHT AND THIN!So/so:Sound - decent but not stellar.  About what you'd expect from embedded speakersCons:No embedded WiFi (works with external adapter, purchased separately)", "Date": "May 20, 2011"}, {"Title": "5 Stars if VIERA Connect Added", "Author": "BCWest \"gstobbe\"", "ReviewID": "R1K1WI3GRCY1FS", "Overall": "4.0", "Content": "I diligently researched for a 32\" LED LCD, 1080 HDTV with DLNA and WiFi or a LAN port and the ability to utilize the Audio Return Channel via HDMI with my new network-connected AV receiver. My searching revealed this 2011 Panasonic with a LAN port and the ability to purchase a WiFi adapter made by Panasonic. I have been very happy with this TV right out of the box and even more happy once I worked my way through the TV settings and set up the multi-device remote that came with it. The picture is crisp and bright with dark blacks and a wide viewing angle, and the tuner draws in top-quality local TV audio and video even over my amplified indoor antenna. This TV will get 5 stars from me, though, only if Panasonic adds VIERA Connect, something I would expect to find on all 2011 Panasonic IPTVs to allow a more robust internet experience and allow the use of the iPhone and iPod Touch VIERA Remote app. Perhaps VIERA Connect will be included on a future firmware update?", "Date": "May 25, 2011"}, {"Title": "An very good flat screen", "Author": "Gerry", "ReviewID": "R30W575XW06IL4", "Overall": "5.0", "Content": "The Panasonic HD TVs receive very good reviews both here on Amazon and on other sites. I am not going to go into all the details that are already in the other reviews since I don't find redundancy useful. I purchased this model after viewing the 32 $ 37 inch versions in local stores. I couldn't find the 42 inch model locally so I ordered from Amazon at what I consider a fair price along with the free return policy. The set is performing flawlessly after a month and a half. Both my wife and I are very happy with the picture and over all performance. We added a Blu Ray player and 1080p discs look excellent. I don't have a negative thing to report at this time. I haven't upgraded to a home theater system yet so I can't comment either way on external audio system compatibility.", "Date": "June 14, 2011"}, {"Title": "Rather Disappointed", "Author": "Fotobaron", "ReviewID": "R1MPPNWRRHSC5Q", "Overall": "3.0", "Content": "As most of us do, I researched \"wi-fi\" ready TV's and chose this particular Panasonic for a variety of reasons, not the least of which was that it is advertised as \"wi-fi\" ready.  I already have a Roku hooked up to another TV but didn't want to deal with yet another electronic box.  Well, I found out what Panasonic means by \"wi-fi ready\" when I powered up the TV, did the initial set-up and clicked on the wi-fi option.  The TV immediately displayed a message telling me that there was no wi-fi adapter in place and instructed me to BUY one in order to take advantage of the TV's wi-fi capability.  Huh?  So suddenly and unexpectedly my TV costs $90 more.  Not a nice surprise.  False advertising?  Bait and switch?  You decide.  Anyhow, the adapter has been ordered; I'll update this review when it arrives and IF \"wi-fi\" is then truly ready and the TV works as promised.One pro: A terrific, easy to use remote.  I like it a lot with its many control options and appreciate that it connects to my Viera-capable Panasonic Blu-Ray DVD player.Three cons:  First: the picture quality doesn't begin to match my more than 2-year-old Sony Bravia 32\" LCD TV, neither the color nor the sharpness.  Second: I'm having a devil of a time coming up with a pleasing color/brightness balance, a challenge I never faced with my Sony.  Three: at this point, the Panasonic codes don't work with my DirecTV remote.  I spent an hour on the phone with a DirecTV technician without success.So that's my story. I'm both disappointed and annoyed with Panasonic, a usually reliable and customer-friendly company.  But I'll give the new TV a fair chance before I make a final decision.  And thanks to Amazon for the very useful TV evaluation period.", "Date": "March 11, 2011"}, {"Title": "Good TV", "Author": "Shai Farber", "ReviewID": "R2OCMM1UNT6BLF", "Overall": "4.0", "Content": "I meant to purchase an LCD TV that has 120Hz scanning ratio with an LED back lighting. For some obscure reason, I thought that the L42E3 has it! :( Since the TV was meant for my bedroom, and until I uncrated it I did not realize that I was wrong, I decided to to give the TV a try. To my surprise, the picture was much better than I expected, even with fast moving objects on the screen. While one can see some blur in the fast moving objects, they are much less noticeable than in my older LCD (4 years old) that I replaced. In slow moving or static screens, the picture rivals my LG with 120Hz scanning that is in my living room, and it has better black level retention than the LG. I would have given the set 5*, except for the lack of 120Hz scanning ability. Recommended.", "Date": "August 26, 2011"}, {"Title": "37\" Panasonic LCD TC-L37E3", "Author": "Gary S. Lurie", "ReviewID": "R1X5BU4VVOEOEU", "Overall": "5.0", "Content": "I have been looking for a 37\" TV to fit into a particular piece of furniture for over 2 years.  Everything has been too tall by 1/2\" or more.  This is a newly announced TV that is packaged perfectly.  It has great features and a great picture.  If you are hooking it up to a wired internet connection and are using a hub in addition to the router, you cannot connect the TV to a hub port.  It has to be on one of the router ports.  It took a long time with Panasonic support to figure this out.  That said, the support line was great and appeared to be US based.My only real negative was that Amazon did not ship the set when they said they would.  It was in stock but my order got screwed up twice.", "Date": "April 22, 2011"}, {"Title": "Panasonic VIERA TC-L37E3 37-Inch 1080p LED HDTV", "Author": "scrivener", "ReviewID": "R3A38CP1ISSEZY", "Overall": "5.0", "Content": "My wife and I purchased this TV as a Christmas gift for each other. This is our first \"large\" screen flat panel TV (compared with our old 27 inch CRT TV). We got the 37 inch because we felt that the 42 inch size would crowd the space near our room's doorway. The picture is exceptional, and we really appreciate the wide viewing angle with our room set-up. The contrast is great. It looks good both in daylight and at night. While we do not watch in a dark room, we do not have the light leakage problem mentioned elsewhere. If you look into the heat vents in the back, you can see some light, but it does not radiate from the unit. I really like the LED backlighting, and the fact that the set uses only about 40 Watts when operating. The sound is decent, not theatrical, but probably what you would expect from built-in speakers. It is good enough that I have no plans to add speakers. This model has only digital (optical) audio out. It turns out that our audio receiver, purchased only several years ago, does not have this. Happily we do not need it. The TV is \"internet ready\" if you have hardwire ethernet or a Roku or Apple TV box. Wi-Fi \"ready\" means that it is ready for you to purchase a Wi-Fi USB dongle. I did purchase the Panasonic DY-WL10 wireless LAN adapter, which runs 802.11n at 2.4 or 5 GHz. We have relatively slow 3.3 Mbps DSL service, the best that is available to us. (That's 3.3 Mbps, not 33 Mbps - not a typo). I thought that 802.11n at 5 GHz could handle anything that 3.3 Mbps DSL could offer. However, I was disappointed by constant rebuffering and interruptions to movies using the built-in Netflix application. Finally, I strung a Cat 5e ethernet cable from our DSL modem/router to the TV and the problem went away. I broke down and snaked ethernet cable through the walls and basement and up to the TV, and I have had no problems since. Your experience may differ, especially if you have broadband internet, but I really think the limiting factor is the USB Wi-Fi dongle. Pros: great picture, wide viewing angle. Cons: needed a hardwire LAN for Netfilx streaming (at least for me). Overall, I really like this TV.", "Date": "January 7, 2012"}, {"Title": "Perfect for gaming.", "Author": "Chris Rosewill", "ReviewID": "R2OJC67QO9P18Z", "Overall": "5.0", "Content": "If you are looking for a TV that will mainly be used for gaming than this may be the one to go with.  There is basically no input lag when playing video games.  The picture is fantastic and their is very little glare on the screen when playing in a bright room.  The remote is the same as other Panasonic TVs which is to say very good.  You will also be hard pressed to find a TV in this price range with internet streaming capabilities.  It does lack built-in WiFi but you can hook your laptop or router to it and you have the streaming capabilities.  You can not use any generic wireless LAN adapter so you will have to shell out $60 for the official Panasonic one.  The picture quality is fantastic and that is to expected with it being an IPS Alpha Panel.  I purchased for $300 while on sale but even for $450 it would still be a good buy considering the prices of similar TVs from other brands.As other reviews have mentioned the bottom is about 3\" thick while the specs say it is 1.7\" thick.  While this was no big deal to me and I knew based on reading reviews it still sucks that they lie about the thickness of the TV.Pros;1080p4hdmiLEDInternet Streaming AppsCons:60 HZ (Doesn't matter for video games)No built in WiFi(easy cheap solutions)Overall I am extremely happy with my purchase.  With it being a Panasonic you know your going to get a quality TV.  Yes there are cheaper TVs out there but their picture quality and features will be lacking when compared to this TV.  I recommend you spend the extra money get this great TV.", "Date": "November 24, 2011"}, {"Title": "Great value, lots of caveats, found a good wall mount.", "Author": "whysofma", "ReviewID": "RFHS9WJJD3J2C", "Overall": "4.0", "Content": "This is a fine TV for a fair price. The picture is great and the operation is very nice. The OTA HD broadcasts look great too. Here are my issues with this set:Internet Issues:The Viera Connect/Easy IPTV currently (dec 2011) supports Netflix and Amazon on demand very well.1. I purchased the NETGEAR RangeMax WNDA3100 Dual Band Wireless-N Adapter to enable these services because I don't have a wired Ethernet drop nearby. Configuration was very easy except: since my network password (PSK) has all kinds of crazy characters (!@#$%&*()<> more than just upper/lower alpha numeric) I had to attach a USB keyboard to the television to enter the PSK to attach the TV to my wireless network. If you have a simpler password or use that autoconfig where you press the button on your router and network adapter, this won't be an issue.2. The Internet connection drops after I turn off the TV, but NEVER during a Netflix/Amazon TV show. So I have to go into the menus, go to network connection, select the Network test. That fixes it up fine. This might be a symptom of my FiOS router and configuration, or it might easily be fixed with updated HDTV firmware. (ED: Jan '12: I realized that it just takes longer than you'd expect to connect to the wireless network. If I turn the TV on and wait about 2 minutes, the network apps always execute without going to the Network Test)3. I don't use the other \"apps\" (facebook, pandora, and 2 more).4. The DLNA feature works really well! I have a DLNA-compliant NAS (LaCie Network Space 2 1TB Ethernet Network Attached Storage Desktop Hard Drive 301515KUA). The TV found the server with 0 configuration and lets me browse the files and directories. The same videos that I encoded with DVDFab for an iPhone/iPod played beautifully on the TV. MP3s played without any problems too.5. I plugged my laptop via HDMI into the TV to watch HULU content and view my desktop. Perfect! Beautiful! Instant 32\" monitor with sound via HDMI.6. There is no HULU Plus app for this TV. The Viera Connect APPs are only available on Panasonic's higher end, 3D TVs last time I checked (Dec 2011). I don't know what's stopping anyone for developing more apps, but I was disappointed that Panasonic's Easy IPTV only offers Netflix/Amazon.Wall Mounting Issues:Many people have complained about mounting the TV since the deepest part of the TV chassis is the speakers behind the lower bezel; The rear chassis sets behind the VESA mounting points by about an inch. I decided to try the Cheetah Mounts APTMSB Flat Screen TV Wall Mount Bracket for 32-55\" Plasma LED LCD TV Includes Free 10' Braided High Speed HDMI Cable With Ethernet, which is spec'd at Low 1.9\" Profile. This mount worked well. The mount includes plastic spacers that are ~1/4\" deep. So I placed these spacers between the vertical mounting arms and the TV's threaded VESA mounting sleeves. This effectively pushed the arms out by 1/4\". By doing so I was able to angle the TV about 10 degrees downward - it worked perfectly, although the TV's bottom, rear is resting against the wall, it's not completely floating off the mount. My guess is that if you choose to mount the TV without any downward angle, you will have no problems with this mount and no-spacers. But I didn't try that.I'll also add that you need to buy 4 x 20mm, M6 metric screws to secure the mounting arms to the TV in the VESA slots. I found mine at the Orange home improvement store, in their specialty shelves. (20mm long using the 1/4\" spacers. The TV's manual tells you how much depth you have to work with, I think it's 9-17 mm, but check for yourself.I would buy this again and suggest it. Although it's really helpful to be computer/networking savvy to get the most from the TV.", "Date": "December 29, 2011"}, {"Title": "Great first HDTV experience!", "Author": "Jonathan Estrada", "ReviewID": "R2KQNWC5I7Q2H1", "Overall": "5.0", "Content": "This was my first HDTV purchase ever, so I did a lot of research on similar sized/priced LEDs. This TV offered the most features for the lowest price and from a well known brand.First off, I was able to snag this TV at a very low price a few days after Black Friday and with all the good reviews, I made the plunge and ordered. I have been using the TV for 3 days now and I love it! The picture of the set was really impressive, although I found the default setting a bit too dim for my tastes, so I use the GAME picture settings and it is perfect!  I will add some pictures of the TV in action above so you can see how sharp the picture is. If you are concerned that the TV is 60 hz and not 120, don't be! Motion on the TV is very smooth during sports and videogames. I've read from multiple sources that most people can't tell the difference between 60 hz and 120 hz anyways, and is not really a worthwhile reason to shell out an addition couple hundred dollars.I did not have any issues with light leaks or any discernible lag while playing video games , as other reviewers had reported. I got the 42 inch version and it is perfect for my living room, which has about a 9-10 ft viewing distance. The TV has a wide viewing angle as advertised, as the picture looks good no matter where you sit. I have not tried any of the internet settings, as I have a PS3 which has most of the features already, without having to purchase the wifi adapter or run a cable. One thing I like is the amount of inputs and that I can label each input (one for PS3, one for my Mac, one for Wii, etc.) so I don't have to scroll through each one and memorize what's hooked up in that spot. This is also helpful so other people can use the TV and inputs without needing any instructions from me!For my current setup I am using a multidirectional antenna to get free local HD signals and I have my Mac Book pro hooked up to the TV via MiniDisplay to HDMI cable, so I can watch anything on my computer on the TV. The TV works very well with my setup and I have not run into any problems with this setup! Let me know if you have any questions and I'll do my best to answer them!UPDATE 12/13/11I wanted to add an update since I have found a way to hook the tv up to my MacBook Pro in order to access the internet capabilities on the TV (essentially using the Macbook as a portable router). If you want to know how to do this, instead of buying the Wifi dongle or running a long cable all the way to your router, leave a comment and I'll tell you. It has definitely saved me some money. As far as the internet capabilities go, I love how its easy to access Netflix, Facebook, Pandora, Amazon Video, etc from a push of a button on the remote. The different programs appear at the bottom of the screen without interrupting what you are watching. The bad news is I have found that the user interface for both Netflix and Facebook are easier to use and smoother on different platforms, namely my PS3 and Macbook. Netflix is somewhat cumbersome to navigate through on the TV compared to the experience on my PS3. If the TV is your only option for Netflix, then the TV is absolutely suitable. The issue really is that each category is under a separate tab and each tab takes a little while to load, whereas the PS3 seamlessly transitions between categories. This does not change my initial rating, as the TV still has an outstanding picture with great sound for my needs and the internet capabilities were not a factor in my purchase of this TV.", "Date": "December 4, 2011"}, {"Title": "Sweet Picture; A Bit Dissappointed with IPTV Internet Apps", "Author": "Joshua Naylor", "ReviewID": "R1QMDQRWIXJ4OI", "Overall": "4.0", "Content": "A wanted to wait a few weeks before writing this review.  That way I could explore as much of the TV as possible.Before I begin, I should say that we are not a big TV family.  In fact, it took a lot to finally make this purchase, as we had a perfectly functining tube TV in our living room.  But I was wanted to enjoy football and baseball in HD as well as the evening news.  Also, we grab our signal off a roof top antenna, so this review might interest those who share a similar TV experience.So first, the picture is awesome.  Everything from the weekend sports, to the evening news to the kids' shows look great.  After adjusting some of the factory settings (switch to VIVID and increase the brightness a bit) I was very pleased.  And the 60hz is not a problem at all.  I can't see blur or lag that people sometimes talk about.  Besides, a TV friend told me that most / all broadcast signals are in 60hz anyway.Now for the tuner:  I had an expectation that maybe a newer tuner would be able to pull in MORE channels... but not true for this TV.  The tuner is equal to the quality in our (now obsolete) digital converter box.  We still get all the same channels as before.  So was I a little dissappointd with the tuner?  Well, honestly I was hoping for better, but maybe that is unreasonable... maybe there is nothing better, because we basically get all the channels that we are supposed to get.You will find the TV to many hook ups in the back.  4 HDMI is more than I will ever use.  A PC type monitor jack allowed me to temporarily hook up a laptop last week.  (that was pretty neat)  The only slight \"bumber\" is that there is only one set of old fashion RCA audio / video jacks.  So since we still have a VCR, regular DVD player and a WII... all of those cords have to get channeled into one input on the TV.  (I just have to use the VCR as a huge junction box.)  But there are Blue Ray plugs, a digital audio out and even an SD card slot.Now for the main reason I am writing this review:  The INTERNET IPTV PANASONIC VIERA APPS.  I really wasn't sure what I was getting before actually turning on the TV and hooking it up to the internet.  (I thought, though, that I was going to get a whole lot more... guess I was wrong.)  First, as you may have figured out from other reviews, the TV is wireless ready, but you will need to BUY the device that makes it pick up a wireless signal... that could be $30 - $60, depending.  Now, I wasn't going to spend that money when I could buy a $10 ethernet cableMediabridge - Blue RJ45 Computer Networking Cat5e Ethernet Patch Cable - (100 Feet) and get a faster hook up anyway.  So I decided to hardwire the TV.  In order to get the TV to recognize the signal, I had to do a firmware update through Panasonics website.  Not real hard.  Just required downloading the file onto a blank SD card, inserting the card and letting the TV do its thing.  (I did do it with help from a CSR just to be sure it was done correctly... you had to turn the TV off at the right time.)  So now the TV is online.  Now I discovered exactly what apps I got.  Basically, here's the bottom line (after talking with Panasonic again)  You only get Netflix, Amazon Instant Video, Cienma Now, Pandora, Napster and that's it.  I thought maybe I would be able to surf the internet - wrong.  Then I thought maybe I would be able to download more apps.  I read and watched various panasonic reviews displaying their awesome 2011 Viera TV's and all the news sports apps you could download.  Well, not on this model.  This model apparently does not have the ability to download more apps because it doesn't have \"Viera Market Place.\"  I was hoping I would be able to watch some more things (not available through the antena signal) but that would be available through the internet.  So, I am a little dissappointed with this, but maybe, just maybe there will be some firmware update that will improve this TV's IPTV options.  On a positive note, the apps that are on the TV do work.  We can listen to the radio and even download some free Amazon videos (as well as rent some at $1.99)  So, what I have does work.Bottom line... the TV is great.  We still don't watch much TV, but when we do watch it, the picture is very enjoyable and I am more than happy that I waited until January to grab this TV at real deal:  $529", "Date": "January 28, 2012"}, {"Title": "Great TV, with great picture...only one complaint...", "Author": "J. Moore", "ReviewID": "R12KDK4J40IS9H", "Overall": "3.0", "Content": "We purchased this TV through K-mart (so we could use Sears card) and while we didn't get as good a price as listed here on Amazon, for the money we paid, this was a good buy.  The picture is absolutely amazing, and the sound isn't too bad.  My only complaint is that I purchased this for its \"internet ready\" capability only to discover it isn't truly internet capable out of the box...you need an adapter to access those capabilities.  Originally, the Panasonic dongle (Panasonic DY-WL10 Wireless LAN Adapter) was upwards of $60, so I searched for a lower priced alternative.  Of course, both failed miserably.  So as I printed the return label for the second one just a few minutes ago, I searched for the original Panasonic part to see it offered at less than $40.  I am reluctantly going to purchase...I say reluctantly because I have a little CD (cognitive dissonance) when someone advertises a product to be internet ready and when you get it out of the box, you discover it really isn't.  Why not just increase the price a bit and include the dang dongle in the box?  Annoying...................... >:-{  But for a 37\" tv with this quality picture, you'd pay a lot more for a comparable Sony, so I'll quit my whining and buy the stupid dongle :)UPDATE, 1/15/2012:  So, I broke down and purchased the Panasonic DY-WL10 network adapter because the two other 3rd party dongles I purchased would not work.  As I briefly stated above, I had originally sought non-Panasonic dongles because the Panasonic one was expensive, but you can now purchase it for around $40 (do a quick search, and you should find plenty of options).  I got my adapter, plugged it in, and while it \"found\" my router, it would not connect.  Despite this being the proper adapter, I ended up spending over 3 hours on the phone with Panasonic support (800-211-7262) trying to get a connection.  First, I had to download a firmware update.  Still, nothing.  As it turns out, the main reason it would not connect was because the \"security type\" field in the network settings did not automatically populate to indicate \"open\", something I ended up figuring out on my own while I was on hold waiting for the rep to research the problem.  Once that was resolved, the customer service rep was able to assist me in adjusting my DNS and IP settings to get it to connect.  In all fairness, it is possible the adapter's ability to connect may be dependent upon your ISP (I have Verizon FiOS), but the CSR kept insisting that it was a faulty password when it wasn't, so they get a poor grade in terms of technical support.So, while the adapter does work now, I must admit I am less than excited about the limited quantity of apps in addition to the limitations of the Facebook app, which only allows you to view a limited amount of posts (not to mention I have yet to figure out how to actually post anything).  For all of the steps you have to take to get to Facebook, I'd rather check on my smartphone!  The only other apps are Netflix and two music apps, which is quite  paltry.  You also have to completely exit TV viewing in order to use them.  Had I known, I would have opted for a non-smart TV and gotten Google TV.So, while the picture is very good, a part of the price of this set is the \"smart\" TV, which isn't so smart.  There are less expensive options for picture quality out there that I would highly recommend you pursue before this one.  If you are specifically looking for a smart TV, I think the Sony or LG models with Wi-Fi built might be  far superior to this one.  Or--and this is what I would have done had I known--just purchase a set with a picture you like and purchase Google TV separately.Since the Smart TV capability was one of the main reasons I purchased this set, and I am pretty disappointed in it, I downgraded my rating from 4 stars to 3.", "Date": "December 27, 2011"}, {"Title": "Nice network ready display", "Author": "E. Bennett \"Shopsalot\"", "ReviewID": "R1ARDF1ZIIKRFL", "Overall": "4.0", "Content": "I like this display and the network port. It has plenty of HDMI, the remote is decent and built-in Netflix and Amazon video very nice.  I do wish it had WiFi as running a network drop was a pain, but it did give me an excuse to move the cables into the wall.  In hindsight, I probably should have gone with the 37\" display as it looks small in the bedroom.", "Date": "August 27, 2011"}, {"Title": "dishonest use of the LED TV description", "Author": "David G Carter", "ReviewID": "R22D5BFBHYBVB9", "Overall": "3.0", "Content": "Buyers should be aware of a recent change in how TVs are described.  LED TV used to mean back-lighting by an array of LEDs and \"Side LED\" for where the usual fluorescent light is merely replaced by a line of LEDs.  Both are better than regular LCD screens but the side-lit still suffer from the edge brightening and do not have as high a dynamic range.  Blacks aren't as black.What you get with this and other side lit LED screens is about the same picture quality as cheaper LCD screens but in a thinner case with a lower power consumption.  If you want the very best picture quality, don't settle for anything less than back-lit LED, such as those made by Samsung and Sony.  The give away is the very thin edge, which means side-lit.  If its a couple of inches thick, its more likely to be back lit.  Actual specs are suddenly hard to find.", "Date": "May 2, 2012"}, {"Title": "Excellent picture, close to the best I've owned", "Author": "wtm071 \"Retired Amazon shopper\"", "ReviewID": "R12RA2GH8BXU8L", "Overall": "5.0", "Content": "The Panasonic TC-L37E3 has only been in my house for a short time, but so far am extremely impressed! I have owned Sony's, Samsung's, Vizio's & Panasonic plasma's and this so far has the best picture quality! Was worried reading some of the reviews as to light bleeding, poor sound, but this one has none of those problems! Netflix, Pandora and other apps. easily accessed! Great remote and build quality appears to be 1st rate. I will add that Amazon again has impressed me with a less than 3 day delivery and the best price of all vendors!Panasonic VIERA TC-L37E3 37-Inch 1080p LCD-LED HDTV  Purchased 11-28-2011", "Date": "December 1, 2011"}, {"Title": "Just Ok", "Author": "JT", "ReviewID": "R3RA5O2EUXSV1", "Overall": "3.0", "Content": "Go this Panasonic and the style looks great. The picture quality is good, I have a 720p panasonic plasma that looks about as good as this. My issues with this tv are as follows1) Need an adapter to get wirelsess internet2) It is alot thicker that it says in the description3) The most important flaw, there is a significant amount of light bleeding through at the edges of the tv. Mainly at the bottom of the screen. It is definatly noticable and dowright annoying after spending over 600$ on a tv I would expect it not to have this problem right out of the box. The picture qaulity is good and for the price all in all it is not a terible buy.", "Date": "November 13, 2011"}, {"Title": "Nice TV, but Wi-Fi set-up was problematic!", "Author": "Florida Shopper", "ReviewID": "R35K1D76N5S9Q8", "Overall": "3.0", "Content": "I bought this TV as it is an affordable, quality option for an LED with Wi-Fi (based on reviews). I was aware in advance a wireless adapter would be needed. I also wanted one remote to operate both Netflix, etc, and the TV. I finally got my result, but not without a lot of work on my part.The TV itself has a nice picture, intuitive menus, and is overall a nice product. My issue with it is the recommended wireless adapter (Panasonic DY-WL10) was not compatible with my Netgear WNDR3700 router.  First it was hard to connect at all (had success after a call to Panasonic). Then it dropped the signal constantly after 5 minutes or so. Rebuffering, Netflix not available right now, etc.  FYI this happened despite a 5 bar 5G connection (tried it with 2.4G,also 5 bars same result).  Thank goodness for the reviews on Amazon where I read others with Netgear routers had the same issue. I purchased a Netgear - N600 Wireless-N Dual Band USB Adapter (Model WNDA3100 v2 - make sure you get the Version 2!) and in 2 minutes I was connected properly and stably - and for a lower price!My issue is with the TV they do not tell you the Netgear router and Panasonic adapter are not compatible. The recommend just their brand dongle instead. I wasted a huge amount of time figuring out how to fix the issue. Their TV manual, specs and tech support should advise buyers about compatibility issues. I can also fault the adapter for not listing compatibility.So, a good result, but minus 2 stars for putting me through the ringer on wireless set-up.", "Date": "March 14, 2012"}, {"Title": "great picture", "Author": "herb", "ReviewID": "R4I3I8H7FDYXN", "Overall": "5.0", "Content": "I was glad I waited to get the right TV for us. Features all live up to what they claim,love the VIERA . Works great with new computor pluged in with HDMI. Very satisfied", "Date": "March 10, 2012"}, {"Title": "a worthy set for any room", "Author": "N. Gularte \"mkitwork42\"", "ReviewID": "R3W4FX1J9FM6NE", "Overall": "5.0", "Content": "As many of you, I also spent a good year (minimum) reading reviews, looking for deals, going to electronics stores and comparing screens. I had a number of criteria for choosing a screen:1. low energy usage (the tcl-42e3 sips watts in comparison to its rivals,40-60 watts)2. light-weight (30.6 lbs-easy to pick up and mount on your own)3. resolution and picture quality (for instance-I didn't want a tv that would reset all picture settings when powered down,or have a mediocre viewing angle)4. simplistic design (no crazy large or embellished surround pane with lots of obnoxious or boastful advertising,too many sets cry out \"1080P, 60HZ, SRS-tru-surround, IPS, LED-LCD, HDTV\" and the list goes on, you get the idea)5. DURABILITY (this baby has a steel, albeit thin, backing, and the stand is very solid, very quality product)So, I wasn't looking for a tv with amazing speakers, absolute thinnest profile, most inputs, smart app. store, (or even internet connectivity), best gaming experience (high refresh rate) or fancy remote.I wanted a tv that would offer a clean, simple, beautiful cinematic experience. Needless to say, I am very impressed with this model. Even features I wouldn't be using are intuitive and effortless to use. The speakers really aren't that bad (pump the treble and bass up three clicks from 0) and the viera link apps are easy to access and offer a huge amount of media content. I output my audio to a receiver via optical SPDIF and input audio and video via HDMI from a The Boxee Box by D-Link HD Streaming Media Player (fantastic device) which pulls my music and videos from a little Pogoplug Multimedia Sharing Device, which is why I wasn't interested in tv speakers or app stores, just audio output options. The input and output options for A/V are PLENTY and I doubt many customers could find complaints.The blacks on this set are fantastic, (due to the 3 million:1 contrast ratio, backlight and sharpness settings) and the color-temp can be set imperceptibly close to true life colors.For those that want to use the network /internet capability of this set...save yourself $40 (wireless dongle cost) and run cat 6 ethernet cable from a gigabit router to the LAN port on the back of the set, bandwith is much better and you don't worry as much about how many devices are hogging your wireless signal.Viewing angle-awesome, I have the 42E3 mounted about 5ft up in a corner of the living room, so I view it from all parts of the room and even from below - no significant variation in the light coming through at different angles.I recommend this product to anyone in the market for a tv with the feature set I have listed. Good luck and enjoy!", "Date": "February 9, 2012"}, {"Title": "Great Picture", "Author": "Zignice \"Zig\"", "ReviewID": "R3NB5ZXB5E6D1J", "Overall": "5.0", "Content": "I have had several plasma and LCD televisions, by far this one has the best out of the box picture.", "Date": "October 17, 2011"}, {"Title": "Stunning picture!", "Author": "Eduardo Nietzsche", "ReviewID": "R1WXYB6J7KUN8W", "Overall": "5.0", "Content": "I chose this over a comparably priced Panasonic plasma due to the LED LCD technology, which results in far less heat, lower energy consumption, and an astoundingly thin and light form factor.  It hasn't disappointed...really stunning picture, sharp and with beautiful dark blacks, very wide viewing angle...and I haven't even calibrated it with my Avia DVD yet!  Even my 8 year old DVD player, using an even more ancient COMPOSITE VIDEO connection, gets a beautiful picture due to the TV's excellent built-in upconversion.  A few days later, my Blue Ray player arrived and its HDMI upconversion did improve the picture further, but no more than 10-20% tops.Setup was very quick and easy, the menu system is fairly easy to navigate---I had to use the owner's manual only sparingly.  I hooked this up to a $40 external amplified indoor antenna with a 15 foot coax cable (crucial point: place it far away from the set to reduce interference), and voila, all my local channels came through crisp and clean.My only wish is that the remote came with illuminated buttons for use in a darkened room.  And it would've been nice if the stand were adjustable so that you could raise the monitor an extra couple of inches if desired.  Otherwise, am very happy with my purchase.", "Date": "October 29, 2011"}, {"Title": "Aces for what I paid, but some QA issues", "Author": "Wolfy", "ReviewID": "R2TST0KP8UGZES", "Overall": "5.0", "Content": "I really wanted to update my two antiquated CRTs, but I had to start with my bedroom for a number of reasons. I researched for months on the web, spent countless hours looking at different Flat Screens at local B&Ms;, and I finally came to the decision to purchase this tv for my bedroom. That was sort of the easy part. After deciding to buy from BB, for easy return, I watched for sales online and instore. I finally caught a break, when this specific model went on sale for less than $450 at BB for about a week. By the time I learned of the sale, almost all BB in the country were sold out of this model. A BB, 3 1/2hrs away, shipped their last one to my local store for pickup. But when it finally came in 3 weeks later, the screen was demolished. At this point the sale was over and this tv was back to its regular sale price of $649.99, but they honored the previous sale price when I made a special order through the store to get this backordered item.Two months later I finally got my 37\" LED tv home. This is a considerable steal for the price I got it for, but my spirits were a bit dimmed when I unboxed the tv and found a QA issue right off the bat. The chassis was not put together correctly, so I spent the first 20mins taking apart the chassis and re-assembling the darn thing. Other than that and a bit of light leakage from the top and bottom, I really can't complain for the price I paid. The small light leak is only noticeable with top & bottom black bars, and is more likely another result of edge lit LED tvs.The one thing that did surprise me the most was the speaker sound quality, especially after hearing numerous general reports about horrible sound quality from new flat screen tvs. The speakers are mounted in the rear facing towards the wall.  As you can imagine the sound is much better from behind the tv.  I'm still thinking about getting a soundbar+sub to replace the sound, but at least it's not horrible while I wait.4 1/4 StarsPro:Terrific PictureEasy Set-upPretty decent speaker sound for a small roomDirt Cheap (Bought mine for $450 New)Lots of connections, including VGA (plug & play w/ computer)Completely synced w/ Panny Blu-ray player out of the box37\" is more than enough TV for my bedroomVery light (Replaced heavy 20\" CRT)Sleep Timer included (but not easily accessed)Con:Poor QA (Not even put together completely right)Bright Red Power LED on the frontOnscreen Volume Notification (Can't be disabled)No tilt or movement with stand (But already had a stand (from Skymall) for dresser, so no real issue.)Small amount of light leakGlossy frame (Might be distracting for those setting this up in a lit room)Summary: At $450 I'm more than impressed with this upgrade (welcome to the 21st Century), but with QA issues and some light leak, I have a hard time recommending this item at $600+. For that reason, I will probably be buying a backlit Samsung LED for my Living Room upgrade.Prior to making this decision, I researched all its info to the nth degree, so I knew what inputs it had, how it performed, the reviews/warnings from online, and the fact that it is only Wireless Ready not Wireless enabled.  For those that are disappointed by a non-QA or manufacturing defect, you can only blame yourself for not being a well informed consumer.Update: My slight OCD got the better of me.  I took the whole tv frame apart a few times and added Electrical Tape around the perimeter of the screen.  Only a couple of centimeters of tape actually went on to the viewing screen, and it is the part that is already being covered by the frame.  No tape was visible after the frame was placed back on, and now I have a hard time seeing any light leak at all.  If you plan to do this, I suggest extreme caution with both your fingers and disassembling (chassis is extremely sharp).  I submitted a picture of applying the tape to the frame.I also covered the Red Power Light LED on the front with a very small piece of electrical tape last night.  I could have disconnected it while I was inside the tv, but thought better of it.I've also come to the decision the speakers are really not very good, especially at high volumes, so I've added a AVR, 2 5\" JBL Bookshelf Speakers and a Outlaw 8\" Subwoofer to my Setup.  And yes this is going in a bedroom, but I haven't found any soundbars that I liked (including Visio's bestselling VSB200).", "Date": "November 18, 2011"}, {"Title": "Great Picture Quality", "Author": "J. Burns", "ReviewID": "R26TIHT0T7TYHO", "Overall": "5.0", "Content": "First off, I am not a videophile, just someone who likes to watch TV and movies.I have a pioneer in the living room and I compare everything to it. This Panasonic holds its own.When I'm over someones house and watching their TV, I find that I'm ofter thinking of the poor picture quality instead of the program or movie content.With this TV, I never think about the quality. That's a wonderful thing.", "Date": "April 2, 2011"}, {"Title": "I Like It", "Author": "Randy", "ReviewID": "R9V9NVLAKY2MP", "Overall": "5.0", "Content": "I received this about a week ago. It was given to me by the company I work for, for an anniversary present. Since I'm not much of an gadget person anymore, I didn't really care what it was, it was free after all.It has been working great. Setup took about 20 minutes, and I was impressed that with the high quality workmanship. All tv's I've seen in the past have been made of plastic, this one was a real surprise.Since I haven't had cable for 14 years, saving me thousands of dollars, I can't comment on that kind of reception. However, since this tv has a decoder in it, it found 23 free channels, and it did it with the antenna resting on the carpet, rabbit ears to us older folks.The picture is crystal clear.Would be happier with larger, louder speakers. My old home theater system does not allow for the new and improved I'm told HDMI hookups.So, now I have the opportunity to spend thousands more for updated AV components, which I have no intention of doing. So, I'll never be able to use all the functions this tv has, but as a tv, it's the best one I've ever owned.To use my old Pioneer AV equipment, I must go through the existing setup, and use the signal from the settop digital box the government GAVE me for $50. All because of a single cable which is not compatible with OLD audio equipment that still works great. Not a big issue, but one that makes the decoder in the tv a big waste of resources.The pc hookup is also of no use to me. It found my laptop, but didn't know what to do with it. The SD card thingy is cute, tried it out just to see if it worked, it did.The only thing that would hook directly to this tv, is my DVD player. The rest had to use the ganged up method, and ran through the coaxial cable. But, they all still work.A nice tv, nice picture, nice sound even if low, pretty to look at, high quality workmanship, and free.Can't ask for more.Sorry if my review seems lackluster. It's just that for us old stoneage 50 year olds, it takes an awful lot to impress us, and be cheap too.I do recommend this tv.", "Date": "April 17, 2011"}, {"Title": "not as advertised - misleading specs", "Author": "Mike Amazon", "ReviewID": "RDECOXETTUMXD", "Overall": "1.0", "Content": "On amazon, panasonic's site, and everywhere else, this TV is listed as being only 1.7\" deep without the stand. In reality there is a 3\" \"hump\" near the bottom, even without the stand, so the true depth is 3\" and this makes it stick out quite far if you want to mount it on a wall (which I did).  If you look VERY carefully at the technical drawing of it in the product images, you can sort of see that it is really 3\" deep instead of 1.7\" but I don't think most people are going to notice until its too late.  I do not think it is a coincidence that there are NO side profile pictures of it anywhere, whereas most led-lcd TV product photo galleries include at least one side shot to show how slim it is. When other manufacturers advertise a depth like 1.7\" that is the actual max depth.  Panasonic appears to lie about their depth on a number of led-lcd tv's that all have a hump near the bottom.This is what is listed:Dimensions  TV without stand: 18.9\" X 30.3\" X 1.7\" (H x W x D); 21 poundsWhile it should really read:  TV without stand: 18.9\" X 30.3\" X 3.0\" (H x W x D); 21 pounds", "Date": "November 11, 2011"}, {"Title": "all that we expected", "Author": "greta", "ReviewID": "R33YUG2Y7MS9D8", "Overall": "5.0", "Content": "The TV was delivered 2 days after we ordered it.  Panasonic VIERA TC-L37E3 37-Inch 1080p LED HDTVWe are old folks but set-up was simple and we were able to adjust the picture using the easy-to-figure-out handbook.  After a few adjustments the picture is great. We would recommend anybody to purchase this set and amazon is 'our' go-to dealer.", "Date": "March 19, 2012"}, {"Title": "Very good 32 inch", "Author": "Dennis", "ReviewID": "R2ZWLAD88SCR82", "Overall": "5.0", "Content": "I have found the Panasonic to be one very good 37 inch LED TV. When you set it up on vivid settings the picture is beautiful. There are three picture settings that work well with no fuss. It is a matter of your preference, the vivid, game, cinema settings just move to any of these settings with no fuss.  What is nice is the low amount of wattage that it takes to run it at those settings. Want the most economical setting use standard the wattage usage is very low. The amount of wattage that it takes to run it at any of those settings is like 1/2 of what it takes to run a Plasma 42 inch Panasonic.Haven't gotten a chance to try the Ethernet connection, but if it works like other Panasonic Viera, HD movies come through with no lag or stutter. I have a a cable connection and Internet through the cable company.Sound quality is more than adequate for normal size roomViewing angle is excellent and picture quality doesn't change as you walk around the room, or move up and down", "Date": "March 11, 2012"}, {"Title": "Very, very happy! :)", "Author": "Richard", "ReviewID": "R14VRCY1J4D69D", "Overall": "5.0", "Content": "Sometimes I just don't understand negative reviews. They can be so misleading and distracting, and can set you off on a wild goose chase looking for a perfect TV. Un boxed the TV today. Set up was a snap. The one exception was the plastic cord securing the electrical cord in the back of the set. Couldn't figure out how to open it. Cut it, but it still hangs in the back of the TV. After that, everything went smoothly. Picture out of the box is excellent. So easy. Comparable to the picture on my 2009 Panny plasma. Just love it. Got my blu ray player hooked up again with ease. The blu ray has internet access so no need to fiddle with internet on the TV. Again, very friendly setup. Beautiful picture without glare. Sound is not surround, but quite adequate for my purposes as a bedroom TV. Very happy. Love Panasonic products. Their TVs are great. So are the blu ray players by the way. Got a lighted remote that I ordered separately, and I'm in business. Don't let negative reviews sway or distract you from this set. It's very reasonably priced, Panasonic quality, and very friendly. Best wishes everyone. Oh, by the way, thank you Amazon for a great delivery experience, and a great price.Update on 2/11/12: Purchased a Panny SC-HTB10 soundbar(which now sits behind the TV due to space constraints that I had already accounted for), hooked it up to HDMI 1, and it is beautifully synced with the TV. Purchased the soundbar open box from Amazon. Really nice, rounded sound with great bass, even as it sits behind the TV. That and a Mohu Leaf Antenna make this TV shine. Picture is water clear. Only trouble is that it looks better than the 2009 Panny 720p plasma in the living room. Big difference between 720p and 1080p even on a 42 inch set at about 10 feet in both cases.", "Date": "February 3, 2012"}, {"Title": "Amazing for the price - goes head-to-head with 42\" plasma", "Author": "Silverface", "ReviewID": "R195L4WPTSET0L", "Overall": "5.0", "Content": "We bought this for a few reasons - Past experience with Panasonic Tv's and other equipment has been excellent;in the store under less than optimum lighting conditions the picture was outstanding (side-angle viewing blew other LCD and LCD/LED sets away); I wanted to set up a one-remote, easy to use TV/home theater system as we hate \"remote roulette\" and spending $200 on a Harmony remote doesn't make sense to me;  there was a promotion with the set heavily discounted and a Panasonic Blu-ray/home theater system bundled for $100.So for less than the normal street price of the TV we got the whole package, which requires nothingbut 2 HDMI cables and 30 minutes programming our Verizon FIOS remote.  The theater system knows when the TV is on and one on/off switch, one volume,one channel control and one input control (to switch to Blu-ray or DVD menu control)  are all that's needed (and if you have a DVR like we do it runs from the same remote as well). It's incredibly convenient and easy to operate.Now - the TV itself: we max out at 42\" due to space requirements, but anything larger would be harder to watch.  So we are at optimum viewing/listening distance.  The picture is flawless and the blacks nearly as deep as our 3D plasma set.  During the day reflections off the screen are minimal (and it's in a potentially bad spot with a large window nearby).  Where this set kills LCD's is in side-angle viewing; it is amazingly close to the plasma set, which was originally in it's place because of side- angle viewing needs (the 3D plasma is now in an entertainment/game room).Wifi setup and video streaming setup was simple (and do some Googling - you can use far less expensive adapters than the Panasonic unit).  If nothing's on TV and we want to watch something we just pop over to YouTube or Netflix.Which brings up another point.  I don't recall the specific technology, but this set handles fast motion very smoothly with no shudder or ghosting like many other LCD'sSo - with new models coming out almost weekly this one is probably a close out already - so buy one!  It's simply an excellent TV with a solid feature set and built by a company with a very high reliability rating.", "Date": "January 8, 2012"}, {"Title": "Best vertical viewing angle", "Author": "Mike C \"THX\"", "ReviewID": "R2OGEBNQXSH889", "Overall": "5.0", "Content": "I purchased the 42 inch E3 from Panasonic in December 2011 and really like it so far.  I primarily bought for the IPS video panel because I needed excellent vertical viewing angles, and this set delivers fantastically on that.  Incidentally, the horizontal viewing angle is just as good but was not a concern for my room.This set comes in a pleasant color (black) with no distracting bright blue LED lights - something that's lost on so many consumer electronics engineers out there.  And its dimensions are compact - even with the included stand it's smaller than most other 42-inch sets available today.Another thing I like about this is it doesn't have the 3D gimmicks, nor the 120Hz motion-interpolation features many manufacturers are providing these days.  I think the \"True Motion\" systems really make movies harder to watch, with very unnatural camera movement.  This set has a 60Hz refresh so it doesn't offer that annoying 'feature.'I run all audio through an external sound bar so I can't comment on the audio performance of this television.  And I use a Roku for Internet streaming so I haven't used the networking built in to this set.", "Date": "January 5, 2012"}, {"Title": "Terrific lED/LCD TV!", "Author": "M. T. Dinicola", "ReviewID": "R3UIWIZX1IYPMS", "Overall": "5.0", "Content": "Really terrific TV - beautiful picture, good sound, easy to set up. I spent almost a year reading reviews and looking at different TV's in stores and finally decided on this one and am very glad I did. At first was planning on either an LG or Sony, had not really considered Panasonic, but saw some in a store and it changed my mind. The store didn't have the size I wanted though. Bought it about 4 months ago  on Amazon - no problems. If my understanding is correct the entire screen is NOT LED, but just the central part of it, which allows for an LED quality picture while keeping the cost down somewhat. Not sure how this works or is explained technically, but you can't tell at all while watching it. Shipping was easy. Highly recommend this.", "Date": "January 4, 2012"}, {"Title": "Worth the $$", "Author": "Kenneth Wennemar", "ReviewID": "R2X94LBZF1TLS0", "Overall": "5.0", "Content": "This is a great set. The picture is very good even at distances of 12\". It is my desktop monitor, TV and Netflix device.I have a mint Linux desktop, so Netflix is an overly complex deal. I can access the site and manipulate the que, I just cannot watch the movies because Netflix refuses to release an executable that will run in the native Linux environment. So I looked at Roku and Blue ray devices that had embedded Netflix. But I really don't watch a lot of DVDs. A Roku is yet another device to find a place to keep it and better yet, power it. So a TV that does this is key. I chose the 37\" because a 42\" would be too grainy at such close viewing much of the time. I had a Dell 26\" and wanted one bigger.The other advantage is I bought a Panasonic SC-HTB10 sound bar. Panasonic systems work very well together. So I got rid of 3 sets of wires too.", "Date": "December 9, 2011"}, {"Title": "The Viera's are Great TVs", "Author": "J. Marken \"fly tailwheel\"", "ReviewID": "RL0N8W1PSD75W", "Overall": "5.0", "Content": "This is my 3rd Viera - they are great TVs.  The UI is very well done unlike some, and the picture quality is great.  We have a 55\" and a 50\" plasma version.  This one is LED but smaller, so the picture quality is as good as the larger plasma models, but the UI is the same and watching Netflix is easy.I still have a Panasonic TV I bought almost 30 years ago, and it still works great.  Kudos to Panasonic for producing quality products.", "Date": "April 2, 2012"}, {"Title": "Beautiful image but something missing", "Author": "hmm", "ReviewID": "R143BIRZX3WHH3", "Overall": "4.0", "Content": "First, let me say that the image is fantastic and this TV is great for the price.  I'm happy I bought it.However, I have a few criticisms:- There is no jack to plug in headphones.  My Sony has this as a standard.- I tried plugging in my iPod both via a USB and using those red/white wires (which also works on my Sony) to no avail. It will not play the music. I'm probably just not doing something right, but playing music on my Sony was easy.- Like most flat screens, the sound is crappy.", "Date": "March 19, 2012"}, {"Title": "Works great.  Love it.", "Author": "Bob", "ReviewID": "R3MR3ZGF0JPG24", "Overall": "5.0", "Content": "I've had the set for just over a month and am very happy with it.  It was delivered on time and it good shape. (the UPS guy even said that I'd love it).  Simple to set up and performs great.  I'd easily recommend a Viera to anyone looking for a new TV.", "Date": "March 17, 2012"}, {"Title": "Panasonic VIERA 37\" HDTV", "Author": "Old Timer \"Lee\"", "ReviewID": "RWKB3971FGUIB", "Overall": "5.0", "Content": "First, I preface this review by saying my wife and I are \"casual\" TV watchers - no gaming, no computer interaction, etc.  This TV was purchased to replace my 11 year old tube-type Panasonic, which is still working fine in the grandchildrens' play room.  That reliabiliy plus favorable reviews of the VIERO \"E\" series TVs influenced my decision.  Needless to say, the 1080 picture quality is a great improvement over the old set.  Color is fine and the automatic brightness adjustment with room lighting works great.  The user's manual is well written and pretty complete.  I had no trouble connecting the TV to a fiber optic cable box, a combo DVD/VCR recorder, a DVD player, and to my old stereo amplifier (via a D/A convertor for the optical audio output).  As a side comment, I took CNET Lab's advice and opted for bargain priced cables, which are working just fine for my installation.  I did have to find the cable box manufacturer's user guide online to reconfigure the box for HDMI 1080 output, which saved me from a cable provider service call.", "Date": "March 12, 2012"}, {"Title": "Great Picture, Great Sound!", "Author": "David S.", "ReviewID": "R3M9DHSCHT10N2", "Overall": "5.0", "Content": "This was my first hdtv purchase and I broke in the market with a homerun.  I read numerous reviews on this item and it didnt do it justice at all.  This TV has everything you would want besides the wireless feature.  The only thing that I noticed when I really looked hard was a little light leak in pitch black scenes in the top corners, that is it, but it is a non issue.  5 stars on this item, I have had it for 2 months now and had no problems with it.", "Date": "February 3, 2012"}, {"Title": "panasonic viera tv", "Author": "bob b", "ReviewID": "R55DPXSG2M03I", "Overall": "5.0", "Content": "A full 4 stars for yhis smart tv. The only thing lacking is not having built in Wfy like many others do.And the cost of the adapter is outrageous compared to any of the other manufactures of Wfy adapters.", "Date": "January 15, 2012"}, {"Title": "Wow!", "Author": "Jake", "ReviewID": "RT0620BN10FF", "Overall": "5.0", "Content": "I have had lots of TV's from different manufacturers and this TV was by far the best I've owned for the price, If you plug an ethernet in it is a smart TV at no extra charge for the wireless adapter. I paid $529.99 the other day on Amazon and the screen is bright and very thin. An amazing set for the price!", "Date": "January 10, 2012"}, {"Title": "Panasonic VIERA TC-L32E3 32 inch 1080p LED HDTV", "Author": "C. Holt", "ReviewID": "R34B7NM6QAYFLI", "Overall": "5.0", "Content": "Purchased 11/29/2011 and this TV is absolutly astounding. It has a gorgeous picture and surprisingly great sound. If you are in the market for a 32in. TV you will not be dissapointed in this Panasonic. I have owned three Panasonic TV's and several Sony TV's. This has to be one of the best I have to say!!!", "Date": "December 2, 2011"}, {"Title": "Great Tv for a great price!", "Author": "xxwtsxx", "ReviewID": "R2J9WX8HO9T4U1", "Overall": "5.0", "Content": "This tv is really good the colors are sharp and nice to look at,  the video games are also good in this. I tried the connection with my laptop via the vga port but it was not really good then I use the hdmi port and everything becomes better. The only letdown is that it can't read subtitles in mkvs and doesn't support audio in some movies. Anyway I'm very happy with this product!", "Date": "August 27, 2011"}, {"Title": "Great for gaming", "Author": "Eddie", "ReviewID": "R24AFZY54921XK", "Overall": "5.0", "Content": "I purchased this TV mainly for a bedroom to be used for gaming.  This set has very low input lag, crisp bright colors, and low input lag... I think I mentioned that already.  When it comes to playing any fast paced online game, the difference in winning and losing is often split seconds.  This TV gives you a big advantage because the input lag is so low.  I haven't measured the lag yet, but it is visibly faster than the TV it is replacing.  THE IPS Alpha display used on this set is excellent for game play.But enough about the games.  The features are excellent on this model.  The Netflix, Pandora, Amazon, etc apps are nicely integrated.  You can pull up the app of your choice on a convenient menu along the bottom of the screen while without leaving the show you are currently watching.  The screen can be a bit difficult to adjust the levels, but that is true with most TVs nowadays.  The remote control is a bit crowded for my taste, but everything is there without any annoying sub-menues alot of remotes have.I would definitely recommend this TV for anyone looking for a good gaming TV because of the exceptionally low input lag, or for anyone who needs a good second TV for a bedroom.  I would probably not recommend this particular TV if you want it primarily for watching movies, because other types of screens would be better for that.", "Date": "December 1, 2011"}, {"Title": "Panasonic TC-L37E3 LED-LCD HDTV", "Author": "Stump", "ReviewID": "R298UPNYZZOEIM", "Overall": "4.0", "Content": "This television is a very nice set. It's very thin and weighs next to nothing. The picture is very sharp and the sound is very clear. I purchased the wireless module and the setup was easy. I haven't actually gone out to the web with the tv but it recognizes my network.", "Date": "October 19, 2011"}, {"Title": "Perfect LED for Gaming", "Author": "Anthony Archambeau", "ReviewID": "R1Z5VQJ2RQ61TZ", "Overall": "5.0", "Content": "This tv is great for gaming.  Very low input lag.  With the right setting adjustments it makes a great 32\" PC monitor as well.", "Date": "October 6, 2011"}, {"Title": "Great TV", "Author": "Jak Semas \"Jak Semas\"", "ReviewID": "R1M5MZS7QJGCQL", "Overall": "4.0", "Content": "Great TV with beautiful picture.Only problem is only audio output is optical, so won't hook to my older Home theater.", "Date": "February 18, 2012"}, {"Title": "Excellant", "Author": "Joan", "ReviewID": "R3GAGHDXE30PZS", "Overall": "5.0", "Content": "I bought this TV in mid January, 2012.  It is really excellant.  The picture is so real & natural, at times it seems like the studio of the program I'm watching is my lounge.  Nature programs are even more fantastic.  I think the LED makes this TV quite a bit better than a non LED TV.  This was quite visible when I compared both at Best Buy.  The sound is good.  The purchase and delivery from Amazon were both excellant and speedy.  I took the normal, no charge delivery and received the TV in just 2 business days.  All & all, it was a great purchase.", "Date": "February 13, 2012"}, {"Title": "Panasonic Viera TC-L37E3", "Author": "firesaur", "ReviewID": "R186MPD8A5P4ZJ", "Overall": "5.0", "Content": "Held off for the longest time to replace my primary picture tube type TV because frankly it was working fine and I generally don't have much inclination to buy stuff for the sake of buying stuff. But I've got to admit I have no regrets now that I that I have it. Great picture quality. I have yet to try the internet features yet but am anxious to do just that as soon as I upgrade my home router.", "Date": "November 30, 2011"}, {"Title": "Viera TC-L37E3", "Author": "R. Spage", "ReviewID": "R1U9FA9O6DZCGL", "Overall": "4.0", "Content": "Believe it or not this is my first HDTV. I have a cabinet that hold a 32\" tube TV and was looking for another TV to fit that opening. This Panasonic fits the bill. The bezel is very narrow so the TV just fits. Picture wise, this TV is very good. Color is excellent and with a choice of 5 different settings you can not go wrong. I find using the cinema setting is the best for my room, which is pretty bright (day or night). Watching sports is amazing. I can't believe I waited this long to get an HDTV. I also looked at a few Sonys and a Samsung before finally picking the Panasonic, mostly because it fit my cabinet, but so far I have no complaints.", "Date": "September 24, 2011"}, {"Title": "Fanatic Value for money A+", "Author": "Tyler Hartman \"Thanks, Tyler!\"", "ReviewID": "R34222B7ZW9ADB", "Overall": "5.0", "Content": "I Purchased this on here (Amazon) October 2011, and over All I've been very impressed! Great Bang for buck, It also has the HDMI Protocol to talk to you're devices I Can Control my Sony PS3 from the Factory remote and it wasn't a big deal at all to set up! It has a great picture, great sound for built in speakers, I use it everyday even if I just play music, I Mainly play Video games such as COD, or Watch Netflix and It's been great! No Lag or anything as such, My only two real complants out of my list of goods are... I like having a removable plug such as the common 3 micky mouse plug, or the Plug used in every house the 3 prong computer power supply plug, and number two and it's not a big deal cause it's not marked as a \" Smart TV \" but the media app I would say are not my favorite and I'd like more apps now I'm sure that's changed and it's not even a deal since I've got a PS3 connected to it.  Now I will say the apps work fine, they're not slow or crash that's a + but they seem lacking, I also use a Apple TV Gen 2 on a differnt tv in the house and I'd like an interface like the ATV or the PS3 or at least half way, And Hulu plus is something that really needs added to you're smart TV line.Thanks panasonic for a Great, good priced, sorta smart TV, I couldn't be a happier customer would recommend! Look no farther", "Date": "June 12, 2013"}, {"Title": "A great TV", "Author": "Brandon", "ReviewID": "RUKOKKXAWEK5X", "Overall": "4.0", "Content": "Everything I could've wanted for the price I paid. One thing I didn't like is the Edge-Lit LED, there's a slight light bleed on the bottom right, but that's getting a little nit-picky. Otherwise the TV has performed exactly how I wanted it too the last two years. Has many ports, internet-enabled, and fits perfectly in my room. Not too big, not too small.", "Date": "March 10, 2013"}, {"Title": "fine set", "Author": "Vincent Schrier", "ReviewID": "R2SUL0YSLAEBIV", "Overall": "5.0", "Content": "Could not be happier. Fine picture quality and just the right size to fit in our corner entertainment unit. I am not an audiophile so i can not comment on all of the tech aspect of this unit. It just works well and priced right.", "Date": "January 30, 2013"}, {"Title": "Good quality HDTV", "Author": "CThomas", "ReviewID": "R2VER75927IXSU", "Overall": "4.0", "Content": "Very happy with this HDTV. The pictures are very good and the sound quality is very adequate. Have not had much success using the Panasonic DY-WL10 Wireless LAN Adapter to stream Amazon Prime videos (it often loses the signal and can be very frustrating). Instead, I use my Kindle Fire to stream the video and connect the HDTV to the Kindle using an HDMI connector (Amazon ASIN: B004286VMW).", "Date": "January 20, 2013"}, {"Title": "VERY GOOD PRODUCT", "Author": "THOMAS PRISCAL", "ReviewID": "R1I53ZTGVWC8WF", "Overall": "5.0", "Content": "PANASONIC PRODUCTS HAVE BEEN VERY GOOD FOR US AND THIS TV IS NO EXCEPTION.  HAD ALL THE FEATURES I WAS LOOKING FOR.", "Date": "January 4, 2013"}, {"Title": "EXCELLENT TV", "Author": "D. K. Johnson", "ReviewID": "R25D7S53PC8DAY", "Overall": "5.0", "Content": "I've had it for a year now.  It works great and the color/brightness are dead on.  The screen is viewable over a wide angle and it uses very little power being LED.  I'm used to flat screens pouring out the heat, not this one.  You really can't tell it's on.The Viera Tools work nicely too.  I use Amazon Video and Pandora often, no glitches.", "Date": "December 31, 2012"}, {"Title": "died after 6 mths", "Author": "Christie S. Kraft", "ReviewID": "R2RQNJSVZIUKCM", "Overall": "1.0", "Content": "Tv died after 6 mths of use. would not buy again. Having problems contacting panasonic about warranty. Walmart is a freaking joke.", "Date": "November 16, 2012"}, {"Title": "Great TV", "Author": "jscilla", "ReviewID": "R3G5YW66BATH9B", "Overall": "5.0", "Content": "Paid $628 and am very satisfied.Pros:  1) Great picture in game mode.  2) connects to netflix, amazon, pandora , facebook and others.Cons:  1) Doesn't have vierra connect as does the e30 model which allows you to  download more apps such as youtube, which the e3 does not have.  2) Amazon raised the price to $797.I still give it a 5 star because of the great picture.", "Date": "November 15, 2012"}, {"Title": "Very good viewing experience", "Author": "Jeshurun \"Michael\"", "ReviewID": "R3W36KJMXBEJVR", "Overall": "5.0", "Content": "Pros: Picture Quality, Internet Connection and Apps, Energy Rating, Appearance, Construction, Number of Settings OptionsCons: Audio not perfect, Light leaks when the screen is blankThe other reviews spell it out fairly well.  The light leaks when the TV is between modes and the screen is totally blank.  The reason I think this always gets mentioned is because during those conditions the black looks like paper and the light looks flammable somehow.  It's an eerie illusion that doesn't change the great picture quality.  I just weirds you out every time.The audio is pretty good under most conditions. It's better when you do some manual tuning.Overall I would buy this again, and highly recommend this TV to others.", "Date": "November 13, 2012"}, {"Title": "Welcome to HI-DEF LED_LCD TV world", "Author": "Timothy C. Taylor", "ReviewID": "R18H5VUN7EE8AH", "Overall": "4.0", "Content": "I tried to do a lot of research online for a set.  I was only looking at 37\" so the field was quite limited.  I was surprised that many of the more advanced features did not include the 37\" for those that offered such features.  So this is not a fully loaded set on the technical aspects.  This was my first experience with HI DEF TV viewing. That being said, Overall this is a great buy for the money  (Note:  I went with a \"like new\" to save about $275 off the price of a new).  I went with the 37\" size because I needed it to fit into my entertainment center.  My old set was a 27\" Panasonic.  The 37\" size is about right for a normal size den setting.Pros: Sleek appearance, remote: allows one touch setting of different proportional views and lighting levels, easy set-up, some pixel distortion in sports and fast action in HI DEF Digital; very, very good picture, really impressed with the options to vary the picture based upon the subject.Cons: Very minor: Having trouble with CC setting, but this may have something to do with my service provider than the TV, Only one of the \"view\" settings displays all the info in the extreme corners of the picture (both left and right), such as the station logo, game clock.  Not sure why this is but I almost always have to keep it set at the \"FULL\" setting to make sure something is not cut-out of view.Based upon my limited experience I would rate this set at 4.5.", "Date": "October 13, 2012"}, {"Title": "Poor Amazon Instant Video player", "Author": "Michael McCaffrey", "ReviewID": "RIZQPDBTE5CXA", "Overall": "3.0", "Content": "My only major criticism is that the embedded Amazon Instant Video player is quite poor.  I chose this model because Amazon was promoting it as having this capability.  However the player is incredibly bare-bones, and worse, has terrible trouble syncing / buffering both when a video begins, when resuming after pausing, and sometimes for no apparent reason.  I assumed Panasonic would release a firmware update with at least some bug fixes, but they have not.  I recently bought a Roku box and connected it to this TV.  What a difference!  The Amazon Instant Video player is light years better in both features and reliability.", "Date": "August 31, 2012"}, {"Title": "Excellent TV", "Author": "BobC", "ReviewID": "R2M6XSFIV635UZ", "Overall": "5.0", "Content": "I purchased this TV for a birthday present for my son.  Where he had his current TV was constrained to a maximum width of 35.5 inches.  This TV was one of the few 37\" TV's made and one of the fewer yet that was narrow enough to fit within the space.  That it had 4 HDMI inputs and an IPS panel was icing on the cake.  I'm a digital imaging consultant and recognize the advantages of an IPS panel display (my computer monitor uses an IPS panel).  An IPS panel has a very wide viewing angle (both horizontal & vertical) and there is much less visible change as you move off axis compared to a typical TN (twisted nematic) panel.  The picture quality is excellent.", "Date": "August 12, 2012"}, {"Title": "Pleasantly Pleased", "Author": "S. Dozier \"suzidoz\"", "ReviewID": "R11VL6F8DYRDHF", "Overall": "5.0", "Content": "This is a great product: It was not difficult to set  up, after screwing the 2 pieces for the stand, the stand then fits into a slot in the bottom of the screen.  I laid the screen face down on my bed and slid the stand in, put the screws in and slid it off the bed onto my chair with wheels right over to the TV table and was able to lift it onto the table.  I'm no spring chicken, so if you can get someone to help you lift it, do so. This set is user friendly and not complicated.  I'm just an average person with no technical or electrical background.  Just take your time read the instructions and you'll be ok. I connected it to the cablevision box and followed the on screen menu & in no time was watching TCM .  It is a handsome set & works fine with my Sony Blu-ray Disc/dvd player BDP-S480 and the viewing of my programs, movies etc., is great.", "Date": "July 3, 2012"}, {"Title": "Lovely tv,wireless problems", "Author": "Ward J. Lamb", "ReviewID": "R1U1TFSTJZZC92", "Overall": "4.0", "Content": "This television has a great picture.It  sets up fairly quickly.The wireless connection was my only complaint.I bought the tv for the reason that it could be used for it's apps.The  external  panasonic connector did not work.I called panasonic and they said from central office that  they would send a worker to fix my problem.Then the worker said they would charge us for that visit.Well still not working.On the better side it works well with my apple tv connected to it.The picture is bright and rich..The stand is easy to assemble,and the tlevision is light and easy to move around.My big gripe is I personally have an issue over the wi fi and my net gear router.Others have said the same,but I also notice for others there is no problem.What one will you be?", "Date": "April 24, 2012"}, {"Title": "Love this TV", "Author": "Marcia Palm", "ReviewID": "RO6WRGGQRKLYD", "Overall": "5.0", "Content": "This is a gorgeous tv! The color and crispness are absolutely amazing. We purchased this after seeing one at a friends house and had raved about the picture quality. Then we checked with consumer reports and other reviews and that made up our minds.", "Date": "March 27, 2012"}, {"Title": "Great TV.  Exactly what we were looking for.", "Author": "LKP", "ReviewID": "R3ILD3J84FTW3U", "Overall": "5.0", "Content": "Was looking to upgrade to an HDTV but were restricted by our cabinet size.  This was the largest TV that could fit the cabinet.  Picture quality is great, viewing angle is good as is the sound quality.", "Date": "January 20, 2012"}, {"Title": "Excellent Product", "Author": "Eugene Robinson", "ReviewID": "R3ERPLD1PFLGJK", "Overall": "5.0", "Content": "I am well pleased with the Panasonic TV I purchased, which replaces and older model Panasonic purchased in 2002; This TV has an excellent picture and color, it was connected up to my Home Theater System and the sound is terrific. Amazons service and delivery of the product I ordered was outstanding it was speedily shipped and arrived in perfect working condition.I bought the 37\" Panasonic Eviro because of the limited space within my TV Cabinet, it fit perfectly in the 36.8\" cabinet space.", "Date": "January 6, 2012"}, {"Title": "good product", "Author": "oberton \"O\"", "ReviewID": "R2BBZ26AI6USY1", "Overall": "4.0", "Content": "Great TV for our use. I thought about getting another Panasonic more expensive with better definition. No regrets about getting this one who saved me $400. Don't need 3D either.Web features work great, image is great also on HD channels but can be pixely when watching sports (soccer) on non HD channels. Difference is incredible.", "Date": "January 5, 2012"}, {"Title": "Great TV", "Author": "MM", "ReviewID": "R3HGM91POC0DO", "Overall": "5.0", "Content": "In my bedroom, I have a brand new 32\" wi-fi built in Vizio which I really like. However, I needed to buy a TV for my living room which I was only limited to 37\" (the largest size I could put in the pre-made TV area in my condo). I did a lot of research and finally I got this TV which I really LOVE. Fantastic pictures, easy set up, great volume, and a much better experience than my Vizio. My friends all love this TV (they are all techi guys and very precised when it comes to electronic gadgets). What a wonderful TV. The only thing that I don't like that much is the exterior design. They could do a better job than a plan black frame. Vizio (specially the newer model) did a fantastic job. Samsung did a good job too. Panasonic needs to upgrade the look and make it more modern looking or probably bring a couple different colors (for example black and silver) for different tastes.", "Date": "December 28, 2011"}, {"Title": "BEST 32\" TV in the last TWO years", "Author": "Fsanyc \"Fsanyc\"", "ReviewID": "R2971EUMD999SM", "Overall": "5.0", "Content": "This is the BEST ooption -- for a 32 inch TV.  it is FULLY HD AND comes with glasses.  Is grrreat with the internet and runs the videos beautifully.  With its own grreat picture quality, one can really see the difference in the non HD videos on Youtube", "Date": "November 28, 2011"}, {"Title": "Perfect as computer display", "Author": "Roger Cruz", "ReviewID": "R1LDME25IP943N", "Overall": "5.0", "Content": "I purchased this over a 27\" computer-only display, and I am glad that I did.  It allows you to connect an ethernet cable, and it will run Amazon.com video as well as Netflix.  Small footprint on my desk, and it displays full 1080i resolution (1920 x 1080) which is the same as a 27\" computer display supports, except it is 32\"!  I have plenty of room left on my desk.Packaging was excellent.  The box looked like it got mugged a few times on its way (UPS... why does that always seem to happen with them?), and I really thought that I was going to have to exchange it, but box/styro did their job, and no problems whatsoever, even after a few weeks.  I never used the TV as a computer display before, and out of the box, it cut off the edges of my computer screen at 1920 x 1080.  However, after playing with some of the display settings, I found a menu item that allowed the entire desktop image to fit within the screen edge to edge.  No complaints about this unit, and I would buy again!", "Date": "November 9, 2011"}, {"Title": "light bleed...", "Author": "Jackomo", "ReviewID": "RNYVEG3AXYTRG", "Overall": "2.0", "Content": "this is (was) my first HDTV and I'm not impressed. There's a really strong light bleed from the sides in dark scenes, way beyond acceptable IMO. I'll play with it some more, but I think this one will go back, I want black if it's supposed to be black, not gray. I'll call their support line and see what they suggest, but as it is, it's not acceptable.Update:No matter what settings I change, there is too much light bleeding in from the lower sides and especially the bottom. Panasonic phone support is a catastrophe, first the automatic system does not understand my answers and sends me into loop hell, then the tech guy with his broken English doesn't even understand what I'm talking about.I looked at all LED TVs at Best Buy today, not one displays this problem, not even a cheaper 32 inch panasonic, I'm hoping it's just a problem with my particular TV, ordered a replacement today so I'll know by end of this week.If it shows the same bleed, both will go back and I'll get a Samsung instead, even if it costs more and is a bit larger than I'd like for the wall it has to go on.At least Amazon offers free 30 day returns and exchanges, great service, as usual!Update:Received a replacement from Amazon in no time (thanks!). Lightbleed still there, not as pronounced as with the first one, but more than I like. But that's not the worst, the worst is a cluster of dead pixels the size of a match head! What kind of quality control does Panasonic use here? One dead pixel can happen, but a cluster? Looked like a hole.Needless to say, this TV is also back in it's box, bye bye. I switched to samsung, a fantastic TV in comparison. yes, more expensive, but we'll worth it!Some other issues with the Panasonic:The stand is a large rectangular foot that's high gloss, meaning fingerprints and dust show immediately and often. Bad idea.Internet connectivity is very limited and not expandable, it's a pocket version of their Viera tools you get in better TVs. Might not matter to all, matters to me.The wide viewing angle was very nice, though the samsung I got is similar (and no light bleed!).4HDMI inputs is nice, many TVs only have two and if you don't have a receiver that switches HDMI for you, you'll have to get a switchbox if you want to run more than two things, i.e. cable box, blue ray, and a gaming device. Adds in cost.Oh, and only internet ready, you have to buy a dongle to connect for quite a bit of money, nod ideal.I'm quite disappointed with what Panasonic delivers here, I was considering a large plasma for the living room, I'm not sure I'll look at Panasonic.I have high expectations in technology and little tolerance for shortcomings, no matter the price. This TV - to me - does not deliver.", "Date": "March 22, 2012"}, {"Title": "Great TV , Great Price", "Author": "Sherri L. Booye \"Horse Happy\"", "ReviewID": "R1LVYH34ARVC5U", "Overall": "5.0", "Content": "This is a really nice TV.  It has an incredible picture that can be easily adjusted to fit the lighting in the room.  The picture is very clear and crisp.  As with any TV in this range, it does have a bit of a problem properly displaying high speed action, but I knew this going in and it is not that distracting.It is easy to set up and picks up the over the air channels quickly and completely.  It is very quiet and quick on and off.  I recommend it for a good mid level TV.  Does a good job displaying the NetFlix movies also.", "Date": "February 11, 2012"}, {"Title": "Great for the price", "Author": "VyseTheQuick", "ReviewID": "R1ZJPG3HRHE11U", "Overall": "5.0", "Content": "I bought this TV for 600 and it's great for the price. Works well with my Xbox360. It has plenty of ports for all my needs and the ability to stream netflix without the need for a separate box (even though I have one) is nice.", "Date": "December 18, 2011"}, {"Title": "Perfect and 35\" width Fits Our Entertainment Center!", "Author": "Road Warrior", "ReviewID": "ROLW9CONXYZZ3", "Overall": "3.0", "Content": "This is a post-review comment.  I have down-rated the product from 5 stars to 3 stars because we have struggled for a year to find a way to hook up our wireless headphones to this TV.  It does not have a headphone jack for analog headphones.  Have tried many audio decoders that promised to convert digital signal to analog but none have worked.  Don't purchase this product if you need to use headphones!This TV arrived on time, fits our old entertainment center perfectly, has good sound, spectaular picture, no light bleed (which was reported elsewhere).  37\" size is more than enough for good viewing from about 10 feet away.  One note for those with entertainment centers: some of the ports are on the side of the screen and will not be usable due to tight clearances in the entertainment center, but if all you have is a DVD player, computer, and HDTV cable box, then no problem!", "Date": "December 15, 2011"}, {"Title": "Great midline tv", "Author": "uguessit", "ReviewID": "R1G8E1ANZCEA6G", "Overall": "4.0", "Content": "I love this TV waiting for the prices to go down so I can buy another one. It appears the prices went up for black friday and never came back down. The sound could be better but I am planning on buying some external speakers ...picture is great.  You will have to adjust to suite your taste, factory setting did not work for me.", "Date": "December 8, 2011"}, {"Title": "Very Satisfied!", "Author": "San Diego Rich", "ReviewID": "RYTI5ZY8F8X1A", "Overall": "5.0", "Content": "I did a lot of research before choosing this TV - I checked product specs, I read reviews by both professional reviewers and customers, and I visited many brick-and-mortar stores to see the TVs I liked in person.  That said, I knew this was a \"5 star\" TV before it arrived.  Lots of reviews I read stated that the sound quality from the internal speakers was poor, but I think it sounds great for internal speakers.  If I want big, booming sound, I'll buy a surround sound system, but for my family room the internal speakers are perfect.One thing I want to add is that this is the first TV I have purchased online, and I was a little hesitant to not use a local store in case I had any problems and/or questions.  None of the stores could come close to Amazon's price, so I decided to go with Amazon.  I used the standard shipping and the TV arrived in less than a week in perfect condition.5 stars to both the TV and Amazon!", "Date": "November 28, 2011"}, {"Title": "Nice TV", "Author": "David Walker", "ReviewID": "R3W4W14QBELBI1", "Overall": "4.0", "Content": "The picture quality is good once you tweak the color settings. Audio was decent when on the table but once mounted on the wall it was much better. It has an optical output, so the blu-ray and tv all can play out the receiver and through the tv at the same time. Biggest complaint is the remote layout doesn't jive for me. I have to reach all over the place for things I think should be grouped together.", "Date": "October 24, 2011"}, {"Title": "Great Tv", "Author": "jcd35", "ReviewID": "R16BIK0GVI331H", "Overall": "5.0", "Content": "Tv has an awesome picture when hooked up to hd. I dont understand the negative reviews. Love it. Great product.", "Date": "October 17, 2011"}, {"Title": "I'm Goin to Keep it", "Author": "Atlantis", "ReviewID": "R12MC942S9VOW9", "Overall": "4.0", "Content": "The picture is good, but not as good as my Panasonic plasma. I think it is about as good as you can get for the price & a 37\" set. Netflix in the wireless mode will not work...I have tested it and isolated the problem to the TV (which has the latest software). Panasonic customer service is no help. Netflix works just fine in the wired mode. If you must have wireless NetFlix, look at other HDTV's.", "Date": "September 14, 2011"}, {"Title": "Panasonic Viera 37 in RV", "Author": "D. Lyons", "ReviewID": "R220PEW14LUFFK", "Overall": "4.0", "Content": "This TV is well worth the price. I am happy with it. The sound quality is very good.  I also bought a sound bar but only use it for movies.  I  am well pleased.", "Date": "August 11, 2011"}, {"Title": "An amazing TV at a great price", "Author": "Andrew", "ReviewID": "R17QKWSCPXK6YS", "Overall": "5.0", "Content": "I was able to have Amazon price match the TV to Bestbuy.com during their pre-Black Friday sale, and I was able to save ~200 dollars. It is a great TV - the picture and sound are perfect, and I am completely satisfied.", "Date": "November 29, 2011"}, {"Title": "Excellent Buy!", "Author": "Carole", "ReviewID": "RWOBLOVXT52MT", "Overall": "5.0", "Content": "Needed a 37\" TV for a limited-size bookcase shelf and this one fit perfectly.  Excellent quality picture and great price!  Delivery was VERY fast and service the BEST!  Recommend it highly.", "Date": "October 20, 2011"}, {"Title": "Panasonic 37\" led hdtv, A Very good buy", "Author": "Susan Johnson", "ReviewID": "R28CWNDMS869NH", "Overall": "5.0", "Content": "I looked very carefully before buying this HDTV.  I love it.  It is the perfect size for my bedroom.  I love the led back-lighting and all the things it can do.  So happy I went with it.  Use it a lot every day and night.  Has good sound capabilities on its own.  Five star in every way.", "Date": "June 10, 2012"}, {"Title": "42\" LED Panasonic", "Author": "Mhensel", "ReviewID": "R2CSLH24QLT7JX", "Overall": "5.0", "Content": "Great tv I have no complaints about it. Played games on it and it is fantastic! Would get this tv again!", "Date": "December 14, 2011"}, {"Title": "Very nice TV", "Author": "Charles C. Olsen \"Chris\"", "ReviewID": "R2PDBX6Q7VJDZE", "Overall": "5.0", "Content": "TV arrived quickly (love that Amazon Prime).  Set up was easy.  Very nice picture.  Would buy again tomorrow.  Bought a smaller, previous model for my daughter two years ago.  Same great picture, but this one was about half the price.", "Date": "September 9, 2011"}, {"Title": "No Help from Panasonic or Amazon", "Author": "Breck Androff", "ReviewID": "RR4C70XESK4K3", "Overall": "1.0", "Content": "Got the unit packaging done poorly missing mounting screws I had to find some I had to assemble the base. Called because the TV would not work with external speaker no help. People that answer the phone or tech support knew less than I did about the problem. To date the problem has not been solved. What would Jeff Brezzo say if this was a unit he purchase??? So far no help from Amazon. I feel that this is a poor way to do business. Will try again next week to solve the problem on the Panasonic Viera TC-L37E3 37 inch LED HDTV.", "Date": "May 12, 2012"}, {"Title": "Very Good High Def TV", "Author": "Garfield Eater", "ReviewID": "R3CTJF6AF1EYQM", "Overall": "5.0", "Content": "Like all Panasonic tvs we have purchased, this one was very easy to set up and calibrate to our liking.  Price was good and after we had it about a week, price went down.  We contacted Amazon and they gave us a further reduction of $50.", "Date": "November 28, 2011"}, {"Title": "Measurements are misleading", "Author": "Moses", "ReviewID": "RWGFTFPXVGIYA", "Overall": "3.0", "Content": "Panasonic indicates the measurements of this TV without the stand are 21.6\" X 35.0\" X 1.7\" - while a good portion of the TV is 1.7\" thick, the lower portion of the TV that houses the internal speakers is actually 3.5\" thick. The measurements are quite misleading. Any hope of having this flush to the wall is out the window, and you need to consider the \"true\" thickness of this TV when choosing a wall mount. What's even more frustrating is that the only other short-coming of this TV is the sound, from the internal speakers, which are the culprit for the change in the TV's thickness. Maybe a Dremel tool and external speakers would fix this ill.", "Date": "May 1, 2011"}, {"Title": "Too much white light from top & edges", "Author": "Tony", "ReviewID": "R3FUZ43AE1KOF6", "Overall": "1.0", "Content": "The light bleed on this TV is horrendous, especially if you watch TV with the lights off.  No amount of calibration made the light bleed go away... it looked okay in bright scenes, but was distracting for darker scenes.  Refresh rate was also pretty bad, so PS3 gaming was cumbersome.  When playing shooting games, I had to stop moving my character before pulling the trigger, because the picture was blurry if I tried to shoot while moving.I returned mine, and Amazon refunded my money with no hassle.", "Date": "October 31, 2011"}, {"Title": "Lacks the basics.", "Author": "M. OReilly", "ReviewID": "R79UCMWT9N1D9", "Overall": "1.0", "Content": "I bought this TV primarily based on two criteria: 1) it fit perfectly into the available cabinet space in my media center, and 2) it was made by Panasonic, who have rarely let me down in the past 20 years.  This TV unfortunately falls into that \"rarely\" category.First, and most importantly, the TV does not have ANY analog audio out connections.  The ONLY way to get audio passed through this TV is through an optical (TOSLink/SPDIF) connector. (There is not even an HDMI pass-through.) I suppose this is partly due to HDMI/HDCP DRM restrictions, and partly due to the belief that most people will have some sort of head unit handling audio distribution.  But speculation doesn't get audio through my analog-only amp, so I'm stuck listening to sound through the unit's (relatively) crappy speakers instead.Second, part of the reason for buying the TV was to play movie files directly from a USB hard disk.  What my pre-purchase research failed to turn up was that only a very limited number of file formats are supported (including .mp4).  As luck would have it, only one of the videos on my disk was in a supported format... the rest were .avi (a file format that's been available for *19 years*), which were not even recognized.  Worse, even though the TV showed the listing as a \"Folder/Title\" display, none of the folders were shown - had I not had the single supported video file on the drive, *not a thing would have been displayed*.  This would have caused me countless hours of troubleshooting, wondering what the actual problem was.Third, there are only two sets of analog audio-in connectors - one for the component video connection, and one SHARED between the composite and PC (DB15) connectors.  In other words, don't plan on connecting your PC and WII audio to the TV at the same time.)The other aspects of the TV - color, brightness, saturation, etc. seem fine to me, though admittedly I haven't watched much on it, and will be returning it shortly due to the disturbing limitations above.I've given the TV a one-star rating here, which is obviously weighted heavily by my specific requirements.  If you don't ever have a need for adequate analog audio in and out, or are not planning on watching digital media directly from the device, you may very well find this to be a lovely display.  But hopefully this review will save someone else the time and frustration I've been through discovering the deficiencies of the product.  Thanks for reading.", "Date": "November 7, 2011"}, {"Title": "Great TV", "Author": "Michael Rhoadarmer", "ReviewID": "R3CGKKETK3XQJ0", "Overall": "5.0", "Content": "The delievery was really quick and the price was really good.  The TV has a great picture and lots of good features.  The SD card slot plays all kinds of files.  There was a small problem playing longer HD video files from the SD card in that the audio started to get out of sync towards the end.", "Date": "October 18, 2011"}, {"Title": "A TV arrived in perfect condition", "Author": "William Freeman \"insertbill\"", "ReviewID": "RSBP2JHS09J61", "Overall": "5.0", "Content": "The HDTV arrived in a double carton with enough popcorn filler to protect the inner carton from even the smallest dent. Needless to say, I've got enough filler for any packages I might send out for Christmas.As far as the TV it worked perfect with a great picture and easy setup.", "Date": "July 24, 2011"}, {"Title": "Perhaps rushed a little!!", "Author": "rushed", "ReviewID": "R2H9DMD3EXACX8", "Overall": "2.0", "Content": "Brought home picture is beautiful...  That's the Pros...Cons:1. Does not play mpg4 video as stated, tested multiple movies on multiple USB drives.  No go!  Invalid video format.  When I returned to retail store I demonstrated the failure on the exact same TV model on the floor to the employees.  I then took same movie/stick to 2 other brands which played the movie no problem...2. The network LAN port did not work.  Could not get IP address via DHCP from multiple routers, and then straight from cable modem failed.  I also set a manual IP addresses which failed.  No internet connectivity what so ever.  2nd reason I returned unit.Overall picture is great, software (firmware) is dreadful.  Lots of options on the box that don't actually work.  I only purchased for the DLNA functionality, guess I need to find elsewhere...", "Date": "November 28, 2011"}, {"Title": "wireless misinfo", "Author": "da", "ReviewID": "R1GJDI4IPOPBLE", "Overall": "3.0", "Content": "must buy wireless adapter...$75. if you want wireless suggest you look at something other than panasonic...also not the best info manual either...picture fair to good...bottom line not too happy with this purchase.", "Date": "October 24, 2011"}, {"Title": "Nice small screen", "Author": "M. Jennings \"margeryj\"", "ReviewID": "R2SNTV42FZ9CXX", "Overall": "5.0", "Content": "Good image quality, easy setup, versatile. Our constraints included a small room, and this works well. Take the time to explore the many setup options and tweak it to meet your requirements.", "Date": "November 24, 2011"}, {"Title": "not good", "Author": "Jay Paraagg Shaah", "ReviewID": "R19XCGTPHMZ27S", "Overall": "2.0", "Content": "This model is ok. Not Pretty good. It states that the colour would appear the same from a viewing angle of 180 degrees but the colour appears to be different from different viewing angles. The sound also is hazy. Also the model which amazon delivered was I think refurbished cause it has got scratches", "Date": "December 28, 2011"}, {"Title": "Requires fast internet speed!", "Author": "Sherm", "ReviewID": "R3O60KSIM5GH3D", "Overall": "3.0", "Content": "TV seems to work fine, although sound is not great. However for the internet to work you need 4-6 mbps internet speed. I don't have this and can't get it. I can watch TV fine on my computer so did not think it would be a problem. Maybe everyone knows this but I didn't. Don't buy this TV if your connection is under 4 mbps.", "Date": "January 21, 2012"}, {"Title": "Poor audio", "Author": "bebmar", "ReviewID": "R146TPQ6P0SCSM", "Overall": "1.0", "Content": "The sound from this TV is very muffled, because [I assume] the speakers are facing down to the table it sets on; many voices on Fox News can not be understood by many in my family. To make this manner worst, there is no analog [RCA type connectors] output from the TV that would allow connections to the many audio equipments I have accomulated over the years, that could over-come the serious sound defect. I've had the TV for less than a month, and have tried every setting available to better the quality of the sound to no avail. I'm considering returning the TV as it does not perform as advertized. I would not recommend this or any TV that does not have speakers shooting out the front toward the listener; or does not have an analog audio output.", "Date": "December 22, 2011"}, {"Title": "Bad buy, bad use of technology", "Author": "Cinema Man", "ReviewID": "R2FKYSS7L61C18", "Overall": "2.0", "Content": "I bought this LED TV brand new, figured I'd give LED technology a shot.  I got it home, calibrated the settings, and for hours could not achieve a decent picture.  The LED back-light gave all the white reference a blu-gray tinge which I could no get rid of with out overcompensating by warming the image (this just made the image look murky).The other issues were this the color... very dull, and the monitor itself is very dim, even when you turn the backlight up.  I have a 10 year old Hitachi Plasma, and this brand new LED TV couldn't hold a candle to this ancient, dinosaur of a television.I do not recommend this TV at all, I took it right back to the store and bought a Samsung LCD 1080p 120hz for a similar price, and I love it.  I definitely recommend the 120hz, but just make sure you can turn off the \"auto motion\" setting if you plan on watching movies on your tv (great for sports, but it makes movements look cartoonishly smooth).", "Date": "November 29, 2011"}, {"Title": "not a good product", "Author": "nk", "ReviewID": "RRNOHWCSQUB6W", "Overall": "2.0", "Content": "two major points:1) poor wifi connections -- dropped the line every 10 to 20 mins, make things worse, YOU HAVE TO PUSH THE BUTTON TO RESUME IT!!! Really annoying2) bad picture quality", "Date": "January 3, 2012"}, {"Title": "Waste of money,", "Author": "Raymond DeAngelo", "ReviewID": "R1O96GUYP4NAD7", "Overall": "1.0", "Content": "Don't waste your money or your time.  This particular unit has THE WORST PICTURE IN THE PLANET. I have tried everything!!! it looks so horrendous I don't even want turn on the unit. I bought this as a second TV in my bedroom.  I do have a Panasonic viera (plasma) with an amazing picture in my living room.", "Date": "March 31, 2011"}], "ProductInfo": {"Price": "$849.95", "Features": "IPS LED Panel\nIntelligent Scene Controller\nVIERA Image Viewer (Photo & Movie)\nEasy IPTV\nDLNA (Wi-Fi Ready)", "Name": "Panasonic VIERA TC-L42E3 42-Inch 1080p 60 Hz LED-LCD HDTV", "ImgURL": "http://218.201.42.40:8080/ecx.images-amazon.com/images/I/41O-Ly2bNWL._SX300_.jpg", "ProductID": "B004M8SB0W"}}