{"Reviews": [{"Title": "BETTER than the P65VT30, inky blacks, perfect color reproduction, best tv of 2011", "Author": "electric6", "ReviewID": "R3FDW3I2I6GKWG", "Overall": "5.0", "Content": "I will say first off that I am not a proffessional TV guy. I do not have a device to measure MLL, or light output.That being said, I researched exhaustively as my little 37\" Diamond series was getting a little small. For 3-4 months I had my heart set on the P65VT30, preordered at J&R.; Then I started reading reviews by cnet, and other pros on the web about their previous sets. Blacks levels on pannys WILL degrade. That rating on their site which says it has better blacks will change, they will degrade over time, and very likely to a point worse than this set. I do not care how many people say that the VT30 has better blacks because 4300 dollars is just not worth it for a set that has worse color, temporarily better blacks, and a vizio-esque blocky design.I cancelled my VT30 preorder shortly after reading review after review regarding the above issue. It is due to how the set adjusts brightness, and is just the way those sets work - the issue is unavoidable, so don't say I didnt tell you so when you notice while watching the super bowl later this year and the steelers jerseys are not as black as they once were!Now the samsung PN64D8000 is about as good as you're going to get on a big screen pdp display - blacks ARE better on this set than the smaller ones, which I will address later. Blacks are Inky!! And I use that term because that is the most applicable word I can think of. Colors are delicious, with reds, greens, yellows, and blues all popping right off the screen and into your living room. I play a lot of HD games on ps3/360 and the first thing I noticed is how well the set responds to fast moving images. It is spot on, and at least twice as fast as my old LCD set was. Gaming on this TV is an absolute pleasure, and I cant stand it on my old mitsu anymore, as my eyes have become accustomed to nearly perfect response time.On to BD's. I have read conflicting reports of Cinema Smooth degrading blacks when turned on. I have not seen this one solitary instance. I watched the Matrix Reloaded twice - the first time with CS on, the second with it off. Blacks did not decrease any that I could notice, and I have a good eye for detail. Yes, CS mode does improve PQ on bluray movies, and quite a bit I might add. The picture, for lack of a better word, just seems more \"together.\" More details can be seen with CS mode on than off. This feature is really personal preference, but for me it improves an already amazing picture to a pq I have literally not seen before on a TV. This mode is what videophiles call the \"96hz mode\". Technically means that turned on CS will match the 24fps, with that of the bd, which greatly improves pq. Modern films are filmed at 24fps, and CS mode basically matches that, by reducing from 60fps to 24fps using 96hz mode. Techno-babble I know, but moving on.Netflix. We've all got it, and we've all seen the input signal change mid-way through a movie much to our annoyance. It shows up even worse on a big hd set. Here is where I have one of my few complaints: while whatching netflix I have seen in only a few instances some mild fluctuating blacks. I'm not sure if it is due to the picture source(netflix) or the tv's processing. I'm still trying to figure it out.I have seen FB only one other time. On the BD of Interview with the Vampire the blacks did fluctuate a few times, and if I was not so obsessed with detail I would not have noticed it. Its really a small issue, and most folks will probably not see it like some of us tech heads do. NOTE: Samsung did release an update for this tv, and after installation I watched the IWTV again. This time I did not see FB's. None.The only time I EVER see fluctuating blacks now is when netflix is on a low quality for whatever reason. It only seems to happen when watching poorer quality signals like sd cable, or netflix, so really nothing to worry about.My review is mainly regarding picture quality, and ive got a tower for my internet. That being said, the internet on the tv is ok. A little laggy sometimes, but its bearable. Netflix straight through the tv is quite acceptable, and at least as good as from a ps3/360. Netflix through the ps3 has been the best overall, if it makes any difference(1080p streaming).Overall I would give this set a 9/10 just because the stand is so darn ugly, the bezel is not black like the d7000 and the few instances I saw FB's. Blacks are amazing, inky, and you will notice them the first time you turn it on. Colors are spot on!! Response time is absolutely fantastic, and despite what those 18 year olds at best buy say, plasma is far superior for gaming. Burn-in is a thing of yesteryear, and there is absolutely no issues with that on this set. I would take this set over the Panasonic P65VT30 ANY DAY!! Samsung is better with parts distribution, service, warranty claims(not that you will have any), and over picture quality. Blacks are videophiles obsessions, and this set does them perfectly.So when you pull out your credit card for the VT30, just remember \"i told you so\" when youre cursing at your set come super bowl time, or neo's trench coat isnt as black as it used to be...Hope this helps with your decision!Thanks for reading guys.RyanOh yeah, and seeing as how last year(and the year before) that the smaller samsung pdp sets had worse black levels expect that also being the case with this year's sets. So yes, the PN64D8000 DOES have significantly better blacks than the 51 or 59 inchers. Dont forget that!", "Date": "June 9, 2011"}], "ProductInfo": {"Price": "$3,099.00", "Features": "Mega Dynamic Contrast Ratio 25 000 000:1; 600Hz Subfield Motion performance: Experience crisp clear motion.\nShrek, Shrek 2, Shrek the Third Blu-ray 3DTM discs - all have been re-mastered in 3D.\nIncludes: Mail-in coupons for Shrek Forever After Blu-ray 3D disc, and Mail-in coupon for Megamind Blu-ray 3D disc\n2 pairs Samsung 3D Active Glasses Model: SSG-3100GB\nLose yourself in the immersive wonder of the Samsung 3D experience with this exclusive 3D Starter Kit.", "Name": "Samsung SSG-P3100M/ZA Starter Kit and Samsung PN64D8000 64\" PDP 1080p HDTV Bundle", "ImgURL": "http://ecx.images-amazon.com/images/I/51G1omJeDDL._SY300_.jpg", "ProductID": "B004VE5B78"}}