{"Reviews": [{"Title": "This is a great TV", "Author": "D_deU \"D. de U\"", "ReviewID": "R1GDEZY3NA6BO8", "Overall": "5.0", "Content": "I spent months researching for a replacement TV in the master bedroom and finally settled on the Sony KDL32EX523. Set up was a snap - and I did it twice as I did not have a DVR in my bedroom - so I originally connected the TV directly to my Comcast cable (no box or DTA) and it was able to grab all my channels (I do not subscribe to premium services like HBO). A few days later, I added the DVR and was channel surfing in no time. (Well - actually had issues with Comcast to get their own DVR to receive their own signals, so a 1 star rating for Comcast - dang near switched to Direct TV during that process.) Adding the Sony to my wireless network was as simple as entering my network password into the TV (this model Sony has built in wireless - no need for external USB device), just like adding a computer - join the network it found, type in the password, and boom - connected. Initializing the TV to work with my Netflix account was just as simple - I logged into my Netflix account with my laptop - input the code from the TV - and boom - the TV blinked and was instantly added to Netflix. This Sony streams Netflix content better than my TIVO DVR in the other room which is right next to my wireless hub. Picture quality is great - no issues with viewing angle, no high pitched power supply sounds. I do not want to sound like a Sony commercial, but for my use, this is one great TV.", "Date": "May 11, 2011"}, {"Title": "Loaded with features... with room for improvement", "Author": "Dane A. Kantner", "ReviewID": "R723CLMHRTTK7", "Overall": "4.0", "Content": "Overall this is a very nice TV.  It's very thin.One of the bigger draws for me was the built in Internet Apps. I had actually returned a Vizio where nothing was working at all (Pandora literally crashed the TV) and got this. This is much better.  I've tested a few other Internet App tvs and the speed of this Sony one is probably the fastest I've seen as far as menu navigation goes. And the menu is also well laid out. For some people it might almost be too many features.The Pandora app works well. There's lots of room for improvement in how it is actually designed (there are color codes on the menu, and they only associate one with a feature--skip--why not have one associated with thumbs up, thumbs down, etc). No good visual effects. But it works for what it needs to--playing music.The Qriocity video stuff doesn't work at all. I've never seen anything played through it, or even a choice of items to play. I don't know what the deal is, but my understanding is that Sony has been hacked recently and has completely shut the service down for now. It may as well not be there.The Amazon streaming on demand works REALLY well and is high quality. If you're an Amazon Prime member there is a fairly extensive selection of titles that become free when you authenticate with your Prime account. (The entire series of Inspector Gadget!)Netflix streaming was very high quality, but would constantly stop to buffer. It doesn't buffer enough of the content. It will \"detect\" network speed as you start anything up, but obviously this detection isn't very conservative or it would downgrade my quality in favor of better playback. As it's set up now, it's unusable.You can also download software onto your computer--PC, Mac, Linux, whatever--that will let you stream video, pictures, movies, etc off of the computer and right onto your TV. Google for DLNA software and there are any number of options, many free. Windows 7 has this built into Windows Media Player but there are plenty of other open source and paid apps that may offer more features than what Microsoft's built-in software does.  It's a pretty cool feature though.The TV is aesthetically pleasing. I would say Sony has other TVs in the Bravia line that I like more, but I like this one too. And it's solid, well built.The form factor is thin. However, it's so thin that all of the ports come out back at a right angle, there is no bevel where they go in parallel to the back of the TV. Why is this an issue?  If you mount the TV on a wall you may find that your cables themselves will prohibit you from using a wall mount that's slim. I have a new LG LED TV and what they do to get around this issue is use a proprietary dongle for the cables, you hook up a tiny dongle into the port instead, then that hangs down and you hook the cables into said dongle.  No issue with mounting it very close to the wall when you have this.  With this Sony, you may have to use a tilted wall mount to give you the clearance you need, or a wall mount that leaves a few inches of room between TV and wall. Or I guess you could buy a more expensive 45 degree HDMI cable and then it would probably work with just about any wall mount.The TV has Skype built in, but you need to buy the Skype camera/mic from Sony for another $130-150 for that to work.  Out of curiosity I hooked up a Logitech USB webcam up to the TV to see if it recognized it and you could Skype with that, it didn't work. Not shocking, but good to know.I'm glad Sony has finally abandoned forcing their Memory Stick down our throats by integrating it into all of their products--no memory stick port on this TV.  There are USB ports you can use a standard USB media reader to use.The TV does split screen, and does it fairly well. I can watch my HD cable box and HD antenna simultaneously (or HD cable and computer that's hooked up simultaneously, etc); I occasionally have gotten a \"feature not supported\" when trying to tune the channel and I can't figure out what I did out of order. Split screen is a feature that some other manufacturers seem to be removing, the aforementioned LG LED I bought doesn't have it...so don't take it for granted!It only has one component input... so at the moment I have no DVD player hooked up, it's basically going to force me to upgrade to a Blu-Ray with HDMI.  The industry trend seems to be reducing the number of component inputs to 1 and increasing the number of HDMI inputs.The remote is decent. I used to really dislike Sony remotes, but this one is workable. The buttons are well laid out, well sized.  It has buttons for Netflix and Qriocity, but no Pandora and no way to reprogram any buttons.  It's not a \"universal\" remote, you can't program your stereo. I think the primary reason for this is the TV itself has built in \"synch\" capabilities to control other Sony devices such as your Sony stereo, etc., so of course if you have a full Sony line you're good but if not you'll need another remote. The TV has a feature called \"control for HDMI\" (which is branded as \"Bravia Sync\") which will send a control signal to a device through the HDMI. For the most part this only will function with Sony devices but I don't think it's necessarily closed to other devices, they just don't support it. So for example if you have a Blu-Ray hooked up via HDMI it could pause/start/play/etc your DVD through your TV's controls. It would be nice if my Comcast cable box was controllable by this, but I have a feeling I'll be canceling Comcast before they ever support this feature.The TV has a built in guide that populates over the air station information if you have a digital antenna hooked up.  It works. I didn't have to configure it for my location, it just worked. It identified the stations, and filled in the guide data.  It's nice to have a really functional guide for antenna stations as well as my cable box.One of the coolest features of this TV is its energy saving mode... The TV has a built in \"Presence Sensor\" that detects when you're not in the room for awhile and will then turn off the screen, and when you come back it turns the screen back on. It works well, and is on by default.  Will this be the next horizon in American laziness though, never turning off the TV and just relying on this feature? Who knows. :)", "Date": "May 13, 2011"}, {"Title": "Good and could have been great", "Author": "M. Cohen \"Marco1\"", "ReviewID": "R2O6F4LQTEW2AQ", "Overall": "4.0", "Content": "This TV is very good and could have been great if it were not for the crappy internet experience. The form factor itself is quite nice; very thin, light and sturdy, with a small bezel. It sets up very quickly and easily. The picture in HD is stunning: beautiful color, very sharp with very black blacks. However SD pictures are frequently fuzzy and a bit washed out which makes watching SD a drag. My 3 year old 32 inch Sony does SD much better than this one. The viewing angle is just ok. Looking straight on, the TV looks great.  As you move to the side the pictures degrades quickly. At first I thought that the sound was below average. After tweaking the settings it now sounds quite good. If you are and audiophile you will however need an amp with separate speakers. I have not had a problem with the 60 hz refresh rate. I suppose it might be somewhat of a problem if I watched more sports.  It is the internet interface which is the weakness of this TV. I have the 40EX523 with built in Wi-fi. No need for a separate dongle on this one. Loading times for most of the internet programs are quite slow - much slower than my beloved Roku box. Netflix interface is very poor. You can't search and it's even hard to see the titles of many of the movies on the screen because they are so small. The Sony Netflix picture is much worse than Netflix on the Roku box. Colors on the Sony Netflix are a bit washed out and the picture is not crisp. The Sony picture on both Hulu and Amazon seem almost as good as the Roku. Again the interface for both Hulu and Amazon is far worse than that of the Roku. Crackle is not even worth using. It takes forever to load, then has to keep re-loading despite fast internet download speeds. It's almost impossible to get back to where you left off on a movie. It operates so poorly that I am amazed that Sony includes it in the first place.  They should make it work well or get rid of it. I would recommend buying this TV without internet connectivity (40EX520) and don't bother with the severely overpriced internet dongle. Do yourself a favor and buy a Roku box for $79 and use that for the streaming of TV shows and movies. It is far superior to anything that Sony has to offer on this TV. Sony engineers should study the Roku box and interface and use what they learn to improve this rather pathetic internet offering. Other than the internet, this really is a very good, satisfying TV.", "Date": "March 19, 2011"}, {"Title": "Love it.", "Author": "Dreamspinner", "ReviewID": "R3H1TI9RBVVPEC", "Overall": "4.0", "Content": "I love this model. I have it in my bedroom and the picture is large, sharp, and easy to see regardless of ambient light conditions from bright sunlight to total darkness. I especially love the internet ready feature since I am a great fan of Netflix. No extra box or plugs needed--just WiFi. I use the handy bright red Netflix button on the TV's remote which takes me there in one step. The Netflix search function on the screen is not easy to maneuver through categories, however, so I keep it simple by staying in my \"instant queue\" to find something to watch. I bought the TV from Amazon because it had the best price and I knew the model, but I have to admit I was worried about buying and shipping such an expensive item. All was good--the TV arrived quickly with perfect packaging intact. No worries.", "Date": "April 15, 2011"}, {"Title": "Got TV for DLNA, NETFLIX, etc..., but these aren't very good", "Author": "GI", "ReviewID": "R1E8YU4V3XO8TK", "Overall": "2.0", "Content": "I got this TV to be hung on a wall for a workout, Workbench area.  Since It is being hung I didn't really want to have boxes hanging from the TV on the floor etc... so for me it seemed the Sony EX523 would fit the bill: Wireless Network connection, DLNA (to connect to my media music, videos, pictures, etc...) and connection to Pandora, Netflix, et all.The good:1.  The TV picture was very nice, matched or exceeded the Samsung sets2.  Customer service knowledgable and helpful on getting and setting up MAC filteringThe Bad:1.  Sound, but then again I know ALL TV's sounds now suck, that is the new corner to cut2. Setup to wireless with MAC filter was difficult to know how to setup and required call to Customer service3.  Wireless kept dropping for a very short period of time, but it would create issue with the DLNA and netflix.The really BAD:1.  You need to setup an account with Sony to be able to use their apps, i.e. NETFLIX requires to go online and setup an different account than the Netflix account (NO OTHER TV requires something like that).  Remember SONY seems to have the inability to product consumer's information (not once but twice wihtin a SHORT period of time) so creating an account is a risky prospect.2.  DLNA is essentially worthless it basically only support MPG, MP3 and JPG,3.  DLNA has NO SUPPORT FOR AVI, AAC, etc...Update:Returned the Sony TV for a Samsung UN40D6300 (I had a wireless USB connector from another TV set that I hard wired.), so this got my wireless connection.The Samsung had tons of pixel issues 8 always on and about 20 dead pixels, tv returned and trying the third one (same samsung.)What ever you want to say about the TVs the on thing I will say is Amazon's return policy for the wireless and the pixel issues was amazingly nice (wish I didn't have the issues in the first place).", "Date": "August 12, 2011"}, {"Title": "Works great, easy set up, great picture", "Author": "S. Mattaini", "ReviewID": "R2CG87JCH7ERKY", "Overall": "5.0", "Content": "While I am fairly technologically savvy, I am not a technophile. I have a strong bias toward Sony, so take that into consideration.  This TV was easily set up, including connecting it to our wireless internet network, and setting up our Netflix account on it.  Now we can directly watch movies from our \"Instant Queue\" on Netflix on the TV, with no wires. The picture is great, the controls intuitive.  We are just starting to utilize the other functions, but for a basic viewer who wants to watch movies this is a good solution.  I am very happy with the TV and would recommend it.", "Date": "June 8, 2011"}, {"Title": "Does the job, looks good (1 week in, w/6 month update)", "Author": "Shakypete \"P.\"", "ReviewID": "R3JRGEXANEGH5Z", "Overall": "4.0", "Content": "The picture is pretty good.  I am waiting for a HD receiver to arrive to give a final verdict.  I'll update at some point.  Tomorrow the wall mount arrives.  I like that it is less than 1.5 inches thick.  Should look nice on the wall.  The BX420 and others from last years Sony line really disappoint there.  EX523 is also only 17 pounds on the wall, which makes for a minimal load on the wall mount.I know it is only 60Hz.  That doesn't matter to me.  I did not plan on 3D or HD sports of any importance.My biggest positives are the volume control, off-axis viewing and color quality.It is has very fine volume increments at the low end.  Great for night time TV in bed.  The Off-axis viewing has minimal drop-off.  Viewing alternatives in Best Buy led me to give Sony a shot. In there, they seemed to have this down, with earlier models, so I figured this one would work out well.My kids really like it over the 15 inch standard def LCD it replaced.  Now they can read the on-screen Guide.I didn't calibrate it.  But in that line of thought, I don't like that it only has three picture modes.  Normal, Vivid, and custom.  I typically use \"Movie\" mode on both of my Samsung's, and it serves me well.  I am stuck in Normal for now.  Another minor annoyance, I didn't find any good instructions for how to put the stand together.  I figured it out, but some better directions would have been nice.No idea if the Stereo is working.  I cannot tell.  But I do like the pair of 10 Watt speakers.  They deliver.  The 5 watts of my Samsung 22 inch TV is a joke.No noisy PSU issues, like another reviewer indicated.  I really hope he took it back.It also looks really nice.I like the internet connectivity.  Integrated Wifi made it easy to update firmware.  I don't really need the features, they just came along for the ride.  I may try and use the DLNA support with my media server, at some point.  It isn't a priority right now.  I chose this TV for the expected picture quality based on looking around Best buy at competitors.(Updated 17Nov2011 below is all new)I got the HD cable box about 5 months ago. I am very happy with this TV. The image quality is still very satisfying!Biggest positive observation for this 6 month update was the sound. Searching through the features, I stumbled upon an audio setting for being wall-mounted. It does something to improve the reflected audio, and it really does help. I can't explain it, but it does. Stereo is also more noticeable, vice what I said above.Biggest disappointment for this 6 month update, the sleep feature is really clunky to get to. Every other TV I have owned, \"Sleep timer\" was a button on the remote. Not on this one. It is like 7 or 8 software clicks to get to it, and 5 more to set it to the 120min that I like. At 32 inches, it is a good bedroom TV candidate, but this feature is really annoying.I tried the internet features a couple months ago. I don't have any accounts with the services offered to provide any good feedback. I tried the free movie service mentioned by another reviewer, it is really that slow to navigate, and it got really annoying, really fast. Resume feature stunk. Video playback was acceptable, when I found one I liked.Sony provided 4 firmware updates to the TV since it was originally released (when I bought it). No idea if it improved any of the web features, but release notes for all of them mentioned internet features as the main improvement. One of them provided Skype support, if you have the Sony Camera that matches the TV frame. I guess it looks cool since it matches the bezel of the TV, and it is a neat idea for some. I don't think it will ever be needed in my bedroom, that isn't my thing. It would probably be great if I put this in my kitchen, as I like to Skype to my family during breakfast when I'm on travel for work. But I do it via a desktop PC for now. If I ever move it to the kitchen, I may reconsider.The picture is still amazing. I still don't see the \"Significant\" light drop-off others claim is there when viewed off axis. I also noticed many others stating saying the USB wi-fi dongle works. What are you talking about!?! The TV's WiFi antenna is built in 802.11N! I think they are reviewing the wrong Television.I still haven't tried the DLNA support. It just isn't a priority. Maybe one day. I like knowing it is there, and I have quite a collection to stream to it. I have yet to set up my PC as a DLNA server.Verizon FiOS finally updated their on screen display, it looks amazing on this TV. Widescreen, and easier to read than its SD predecessor, but I credit the TV with providing the 1080p, to make it look crisp!PSU buzz, well Yes, if I get my ear within 2 inches of the TV, when it is powered down, it does have a slightly audible buzz. I have really good hearing (tested every year for work), and it takes that sort of proximity to notice it. I still think the other reviewer got a bad unit. I happened to notice it on a day when no one else was in the house, otherwise it is always too noisy to hear it during the day, and inaudible from 10 feet away while I'm sleeping.I'm still very satisfied with my purchase. I do like Sony products, as I have a good track record with them over the last 15 years. Only two minor problems with approximately 25 products of all types. My first Sony TV is still going strong. My second Sony AV receiver burnt out the center channel after 9 years (which was long enough for me). For my third Sony AV receiver I was happy to purchase a top of the line model to replace it. The original one is still working... My Second Sony TV had a bad speaker, that I never noticed until 6 years later, because it was hooked up to my AV receiver the entire time. I'm guessing it was broken when I got it, and would have been under warranty, if I ever noticed it. I have had several Toshiba televisions, and Samsung TVs, I still prefer Sony, but I'm willing to buy any major brand that I like the User interface, and image quality.", "Date": "May 22, 2011"}, {"Title": "The best TV we've owned!!!", "Author": "Paul D. Skinner \"IDSkinner\"", "ReviewID": "R3PKYRJXFHJLM5", "Overall": "5.0", "Content": "This TV has been outstanding.  The picture is clear and crisp.  Yes, I too was worried about the 60hz engine, however, they've figured something out as we have no blur in sports or fast action scenes.  The TV does as advertised and boots quickly.  The Netflix viewing only the Queue was annoying at first since my PS3 allows me to search.  I basically added more to my queue on my laptop which is much faster anyway.  Can't see any problems with this unit and it's the third 40+\" TV I've owned.  Also, the base is really solid and swivels smoothly.I was not impressed by the shipping!  They called me to reschedule two times.  The TV was supposed to be here on a Friday. They called to reschedule for Monday. Monday, they called to reschedule for Tuesday. What was annoying was that the TV was in town on Monday, but they just didn't deliver it.  Not a knock on the TV though and it did deliver in perfect condition.", "Date": "March 30, 2011"}, {"Title": "Sony disappointment", "Author": "tucky", "ReviewID": "R1GGTTBRVMW14N", "Overall": "1.0", "Content": "I'm a longtime Sony product user.  I have had eight Sony televisions prior to purchasing the Bravia KDL32EX523.  I was VERY disappointed with this TV and I returned it to Amazon.  The picture had an overall magenta cast, even when I turned chroma all the way down (to black and white).  Reds were magenta (ever see a magenta Coca Cola can?)  If I adjusted color toward green to \"correct\" the red deficiency, the yellows went greenish.  The picture also lacked snap.  Colors were washed out.  Flesh tones were not natural.  Highlights tended to bloom, losing detail in highlight areas (like faces).  Adjusting brightness, contrast, backlight didn't help.  Could never get a satisfying picture.Also, the audio quality was poor, no decent lows or highs.  Just mid-range.  The remote control was very difficult to use, too difficult to navigate.  The printed instruction manual was very inadequate, basically dealing with initial installation and setup.  Everything else was on-screen.  Sony, please provide a complete PRINTED manual.Maybe it was just the particular TV I received, but this TV was not up to usual Sony standards.Thankfully Amazon has a wonderful return policy.  Thank you Amazon.", "Date": "June 28, 2011"}, {"Title": "Great TV", "Author": "david kuhn", "ReviewID": "R1HRJ3QS01ZC6S", "Overall": "5.0", "Content": "This is our first LED TV.  Our old set was also a Sony that was nearly 20 years old.  The picture on this new set is outstanding.  That is with just normal TV and not HD.  HD will knock your eyes out.  I really like the fact that it has an earphone jack.  I also like the presence sensor.  It is very handy to have.  The set functions flawlessly and was extremely easy to set up!  The old set weighed 120 pounds.  This one weighs a mere 22 pounds.  the picture quality is truly amazing!", "Date": "July 3, 2011"}, {"Title": "Nice Features, but some design flaws", "Author": "D. Vega \"D.C.\"", "ReviewID": "R3SVYYE4ECERZ4", "Overall": "3.0", "Content": "The picture and sound are pretty good. No complaints there.Viewing angle is pretty narrow; you don't have to move far to either side before the picture gets washed out. But I usually watch straight on, so not a big deal.The integrated WiFi is a nice feature, mainly for watching NetFlix without having to hook up a computer or PS3.But there are a couple of really disappointing things I can't overlook.The worst thing is that the T.V. emits is a high pitched whine or buzzing sound constantly. And when I say \"constantly,\" I mean EVEN WHEN YOU TURN IT OFF! Actually, I think the reason the noise doesn't stop is because you can't really turn the T.V. \"off;\" when you hit the power button, it just goes into \"standby.\"  So if this is a bedroom T.V. and you want to turn it off and go to sleep, that means you have to get up and go over and pull the plug unless you are hard of hearing or can sleep through the noise it makes all night. If, like me, you have it mounted to the wall and plugged into an outlet hidden behind the T.V. itself, you're screwed.Another annoying thing is that the PC video input is on the side of the T.V., but the PC audio input is on the back (so you cannot easily connect your PC with one of those cables that has a 15-pin video and a stereo mini plug in the same cable). To mock you further, the designers did actually put a mini-jack right next to the PC input, but THAT mini-jack is not an input, it's an output (for headphones).I wanted to give this T.V. a higher rating, because the picture and sound quality aren't bad, but I expect better design decisions from Sony, and a T.V. that goes silent when I turn it off.", "Date": "March 20, 2011"}, {"Title": "Had one issue but the picture is great", "Author": "JoeBrown \"ToolGuy\"", "ReviewID": "R3BZZJWPKTAW20", "Overall": "4.0", "Content": "I bought this Sony Bravia after getting the Sony Google TV earlier this year at Target for another room.The picture is great on this TV. After a few weeks I moved this TV to hang on the wall and somehow the cord came lose inside the box. I called the Sony repair line and they sent out a free service repairman in my area (yes they still have local TV repair and service people!). He got is fixed in 5 minutes. We connected this TV to the internet so we can download movies and shows from Amazon instant video. My goal is to drop Comcast (other than basic) and just use internet TV. So far so good. I must say that I like the Sony Google TV remote a little better than the remote with the Bravia. Many more functions for surfing the web and shopping Amazon.com. The Google TV has poor reviews online because of the remote but I like it and my wife likes it too.The Bravia works great for use with Pandora.com to play music thru out the house on our home surround sound / house system.", "Date": "August 29, 2011"}, {"Title": "Excellent Picture and Sound with Great Features", "Author": "PaulGo", "ReviewID": "R2460BHPGZHQVY", "Overall": "5.0", "Content": "The picture and sound quality is excellent. This set does not emit and hum or other noises.  This set has many adjustment for picture and sound quality to get the picture and sound you want.  One great feature is the ability to output variable sound while the internal speakers are on - this allows me to directly connect a sub-woofer.  Sony also has the great set of available internet features built into the set along with DLNA to allow getting pictures, music and video from your computer.  The set has a fast picture response time and I do not notice any motion blur.", "Date": "June 8, 2011"}, {"Title": "This is why I shop Sony first for televisions!", "Author": "35-year Technology Consumer \"8-tracks to 802.11\"", "ReviewID": "R10F0H80X7R5GR", "Overall": "5.0", "Content": "Television technology has advanced rapidly in the seven years since I purchased my first high-definition, flat-screen television. After paying the \"early adopter premium\" on a Sony Grand WEGA in 2004, I'm happy to report it is still running strong and has never had a single problem. The sustained long term performance of that television led me to Sony and the Bravia KDL40EX523 when the time to update the primary television in our house...a 10-year old behemoth with rapidly degrading picture quality and a giant 25\" CRT picture tube that screamed \"20th century throwback\".If you were an early HDTV and flat screen adopter: you'll be delighted at the drop in price and increase in performance in the current choices on the market.  For this television, easy basic operations are supplemented with a range of Internet-enabled functions that expand its overall entertainment value (or time-wasting opportunities, depending on your point of view).Set-up was relatively easy. Assembly consisted of a three-piece base/post/rear bracket that secured easily with five screws. This can be done by one person, but you'll be happier with a helper. When I applied power for the first time, the television went through a brief self-test, followed by a menu-driven set-up routine consisting of on-screen menu items that you select with the remote. Following this, it took about 20 minutes to index the available channels and programming data from my provider (while waiting for my cable company's DVR to arrive in the mail, I tested this TV with direct input from the coax).The television's integrated WiFi immediately recognized and connected to the router (it will also connect via ethernet, which I did not try).This television is outstanding in what matters most: picture quality and ease of operation. HD programming is as vivid as you would expect it to be, and SD programming is also crisp. Sound quality won't be confused with anything coming from high-end speakers, but is perfectly acceptable. The controls on the remote are intuitive and nicely labeled.Most of the default settings for sound and picture were perfectly acceptable, and should require minimal adjustments for all but the most obsessive tweakers. I'd avoid the \"simulated 3D\" option, which mostly adds a buzzy echo.Among the Internet-enabled features are single-button access to Netflix. Additional menus provide access to many popular other Internet services, including YouTube Pandora, Slacker Radio, Hulu, Amazon video, Facebook, Flicker, Skype, Twitter...and any other site you want to view via an integrated browser). If you have a smart phone, you can install Sony's media remote application. While its usefulness as a remote control is basic, its best feature allows use of your phone's keyboard while doing searches of online content: far easier than navigating through the OEM remote's point-select of an alphanumeric menu.Video/audio quality in the applications I use (Netflix, Pandora and Flicker) were fine. Obviously the network carrying these services will have a large influence on their quality and responsiveness.Flicker is accessed via a family of Yahoo-driven \"widgets\", some of which work better than others. The Weather widget and Flickr widgets both work very well. There are nearly 200 others available (and the majority seem to be apps for local TV news markets).This television also immediately recognized and was able to access local media available via DLNA media server (enabled in a Buffalo Technology NAS device.Finally, if you are using this television with other late model Sony components connected with HDMI cables: the components integrate well with each other. This unit receives inputs from a recently purchased  Sony AV receiver and Sony Sony Blu-ray player. The receiver power and input functions are automatically synchronized with the television options for programming source and sound (TV or external speakers). Very nice.While nobody can tell how long a piece of electronics will last, it's always a good sign when they work well out of the box, and this television has done just that.Exercise its advanced network/Internet-enabled functions, will require some comfort with LAN configurations and media server set-up (if you are doing local streaming).The printed user guide included has minimal information on set-up and functions. Detailed information is in an interactive guide displayed on screen via a button on the remote.A final note on The Internet-enabled content, which  can be placed in three broad categories:(1) The obviously useful,in the wheelhouse of the most popular online destinations today Netflix, Facebook, YouTube, Hulu and other major names).(2) Some is stuff you may have never heard of, probably placed in partnership with Sony to drive eyes to these destinations...and presumably increase their revenues; I probably won't look at many of these.(3) Some of it is a direct reflection of the Sony entertainment monolith: is there *any* other explanation for a dedicated \"Dr. Oz\" content channel? Who knows why they think we need this...We live in a world fueled by advertising. None of these detract from the television's performance, but you should manage your expectations on the total utility of the Internet-enabled content.", "Date": "November 30, 2011"}, {"Title": "Easy Setup, Beautiful Picture", "Author": "mikel123", "ReviewID": "RWUTV8JNVOYX4", "Overall": "5.0", "Content": "This television is laughably light and easy to carry and move around.  The stand it comes with is excellent at sticking to whatever surface it is placed on.  It's not exactly suction cups, but I put it on my recently-finished hardwood floors while unpacking and I had a hard time picking it up off the floor.  Which is great!  Less chance of it falling over if it ever gets bumped.The menus and options are very complete, and the built-in wi-fi is great.  The picture is miles better than a 42\" LCD TV I bought a few years ago.  This is one of the cheaper 1080p TVs with wi-fi built in, and I think that makes it a good choice for a lot of consumers like me.", "Date": "July 28, 2011"}, {"Title": "Love it!", "Author": "L. Coursin", "ReviewID": "R25T9VFCZEEVJJ", "Overall": "4.0", "Content": "When my Sony of almost 12 years started flashing, I knew it was time for a new one. I researched TVs for a while and decided the Sony bravia had everything I was looking for. The 40 inch is fine for me. Set up was easy, but had some problems with the internet connection.  Netflix would not accept the key so I had to call them. For the most part,kinks have been worked out, except for one with the internet. Streaming movies are fine, you get free movies through Amazon if you are a prime member, my Son loves the You Tube feature.The picture is amazing, however, while watching certain movies it needs to be set to a brighter setting because the picture is too dark. The sound could be better, so I will connect speaker surround system to it later.So far so good. The price was higher than some 46 inch, but did not have internet capabilities. The 60 hz has not been an issue for me.You know what they say, you get what you pay for. Sony is the best in my opinion.", "Date": "May 1, 2011"}, {"Title": "Sony Bravia is the best", "Author": "P. K. V. Winkle", "ReviewID": "RGTNI5YZLMPSU", "Overall": "5.0", "Content": "Before buying I spent alot of effort reading reviews etc.  Too many people dished the product because of problems that, it turns out, are not unique to Bravia, or even Sony...it's like saying \" don't buy a ford, cause I had an accident in mine that wasn't my fault! This tv is one of the best I have owned and my research confirms that Sony most definately stands behind their product.  Read reviews carefully and don't believe everything you read!", "Date": "April 7, 2011"}, {"Title": "Great TV", "Author": "Richard E. Hanson \"hansrich\"", "ReviewID": "R3JPRB3L8O44XG", "Overall": "4.0", "Content": "I read all the other reviews but I got this TV as a \"no hassle warantee replacement\" for another Sony that had a panel go out on me.  The difference between my old one and this is that this one has Edge LED Backlight and internet connectivity.  Because I read the previous reviews, I was prepared before the set arrived.  I bought a CAT 7 LAN cable in case I had to hardwire it, but I wanted to try wireless first.  The wireless works great for me, but then I have a Linksys maximum performance dual band N router.  The TV uses the 5.1ghz band while my computers and printers use the 2.4ghz band simultaneously.  I set the router up first with WPA-2 security and my chosen SSID and Security key.  DO NOT use the WPS setup even though this router has the capability.  What happens when you do, is the router generates a random set of security keys and then you have to go back and reconfigure all your other stuff so they will work.  Choose the manual configuration and scan for and select your network SSID, then input your preset security key. Boom - Done.  My cable modem and router are in a stand with my cable box, dvd, blu-ray, etc. about 3' below the wall mounted TV.  So far the streaming movies work well, and I would not expect then to all be free.  I bought the router and Sony Wireless LAN adapter refurbished and saved a chunk of money.  I do this frequently because they are TWICE BAKED as far as factory inspections go.I also was disappointed with the sound at first, but I went to the sound setup and selected the surround sound feature and adjusted the treble - bass so everything became clear as a bell.  Best TV sound I ever had.  I also have some Sony wireless headsets that have built in DTS and Dolby Digital decoders.What can I say about the picture.  Nothing bad, but I do take the time to go through the entire setup procedures and tweak everything the way I like.I will agree that the wireless LAN adapter is overpriced, but that what Sony does.I haven't tried connecting my computer to it yet, but I have ordered a 15' HDMI cable that I will use to try.The split screen feature is the best I have ever used.", "Date": "September 15, 2011"}, {"Title": "Using for gaming and PC inputs (1 Week In)", "Author": "KBeasley", "ReviewID": "R2AGAADG7SO5CN", "Overall": "5.0", "Content": "What can I say, this TV is great. It's slim, and looks absolutely stunning. It turns on much faster than my 2009 Sony that I used to have. The menus are fairly clean and the internet connectivity is awesome! It updates it's own firmware!Anyways, It took some adjusting, but I'm using the VIVID preset with a few minor changes. There is no noticeable input lag which is awesome for anyone who plays games. I also have this hooked up to my PC through HDMI and boy does it look good! I have honestly never seen a picture so sharp and colors so vivid. 1080p is well worth it.There are only two cons that I can think of. First, there was one screw missing on the stand, but that's not a huge deal. Second, Sony will not warranty this TV at all. I should have known this, being it is an open box or \"used\" TV, but Samsung will still warranty their TV's sold on Amazon's Warehouse. Ah, oh well. I have faith that Sony's products will not fail on me anytime soon.", "Date": "July 27, 2011"}, {"Title": "Love it.. look around forever - glad i bought this one", "Author": "appleFan", "ReviewID": "R3DTIVNRXRJCVY", "Overall": "5.0", "Content": "A bit pricey but all in all we love this TV.  we were looking for something that fit our space constraint and wanted a good picture quality as well.  This one allows us to have the common services we use (netflix and hulu and amazon vides) without having to have another box attached to it (was hoping to have an excuse to buy an appleTV but this does everything we need).  The wifi allows to us to not have to run cables to the location.The picture is smooth and clear.  other tvs seemed to have a brighter picture and maybe better refresh rates but all looked washed out or off color.we love it.", "Date": "July 11, 2011"}, {"Title": "Good Enough", "Author": "Railgun", "ReviewID": "R1KV1N0EDUDPJ", "Overall": "4.0", "Content": "I got this TV because I wanted one with integrated (built-in) WiFi. I don't watch a whole lot of TV or even movies. 90% of the entertainment I watch is off the Internet, everything else is local stations I can get over the air. I could care less about the speakers and refresh rate.I use WPA2 AES on my WiFi network. I was eventually able to get this TV to connect but it was a pain. First, I had to enable SSID broadcasting. Even once I did get the TV to connect, if I made my network private again, the TV would lose the connection which is stupid since once it knows the name of the network to join, this shouldn't be an issue. I'd rather not have to broadcast my SSID but now I have no choice. Not even manually entering an IP address, subnet mask, gateway, etc. helped.Second, in order to get the TV's MAC address, you have go into the network settings. It's not on the box anywhere. This means when you first setup the TV, you'll have to cancel out of the WiFi setup to get to where the MAC address is and then go back and setup WiFi.Of the 20+ devices that span every manufacturer I've used, this is the only one I had to modify my WiFi setup to get it to connect. I'm sure if you use WEP (which is a joke) it'll work fine.Another complaint is that it takes about a minute for the TV to \"warm-up.\" Not in the traditional sense but for the remote to start communicating with the TV. More than likely when the TV first powers-up, the processor is busy with task like checking for updates, etc. and it doesn't respond immediately to things like changing channels and displaying the guide. This a bit of GUI oversight on the testing team's part.After a month, the right speaker started making a loud clicking noise even when the TV was turned off and all cables were disconnected. I called Sony Service on a Sunday the same day their web site was down and a big game was on. None the less, the service rep was very polite and patient and gave me a couple of options after we tried some troubleshooting. At the end of the call, I realized the clicking was feedback through the AC outlet and when I turned off a light in another room, it stopped!Also, beware, you have to have Hulu Plus to use Hulu on this TV. You're free account won't work. Pandora and YouTube worked fine.I eventually hooked an Apple TV to mine so most of the Internet content issues became moot as Apple TV works much better. Now it functions mainly as a monitor.I have not tried an over the air antenna yet.", "Date": "September 5, 2011"}, {"Title": "Awsome TV", "Author": "A. FRANK", "ReviewID": "R6JAWW5ONT20C", "Overall": "4.0", "Content": "I did alot of research before buying the Sony Bravia TV. The selling point was the WiFi for streamlining movies. I havent had any issues with the picture quality when viewing at a bit of an angle. My TV came with the picture setting at \"streched.\" I set it to normal and its beautiful. The only reason I gave this TV a 4 star is because it was difficult to set up on the internet. In the instructions it should state, \"Call Technical Support\" to assist in setup. That would relieve alot of frustration because setting it up to the wireless is very technical. It asked for a code that only the technician could help me with. I had registered my TV with Sony however did not set up an account. You have to set up an account in order for all of this to work.  But...aside from that, great TV.", "Date": "August 16, 2011"}, {"Title": "Best Ever", "Author": "John", "ReviewID": "RX0RR5CK5XSCI", "Overall": "5.0", "Content": "This is an upgrade from a Sony 960p HDTV and it is worth every penny! The picture is top notch, the best I've seen. The wireless USB Device is well worth the price for instant access to streaming video from the internet. The picture is unbelievably clear, crisp, and highly defined.  If you're considering this as an HDTV upgrade, or your first HDTV the Sony Bravia is well worth the money and far superior to ohter brands i looked at; the seller shipped in a timely fashion and the unit is easy to assemble.", "Date": "September 15, 2011"}, {"Title": "Exactly what I wanted. Glad I got the built-in wifi & LED screen.", "Author": "A. Parker \"impressed by intuitive leaps of in...", "ReviewID": "R2X55A9UWA0NBA", "Overall": "5.0", "Content": "This is my first HD flatscreen purchase. I was waiting for the right combination of features at the right price. I got it with this TV. In this purchase, I got HDTV, built-in wifi, LED screen plus onboard apps - all for just over $1000. I have been the proud owner for 10 days. It was worth the wait.", "Date": "September 8, 2011"}, {"Title": "Fantastic HD Picture", "Author": "S. Kessler", "ReviewID": "R36NCKYXEDF3PC", "Overall": "5.0", "Content": "I bought this 46\" Sony to replace a 26\" that died in the recent hurricane.  I decided that a serious upgrade in size was needed and I was very attracted to the on-board Internet connection and built-in wifi.  I was not only not disappointed, I have been thrilled to pieces (with just one minor glitch that I'm sure will be resolved).  Set up was extremely easy.  I purchased the Sony Home Theater Sony HT-CT150 3D Sound Bar System to enhance the sound quality and the two products sync together.  The TV and all components (cable box, DVD, and even my iPod) connect through the subwoofer, which serves as a switching box, so there is only a single cable going into the TV.  With Bravia Sync you can control the sound system with the TV remote. I still have to switch channels when watching through cable with the cable remote.The HD picture is nothing short of astounding.  Really beautiful, sharp, clear, vibrant.  Watching nature shows and movies on this set is a revelation.  Movies look fabulous, and in my apartment-sized living room, the size of the screen makes you feel like you're in a screening room.  I will have very little need to ever pay movie theater ticket prices again.The one glitch so far is that I can't seem to get the streaming services (Netflix, Hulu, and Amazon) to play through the sound system.  I suspect that I will need to get on line with Sony customer service to fix this.  Also, one of my HDMI ports had a somewhat loose connection and the screen would periodically back out for a fraction of a second.  I fixed this by switching ports and now it is fine.Edit on 10/5:  I solved the sound system issue for my Netflix and Hulu streaming apps.  It was a matter of making sure the HDMI cable from TV to subwoofer was as firmly connected at possible.  I did that and now I can not only watch all the streaming services I subscribe to, but they sound just great through the external speakers.This is an excellent TV that I highly recommend.  It's very interesting, also, that five years ago, when I bought my first flat screen HD TV, a 26\", I paid about $250 more than I just paid for this TV on Amazon.  Go figure.", "Date": "September 25, 2011"}, {"Title": "Picture is great, after tweaking it.  Lots of great Internet options.", "Author": "Ima Consumer", "ReviewID": "R35KZG7AFOLHBX", "Overall": "4.0", "Content": "I bought this 40inch TV for my bedroom one month ago. I have a 46 Sony XBR in my living room, that was purchased in 2007.  Initially, I was dissapointed in this set's picture, compared to the XBR; however, after making adjustments to this set, I'm very content about the purchase.I chose this model because of it's wireless internet and Netflix, but when I tried to set up the wifi I ran into problems and gave up.  (No, I did not call Sony to help me.) In any event, a couple of weeks later, I purchased a Sony Blu-Ray player that had Ethernet, but no wifi without a purchase of a Sony dongle. Since I intended to run Ethernet from my router to the Blu-Ray, I just ordered an extra cable and ran both of them. After that, the Internet connection set-up was a breeze.I have seen some complaints on this thread from others about Netflix being slow on this TV, and having to occasionally re-buffer, but I think it works fine. I've never had any problem with it and my download speed is only about 2.7 meg.  In addition, the Netflix broadcast quality appears better than what I see on my other TV, the desktop PC, and the laptop as well. Also, the Netflix button on the remote control really makes things convenient selecting films.My only complaint, and it is a minor one, is I would have appreciated a lighted dial on the remote, as well as having the buttons a little less crowded.", "Date": "January 8, 2012"}, {"Title": "Great TV!", "Author": "Larry Gentry \"larrygentrydotcom\"", "ReviewID": "RFZRF602W4F53", "Overall": "5.0", "Content": "I think this is the best 32\" HD TV out there for the price.  The screen seemed a little dim in my television cabinet at first until I turned off the light sensor.  It has amazing clarity and it recognizes the Sony Blu Ray player.  It shipped very quickly and was easy to assemble and connect.  I'm so happy, I may even subscribe to Netflix again!  :-P", "Date": "December 18, 2011"}, {"Title": "Wow!", "Author": "Leslie Sherman", "ReviewID": "R3AYLHIF2A3CWX", "Overall": "5.0", "Content": "We finally got a new TV to replace our 25\" Sony Wega, which had a wonderful, though analog, picture.  This TV arrived perfectly on time, was set up in just a few minutes, and we have been dazzled by it.  Best of all, it picked up all the HD channels on our basic cable feed, which we didn't expect.  Thought we'd have to upgrade that too, but are very happy, since it's only 55 bucks a month.  We haven't used it as a computer yet, because we have a new PC in the same room.  After a month, we are still dazzled by it.  Also has quick channel changing, very easy to use features and a GREAT picture, gloriously sharp and clear.  Even the built-in speakers are sufficient for our needs.  Welcome to the 21st century!", "Date": "November 25, 2011"}, {"Title": "sony ya baby", "Author": "Wayne S. Lamkin", "ReviewID": "RDQZEQBWVT437", "Overall": "5.0", "Content": "Unbelieveable picture and the setup is so easy.We keep saying wow look at the color,look at the sharpness of the picture,amazing.So easy to change sound tracking, cool.Love this TV great size for the bedroom, would go bigger in a livingroom, bigger would be better.Sound is good much better than most TV's but speakers would really help.", "Date": "November 25, 2011"}, {"Title": "Couldn't be happier", "Author": "Sean Foster", "ReviewID": "R3OMN4M1CJC28U", "Overall": "5.0", "Content": "2012 - The set up was easy - despite other complaints here. It took about 20 minutes. The wireless works well for Netflix. The picture is comparable to my old Samsung LCD that died last week. The blacks are blacker. I have noticed some effects from the higher refresh rate, but it is not as distracting as what you see on the 240hz TVs. This was a great deal on a great TV.2013 - It's been a year and a half and I still love this TV. The speakers really are better that most. They still distort a little, but nothing like what the old Samsung would do. I would buy this TV again - as long as it lasted more than 5 years. Let's see how it holds up.", "Date": "November 14, 2011"}, {"Title": "Sony KDL32EX523", "Author": "Tonsoffun", "ReviewID": "R3BKNJO6S9LCKP", "Overall": "5.0", "Content": "So far really satisfied with this t.v, picture quality in HD is amazing and standard channels are still good,  built in wifi is cool so I listen to pandora often and  sound quality is also really good for its slim size.  I did not look at other models because I am a sony junky when it comes to T.V. and for 100$ less then the local retail stores, I was really satisfied.", "Date": "September 28, 2011"}, {"Title": "Best there is!", "Author": "Amazon Customer", "ReviewID": "RUWJWALDCU8M2", "Overall": "5.0", "Content": "I put this TV on the wall. Netflix worked perfict. The pictuer, controls and volume is excellent. The price can't be beat. You wont go wrong in buying this TV.", "Date": "July 28, 2011"}, {"Title": "Looks great!", "Author": "K. Arnold", "ReviewID": "R11VG7W19WCK0N", "Overall": "4.0", "Content": "This TV looks very good and the price is even better. The built in WiFi makes it even better if you were going to have to purchase the adapter.The on-screen menu/options is quite nice and the internet apps work as expected. I especially enjoy the Pandora app.I'll post back later if I have any issues with the TV.", "Date": "June 18, 2011"}, {"Title": "Good TV, but terrible customer service and support", "Author": "A. Stephanov \"Alec\"", "ReviewID": "R15CVRZDK86JFN", "Overall": "1.0", "Content": "I  bought the TV at the end of February. Last Sunday, March 18th, the screen went bust - there is a large band that mirrors the top of the screen with a bunch of small lines above it. The screen is unusable. I couldn't get in touch with their customer service team - the extended hours number was busy! I had to resort to a chat session with some moron, who typed with about 2 words a minute. After 2 hours of back and forth, answering the same questions, I managed to do a reset, which didn't help. I was then told to call customer service who would have helped me initiate a \"claims\" procedure (mind you this is a TV that is not even a month old). Today (Monday), I was finally able to get in touch with them - I have to fax a receipt (from an e-mail), which they have, because I bought the TV straight from Sony! I am speechless! Who uses fax nowadays. Even retirees have scanners and e-mail! Anyway, presumably, once I fax it, I will be contacted within 5 business days to schedule an appointment for a technician to come and fix it. They already know what it wrong with it!? It would probably be another 10 days or so, before I get to watch anything and I am being optimistic. Just stay away from SONY!!!!!!!!!!!!", "Date": "March 19, 2012"}, {"Title": "Good overall TV, terrible Netflix stream", "Author": "ArmyPanda", "ReviewID": "R223QP84TN27C0", "Overall": "3.0", "Content": "Picture is crisp and clear with lots of options to change for personal preferences. However, the streaming speed for netflix is just down right terrible. most of the time I just quit watching it and use my xbox to watch netflix anymore. But other than that not much to really complain about.", "Date": "January 18, 2012"}, {"Title": "The best Internet TV option out there", "Author": "Nina", "ReviewID": "R1KJ2ZLW25LO14", "Overall": "4.0", "Content": "I was doing quite a bit of research before making the choice. I've read almost every review on CNet and Amazon. My goal was to find a solid TV with Internet Apps - as lately all we do is streaming Netflix and don't watch cable TV at all. My choice eventually narrowed to Google TV an this Sony Bravia EX52.Google TV (also produced by Sony) - seemed perfect, offering much more flexible platform - pretty much as open to content as any computer hooked to Internet, better browsing and convenient remote with keyboard  - it still left an impression of a Beta version. Plus it doesn't work with Skype (yet). Bravia has its own hardwired set of available applications, but the choice of them was exactly what I wanted. Skype ended up to seal the deal.It arrived in perfect condition and even one day earlier (and it is around Xmas time).Hooking it up took less than an hour.I have read complaints that process is a bit confusing (in particular - Netflix). System forces you to register on Sony site with the code, that TV provides (appears on its screen automatically) and then the site connects your TV with your Netflix account (with another code, that you get on Sony site). Although it seems complex - in reality it takes literally two minutes and under no condition this should be a subject to purchasing decision. It took me a few minutes in the most distracting conditions - my kids were all over TV and me like a bunch of monkeys. If I could do it easily - anyone can.The other concern that I knew about when purchasing - is inconvenient remote  - in particular the way of characters input. And this is indeed a weakness, Sony should do something about it. I said earlier that hooking it up took less than an hour - most of this time was taken by trying to find \"_\" character of my Skype login.But in general for me it is not an issue - I am one of those who was quickly texting on old fashioned cell phones way before T9 dictionaries, so putting in characters through the number pad is something I can live with, plus you don't do it often. Otherwise navigation is totally friendly.All in all I am one very happy customer. Works beautifully. Skying on TV is absolutely awesome, still can't get over it :) (you'd need to buy a camera, sold by Sony separately, connects to TV via USB), Netflix picture is amazingly sharp, better than on my laptop, Youtube works really well, other apps we did not try yet. I would give this TV 5 stars, but took one off for the remote.Hope this helps.", "Date": "December 22, 2011"}, {"Title": "SonyLuvr", "Author": "Tom Terrific \"TCW\"", "ReviewID": "RYIA1948GIQ51", "Overall": "5.0", "Content": "This is a great tv for the price. Beautiful picture after doing some adjustments of my own.  I also own a Sony home theater system which hooked up flawlessly to the tv. Note: you cannot use the hdmi to use the theater system's speakers; you must use a separate digital optical cable ($10 at Walmart or even cheaper models here on Amazon). The picture is bright and even the sound isn't bad for a tv once you make some adjustments (increase the bass and treble controls and be sure to use the stereo setting which was not selected on setup). Thin design, nice piano frame with dark brushed aluminum look across the bottom. I'm not sure why the people who design remotes seem to think the digit keys (1-0) at the bottom of the remote where it is cumbersome to use them; otherwise the remote is great. I really like Sony products and even though this tv is only a 60hz refresh, I do not notice any ghosting or blurring on fast-paced sports or other programs. Any other questions, leave me a note on a review and I'll try to address it. Enjoy!", "Date": "December 14, 2011"}, {"Title": "Good TV for gaming", "Author": "W. Rich", "ReviewID": "R3PJIDMLJPYFNU", "Overall": "4.0", "Content": "This purchase was as tough as it could have been because i was looking for a TV for my bedroom that would be primarily for gaming and movies/cable secondary and it was black Friday and there were so many deals out there for TV's, and it was hard for me to shell out 600 dollars for a 32 when I could have acquired a bigger TV for the money (Its not always about the size, but the motion in the ocean.... right? lol). There are so many choices out there and yes, you can find another TV that is cheaper but you will not get the quality from a cheaper TV like you have in this one. This TV was replacing an HDTV that I purchased from Walmart and I had decided that I wanted an led 60h TV. I have chosen this TV because it has plenty of hdmi ports (4 to be exact) and what I also like about this TV is that it has a headphone jack,hdmi port, and USB on the left side of the TV. This comes in handy if you use turtle-beach headsets because you can just plug the headphones right into the headphone jack and power it with the USB jack right next to it and that's it. Also what I have learned about this TV is that if you have a PlayStation 3 and you turn it on, the TV will recognize the PS3 and change the channel for you to your PS3. I thought that was cool because it just saves you the extra time not having to turn the channel yourself. The sound is OK, but you can hook up external speakers if you would like better sound. If you're in a small room a mini surround sound system (or computer speakers with the small sub-woofers) would be nice with this TV because if your in a small room, you can just plug the speakers into the headphone jack on the side and that's it, better sound. I have not tried the Internet apps yet, but I can assure you they would work fine and the menu/guide interface are smooth and functional. I also like the fact that it has a sensor on the TV that detects motion/non motion and will turn off the display if there is no movement but the speakers will still be on, and if its no movement for a longer period of time, the TV will completely turn off. The only reason I did not give this TV five stars is the stand that came with the TV. When I hooked up the TV, the stand was slightly under a 90 degree angle and it says in the instructions that you can tilt the screen slightly back. The instruction was right, you can tilt the screen back but the stand can swivel and if you turn the TV, the TV will tilt back down. You can remedy this by wedging something behind the TV but if I paid this much money, I would expect the construction of the stand to be a little better. It also sits kinda low and I would have liked it to sit a bit higher, but this is just a preference thing. Also the remote is a little too bulky and large and I guess they weren't worried about ergonomics when they made this remote because it could be compare to the dimensions of a brick without the weight. Overall, this TV is a good buy, yes, it is a little pricey for a 32 but you get what you pay for and that is quality out of this sony bravia. Also, I can actually say I have a sony bravia now lol, this tv is definately worth it, just hit the buy now button. P.S get prime if you dont have it already only 3.99 for next day shipping, it will pay for itself in about one or two big item purchases", "Date": "November 29, 2011"}, {"Title": "Really sweet.  The LED display is so crisp, you can't believe it", "Author": "David Alan Tussey \"Google Advertising Specialist\"", "ReviewID": "R1XR4B4PYQR4RR", "Overall": "5.0", "Content": "Excellent TV.  Very nice LED screen.  Extra crisp.  Remote controls and wi-fi connection is perfect and setup is painless.  The best TV in my house.  Have had a couple of Sharps, but this is better.", "Date": "November 25, 2011"}, {"Title": "Mike'y Likes It!!!", "Author": "Michael Barnes", "ReviewID": "R1N5DQ9KGQDH4Z", "Overall": "5.0", "Content": "This tv has great picture when hooked up to a Blu-Ray Player or Direct TV HD box. But you have to be watching HD Programing to get good picture or else it's a little pixilated. It's easy to hook up to a surround sound system using the head phone jack (Tv Sound is not the best with out surround sound) The one button Netfix on the remote works great very easy Steams video and music very good though the built in wifi if you have a fast enough internet service. Overall Great TV!!!", "Date": "November 12, 2011"}, {"Title": "Top Quality TV", "Author": "DavidCT", "ReviewID": "R3BCTLPLY3SZ9U", "Overall": "5.0", "Content": "I absolutely love this TV, not just for the amazing picture quality, but also for the fact that it includes services like Netflix and Amazon Prime.It's thin, light and elegant... you just can't go wrong.", "Date": "November 11, 2011"}, {"Title": "Smart Tv for any room", "Author": "Joseph D. Foret", "ReviewID": "R2WPMDP1MBZ00V", "Overall": "5.0", "Content": "One of the best TV's I have ever purchased.  Thin, elegant and without a doubt one of the best pictures of any television out there.  Five out of five stars in my book.", "Date": "November 3, 2011"}, {"Title": "1080 DPI is ....WOW!", "Author": "Mike Arnold \"Tug Captain\"", "ReviewID": "R3MGVXC66Z686P", "Overall": "5.0", "Content": "I would have never thought that you could buy a 46\" TV on line, buy you can. Took a litle while to install the wall hanger and cables but all turned out great. The computer ready could not have been easier. The picture is sharp and very clear. I am never sorry when I buy Sony.", "Date": "November 3, 2011"}, {"Title": "Fantastic!", "Author": "Carolyn", "ReviewID": "R3SJHZREGGUUCD", "Overall": "5.0", "Content": "Written 2011: I chose to purchase this TV because of the built in WiFi. I didn't want to have to purchase a TV and then need the additional USB drive to get WiFi connectivity for Netflix and Amazon on Demand. I can't say I was disappointed with my purchase! This TV is phenomenal! The color and clarity of the picture is clear and sharp. Additionally, the ability to pivot the screen is a perfect addition to my condo, as I can turn the tv to face my couch or my kitchen. Finally, the one-touch access to the internet makes the difficult choice of what to watch simple, as I can flip from watching TV to Netflix to Amazon on Demand to YouTube instantly! I defintely recommend this product!Update 2012: One year later and I still love this TV. There isn't a time that a friend or family member won't come over and compliment that amazing picture!", "Date": "September 15, 2011"}, {"Title": "picture brightness issue....", "Author": "B. Tran \"chubby\"", "ReviewID": "R20C0RRQ353EPG", "Overall": "1.0", "Content": "I am very disappointed with this TV for two reasons: picture brightness and channel menu. The picture looked dull and not bright at all even compared to my 6-year old Sony LCD TV. This issue was seen on both cable channels and DVD. About the channel menu issue, since I do not own the cable box, I had to use the QCAM to scan channel from the cable line directly. Because of this, I had a lot of unwanted channels that this TV does not allow me to remove from the channel list. Samsung TV does.Because of these two issues, I returned the Sony TV and purchase the Samsung UN40D5500. The picture looks excellent. However, this Samsung TV does not integrated WI-FI.", "Date": "January 6, 2012"}, {"Title": "Excellent Picture, Okay for Internet", "Author": "Mike", "ReviewID": "R2N6I4PQMOC9VR", "Overall": "4.0", "Content": "This is my first HDTV, but I have been around a lot of them, used them, and seen them quite a lot. I'll base my review by different categories and give the pros and cons of each. I have only had this tv for 2 days so far so this will be more or less an out of the box impression.Look and Style of TV and Stand: (5 stars)  Pros  - All black and sleek design looks pretty good  - doesn't feel cheap  - stand rotates  - has a hole in the stand it to screw to the tv stand (optional)  - very thin  Cons  - the stand seems flimsy, if you nudge the tv a bit the tv will shake so the stand doesn't seem to make it very sturdy, nonetheless it seems to hold the tv without too many problemsRemote: just about your average remote with some shortcuts (3 stars)  Cons  - does not have a keyboard or any feature that will easily allow for typing into the internet browser or searching things  in the internet appsPicture Quality (4 stars)  Pros  - picture seemed brilliant ( I don't have HD channels, but I connected my laptop to it and played a Blueray movie in 1080p and it looked amazing)  - I have heard on CNET reviews about how some backlit TVs don't have good black levels, but this TV has some very dark black levels  - screen seemed to be uniform throughout, no patches of brightness or darkness  Cons  - standard videos and channels (320p, 480p) did not look good at all.  - I watched my basic tv channels and they looked stretched and blurry  - only has good picture quality for HD vidoes  - the standard channels seemed to have double visionInternet Apps: ( 2.5 stars)  Pros  - plenty of video and music apps  - has the standard apps like hulu plus, netflix, crackle, youtube, dailymotion and others  - has an internet browser  - some of them do play in hd which looks really good  Cons  - doesn't have an app store, or a way to get more apps  - youtube and crackle are the only free video apps  - all the other video apps require a paid service, or pay per view, or rental service  - there is no standard and free hulu, only hulu plus  - I can't seem to get an option in youtube to play in HD, so I'm guessing they don't have it  - doesn't play youtube movies  - browser is really slow and seemed pointless without a mouse  - the keyboard used to type into the search is similar to a keyboard seen on old phones that have abc on the number 2, def on 3, and so on.  - There doesn't seem to be a point in having Internet TV if it doesn't really have good free apps, a good browser, or an app storeSound (3.5 stars)  Pros  - plenty of customization options for sound  - seemed clear  Cons  - didn't have deep base, although it is expected with a thin displayConnections  Pros  - has 4 HDMI, svga, audio in, component, etc.  - has usb  Cons  - could not figure out how to open up usb files and movies, couldn't find it in the manual  - could not get it to set up with my home networkI hope they come out with a software update for this TV because the internet apps could definitely use an upgrade. They should upgrade the remote to have a qwerty keyboard.", "Date": "December 2, 2011"}, {"Title": "WARNING - \"No Signal\" problem with Sony Bravia", "Author": "C. Bauer", "ReviewID": "R3SQ6623612K2H", "Overall": "1.0", "Content": "I've had my Sony KDL-40EX523 since July 2011. It was purchased directly from Sony (using points) has been handled with the utmost care. But fair warning, Sony Bravia TVs have an issue with the internal chips that cause them to randomly lose the signal. The sounds works, but the screen is a giant grey placeholder with an alert message.  My TV has worked only sporadically for the last month. I have an open case with Sony, but this is out of warranty so I'm out of luck as far as they're concerned. The best they could offer was a contact to a local repair shop. Now, keep in mind that this was a $900 TV (new, not refurbished).", "Date": "September 17, 2013"}, {"Title": "Did anyone beta test the internet streaming???", "Author": "nolongerasonyfan", "ReviewID": "RPLBQ537UUMM3", "Overall": "2.0", "Content": "Picture quality great, picture not affected by sunlight, picture angle great; sound not good without supplimentary speakers; not enough sound and audio inputs and outputs;  Internet streaming is constantly buffering, all except Netflix, Did they even test this TV before putting it on the street?  I'll have to buy a Roku for this TV.  I NEVER get buffering when using Roku!; I saw a great review for this model on CNET, no longer a trusted source; I can change channels for cable and airway channels on the supplied remote, but not satelite?, I will now have three remotes for this TV including Roku!  No longer a Sony fan. :(", "Date": "May 22, 2012"}, {"Title": "good TV, lousy web features", "Author": "Kevin Olson", "ReviewID": "REF1ZGB8HP9U5", "Overall": "3.0", "Content": "A nice quality TV in the usual Sony tradition. Plenty of ports and settings to satisfy most everyone. Easy hookups to audio and satellite sources.However...many people like myself bought it for the internet, Skype and web content which are pathetic. I have both wired and wireless access and Skype is essentially worthless - slow to load, buggy and poor picture quality when it does actually get a connection. Web content is equally bad and the choices are minimal. Get a Roku or Netflix box and avoid the Sony apps at all costs.The \"Econ\" mode and presence sensor are annoying and were immediately turned off.", "Date": "March 11, 2012"}, {"Title": "Awesome", "Author": "Leslie K. Eisenhour", "ReviewID": "RP7MQXF7TPQV8", "Overall": "5.0", "Content": "Got this TV back in August and have had no trouble.  Having the internet ready TV has worked out great.  To bad there isn't a DVD player built in.", "Date": "November 30, 2011"}, {"Title": "An excellent TV", "Author": "Judith Princz \"Publisher\"", "ReviewID": "R1MJWVVHGCUILL", "Overall": "5.0", "Content": "I bought this for my (not very deep) living room. I didn't want a TV to dominate the whole room. I think this is perfect. The picture is excellent, sound is ok (I'm not an audiophile, however.  It's nice looking (yes, I am that shallow). I haven't tried streaming Netflix from the set but everything I have tried works perfectly. Am very happy with the purchase. And buying through Amazon is a dream.", "Date": "September 26, 2011"}, {"Title": "Great TV but tech supprt absolutely required for set up", "Author": "Timmy", "ReviewID": "R2CR2GWRFK53PM", "Overall": "4.0", "Content": "I would have given this TV 5 stars without hesitation, but the setup instructions are not only inadequate, but in several instances simply incorrect. The TV itself is terrific. The picture is great, the colors are vivid and \"true\", and the sound (given the fact that the speakers are only 10W) is very good. Even the instructions were adequate until it came time to set up your wireless connection and to access the internet. Don't waste your time. Call Sony technical support. I had to do so (and then modify my Cisco Lynksys router's key) and then to find my registration code for internet apps because the instructions online and in the set up manual were hopeless.A great product that unnecessarily requires an extra hour (or two) setting up.", "Date": "September 22, 2011"}, {"Title": "Great all around.", "Author": "dewing66", "ReviewID": "RN2CI5J6K2FSL", "Overall": "5.0", "Content": "I finally entered into the 21st century by getting rid of my old CRT and stepping up to this LED TV.  I also purchased a Sony BDP S380 Blue Ray and they both work seamlessly together.  The picture quality is excellent. This is one of the few monitors (if any) of it's size to have both 1080p and 120Hz refresh. The Wi-fi feature is excellent, Sony bundles quite a bit of free (Crackle, Pandora, Slacker, Billibong, Youtube) and fee (Netflix, Hulu, pay per view movies)programming that you can access.  Programming was easy.  It's lightweight and has a very thin profile.  Has many inputs that are easily  accessible.  The only down I can think of is that Sony's mobile app doesn't support this model.", "Date": "September 20, 2011"}, {"Title": "Excellent HDTV", "Author": "Jay", "ReviewID": "R2XUYTYSNZREZ9", "Overall": "5.0", "Content": "PRO -  After looking at Samsung, LG, Vizio sets we chose the Sony 46EX523.  So far it has exceeded our expectations.  It replaces an 8 year old 34\" Sony CRT HDTV. As a film maker I am critical of picture quality, contrast, definition in blacks, and color rendition which are all excellent.  We noticed a lot of reflections in the Samsung sets. With many windows in our family room we were worried about reflections on the flat panel. The Sony's flat panel does a very good job of muting reflections.  The set is easy to set up.  An excellent on screen guide helps one set up the picture, sound and wifi.  The price was more than Vizio and LG but you get what you pay for.CON - Sound quality - the speakers in the thin set put out poor quality sound. That seems to be a problem with all LED/LCD sets. A sound bar is recommended, we have a sound system.Sony needs to work on the registration process, it is very difficult to link the set to the online services Sony provides.  It took over an hour to link our Amazon Prime account to the set.I highly recommend the EX523.  We are looking forward to many years of trouble free viewing. Our old Sony's lasted many years.", "Date": "November 29, 2011"}, {"Title": "Needs better documentation", "Author": "Denise L. Montgomery", "ReviewID": "R1VN2AP1WTFUOX", "Overall": "4.0", "Content": "Love the set. It has a great picture and is easy to use in regards to the TV part of it. But I still can't figure out from the print or online version of the manual how to get the Internet working on this, so I am probably going to have to call in a technical person from Best Buy or someplace. It should not be that complicated. I presume that once I am able to unlock the full power of this set, I will be able to give it five stars, since the fact it has a Netflix button right on the remote made me know this was just the TV I wanted!", "Date": "July 2, 2011"}, {"Title": "sony 40ex523 led wifi built in", "Author": "Vega LCD", "ReviewID": "RJHAANJPM8OMC", "Overall": "4.0", "Content": "sony 40\" ledwith built in wifigood picture qualitywifi built in is very useful for netflix youtubevideo streamingled is thin only 1\"60 hz is ok for a 40\" ledbut sony 's color is good and very neutralgood price for 898.0040\" led with wifi built inwas considering 40ex720 but didn't want to pay for 3d pricingconsidering this 40\" and samsung 40c6300 but samsung is only 3d ready", "Date": "March 26, 2011"}, {"Title": "Sony, need I say more", "Author": "Syndar4", "ReviewID": "R2B2FKQEWD7NRF", "Overall": "4.0", "Content": "Have this mounted above our fireplace on a mantle connected to our surround sound system. Used security cables and attached to brick mortar to prevent any accidents. The HD picture is superb. Sony is great.", "Date": "October 11, 2011"}, {"Title": "Never buying SONY junk again!", "Author": "Brandon Billeisen", "ReviewID": "R23VKXAFCPCKE7", "Overall": "1.0", "Content": "This TV broke less than 2 years after I bought it.  Sony makes junk electronics and I should've know better.  Do yourself a favor, buy a Samsung or LG.  Hell even my old bedroom Vizio has lasted WAY longer than this thing", "Date": "December 11, 2013"}, {"Title": "Problem with screen video in my Sony BRAVIA KDL40EX523 40-Inch 1080p LED HDTV with Integrated WiFi, Black", "Author": "Jose Seijas", "ReviewID": "R2LXVKN62FCTNZ", "Overall": "1.0", "Content": "With less than two years of use I have been presented a problem on my TV screen. Horizontal and vertical stripes with the colors problems. I think these devices should ensure a minimum of trouble to feel satisfied and not in so little time and with good use being damaged. Besides being so expensive compared to the competition. This happens to be true to the brand. I would like a satisfactory answer. Also, I'm in Venezuela and this tv with me. As we do?", "Date": "September 10, 2013"}, {"Title": "Fantastic tv", "Author": "marilyn powers", "ReviewID": "R391AT6B5TZG9B", "Overall": "5.0", "Content": "Love love this slim line great tv perfect size for my family room easy to use and access Internet Netflix etc", "Date": "July 27, 2013"}, {"Title": "Great Deal", "Author": "Kenneth C Entringer", "ReviewID": "R1TTUNDE9YJLSL", "Overall": "5.0", "Content": "great source for parts for my motorhome thanks for the great deal. I will be back again for these parts for sure.", "Date": "April 29, 2013"}, {"Title": "awesome", "Author": "SHANNA L JENKS", "ReviewID": "R3AMGEM0WOU75J", "Overall": "5.0", "Content": "Best purchase in a long time. So happy with this TV, it's so easy to run, I use it nightly in my bedroom and  have not had one problem with it.", "Date": "February 27, 2013"}, {"Title": "beautiful", "Author": "Lima \"vawolf\"", "ReviewID": "R3SPNYA001TJUS", "Overall": "5.0", "Content": "It came quickly and in great condition.  I set it up easily on my own. And I received kudos from my cable installers for a solid purchase.", "Date": "December 20, 2012"}, {"Title": "Good bedroom TV", "Author": "Scott Stoddard", "ReviewID": "RPQN046SGQHM3", "Overall": "4.0", "Content": "I bought this for our bedroom for when we are sick, otherwise it doesn't get turned on.  I was hoping the wi-fi would do a better job of streaming from my home server, but it doesn't.  We hooked up an xbox 360 to it with Tversity installed on a laptop and it served the same purpose.  However, it was more equipment than I wanted to put in the room.  Still a great TV.  Also like the feature that shuts the TV off it doesn't detect motion.  That way, if we fall asleep it shuts off.", "Date": "December 10, 2012"}, {"Title": "Not a loyal customer any more", "Author": "groh", "ReviewID": "R203YF1QX0NW1W", "Overall": "2.0", "Content": "Unit developed a high pitch whine and was replaced with a refurbished unit.  The replacement unit failed within two months.  Waiting for the second replacement unit.  I WAS a dedicated Sony customer.  Their service is handled off shore making communication a bit difficult. :(", "Date": "December 10, 2012"}, {"Title": "Best TV Ever", "Author": "Ari", "ReviewID": "RELB1TSS77QMX", "Overall": "5.0", "Content": "After using this TV for several months I can honestly say it is the best TV I have ever owned. Picture quality and build are superb. My only complaint is that you have to jump through hoops to get to the sleep timer; but I solved this by purchasing Sony RMVLZ620 Universal Remote Control (Black) which has direct access to the sleep function. I highly recommend this TV.", "Date": "October 11, 2012"}, {"Title": "A good tv but won't do Comcast on HDMI.", "Author": "Quiche \"Quiche\"", "ReviewID": "RR1RQ75ZSD9JS", "Overall": "4.0", "Content": "I have owned this television for almost a year and have been extremely happy with it.  I watch cable, Netflix, Hulu Plus, YouTube videos and computer movie files on it.  What I like best are the many ports - 4 hdmi, 1 component, 1 composite and 1 USB.  Also you can change the display and sound settings on each port.  The sound is good and strong.  The picture is beautiful.There have been a couple of problems.  I have Comcast digital cable and it will not work with an HDMI connection because of a conflict with Comcast's DHCP.  So, I have the cable connected to the component port and it does have a nice HD picture.Once in a while lately, the tv turns itself off.  I don't know what this problem is, but 95% of the time it does not do this.  So I leave well enough alone.  Maybe I have an incorrect setting.You can connect a USB external hard drive or flash drive to the USB port, and it will play movies, but not .avi files.  Also you can play movies from your computer thru the DLNA, if you have it enabled on your computer.  But again, you can't play .avi files.", "Date": "September 10, 2012"}, {"Title": "Amazing TV", "Author": "M. Ebels", "ReviewID": "R3DYQ9TD9C5C12", "Overall": "5.0", "Content": "The TV in my office finally died so the time came to get a new one.  I researched several products and landed on this Sony and boy am I glad I did. From the moment I took it out of the Box I  was both surprised and impressed.  The stand it came with has a swivel base and the form factor was even thinner than I expected. Then I turned it on...  The picture is clear and sharp. The sound is clear as well. It is WiFi enabled which was a must have for me but boy did I under estimate what I was getting with that. Let's just say there is a dedicated button on the remote for accessing Netflix, how cool is that.  I just do not have enough time to list all of the amazing features in this review. But the numbers of options available in the on-line area of the Tv are numerous and extremely useful!  In summary, this is fantastic TV and was one of my best electronics purchases to date!", "Date": "August 15, 2012"}, {"Title": "It's a Gem!", "Author": "Tova Hamilton", "ReviewID": "R25TX8SYON1AOZ", "Overall": "4.0", "Content": "This is an excellent television. It is perfect for the social media fanatic and even more so for movie lovers. Sony is the greatest!!!", "Date": "May 25, 2012"}, {"Title": "Works as advertised", "Author": "Dave in Branford", "ReviewID": "R3SE7V64FTUOPR", "Overall": "4.0", "Content": "This Sony KDL46ex523 46 inch TV works as advertised. The Internet hookup works fine once I figured out the intermittent signal interruptions were from my router system. I wired directly from my router with an ethernet cable to operate without interruption. I've had the Sony for 3 months.Be careful reading the reviews here--many were for other TVs, not the 46-inch ex523.Generally the great colors and overall motion of images are great.The TV had a hard time keeping up with the \"blackness\" when watching \"How the Universe Works.\" The background was sometimes dark gray and I could see the pixels changed a lot whenever there was almost total black background. But I'm not sure any LED TV can keep up with that much change in black background.Once I figured out the menu system using the remote, I found all the settings and \"fine tuned\" for the type of programming I wanted.I've never owned an HDTV before and most of my friends TVs are much smaller than the 46-inch, so I can't compare this TV to others.", "Date": "March 3, 2012"}, {"Title": "This 40\" Smart TV is Perfect for ME", "Author": "J. Lucas", "ReviewID": "R3T37ZE4XEJN9P", "Overall": "5.0", "Content": "I have only had the 40EX523 for a day but have worked a few hours setting up and testing.I got is on Amazon Warehouse as used, but it seems brand new. There is no indication that it was really a used set...perfect condition. The price on Amazon Warehouse was also the lowest price by $100 on the internet, from what I found.This is what works perfect in my tests:1. Picture and audio quality is as good or better than any flat screen I have ever seen2. Built-in wireless was setup and working in a couple minutes3. Streamed Netflix and Amazon On Demand in HD quality as good as my HD cable service4. Most of the applications worked after you logged in or enter codes except the WWW Internet Browser* The browser goes to a Sony internet site and that seems to be it5. The Facebook and other Widgets work well, but it took me a few minutes to figure out that you have to use Yahoo Connected TV Store to browse and add new widgets. As of this writing, there are 137 applications/widgets in the store, most of which are free. There are even more applications in the Internet Content menu.ISSUES:1. Make sure that the first thing you do is go to the Product Support page and install the firmware update first. Then go to the Network Page and Refresh Internet Content. This will get your widgets working right.2. It is a very complex TV with a lot of setting. Navigation is no picnic, and the one major issue was the wrong info from Sony ESupport, Sony support desk, and the i-Manual. I am thinking that the software has changed a bit and they have renamed menu items and even moved them. The support desk script was even wrong and I had to figure out myself how to add widgets.", "Date": "February 21, 2012"}, {"Title": "Overall a great TV", "Author": "Michael D. Powers", "ReviewID": "R3GL6Z5WB2MCW0", "Overall": "4.0", "Content": "Great feature set, picture quality is excellent, even on a standard definition input.  Watching broadcast/cable channels is a pleasure, as is streamed shows from Amazon (have not tried Netflix or Hulu).  ONLY thing I have seen (so far) that I have not liked is trying to use the \"web browser\" feature ... that is essentially unusable, as it is extremely slow, and it is almost impossible to select options within a web page; trying to watch a show on a network website just does not work.  Other than that one gripe, I would definitely recommend this unit.", "Date": "February 1, 2012"}, {"Title": "Sony Bravia", "Author": "L. Barney", "ReviewID": "R3GLQKYLVK8MYE", "Overall": "5.0", "Content": "This TV is awesome. I highly recommend it! The features are outstanding, the HD picture is crystal clear, and the surround sound makes you feel like you're at the stadium. Five stars.", "Date": "January 22, 2012"}, {"Title": "Great Things often Come in Small Packages", "Author": "Joseph Davis", "ReviewID": "R3GS8U1DDK7761", "Overall": "5.0", "Content": "At a mere 32\", the razor-thin Sony Bravia KDL32EX523 comes with integrated WiFi & produces a video quality that can only be found with, well, Sony LED LCDs. Though prices have dropped sharply for larger screen TVs, sometimes 32\" is the size that best fits one's needs. Sony was one of only two or three manufacturers I found that provided integrated WiFi at such a petit size. Great product, great price. Thank you Amazon!", "Date": "January 10, 2012"}, {"Title": "Jeanne in Reno", "Author": "Jeanne in Reno", "ReviewID": "R21GAUKHDSZ1IM", "Overall": "4.0", "Content": "I'm very pleased with the picture quality of my new Sony Bravia 32-Inch HDTV.  It replaced my older model 27-Inch Sony and fit perfectily in my 20-year old Ethan Allen entertainment wall unit with concealing doors.  I'm a little disappointed with the audio quality as compared with my other Sony products.  But overall, it is the solution for those of us who have investments in the overall look of a family room without making the TV a focal point.  It is also perfect for a guest room TV.", "Date": "January 3, 2012"}, {"Title": "wifi free", "Author": "LINDA", "ReviewID": "R2RN6NZDNIDEHF", "Overall": "5.0", "Content": "just love my new tv -- can't wait to sit in the bed without using the laptop and going online on tv", "Date": "October 30, 2011"}, {"Title": "Good TV with severe monopolistic features", "Author": "MARK D GALPERIN", "ReviewID": "R33Q8LCJ2MEPK3", "Overall": "3.0", "Content": "A good Sony TV, but their extra USB mic and webcam have to be by Sony only. Others - don't work. Also, it can't be used as additional Wi-Fi display for your PC without acquiring additional equipment.", "Date": "August 9, 2011"}, {"Title": "Major disappointment, poor customer support", "Author": "J. Lewis", "ReviewID": "R22P7TUZNF6S23", "Overall": "2.0", "Content": "If you are buying this Sony only for its over the air or cable signal, it is probably a good buy. If you are interested in the Internet apps, look elsewhere.*This set has no app for Internet Radio streaming. The advertised NPR app accesses a number of podcasts from NPR stations, but no streaming.*The Yahoo widgets, which Sony customer support insisted in an email to me \"are not supported\" (!), work sporadically.*To access the 5ghz channel on an N router, one must purchase a proprietary Sony device, a UWA-BR100. Prior to purchasing this router, Sony support told me by phone this adapter was NOT required for this set.In short, this set's Internet applications are extremely weak, and customer support has such inadequate information about this product that the information they give is wrong.To get access to decent, stable apps, one must purchase an add-on appliance, such as the Apple TV or Rokio, which means you're throwing your money away to buy the extra features in what is misleadingly labeled an \"Internet TV.\" (Netflex does work.)I am very disappointed and would advise others to look around at more mature products.", "Date": "December 5, 2011"}, {"Title": "Fabulous LCD Television", "Author": "Frederic C. Towers", "ReviewID": "R1K9QXM54VTOMS", "Overall": "5.0", "Content": "This is the best TV I have owned so far.  Very thin, four HDMI inputs, wireless-n networking, gorgeous picture, very light.  Outstanding!", "Date": "July 24, 2011"}, {"Title": "I can set the sleep timer with my old Sony remote.", "Author": "L. Musante", "ReviewID": "R21RTJ4GOEE5O0", "Overall": "5.0", "Content": "I put off buying an HDTV for my bedroom because they all seem to require stepping through menu options to activate the sleep timer.  I clung to my old 13\" Sony TV because I could set the timer by feel in the dark.Then I had an idea! I brought my old Sony remote to Best Buy and, lo and behold, the sleep timer worked with all the new Sony HDTVs in the showroom.I now own the Sony BRAVIA KDL32EX523 and I love it. I use my old Sony TV remote to toggle the sleep timer and my cable remote for other functions. (Any old Sony remote seems to work.) Also, just like my old TV, the BRAVIA has an indicator light on the TV so you can easily tell the timer is set.", "Date": "February 9, 2012"}, {"Title": "Love this tv", "Author": "Anne Parson", "ReviewID": "R2BLUD5CNSSTH", "Overall": "5.0", "Content": "Negatives:-The main remote controls are too close together and quite easily when you are trying to click to scroll through screens, you can very easily push home or back to the previous screen.  More of an annoyance then a dealbreaker.-limited component inputs.  We have an older xbox and a slingbox.  I had to order a component to HDMI cable converter to be able to use it with this tv.  Checked around though and was told that only the larger newer tv's have more component connections.-Sound is fine for me, but I have never been big on whether or not I have surround sound.  Just bought the 32\" sony sound-bar though for about $210, since my husband is.Love:-the screen is beautiful-it is lighter then the much smaller LCD flat screen tv it replaced-love the wi-fi and connection to our computer.  I have Amazon prime and it is nice to watch the free tv shows, as well as watching all of the digital content I had previously purchased on Amazon.  I have TIVO's and you have to go to your computer to download your shows to your tivo.  With this computer, you pick the show you want to watch right off the tv, no need to go to your computer and tell it to download.  Very cool.  It also lets you watch netflix and other programs, but since I already had TIVO, this wasn't a big deal.the 30 day return policy Amazon has.  It allowed me to take the risk and purchase this sight unseen.  Even after comparing against other tv's after receiving this one, I am keeping it since it is awesome.", "Date": "December 12, 2011"}, {"Title": "It is hard to go wrong with a Sony", "Author": "sbeumer", "ReviewID": "R17ZJ6S4CRGTUJ", "Overall": "5.0", "Content": "I guess I have been a Sony fan ever since the Sony Trinitron back in the late seventies. This is my second Sony 46\" Bravia, I had the first one for four years and paid $2,400 for it. That TV had always been awesome until a lighening strike got the best of it. I did actually look at other TV's and seriously considered 3-D or Plasma TV's, but there are just too many \"if's\" out there; direct sunlight on your plasma can make life difficult, and I really do not like the idea of wearing Elvis Costello glasses all of the time. So I went back to what I already know and it has been great. It is a WI FI Smart TV and the picture quality is considerably better than my orginal one at nearly 1/3 the cost.", "Date": "November 7, 2011"}, {"Title": "TV sony wonderful", "Author": "michael", "ReviewID": "R3FZTLBDXOSPEF", "Overall": "5.0", "Content": "I have bought this TV  used like new and I didn't notes any different with new one, Arrived in perfect shape no scratch and really for my is new brand just a good price, was delivered in few days and all my Family are happy with this TV. Only one thing is if we want to use caption to see some movies from neflex is not able to do that but local Tv show is able caption.", "Date": "August 24, 2011"}, {"Title": "SPEAKERS/MOTHER BOARD HAD TO BE REPLACED AFTER A YEAR", "Author": "C. Haslam", "ReviewID": "R3G67ZNCCTAUFJ", "Overall": "3.0", "Content": "I usually dont review the products I buy, but b/cause this is an expensive one, I decided to write.We purchased this 46inch tv 1 year ago... Approx. 9 mths after, we noticed the sound began to develop problems. On occasion we'd notice a crackly/distortion. then it would stop. We just figured it was the tv station or cable. When it began to happen more often, we new there was a problem.Thank God we purchased the extended warranty.The mother board and speakers had to be replaced. They were replaced w/refurbished parts, so we figure we have about another 9mths b/fore it happens again and our extended warranty runs out!Sony's products used to be in my opinion the best (for a reasonable amount of money), however lately everything sony we've purchased has been horrible.In today's economy everyone is cutting corners @ the expense of the consumer!In my opinion it's probably best to just buy a cheap tv., as you'll probably get about the same life out of it as the expensive ones!The picture quality, in my opinion is great and thus far there have been no problems.", "Date": "December 16, 2011"}, {"Title": "Very pleased", "Author": "Westsider", "ReviewID": "R2X7NRZN2PAFFK", "Overall": "5.0", "Content": "We are very happy with our Sony Bravia.  The picture is beautiful, especially when we watch an HD show. It's been great to use the internet to download movies and TV shows.  We don't want to pay for cable, so we're very happy with this feature.  We find Sony to be extremely reliable.", "Date": "June 25, 2011"}, {"Title": "Sony Bravia", "Author": "Ronald Ellison", "ReviewID": "R2VMDEE61YB0KQ", "Overall": "5.0", "Content": "I've only had this TV for a few days, but so far it is great.  The picture is excellent.  I have not used the wi-fi features yet.", "Date": "January 24, 2012"}, {"Title": "Does not support Skype online number calls", "Author": "Elias_A", "ReviewID": "R30J2P4ZL4FU2H", "Overall": "2.0", "Content": "I bought a Sony Bravia because of its Facebook and Skype support.  Unfortunately the Skype application in the Sony Bravia does not support Skype online number calls. Sony technical support doesn't know when they will solve this issue.  So if you are serious about using Skype, do not buy this product.", "Date": "December 22, 2011"}, {"Title": "New LED TV", "Author": "David Stewart", "ReviewID": "R7FYIY87F9CKS", "Overall": "4.0", "Content": "I just received the new Sony LED 46\" Flat Screen and I am really happy with the over all product the only draw back was no audio out connection, really did matter as I had just ordered the Sony 3D 150 watt surround sound system and will arrive tomorrow from what I have read about the product they are both compatible with each other can hardly wait to try them both out together. Th tv is outstanding in all aspects of operation it took about 5 minutes to set up and the wi-fi worked perfectely.", "Date": "June 15, 2011"}, {"Title": "Broken: Vertical Lines", "Author": "Zoagria", "ReviewID": "R1XSR6365TS4TL", "Overall": "1.0", "Content": "The TV worked great for the first four months, but now it has red and green vertical lines that won't go away, over every channel and all on screen displays.  It destroys the viewing experience and looking online it appears to be the result of a manufacturing defect.  Amazon won't accept a return after the first month, so now we're stuck with an $1100 broken TV.", "Date": "December 8, 2011"}, {"Title": "DO NOT BUY!", "Author": "gus@spiritone.com", "ReviewID": "RHAMUFOPOTQ1P", "Overall": "1.0", "Content": "DO NOT BUY! this  SONY Bravia 'Smart' TV ... it is a piece of JUNK!  I have never had to return a purchase before but this time ...I did the very next day!  The paper Manual and (built in) iManual are crap, the Yahoo! widgets do not work , the wireless connectivity is 802.11b ...which is TOO SLOW to stream HD video ...:  This is supposed to be an HD  TV right?  Oh, also my TV started emitting a Very High Pitched Scream ...which in my bedroom  is NOT a good thing!  The software and apps built into this TV are difficult to use and setup ('difficult' is being generous because I usuallly like the design and attention to detail of Sony products). This piece of Junk costs $650  although that won't  last very long ... I notice Amazon  has a ton of these 'used' for sale for $500 ... DO NOT BUY!", "Date": "January 10, 2012"}, {"Title": "great tv", "Author": "product", "ReviewID": "R3DVDN6GPOB3UG", "Overall": "5.0", "Content": "Tv quality is great, has an power safe option.Slim and very attractive, look very good in my new apartment.", "Date": "June 23, 2011"}, {"Title": "Almost perfect but with a few flaws", "Author": "J. Laricheva \"book worm\"", "ReviewID": "R2D5RJX1AZFKNC", "Overall": "2.0", "Content": "The main reason I bought a Bravia tv was to play video (.mov) files I shoot on my canon for work. The tv claims to be able to read video off a usb card. Turns out it does play movies off a usb... but only when you convert them first to an mpeg1 or an mpeg2 format. This takes a while and I find it to be misleading advertising since I'd assume that I can play anything off a usb directly with out conversion (which takes a while). That is a huge draw back for me as a video/design professional. I'm happy with the resolution though, although there is a thin black bar on top of the screen when ever it plays Netflix that no one (judging from other reviews) can get rid of either. Some of the films are pixelated and of course most content off youtube is pixelated as well (but thats not Bravias fault). The navigation/menus through out the applications is a bit clunky. It's very difficult to surf the web on it unless one has a keyboard. It does skype but I need to buy another camera for it that's another 100 bucks. I really wish I purchased a samsung since their tvs can play ANYTHING off of a usb stick and... even a memory stick off the computer.  I think it's a misleading claim to say that they can play movies off of a USB. Disappointed. Might ebay it and buy a samsung instead.", "Date": "July 10, 2011"}, {"Title": "Beware The Hidden Refresh Rate - Only 60hz", "Author": "DanDaMan \"Best Shopper\"", "ReviewID": "R364ZOJY7Z7M2F", "Overall": "2.0", "Content": "I don't own this TV but I've been considering it. Going thru the listed specs I noticed the refresh was AWOL. Had an online chat with a Sony rep and was informed it's 60Hz. Can't blame them for trying to hide it. One should expect at least 120Hz in a premium LED TV in 2011.", "Date": "March 19, 2011"}, {"Title": "Great TV-Bad \"free\" delivery", "Author": "Chasjr", "ReviewID": "R20YZTUUASVEBP", "Overall": "5.0", "Content": "This is a great TV.  The problem we had was with the delivery.  Of course we accepted the free delivery offer from Amazon.  Had we known how it would turn out we would have happily paid to have a more convenient delivery.  The TV was shipped to some place about 100 miles south of where we live.  Delivery was promised to us on June 9th.  The company that received the TV and was supposed to call us and arrange delivery.  They did call us on June 3rd and left a message which consisted of 10 minutes of canned music followed by the message to call them and arrange delivery.  Of course when we heard 2 minutes of the 10 minutes of canned music when we played back our messages we like most folks just ignored it and went on to the next message.  On June 5th we checked online to see the status of the delivery.  It said a message was left and that they were expecting some sort of action from us.  It occurred to us then that perhaps that music message was the message we didn't receive.  So we listened to all 10 minutes of the canned music and sure enough at the end of it they left a phone number to call but of course they left it so fast we couldn't get it all so we got the pleasure of listening to 10 more minutes of canned music in order to confirm the phone number to call.  What a delight.  Since they were not open on Sunday we called them early on June 6th.  We were told that the earliest they could deliver the TV was June 16th, a week later than promised by Amazon.  They offered us the option of driving 4 hours round trip to pick it up but we realized that that would cost us about as much in gas as paying for delivery in the first place.  At last on the 16th more than an hour late the TV was delivered.  The delivery guys were very nice and even helped me set up the TV.  We are patient people and in the end we were very happy with our purchase.  Our only thought is that Amazon should change their name of \"free delivery\" to\"free ANNOYING delivery\".", "Date": "June 30, 2011"}, {"Title": "Excelente TV", "Author": "Lindaeva", "ReviewID": "R3MXGP5M794W2U", "Overall": "5.0", "Content": "Me encanta este Televisor, la imagen es muy nítida, la conexión inalámbrica me permite conectarme a youtube y visualizar los videos con rapidez.El manual que muestra el TV es muy amigable, las funciones son fáciles de utilizar. Lo único que pude apreciar es que si quiero conectarme a una pagina web las letras salen muy pequeñas, de resto todo bien. lo recomiendo.", "Date": "August 8, 2011"}, {"Title": "Avoid like the plague!!!", "Author": "D. A. Farkas \"Dan Farkas\"", "ReviewID": "R1FAA6Z1QDV5OK", "Overall": "2.0", "Content": "Sony is not what it used to be. Tried out some tv's before I finally settle for a 42\" panasonic PLASMA for the same price.You can't beat that. Really. You can't compare these lcd/led tv's to plasma.Tried a Vizio tv before this that also had the internet apps. Much better color, sound, internet connection,... much better tv overall.This sony tv is really dark, makes a noise when it's off and has really bad wireless connection. I really can't believe they're selling it for this price when the vizio tv is ovbiously much better and cheaper.But if you're willing to spend a bit more a panasonic plasma is the way to go!", "Date": "July 8, 2011"}, {"Title": "SONY IS NOT NUMBER ONE IN MY BOOK ANYMORE", "Author": "Leroy", "ReviewID": "R3IZQV58G6QC99", "Overall": "2.0", "Content": "SONY IS NOT NUMBER ONE IN MY BOOK ANYMORE, I RETURNED THIS SET THANKS TO AMAZON BEING NUMBER ONE IN RETAILING, GOOD PRICES, GOOD SERVICE, CUSTOMER SERVICE, WHAT MORE CAN I SAY.", "Date": "November 11, 2011"}], "ProductInfo": {"Price": "$999.00", "Features": "It has 46-inch display with full HD (1080p) picture quality (1920 x 1080 native panel resolution)\nLED backlighting for incredible contrast, slim design, and energy efficiency\nSony's X-Reality Engine sharpens images for a clear, vivid, life-like picture\nWireless Internet TV for wide variety of streaming media and other Internet content\nPower-saving motion sensors", "Name": "Sony BRAVIA KDL46EX523 46-Inch Integrated WiFi 1080p LED HDTV, Black (2011 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/41pDEtRW9QL._SX300_.jpg", "ProductID": "B004HYG9VO"}}