{"Reviews": [{"Title": "Excellent TV", "Author": "Otter425", "ReviewID": "R3IZTA2YS8BAGY", "Overall": "5.0", "Content": "Purchase Experience: fine, smooth and painless as always.Product Comments:Size: fantastic - super thin, and light, which enables keeping shoved toward the back of its surface to keep the kids' fingers away from the screen.Picture: Excellent, very crisp (using HDMI cable).  Easy enough to modify settings to get the right picture for your lighting conditions.  My set is in a naturally-lit room and I have had no problem with the picture or colors as a result of the bright sunlight.Sound: fine.  If you just want to watch TV/movies, the built-in speakers are fine.  They won't make you go ga-ga, but if that's what you want, you'll already have (or soon hereafter acquire) a speaker system.Heat: Here's a really trick of the LED backlighting - it produces surprisingly little heat compared to a more traditional LCD.  Most LCDs generate a fair amount of heat, but the LED LCD doesn't generate nearly as much.Dust: For whatever reason, the bevel seems to attract more dust than other LCDs in the house (TV and computer screens).  Dust doesn't collect so much on the screen as around it - odd, but easily dealt with and doesn't affect the picture.Bottom Line: Great TV, especially for the price.", "Date": "May 22, 2011"}, {"Title": "Average Tv with less than average sound", "Author": "Big C", "ReviewID": "R2TYEX9N86N49Y", "Overall": "3.0", "Content": "This Tv is a mixed bag of good and bad. First the good. It has a nice picture. The picture has LED lighting and 1080p quality, which gives it a clear picture. It has has SRS TruSurround HD and SRS TruVolume, which would make external speakers sound great. The design is simple and clean. It doesn't get hot, like other TVs I own. The remote it small and comfortable in your hands and it has dvd buttons for compatible players.Now the bad. The sound is absolutely terrible. The Tv can get loud without distortion, but the speakers are on the back of the unit and the quality is bad to begin with. Furthermore, it would not be a good idea to mount this TV to the wall unless you plan to buy external speakers. Problem two, getting external speakers. Vizio's current sound bar is 39 inches long, as are most sound bars. So if you mount this 26\" Tv with the the 39\" sound bar, it looks disproportionately awkward. And if you invest in a home theater system, it is unlikely your going to buy a 26 inch TV. Third, when you turn the Tv on and change channels, the screen turns blue for 1.5 seconds. This is normal for this TV. I don't know why, but this blue screen irritates me for some reason. Finally, although the remote is comfortable to handle, it seems really cheap.My final thoughts, if you need a tv for kids or teenager 14 years or younger, this is a reasonable choice for the price. The picture will be great with a gaming system. For older teenagers and adults, I have to say to pass on it. Look at another 26 inch TV or invest another 50 dollars and get a nicer TV with decent sound.Update:After watching several movies and baseball games on this TV, I decided that I needed to get a sound bar because the sound quality is so bad. Vizio offers two soundbars, the VSB200 and the VSB205. I picked up the VSB205 because Vizio lists it as compatible and was the smaller of the two at 32 inches. I get it home and quickly figure out that it is not compatible. This Tv uses an optical audio out for Tv viewing. Both the sound bars offered by Vizio do no have an opitical audio input. When I called customer service, the gentlemen was surpirsed that these sound bars did not have optical audio inputs becuase most of Vizio's newer TVs offer an optical audio out, which has superior sound quality. He also admitted that it was an error that the sound bar was listed as being compatible. They still have not fixed this error on their website. If you decide to get external speakers, it will likely be a more expensive set up, which doesn't make sense for a 26 inch Tv. I returned both the TV and sound bar.", "Date": "June 28, 2011"}, {"Title": "About as expected", "Author": "Brogan Else", "ReviewID": "R3OK8D45K5AH4B", "Overall": "3.0", "Content": "I got pretty much what I expected with this tv.  I was just getting something to put in the bedroom to replace our old hunk o' junk tube tv.  The sound is horrible, but the picture is pretty good.  The one other thing that sucks is if there's a way to adjust the angle of the tv on the included stand, I can't find it.  It sorta leans back, so if you have it on a surface that is taller, the screen darkens because of the angle.  It kinda makes for watching as you're laying in bed a bit of a strain.  Outside of those things, it seems to be a decent little tv.  Especially for the price.", "Date": "April 27, 2011"}, {"Title": "VIZIO 26\" LED LCD HDTV", "Author": "LES NO LESS", "ReviewID": "R1TGCTZ1SDQSKJ", "Overall": "5.0", "Content": "I purchased this flat screen HDTV, 3 months ago for my parents, who reside in an Assisted Living facility. I find the picture and the sound (in spite of other reviews) are very acceptable. My parents, who initially were not interested in having a TV in their room, changed their opinion after this unit was set up for them. It is easy, simple and uncomplicated to operate the remote control, which says a lot for older folks, dealing with dementia. To say I am happy with the purchase is an understatement.", "Date": "July 16, 2011"}, {"Title": "It's ok as an extra tv - nice clarity", "Author": "BJL411", "ReviewID": "RJPTJMJRMWRYQ", "Overall": "4.0", "Content": "I have a nice tv in the family room with excellent quality for watching movies and football and such..  this tv is fine.. it isn't the best mms rate.. when you press pause (on my tivo) the pic is somewhat blurred, but watching the picture in hd is good quality as you'd expect, and it's less quality in digital.  (once you go HD it's hard to go back)..as for the comment about aspect ration from another person.. there is a setting that is standard on most tv's.. it allows for regular tv viewing (like our old crt tv's that were square), it has wide screen and it has what is called panaromic.. this feature keeps the center normal but stretches the pic to reach the edges.. these settings are normal for all tv's from what I see.  When you are using HD on tv's in general, you don't use these features.  But the tv does have the ability to change the pic size in these 3 settings..  The remote has a variety of ways to access it.. at the top of the remote is a criss-cross bar.. click the center of it and it will display all the settings you can adjust. just click the \"wide screen\" feature and from there you can change the size of the screen you are viewing (again this is for viewing in NON-HD format).For the price this is a great tv for the ofc or the bedroom..", "Date": "April 26, 2011"}, {"Title": "GREAT FEATURES~~~ TERRIBLE RELIABILITY", "Author": "Kerry", "ReviewID": "R3R2TS747KWLJ3", "Overall": "1.0", "Content": "This is our 3rd and LAST Vizio purchase. We bought a 32\" Vizio several years ago and the picture went out after 9 months. We called the Vizio service department and although they were very friendly, they were never able to correct the problem. \"Service was backed up\". \"They should have called.\" All excuses...no repairs.We threw it away and purchased another 32\" thinking it was just \"one of those things\". The picture & sound quality on Vizios are excellent. This TV has been in daily service and performing perfectly for well over 3 years.When our bedroom 26\" TV failed, we purchased a 26\" Vizio. Problems from the start. It would randomly drop pre-programmed channels. We'd re-program and then a week later it would drop more channels. Service again was friendly but never heard of the problem and offered no resolution. After 4 months the picture went out completely. The tuner must have failed because it now would not program any channels.Why did we continue to purchase Vizio TVs? Great Picture, Great Price but Never again. If you've wondered why so many \"Factory Refurbished\" Vizios are for sale it's because the reliability is terrible. They simply don't last and the support never comes through with a solid resolution....just lots of talk..Save aggravation and buy elsewhere.", "Date": "August 8, 2011"}, {"Title": "Good Value, has Quirks", "Author": "RateMoreOptions", "ReviewID": "R5ZUGE5GUNFHR", "Overall": "3.0", "Content": "Pros:- Thin.- Good picture, decent value.Cons:- Built in speakers have little bass (typical for tv speakers) and the audio out to auxillary speakers is less than half what it should be.  External speakers had to be wired up directly to the dvd (instead of thru tv) in order to get decent bass for movies.- Has frozen up a couple times, and had to turn on and off for buttons to become responsive again.- No mp3 player, only picture viewer.- No menu button on remote, have to press button on TV.Overall not a bad tv for the money.UPDATE: Feedback from comments, \"the 'menu' button on the remote is accessed by pressing and holding the OK in the center of the 'plus key.'\"", "Date": "May 12, 2011"}, {"Title": "Vizio E260MV is surprisingly good", "Author": "DRG", "ReviewID": "RHOFN3W4RZ0DP", "Overall": "4.0", "Content": "I recently purchased this model. The TV is stylish. It's a lightweight TV. It offers a decent amount of connecting features. It's wall mountable.I think the picture quality is great. The sound is okay. I am one who believes in sound systems. Almost any receiver and a pair of speakers and sub woofer would enhances the TV's sound.The remote is lacking. It's a basic remote. Batteries are included for the remote. The TV comes with a detailed user manual which is very handy with instructions that are easy to understand.", "Date": "June 17, 2011"}, {"Title": "Yeah, Yeah... bad sound....", "Author": "James Burrell", "ReviewID": "R2E4S3DX1VM33I", "Overall": "5.0", "Content": "Here's the deal. If you're expecting a slim 26\" LED television to have perfect sound, you're looking for the wrong thing. The picture quality of product is top notch. It also has a very slim lightweight design. This television is perfect for a bedroom or any type of gaming. The only downside to it in my opinion is the slight backward lean on it's stand, yet with the design of the base of the television and the fact that it thins as it rises, the lean is hardly noticeable. It's an amazing deal; just pair it with a small surround sound set and your bedroom entertainment will come to life.", "Date": "September 13, 2011"}, {"Title": "OK image, LOUSY sound", "Author": "Redneck", "ReviewID": "R3VBWJZ79TEPC9", "Overall": "2.0", "Content": "While the image quality is acceptable, the sound is, well, like having a tin can held up to your ear and another tin can on the other end of a taunt string pushed up against the speaker of a good TV.  If you purchase this TV, you will HAVE to purchase a seperate sound system to go with it, so figure the sound system into the cost!  The TV's internal sound is very flat with no base and no treble, but lots of distortion.  I've heard HAM radio sound better; this is the worst sound I have ever heard out of any TV I've ever owned (including those my family had in the 1960s).  The menu system is also lacking.  After having this TV for one day, I'm packing it back up and returning it.  It's garbage.", "Date": "November 25, 2011"}, {"Title": "sound poor", "Author": "geeker", "ReviewID": "R33F9NW2DSX9JA", "Overall": "3.0", "Content": "Other than sound the TV is great; the speakers sound very tinny.  I'll try to hook up to larger remote speakers.  I bought this TV mostly because the size fit under the kitchen cabinets.", "Date": "September 5, 2011"}, {"Title": "picture's fine..audio is terrible..", "Author": "Norvik \"Reading Teacher\"", "ReviewID": "R2ZXQM1BTTXY7F", "Overall": "2.0", "Content": "Attractive design and easy to install.  Turned it on, and picture was O.K...THEN the sound came on.  The audio sounded like it was coming from a cheap plastic radio. Reeeally bad.", "Date": "August 15, 2011"}, {"Title": "Good for 1080p alt Video monitor", "Author": "texlib08", "ReviewID": "R1EPB3JHY26CPY", "Overall": "5.0", "Content": "This was for a 1080p HD video monitor for my new core i5 rig.  Mounting with the wall mount amazon recommends is easy and everything came together fine. The picture looks amazing with true HD content. You cant get a true 1080p rig elsewhere in a smallish size for this kind of money. Its only monster-living-room-sized beasts. The sound is unimpressive, but you will want to output your sound to a 5.1 system via your soundcard anyway. The screen , in conjunction with the tilt bracket is adjustable and is not catching reflections.  I can use it in full light just fine. But all the much better with the lights dimmed. When used as a TV, viewing standard channel definition,(itself with letter-boxed widescreen content) it does not zoom the image, you can only stretch it. You get a black frame all the way around it.  That sucks. But as a video output for a PC, its rock solid.I had this problem with Video Tearing. Thats when your video looks like its torn in half along the middle horizontal and inexpertly put back together with stickytape. It was not the TV at all. It was the Video Decoder on my ZOOM PLAYER 8 (free).  Try switching to an alternate decoder under options.  There will be a choice that works. So using it to play mp4, mkv, and avi files, you can get a variety of content, some good, some bad.  I would say this TV does better than most when your video resolution/bitrate is less that perfect. Some rigs exaggerate the pixelization and posterization that you get with highly compressed content. Using the same source data, this TV seems to smooth out the rough edges and make them less noticeable. but then POW, True HD content at modern specs will blow you away.", "Date": "July 15, 2011"}, {"Title": "Good little TV", "Author": "Isaac K.", "ReviewID": "RZ8XQ5HZBM3RK", "Overall": "4.0", "Content": "I just got this TV and it has been solid and served its purpose, while having a few drawbacks.PROS -- Good 1080p picture with ability to customize different settings- Really good looking - sleek design, no external buttons (they are touch sensitive, so they are flat and only light up after you touch the frame)- 2 HMDI inputs, plus all the others you would expect to find- Works really well with the HDMI out my MacBook Pro, which is what I will use it for most (as a computer monitor)- Easiest setup I have seen for an HDTV - 5 minutes from opening the box it was ready to go- Very light for an HDTVCONS -- The flat, on frame buttons are a little hard to press, so it kind of pushes the frame around when you use them- I'll agree with other reviewers that the sound is tinny (even compared to my MacBookPro), but it can get pretty loud. You can easily plug in external speakers through 1/8th inch headphone jack or the optical audio out. If you aren't an audiophile and just want to be able to hear the tv, it'll be just fine without external speakers.- The remote is a little awkward when navigating the menu, but after a little use it gets more intuitive- The base is an arch, so it doesn't sit flat across the whole bottom. I was planning on placing the TV on a little stand with the front and back sticking off each side about an inch, but this won't work because the base doesn't sit flat. I just put it right on the desk instead, and it's very sturdy this way.", "Date": "September 19, 2011"}, {"Title": "Perfect Dorm Room TV", "Author": "Jonathan Zator", "ReviewID": "R23170CSJ1C77U", "Overall": "5.0", "Content": "Overall I am absolutely thrilled with this TV. The picture quality is astounding and it was really easy to set up. Since this is an LED TV it is super thin and light which makes it perfect for my dorm room. The sound is quite excellent for being built into the TV (by comparison the TV I replaced this with sounded more \"tinny\"). My only issue with the TV is the stand that it comes with since it does not let you adjust the vertical angle or rotate it (you just have to pick it up which is easy enough). This is an excellent TV that is the perfect size for a dorm room, bedroom, or small living room.", "Date": "September 19, 2011"}, {"Title": "Your happiness depends on your experience", "Author": "smuckj", "ReviewID": "R35UM6XZD8WOYH", "Overall": "3.0", "Content": "If you are used to a Sony or any other high-priced, top-of-the-line TV, you may be disappointed. If you've never had a LCD tv before, like me, you will definitely be happy with it. The picture quality is good when connected to HD. It also works great to connect to a computer through HDMI cable for video watching. It is a great size for a dorm room. Works well to play video games on.I was disappointed by the speakers. They sound a little tinny, like other reviews have said. But speaking is easily understandable and music sounds ok. It just isn't the most pleasant sounding. Also, the volume is set too high. Just turning sound to 1 is sometimes too loud if you need low volume. But then it gets plenty loud, but the quality goes down as it gets louder.I was a little disappointed also because it takes a while to turn on (approx. 3-5 secs) and it pauses on a blue screen for a second or so when switching between channels.", "Date": "September 4, 2011"}, {"Title": "Great buy!", "Author": "Big mike (-;", "ReviewID": "RTOQKEJ8Z6A5Z", "Overall": "4.0", "Content": "We purchased this tv for an extra bedroom  we sometimes sleep in if our 10 month old doesn't allow us to make it upstairs. It fits perfectly and the picture is great, the only thing I can say is the sound is tinny, but it had rcas and hd component hook ups so just get a surround system which you can buy cheap. We use in bedroom at night at low volume so no biggie, when I was waiting for a new bulb for our 60\" sony bravia we had it hooked to component and surround and used in living room and sounded awesome. Could not get a better tv this size hd flat etc for the money! It operates perfectly!", "Date": "August 17, 2011"}, {"Title": "Picture OK... Audio TERRIBLE", "Author": "Hobby & Reader Gal", "ReviewID": "R183ZTTBXI5B5S", "Overall": "2.0", "Content": "The Audio on this TV is horrible. Very \"Tinny\" and no adjustment seems to help. Finally resorted to plugging in an old set of amplified computer speakers into the earphone jack. This produces satisfactory audio, but shouldn't need this on a new TV. Very dis-satisfied & no real help from VISIO. Let the buyer beware !!", "Date": "November 21, 2011"}, {"Title": "What, no ZOOM??! Unbelievable.", "Author": "Keith A. Williams", "ReviewID": "R3MO6LONUU6FIJ", "Overall": "2.0", "Content": "I have a Vizio 42\" TV (N420NV) which I love.I needed a 26\" or 31\" TV for our trailer so purchased a Vizio E260NV. I am VERY disappointed with it.I probably expected it to be a lot like the big one I have, only smaller. It isn't. It's not even close. It's like Vizio job-shopped the design out to the cheapest bidder. (Yes, \"cheapest,\" not \"lowest cost.\")Some of these \"features\" one never thinks of before it's too late. And some of them are not easy to learn about while shopping; it's only after the purchase that you learn about them.My complaints about the design:* Since everyone has mentioned it, I'll just list it first to get it over with: audio quality. Sounds very \"tinny.\" 'nough said.* No ZOOM mode! To not have this is almost unbelievable, in my opinion. No zoom means that you CAN NOT expand some programs to fill the screen without distorting the picture! (I HATE distorted pictures.) I didn't know there were wide-screen TVs which did not have Zoom, so I was sort of \"had\" on this one. There are very few without it. Unfortunately, I bought one of them.* Narrow viewing angle. Once you get it, or spend time to look it up, you can learn that the viewing angle is 160* horizontally and 150* vertically. This is the case with a few other Vizio sets, but most are 178* in both planes. The narrow viewing angle is definitely noticeable and was noted by at least one other reviewer here.* The remote control is \"chintzy\" in feel. Physically, it seems they were trying to make it with a minimum amount of plastic, thus it is very thin and light in weight. This makes it hard to use. The cross-button is hard to push and each time I use it, it feels as if the entire remote bends. It probably does! That's not the feel of a quality unit.* In-set menu system. Others have mentioned this, too. The \"buttons\" are almost hidden. Operation seems different than operations I'm used to. Operation seems more conventional when using the remote.Since not all of these issues are not readily observable when purchasing, I'll simply say this: be aware of viewing angle and Zoom function when selecting a set. These DO make a difference!I'm in a time crunch for getting a TV, so probably will keep this one even though I do not like it for the reasons mentioned above.Compared to my big Vizio, it is like a super-poor knock-off, designed by a different company, which in some manager's weak moment got added to the product line.As always, your mileage may vary. These are my opinions on this one model. Remember, I love my 42\" Vizio so I'm not down on the whole company or all their products. I'm just sorry to see this one taint the product offering.", "Date": "November 6, 2011"}, {"Title": "Great for Gaming.", "Author": "Andrew Harmon", "ReviewID": "RJEUCP3E6AUVC", "Overall": "5.0", "Content": "I actually bought this TV from walmart but i couldnt seem to find it on their site. Anyways, i decided to go with this TV because it was the only 26\" tv i could find locally with 1080p. The quality is overall very nice and the razor-lit led panel gives the tv very good colors with good saturation. The main reason i bought this tv was for use with gaming on my xbox and as a second computer monitor. This tv has absolutely NO input lag what so ever. You'll definitely  find gaming to be very enjoyable on this tv and you will have no lag issues. As a computer monitor, it does decently. Images and text are crisp but the overall quality doesn't seem as good as my 22\" 1080p dell monitor. Also, this tv doesnt have a pc mode for the hdmi port which is a little disappointing. The price for this tv is quite good given that it is 1080p even though it is only 26\". Sound seems to be a lot better then what other reviewers have stated and i havent really had a problem with it. The biggest con of this tv is the horrible vertical viewing angle. Looking at the tv from the left or right is fine but if you are to look up at the tv or down at it, the colors become very dark and distorted. If you are wanting to get this tv, make sure that you set it up so that it is directly at eye level. Overall, im very pleased with this tv for the price and quality.NOTE- i had to return this tv because it developed a white pixel stuck on the screen. I returned it and got another one of the same model. I've had it for about a month now and i have had no more issues.", "Date": "December 27, 2011"}, {"Title": "Great Monitor", "Author": "D. Failla", "ReviewID": "R3OPDXROGBS65D", "Overall": "4.0", "Content": "I bought this Vizio to use as a monitor, i am a graphic designer / web designer, so i work a lot with it... all i can say the picture is so crisp is amazing! i went from a 17 inches to this 26 and wow ... i don't know how i did without this monitor...Highly recommend it!!", "Date": "December 1, 2011"}, {"Title": "Great TV Great Price", "Author": "User2112", "ReviewID": "ROG0OTAD41DNR", "Overall": "5.0", "Content": "- PRO'sPricing - ExcellentDelivery - ExcellentPicture Quality - Amazing WOWSet Up - EasySound Quality - Clear and Crisp (Haven't Had to put it above 15 yet. Really good sound)Haven't used every single feature yet, but I am very pleased with this set. My only drawback is the limited remote. You must do a lot of the fine tuning on the TV itself. Including turning on or off Sleep mode. Which is the only draw back I can come up with.CON'sLimited use of remote. Most fine tuning done on front panel of TV No sleep button.So Overall Great TV!! Good luck Deciding", "Date": "November 9, 2011"}, {"Title": "AH-MAZ-ING", "Author": "Alex Fickle", "ReviewID": "R24Z4I0WF778YX", "Overall": "5.0", "Content": "This product for the price I got it, is beyond comprehension how large the size is diagonal and the features that come with it. With the newest technology it is less than an inch in width, perfect for mounting, perfect for a monitor to a computer (AKA.That's what I use it for). This LED television also has all the regular features of a normal TV. For the price I got it ($200), it's worth it.", "Date": "November 5, 2011"}, {"Title": "Excellent  Picture Requires Speakers", "Author": "Bolster Technologies", "ReviewID": "R1511D9A47VL0E", "Overall": "4.0", "Content": "The VIZIO E260MV 26 Inch Class Edge Lit Razor LED LCD HDTV has an excellent picture and it has a sharp and classy look that will fit in any room decor.  My mother bought this television first, and I was so impressed with the picture quality, menu selections, and styling that I purchased the VIZIO E260MV also.However, as others have reviewed the sound is tinny and irritating.A set of computer speakers can be connected to TV's headphone jack. I first used a 2.0 speaker system, the sound improved but when the speakers were upgraded to an affordable 2.1  3PC FLAT PANEL 2.1 Cyber Acoustics system the sound was excellent.Due to the system sound I am giving the Vizio Razor 4 stars instead of 5, but if a buyer is willing to spend an additional 30 dollars on speakers this television will be an excellent and enjoyable purchase.", "Date": "September 30, 2011"}, {"Title": "Perfect set for a smallish space", "Author": "nausetgirl", "ReviewID": "RT9ZTFHX6NO3P", "Overall": "5.0", "Content": "I was replacing a big, bulky TV set that had to be at least 6 or 7 years old--still working, but tired.  This VIZIO fit the bill for sleek lines, good looks and a good HD picture.", "Date": "September 6, 2011"}, {"Title": "Vizio 26\" TV", "Author": "vukstoy", "ReviewID": "R3V1CEJ7D69KWR", "Overall": "5.0", "Content": "TV was delivered in 2 working days, very impressive. I took it out of the box and set it up in a matter of 5 minutes. Lightweight, easy instructions. Great tv for the prices, very inexpensive for the quality received. Thanks Amazon", "Date": "July 28, 2011"}, {"Title": "Nice TV!", "Author": "Steven Lee", "ReviewID": "R23B3U8HVJ9B55", "Overall": "4.0", "Content": "So I purchased this TV to play my Xbox 360 on. It has a really clear picture but I'm kind of disappointed in the sound quality. Overall very happy with the TV.", "Date": "May 14, 2011"}, {"Title": "Nice TV", "Author": "William Breite \"BillB\"", "ReviewID": "R3E8NCRMQ2CN69", "Overall": "4.0", "Content": "I agree that the sound on this TV is pretty bad.  I played with the sound adjustment and found that a lower volume seems to help somewhat.  I bought a pair of cheap Altec Lansing BXR 1200 speakers from Amazon and they seem to help the sound somewhat.  The sound is not as \"tinny.\"  Someone told me it is hard to put good speakers in such a skinny TV.  I am pleased with this TV.  It fits my needs.Bill, South San Francisco", "Date": "May 3, 2011"}, {"Title": "Truck Driver has this TV in the truck(18 wheeler)", "Author": "B. Dever \"living the dream\"", "ReviewID": "R2TJ6ISLA7B5YW", "Overall": "4.0", "Content": "I purchased this for myself, and I use it for a TV and computer monitor. It currently has been in the big rig for about 4 months. No problems to report from vibrations or shaking from the rough roads of America. It works great and the power draw is acceptable. My major gripe is how slow it changes channels,the delay is 3-4 seconds,which may not be a deal breaker but during football season its annoying. It is a basic TV that I would recommend to anyone needing a good display,though videophiles may want to look elsewhere.UPDATE: Still going strong after 50,000 miles in a big rig no problems to report,the remote does on occasion change inputs by itself which is is annoying,but I rarely use it so it's not a concern for me.", "Date": "January 29, 2012"}, {"Title": "Poor Sound Quality", "Author": "Karen L. Roloson", "ReviewID": "R3MUODAL0MEMI0", "Overall": "2.0", "Content": "Older buyers beware!  The picture on this TV is excellent quality but the sound is terrible.  I would not buy again.  We ended up buying a sound bar to place in front of the TV so that we could hear what was being said.  Our larger screen TV has the surround sound feature so this is not a problem.  If you buy, plan on spending the extra money for an additional speaker.", "Date": "December 22, 2011"}, {"Title": "Great Bedroom TV", "Author": "Amazon Customer", "ReviewID": "RLHSTWV97L041", "Overall": "4.0", "Content": "We have had Vizio TV's pretty much since they came out. We started with a 32\" and now we have a 42\" in our living room and this 26\" in our bedroom.The main reason we bought this TV was for it's size and price. We wanted a smaller TV for our bedroom, but didn't want to give up picture quality either. (We are in LOVE with high-def!)First, this little TV looks nice and it is shiny black, so it will show finger prints/dust easily. Although this isn't something that bothers us, if anything, it's just an indication that we need to clean!The touch buttons on the TV are a nice concept, but they just don't work all that well. We have never really had any luck with using them, it is usually hit or miss whether you can get them to work. Being a bedroom TV, we use the remote from bed, and haven't used these buttons since the first time we set it up.It has good picture quality for it's size, but the sound quality could be better. My fiancé describes the sound as really hollow. The biggest problem was the fact that the difference in sound level between 1 and 2 and 2 and 3, etc., was just too large. There really isn't any precise control over the volume level, and that is something that I really want in a TV.But, we easily solved this problem by hooking it up to an external receiver and speakers. We now have much more intelligent control over the volume.This TV fits our needs well. We knocked off one start because of the sound quality and the intermittently working touch buttons. We gave it four stars because it has 1080P HD, uses LED back-lighting, it isn't too expensive (we paid around $260 in May 2011), it is the perfect size for our bedroom, and adding on a receiver/speaker system really improves it's worth in our eyes!", "Date": "December 15, 2011"}, {"Title": "Decent TV at a decent price.", "Author": "Roger G. Swearingen", "ReviewID": "RU176E91M2SON", "Overall": "4.0", "Content": "It won't blow you away with any particular features, but it's a good deal, and was exactly what I was looking for. A couple of things that are non-positives: the touch-controls threw me (I couldn't find them until I read the manual) and lack of tilt for the screen means you can't adjust it for optimum viewing angle. The LED backlight is not the fancy high-contrast type you would see in more expensive sets, it merely replaces the cold cathode flourescent more commonly used in lower end sets, so blacks aren't really black.But it has OK sound, but I was only looking for a desktop set, so it's fine.Feature set and number of connections is pretty good. Resolution is great, color just OK. I think it's worth the money, but don't expect to be blown away by this set.", "Date": "October 24, 2011"}, {"Title": "Great picture", "Author": "Rjbobalou", "ReviewID": "R2WUWMSMPQH4RY", "Overall": "5.0", "Content": "We were replacing a small tv in our sun room and we are quite satisfied with the picture.I like the idea of it being an american product.", "Date": "October 20, 2011"}, {"Title": "Good Value For The Money", "Author": "AWS", "ReviewID": "R1P632W9I8LXB", "Overall": "4.0", "Content": "The Vizio E260MV TV is a good TV for the money.  The picture is good, though I think I've seen better.  The sound is not as bad as some of the reviews make it seem.  It is plenty loud enough to be heard in our bathroom when the TV is across the bedroom from the door.  It is intelligible.  It is not home theater quality.  You're just not going to get that from such small speakers.  But all TV's of this class are like that.It's simply a design decision manufacturers have made.  They think when people buy an LED TV that is extremely thin and light, they are willing to give up some sound quality and let DVDs be played through a stereo.  So they give you good enough sound quality to understand what's going on.  But if you want good sound quality, you'll need a home theater or stereo close at hand.  Or simply buy a bigger TV that comes with bigger speakers.The only complaint I have is probably due to my own ignorance.  The wall mount I bought is good for all TV mounts - which means it comes with the 100 mm hole pattern in the plate.  That makes the mounting plate bigger than the design of the TV allowed for.  The plate covers up some of my jacks.  If it bugs me enough, I'll get another wall mount that's the right size.", "Date": "October 10, 2011"}, {"Title": "Solid and Good TV for a Good Price", "Author": "Frank Z", "ReviewID": "RCRKZM22KZR8H", "Overall": "4.0", "Content": "We have been looking for a replacement TV in the Bedroom for a long Time. Looking through Amazon we saw this TV and thought we will give it a try.The Low price and the size was just amazing. I never had a LCD TV before so I wasn't sure if everything will work out the way we want.The TV came and was verry easy to install. Going through the Menue is also verry easy and good to navigate. Channels set up, let's see how the Picture is.It was clear, free of any faults and pixels, sound is good too. I like the Option to change the Sound Pattern as I want. A little afraid I was when I turned on my Wii for the first Time ..But.. Everything is really good.Overall I would recommend this TV to everybody.", "Date": "August 19, 2011"}, {"Title": "tinny sound", "Author": "J. Sible \"nanny\"", "ReviewID": "R35QGNA6CMO2OM", "Overall": "4.0", "Content": "The Vizio tv is great, except for the sound.You feel like you are listening in a tunnel. I am going to buy a small set of speakers to offset the speakers in the tv.", "Date": "August 18, 2011"}, {"Title": "You Suck", "Author": "Collin Funke", "ReviewID": "RP1WJZO6F0R3F", "Overall": "1.0", "Content": "After dealing with King-Electronics all day yesterday and after trying to get them to refund my purchase and after trying to return their defective product I was asked by a representative that I update my review.  So here it is!  I wish I could put 0 stars! Yes, one less than I had originally put.  I spoke to someone yesterday in the sales department who said that they apologize for the misunderstanding, however they would provide me with a return label and a refund because after a few hours of use the monitor stopped working. I opened the return instructions this morning and they want ME to pay to have the product returned.  I find their lack of costumer support to be astronomically lacking compassion for a company who sales defective products.  So far my experience with King-Electronic has been abysmal.  I will print your stupid label, I will pay to return your defective product, and I will never recommend or shop through King-Electronics ever again.  I am appalled that you, King-Electronics.com have any affiliation with amazon.com!  I have used amazon many of times and this has left a horrible taste in my mouth.  And as for you King-Electronics.com I spit on you!", "Date": "September 10, 2013"}, {"Title": "On screen controls are a nuisance if use it as computer monitor", "Author": "Lew Mills \"ADHD Psychotherapist\"", "ReviewID": "RH2SBXYCIDU4L", "Overall": "4.0", "Content": "Nice picture, I think.I use this mainly as a computer monitor on my desk. So, with the HDMI connection, the screen looks very nice. But that also means that I'm tempted to use the controls on the front of the monitor rather than the remote. They are touch sensitive, and not labeled. You touch any of them and onscreen descriptions pop up. They are sometimes insensitive or over-sensitive, leading to mistakes in reading my intentions. The menu hierarchy for settings is difficult to figure out, but that's typical. It takes two button pushes to turn the monitor off. Sometimes if it is reacting slowly, I end up turning it back on! There is also no way for it to go off on its own when it gets no signal. So the computer can't turn it off by sleeping the output to the monitor.When it does go off, or if you turn it off, (which is really only putting it in \"standby\"), it takes a long time to come back on. It is generally about 15 seconds to warm up. When it was hooked up with VGA instead of HDMI it took longer and often would blink on and off a few times before settling in on just being on. HDMI works much better.Of course, as a TV, these are not such big problems.", "Date": "December 5, 2012"}, {"Title": "Great for price", "Author": "James Grigg", "ReviewID": "R1S5VP3913PX5W", "Overall": "5.0", "Content": "26 inch Vizio TV is great! I use it as a computer moniter with my hdmi cable and I also hook it to my xbox it looks very clear. The only problem would be the audio doesnt sound that amazing but I have speakers for that anyways.", "Date": "July 9, 2012"}, {"Title": "Not worth it.", "Author": "Kevin J \"jivespank\"", "ReviewID": "R1RBM9JCNOUGM", "Overall": "1.0", "Content": "My old TV was randomly shutting off on us so it was time for a new one. We needed something new for the bedroom. Found this and couldn't be more disappointed. Video is only acceptable straight-on. If you're looking at it at any angle, you're out of luck. Being in the bedroom, we watch TV laying down, about 15 degrees below the TV. We can't watch it - the video is dark on the top and fade to normal coloring. This makes for a 30 degree vertical viewing area! It's simply unacceptable. Sound also will intermittently cut out when changing channels on my cable box. Cycling power will resolve the issue. Sound also sounds tinny and faint.Overall, not the least bit worth it.", "Date": "March 12, 2012"}, {"Title": "best tv bargain out cheaaa", "Author": "j_stackzz", "ReviewID": "R3UT0K559RFQU6", "Overall": "4.0", "Content": "this tv is real goood the 1080p shows a amazing picture the sound is average could of been tweaked a little bit the sound is more clear with trusound capablities than having bass like people want but what can u expect with a tv of that stature being itz led it as thin as my phone so like 1.7 inches i love dis joint itz niceeeeeeee in my fab voice.", "Date": "January 14, 2012"}, {"Title": "Good Price, Great TV!", "Author": "GMpower", "ReviewID": "R3RMQ0DPPE3U5G", "Overall": "5.0", "Content": "The unit was listed as reconditioned, but the  TV showed up and it looked new.  Not a scratch on it!  Plugged it in and worked perfectly.  Couldn't be more pleased.", "Date": "January 8, 2012"}, {"Title": "I will buy from this seller again!!", "Author": "Lisa", "ReviewID": "R2WUU4DP8WO0BS", "Overall": "5.0", "Content": "We purchased a Vizio 260MV as a Christmas present for our son, for his bedroom. We were a little nervous to buy what was described as a used t.v. but after reading all the great reviews for this seller we figured we would give it a shot and save some money....we were not disappointed!! As a lot of the other reviews mentioned, the t.v looked brand new and everything was as promised and in some cases better. We did not upgrade the shipping, however, we ordered late afternoon on a Friday and received the item on Tuesday, early afternoon...very impressive!! If you are debating buying something from this seller and your unsure....I say go for it. The t.v. is perfect, thank you!", "Date": "January 2, 2012"}, {"Title": "Excellent TV", "Author": "Michael T. Larson \"Ham-Guy\"", "ReviewID": "R3AGN8393JELH8", "Overall": "5.0", "Content": "I bought this for my 14 year old son, he uses it to watch netflix on his Xbox- wonderfull quality picture, and on X-box the set really shines. This is a great TV for the price. I love Vizio, this is our 3rd purchase, and we have also a 42 inch 240HZ LED 3D set  all quality and best picture I have ever seen. A+++ for Vizio.", "Date": "January 1, 2012"}, {"Title": "Awesome experience", "Author": "Candy", "ReviewID": "R1QGI6NQ09HOWC", "Overall": "5.0", "Content": "This is an awesome product. Recommended for everyone to replace an old tv. It works great and loud sound. Cool touchscreen pad on the front to turn it on and change the channels and volume.", "Date": "December 30, 2011"}, {"Title": "One Bad one out of 4", "Author": "R. Cochran \"dcblues\"", "ReviewID": "R12ECGV0O2T3BV", "Overall": "2.0", "Content": "I purchased this my 4th Vizio TV in 4 years to but in another room. I got it on Dec.2 and I turned it on Sunday Dec.18 to watch a football game in my office and it died about 15 minutes into the game. I did exchange for another Vizio(a newer version of the same size and model) so far so good.Vizio support and the merchant I bought it from didn't bat an eye when I brought it in to exchange.I'll continue to use the Vizio brand as long as my current 4 hold up.", "Date": "December 21, 2011"}, {"Title": "Perfect TV", "Author": "bagmania", "ReviewID": "R25M5INDYE52KL", "Overall": "5.0", "Content": "This is the perfect TV for the bedroom or the kids room. The picture is unbelievable and the sound not bad at all. I saw other reviews saying the sound was bad but your buying a 26\" tv and I've purchased three or four for the grandkids this year and this one sounds as good or better than the other ones. This Vizio will do just fine.", "Date": "October 16, 2011"}, {"Title": "SAVE YOUR $$$$$$", "Author": "STLricky \"Rick\"", "ReviewID": "R37BLQIIPLOOLB", "Overall": "3.0", "Content": "Pros: Decent price, video not too bad, virtually no heat as with a standard LCD, and as always, Amazon's shipping and order processing is INCREDIBLE!Cons: Somewhat restrictive menu choices (compared to LG or Samsung), but most of all, the AUDIO IS AWFUL! One of the other reviews compared it to a 40 year old transistor radio-that's being too kind. I tried every single sound scheme, then gave up and purchased an external amplifier and connected external speakers. That wasn't too bad but there are times you don't want a full blown audio system running in your kitchen. I'm keeping the amp(thanks Amazon) but the TV has got to go. I tried!", "Date": "October 7, 2011"}, {"Title": "Can't go wrong, especially for the money", "Author": "Kindle Customer", "ReviewID": "R1DZOD6ZHQNU8", "Overall": "5.0", "Content": "This is an excellent TV and a great value.  I'm giving it 5 stars because I realize no product is perfect and comparatively speaking, this TV is a homerun.  There are some things others should be aware of and I feel Vizio should improve on (if possible).1) The inital programming process is slow.  Be prepared to let it run for 20 or 30 minutes to search for all your channels.  Fortunately you only do this once.2) I don't like how the channels are displayed.  Instead of channels 2,3,4,5...; some stations are numbered 23-1, 23-2, 23-3, 24, 25, 26-1, 26-2, etc.  This may not be Vizio's fault but instead the cable company but it's still very annoying.3) When the TV sits on the stand, it leans slightly backwards.  Not sure why it doesn't sit vertically.4) The default display settings are a bit dull.  I had to change the settings from 'Standard' to 'Vivid' in order to achieve a more visually pleasing image.  (Note: I don't currently have a HD box for this tv so that may contribute to the need to adjust the picture.)", "Date": "July 5, 2011"}, {"Title": "Very Good HDTV", "Author": "Richard J. Erdmann \"rjeshopper\"", "ReviewID": "R34DABX63DN0EX", "Overall": "4.0", "Content": "This TV is just the right size for my small home office.  The sound is bad but I use external speakers anyway so it's of no concern for me.  It has a very good picture along with a simple remote control. I wish it had more AV inputs but that deficiency is easily corrected with a simple AV switch box. This is an excellent TV for the price.", "Date": "July 5, 2011"}, {"Title": "Great TV for the money, sound could be better", "Author": "dlp1030", "ReviewID": "R25XNRH0KZ189J", "Overall": "4.0", "Content": "This is a great TV for the cost.  It's a good size, very thin, lightweight, great picture.  The sound is not the best, but it's really the only drawback.", "Date": "June 8, 2011"}, {"Title": "Not bad at all", "Author": "Dwayne", "ReviewID": "R3GLMRBKLK1J60", "Overall": "4.0", "Content": "Got this TV at Walmart along with a bluray player.  It replaced my old picture tube television and my DVD player.  I've heard all the talk about LED, HD, 1080p, Blu rays, and I'm sure you have, too.  I got a blu ray player as a gift and didn't want to hook it up to my old CRT television so I went and bought this LED TV.At first glance, the TV didn't impress me because the images were a little fuzzy.  As per recommendation, I went out and purchased an HDMI cable and the display improved drastically.  I picked up a cable at a bargain outlet for 5 bucks.  Now the movies are bright and colorful.  Very nice!In hooking up some older game systems, the screen is still fuzzy using the RCA (red, yellow and white) jacks, but I assume that would be the case with all older systems.  The new Xbox 360 and PS3 should be fine.The sound, like others have said, isn't very good.  Sounds like something you would find on a laptop computer. The sound is clear and doesn't seem to be any distortion, but there's just no bass whatsoever.  Should be ok for a small room though.  The control buttons on the screen are touch sensitive and light up when you touch them, but you can't see them unless you touch them and even still, they are not labeled, so it's hard to tell what button you are pressing!  The buttons are labeled on the LED screen and this is really stupid.Like others have said, the screen is tilted backward and there's no way to adjust it, so I put a book under the back of it to tilt it a little bit forward.  The remote seems really cheap and awkward... feels like it would break easily.Another complaint I have, is that there's no audio output except for some fiber optic port for a soundbar.  So that kinda sucks too.But other than those minor complaints, the TV has a nice display.  I'll give 4 stars.  Minus one for the tilted screen, cheap remote, goofy onscreen controls and lack of sound.", "Date": "July 6, 2011"}, {"Title": "Excellent Pic-but Sound ????", "Author": "wrdore", "ReviewID": "R2DITANW0QYTRZ", "Overall": "4.0", "Content": "I just received my 26\" Vizio E260MV yesterday. This TV was purchased for our travel trailer. The tv is very light which is good for mounting on the inside and outside walls. Picture is excellent but I agree with almost everyone on the sound issue, it sucks and really does sound tinny, however this is like I said for my travel trailer so I really do like it.", "Date": "December 22, 2011"}, {"Title": "Very pleased", "Author": "Gregory T. Stewart", "ReviewID": "R1K2M8VCUROQ6I", "Overall": "5.0", "Content": "Pros...Great value and Excellent product! Have had for 9 months and still very pleased with this purchase! Highly recommend!Cons...None", "Date": "November 30, 2011"}, {"Title": "Pretty okay picture except lcd specific problem, onboard sound is as I expected but don't need it", "Author": "BBD \"budbd\"", "ReviewID": "R7B3R3FJ21MTL", "Overall": "2.0", "Content": "ADDITION:  Since I've been using this, I believe I know why the screen is tilted backwards, since it appears that when viewing straight eye level that the screen seems darker, but if you stand up and look downward, then it lightens up, if you are looking upwards at it as if it was on a higher than eye level shelf, then the screen goes dark, this is a lcd specific problem...so I suppose if I want to actually see everything in the proper brightness that I'm supposed to put it on the floor?  I didn't have this problem with the other lcd tv I have out for repair.  I'm not quite sure that that maxing out the brightness control is the right thing to do, having already gone to seventy percent.  I can't imagine what this would be like used as a computer monitor, sitting in front of it.  If it weren't for that \"1080P\", because of the viewing and the worthless sound, I'd return it in exchange for something else......I bought this little \"gem\" of a tv as a temporary use tv while my Sylvania 32 inch year old 720p is off for fixing or replacement on my store bought warranty, but I selected this tv for 1080P only and had to buy locally at Wal mart so I wouldn't miss a show on that night on dish network, and nice that it was also LED lit so I get to experience two of the latest things of max high def and fancy lighting that produces less heat(sure would have come handy this last summer during those scorcher mid days where the sylvania lcd helps heat up the room), and I watch tv in a smaller spare room, so size doesn't mean much to me as long as it aint too small.  As expected, the sound was like a message from the company that nobody is really watching tv generally without a sound system attached, and I used component cable to attach video to the tv, sound patch cords from my satellite receiver and part of the same component cable to my \"tv sound\" port on the back of my stereo receiver, I think I need one of those optical cables to adjust sound on the receiver via tv remote control of the tv.In the box there seems to be offers of extended warranty through vizio, wished I knew about that cause I bought a two year extension service plan through wal mart effective after the one year warranty, hope I won't need it.EXTRA ADDITION:  Of course, I get my 32 inch sylvania back, a perfect tv for my living now since I can see tv from the kitchen or across the room, and there is no darkening or lightening worth even notice to mention like this vizio, I mean, I thought so.  I don't know why the vizio is so view angle sensitive.  No, I'm not inclined to return it, cause I need two tv's right now, and $278 wouldn't get me but a el cheapo lg 32\" 720P standard lcd.  The real trick was the way the display model was on display at Walmart, since display models are always set on \"store\" or some other word, having brighter backlight likely at 100%, something to think about when considering a display model, cause the screen life is supposedly 30,000 hours at half brightness, somehow, I did adjust the angle of view with a book, tilted it straight up and down, and setting the backlighting to 50% custom setting, with 55% brightness, even then I'd like to go to seventy to 75%, but it seems okay for now on most things and I don't want a premature failure cause believe it or not, I'd like to use this for a long time, maybe someday as a computer monitor, or a kitchen shelf tv, when or if I get some sort of tv later that has all the latest bells and whistles and is fourty inch or much larger, I mean, I'm bout to retire to the trash in pieces a philips magnavox Nov 1999 32 or 36 inch(very heavy), seems like I paid $300 plus dollars for that thing back then, and it didn't have but 75 ohm connector and composite connectors in(yellow, red/white), so television longevity is important to me, and should be to all americans, it just isn't acceptable that any tv $300 and over should only be worth two, maybe three years.", "Date": "October 10, 2011"}, {"Title": "SPEAKERS", "Author": "TOMKAT", "ReviewID": "R3MDU5S5V6AP5X", "Overall": "2.0", "Content": "I had to return this set the speaker/sound system sounded like a forty year old transistor radio. The picture and setup was very easy.", "Date": "October 1, 2011"}, {"Title": "Review", "Author": "Keith Bowen \"me\"", "ReviewID": "R3Q5NJBWHHYJRN", "Overall": "3.0", "Content": "Nice price, very good picture, easy to use.  My wife thought it would be too big for a small room but now she thinks its a good fit.  Very, very poor sound quality. Tinny.  Had to find some computer speakers at a yard sale.  Hooked them up and turned off the TV speakers.  Sounds good thru those computer speakers.  Can't believe that any company would make a TV with such poor speakers.", "Date": "September 27, 2011"}, {"Title": "vizio tv", "Author": "Lynne Steinke", "ReviewID": "R2T1C7RQBWBX7V", "Overall": "4.0", "Content": "Easy to set up. Picture is average however sound is very tinny. Will need to buy a sound bar but the cord requirment is not easily found on the lesser expensive sound bars.", "Date": "September 10, 2011"}, {"Title": "Vizio", "Author": "Joe", "ReviewID": "R1MEPIQKNGGFXH", "Overall": "5.0", "Content": "Great tv for the $! Easy to set up.  I bought it for a bedroomWhy do I  have to use at  least 20'words?", "Date": "September 9, 2011"}, {"Title": "Vizio E260MV", "Author": "Grandpa,NY", "ReviewID": "R24EWDGXAX56P0", "Overall": "4.0", "Content": "This TV was intended to replace an older standard definition 15 inch flat panel located on an unenclosed kitchen counter. The older set had front facing speakers one on each side of the screen. The sound was acceptable. The E260MV was placed in the same location on the counter. The E260MV has two rear mounted firing speakers. The sound was anemic,disembodied and marginally listenable. Changing audio modes did little to improve this TV's audio quality. The picture quality is exceptional. Relocating and enclosing the E260MV in a bedroom armoire with the Surround Sound mode selected has improved the sound to where it is now listenable. A Vizio 32 inch sound bar recently ordered for use with this TV should resolve the audio problem. I do not blame Vizio for the poor sound quality. Two small rear firing low powered speakers on any TV this size place in an open space is going to result in disappointing sound quality. Thin TV sets are going to produce thin sound. The E260MV's excellent picture quality redeems any shortcomings of its speakers. For its great picture and competitive price the Vizio E260MV is highly recommend.", "Date": "August 11, 2011"}, {"Title": "Not happy with this tv", "Author": "Georgia Miller", "ReviewID": "R2W6SWXLQGYA38", "Overall": "3.0", "Content": "I bought this item and after a couple of days set up for the return. Not happy with the dark picture and the tinny sound. I had a old honker 25\" Magnavox analog hooked up to Verizon Fioz in this space with a better picture and sound. Am replacing with a 32\" different brand. Hopefully that will solve the problem. Very disappointing.", "Date": "July 6, 2011"}, {"Title": "as expected buying a refurbished item", "Author": "Alicia", "ReviewID": "R221PC07T0T2I0", "Overall": "4.0", "Content": "the tv was a bit scratched up when i received it the stand is a bit wobbly and the sound quality is not very good but he picture is nice and the tv is a nice size and rather slim.", "Date": "January 14, 2014"}, {"Title": "Vizio 26\" Lit LEd LCD HDTV", "Author": "Hammercl", "ReviewID": "R2ZYJ450QNPLOS", "Overall": "5.0", "Content": "Very Good Product for the price. Well packaged and easy to install with the stand that comes with it or it can be mounted to the wall. The picture is very good and it was easy to setup out of the box. I would recommend this product.", "Date": "January 12, 2014"}, {"Title": "Hdmi not working", "Author": "Utopia care", "ReviewID": "RUJ6E7T8M3YA", "Overall": "3.0", "Content": "Has two hdmi ports one of them isnt working, the tv looks good i plug in the play3 and pc but have toBe switching hdmi cable", "Date": "September 14, 2013"}, {"Title": "Surpassed my expectations as a PC monitor", "Author": "Azimuth Solar", "ReviewID": "R3XC7Q3JRW9Y6", "Overall": "5.0", "Content": "The great majority of reviews I've read regarding the E260MV have been written by people who use it as a TV and a DVD/Blu-Ray monitor-- quite understandable, since it's billed primarily as an HDTV. However, I was curious to know how it would work as a computer monitor. The price was right, so I took a chance and purchased a refurbished unit specifically for use with two desktop PCs running Windows XP Pro (one with an HDMI connection, the other with a standard VGA connection.) Set-up was simple, and it didn't take long to realize I had made a very good choice. I was extremely pleased, I'd almost say astonished, at how clear, sharp, and brilliant images and text display, through both HDMI and VGA connections at full resolution. It took a bit of manual adjustment to achieve the optimal image, particularly with the VGA monitor, but I don't consider that a flaw.The generous array of connection options is a boon for those with \"legacy\" equipment-- it even has an S-video connection, which is quite rare on LED/LCD flat panel monitors.As for the audio: in my opinion, expecting rich sound from such a low-cost unit is being unrealistic. Vizio put their money in other features and skimped on the speakers, so it does sound cheap. However, through external speakers and/or headphones the audio is quite acceptable.The stand, as others have noted, does indeed cause the screen to tilt slightly at an obtuse angle, which is a design flaw (unless the designer expected that most people would place their unit below their line of sight.) To solve that I placed a shim (an old book) under the back foot of the stand.At this point I haven't owned/used the unit long enough to know if it will endure daily use as a computer monitor. Even if it lasts at least a couple of years, I will consider I got an incredible deal.", "Date": "August 13, 2013"}, {"Title": "very pleased!", "Author": "nursechick", "ReviewID": "R3N4IBZFG3X25Z", "Overall": "5.0", "Content": "Recently ordered  a refurbished 26\" Vizio through Amazon because my mom's stopped working after a close lightning strike. I like to shop \"hands on\" most of the time, but its hard for her to get away as she is a caregiver for my dad and if i take over for her doing that - she doesn't have any help shopping. I went online with my phone, and found just what she wanted at a great  price with the \"refurbished option\" - it all went smooth as can be and was hooked up in her room the following week!  No complaints at all! Very pleased with the service and the product!", "Date": "July 8, 2013"}, {"Title": "Great Picture Blah Sound", "Author": "Nathan B", "ReviewID": "R1NEG2XD3FT4TA", "Overall": "4.0", "Content": "Great Tv however the sound is awful the voices are very muddy and loud when you want them quiet and low when you want them loud. buy a soundbar lol", "Date": "July 3, 2013"}, {"Title": "Good for the money - watch out when mounting!", "Author": "Joseph Valdez", "ReviewID": "RIZJX4BLXOQCR", "Overall": "4.0", "Content": "I bought this Vizio as a refurbished item. It works fine and the picture is pretty good for the money; the sound isn't that great.I purchased this 26\" TV for my dining area so the quality wasn't a huge factor. I'm pleased with it.One VERY important thing to keep in mind is the mounting. The design in the back for the wall mounts is poor. Standard wall mounts with two separate vertical attachments will simply not work. The vertical attachments will not lay flat due to the video connections in the back protruding. The mounting area in the back of the TV are low, close the connections. I had to return the wall mount I purchased and had to get an \"X\" style, one-piece, mount that didn't interfere with the connections. Before attaching the one-piece \"X\" style mount make sure you plug in the power cord first, or else the mount will prevent you from connecting it after it's mounted.", "Date": "July 2, 2013"}, {"Title": "Great Tv", "Author": "MauiLady01", "ReviewID": "R2QW8PLJLUNW3R", "Overall": "5.0", "Content": "This TV alone has sold me Vizio products. It is light weight, easy to use, has a great picture! I have had this for over a year now and I love it!", "Date": "June 5, 2013"}, {"Title": "The razedge", "Author": "Lad", "ReviewID": "R9RGEYQHK6XC7", "Overall": "4.0", "Content": "I had been looking and looking for just the right TV and this model was just right. Not to small, not too big. When it first came out a bit pricey for me, when found on amazom for the right price, I bought it. Sometimes it pays to wait, love everythong about, was olny sad it came without owners manual. :0)", "Date": "April 21, 2013"}, {"Title": "Awesome", "Author": "Kindle Customer", "ReviewID": "R2YFEKGEVRNRWD", "Overall": "4.0", "Content": "Bought this TV in 2010. as a computer monitor. Ive taken it it half way around the world and never had a problem with it.", "Date": "February 11, 2013"}, {"Title": "Vizio E260MV  26-inch Class Edge Lit Razor LED LCD HDTV", "Author": "Raymond C Morawski", "ReviewID": "R337142NAISR3H", "Overall": "4.0", "Content": "Met my expectations for size and picture quality. Sound a bit tinny but not that important to me.  Appreciated the HDMI ports and the ability to hook up to my PC.", "Date": "January 1, 2013"}, {"Title": "refurbished vizio tv", "Author": "Ray Ranallo", "ReviewID": "R3FO4VC9Q8GOH2", "Overall": "2.0", "Content": "When it finely got up and running it works \"ok\" but the picture quality isn't as good as I thought it should be. Maybe it's because the set is 10 years old.  The cable company did get to run better then I was able to so I'll settle for it. With what I went through I'll never buy a refurbished product again. I saw in todays sunday paper, Kmart has a 32 inch led Seiki on sale for 218 dollors. But like I said I'll never buy refurbished again", "Date": "December 23, 2012"}, {"Title": "Vizio HDTV", "Author": "John W. Baker", "ReviewID": "R391F9P0RM0QGA", "Overall": "5.0", "Content": "The product is just as advertised nearly new I have enjoyed it. I have had no problems at all, I am still enjoying it.Thank you", "Date": "August 10, 2012"}, {"Title": "Excelent i recommended", "Author": "miguel mejia (codigo # 10560)", "ReviewID": "R2UGP54AQKJ7N1", "Overall": "4.0", "Content": "I'll give you a 4 only by the sound is very bad but I think nobody would think to watch TV without a home theater but the other things how video is excellent its design, is very thin and does not heat how the LCD tv. I recommend in everything else", "Date": "August 3, 2012"}, {"Title": "great service", "Author": "techguy", "ReviewID": "R1I2ZUAIARETND", "Overall": "5.0", "Content": "great service from electronic deals 101, I got a dead pixel and failing colors tv first but they sent me anothe waiting on shipment.", "Date": "June 22, 2012"}, {"Title": "nice service reps; not such a great product", "Author": "BAW \"BAW\"", "ReviewID": "R132CMLZ1C80W9", "Overall": "1.0", "Content": "I bought one of these TVs 1 1/2 weeks ago. Although the service reps were quite nice when I called, I can't use the TV: the ports are loose, and no connections work. I don't have cable; I want a TV set to hook up to DVD players. I get a NO SIGNAL error, and the red-white-yellow cables fall right out of the ports. It's disappointing, although I realize that for $250 I shouldn't expect much. It's always possible to end up with a substandard product no matter what you pay, but I will be a little more wary about buying this brand.", "Date": "April 16, 2012"}, {"Title": "Very happy man", "Author": "Irving (Bart)", "ReviewID": "R26007FI6YLHSA", "Overall": "5.0", "Content": "Got rid on my Samsung 23\" monitor and replaced it with the 26\"Vizio ,with 2 HDMI connectors I've got a quick click to change PC's and TV to boot ,also built in speakers , works for me, thanks.Bart", "Date": "April 13, 2012"}, {"Title": "Thin, but bulky", "Author": "Mel", "ReviewID": "R6X1OO0BKZOJW", "Overall": "4.0", "Content": "The TV is decent, though somewhat no frills, and the only thing I really didn't like about it is that it seems a bit bulkier than I expected. The bezel is nearly as big as my older 42\" HDTV. That's perhaps a very subjective issue - you may not think so. I do like that the buttons aren't always lit, only lighting when you touch the area near them. Works fine when I tested, has the mounts the client I purchased them for needed and were big enough in screen size (without being too big) and have the energy efficient LED's.", "Date": "March 1, 2012"}, {"Title": "Great picture....sound?", "Author": "cusefans44", "ReviewID": "R3LSP9CN9IKTE2", "Overall": "4.0", "Content": "The Vizio E260MV has a picture that rivals our $3000 main television. I have it set up in my office and only use it to watch some news and basketball while I am working late into the night. The only knock that I will give it is for sound. In fact I would rate the sound as horrible. I added some computer speakers to it and it has resolved this issue. Again the picture GREAT, sound NOT SO!!! BTW...the vendor was also great to work with.", "Date": "January 29, 2012"}, {"Title": "Great Picture..........BUT", "Author": "F. Marygold \"Jazz Lover\"", "ReviewID": "R258E3U87Z3RAA", "Overall": "2.0", "Content": "Well I reviewed this tv before I bought it. The Picture is perfect, However the sound was really BAD.No matter how I adjusted the sound it was still bad. The only way to enjoy the sound was thru myParadigm speakers and Sony receiver. If you listen to tv only........DON'T BUY.", "Date": "April 17, 2011"}, {"Title": "Good bedroom TV", "Author": "zmzm", "ReviewID": "R4YCMICSK11P0", "Overall": "5.0", "Content": "I am using this TV in my guest bedroom. great picture quality, installation was quick and without any problems. used with Verizon VIOS box. Sound can be improved...", "Date": "September 5, 2011"}, {"Title": "TIN CAN SOUND", "Author": "WOODWOORKER72", "ReviewID": "R2REW76QKIV6Y7", "Overall": "3.0", "Content": "THE PICTURE USING HDMI CABLE IS VERRY GOOD,HOWEVER,IF YOU DO NOT USE HDMI VERTICAL COLOR STRIPES SHOW UP AT VARIOUS TIMES (BAD PICTURE). THE SOUND IS VERY BAD.IT SOUNDS LIKE IT IS COMMING FROM THE INSIDE OF TIN CANS. EXTERNAL SPEAKERS ARE REQUIRED FOR AN ACCEPTABLE SOUND.THERE MAY BE AN ENTERNAL SOUND ADJUSTMENT THAT COULD HELP,BUT I HAVE NOT FOUND IT. FOR THE PRICE I AM SATISFIED.", "Date": "December 24, 2011"}, {"Title": "vizio tv", "Author": "npyz", "ReviewID": "R9GCP8N6ARMKC", "Overall": "1.0", "Content": "piece of junk sound quality is bad and after 13 months it don't work,,,,stay away from this one ......not worth the chance", "Date": "November 10, 2012"}, {"Title": "Vizio TV", "Author": "C. Cannizzaro \"CJ\"", "ReviewID": "R109VY7LH1ZEJS", "Overall": "1.0", "Content": "Having previously purchased a 42\" Vizio HD Plasma TV and been very happy with it, when our smaller tv in the bedroom needed to be replaced I naturally chose Vizio again. Big mistake! This TV is a piece of junk. The speakers are the worst. The picture is fair, but not great. It is really very cheaply made. The base that sits on the stand is cheap plastic. I will never buy another electronics item again without visiting a store to see and/or hear it for myself.", "Date": "January 11, 2012"}, {"Title": "tv", "Author": "beame \"selective shopper\"", "ReviewID": "R2LRUCWMZ56H38", "Overall": "4.0", "Content": "This was a gift so I can't give a detailed review of the product. My son said it worked well for his use in the bedroom and was pleased to receive it.", "Date": "December 6, 2011"}, {"Title": "Good Tv for the price", "Author": "pal", "ReviewID": "RHESJJ3GWF6JD", "Overall": "4.0", "Content": "Like the look and style of the tv, how shiny it is, overall its a god tv, if your looking for a tv for your room, this is perfect.", "Date": "May 13, 2011"}, {"Title": "A little disappointed", "Author": "smayrol", "ReviewID": "R1F04DGBPFOXK7", "Overall": "3.0", "Content": "Television for the price is good the picture is very good but what disappointed me was the sound I had read that the sound was bad but I found mine when I get the tv has only bad thing is that the sound is as clear but everything others is well", "Date": "April 22, 2011"}, {"Title": "26 inch Vizio LED TV", "Author": "aloha lady", "ReviewID": "R1X0LARCVPR0T", "Overall": "5.0", "Content": "Great TV picture.  Hard to put together due to poor instructions.  Recommend this TV.", "Date": "July 15, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Edge Lit Razor LED backlighting for brilliant color and contrast\n1080p Full HD\nSRS TruVolume and SRS TruSurround HD audio\nTouch sensitive TV controls\nTwo HDMI port", "Name": "VIZIO E260MV 26-Inch Class Edge Lit Razor LED LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/415qNlW-eYL._SX300_.jpg", "ProductID": "B004T1YA5M"}}