{"Reviews": [{"Title": "Very Happy With This TV Purchase", "Author": "G. A. P. \"G.A.P.\"", "ReviewID": "R3DY8O06EOULOV", "Overall": "5.0", "Content": "My family is VERY happy with this purchase.  My original choice was to go with the 65 inch Samsung UN65C8000 and later the UN65D8000.  While Samsung makes great TV's, I really did not care to pay extra for 3-D which I will never use. The more I read about the Samsungs, the more concerns I had about spending $5000 for a TV whose technology could be outdated in a few short years.  I was really glad to find this Sharp TV which seems to have hit the sweet spot for me between size, features, quality and price.  With the Sharp I also got 5 extra inches of screen for around $2000 less than the Samsung. But the proof is in the picture quality and this TV has an excellent picture.  Unlike the edge lighting used on the Samsung, the Sharp has full arrray LED back lighting. This makes the Sharp not as thin as the Samsung, but gives it a more uniform picture.  HD is simply stunning.  Last but not least, my living room is almost all windows so one of the biggest selling points for me was the semi-gloss screen on the Sharp TV. This makes for less of the distracting reflections compared to a glossy screen TV like the Samsung. In sum, I think Sharp has a real winner here.  If you have the space and enough seating distance to the TV, I think you will be very satified.", "Date": "July 3, 2011"}, {"Title": "I'm in Love!", "Author": "ReviewByMe", "ReviewID": "RESS0ZVC44POF", "Overall": "5.0", "Content": "I just got this \"beast\" set up and all I want to do it wrap my arms around it and hug it. My boyfriend helped me with it and when we were done, I said \"I love you.\" The sad thing is, I was talking to the TV, not him.I blanched when I first saw the price tag but have been wanting a 70\" LCD for a while so went ahead and purchased it even though there were no other reviews at the time.I am so happy I did.I think I spent a month or two trying to decide what TV to get. I visited plenty of stores and did comparison shopping. I kept weighing the features I wanted and those I could live without. In the end I had it down to this 70\" and another brand's 65\" 3D TV. I decided I would enjoy a larger screen more than I would a 3D screen so that was the deciding factor for me. I'm not really into the whole 3D thing anyway...I have long eyelashes so wearing glasses for a long period of time drives me nuts.I really cant think of a single negative thing to say. I was a little nervous about what I would wind up with but this TV has met every one of my expectations. It was a breeze to set up - just make sure you have an extra person on hand to help with the stand. It is large, awkward and slightly heavy to move. (We cursed quite a bit and in the end, had to cart it into the bedroom to lay it down on the mattress to put the stand on.)I bought a sound system to go with it because I always hear that the new, larger TV's don't have the best speakers but the sound on this TV is just as good as what was on my last television set. Though, if you're going to spend so much on a TV, I'd go ahead and shell out a few extra bucks to get a sound system that equals the picture.I guess the only tiny thing I could say that's a negative isn't really to do with the TV but the current technology. It has built-in wifi which lets you stream from the various online movie sites. Since the signal is being fed to it wirelessly, its not nearly as sharp as the picture you get from your HDMI cable connected sources. I'll probably stick to my movies and cable when watching TV on it.I haven't set up my Xbox to it yet and not sure if I will (its in the media room,) so cant comment on how it would do with games, but as I mainly bought it for TV/movies it suits its purpose perfectly.I honestly don't see how they can ever improve on this.EDITED to ADD:So I have had this a few weeks now and Im still super into it. At first I thought there was no light sensor, but I was wrong and there are actually two up front that I had just been blocked with the spare cable clicker. I really like this feature as on the few days Ive been around during the day, I didnt need to close blinds to watch TV or mess with the settings on my own.I moved the TV to a different room a week or so after the original set up and really had to play around with the picture settings to get them right. The pre-set ones are ok, but some of the levels seemed off to me....Bright colors were looking great but skin tones just seemed washed out - like everyone on my TV was a in need of some color or trip to the beach. Anyway, I have all the settings where I think they should be.I have found one, not so great thing...it doesnt really effect me as I have ATT Uverse and pretty much only watch the HD channels....but I have noticed that on the regular channels, it doesnt do so well. Like, on those channels, everything has the picture quality of an old episode of Walker Texas Ranger. Its almost like those channels cant handle being blown up to this size. There could be a setting to fix this but I havent found it yet. But anyway, the HD channels all look amazing.", "Date": "May 12, 2011"}, {"Title": "GREAT 70\" Sharp,, better than my 65\" Panasonic plasma", "Author": "Davyo", "ReviewID": "R3PY27ZRCD5AXP", "Overall": "5.0", "Content": "Got this 70\" Sharp to replace my 65\" S2 Panasonic plasma that I sold,,, I wanted something bigger than 65 inches and at first was worried that I might take a hit in picture quality going to the 70\" Sharp, such was not the case, the picture quality is even better than my much loved Panasonic 65 incher.Anyhow,,,, very very very happy with my new Sharp.On a side note, I also purchased and returned the 65\" Vizio passive 3D panel,,, the passive 3D was great,, but the 2D picture quality of the 65\" Vizio was not as good as my Panny plasma or my Sharp 70 incher.CheersDavyo", "Date": "June 5, 2011"}, {"Title": "Simply Wonderful (After Calibration)", "Author": "C. Nelson", "ReviewID": "R28GF9RRBFN9XF", "Overall": "5.0", "Content": "The TV is great right out of the box. But for videophiles, you might notice some oversaturation of the colors, too-bright picture, etc. I like to be in control of my picture, so I created two custom user settings - one for movies and tv shows, and one for video games. I turned all of the \"auto\" features off so that the picture would be consistent. After just a little tweaking, the image is astounding. You definitely won't be disappointed.Note: If you have a calibration blu-ray (meant for calibrating HD TVs) or plan on getting one, make sure you understand that you'll have to eyeball the color yourself because of the fourth pixel color in this set (the \"quattron\" means it's not only using RGB colors - it adds yellow as well). So, the blue filter that comes with some of these calibration blu-rays will not work correctly. If possible, calibrate the color without the blue filter.", "Date": "June 13, 2011"}, {"Title": "Best TV for the money .... anywhere!", "Author": "Sugarmax", "ReviewID": "R2WQQO47EF0HPN", "Overall": "5.0", "Content": "I've been in the market for a new TV for while and researched and watched every big screen less than $3000. By far Sharp's quad pixel technology and led array backlighting delivers the finest picture I've seen. The LC-70LE732U Sharp delivers top shelf viewing for every media you got! I originally bought the LC-70LE733U from Sam's club and played with it for 2 months experimenting with all of the settings and features and fell in love with the picture. It cost me $2996.00 ( $2800.00 plus $196.00 tax ) which was fine by me ... until I made a discovery. After I researched and tested the 240 hz feature ... I realized it does not work! I even called Sharp and asked the tech about it and explained all my tests .... he finally said \" just turn it off like most people do \". It bothered me so I did some more research and found the 732U at the Sharp site. I compared it to the 733U and found the only difference between the two is the 240hz feature. So I returned my 733U to Sam's and bought the 732U from Amazon. I saved $616.30 ( $196.00 was tax that I didn't have to pay online ) and got an extra year of warranty. Both have the same excellent picture. Lastly I looked all over the Net for some settings to try but found none so I wrote down the ones I use and decided to pass them along. It's the best picture for everything I watch. So set the view mode to Dot by Dot then go to the User A/V mode and change the settings to ..... OPC off , Backlight +5 , Contrast +2 , Brightness +5 , Color +2 , Tint +6 , Sharpness +5 , then hit advanced ... then set Color Temp to High , Motion Enhancement to Off , Quad Pixel Plus to On , Active Contrast to Off ,Gamma Adj 0 , Film mode to Advanced Low , Digital Noise Reduction to High , Monochrome Off , Range of OPC to Max +2 and Min +1 and power saving feature to Standard. I'd like to hear comments back on what you think of the settings. Buy this TV and you won't be sorry. Remember ... it's not a perfect world so sometimes manufactured items are lemons but that doesn't mean they all are.", "Date": "January 5, 2012"}, {"Title": "Want to WOW yourself... friends & family? This is the one!", "Author": "JD Photography", "ReviewID": "R2RS64ED1RJZTW", "Overall": "5.0", "Content": "We haven't had this tv long, less than a week to be exact, but instantly fell in love as soon as we powered it up!  We were blown away by her parents 55\" Sony LED and even more now with this monsterous 70\" Sharp Aquos!  The LED technology in general is just unbelievably crystal clear!  HD movies seem as if you are right there watching the action first hand, not through a tv.  I will eventually tweak the settings for an even better picture, even though I can't even imagine it getting any better.We wanted a LARGE LED tv that could also link to Netflix so we can stream movies whenever the mood hit.  The wife set up the Netflix in less than 5 minutes.  The LED Sony her parents have required a USB adapter of some type & she thought we would need the same. But, not this Aquos!  We fed it the wireless signal and were instantly streaming movies from Netflix after punching in the login information through the tv.The tv is mounted to a Cheetah APDAM2B Full Motion Dual Arm Wall Mount Bracket.  The bracket states up 55\", but the key is the mount supports up to 165lbs (bracket manual states up to 130lb from what I remember).  Either way this bracket is solid and supports the 70\" effortlessly.  The swivel option by pulling the tv off the wall to angle for a diffent view is even fully functional.I highly recommend this tv (& mount) if you are looking to go BIG! Watch your friends reactions when they see this bad boy mounted in your room!  It can be quite comical :-)  Coming from owning a 42\" Plasma, I still chuckle when I see this tv on my wall which seems to dwarf the full size mantle & fireplace that it's mounted next to.If anyone would like to help out and post your custom settings, I (sure others will too) would really appreciate it.", "Date": "June 12, 2011"}, {"Title": "More than what I expected", "Author": "Fred R. Munson \"Large Screen Buff\"", "ReviewID": "R2422AQWAF7K24", "Overall": "5.0", "Content": "The Sharp Aquos Quattron LC-LE732U that I received from Amazon about 3 weeks ago was purchased to replace a Mitsubishi 73\" DLP (that died from light engine failure) has been a very impressive replacement. The 4 color picture and quad pixel technology create a great picture that is constantly modified by the TV in Auto picture mode to optimize for lighting and other factors.Watching this TV is like watching a live show, even when showing 10-12 year old TV episodes. Very impressive!I recommend this set to anyone wanting a high quality large screen television, with all of the goodies, like wireless streaming, access to Netflix, Vudu, Blockbuster and other programming souces.The only CON to report is that this set does not allow you to deselect TV Speakers and select an external A/V device.  Use of a separate A/V device simply adds that sound to the TV speakers.", "Date": "October 7, 2011"}, {"Title": "Now I Understand what they mean by Home Theater", "Author": "Business Man \"Biz\"", "ReviewID": "R3234VRGSM4FXO", "Overall": "5.0", "Content": "I have always wanted a really BIG flatscreen TV, but I was disappointed with the 60\" and 65\" TV's I had seen.  At around $3000, the price is very reasonable, and I believe the 4 colors provided by Sharp for this unit (as opposed to 3 colors for most flat screens) makes a difference.  This unit provides the color yellow as a 4th color. The picture quality is excellent, and watching a Blu-ray movie on this thing gave me an understanding of the meaning of \"Home Theater.\"  The BIG image is a vastly different viewing experience over smaller TV screens. I find the color black is achieved nicely on this set.  I don't know if the addition of the color yellow helps to achieve a deeper black color or if Sharp achieves it with some other technical inovation.  You will probably want to add some additional speakers to the TV to get the sound up to match the picture.  I chose the Polk Soundbar50 and a separate Polk Subwoofer because I didn't want to see a bunch of speakers scattered around the room.  I had a professional audio visual service assist me with the connections, and he commented independently that the picture quality was excellent, and also agreed that the price was fair for a screen of this size.I was also amazed at how the addition of the 70\" flat screen made my living room appear more contemporary. You won't be tempted to go to out to the movies as much after installing this unit.", "Date": "July 24, 2011"}, {"Title": "Aquos 70\" TV", "Author": "ScottieLV", "ReviewID": "R3KUS34VG59JBD", "Overall": "5.0", "Content": "We love our new Aquos LC70LE732U 70\" 1080p LED TV.  It has vibrant color and the screen size is great for our large great room.  The only negative we have is the built in speakers seem to be somewhat unremarkable.  We wanted a big screen, we did not want 3-D, and we got it.  Energy Star certified, Looks great.  Crisp TV picture and it hooks up to the network wirelessly.  It comes with free call in service support from SHARP.  I now have three Sharp TVs (used to buy Sony's). Great TV for the money.", "Date": "May 23, 2011"}, {"Title": "Good value for the size", "Author": "DVIC", "ReviewID": "RZO7PWXW0EYIW", "Overall": "4.0", "Content": "Purchased this a month ago from a big box store for 2100. I agree with some of the others that the picture out of the box is not Samsung quality. However, I purchased a Disney Blu Ray calibration disk and it solved my issue. It takes a bit to go through the calibration but the results are far better than the factory settings.Today, 03/07/2012, my daughter turned the TV on and then the HD DVR and no picture. After some coffee I attempted to investigate the issue. Nothing I did worked. I tried all three devices connected via HDMI with no luck. The menu worked fine and I could stream Netflix so I suspected that the HDMI circuit board was toast.After returning from work I called Sharp tech support and talked to Steve. After some flow chart trouble shooting we did a HMDI \"reset\". It turns out that Sharp TV's don't like being turned on without an input signal turned on first. Seems like a firmware issue and I would hope that Sharp addresses this issue. While not a bit deal it still was a bit of a pain, hence the 4 stars.One thing to note is that the screen is a matte finish and not the high gloss of our 52 inch Samsung ToC.", "Date": "March 7, 2012"}, {"Title": "New meaning to happiness", "Author": "Steven R. Saldutti", "ReviewID": "R27FKPLN68WE9M", "Overall": "5.0", "Content": "I decided to purchase this TV after reading the reviews on this page. The TV has not disappointed at all. The TV is very user friendly, the on screen menu is awesome, the apps are intuitive and fantastic. No Netzero lag at all like I would get at times with the wii I used prior. This replaced my 55 inch Sony Bravia. I must say I am a loyal Sony fan, and it took a lot for me to deviate from them. I was going to go with the 65\" Sony Bravia that was 2 thousand dollars more. Reading these online ratings made me change my mind, and I am glad I did. I am VERY pleasently surprised with the Sharp product, and I may abandon Sony forever, as I'm not too sure the extra coin is worth the Sony name. If you are on the fence, don't be any longer. This TV saved my life. As with any TV this size, one would think that it would have a booming sound system to go with it and that is just not the case with any large TVs in my opinion, so I took the advice of the other posters and went for a surround sound. I used a polk audio speaker system and a Denon reciever. I didn't want the surround sound, I needed it.....just like this TV. I really think getting a TV like this warrants getting a kickin' surround. Anyway, I never have to go to the movies again.The picture quality is fantastic, as if I was really there, the HD is breathtaking, and I'm in awe of it every day. People are getting tired of me saying \"would you look at that picture!\". I didn't make any changes to the factory settings at all .Pros: The price, size, pictureCons: It doesn't go to work for me or massage my back", "Date": "December 20, 2011"}, {"Title": "IT'S A BIG TV", "Author": "only1", "ReviewID": "R3I8D7UI3WI3VB", "Overall": "5.0", "Content": "WOW! This television really is the WOW factor. My biggest concern during ordering was this television is simply too large. It is not too large. It is similar to having a movie screen on my wall. The picture just pops out at person viewing. The field of depth is excellent, colors are sharp and bold. If you will be using a floor stand to mount the television make sure it is rated to support one hundred pounds or over.  The first week we used it I did not have home theatre system connected so we listened to the television speakers rather than through our sound system. I must say that the television sound was acceptable. Of course one can adjust the sound for their liking or listen to it straight from the box, as we did. Also there is a sound adjustment to use should you opt for wall mounting the unit.  This television is well worth the money spent.", "Date": "January 23, 2012"}, {"Title": "BIG, but....", "Author": "Paco", "ReviewID": "R2OBGQA6I5Y3CA", "Overall": "3.0", "Content": "I like the size and picture IF you are sitting right straight in front of it.  It replaced a 50\" plasma that could be viewed from all angles but when watching this tv from any angle other than straight on, it loses it's brightness and clarity.  It didn't look this way in the store so I'm hopeful there's some adjustments that can be made.", "Date": "January 22, 2012"}, {"Title": "New models coming soon!", "Author": "A. Express \"Acoustic Engineer\"", "ReviewID": "R36FYW0IW9N8WP", "Overall": "3.0", "Content": "Wait, wait, wait....Sharp will release 19 new models of tv's in April.  All new, less expensive and better specifications.  Prices on all existing models will drop sharply in the coming weeks.  I'd wait and that's my two cents.  I love the newer Sharps, better refresh rates and low prices.", "Date": "January 22, 2012"}, {"Title": "Great picture in 480 as well as HD", "Author": "Randy Smith \"Randy Smith\"", "ReviewID": "RT77CXMD8OLEX", "Overall": "5.0", "Content": "I couldn't believe when I bought this TV it had analog output for my old stereo.  I don't really need center, front, rear, surround, and all the nonsense.  I love my old receiver and have 2 huge speakers.  The output is the small headphones jack like you would use for your MP3 player.  All you need is an adapter to fit your stereo receiver input.  I turned it on a good action movie and WOW.  This is true home theater!  The sound was awesome.  Picture out of the box was a little milky, but got it perfect with 3 easy steps:  Bump up the backlight a little, up the contrast a little, and up the brightness a little......perfect!  Only downside I can see is it doesn't have a coaxial digital sound input.  This TV is totally dedicated to either RCA component for stereo, or HDMI for digital dolby.  Output is optical toslink or 1/8 or 3.5mm.  I have non-HD satellite.  I was expecting the picture to be terrible in 480, but was pleasantly surprised....not bad at all.  Havn't figured out how to connect with wi fi yet.  I wish the remote control would have either been universal, or better yet a learning remote for other components.  It's either Sharp components or nothing.  Out of 3 local Sears, only one would ship it free next day.  None of them would honor an online purchase.  Sears.com absolutely sucks!!!", "Date": "October 21, 2011"}, {"Title": "Fantastic Purchase", "Author": "Tara", "ReviewID": "R3KUH12RM49J46", "Overall": "5.0", "Content": "Purchase is amazing - beautiful picture. Better than the television was the service and repsonse of the vendor - Your Deal. Will recommend them to everyone and would definitely purchase through them again.", "Date": "September 28, 2011"}, {"Title": "turn off the motion enhancement setting", "Author": "Randy", "ReviewID": "RBW9MF0AEC7ZU", "Overall": "4.0", "Content": "Great tv, just remember to turn off the motion enhancement setting, this setting make everything look weird. For the price you can't find a better tv.Only problem is that the remote use the same frequency that my cable box remote, it get annoying, don't know how to fix that problem.", "Date": "January 23, 2012"}, {"Title": "Excellent Big Screen !", "Author": "J. Sheppard", "ReviewID": "R2B7O3JTFA7EIU", "Overall": "5.0", "Content": "TV arrived by truck/express in perfect condition.  Two men carted it into the house, upacked it, and checked to see if it worked.  Very easy to set up.  Plugged it in to power, inserted the HDMI cable from Direct TV and a perfect picture appeared.  Took only a few seconds to connect to my home wireless network.  The picture is bright, clear, and sharp.  I also have a Sony 55\" LCD and the picture is comparable, maybe slightly better than the Sony.  Remote works fine (although buttons are a little small for me).  I am extremely pleased with this purchase.Update: 4Dec11.  Very satisified with picture quality, etc.  Disappointed in ACQUOS Net connection because it rarely works.  Site is usually down with a message that it's \"not available, try again later\". Also have been unable to connect to my computer network to display videos, pictures, etc. The TV can see the network and files but will not play them.  Technical information on how to solve this problem is not available.", "Date": "November 23, 2011"}, {"Title": "Cannot access web browsing", "Author": "RG", "ReviewID": "RS37I0AIBS5AO", "Overall": "1.0", "Content": "I have spoken to several Sharp customer service agents. You CANNOT access web browsing-- their \"browser\" is a s***ty \"console\" that has widgets and these are the only websites you can reach.  It is a piece of s***.  I have looked online and will try to use methods \"not approved\" by Sharp to access web browsing.", "Date": "May 27, 2013"}, {"Title": "Beware the yellow line", "Author": "stfw1977", "ReviewID": "R5FYLF5X0PLJN", "Overall": "1.0", "Content": "After only 7 months a yellow line appeared down the center.  The repair people said it was the panel and that it would cost 2400.00 to fix it.  I Google d the problem and apparently several people who bought a Sharp LED are having the same problem.", "Date": "March 13, 2013"}, {"Title": "Outstanding TV", "Author": "W. Crave", "ReviewID": "R31V9O7TYLR9VC", "Overall": "5.0", "Content": "I am very glad I purchased this TV. After reviewing multiple websites and checking reviews online and going to COSTCO and BESTBUY to see the TV I decided to purchase. I am so happy with my decision. The TV looks phenomenal and the picture is beautiful. After going online and looking at picture setting recommendations on Amazon and other websites, I made the adjustments and the picture quality improved drastically. In addition, I am so glad I purchased this through Amazon as I saved a couple hundred dollars on no sales tax. Add to that my Prime membership and quick delivery and it was a steal. I saved around $300 to $400 from all the other vendors online and in stores and taxes would have been another $200 to $300. I have had this TV for a couple of months and no regrets. I did have it for the Super Bowl and I did notice a small blur when the football was in motion, nothing big and I have not tried to adjust this. It would not have affected my purchase decision. If you are on the fence about getting it, don't wait, just get it. You will not regret it.", "Date": "March 19, 2012"}, {"Title": "love my 70!!", "Author": "Sebius Millet", "ReviewID": "R3588S3VAN05ES", "Overall": "5.0", "Content": "This is our only tv in the house, placed in the basement. Add the denon receiver and Polk speakers and the whole thing absolutely rocks!! I love my man cave :) The 70 inch tv is great! When you sit far enough, it doesn't look that big. It could also be that we are quite used to it by now - have had it for almost a year now.", "Date": "February 21, 2012"}, {"Title": "Unstable pictures from program to program", "Author": "The Watcher \"B.K. consumer\"", "ReviewID": "R277NX5ER3AT4O", "Overall": "3.0", "Content": "Very sophisticate calibration systems tend to confuse the user, it will have an excellence picture in one show than it degraded in the next (in same station same day) limited on line contends On screen display is to small if you seat over 10 feet's away.", "Date": "July 20, 2013"}, {"Title": "Bigger is Better", "Author": "Cable Free Since 2003", "ReviewID": "R1Z40LCC3CYG0K", "Overall": "5.0", "Content": "Have it hooked up to an antenna and get 50 channels in HD over the air which seems normal so the tuner must be pretty good.  The picture looks good & its sure to impress anyone who sees it.  After a few years the hdmi 1 slot seems like it may be beginning a downward decent, but so far so good.  App selection was sparse & no Hulu+, but I hook a computer to the tv so who cares about the apps really.  Lots of ports, nice picture, good sound.  Wish it was wifi instead of LAN though.", "Date": "June 19, 2013"}, {"Title": "Great Quality, Simple To Use, Good Features", "Author": "Ossie Moore", "ReviewID": "R2018LKPDV92NL", "Overall": "5.0", "Content": "We love this TV for its great picture. It has a simple interface that is easy to use. That said, we do not exercise the smart TV features. I absolutely would buy and recommend this TV.", "Date": "June 10, 2013"}, {"Title": "AquosLink a pleasant surprise", "Author": "Krylos \"S.Ray\"", "ReviewID": "RYYJCAAE2XIK5", "Overall": "5.0", "Content": "Just picked up an open box 732U for 1800 at bbuy, seems like new. The price made opting for the 4yr warranty a no-brainer. Replaced a 46\" Sanyo from Wallyworld, which moved to another room. Big difference!  One big surprise is that we noticed the TV controller was causing the surround system volume to change! At first, thought it was some controller code glitch, because the surround system is a Pioneer, not a Sharp. After some experimentation, we realized that the AquosLink was communicating with the stereo through the HDMI...freaky, but good! Glad it defaulted to ON or we might never have discovered it. Makes handling the remotes a bit easier.  This is a heavy bugger of a TV, but the 46\" mount we had for the old TV matched up and is working fine.Only problem now is that there seems to be some type of feedback occurring between the sound system and the PS3 with all these goodies hooked up to the same power strip. Hopefully we're not overheating the breaker. Will try a few things and eventually we'll find a way to use all this together.  The X-gen panel is amazing, the blacks are unbelievable, love those blacks! We had to set the TV to auto-off when there is no signal, just in case someone forgets to turn it off. Its so hard to tell when its powered on. we were really tight on space and our center speaker on the mantle covers the illuminated caret (we wouldn't have it any other way!). Salesman said there is a switch to turn the caret emblem off, as well. (When did the caret symbol become a Sharp trademark?)", "Date": "May 27, 2012"}, {"Title": "So Sharp it hurts your eyes (Pun Intended)", "Author": "M. L. Knight", "ReviewID": "R3B0YKJ5QFGDX", "Overall": "5.0", "Content": "I am the Chief Engineer in a television Studio and as such I deal with HD images all day every day first generation original so it is very hard to impress me. This does. It is impressive. Hangs easily and accepts outputs from a myriad of sources. You cannot go wrong with a Sharp!", "Date": "December 17, 2012"}, {"Title": "Wow.  Just.. WOW.", "Author": "Javier Gomez de Molina \"Javier Gomez de Molina\"", "ReviewID": "R1VTZ8X1CEQ2E0", "Overall": "5.0", "Content": "The picture quality of this tv simply blows me away.  Having come from a rear projection DLP TV (with lamps buring out all the time), I find this tv to be a terrific upgrade.  Thin, light, and CHEAP!  You'll find cheaper prices out there if you dig, so dig around a bit.  I have it hooked up to Directv and the picture looks stunning.  It feels like a window to another world.  LOVE IT!  As the prices o nthe new 90 inchers come down a bit I might upgrade again!! :)", "Date": "September 4, 2012"}, {"Title": "Excellent TV", "Author": "Bxbigpipi", "ReviewID": "R24A7HQWUSAFC7", "Overall": "5.0", "Content": "I've had this tv for 9 months now and I still love it! Size is great and the picture quality is amazing!! Buy this TV now!!", "Date": "March 30, 2012"}, {"Title": "Sharp 70\" TV", "Author": "Man", "ReviewID": "RMJFCP9ZYDS9Z", "Overall": "5.0", "Content": "What a great TV! Wonderful color, great sharpness and depth of picture and no blurr. For the money, this is the best TV of this size on the market. Great job Sharp!", "Date": "March 30, 2012"}, {"Title": "Wonderful TV", "Author": "Chava", "ReviewID": "R1TV7F97XQNMLO", "Overall": "5.0", "Content": "Great television/media center.  I say that because not only is the tv set beautiful to look at but the picture and the apps are great.  Never did Vudu until I got this tv and may I say WOW.  The Superbowl will be a wonderous sight to behold this year.  GO PACK GO!!!", "Date": "January 3, 2012"}, {"Title": "Terrible TV", "Author": "Very Disppoint Customer", "ReviewID": "R27A238L9UIFY2", "Overall": "1.0", "Content": "Spend $3K on this TV.  It broke down in less than 2 month of use.  The last 65\" TV we bought before this also broke down in less than 3 years of usage.", "Date": "September 12, 2012"}, {"Title": "Can I Rate This ZERO??? DO NOT BUY IT!!!!!!!!!!!!!!!!!!!!!!", "Author": "Shannon Hall", "ReviewID": "R1BPEGLO7OEL5A", "Overall": "1.0", "Content": "We bought our LC-70LE733U from Sam's and had it for a week and a half before finally realizing that nothing we could do would make this tv look good, or even acceptible. We spent hours tweaking and trying to calibrate it, but it just looked HORRIBLE. (And yes, we were looking at HD movies and channels.) For a lot of things, it wasn't THAT bad, but every time we tried to watching something that SHOULD look good, it looked terrible. No matter what we did, everything was very pixely looking and noisy (yes, we changed the settings that were supposed to cure that.) And the motion blur... don't even get me started. Every single movie we watched, even the people who were simply WALKING across the screen, looked like they were grossly choppy. Like maybe there were a ton of dropped frames or something. And then there is the color issue. Again, no matter how much we tweaked the tv, the colors were TERRIBLE. Some movies looked ok, but most were completely washed out and where they weren't washed out, they were completely over saturated to the point of skin literally glowing. I thought for sure there was no way it was THAT bad because the tv is actually getting pretty decent reviews, but it IS that bad. Do NOT buy this tv unless you don't care what your content looks like (and if that's the case, why would you spend this much on a tv??)We took it back to Sam's, got a full refund, and then went to Best Buy, where they have a dark room set up for larger tvs in dimmer environments, which is more like what your tv will be in at home.  We saw the same Sharp tvs (same size, smaller and even the 80 inch) and they all looked SO bad that I couldn't believe we thought they looked good enough to buy in Sam's. We decided on the 65 inch Panasonic VIERA, linked here: http://218.201.42.40:8080/www.amazon.com/Panasonic-VIERA-TC-P65GT30-65-Inch-Plasma/dp/B004MME75Q (I wasn't willing to go smaller than 60 inches, because even though the Sharped sucked, we WERE used to the large size and we have a HUGE living room wall, so anything smaller looks tiny) and let me tell you... NIGHT AND DAY. I'm not even kidding. As soon as we got our new tv in the house and set the preset to Game mode (which we decided looked best) we were absolutely BLOWN away, and we haven't even calibrated it the teeniest bit yet. It IS more expensive, but we got lucky and hit Best Buy on a sale day, making this tv only about $300 more than the crappy Sharp.Long story short... don't even try it. If you want to, go to Sam's. Don't get it online because you will waste time waiting on it, seeing how awful it is, and then shipping it back.Maybe we got a bad apple and these are actually pretty decent, but I doubt it because every single one we looked at after taking ours back (when we knew what terrible things to look for) we realized they all look the same. No matter what size.Oh! There are some reviews saying the internet connection is terrible on this thing. TOTALLY true! While it does work with Netflix, it wouldn't connect with anything else properly.The Panasonic tv we got has SO many internet apps, including Amazon Instant Videos, which is great!", "Date": "January 11, 2012"}, {"Title": "Internet access", "Author": "Pankaj Patel \"Pankaj\"", "ReviewID": "R23MPYFER2NIAC", "Overall": "1.0", "Content": "We purchased this tv not only for its size but for internet access such as YouTube. Sharp does not allow the tv to do this (atleast the 70\" Quattron. I contacted the AquosAdvantage and they said this tv does not allow it, it can only go the the sites on the Apps page, you cannot load any others on it. they will not allow it! nor will they provide an update to do it. Don't get fooled because it says is has Internet Access.", "Date": "September 14, 2012"}, {"Title": "Returned it", "Author": "B. Forgeron", "ReviewID": "R2HRN5KK9EDJ3L", "Overall": "1.0", "Content": "I bought the LC70LE733U (notice the 33 not 32) from Costco.  Apparently these are the exact same TV, but the model number is different based on where they were sold from.I returned it after about 2 weeks because I couldn't get the picture quality to meet my expectations after spending over 2 grand on the set.  Sharp markets all the features on this set like 240hz, film mode, facebook and other apps, but my experience was that one of them worked very well.  I contacted them specifically about film mode on bluray and the screen panning issues where portions of the screen would be distorted and their response was that \"some people might not prefer to use film mode and you sound like someone who should disable it\".  Wait, what?  I don't want to disable it, I want it to work.  I then scoured forums to try to find the optimal settings, but none could resolve the picture quality I was experiencing (with or without film mode).  All of the internet features on the Sharp were clunky and painful to use.  Something else that really bothered me was even though it had 4 HDMI inputs, there was no way to actually label the inputs in the settings, it would only auto detect what the source was when that specific input was selected.This was the first Sharp TV I bought and it will probably be the last.", "Date": "December 19, 2011"}, {"Title": "Do Not Buy!!!", "Author": "Nickyz40", "ReviewID": "R2F195DO58JXS4", "Overall": "1.0", "Content": "I have always purchased Samsung or LG tv's in the past and know quite a bit about tvs. I decided to buy this tv directly from Sharp because of the size. What a mistake that was. I got the tv on a Thursday and after 4 days of playing with the settings and speaking with Sharp decided the tv was an absolute piece of garbage. The picture is not clear and all and the colors are not even close to being right. The faces were orange. I tried every setting possible and nothing was close. After getting fed up, luckily Sharp allowed me to return the tv as it was deemed defective. To this date, Im not sure if it was actually defective or if the picture was just terrible. On blu ray, the picture was crystal clear but regular HD channels were terrible. Upon getting the new LG 6500, all I had to do was change the setting to Vivid and the tv looks perfect. If I were you, Id go with the LG which is close in price as the picture is so much better than the Sharp. All the reviews Ive read on the Sharp were 10 out of 10 but i give this tv a 3 out of 10 bc the picture is really bad.", "Date": "February 20, 2012"}, {"Title": "Watch Out!", "Author": "Scott \"ebonmagick\"", "ReviewID": "R184ZTBPYJO7O0", "Overall": "2.0", "Content": "Got my Sharp Aquos LED 120hz tv for Christmas.  Picture was nice but it quit working after only four months.  I called Sharp and was informed the warranty is only three months.  I can't believe they get away with doing business like this.  Never again will I buy a Sharp product.", "Date": "March 21, 2012"}, {"Title": "too slow , blurry", "Author": "jay", "ReviewID": "RM8KMRJXGQYXW", "Overall": "1.0", "Content": "Had ok quality picture if on full 1080p hd channel otherwise was very poor quality and  very bad pixelation ( too slow of movement and very choppy blurry at times)  needs to be 220megaherts speed or more.  I returned it after two days and went to plasma. Bottom line  it's just too big for the slower processor and the pictures also looked unpraportionate at times. Save the money get smaller or plasma I'm not very picky its just bad, looked great in the store but its not.", "Date": "April 1, 2012"}, {"Title": "Sharp LC-70LE732U AQUOS 70\" 1080p LED HDTV Review", "Author": "Soundman", "ReviewID": "R2W0F8YEVC17NJ", "Overall": "1.0", "Content": "I saw a similar TV at Costco & thought it would be easier getting it sent to my door. At home I didn't like the TV colors so I returned it; it was a 2011 model & I had looked at a 2012 model showing animation so it looked good. I didn't realize I had to pay shipping & 20% penalty. This was the biggest mistake of my life. I was charged $400 by the store & had to pay over $300 to ship; it was in Florida!. Something that large and from so far is really stupid to buy online. I will never buy something so expensive & from so far online! I bought a Samsung 65\" from 2011 at a great discount and am happy with it.", "Date": "August 1, 2012"}, {"Title": "Great as a monster tv, but...", "Author": "Laurent Grenier", "ReviewID": "R2EGRKSP6SQY9M", "Overall": "4.0", "Content": "Hocked up to a pc, with a beast of an ATI video card, this tv is a disappointment. Nowhere near the picture quality of my 60\" Samsung, and it only works full window at its HD native resolution. Buyer beware!", "Date": "August 3, 2011"}, {"Title": "pretty dam impressive", "Author": "sharp 70\" owner", "ReviewID": "R15FKPV38EO6HG", "Overall": "5.0", "Content": "does what it shud , and well , i cant deny the 4th yellow pixel makes the yellows and blues stronger and more vibrant , then again i don have much to compare it to , theres a demo pic of a sunflower but even then the difference is minute at best", "Date": "May 10, 2011"}, {"Title": "Bad service", "Author": "Kevin Henderson \"Kevin\"", "ReviewID": "R3JQU1YIJFZAQN", "Overall": "1.0", "Content": "The service for this purchase was not that great and no point in calling Amazon but they are going to give the standard \"I'm very sorry\" line! Good luck!", "Date": "December 2, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Full HD 1080p (1920 x 1080) Resolution with X-Gen LCD panel\nQuad Pixel Technology with Quad Pixel Plus\n120Hz fine motion enhanced\nIt has USB Viewer with Music Player\nConnected TV services with Built-in Wi-Fi", "Name": "Sharp LC-70LE732U AQUOS 70\" 1080p LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41F3lrHN7jL._SX300_.jpg", "ProductID": "B004OCXGAG"}}