{"Reviews": [{"Title": "Worth every penny", "Author": "TITAN", "ReviewID": "RO6VID3318QPQ", "Overall": "5.0", "Content": "This tv is vary nice.  Looks great has plenty of ports on the back. I hooked up my apple tv, xbox, wii, and computer to it and still have an extra hdmi port. I gave the sound only 3 stars because the built in speakers are small and you will not get theater sound out of them. I truly believe everyone will get a add of sound system. I know I plan too.  However considering that For the small factory ones they are not bad.  But you do need to have this by a wall for the sound to bounce off, or the sound gets lost in the back and seems quiet.  Everything else I would say is top notch. Easily matches another brand.  I love watching old stuff on this tv Makes it look new again. My suggestion. Get it :)", "Date": "August 21, 2011"}, {"Title": "Wow is all I can say.", "Author": "Double J", "ReviewID": "R3SEOBHG15ZL60", "Overall": "5.0", "Content": "For starters there are not many features. This is a basic television. That is what I was looking for, no internet I have a tablet, computer, laptop, PS3, and smart phone for that. I didn't need 3d cause I'm not a fan. Just a great picture and no motion blur. My previous tv was a 42 inch 1080p Olivia. It was a very nice looking 60hz LCD. This RCA is amazing. I was disappointed once I hooked it up and set it up at first. I started watching my Dish Network shows and the faces of the people had noise and clutter. Not crisp. I changed the channel and the TBS station had bad color. I kept reviewing channels even my local and was starting to get concerned about my purchase. Then I went to ESPN and WOW what a picture.Next to test it more I put in a blueray movie. I was stunned at the clarity, crisp noiseless picture, and the. Color. I used to sell high def TVs and audio back in 2003. I have had a high def tv for 8 years. This RCA simply blew away my previous tv. I played some video games and there was no motion blur, and a great gaming experience. Overall I realized that the tv is so accurate and detailed is could show the weaknesses in my dish network channels that my previous tv couldn't see. Once prime time came on and the better shows actually filmed in hd versus the upscaled ones and the picture was perfect.Pros: amazing picture, top performer, extremely low cost.Cons: a little light bleed from the LEDs around the edges based on viewing angle. If you sit right in the middle it is flawless, off to the side and if your looking for it you can see the edge lighting in spots.I would not hesistate to buy this tv. I researched for 3 months before buying this one based on features, price, and a prayer. They all worked.Update:  I feel strongly that this is a great tv, but the led bleed was starting to annoy me.  So I returned the tv.", "Date": "October 26, 2012"}, {"Title": "RCA Review", "Author": "Kenyal", "ReviewID": "R3E4OPOGX5BFL3", "Overall": "5.0", "Content": "The price and size of the RCA LED46A55R120Q caught may eye when I was on Amazon looking for a television. I Knew that RCA was a good brand and I also knew that they were around for some time. But this RCA LED46A55R120Q is a cut above the rest, the picture quality is second to none, I love the color and the shape of the television, I didn't think that it would be that thin my friends are all freaking out on this television. I am using a surround sound system on this television and it is sounding very good. I am a gamer the PS3 games looks really good on this television and the sound and refresh time on the television is really good. I would tell my friends to get this television its value for money I think that this was my best choice for 2011 so far. Thanks Amazon and RCA for this television and its price.", "Date": "November 2, 2011"}, {"Title": "Fantastic TV!", "Author": "Thomas C. Vance \"The Man with the Plan\"", "ReviewID": "REFBIGOUS1HWH", "Overall": "5.0", "Content": "This TV is great. The picture is nothing short of divine. 4 HDMI ports is very nice...honestly I can't get over the picture. LED is SO nice...Highly recommended.", "Date": "September 23, 2012"}, {"Title": "So far, so good", "Author": "Larry Banks", "ReviewID": "R3EO3C1TR03J6O", "Overall": "5.0", "Content": "so far the tv has met all expectations. i couldn't be happier, setup was easy picture quality is excellant sound not an issue.", "Date": "September 17, 2012"}, {"Title": "Very happy with Purchase", "Author": "Lysander Spooner", "ReviewID": "R10W29MP3DMCH", "Overall": "4.0", "Content": "This HDTV is everything I expected: great picture and look but poor audio quality.  However, I knew this going in and have the audio going through a separate system.  The higher refresh rates really enhances the viewing of sports and other action.  I highly recommend the TV but be sure to have another way to project sounds.", "Date": "October 30, 2012"}, {"Title": "Good for the money-", "Author": "frostymxz", "ReviewID": "R15QZWQDQXZ7PI", "Overall": "4.0", "Content": "Only have had it for a few days- my only gripe is the sound from the speakers in the tv stinks. If you have a surround system or a soundbar it is not an issue. for the money I am very happy.", "Date": "September 18, 2012"}, {"Title": "LOVE IT!", "Author": "Akiva Fleischmann \"Bitzy Bucktooth\"", "ReviewID": "R3872PS8KG73J3", "Overall": "5.0", "Content": "OK, I've only owned this for a day, but I will come back and Update if anything changes.I LOVE THIS TV!!!Great pciture, great price, what more could you ask for? The big thing for me was HDMI ports. This TV replaces a 32 Inch Samsung from 2008 which is still in perfect condition but we needed a bigger one and moved the Samsung to the workout room. When I was shopping for the new TV, every time I got wooed by a Samsung, I would be discouraged by the fact that it only had two HDMI ports. What gives, Samsung? My 2008 TV had 3 and now you're only putting two on most of them? So even if everything else looked good on the specs for the TV, I would balk at buying it because I am not interested in using an HDMI switcher.So the RCA looked great on paper, reviews looked good, and I got it, installed it, turned it on, and...WOW. Picture is great, my XBOX games look phenomenal, Monday Night Football was so awesome, and movies looked great! Planet Earth and Life on the new TV blew me and my wife away!A couple of notes:USB Input: Only for pictures and music, NOT video. But this is not a con for me since I have had the ASUS O!Play - TV HD Media Player (Black) for a few years now to play video files. (BTW, that works flawlessly as well - go read my review on that too: http://www.amazon.com/review/RZ1RUR3T8VN6M/ref=cm_srch_res_rtr_alt_2)Sound: Haven't even bothered checking that, since I used an A/V Receiver with Speakers for my TV audio. I know other reviews have said sound is bad, but again, that is not a con for me since I never intended on using the built-in sound.Screen Fill: For TV from Dish, all my HD channels fill up the entire screen, like ESPN, news, etc. Movies from my O-Play are letterbox and don't fill up the screen, or even make it all the way to the side panels. This is not a problem, this is just the way it is, letting people know in advance. You can zoom in on your movies if you want to fill the whole screen, but you'll be missing some of the actual picture when you do that. XBox games fill up the whole screen.I LOVE THIS TV. No complaints. You might be able to find a better deal for a better TV on Black Friday or something, but I vowed to myself to never again wait outside a store like a bum since the time I did it for my Xbox. I felt like a horrible, scum of the earth person sitting in a line with a sleeping bag like that. No offense to anyone else who does that though.... :)", "Date": "November 13, 2012"}, {"Title": "RCA 46\" TV", "Author": "CW", "ReviewID": "R2GX6QU2OUEFB3", "Overall": "5.0", "Content": "My daughter won this TV in a raffle.  I thought it would be junk -- but nothing could be further from the truth.  We have two top of the line Samsung TV's and the picture on this TV is right up there.  This TV cost 1/4th as much as the Samsung's we have.... (but to be fair I am sure prices have dropped on those also over the last few years).I would recommend this TV as a value buy.", "Date": "November 25, 2012"}, {"Title": "Good value....if it arrives in one piece.", "Author": "K. Sims", "ReviewID": "R15Z7C2WOIVSWA", "Overall": "3.0", "Content": "We ordered this tv because of the great value.Our thoughts:The bad:1.  The sound quality is lacking.  Music and sound effects were really loud, but then voices were almost inaudible.2.  The stand that comes with it is AWFUL and very cheaply made!  It would be fine if it was being wall-mounted.The good:1.  Visually, it had a stunning picture.  Lots of settings to tune the display to your liking.2.  The tv is not heavy.  It's quite easy to move around.3.  It's very thin.A WARNING:Amazon does not use any extra packaging material on this product.  All they do is slap on a sticker on the outside of the box the tv comes in and send it off.The first television we received, the box was in horrible shape when we got it (it came Fedex).  We sent off for a replacement because there was something not right with the tv. When we got the replacement (it came UPS), that box was badly damaged as well.  When the box was opened, there was visual damage to the tv, so we returned it and bought a tv from a store we could visit.", "Date": "November 19, 2012"}, {"Title": "Good TV but bad response time.", "Author": "Dustin Pettigrew \"Dust Storm\"", "ReviewID": "R2SMTKDUN6KFUM", "Overall": "3.0", "Content": "I bought this TV for my living room where I planned on entertaining guests and playing video games including first person shooters.  The response time advertized is completely wrong.  I personally clocked the response time at 150ms and not the 4.5 as advertised.  I do like the simplicity of not having to worry about apps, but one of the main selling points was the response time, which was falsely advertized.", "Date": "February 2, 2013"}, {"Title": "RCA LED46A55R120Q 46-Inch 1080p 120Hz LED HDTV", "Author": "Artman \"MasterOfReality\"", "ReviewID": "RQ2VU9HXUGPV5", "Overall": "5.0", "Content": "For the money this may be the best TV out there.Got this in the end of Oct or beginning of Nov 2012 and didnt want to write a review until now.I have had no problems whatsoever.Picture is amazing.Refresh seems great;No blurryness.The one thing that isnt so great on this tv is the sound.It gets loud enough and gets the job done but just doesnt sound good.For how thin this tv is you are not gonna be able to get decent speakers in there.I went to WM and got a refurbished Vizio soundbar for $60.They have it online too.It has 4 3\" or 3 1/2\" woffers and 2 tweeters.Has an output for a sub too which I havnt even done yet but it sounds great.Made all the difference in the worid.Anyways the TV is highly recommended.I will update if it takes a s#%! anytime soon.Hope this helped!! Feel free to ask any questions or comment.", "Date": "January 17, 2013"}, {"Title": "Nice bright picture, but no true black screen", "Author": "Alex Sadowski", "ReviewID": "R1N3IE2NZPEY8", "Overall": "3.0", "Content": "Excellent price for such a large LED TV ......... however, you do pay for that in the dreaded \"flash light\" effect. Very easy to tell where the backlights are placed when viewing movie w/shadow boxes or dark scenes.  Adjusting the brightness does not help;.  Exellent in HD and very bright screen. Very light and thin!", "Date": "December 12, 2012"}, {"Title": "This TV is great", "Author": "Kenneth L Johnson", "ReviewID": "RAZ7PFV4UQTW7", "Overall": "5.0", "Content": "This TV is great.  Super clear picture, always fills the screen without pushing buttons and the channel line-up from basic cable is great with both analog and digital in sequence.  The sound level does jump up and down on different channels but manageable.  We have a Roku box so Netflix is no problem and again great picture.  Its in the bedroom and we find ourselves going to bed earlier just to watch movies.", "Date": "November 29, 2012"}, {"Title": "Very Good TV", "Author": "E_Rob", "ReviewID": "R36OWWFEEFD3M8", "Overall": "5.0", "Content": "I was looking for at least a 46-47 in tv and decided on a LED lit screen instead of the flourescent bulb lit screen. I did not want to spend more than $500-$550, after alot of looking I came across this one.  I knew RCA had a good name and had been in business forever. I originally looked at Vizio, I have purchased a smaller screen size version and it has been great but for the size I was wanting the price was prohibitive. All of the bells and whistles pertaining to internet access was not that important to me, didn't want 3D and I'm not a gamer so the RCA was it. And the price was great. I actually purchased a Sony Blu Ray player with Wifi built in, along with this tv, for the same price as the Vizio tv alone.  Now to the tv itself.  Great picture!! Great features!! Easy to set up, easy to use. The only negative is the sound - like all of the these tv's the speakers are small and that means small sound. Fortunately I have a surround sound so I ran the tv thru that and it is great. Over all it is a good buy and I don't know how anyone could find a better deal. Hopefully it will last for several years.", "Date": "November 29, 2012"}, {"Title": "Impressed!", "Author": "Matt M.", "ReviewID": "R2FRHO5NQHGB4H", "Overall": "5.0", "Content": "I've had the TV for nearly two weeks now and I'm very happy with my purchase.  I feel like I should have paid more for it.  I've had absolutely no technical problems at all.  All of the ports I've tried work and the display is absolutely beautiful.  My only complaint is that the speakers on the TV are a bit weak, but frankly I expected that.  I'm going to purchase some kind of sound system anyway.  Strongly recommend.", "Date": "November 21, 2012"}, {"Title": "Great picture for the price", "Author": "Paul", "ReviewID": "R14V1OYMC1009S", "Overall": "5.0", "Content": "I purchased this TV in September of 2012. I have a Blueray player, Roku box, Wii and Standard cable connected to it.Pros: Great picture. It's comparable to high end displays. Plenty of ports. I have connected all my components to it and we have ports left over for temporary items like computers or video cameras.Cons: Audio is weak, this is a known issue. Sound is adequate for my sons cartoons but when watching movies, I turn on a sound bar I connected.Overall it has been a good purchase. I see this TV listed as a lower price for some Christmas sales. I would consider it a great buy for those prices.", "Date": "November 15, 2012"}, {"Title": "Great Value", "Author": "Kathy R", "ReviewID": "RHTWUFTE2UN2W", "Overall": "5.0", "Content": "I purchased the RCA 46\" LED tv about a month ago for my bedroom.  It works great!!  I think the picure is great and it is easy to use.  I am very happy with the tv.", "Date": "November 5, 2012"}, {"Title": "Good Led TV", "Author": "Johnny", "ReviewID": "R2IDSW0RXVC5VG", "Overall": "4.0", "Content": "The TV is worth the money, the TV has been up on the wall for two weeks now and the picture is great and the sound is awesome.  I have no cons on this TV, just that for the price it's worth the money.", "Date": "October 25, 2012"}, {"Title": "RCA Made An Amazing LED HDTV!", "Author": "Gandalf The Grey \"Gandalf\"", "ReviewID": "R3VLEIJ05OLKPM", "Overall": "5.0", "Content": "RCA makes an amazing LED HDTV.  It looks so real you think you are watching a live performance.  This model replaced a 42\" LCD I had and believe me it makes a huge difference.", "Date": "December 3, 2013"}, {"Title": "Great value and quality", "Author": "Alan Konitzer", "ReviewID": "R2P0J95LWZN1FC", "Overall": "5.0", "Content": "I have owned many RCA electronics and have always been happy with them. This TV is no exception. They said there was a newer model available, vut this has all the features most would need. The picture is just so bright and clear, there are 4 HDMI inputs plus USB and other inputs and outputs. It worked fine right out of the box. I let it run a few days before I was going to make my personal adjustments, but I never had to change any settings. The sound quality is not that good, but most will use an external sound system like I do. It is very thin and meets all of my expectations.", "Date": "May 29, 2013"}, {"Title": "Great Tv for the price", "Author": "Pen Name", "ReviewID": "RJMVIB1NZLJSW", "Overall": "4.0", "Content": "what can I Say this tv is a good deal for the price. nothing fancy just a good tv. Although there are better tvs coming down to this price level.", "Date": "May 7, 2013"}, {"Title": "Excellent value", "Author": "Evincing", "ReviewID": "R1033SIWF1SQZU", "Overall": "4.0", "Content": "I purchased this television for use with an Xbox in my kids' playroom, so I didn't want to spend a fortune.  I was very pleasantly surprised with the quality of the picture.  Although not quite as good, it compares favorably with the more expensive TV that I have in my living room.The room that I have this TV in is flooded with natural sunlight.  No problems with annoying reflections.", "Date": "April 3, 2013"}, {"Title": "Great Value- Fast Shipment", "Author": "Jonathan Bowman", "ReviewID": "R17S2ZV1MURUN0", "Overall": "5.0", "Content": "Excellent Product- Fast Shipment.  A+++++++++Great value.Excellent Product- Fast Shipment.  A+++++++++Excellent Product- Fast Shipment.  A+++++++++Excellent Product- Fast Shipment.  A+++++++++", "Date": "March 18, 2013"}, {"Title": "Truly Stunning", "Author": "Elizabeth Hawkenson", "ReviewID": "R1EUU921BL4JMB", "Overall": "5.0", "Content": "This television is more than I anticipated. It is so thin and has a beautiful screen. I don't know what all the complaints about the base are about, ours was just fine. It does need supplemental sound, for sure.", "Date": "March 13, 2013"}, {"Title": "Nice Basic Television", "Author": "J. Hummel", "ReviewID": "R1IA38AU6P3LK9", "Overall": "4.0", "Content": "I've had this television for four months.  I mostly watch movies and play video games but have occasionally hooked up my computer to it to surf the internet.  Overall I've been immensely happy.  I should note I actually bought it through Wal*Mart not Amazon only because it was cheaper (holiday sale) and I could get site to store free shipping.  I intended on buying a TV that was smaller than this but this one was cheaper than the smaller one.  I couldn't resist and I've been happy I didn't!My Out of the Box Review:Straight out of the box I was happy with the look of it and the packaging was decent enough that I was relatively sure it had survived the trek from site to my store and then to my home.  I was surprised at how light it was too.  If my arms were a bit longer I could have picked it up by myself but considering how large the screen is, it did take two of us to maneuver it out of the box and gently onto the floor for assembly of the stand.  Here is where I will be critical...The stand base is NOT good and the assembly was difficult.  First off, one of the rubber plugs on the bottom was missing. Then we found it was difficult to attach as it involved balancing the screen upside down, while one of us held the base in place and the other used a screwdriver to secure it.  This was definitely a two person job.  The screws also didn't seem to fit well and it took quite a lot of force to get them in there securely.  After all that I assumed it would be pretty stable considering how tightly it was attached.  I put a piece of firm foam under the edge to serve as the missing rubber plug and we set the TV on my entertainment stand.  It wobbled dramatically from the joining section of the base so we figured we hadn't attached it correctly.  So we inverted it again, removed the base and reattached it.  It was better this time.  It still wobbled but I didn't think it was going to fall over.Attaching my devices and theater system was easy.  There are plenty of connections on the back and they are all well labeled.  This is a basic TV, no big features or internet connectivity which is exactly what I wanted.  I have a great home theater system that does all that so all I really wanted was a nice screen to connect.  I definitely got that!  To test I stuck the movie Avatar in because I knew it had rich color and fast movement.  I wanted to test how it looked and see if I could spot any missing pixels or cloudy areas which other reviewers have complained about.  It was perfect!  I also tried it with several of my video games and was impressed with how well it handled the deep darks and motion.  If you're a hard core gamer you might not be impressed but it's good for the average gaming experience.  I haven't noticed any LED bleed either as other reviewers have stated.As stated by many others this television has rear facing speakers and like most flat screens they aren't very powerful.  I wasn't expecting them to be as this is pretty typical.  If you have a smaller room put the TV next to a wall and it will help reflect the sound back out to you.  Or if you have a few bucks invest in a bar speaker.  Overall the sound with the built in speakers wasn't bad, just a little less impressive.  If you're thinking of buying a flat screen TV just be sure to factor in that you'll probably want a bar speaker or other sound system.Overall I've been very happy with my purchase.  If they could fix the stand I'd give this a 5 star rating.Other random things reviewers complained about:Response time is fine.  Yes it takes a second (maybe two) for it to turn on...but to be honest, if you're so impatient you can't wait a few seconds for your television to turn on...you have bigger problems.", "Date": "March 12, 2013"}, {"Title": "Love this TV", "Author": "Mark G", "ReviewID": "R37JQOWVL3TI3", "Overall": "5.0", "Content": "This TV shows great, and works great. I haven't had any problems, the connection is simple as it has so many inputs. I would definetly recommend it. I do suggest prospective buyers get a surround sound system to really enjoy it however.", "Date": "February 25, 2013"}, {"Title": "thanks", "Author": "linda Anderson", "ReviewID": "RLTY54WR235ES", "Overall": "5.0", "Content": "The item came very fast...faster than expected and all worked just fine.  That is always good to have happen.  Thanks.", "Date": "February 3, 2013"}, {"Title": "GReat tv", "Author": "K. Spurgeon", "ReviewID": "R37GRY0FLZAMKE", "Overall": "5.0", "Content": "This tv is great. crisp bright picture and sound is good. Using it as our second TV in our basement. Nothing too fancy just a regular tv, just what I wanted. and the price was awesome!", "Date": "January 14, 2013"}, {"Title": "Quality for good price", "Author": "Ann Vande Zande", "ReviewID": "RURDKUTULWZOA", "Overall": "5.0", "Content": "This tv is amazing! We have had no problems with it and everything works great.Pros:4 HDMI portsSUPER ThinEasy to move aroundCons:Wide edge around screen.Base seems a little wobblySpeakers aren't that good, but no tv speakers will stand up to a stereo anyway.", "Date": "January 4, 2013"}, {"Title": "Enjoying it", "Author": "Jeff Copelan", "ReviewID": "R1ZWFD77A5CSFQ", "Overall": "4.0", "Content": "Great size, and picture quality! Works well on the stand. Wish the sound quality was a bit better, but it's okay.", "Date": "January 2, 2013"}, {"Title": "kids love it", "Author": "Debra M. Mcmullen", "ReviewID": "R3A5LT7L0GZNEG", "Overall": "5.0", "Content": "great picture and kids love the bigger size, it makes watching movies more enjoyable and much easier to see from across the room", "Date": "January 1, 2013"}, {"Title": "A real Black Friday deal", "Author": "Andrew Nash", "ReviewID": "R1LAGGMUUOQWX5", "Overall": "5.0", "Content": "This TV is fantastic.  Excellent picture quality, slim design, and no \"light bleed\" even when watching from an angle.  Product did have to be shipped two times however.  The first shipment had a badly cracked screen.", "Date": "December 31, 2012"}, {"Title": "Great", "Author": "Karen VanSickle", "ReviewID": "R1KW230PPD4RX8", "Overall": "5.0", "Content": "Nicest TV we have ever had. Easy for us to set up and we get a great picture.  We did not need a lot of extras so this TV is perfect for us.", "Date": "December 30, 2012"}, {"Title": "Better than expected", "Author": "Robert Sills", "ReviewID": "R3O426QCCU0HE6", "Overall": "4.0", "Content": "This was better than expected for the price, especially before the Black Friday limited offerings.  It is our first LED flat panel and I am extremely satisfied.  I have hooked ours up to a home theater system so that the audio can match the picture quality.", "Date": "December 30, 2012"}, {"Title": "Good TV with Fast Delivery", "Author": "Thomas O. Klomps", "ReviewID": "R3KQWJCNE50CM1", "Overall": "4.0", "Content": "Great picture and sound quality.  Only negative is how slow it is to turn on compared to the other sets we have.  Would like to see manufactures to include adaptors for wall mounting brackets.  Had to wait another week to use set till adaptors came in", "Date": "December 29, 2012"}, {"Title": "so far it is very nice", "Author": "paul d duncan", "ReviewID": "R1Z4FRAOBL7R90", "Overall": "5.0", "Content": "bought this tv a few months ago and i see that it is doing very well.it has a nice picture thru my sat/tv and the HD is very very good.i do not see any problems.i have run my audio out put(on tv) thru my h/o(high output) book shelf stereo/aux jack and the sound is great.the tv speakers are okay by them selves but the movie experience w/stereo is very good.", "Date": "December 27, 2012"}, {"Title": "Great TV for the price", "Author": "Karen B. Simms", "ReviewID": "R37JLCAM53GAX7", "Overall": "5.0", "Content": "This is a straight forward TV with none of the unnecessary bells and whistles. It was easy to set up and has great picture and sound, and it's a brand I trust.", "Date": "December 27, 2012"}, {"Title": "Excelent Tv for the Price", "Author": "Jhoswarth Masson", "ReviewID": "RX3F55M4IT3G", "Overall": "5.0", "Content": "i love this tv, excelent quality for the price, the sound could be better but i you have a home theater dont worry its a plus, it came perfectly, so i recommend this, the picture is great and perfect for a console (xbox 360 , ps3) this thin tv is perfect for a room..", "Date": "December 23, 2012"}, {"Title": "Excellent Flat Screen", "Author": "PQ", "ReviewID": "RWXJ6EO08760L", "Overall": "5.0", "Content": "Excellent flat screen - very thin and barely projects out from the wall.  The sound is good for a TV, the colors vivid and picture clear.", "Date": "December 22, 2012"}, {"Title": "Totally satisfied", "Author": "Paul Cusson", "ReviewID": "R23FOA8HUDHY8V", "Overall": "5.0", "Content": "First unit arrived damaged... no hassle to return it... replacement arrived within days. This TV is great... picture is crisp and clear,sound is very good. We're very satisfied with this unit so far.", "Date": "December 21, 2012"}, {"Title": "5 stars", "Author": "caleb johnson", "ReviewID": "R2O12FVW3MD3AQ", "Overall": "5.0", "Content": "It works great, has a good picture and no functional problems.  I was very happy with the tv and would suggest it to anyone.", "Date": "December 18, 2012"}, {"Title": "Best purchase I have ever made!!", "Author": "Lanie", "ReviewID": "R1YW07TR4GDRW0", "Overall": "5.0", "Content": "WE love this TV!  It has a crystal clear picture and it's the perfect size for my living room.  I have always purchased RCA TVs because I have never had a problem with them.", "Date": "December 18, 2012"}, {"Title": "Best.  TV.  Ever.", "Author": "Matt R", "ReviewID": "R50LMNCMN4QGY", "Overall": "4.0", "Content": "For the Price, this TV is amazing.  Super high quality, ATSC tuner for HDTV Antennas works awesome, and the software built into the TV is great.  The picture is so much clearer than other TVs I have had and do have.  Tempted to buy one or two more for the future - this TV is that great.********Edit*******Speaker quality leaves a lot to be desired.  You need a separate speaker system for this TV, the sound quality is noticeably bad.", "Date": "December 8, 2012"}, {"Title": "Excellent, except for mouse lag", "Author": "Jodaci", "ReviewID": "RV5NSGULBLLEA", "Overall": "4.0", "Content": "This is an excellent television, looks and works great. Had to replace the first one I got due to a broken sub-woofer, but both televisions have slight mouse lag when connected a computer through HDMI. A minor drawback, only consequential if you have plans to use this television as a computer monitor for any sort of mouse performance work like gaming, for use as a monitor to play videos and such, it still works very well.", "Date": "December 7, 2012"}, {"Title": "Great Price TV", "Author": "Suzie Williamson", "ReviewID": "R2FGAOFQ2DEF34", "Overall": "5.0", "Content": "Was looking for a reasonably priced 46\" TV. Found this RCA, ordered it, and am now enjoying it. The picture is great and it does everything I want it to do.", "Date": "December 6, 2012"}, {"Title": "Satisfied- especially for the price", "Author": "T. Dugar", "ReviewID": "RP3NPU1OL5N54", "Overall": "4.0", "Content": "I am neither a videophile nor an audiophile.  In fact, I'm not really sure those are actual words.  However, this TV is pretty much what I expected.The pros?  The price was great and it does everything it should (deliver quality TV programming to my living room). It also has the added bonus of a swiveling base.The cons?  The base feels a little flimsy- I'd feel more confident if this was mounted on the wall.  Also, I don't think the sound is that good- you might want to do a sound bar.  However, it works great for my purposes.One more irritating thing is that when you press power, nothing changes until the screen comes on.  That takes about 5 seconds.  Irritating because that 5 seconds can be an eternity wondering if you actually pressed the button far enough, and you very well might press it again and turn it off without knowing it.  Most other TVs will at least have a light or an indicator that shows up.Just my thoughts!  Overall I'm very pleased.", "Date": "December 5, 2012"}, {"Title": "looks great on my walls", "Author": "lynn hjelte", "ReviewID": "R1SC1H3VKTL7EQ", "Overall": "5.0", "Content": "the tv looks great on my wall and we had a greycup party with many friends to watch it .", "Date": "December 4, 2012"}, {"Title": "Better than anticipated", "Author": "Pablo", "ReviewID": "RZOSK0I302KF4", "Overall": "5.0", "Content": "I've been using this tv for about a week now and I don't have anything to complain about. I've read some people mentioning the tv's poor sound and I have to recognize that it's not the best, but I've yet to find a flat screen tv with sound that satisfies me. Best thing to do is connect your own sound device (you can even plug in your computer speakers as the tv comes with a headphone jack).Picture is crystal clear and i don't notice any blurriness. Very good product for its price.", "Date": "December 1, 2012"}, {"Title": "Nice Tv", "Author": "Ronnie", "ReviewID": "R2ZFJDT82QB0NL", "Overall": "5.0", "Content": "I got my tv in 3 days... is a verry good and nice quality tv... colors are good and sharp i will recommend this to any 1 i have no problem.. i connect my pc to the tv to see all my movies jejejejej  sound is good  i love this tv ...... money was well spend", "Date": "November 30, 2012"}, {"Title": "Amazing Picture!", "Author": "Eric", "ReviewID": "R2Z06C0G0CFNVQ", "Overall": "5.0", "Content": "I had a Sony Bravio 40\" TV before this. It was a top of the line TV in 2006. I figured it would be pretty much the same, but I was naive.  Extremely naive.  This has an awesome picture.  I thought I knew what a high def picture was.  I did not.  It looks like the stuff on the screen is in the same room.  Its really good!  For the price, I don't know how you could do better.  You should consider this TV.  I am sold.", "Date": "November 18, 2012"}, {"Title": "NOT CHEAP \"A GREAT INEXPENSIVE T.V.\"", "Author": "Rockford \"TheRockfordFiles\"", "ReviewID": "R2LJY3M1CLD3CD", "Overall": "5.0", "Content": "First off I hear  a lot of complaining concerning speakers. Well peopleyou are not going to get STEREO quality with little speakers but the onesthat come with it do the job and are not bad at all! This TV has plentyof ports to hook up your WII, X-BOX, COMPUTER, ETC... And like onereviewer said you have one left over. The picture is STELLAR and it's asnap to put together. You cannot beat it for the money and the size isgreat for a bedroom television. Some would say too big. But I was alwaysthat kid who sat close to the movie screen. I like a BIG picture.I put in some 70's tv shows on DVD and the picture is crystal clear.What they say about an LED and a Blu Ray player making the picture betteron regular DVD's is right on! For the money you won't find better andAMAZON is AWESOME when you order through them! Any problem return it! Theyalso offer an extended warranty you can't beat! 5 STARS. I have to sayany negative reviews has to be from people who don't take advantage of AMAZONPRIME or going through AMAZON period. And what's easier then packing itup and having someone pick it up and return or exchange it for you. So youwhiners need to STOP whining! ENJOY THIS STELLAR viewing experience!", "Date": "November 26, 2012"}, {"Title": "Great value....great tv", "Author": "Alice L. Durbin", "ReviewID": "R26FX0GPWBNBGB", "Overall": "5.0", "Content": "Just got my new TV last week and am very pleased with the performance and picture.  Great value for the price!  Of course always great service from Amazon.", "Date": "October 15, 2012"}, {"Title": "Please don't waste your time", "Author": "Thornbridge", "ReviewID": "R28TWSEID3V0K9", "Overall": "1.0", "Content": "I think this is the first review I've ever written. I feel compelled to do so because I know how heavily I rely on the reviews of other Amazon users.Despite all the good things I'm sure this TV possesses and the success and happiness the other reviewers have found with the item, I'm incredibly disappointed. I received the first unit (refurbished) 2 weeks ago. The unit lasted about 5 minutes before it turned itself off and wouldn't work anymore. Bad component parts. I filed a claim and got a second set delivered to me. Upon setting this unit up today and spending over 3 hours calling tech services, reading forums, and frankly pulling my hair out, I've learned the HDMI ports on the television are non functional. I've had to contact ON CORP (manufacturer) and am having replacement parts shipped out then calling a local tech to install them. So hopefully once that whole process in completed the part will work and hopefully last. All said and done it will be a 3+ process and 2 TV's later just to hopefully have a working piece of equipment. I write this to you all as a fair warning. It doesn't matter how pretty something is, or how great the price might seem, if the product doesn't work then it's not worth it. Do not buy this unit. Pass it by. Do more research. Don't make the mistake I did, don't be afraid to spend a little more to get a quality product, because this unit is anything but that.Update (A few days later): Not having known this at the time of the initial review, I'd also like to add the speaker quality is horrible. One of the speakers crackles very badly while listening to music on anything over volume level 5. Volume level five on this set is barely audible. So to re-make my original point, DON'T BUY THIS TV.", "Date": "November 20, 2012"}, {"Title": "Damage", "Author": "Stephen Juliano", "ReviewID": "R1BYJ4EO71V30L", "Overall": "2.0", "Content": "This item was significantly damaged when taken out of the box. On the upper right side of the TV there is denting on the metal a chunk of the plastic broken off and a long crack running down the front. The TV works fine, but the damage is ugly and not what I paid for.", "Date": "December 9, 2012"}, {"Title": "If it came in one piece it would have been nice", "Author": "Jennifer Lee", "ReviewID": "R2CMUHW0EV6M1U", "Overall": "2.0", "Content": "After researching a 46\" TV and price I was looking matched the RCA TV.  It's not bad for price and quality.  However, I noticed when I opened the box that there was a crack and a big chip.  This probably happened during the warehouse stage or shipping,  Anyways I returned it and ordered a new one.  Lets see how the new works.  I heard many horror stories about not buying big electronic through Amazon or other on retailers, it;s just time consuming.", "Date": "December 13, 2012"}, {"Title": "Broken", "Author": "Stacy", "ReviewID": "RDB5FVN8G2PVK", "Overall": "1.0", "Content": "This was the worst thing that I have purchased on Amazon by far. The tv came on my birthday and I was very excited to show it to al of my friends and watch movies on it. But after I looked in the box the Tv was broken. #DisappointedBuyer", "Date": "January 13, 2013"}, {"Title": "It arrived broken.", "Author": "Bibiana Robles \"practical mom\"", "ReviewID": "R1JFD0A8DJKCL3", "Overall": "1.0", "Content": "It arrived on time but the box was in bad shape. The tv looked really nice but when we turned it on it had a vertical crack on the screen so we send it back.It was dissapointing so I think we'll buy things like that right from the retail store.", "Date": "October 18, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "46-inch LED HDTV with Full HD 1080p resolution, 16:9 aspect ratio\nLED backlighting for brilliant picture, energy efficiency, thin form factor\n2 x 8W speakers, seven-band EQ, virtual surround sound mode\n4000:1 dynamic contrast ratio; 450 nit brightness; 4.5 ms response time\nFour HDMI ports for your high-def sources; VGA input for use as computer monitor\n4 HDMI Input\nDigital Noise Reduction, Component, VGA, AV input\nResolution: 1920 x 1080, Contrast: 4000:1, Brightness: 450cd/\nResponse Time : 4.5ms, Digital 3D Comb Filter\nTuner Mode: ATSC/NTSC", "Name": "RCA LED46A55R120Q 46-Inch 1080p 120Hz LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41eroO4cAGL._SX300_.jpg", "ProductID": "B004PGM9YK"}}