{"Reviews": [{"Title": "Excellent TV", "Author": "Amazon Customer", "ReviewID": "RUA1FI2UAI5HM", "Overall": "5.0", "Content": "The television installed very quickly and easily and everything worked beautifully. Sound from the TV is great with 10W total output. Picture quality is also superb. (Aside from specification of 720p, elsewhere online specs also indicate a resolution of 1920 x 1080, and a maximum resolution of 1366 x 768.) Picture size can be manually adjusted using the remote control. A DVD inserted into my DVD player connected to the TV via HDMI cable was recognized immediately with no need to switch manually.I also wish to be able to view the contents of my computer on the television. I have owned a Toshiba LCD 20\" TV from around 6 years ago and was very pleased with it, including being able to attach a notebook to it (via VGA or HDMI cable). Hence, despite the problems encountered by one of the other reviewers on connecting a computer, I remained optimistic and went ahead and purchased this newer, larger one from Amazon. I was not disappointed. I connected a notebook (running Windows 7 Professional Edition) to the television via an HDMI cable, and the television recognized my computer instantly. The desktop displayed and a test sound file came through loudly and flawlessly from the television's speakers.I am very pleased with the purchase of this television -- slim (1.9\" deep, lightweight (23 lbs.) and very reasonably-priced, with input capabilities that are especially important to me (e.g., HDMI, VGA, USB input). Highly recommended.", "Date": "August 19, 2011"}, {"Title": "Nice TV But...", "Author": "Beachy Keen", "ReviewID": "R2209KO9NRRYJL", "Overall": "3.0", "Content": "This TV has good features and was easy to set up. My previous TV was over 20 years old so I bought a new TV for a larger screen and better energy efficiency. My only regret is the TV's sound quality. It sounds like a tin can. I can probably hook it up to my stereo and get better sound quality, but I didn't expect (or want) to have to do that. I guess with all the sales of home theater sound systems, the TV manufacturers are skimping on the TV speakers.", "Date": "October 26, 2011"}, {"Title": "Great television set, very good price", "Author": "A. F. Nazar \"theothermaine\"", "ReviewID": "R2KG88RW21Q7XZ", "Overall": "5.0", "Content": "My old TV was fried by lightning the other day. When I couldn't replace it with the newer model in the same brand, the sales person suggested this Toshiba. The set sets up easily even though the manual is lacking in instructions for using a satellite receiver. I exited the setup menu when it asked whether I wanted to run a setup for cable or antenna and selected HDMI1 which was my satellite receiver as input. A quick reprogram of the DirectTV remote and I was done.I'm a photographer using high end equipment and software. My standards are high. Toshiba meets those standards as well as any television I've seen. I would recommend it to anyone wanting a 32 inch HDTV.", "Date": "August 4, 2011"}, {"Title": "I got a lemon", "Author": "upnup", "ReviewID": "R2QJCH1YMC38E9", "Overall": "1.0", "Content": "I usually read through the reviews and select what I feel are valid reviews. I also don't usually write a review but thought this time I had better just in case there are others experiencing what I did.Bought this TV from SEARS back in August 2011 and by December had 2 green vertical lines running down the screen.  Toshiba's tech support determined it needed a new screen and had me bring it back to SEARS which I did in January.  Long story short, 3 months later they finally refunded me my money because they were having trouble getting the parts.", "Date": "May 31, 2012"}, {"Title": "Awful Sound Quality", "Author": "Marquetwatch", "ReviewID": "RWD3XXU3J58UI", "Overall": "3.0", "Content": "The picture quality on this television is EXCELLENT.  But, the sound quality is ATROCIOUS.The sound reminds me of the \"tin\" sound of a toy tv, or an old transistor radio!", "Date": "November 20, 2011"}, {"Title": "Very nice and for the price heck yeah!", "Author": "Wren", "ReviewID": "R2C4PO8XNE9R2U", "Overall": "5.0", "Content": "First of all, this is my first flat-screen tv primarily because I believe in the \"if it ain't broke don't fix/replace it\" motto. So, when my old, reliable tv decided to fry itself by lightening I had to start learning about LCD, LED, HD, and a few other letters I'd never heard strung together before.For those like me here's what this tv offers connector-wise:2 HDMI ports1 USB port1 composite in (Yellow, red, white)1 component in (Green, Blue, and red/orange-these three I've never used on anything)1 antennae/cable in1 RGB/PC in1 PC audio in1 digital audio out1 red and white audio out (which, according to a different reviewer I ran across, can be used to convert the audio to 3.5mm jack for PC speakers)As for the tv itself, it is very nice. The colors are super-bright and, on my model, there was no auto-dim feature which I've heard can lead to some confusion and frustration. The panel is a uniform black with a glossy-black frame. It's thin, but not super thin which is good because not all the weight is in front. The menus are easy to navigate and settings are quickly accessible. Some people say the remote is clunky and cheap but mine was solid, easy to use, and seemed very user-friendly.Also, the pedestal is very sturdy. I like the built-in hook on the back so the stand can be secured to something to help prevent tipping. I had no trouble with metric screws, which I've heard are a problem with some tvs. The screws dropped neatly into their holes and screwed in tight with an ordinary phillips-head screwdriver. The whole set-up seemed very durable and well-planned.From hitting the power button to getting a picture seems to vary by a few seconds. This tv does have a built-in digital tuner so my tuner-box isn't necessary for it. To just turn on the tv takes less than five seconds from power button to picture, same for the x-box hooked up to it, the only delay is with my dvd recorder because it is attached through one of the HDMI hookups and it takes the recorder a moment to decide which format it is supposed to send information through.The speakers don't sound tinny, just distant and ever-so-slightly muffled because they are on the back. This gives them more space to install proper speakers so the sound quality is that of any tv I've owned. If you've ever had a $20 pair of Sony headphones, the quality is comparable just distant because of the positioning of the speakers on the tv. They aren't BOSE-surround-sound-system, blow-your-mind-with-noise speakers. They are just speakers and from about six feet away I can set them on a 1 and hear them just fine.So far the tv has been a pleasant upgrade. It's also been interesting to see what everyone goes gaga over when they talk HDMI for x-box. My brother's games definitely have a sharper, cleaner, brighter quality. I know people say this is a \"bedroom\" tv but in my opinion this would be a fine tv anywhere. The picture is clear and sharp from any angle, though if you get almost at the edge the colors are slightly muted. It's not something that would take away from a viewing experience but instead of a super-vivid red you'll have a more red-crimson when viewed from the edge of the tv.In all, this was an exceptional buy. If tally services is still offering it new for $217 (plus around $50 S&H;) I'd say go for it. This model isn't offered at that price anywhere else I could find, even Amazon doesn't list their used models for that. Tally services is who I bought through and the tv arrived in four days. I'll update if there are any problems (knock on wood) but hopefully this will last like every other toshiba product I've bought.", "Date": "October 9, 2012"}, {"Title": "Fundamentally flawed firmware/software/tuner?", "Author": "A. Dolson", "ReviewID": "R2FTLO2R1IWT7Q", "Overall": "1.0", "Content": "Can't change to channels over 100 without scrolling channel up/down button.  Can only go to those channels one at a time, as inputting any number over 100 results in a failure to change the channel correctly.  Maybe the tuner is too cheap/sensitive to lower cable signals.  Other TV's have worked fine using the same signals.Toshiba customer service way too methodically cheap and slow to help rather than be quick to help.Also, lack of quality control as my original pedestal stand has 7 round feet with a cushioned foamy/rubber round bottom, but mine came with only 6 and an empty plastic round spot in the 7th; it's missing the cushion rubber foam piece on one spot.  Shows a lack of quality control inspection, what else is subpar from made in China is the worry?", "Date": "March 16, 2012"}, {"Title": "Bran Korey", "Author": "Bran Korey", "ReviewID": "R3SPNPW90S4IDQ", "Overall": "1.0", "Content": "I got this TV awhile ago at a steal of a price - I realized now why it was so low.  Build quality isn't great for a Toshiba.  The picture quality isn't as sharp as other LED's I own and have seen.  Gaming mode sucks.  The speakers, as others noted are relatively loud, but sound like garbage (like a tin can).  The WORST is the damn menu and channel surfing on this TV - it is such a pain to do simple tasks and remove annoying things on the screen.Bottom line - if you have a budget of $300-$400 for a 32 inch TV, just buy a well reviewed and quality LCD, or wait till most LED's are around this price point.  or spend more and get a RELIABLE LED.", "Date": "December 24, 2011"}, {"Title": "Toshiba makes bad products", "Author": "Susan Koo \"Susan\"", "ReviewID": "R10Q6FZW1UQ9AW", "Overall": "1.0", "Content": "This is the last time I buy Toshiba!  Their laptops overheat and their TVs like this one, volume is broken after 1 year and a 1/2?  Ridiculous!  I call tech support and they want to charge 35 dollars to diagnose the problem???  They make a defective product, and before they can determine the issue, they want to charge you!  It's defective and they want the customer to pay?  Go figure.", "Date": "February 4, 2013"}, {"Title": "Decent LED set for the price", "Author": "Penny Cagan", "ReviewID": "R3OLMFMQJSVQK7", "Overall": "4.0", "Content": "I have only had this set for about one week. So far, I am satisfied with my purchase. I already owned a sound bar system, which I gather is necessary for the really thin televisions because as the box gets slimmer, so do the speakers. As a result, I am not experiencing the sound problems that others wrote about. The picture quality is excellent when viewed straight on, but a bit washed out when viewing from an angle, But having said that, this is a great set for the money. I would have given this set 5 stars if it had an additional HDMI hook-up and better picture quality when viewing from an angle.", "Date": "January 28, 2012"}, {"Title": "A few quirks but overall good value.", "Author": "Sono", "ReviewID": "R36YD95IP6JMV6", "Overall": "4.0", "Content": "After using this TV for a few months these are the remarks I have to make:To me it looks thinner than the actual side photo that's on this page.There are no buttons on the TV itself; power, volume, channel, menu, input buttons have touch panel interface.Pros:+ LED @ LCD price+ Decent viewing angle, an apartment of 4-6 people can TV comfortably.+ Picture is very true and detailed once adjusted.+ Has all the basic connections needed for a modern TV.+ Lightweight, broad base means less chance of tipping over.Cons:- Cheap speakers, bass-treble adjustment almost useless in creating balanced sound however listening to local news or watching sports isn't a problem.- No auxiliary audio out port, I simply bought thisRiteAV - 3.5mm to RCA Stereo Female Cable - 6 inch and used a spare computer speaker for better sound for movies/music.- At times there is a lack of dark spot variation. Some movies require personal backlight-brightness-contrast settings.- On-TV touch panel for power/channel/volume controls could be more sensitive.- TV remote is very lackluster and looks low end.- Bezel is very prone to fingerprints.- Backlight bleed coming from the left side of the TV, noticeable at night.Final thoughts: this TV works, does what it should do at a low price but lacks the sound quality and quality parts for a perfect 5 star product.", "Date": "December 31, 2011"}, {"Title": "skiouting", "Author": "skiouting", "ReviewID": "R5GP31VPY9CID", "Overall": "1.0", "Content": "The volume control on this tv is in increments of one with one being too loud and 0 being mute.  The 1/2 mute is also too loud when trying not to disturb others.  Also the setttings for reading text when the TV is muted is not automatic nor is there a setting for automatic text when the tv is muted.  Unfortunately when you choose text, it appears even when you switch from mute to volume. It can't be shut off.  This TV was a gift otherwise it would have gone back to the vendor (not Amazon).  What could the designers at Toshiba have been thinking???", "Date": "July 7, 2012"}, {"Title": "Gret Purchase!", "Author": "KobeMum1", "ReviewID": "R1G1JXSCELHQDA", "Overall": "5.0", "Content": "Picture quality is wonderful - delivery was as promised - good price.  I also like the light weight of the tv so it is easy to move.  Vry happy with my selection.", "Date": "October 9, 2013"}, {"Title": "Toshiba 32SL410U", "Author": "Janet", "ReviewID": "RBI6XVP1MPP69", "Overall": "5.0", "Content": "This model, the xxSL410u has superior detection sensitivity and excellent signal processing in the presence of a noisy over-the-air signal.  This model is better than the newer Toshiba 40l2200u model which I bought and returned last year.", "Date": "February 18, 2013"}, {"Title": "Toshiba 32 SL41ou", "Author": "marcus", "ReviewID": "R3DP18IP1HJP13", "Overall": "4.0", "Content": "I like this monitor quite nicely.  I added it to my Desk for a PC Monitor and it works GREAT !", "Date": "October 1, 2012"}, {"Title": "excelente", "Author": "darwin guatarasma", "ReviewID": "R3B7NF8OKQ84D4", "Overall": "5.0", "Content": "muy buen producto, cumple con mis expectativas y requerimientos, producto llego a tiempo y en excelentes condiciones por parte del vendedor, se los recomiendo para futuras compras.", "Date": "January 14, 2013"}, {"Title": "pictures appear, move as if by magic", "Author": "A. G. Guillotte \"porkchop sandwich\"", "ReviewID": "R6FNSZO0Z6WKR", "Overall": "5.0", "Content": "when I turn it on there are things going on and sound coming outthe things look like they're really happening but they're not and the sound also contributes to the clever illusion", "Date": "November 27, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Physical Characteristics-Depth-2.0;\nTOSHIBA 720P/60HZ LED\nToshiba 32SL410U 720p LED-LCD TV - 16:9 - HDTV", "Name": "Toshiba 32SL410U 32-Inch 720p 60Hz LED-LCD HDTV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51f4ndgIVyL._SX300_.jpg", "ProductID": "B004MF9HHG"}}