{"Reviews": [{"Title": "All-Around Good, Budget LED 1080p TV", "Author": "MisterLar", "ReviewID": "R1L3UDCTUXCGL1", "Overall": "5.0", "Content": "I'll try to put a lot of information here both for people thinking about buying one, as well as for people who already have this unit (current owners: the last part of this review has information on how to access the hidden service menu, among other things).I picked up this TV the end of August 2011 at a local store that was clearancing them out (new) at a blowout price ($159+tax, new!) It's a 2011 model that has now been replaced with a different 2012 model, but while the 2012 model is slimmer (sorry, forget what the 2012 model number is), you lose some of the features that this 2011 model LE24C1380 contains (like the Time-shift function).Though it's a \"Class 24\" size, the actual screen size is 23.6.Picture is sharp and nice, especially when hooked up to 1080p content, such as a bluray or HDTV.Like most LED TVs of this size and range, it's edge-lit, and when the screen is completely black, you do see just a bit of light in the lower-center of the screen (but as soon as there's any picture at all it's immediately gone).The Time-shift function has limited use, but I have to say, I have used it a couple times, and it's nice to have just in case you want to use it. Basically, you can plug in a USB thumb drive, and at any point, start recording full 1080p content off live TV onto the USB stick to watch it a bit later. Note that you have to have a decent speed USB thumb drive (really slow ones won't work). Say you're watching a TV show and someone calls you on the phone. You can use the time-shift function to then start recording the TV show so that when you're off the phone you can go back and watch what you missed (skipping past commercials too) even while it keeps recording new stuff until you catch up. In reality there aren't too many times I've used it, and of course, the TV & screen has to be on for it to work (so it won't replace a DVR or VCR in everyday use)... but again, it's better to have it than not, and they've taken this function away in the newer 2012 model that comes after this one, so if you want it, get this model.Sound is OK for this size TV, but don't expect theatre-quality sound or anything like that. I generally watch with sound at a lower volume, and it's fine for that. Also, no other TVs in this size range (24\") offer any better sound (all seem to offer two 3W speakers), and unless you blast it, it's good enough. There are lots of inputs and outputs (no need to write all the specs, it's all listed here at this detailed listing). It has 2 HDMI inputs which is nice (both are currently occupied on my system). It has some nice features on the remote like an HDTV FAVORITES key. The reception is comparable to other similar sized sets.(Note: if you live in an area further away from the transmitters like I do, I found that all those indoor antennas advertised for sale from RCA, Philips, etc hardly work at all.. they didn't work well with other sets or converter boxes either. Believe it or not, a solution I found is finding an old double telescoping antenna from an old TV, plopping it down into a jar of silly putty [to keep it from falling over since it's just the antenna meant to go into an old TV], putting it on a shelf in my closet, and running some coax wire along the wall to come out by where the TV set is. Doing that, I get 95% of the channels, as opposed to just a couple, which is all I could get with those advertised HDTV antennas).There's a blue \"power-on\" light at the bottom of the screen that isn't bright, but it's large, and I find those kind of things annoying, so I just covered it up with a piece of black electrical tape (what I've done to my DVD players and other sets that have similar lights like that).One interesting thing: this TV is made by Haier, which is a large Chinese company that mostly makes appliances for OTHER companies (though this one they're selling under their own brand, and starting to enter the US market with their own brand). It seems that they make a lot of the LG brand as well, because the remote to an LG BluRay player that I have actually controls this Haier LE24C1380 TV right out of the box (without changing or entering any manufacturing codes on the DVD player's remote).Personal settings (brightness, tint, contrast, etc) can all be controlled. You'll want to go for the personal settings. Take a little time, find what you like. It will let you store one personal setting for video and one personal setting for audio. That's what I have mine set to.The included instruction manual is clear on some things, not so clear on others (such as how to start the time-shift function recording). If you can't figure it out, at least Haier has a toll-free number, and they're pretty good about helping and answering questions. The unit is also Energy Star rated and very, very efficient (ranking well at the engery-saving end of the ratings for units this size).I'm quite happy with this unit. Especially in the 24\" TV range, I feel it's quite good. It may not quite rival the absolute top-of-the-line sets, but it's definitely a solid performer (especially when viewing 1080p BluRays, HDTV off the air, and even normal DVDs... sorry, I don't do gaming so I have no idea how it is with gaming), and with the great blowout price I got on it ($159+tax), I'm totally happy. If you can get a good price on it, pick this one up. Warranty is 90 days Labor, 1 year Parts.EDIT:VERDICT AFTER A COUPLE MONTHS:I've had this set for a while now, and am really happy with it. I've compared the picture quality of it to other similar sets (such as to the latest INSIGNIA 23.6\" LED/1080 set from Best Buy, which I bought -- and returned) and the Haier picture quality was far superior. I'm impressed enough to where I have changed my original 4-star score to a perfect 5-stars.The TV's HIDDEN SERVICE MENU and SERVICE MANUAL:For those interested: you can access the hidden SERVICE MENU on this TV by doing the following: (1) Turn the power ON. (2) From the remote, press: MENU, 1, 9, 9, 9, ENTER. This hidden menu shows you additional information (such as the firmware, the number of hours the screen has been used since inception, and a lot of other information), and also allows you to make much more technical tweaks to the TV. It's interesting to check out, but I suggest NOT making any changes unless you know what you're doing (you can simply press EXIT to leave, or there's a prompt to put it back to the original factory settings). Haier also has a good website (at: service.haieramerica.com) where, after doing a search for this model TV on the site, you can not only download the owners manual, but also download the complete Service Manual (in PDF format), with the schematics, hidden menu information, pictures of the inside, repair procedures, etc.CONTROLLING THIS TV WITH AN LG DVD or BLURAY REMOTE:As mentioned above, it's obvious that Haier makes much of LG's products, because some LG DVD/BluRay remotes work perfectly with this Haier LE24C1380 TV right out of the box! Both an older LG DVD player from 2008, as well as an LG BluRay Player from late 2010/early 2011 (the LG BD-530) have some TV functions on their remotes (power on, channel up/down, volume up/down, etc) -- and they both work with this Haier TV right out of the box (without having to change the codes on the LG remotes to different manufacturer's). So while it's no guarantee, some of you who have an LG DVD or BluRay player might want to check out if the TV functions on your LG DVD or BluRay remote works with this TV as well. Also, note that if you were to ever lose your Haier TV remote, just about all the functions CAN be entered from the physical buttons on the back side of the TV (even though it's more cumbersome, at least you won't be stuck not being able to work the TV).CONCLUSION: An excellent TV. I'm completely happy with it.If you found this review helpful, click on YES :)", "Date": "August 30, 2011"}, {"Title": "Great tv for the money", "Author": "Leslie E. Mclain", "ReviewID": "R1LTB7L0OVZUPA", "Overall": "5.0", "Content": "I finally ventured into the world of the flat screen tv.  I actually got this tv from a different source but I am very happy with it so far.  I've had it about a week, it was incredibly easy to set up, very light, easy controls, and I was pleasantly surprised that it has a digital tuner in it.  I am on antennae and it is receiving signals without the converter box.", "Date": "August 7, 2012"}, {"Title": "Neat set up", "Author": "Lawrence Pim", "ReviewID": "R45DB5RKUO8NL", "Overall": "5.0", "Content": "Since this apparently is an out of production unit this review might be a bit pointless however, it has a very nice picture, a LOT of input options and came fairly quickly.  I didn't notice that it was white which surprised me but, it works out OK in our application. I'd do it again if I needed an inexpensive 24\" TV.Larry", "Date": "September 21, 2012"}, {"Title": "TV good enough to double as a monitor :-)", "Author": "Rick Illinois \"Rick in Illinois\"", "ReviewID": "R21RYUBXBVTLPK", "Overall": "5.0", "Content": "I don't have the best vision, so having a bigger-than-laptop screen is helpful.  Good value and crystal clear.  I wish the stand were more sturdy, but it does the job.  The display is brilliant, not as brilliant as my plasma TV, but surprisingly good for LCD.  Low power consumption.  Thumbs up.", "Date": "November 12, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "32\" LED HDTV\nUltra Slim LED HDTV\n720p HD Resolution\n1366 x 768 Native Resolution\n10W/channel speakers", "Name": "Haier LE32C13200 32-Inch 720p LCD TV -Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41uOILxDoNL._SX300_.jpg", "ProductID": "B004Q0R6KW"}}