{"Reviews": [{"Title": "Sony 55\" EX-710: An Excellent Affordable LED/LCD TV", "Author": "Tomitoon", "ReviewID": "R2F4JXOIT3LKVT", "Overall": "5.0", "Content": "I spent hours researching and comparing \"LED\" LCD TV's in the 55\" size category.  I finally narrowed it down to two \"edge-lit\" LED TV's (the Sony Bravia 55\" EX710 and the Samsung 55\" LED 6300 series) based on price/performance, overall image quality, image contrast, refreshing rates (for sports), ease of use and customer service.I've owned both Sony and Samsung in the past and was satisfied in general with their performance and customer service so I felt comfortable with either TV from a reliability and customer service perspective.In terms of image, watching the TV's side by side for well over 10 hours, I can say I could not distinguish between the two TV's. The shape of the Sony is a bit different (slightly taller and narrower) than the Samsung, giving you the impression that the Samsung is bigger, but it's not.Both the Sony and Samsung TV's provide excellent color resolution and contrast, deep dark colors and vibrant lighter colors as well.I did find the Samsung 6300 series tv image on \"non-HD\" tv programs to be slightly better than the Sony, but the difference was marginal.As for sports, both have 120hz. and relatively fast refreshing rates, so sports viewing on either TV is excellent.For ease of use and set up, I found the Sony 55\" to be very good. Sony provides the user manual as an item on the TV menu instead of a written one, which may not be to everyone's liking.  But then again, with it installed on the TV, you're never wondering \"where the heck did I put that user manual!\"In the end, given the overall similarity in quality and performance between the Sony 55\"EX710 and the Samsung 6300 series LED/LCD TV's, I boiled it down to price and that's where the Sony won out!  I paid $1499 for the Sony while the best price I could find for the Samsung was $1750.  I put the price savings towards a 5 year extended warranty for the Sony!", "Date": "December 26, 2010"}, {"Title": "Samsung C6400/C6300 vs Samsung C6900/C6800 vs Bravia EX710/EX711", "Author": "Matt P", "ReviewID": "R17N02EZFAADXO", "Overall": "3.0", "Content": "I spent weeks researching and testing various LCD/LED flat screens.  In the end I purchased the Samsung 55 inch C6400.  The C6400 model is the same screen as the C6300 model except the C6400 has Samsung's built-in internet apps whereas the C6300 does not.  In the process, I purchased two Samsungs (C6400 and C6900) and one Sony Bravia (EX711).  Here is what I learned: * All of the review websites \"calibrate\" their screens before performing a review.  During calibration the screen's default settings are changed to supposedly make them more accurate.  Nifty features that are built into the screen like \"Mega Dynamic Contrast Ratio\" are frequently disabled during calibration because they can affect the accuracy of the image.  In my opinion, if a nifty feature in your television can make it appear brighter or more colorful, go for it.  Color accuracy is overrated.  What matters is whether *you* like the picture or not. * Edge-lit screens like the Samsungs and Bravia I reviewed are thinner, lighter, and more eco-friendly than the full-array screens.  In theory full-array screens give better contrast ratios, and require less picture manipulation to achieve said contrast ratios.  To my untrained eyes, it's hard to see a difference. * Dynamic edge-lit on the C6900 sounds like a good idea, but in my testing it created some weird affects that my wife, in particular, didn't care for where some parts of a dark image were pitch black and other parts of the same dark image were a brighter black, giving the appearance that someone turned on a spotlight down part of the screen. * The blacks were darker on the C6400 than the C6900.  Go figure. * Edge-lit screens tend to hide the speakers on the back of the set.  This produces a \"reflected\" sound that is decent, but not the best.  We planned to purchase a theater system with our television so this didn't really matter to us. * The Samsungs and Bravia screens came with a swivel stand.  This was important for our living room set up. * None of the Samsungs supported HDMI Auto Return Channel.  Without ARC I have to power on the screen *and* the theater system to watch video from external devices like a blue ray player or game console.  Not a big deal but it occasionally frustrates.  The Bravia fully supported HDMI Audio Return Channel. * When using motion blur reduction, the Samsungs have A/V sync issues in combination with our theater system.  I have addressed this by increasing the audio delay in our theater system.  It's not exactly perfect but it gets lip sync close enough that no one (except myself of course) ever notices it. * All of the Samsung screens exhibited corner lighting and flashlighting to some degree.  Each Samsung screen was slightly different.  To see this, put the screen in Movie mode and view a uniform dark image in a pitch black room.  You should see that the screen is slightly brighter in the corners and certain areas of the screen are also brighter (flashlighting).  At first this really bothered me, but then I got used to it.  There's simply no way you're going to notice this where it matters most: where the movie picture is playing.  You'll only ever see it in a darkened room between scenes and around the edges where the movie isn't playing. * Amazingly the Bravia didn't have *any* corner lighting or flashlighting.  I don't know how Sony pulled that off, but I was impressed.  Samsung should license Sony's edge lighting technology. * The Samsungs all have a reflective screen which produces a really sharp and bright image that seems to pop off the screen.  The Bravia uses a matte screen.  I was baffled to observe that the Samsungs all handled reflections much better than the Bravia.  There is a window directly behind our viewing sofa.  With the Samsungs you were hard pressed to even see a reflection at all during daytime viewing.  With the Bravia, the television was almost unwatchable during daylight hours.  Reflections caused a blooming halo affect that was really dramatic.  Score one for Samsung's \"Ultra Clear Panel\" technology. * All the Samsungs handled SD content really well.  SD content on the Bravia looked bad in comparison. * The Bravia screen frequently exhibited really noisy colors, particularly with skin tones.  This was much less of an issue with 1080p content, but was really annoying at times.  The Samsungs never had this problem. * The Samsungs use a remote control that is relatively simple and is backlit.  My wife and kids had no issues picking it up and using it right away.  The Bravia remote control was significantly more complicated and was not backlit. * All the Samsungs employ mediocre motion blur reduction.  Motion blur reduction helps minimize the stuttering affect during movement - especially panning shots.  The problem is that unless it is set to Off or Clear, the Samsungs occasionally stuttered.  In practice this isn't a problem as I actually prefer the Clear setting, but sometimes I want to dial this setting up for animated feature films (Cars, Toy Story, etc.) and it often doesn't work out well. * The Bravia had kick-but motion blur reduction.  I was really impressed.  Everything was smooth and fluid.  This may have been in part due to Sony's \"True Cinema\" technology. * When I originally started out, I really wanted our new television to provide Netflix playback and DLNA media streaming.  Despite what is advertised, Samsung's Netflix and DLNA support is poor.  On both Samsungs, Netflix was constantly switching bitrates (about once a minute) and each time the picture disappear to black for about a quarter of a second.  Audio was unaffected.  I repeatedly took the exact same network cable and plugged it into other devices (PS3, Roku, Laptop) and Netflix playback was flawless HD.  Samsung reportedly insists the problem is the user's internet service. * None of the Samsungs or the Bravia I tested would connect to my DLNA server.  I have approximately five streaming devices (Logitech music box, No-name streaming box, iPad, PS3, etc.) spread throughout my home and none have had any issue connecting to my DLNA server. * The Bravia did have better Netflix support, however overall bitrate was still less than other devices (PS3, Roku, Laptop).  A few video stalls (buffering) were experienced on the Bravia. * In my opinion, the C6400 isn't worth the extra cost over the C6300.  In my case I got a super deal on the C6400 so it wasn't an issue.  Perhaps in another few years, these issues will get ironed out.", "Date": "January 9, 2011"}, {"Title": "Great TV - Nothing to complain about", "Author": "netrabbit", "ReviewID": "R3EQASG92TJYVY", "Overall": "5.0", "Content": "I bought this TV online during black friday for 1500$ delivered. Right out of the box the TV was simply amazing. I did not have to change any color, brightness, contrast settings. It chooses the right picture mode based on the content. Some people have complained about the sound, but I found it to be sufficient for my room (15 feet by 30 feet). I like the fact that the stand provides about 20 degree movement on each side. Before this I bought a Vizio and the picture quality on that was horrible (I obviously returned it). This is one of the best TV out there if you are not looking for 3D.Some of the things that I found not that great:* The factory setting for the screen size cuts about 3-5% of the picture from all sides on HDMI input including computer, XBOX, DVD, Dish HD Receiver. It took me some time to realize that I was missing some of the picture. You need to set \"Screen\" to \"full pizel\" to get complete HDMI picture. I am not sure why they would set the default to setting that would cut the picture.* Netflix streaming is ok, I would rather connect computer directly. Because the in-built software only displays instant queue. You must add movie to instant queue using computre and I have also noticed a lag (sometimes hours) before the instant queue gets updated.* USB port on the TV plays photos, music and home videos. However, tt recognizes FAT32 drives only. There is also limited support of the file format. It played AVCHD straight out of the camcorder, but did not play TS files that I created by combining the AVCHD clips. Nor did it play DV AVI Type 1 or Type 2 format files. It plays the photos and music very well, no issues there. It is also DLNA server so you can stream content from home computer.Overall very happy with the picture and sound quality of the TV.", "Date": "January 16, 2011"}, {"Title": "Top LED for the price", "Author": "S. K. Dhanuka", "ReviewID": "R1JMD1PIJ7DCLE", "Overall": "5.0", "Content": "First, I have this TV connected to a home theater system with a universal remote, so I have virtually no experience with this TV's sound quality or remote.  I am using the TV purely as a monitor.  That of course is its primary function and I could not be happier.  For me the decision really came down to the Samsung 55\" 6300 and this, with the ultimate decision based purely on price.  I got a good deal on this and snatched it (after having previously missed a similarly good deal on the Samsung).  Honestly, I do not think you could tell a difference in picture quality between the Sony and Samsung.  In a store, there was a marked difference between these two and the others, even LG or Panasonic, without even going to the Vizios and like.  You would have to be really picky to find a difference between Sony and Samsung, and really, once you have brought one home, its hard to tell if you are even missing something.  You are not going to have the other one sitting next to it playing the exact same video.The one difference between the Sony and Samsung which could be important is that the Sony has a matte screen while Samsung has gone with the glossy.  In a perfectly dark room, I think the glossy does provide the impression of really pure blacks.  However, we have quite a few windows around where this TV is so I am glad I got the matte screen.  Again, once I have it in my house, I cannot tell the difference in the blacks and appreciate not having any glare in the afternoons.The one thing to note on a TV this size and quality is, there is simply no going back to standard definition TV.  In fact, its \"painful\" to even watch a non-Bluray movie now.  Std. def just looks like a mess.  We had a 32\" before this, and I never minded watching std def.  I could tell the difference between SD and HD, but it was not too bad.  Now, if the channel is not in HD, my wife and I have no interest.Finally, the one thing I appreciate is that the picture quality was perfectly fine right out of the box.  Though I consider myself capable, I just have very little patience with fine-tuning the quality by adjusting a bunch of settings.  I am sure the quality could be made a little better by playing with all the options, but I am very content with what I have.  In this regard, I do not mind not having a printed manual.  Its nice on the TV, so I never loose it.  But yes, I agree with all the others that when you are making something in this price range, it is pretty cheap to skimp on a lousy manual.  There are many occasions (like adjusting picture quality) that having a printed manual in front of you is invaluable.", "Date": "February 12, 2011"}, {"Title": "Best picture ever!", "Author": "Matthew L. Roberson \"Wulfe the Immortal\"", "ReviewID": "R1AUIJ7M819VO", "Overall": "5.0", "Content": "Just got this a couple weeks ago, and I couldn't be happier. Picture is phenomenal, sound works just fine in my living room but I don't really use the built in speakers much. Set up was a breeze and if you really cant figure it out without a physical manual, maybe you should have someone else set it up for you. Just my thoughts. Got a good deal too, $1450 + tax financed for 36 month no interest... just don't miss a payment!", "Date": "December 23, 2010"}, {"Title": "WARNING!! DO NOT BUY A SONY TV!!!", "Author": "WillyBack@aol.com", "ReviewID": "R2RF66W783GFIK", "Overall": "1.0", "Content": "I have been a faithful Sony customer for over 30 years and, up until the last few years, was convinced that they produced the finest electronics equipment on the planet. But my opinion has changed drastically in the last few years due to a series of failures of their TV's, and now it will be a long time before I ever buy anything from Sony again. It appears that they had chosen to lower their engineering/manufacturing standards and were trying to make a killing using the momentum from their old reputation. I guess it's caught up with them since their electronics group posted a $1.1 Billion loss in the 4th quarter of 2011. It appears that the only thing keeping them alive is their (American) entertainment group (music, movies, etc.).My troubles with them started back in 2006 when I purchased their 60\" SXRD TV. It produced a beautiful picture until the \"light engine\" in it began to fail and had to be replaced. When we moved, I sold that TV and bought a 55\" SXRD that was a better fit for our new home. Again, beautiful picture, but the light engine in this one failed too! I had it replaced and when the replacement failed, I did my due diligence and found there was a class action suit against Sony for these TV's. Based on this suit, Sony replaced it with a 55\" LED/LCD model (KDL-55EX710) but had to pay $250 for the \"upgrade\" (and pay $75.00 to have the old one hauled off). This was in July of 2011, and 2 weeks ago (early March 2012) the upgrade failed. I have been without a TV since and have been told that my warranty does not cover replacement, only repair. The problem is, they have no parts to fix it. Now, maybe the parts problem is a result of the tsunami, which I can understand and I have great empathy for the folks in Japan. But, dammit!, this TV should have lasted more than 8 months! Frustration is setting in, hence my comments. You have been forewarned.", "Date": "March 26, 2012"}, {"Title": "Great tv", "Author": "G-man", "ReviewID": "R262VU43OVXPME", "Overall": "5.0", "Content": "I bought this TV from amazon about a month ago. Delivery was very professional, the tv is carried into my apartment, opened and turned on by the delivery guys to make sure it is working. That is definitely a comfort because it is definitely a hassle to ship a tv back if it is broken (thankfully this one was not). Setup is really easy, picture quality is great, sound is great. No complaints. Really happy with my purchase.", "Date": "March 10, 2011"}, {"Title": "Very nice TV", "Author": "L. Lambrix", "ReviewID": "R39Q703CUA9MHE", "Overall": "4.0", "Content": "We bought this TV after our Samsung 52\" died in less than two years.  We are very happy with it, except for the sound.  We had to install external speakers because even at \"max\" the sound wasn't great.  But with the external speakers everything is perfect!", "Date": "February 1, 2011"}, {"Title": "Wow", "Author": "E. Clay", "ReviewID": "RPE17DTR2NMUT", "Overall": "5.0", "Content": "This is the best television we have ever had.  It functions intuitively and is no trouble to set up or operate.  We love it.", "Date": "January 30, 2011"}, {"Title": "great led lcd tv", "Author": "M. Luu", "ReviewID": "RRAZ5ES9AXP8T", "Overall": "4.0", "Content": "the flashlighting issue is very minor. it will only bother videophile who wants absolute best image possible.  i watched dark movies on it and it still looks great. it might not have the deep dark black levels as a plasma but it does very bright clear images that out perform plasma in rooms with ambient light.i prefer this sony led over samsung's because it has a matte screen & variable analog audio out.if you're in a market for a new tv, i suggest you wait until april for the 2011 series. if you can't wait, i would recommend this tv.", "Date": "January 9, 2011"}, {"Title": "Awesome TV; Horrendous Company", "Author": "W. Wight", "ReviewID": "R1AL1UUSGP45I9", "Overall": "1.0", "Content": "We've had the TV for eight months now, and it's been fantastic. However, every time we have to deal with Sony it's a labyrinthine nightmare. Seriously, the reason we chose the Bravia over a Samsung TV was Sony's reputation for customer service, but I've honestly never dealt with a company that provides worse customer service.I'm delighted with the television itself, but I'll STILL never buy anything with a Sony label on it again, just on the off chance I might have to deal with a Sony employee.", "Date": "August 17, 2011"}, {"Title": "Excellent Value", "Author": "Dan  E  Dailey   Jr", "ReviewID": "R3SPU7T2JY5BSL", "Overall": "4.0", "Content": "Just got this as an upgrade to a 46\"sharp aquos we've had for 3 years.I loved the picture on the aquos,but this blows it away.This is the second Sony LCD,1st LED side lit TV we've purchased and we couldn'd be happier.", "Date": "December 20, 2010"}, {"Title": "A great value on a sweet television", "Author": "Russell T. Stauffer \"Rusty\"", "ReviewID": "R1JEY57F52UGJ4", "Overall": "5.0", "Content": "You can't go wrong with this set.Physical Appearance:  very thin borders helps fit this large set on tv stand or shelf.  The stand for sitting tv on a table/shelf is hefty, swivels to allow you to rotate tv 15 degrees either way.  Wish it was black instead of silver, but it's a functional looking stand.  Nothing flashy to the looks of the set.  It's not super heavy.  I unpacked and mounted it myself.Picture:  great!  I love the semi-gloss finish on the screen, and don't get why most other makers use glossy.  The picture is sumptuous and I have zero complaints.  I'd bet that real home video experts could point out something they didn't like about the picture, but I sure can't find any flaws.  Super deep blacks.Input / Output:  plenty of options  PLENTY.Audio:  built in speakers are so-so at best.  I use external speakers so not an issue.\"Smart\" Features:  I've barely gotten familiar with any of these.  But I will say I love the built-in Netflix and Hulu.  Wireless internet setup was a snap.  Enter password to your router --- finished.REMOTE CONTROL:  It's kind of a busy remote with lots of buttons.  But --- I've seen FAR worse.  The button layout is logical and easy to use.  Here's the kicker: I have a Panasonic home theater system (blu-ray, speakers).  This remote figured out how to program itself to operate said home theater system. . . And I didn't even ask it to do so.  The remote just figured it out and took care of things quietly.  I'm amazed at that.  Thank you Sony.Operation of TV:  because the remote is logical and clear, the tv is easy to figure out.  Didn't have to look at the manual.  The tv was supposed to pick up channel labels (like network name, \"NBC\" etc) but didn't do so.  This may be because I live middle of nowhere and my Podunk cable outfit doesn't provide that?  It was a pain to enter the station name on over a hundred channels, as the menu item is a few layers down, yet you have to pop back out to look at what is on screen so you know what channel it is you're labeling.Not a terribly technical review I'm afraid.  But technically speaking, I love this tv!!", "Date": "December 13, 2013"}, {"Title": "Amazing quality", "Author": "Richard", "ReviewID": "RSVZLNP26VPYJ", "Overall": "5.0", "Content": "Amazing quality.  Beautiful picture, especially in hi-def.  It shuts off automatically if it doesn't sense movement, so it forces some activity from time to time.  I keep hoping it will help me lose weight.", "Date": "November 15, 2013"}, {"Title": "OK while it lasts", "Author": "Neel S Ketkar", "ReviewID": "RBIZW55ZMO4NQ", "Overall": "2.0", "Content": "This TV lasted less than three years for me until it went into permanent standby mode. Calling Sony was not helpful - they said the only possibility was to take it to a certified repair center, which charges $150 just to look at it. Outside of this, the picture was always pretty good. Not the best for sports. The internet apps platform is pretty dreadful in terms of ease of use and look and feel, particularly when compared to a Roku or Apple TV.", "Date": "November 9, 2013"}, {"Title": "Outstanding HDTV", "Author": "Jachin N. Rivers", "ReviewID": "RDDHYUEYOZWXV", "Overall": "5.0", "Content": "I replaced a KDF-46E2000 with this TV last year using Sony's replacement program due the notorious defect with the 3LCD projection system.This TV is beautiful with an outstanding picture.Colors are crisp, lighting is perfectly uniform, and glare is not an issue.Bluerays looks great, and DVD's never looked better.The Motionflow feature is great on it's \"standard\" setting however can be a little inconsistent set to \"full\", once I got used to it I never wanted to watch material at 23.97FPS again.While a fantastic product it's only objective to point out it's flaws as well, for starters the internal speakers sound poor, lacking low range frequencies, turning up the bass helps but ends up with a rattle or vibration at normal or higher volume. If you intend to use a sound system with this TV then this can be over looked however it you intend to use the internal speakers be warned, they are far from ideal.Another flaw would be menu's are a little pokey to bring up responding slowly sometimes however I think the only reason I notice this is because they were instant on the older KDF model.The specs listed here on Amazon are incorrect in a couple regards, for one this IS a 240Hz NOT 120Hz HDTV, which ends up being a bonus.Also the features comparison chart shows this TV not having a ambient light sensor, this is incorrect as well, it does, yet another plus.Despite Sony's difficulties they still make a damn good HDTV earning 5 stars for my satisfaction. Thanks Sony for making things right.", "Date": "May 18, 2012"}, {"Title": "Sony Bravia KDLEX710", "Author": "Enrigue Torentino", "ReviewID": "R1GKU4KOBW7YJJ", "Overall": "5.0", "Content": "Had this Sony Bravia KDLEX710 for more than a year now and never had a problem . Easy to set up and calibrate but I will be getting a wireless dongle to check out more stuff! After calibration picture using the Disney Wow Disc picture is amazing! Thought long and hard about getting a Sony 3-D tv but with this picture forget about it!", "Date": "January 29, 2012"}, {"Title": "A Real Upgrade from my 42\" LCD HDTV!!", "Author": "Jay K", "ReviewID": "R2L6UEYUUOCIX4", "Overall": "4.0", "Content": "Sony has always had a great reputation for their HDTV although you will have to pay a higher premium when compared to other brands.  Since the HDTV prices have came down significantly over just a couple of years, I have decided to get the top of the line Big Screen (55\") LED HDTV from Sony.  I have had it for 3 months now, and I am very happy with the purchase - elegantly thin panel with high quality picture, brightness, and clarity!!", "Date": "June 21, 2011"}, {"Title": "Sony Bravia 55\" 1080p LED HDTV", "Author": "Ed", "ReviewID": "R227Y42WV2ZPCY", "Overall": "5.0", "Content": "Outstanding  TV. The only problem I found is in attaching a DVD-VCR to it where the picture is black and white when connected to \"component IN\" in the back. When attached to the side connection the color returns.", "Date": "April 27, 2011"}, {"Title": "Overall good TV, but with some issues.", "Author": "Craig \"Craig\"", "ReviewID": "RXUPDO0555KE7", "Overall": "3.0", "Content": "Purchased this after returning  VIZIO XVT473SV 47 inch LED.  Vizio was a little underwhelming in size, and moving up to a 55 inch was a big improvement.  I also didn't like that it didn't have an ambient sensor to adjust to the light in the room, which the Sony does have.  To change the display settings in the Vizio you had to dig down in the menu at least three clicks to make the adjustments.  The Sony has a one button feature to change the display setting, of which there are about 8 different choices.  Added nice features were the presence sensor, that turned off the screen after a period of time if it did not detect anyone in the room.  Also liked the matte screen to reduce reflection.  Beautiful HD and Blu ray picture.Now the not so good.  While the matte screen reduces reflection, the color seems to wash out if viewing more than 20 degrees right or left of center, and get worse as you move away from the center. This may be more of an issue with LEDs in general, but less noticeable with LEDs with glossy screens. The sweet spot is in the center, so if your the only one viewing then your ok, but your company won't enjoy viewing from the sides.  There is also an issue with motion blur. I disagree with another reviewer who believes Bravia had kick-butt motion blur reduction.  The 120Hz is just not enough to keep up with the size of this screen, or its response time is just not fast enough.  Constant blur and pixelation on most movements. Never had a problem with the Vizio which was 240Hz and 47 inch screen.  Going to probably return this and look for an LG or Samsung 55 inch 240Hz, or perhaps plasma which are faster with less motion blurr, and have better off angle viewing.", "Date": "April 13, 2011"}, {"Title": "Bravo Bravia", "Author": "V. Durost", "ReviewID": "R25M1X2AOK7SMI", "Overall": "5.0", "Content": "We like Sony products and this Bravia 55-in 1080p has not disappointed us.  It's the perfect size for our living room and the color quality is wonderful. It lives up to all the specs.", "Date": "April 5, 2011"}, {"Title": "Sony Bravia KDL55EX710", "Author": "Rocco", "ReviewID": "R1JPQO17MXH54Z", "Overall": "5.0", "Content": "Absolutely awesome set. Picture is superb, with a theatre mode for those who don't like the crisp digital look (like my wife, the theatre person). With interface to the internet and streaming video (Ntflix, Youtube, etc.)without intervening PC it is the couch potato's nirvana. Way surpasses the picture and features of the Samsung it replaced. 6 stars on a 5 star scale.", "Date": "February 24, 2011"}, {"Title": "Really great TV", "Author": "JAL", "ReviewID": "R2Q4MOD4A8XOOY", "Overall": "5.0", "Content": "I've been using this TV for four months and loving it. I read all the reviews and was wary of some of the negative things I read, but none of that is true for me. I added a Bose CineMate to get better sound, but the sound was acceptable from the TV - about what I expected. I use it just for watching cable TV, always on an HD channel. The picture is incredible. I don't tweak the settings - just turned it on out of the box and it's great. The LED backlighting really makes for a brilliant picture. Screen is plenty big, but not too big, even sitting eight feet away. Normal viewing distance for me is 12 feet.  No complaints on my purchase.", "Date": "May 16, 2011"}, {"Title": "wow !!!", "Author": "tonymac7777", "ReviewID": "R1C8RLU3KZRY94", "Overall": "5.0", "Content": "I have had my 55ex710 for 2 months now and each day itgets better.This is one of the highest reviewed tv's anywhere.At another site 85 out of 87 gave it a 4 or 5 stars.And the only reason it gets a 4 star review is the sound.I have a Sony home theater and things do not get any betterthen this.Sony has stopped making this model so there are some deals out there.I bought mine new for $1,099.Bought my warranty thru Sony and saved there also.Out of the box the picture is great but after a fewadjustments, I just do not see how a picture can get any better.There is an adjustment, Vivid, Standard, Custom.Once you figure these out, you will really be happy with your TVI keep mine on vivid most of the time, it gives the bright look withvivid colors.Standard is a little darker.Custom I still have not figured out yet, it takes some calcullating.Shop around and find a good deal, they are out there.I have not been this excited about anything since I met my wife !!!", "Date": "April 4, 2011"}, {"Title": "SONY LED LAGS BEHIND THE SAMSUNG LED", "Author": "E. WEBB", "ReviewID": "R343MLD1PM2FGW", "Overall": "3.0", "Content": "I have BOTH, the Sony Bravia KDL55EX710 LED and the SAMSUNG UN60C6300 LED.. The SAMSUNG LED is by far a much better TV.. The picture quality is much better, the remote control is more functional with a varity of more options choices than what's on the Sony remote,,, the Samsung remote is BACK-LIT, the Sony's is not... The contrast adjustment on the Sony TV does almost nothing causing the TV to have an almost cloudy haze even with the auto-motion turned off.. ( Maybe I just haven't figured out how to adjust the contrast another way.)One of the biggest negatives with the Sony is that it has NO WRITTEN MANUAL that you can sit and read... Anything you want to know about the Sony TV requires you to TURN THE TV ON, then press the \"I-MANUAL\" botton on your remote, and then search through your TV screen for what you are trying to find out... This is a royal pain in the BUTT!!!!I received the Sony Bravia LED TV as a replacement from Sony for a defective Sony rear-projection TV where the whole screen turned GREEN.Overall, the SAMSUNG LED has a more beautiful picture, has a WRITTEN MANUAL with it, and is definitely more user friendly than the Sony Bravia LED... Read my full review on the SAMSUNG LED UN60C6300. I will be buying another Samsung LED, the 65 inch model, for the living room.Don't get me wrong,, the Sony Bravia LED model is a GOOD TV, even better than my defective Sony TV it is replacing.. But,,the Samsung LED TV is definitely THE BEST quality TV currently on the market with an absolutely BEAUTIFUL picture.", "Date": "November 13, 2010"}, {"Title": "Picture not good from side viewing angle. Pic fades", "Author": "KG", "ReviewID": "R1T9VNP4WBYLH0", "Overall": "2.0", "Content": "TV picture quality is good when view from front but when you move sideways the picture fades in color. Amazon price match policy is the worst. After I bought this TV i have tried showing prrof to amazon on other sites which had around 300 less than what I spent on amazon.", "Date": "February 21, 2011"}, {"Title": "SONY -the stinker", "Author": "A. Frank \"Exercise person\"", "ReviewID": "R2Y3F5VV60TPC4", "Overall": "2.0", "Content": "SONY - The stinkerThe picture quality is just okay, nothing spectacular.The HDMI ports DO NOT WORK!!!Sony and MS Windows DO NOT get along.", "Date": "February 22, 2011"}], "ProductInfo": {"Price": "$1,349.00", "Features": "55-inch Edge LED-backlit HDTV with Full HD 1080p resolution and slim design\nMotionflow 120Hz technology for smooth motion; BRAVIA Engine 3 fully digital video processor\nWi-Fi ready (with optional dongle); access to BRAVIA Internet video and widgets; USB port for photos, music and video playback\nInputs: 4 HDMI, 2 component, 2 composite, 1 PC, 1 USB, 1 Ethernet, 1 optical digital audio output\nIncludes removable stand; measures 50.4 x 31.5 x 13.8 inches with stand", "Name": "Sony BRAVIA KDL55EX710 55-Inch 1080p 120 Hz LED HDTV, Black (2010 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/51S0IeWGrDL._SY300_.jpg", "ProductID": "B0040WMQ42"}}