{"Reviews": [{"Title": "Very Nice HDTV", "Author": "Donna B", "ReviewID": "R3KG64JEOWQ0KL", "Overall": "5.0", "Content": "I purchased this TV to replace an old Toshiba 26\" DVD/VCR combo in the bedroom. The 32\" flat screen is just the right size for viewing from bed and the HD picture is very clear (even non-HD channels aren't bad). The only downside to the picture is viewing it from a side angle as the color and clarity are best when viewed from the front. The sound quality is also good; and working the remote and navigating the on-screen menus are easy. Like others, I enjoy having the DVD built in so there's no additional equipment. The DVD function works well and the slot on the side provides easy disc insertion and ejection. The TV has a nice, clean stylish look and I recommend it for those interested in a TV for bedrooms, dens, or workout rooms. I was impressed with Amazon's price, partnership with American Express's Rewards, and delivery. Purchasing was very easy using my Reward points and I received fast, free shipping in two days. Setup was quick and easy; and although I haven't tried everything this TV can do, so far I'm very pleased with it.", "Date": "July 23, 2011"}, {"Title": "EXCELLENT COMBO TV/DVD", "Author": "Joe Cook", "ReviewID": "R28VTZJ1TP2AKS", "Overall": "5.0", "Content": "I PURCHASED THIS TV/DVD PLAYER FOR THE BEDROOM, REPLACING A TOSHIBA 19\" COMBO WHICH I LOVED BUT WAS A BIT TOO SMALL. THE COLOR ON THIS UNIT IS SUPERB, THE SOUND VERY GOOD, THE SETUP WAS A BREEZE AND THE PRICE WAS THE CHEAPEST ON THE INTERNET. THIS IS A NICE QUALITY SET THAT'S WORTH LOOKING INTO.", "Date": "June 25, 2011"}, {"Title": "easy to use", "Author": "Amazon Customer", "ReviewID": "R3IOXCK4LHLNBI", "Overall": "5.0", "Content": "We needed a TV for our 2nd home so we could watch DVDs; we haven't subscribed to cable yet.  Eventually this will become a secondary TV for us.  The size is perfect for now--actually fits on an end table.  Good clear picture with no distortion even when viewed from the side.  We love the easy way to play DVDs--very simple functions.", "Date": "July 21, 2011"}, {"Title": "Complete Package for Excellent TV Viewing", "Author": "jcl", "ReviewID": "RHUS4TD6LW9YQ", "Overall": "5.0", "Content": "This is probably the best combination TV purchase I've ever made.  The price paid was phenominal for a 32\". Easy to put together, excellent picture.  I could go on and on.  We received a 37\" Vizio for Xmas and believe me when I say that this  Toshiba has it all over that Vizio.  No comparison. Do yourself a favor and purchase this TV with confidence. You'll be happy that you did.", "Date": "July 26, 2011"}, {"Title": "Do Not Buy", "Author": "Suzzyshopper", "ReviewID": "R3JLGTXPFF54EI", "Overall": "2.0", "Content": "Toshiba Customer Tech Service is poor in regards to the 32\" LED Model 32SLV411U TV with the built in DVD. I phoned them 11 times between 8/15/2011-8/19/2011 to find out that it has a bad DVD module. Prior to that I was told to purchase a USB Flash Drive and download the updated firm ware from their website to get the DVD component to work in this TV Set. None of that worked. Now I have to go back through HPP Enterprises and wait for an RMA # to return a Defective Product that they sold me. I paid over $47.00 for win zip software to use the USB Flash Drive inorder to download the firm ware software that was suppose to update the dvd component for this 32 inch flat screen. All of that was for nothing because of Toshiba poor Tech support advising me wrong when they knew the DVD module in this TV was defective. It just goes to show you that the left hand does not know what the right hand is doing in that company. I will not purchase another Toshiba product and I definitely will not buy anything else from HPP Enterprise; it takes them too long to do returns. I am still waiting on a RMA number. I was told it takes only 2-3 days to receive one. I told HPP Enterprise that the product is defective and I am not understanding why it takes gridlock to get this TV back to them. And I am going to have to handle and pay for this inconvenience.That is also bad when they give you a 30 day time line to accomplish this from the date you received the product. I personally feel the company HPP Enterprise need to absorb the expense of the return as a company since the product was defective.", "Date": "August 19, 2011"}, {"Title": "Super easy to set up and use", "Author": "Kathy", "ReviewID": "R23IH3HWDT5VK4", "Overall": "5.0", "Content": "This TV was beyond easy to set up.  We have Direct TV and all we did was attach the cable, plug the TV in and then turn it on.  That's it.  It scanned the channels and then we were ready to go.  We've never had a TV that has a DVD player in it before, so once we were sure we got all our channels, we checked that right out.  Literally all we had to do was put a DVD in the slot on the side of the TV and it started playing right away.  All the menu items for playing a DVD are on the remote that you use for the TV.  Super convenient. Then, much to our surprise, we found out that we can play our music CD's on the TV!  It works just like with DVD's where you just put a CD in the slot and then it starts playing. Back to the TV part, the picture is great and very easy to adjust to whatever size and color shade you prefer. We are using this TV in our bedroom, and we can see it perfectly from our bed - it's not too large and not too small. We are extremely happy with this purchase.", "Date": "September 27, 2011"}, {"Title": "GREAT TELEVISON", "Author": "Desert Dweller", "ReviewID": "RJZXJSELJP53Y", "Overall": "5.0", "Content": "Television is great for our family room.  Crisp/clear picture(HD)and the convenience of a DVD player built-in.  Great looking television, too.", "Date": "May 13, 2011"}, {"Title": "Best Combo Buy, But Be Careful", "Author": "crwdd", "ReviewID": "R213PQSY2LLQRT", "Overall": "4.0", "Content": "This a good TV combo as long as it isn't your only or primary TV. The DVD player works very well, the sound is adequate, and it has a USB port. It also has a polarized two-prong plug, which is great in older houses or apartments. The picture and viewing angle are very good. The remote control functions can't be read without full light and a magnifying glass, so the buttons have to be memorized. The favorite channel function is so awkward it's virtually unusable. so channel surfing is very bad. Toshiba customer service is unbelievably worthless, so be sure to buy from someone you can return to if there's anything at all wrong with the unit. After you download the owner's manual from Toshiba, if anything goes wrong after the return date, you're out of luck.", "Date": "November 9, 2011"}, {"Title": "Great 2 in 1", "Author": "CAT", "ReviewID": "R1QZZ80YNMI3ZV", "Overall": "5.0", "Content": "Convenient to have the DVD built in.  Definitely a space-saver, great concept.  Very sleek.  The side w/ the DVD however, is slightly heavier; I hope this won't affect the visual weight balance in the future.  Best price is on Amazon obviously.", "Date": "August 31, 2011"}, {"Title": "Life is Better in Afghanistan with my new Toshiba HDTV", "Author": "Mr KD", "ReviewID": "R15KPG1DA5DRHQ", "Overall": "5.0", "Content": "The TV came quick and was easy to mount although the mount was not included.  The picture is clear and I'm happy with the internal DVD player.  The remote control is easy to operate and the on screen menu is easy simple to navigate.  The price was reasonable considering the features provided and I'm happy with my purchase.  Life is better here in Afghanistan now that I have a TV.  one disadvantage is that you can't plug in headphones and I would have liked that feature so as not to disturb my roommates.  I plugged my laptop into the TV and run the Audio through my computer so that I can use headphones and that seems to be working well.", "Date": "November 10, 2011"}, {"Title": "Very satisfied with my 32\" Toshiba TV", "Author": "W. White", "ReviewID": "R1MY9495CUCDPM", "Overall": "5.0", "Content": "I am very satisfied with the quality of this TV. The picture and sound are great. I cannot comment at this time how well the DVD player performs because I haven't used it yet. This TV was purchased for my bedroom and I haven't spent too much TV time in there. I am very pleased with Amazon's quick delivery. I did not have any problems with damage to the TV nor did I have to contact Amazon with any issues. All I can say is that I'm satisfied with the product and with Amazon. I've purchased other electronic items through them and have no complaints. I think if you purchase this TV, you will be as satisfied as I am. Good luck to you and God Bless.", "Date": "September 25, 2011"}, {"Title": "Good TV", "Author": "Rebecca S. Walters", "ReviewID": "R2Z7L8VYT5U7E0", "Overall": "4.0", "Content": "Bought this TV for my Grandma for her 85th Birthday.  It is wonderful.  She is able to work the DVD player and TV easily.  She loves it.  Has a great picture and sound too.  Very satisfied.", "Date": "November 12, 2011"}, {"Title": "No complaints!", "Author": "Sampada", "ReviewID": "R7ZSNJPDJ98TG", "Overall": "4.0", "Content": "The first order I made from Amazon had a problem with the TV stand (it wouldn't fit). I called Toshiba customer support and the guy there was no help. So I called Amazon and they suggested that they send me a new TV. Amazon arranged for pick-up, the new TV arrived in two business days and this time there was no problem with the TV stand. This is the first time I returned anything to Amazon, and the service was really good.As far as the TV, it suits my needs. I've had it only for a couple of weeks, but I like everything about it. Like others have said, I like having less clutter, so the built-in DVD player really helps. I'll edit this review if I notice any problems. But I hope I don't have to.", "Date": "September 25, 2011"}, {"Title": "Like this TV", "Author": "Betsy", "ReviewID": "R1V5TFCDY56545", "Overall": "4.0", "Content": "I purchased this television to replace a 26\" tube television that I had had in my bedroom for almost twenty years.  While I don't find the high definition picture as crisp and clear as the 42\" Sony in my den, it is certainly an upgrade from the \"old\" tv, and just what I was looking for.  I have not yet used the built-in DVD player, so cannot comment on that.  When I was researching this set, I noticed that some people had commented on the sound quality.  i personally don't have any issues with the sound, perhaps it is because while my bedroom is a decent size and does have a vaulted ceiling, it's not huge and I'm not one of those people who needs the \"surround sound\" experience.  Finally, as usual, the Amazon experience was fabulous - I ordered the tv on a Tuesday, and it was at my door by the time I got home on Thursday.", "Date": "November 10, 2011"}, {"Title": "No Hassle Upgrade", "Author": "Edward Terry", "ReviewID": "R365KY8REL8ZYV", "Overall": "5.0", "Content": "I upgraded from a traditional TV that did not have HD capability in the master bedroom..Great picture, good sound, lightweight and very easy to install.", "Date": "November 9, 2011"}, {"Title": "I love it!", "Author": "James A. Lawler III", "ReviewID": "R9DPHPU2IP4HO", "Overall": "5.0", "Content": "Great picture and color, nice design, it is perfect for where I am using it, and no DVD player in sight.", "Date": "September 24, 2011"}, {"Title": "Toshiba TV with built-in DVD", "Author": "Carol_in_WV", "ReviewID": "RRRGK0HYGXUGG", "Overall": "5.0", "Content": "This set was purchased to wall mount in a room that includes exercise equipment.  It works with standard mounting hardware.  The included base was neat and attractive, stored for possible future use.Picture quality is very good.  Integrated DVD player works well with wall mount, to reduce cables and devices attached to the set.  Playback is fine.  Set is black and looks very nice.As specs note, this set accepts HDMI input.  It has a port for digital audio output.  This was new to me, believe it may be called \"Toslink\" if you want to look for further info.  I think it may be useful for home theatre.  I bought a converter and y-adapter so I could output it to analog and use headphones while on treadmill.I am pleased with this set, no problems at all.  It made me nervous to order something so large, and so fragile, sight unseen.  However, local stores did not have this large a set with the DVD player, so I took the plunge.  It arrived in perfect condition and operates beautifully.", "Date": "December 30, 2011"}, {"Title": "Great picture, average menu system, poor sound", "Author": "Amazon Customer", "ReviewID": "R1PYWNDCUDND95", "Overall": "4.0", "Content": "For an LED-LCD TV with an included DVD player, this is an excellent product. Movies on disc play just fine, as does music and anything else.Image quality is excellent, and the black levels are plenty deep enough for a consumer device.Sound quality is poor, with virtually no bass whatsoever and overall becoming very tinny, especially at higher volumes. This isn't a surprise, but the output is definitely worse than most (particularly compared to the wonderful Sony BRAVIA series' built-in sound). A simple 2.1 speaker setup successfully complements, and anything more makes the TV's built-in speakers a non-issue.All of the expected inputs are present and work properly: multiple HDMI, composite, coaxial, optical audio, etc.On-screen menus are decent - nothing special and limited flexibility, but they get the job done. HDMI sources work well at auto-configuring. Once set up, there really isn't much menu interactivity necessary, although the screen doesn't dim while playing audio CDs. The remote design could be considered either functional or atrocious depending on how much it will be interacted with; basics work well, but the layout for more advanced functions is cluttered and counter-intuitive.Everything else is solid, definitely a worthwhile unit either as a basic primary unit or a secondary display.", "Date": "December 10, 2011"}, {"Title": "very poor speakers", "Author": "jim \"luddite\"", "ReviewID": "R3AG2HEC7T3D25", "Overall": "2.0", "Content": "we just got this set today.  set up is quick and efficient.  however, the speakers are very bad.  if you have a digital converter for the audio you will be ok.  otherwise pass this set if you want anything but a cheap audio experience.", "Date": "November 23, 2011"}, {"Title": "I love this television", "Author": "Larry", "ReviewID": "R1WNW4G18DLT6Q", "Overall": "5.0", "Content": "Before I purchased this television, I had been looking at a number of brands for quality and cost. I also wanted a built in DVD player.  I already own a table model Toshiba for thie last 10 years.  So I am not surprised of the quality of this product.  I strongly recommend this product.  The picture quality is excellent and the DVD player is wonderful.", "Date": "November 9, 2011"}, {"Title": "Great Picture,", "Author": "Barbara J. Hodges \"bjh\"", "ReviewID": "R8RGEA472BWK2", "Overall": "5.0", "Content": "A great TV. Good price.  Very pleased with the product.  It was delivered promptly within 2 days.  Set up easily and shows a great picture.  Haven't used the DVD portion yet but I am sure I will be happy with it as well.  Toshiba is a good brand.  You can't go wrong with this TV.  Update on review.  Used the DVD portion and it was very user friendly also shows at goodpicture.  I used my rewards points toward purschase which got the price down extremely low.  Thanks again Amazon.  You are the best!!!", "Date": "October 21, 2011"}, {"Title": "I love my new Toshiba HDTV/DVD player.", "Author": "trishwall", "ReviewID": "R1UEJ23MSGMUI0", "Overall": "5.0", "Content": "Really no setup. It took me about 10 minutes to remove it from the box, insert the stand and set it on the table. The picture is beautiful and the DVD player is a cinch.This first purchase was STOLEN from me after about a month, but Amazon FULLY REFUNDED the entire purchase price!!! What a company!!!Then, I ordered the exact same product again after I moved, but it was no longer sold directly by Amazon. BTV was selling a refurbished one for about the same price. However, the remote control didn't work, so I wrote the seller about it and they FedExed a new one, that works, and now I'm good to go. The seller was wonderful to deal with. And even though this product is a \"refurbished\" product, I've had no problems with it other than the remote control. I recommend this dealer, BTV, as a great one who contracts with Amazon. THANK YOU!!, from a satisfied customer.", "Date": "December 30, 2011"}, {"Title": "Nice TV - needs HD hook-up for best picture", "Author": "Janice", "ReviewID": "R19V308WHGZLRO", "Overall": "4.0", "Content": "The TV was easy to setup as far as the stand and connecting to cable.  We needed help from Time Warner, however, when it came to the HD cable box hook-up.  We didn't like the picture without the HD cable box because it was not clear enough.  Now it is fantastic.  The DVD player works well so far and is not hard to figure out.", "Date": "November 15, 2011"}, {"Title": "LED TV/DVD", "Author": "Tim D. Lee \"DVD & Book Collector\"", "ReviewID": "RGQJ3YQ9QZF8L", "Overall": "4.0", "Content": "This is an excellent TV/DVD.  I use it in my workout room and it provides exellent playback of DVD's.  It is also useful when playing back Audio CD's.", "Date": "November 11, 2011"}, {"Title": "nice", "Author": "mel", "ReviewID": "R1MO6WATMAL8SA", "Overall": "5.0", "Content": "I have had much success with Toshiba TVs.This model is no disappointment --- excellent picture.With DIRECTV it picks up the 1080i very nicely.--- Happy Camper (does this date me?)", "Date": "November 9, 2011"}, {"Title": "Excellent combo HD/DVD toshiba.", "Author": "jadeslade \"jadeslade\"", "ReviewID": "R3T7CRVLOSKS5C", "Overall": "4.0", "Content": "The first one I got just didnt work. There was a sharp ding on the box, so I suspect the tv got a sharp blow in transit and did something. Anyway, Amazon did a super fast replacement with the usual excellent methodology they use. I use this in the lounge in my office and it is a very good picture and the DVD is working fine. Very good product for price. Set up is very easy.", "Date": "November 9, 2011"}, {"Title": "Toshiba combo tv from Amazon", "Author": "ray6433", "ReviewID": "R13QM971BXBCBK", "Overall": "5.0", "Content": "TV works great. The picture quality is excellent. DVD player worked very well with absolutely no problem. Shipping was faster than expected. I highly recommend this TV.", "Date": "November 9, 2011"}, {"Title": "Excellent Value", "Author": "joeboz", "ReviewID": "RUX73L0KXITAB", "Overall": "5.0", "Content": "This 32 inch Toshiba TV with built in DVD is perfect for a bedroom. The price was $50 below any local retailer so it was an excellent value as well.", "Date": "November 2, 2011"}, {"Title": "Toshiba 32\" TV with built in DVD", "Author": "G. Barry", "ReviewID": "R1ZBYR29RQTY97", "Overall": "4.0", "Content": "The TV is great but maybe a little overpriced.  I seen others similar for less money but went with the Toshiba because I have a 22\" Toshiba also with the built in DVD and I was pleased with that set.  Delivery was fast and product arrived in good condition.", "Date": "September 8, 2011"}, {"Title": "Be forewarned...", "Author": "Al Anon", "ReviewID": "R3G2ZTELIK09WY", "Overall": "4.0", "Content": "My only complaint about this tv is the inability to attach analog external speakers. I find it difficult to understand why tv manufacturers no longer include a headphone jack... I bought this unit in the 26 inch size about 2 yrs ago and had no problem hooking up my spare set of powered computer speakers (LogiTech). Other than that, this is a nice set.", "Date": "February 7, 2012"}, {"Title": "Great LED-LCD but it's only 720p", "Author": "Frequent Traveler", "ReviewID": "R3FLHNB2HGHONB", "Overall": "4.0", "Content": "As the title reads. We really like this tv. It is really hard to find an LCD tv with a built in dvd player, that's bigger than 23\". This is the only one that I found that met most of my wants. The only big loss with this one is that it's only 720p. We looked for 6 months for a 1080p, 32\" LCD w/ dvd player without any luck. Four Stars for this one.", "Date": "December 8, 2011"}, {"Title": "Therapy Star", "Author": "Roses", "ReviewID": "R2C3MMU911K4RB", "Overall": "5.0", "Content": "This Toshiba HDTV-DVD combo went to the Veterans Hospital. When asked if there was something Lynnwood Elks Lodge could purchase for the hospitalized Veterans, the therapist let us in on the secret of this type of combination TV/DVD and how it aids greatly in regaining use of injured muscles, eye-hand coordination and upper body movement  when coupled with a Wii console. Head injuries abound and two young men who share a room are looking forward to using these gifts as soon as it can be mounted to an AV cart. What a great gift from a family unit or work place to those who are really in need of our help.", "Date": "November 25, 2011"}, {"Title": "A great TV for a very reasonable price!", "Author": "cowman", "ReviewID": "RWD1GQLLDH3Y5", "Overall": "5.0", "Content": "We bought this TV to mount on the wall in our bedroom and it has been ALL we hoped it would be! The color is beautiful and the picture clear and bright...the HD feature is a definite enhancement (enjoyed, of course, only if you have HD service). The quality you are getting for the price paid makes it a \"steal of a deal\"!", "Date": "November 19, 2011"}, {"Title": "Very pleased", "Author": "Bama Mom", "ReviewID": "R3P5R1QAKB636", "Overall": "5.0", "Content": "I have been enjoying the TV with its built-in DVD player. I like not having to have an extra piece of external equipment to clutter up the place.", "Date": "September 29, 2011"}, {"Title": "A few odd choices by Toshiba", "Author": "Fatima Hoang", "ReviewID": "R1WJD3TTS5VJF9", "Overall": "3.0", "Content": "I got three of these tv's to use in a museum exhibition.  We needed medium sized tv's with built in DVD players because the exhibit was going to travel and we needed something simple to use for future venues.  Out of the box everything looked great, we set it up and things seemed fine.  But upon actual use, I found some odd usability issues with this tv.  The biggest issue I have with the TV is that the only audio out port that it has a is an optical out port.  I'm not sure who Toshiba was designing this for but it was not for the the normal home user.  If want to use external speakers that don't have a TOSLINK-in or headphones with this TV, you'll have to just through a few hoops to get that going.  I've also noticed that the tv has trouble picking up the remote signal when using it from the right.On the bright side, the picture is nice and the tv is pretty light and thin.I'm not in love with the tv so next time I need a TV with DVD player, I'll keep on looking - thought there aren't very many options.", "Date": "October 26, 2011"}, {"Title": "Frank's LED", "Author": "mathgnome", "ReviewID": "R2BAI82KWHQTV4", "Overall": "5.0", "Content": "Item was received in an expeditous manner. It was easy to set up, and has a beautiful picture. I have had a Toshiba combo vcr and dvd previously for ten years. The television is still good, however the vcr and dvd aren't working properly now. I have found the Toshiba product to be dependable, and that is what influenced my decision to purchase this product.", "Date": "October 16, 2011"}, {"Title": "Poor quality - DVD player doesn't work", "Author": "J. Bougher", "ReviewID": "R36YRRNEWYCD01", "Overall": "2.0", "Content": "Really pretty disappointed.  On a cost/feature basis, this seems to be a pretty good buy.  Unfortunately, it was delivered with a bad DVD player.  It will start playing, then 10-30 minutes begin making noises.  From that point on, the player skips and locks up non-stop.  I've been really pleased with my two Panasonic flat screens.  The Toshiba is going back to Amazon and I'm going back to Panasonic.", "Date": "September 29, 2011"}, {"Title": "DVD never worked", "Author": "Boskley", "ReviewID": "R3NH8JLU1D6PYH", "Overall": "1.0", "Content": "My DVD player never worked. After going through an excruciating telephone troubleshooting process which included multiple times of me running out of time and having to call back I was eventually told to bring it to a service center in the middle of a small town over 60 miles away. I was also told that the fix was on me. Actually, to quote, the person said, \"Of course it's up to you to pay for the fix.\" Way too much work for something that is now an overpriced TV with no DVD.", "Date": "December 17, 2013"}, {"Title": "do not buy", "Author": "J. Reeb \"jarpsyd\"", "ReviewID": "RG0KG93G5UYBB", "Overall": "1.0", "Content": "This is an awful product from an awful company - we had problems with it stopping working intermittently after about 9 months of occasional use.  When we called tech support they indicated that we should unplug it and let it reset.  We did this, and it worked, and we had to keep doing this about once a week.  It finally stopped working altogether - two weeks after the warranty ended - and Toshiba even with record of the problems - refused to assist us.  Beyond terrible. Never again.", "Date": "December 12, 2012"}, {"Title": "Almost perfect!", "Author": "Donna's Luxuries", "ReviewID": "R1DF4YE07PXNQR", "Overall": "5.0", "Content": "It is a bit disconcerting to buy a TV on line.  The price and size fit my needs so I purchased this about a year ago.  It works perfectly and the DVD player is very easy to use. I am not at all \"techie\". My one complaint is that the stand does not move.  You have to move the whole thing if you need another angle. Would recommend it to you, just have a base that is wide enough to pivot the TV.", "Date": "November 16, 2012"}, {"Title": "Fastest Broken TV Ever Had", "Author": "Austie", "ReviewID": "R2SXU189538GD2", "Overall": "1.0", "Content": "Tv just broke yesterday, after only 8.5 months enjoying it. I never write reviews, unless they are great or horrible. This one qualifies for the latter. No tv in this day and age should break in 5 years much less 1 year. Horrible. Power button turns on and then just turns off after 12 seconds. After googling it, looks like its a major problem with Toshiba. Stay Away", "Date": "October 15, 2012"}, {"Title": "Dud", "Author": "Jodie Tierney", "ReviewID": "R23XOJNZ4Y2NZO", "Overall": "1.0", "Content": "I bought this TV new in Dec of 2011 it stopped working -won't turn on - on June 1st. So far Toshiba has done nothing but put me on hold for 10+ minutes at a time and hang up on me three times.", "Date": "June 3, 2012"}, {"Title": "Failed right away, still waiting for repair 3 weeks later...", "Author": "Elizabeth", "ReviewID": "R25YL6QZ7KW167", "Overall": "1.0", "Content": "It's a fine TV, but like the Toshiba computer I bought around Christmas, it has failed and the customer service is horrible.  I was on hold to various departments for over an hour for my computer for a defective USB port and they finally replaced it, but I had to pay $30 to ship it to them, I had owned it for 16 days.  I got this TV at Christmas and by March it also failed.  I'm 4 long phone calls and 3 weeks into trying to get a repair.  Toshiba craftsmanship is no more and the service is, well, it isn't.  Try elsewhere.", "Date": "April 9, 2012"}, {"Title": "Excellent TV at the right price", "Author": "warlord", "ReviewID": "R3RBPHL7OWBZM5", "Overall": "4.0", "Content": "First good sign was that arrived really quick after I placed my order, nothing was damaged, and immediately we were able to plug it and enjoy it. This TV was purchased with the intention of using at a front desk in the company where I work and display all day the DVD of the company. I did not test its capability for tunning air or cable channels, only to function as a monitor display and it was amazing. The colors and resolution are great. It is really lightweight and a beutiful TV. Excellent Toshiba!", "Date": "March 23, 2012"}, {"Title": "Last of the TVs with built-in DVD players ?", "Author": "Mac_Cat \"MacIntosh Man\"", "ReviewID": "R32KAGHC9NW1DK", "Overall": "5.0", "Content": "I was surprised at how few TV's have a built-in DVD player.  I bought this one for my Dad, who's confined to bed.I'd be more impressed with a Blu-Ray player, but for just playing my collection of DVDs, it's idea.Anyway, it arrived quickly, set-up easily, and it it gets about 20 channels off the antenna (I don't have cable service).  Excellent reception with an old $15 antenna!It's been running for about 5 months and I have no regrets.", "Date": "March 21, 2012"}, {"Title": "Toshiba 32\" HDTV", "Author": "AnnC", "ReviewID": "RF6FDV4FP5UXU", "Overall": "5.0", "Content": "My daugher, granddaughter and I bought this TV for my husband for Christmas.  He has enjoyed watching this TV in what we call his \"Sports Room\".  This TV has a built-in DVD Player which works well.  Color is great.  We have three Toshiba Televisions and so far have been very satisfied.", "Date": "March 15, 2012"}, {"Title": "I like it", "Author": "Robert Jeremiah", "ReviewID": "R21UZ0UNB40VAN", "Overall": "4.0", "Content": "Bought this for my wife for her birthday.  Seems to be doing fine so far.  Easy to set up and figure out how to operate.  My wife wanted the dvd feature built in", "Date": "February 29, 2012"}, {"Title": "I got a lemon", "Author": "S. Weiss \"shwony\"", "ReviewID": "R23KUIV3NMOOLX", "Overall": "1.0", "Content": "I ordered this TV after reading all the glowing reviews here.  It was delivered 2 days after the order was placed, set-up was a breeze and we were enjoying watching dvd movies on it for 2 weeks.  Then the trouble started -- suddenly with a \"popping\" noise when dvd's started playing.  Sounded like a bag of popcorn in a microwave oven.  Then the noise spread to regular tv viewing.  It would suddenly come on, then quit, then start again. I called Amazon customer service and returned the unit.  The return label arrived one-day after I called, via UPS and the TV was picked up.  Amazon has wonderful customer service and I'm very grateful that this was handled so easily.  I didn't get a replacement and purchased a separate dvd player.", "Date": "February 13, 2012"}, {"Title": "Love the TV and DVD player, sound qualtity needs improvement", "Author": "Mel B", "ReviewID": "R5UVYSR7R9V5Q", "Overall": "4.0", "Content": "Toshiba 32SLV411U 32-Inch 720p LED-LCD HDTV with Built-in DVD Player, Black is a wonderful HDTV/DVD combo.I had Toshiba before and love its reputation and my personal experience with this label.I am overall pleased with this purchase, but have noticed the sound quality is very dull, flat and very low compared to my previous old model Toshiba TV. The picture is good. The print at the top (when you select the INFO button) is quite small.I think the price for this particular purchase was outstanding. I did quite extensive research before I made my 1st HDTV selection and this was the BEST choice for the purchase price I could afford. I wanted a 37\", but also wanted a DVD player, so to me it was obvious it was better to substitute size for options.", "Date": "February 4, 2012"}, {"Title": "Toshiba 32", "Author": "dgn", "ReviewID": "RVHMYMU2MISTS", "Overall": "4.0", "Content": "I love it.  I'm a middle age female and it took a little thought but it was not very hard to set up.  We are enjoying it very much.It came UPS unwrapped and the box looked a little banged up, but it was fine.", "Date": "October 4, 2011"}, {"Title": "keep away if you want to use it with Headphones", "Author": "L. Servi \"sweet dreams\"", "ReviewID": "RBFAYJTP4896K", "Overall": "1.0", "Content": "Toshiba 32SLV411U.....keep away if you want to use it with Headphones,I ended up spending additional $80.00 to be able to use this 32SLV411U with headphones.otherwise it a good Combo.", "Date": "February 3, 2012"}, {"Title": "Paraffin Bath: Handy?  Maybe, but Leaky", "Author": "carrita", "ReviewID": "R3HX3ZZGZRF9AH", "Overall": "3.0", "Content": "Although the Dr. Scholl Paraffin Bath provides a warm, soothing, pliable medium for the hands and fingers, one must lay a non flammable sheet beneath the tub or one must clean up hardened wax regularly. Of course this is not a heavy price to pay but it does make the use of this product less carefree. The manufacturer should attend to this weakness and remedy it; and we will focus on remedying the fingers.", "Date": "November 15, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004MFBH8I"}}