{"Reviews": [{"Title": "Amazing TV, Almost Perfect", "Author": "E. Kirschner \"bjcamberwell\"", "ReviewID": "R2CD83PNQL6LPB", "Overall": "4.0", "Content": "To preface, this tv is a replacement for the UN55B8000 LED I had that malfunctioned.  So this review should provide a good perspective for those debating between LED and Plasma like I was.Overall, the PN59D6500 is an excellent tv.  It displays an amazing picture with deep blacks and beautiful colors.  It just has a few issues which keep it from being perfect.Picture: The picture is great, especially for my primary usage which is bluray movie watching.  In a dark environment watching a bluray movie I don't think any other tv out there can touch it.  It's like being in a state-of-the-art movie theatre but better.  The image is just so deep and rich.  Really awesome.  For this environment, it's no contest superior to the LED.During the daytime, it's a different story.  I would say that the picture is very very good, but it's just not as bright as an LED.  The whites on it are dull in comparison and you just don't get that pop that is easy to see at any Best Buy when you have a plasma next to an LED.  So for this reason, if your primary interests are day time tv watching or sports, you may want to consider the LED.  Not to say this tv isn't still great during the day.  I watched some hockey on ESPN and the ice still looks plenty bright and white.Gaming: I have to give the edge to the Plasma here.  Again it's not quite as bright as LED but it just presents a superior image with richer color.  I thought God of War 3 looked great on the LED but on plasma it's just incredible.  Feels like you're playing the movie 300 or something.3D Movies: I think the 3D on this tv is a great added feature.  Now that they are giving away the glasses for free, everyone should be excited about it.  However, it's an added feature, for me, not a reason to buy this tv.  The reason for this is that while watching a 3D movie is awesome, it's not perfect technology.  The sense of depth is awesome, but the image is too dim and there is noticeable flickering.  I see this as something that will be cool to watch for those special big budget fx films (Avatar, Tron) but definitely not going to take the place of standard 2D viewing.  I tried the 3d on Sony TV and it had equivalent amount of flickering.  LG 3d doesn't have as much flickering but the picture is not nearly as good.3D Gaming: Also very cool but the technology is not up to par here.  This isn't the tv's fault.  PS3 is just not ready to deliver the goods here yet.  In order for it to process 3D it has to cut the game's resolution in half.  The difference is very noticeable, especially on a giant screen like this.  Playing Killzone 3 3D, which is the flagship 3D title, the sense of depth totally enhances the game experience.  The first time you line up your sight and feel like your target is yards away is really something.  It's only afterward you notice that the graphics look like crap.  The half resolution makes everything in the picture look jaggy, pixelated, and slightly shimmery.  Almost like you're suddenly playing a Wii game.  Again, it's still fun to try but I look more forward to seeing the 3D that PS4 can do.Buzzing:  The number one complaint of plasmas, particularly samsungs, is that they have an issue with buzzing noise.  Supposedly that was fixed on 2011 models.  Well, it's still there, slightly.  But it's faint.  And only when the screen is completely black or mostly dark (like movie credits or night scenes).  When this happens you notice the rise of a high pitched buzz.  It's not very loud, not as loud as the ps3 fan.  But it's high pitched so it cuts through everything else.  Because it doesn't happen most of the time and it's not very loud, I have decided to live with the issue and usually will forget about it.  A minor annoyance.Of course, that brings me to why I got this tv in the first place which is that the UN55B8000 I had had the well known problem of flashlighting in the corners.  This caused a terrible black level and screen unevenness.  Samsung Service was diligent and very professional about addressing my problem.  On the 3rd service call they brought me a whole new panel.  The new panel had the same problem but even worse.  I was surprised when they called me and said they would give me a full refund.  So nice job to Samsung service dept.I never got a useable LED tv so if you do decide to go that way, make sure you get one with no flashlighting.Overall, I definitely recommend the plasma over the LED.  It just has a better picture, especially for watching bluray movies.  If you don't care about that and mainly watch daytime television and sports, you may want to consider the brighter picture of the LED.", "Date": "April 29, 2011"}, {"Title": "Great TV. Best Value you'll find", "Author": "Stephen Wells \"srwells\"", "ReviewID": "RBPSVCFQPZQQY", "Overall": "5.0", "Content": "I think you would be hard pressed to find a better value on a 55-60 inch tv than what Amazon is offering. If you are like me you have narrowed your search down to 2 or 3 TV's and you are trying to determine which one will be perfect for your needs. I hope this review will help you in determining whether this tv is right for you.Before I pulled the trigger on this TV I had a few main concerns that I was worried about.  *I was concerned about the Plasma Buzz that is normal for plasma TV's  *I was concerned about the glossy surface being too reflective of the 6 windows I have in my living room.  *I was concerned that the tv would not be bright enough for my circumstances since I don't have it in a darkened \"theater\" roomBUZZING:  I have read horror stories about people who buy plasma tv's and complain about a buzzing that emits from the TV and makes watching/enjoying movies difficult. I am happy to report that, while there is a buzzing that I can hear when sitting directly in front of my TV at viewing distance, I can ONLY hear it when there is no sound coming from the TV (like during TV startup or while navigating silent menus like Netflix). When I first got the TV I tried to listen for it during movies, and at times I could hear it if I tried really hard during quiet scenes. When I don't try to listen for the buzzing, It is not a factor. I compare the buzzing to the fan noise on my xbox. If you listen for it it does exist, but when enjoying a movie or a game, it wont distract you.GLOSSY SURFACE:  This TV went in our living room which has about 6 windows, and there are kitchen lights directly behind the seating area that reflect off the TV when the TV is turned off. When the TV is turned on, I have not noticed any problems. I do close the blinds on the windows though. Again, If I am looking for the reflections, I could probably distinguish them, but I have watched movies and played games in the middle of the day and I can't complain about the surface.BRIGHTNESS:  Typically, Plasmas are not as bright as new LCD's. This TV replaced a 3 yr old LCD and it seems brighter to me. I can't compare it to the new LED back-lit LCD's because I don't own one, but this tv is plenty bright to enjoy movies in even well-lit rooms. No complaints here.Okay, so those were my main concerns. Now for some of the things that got me interested in this TV in the first place: The color on this TV is so even and consistent across the screen. There is now light bleeding in on the corners or edges. The black levels are super dark and crisp. I haven't done any calibration yet and sometimes colors do seem a bit over-saturated but again I am sure this is something that can be fixed with calibration. Those over-saturated scenes haven't been severe enough or frequent enough to make it worth my time to calibrate.The size of this TV is awesome...if you have seen a 60\" TV next to a 55\" you know that that 5(in this case 4) inches makes a big difference. Oh and it is only about 1.5\" deep. This depth was big for me as I wanted something thin but I didn't want the flashlighting and light bleeding that plagues LCD's.Things that didn't influence my decision much: 3D. I am not a huge 3D fan--I think it is neat and fun, but I prefer non-3D over 3D 95% of the time. If I really cared about 3D I personally would have gone with a Passive 3D set since you can get 10 pair of glasses for $20 compared to $40 each for the Samsung active shutter glasses. I did watch Tangled 3D and the glasses bundled with the starter kit were pretty good. I didn't notice any flickering or anything like that and the depth of the 3D was impressive. The 2D to 3D conversion on this set was pretty week as expected. Smart TV. This TV has wireless connectivity and I really like that it can receive firmware updates automatically and wirelessly. I haven't used the apps much since I use my xbox for netflix, but the menu accessing, and browsing apps is pretty good.I think I have rambled on long enough. I guess if I could emphasize one point it would be that all TV technologies have trade-offs. The Plasma technology has weaknesses and imperfections. It also has a lot of advantages and strengths over other technologies. I do play a decent amount of video games, so the strengths of the plasma for gaming out-weighed the weaknesses. Hope this review helps.", "Date": "June 23, 2011"}, {"Title": "Why buy LED ?", "Author": "Tony", "ReviewID": "R15QVGSZW09HBY", "Overall": "5.0", "Content": "This TV is awesome. I conducted research on the LCD and LED T.Vs on the market and they don't come close to the picture this T.V has. Setup was easy and the TV looks amazing. The smart TV function is fun to use and worth the added increase in price. The 3D is the best i'v seen on any TV. Plasma is still the king of TVs. Way to go Samsung!!! By the way: NO BUZZING!!!", "Date": "April 20, 2011"}, {"Title": "Incredible TV", "Author": "Sean \"Sean\"", "ReviewID": "R1VOXMHUW8WEM2", "Overall": "5.0", "Content": "I am very picky when it comes to my home theaters. I shop for a long time and figure out where to find the best bang for the buck. I shopped real hard when deciding to upgrade to 3D and, as expected, the plasmas had the best picture for both 2D and 3D. What I did not expect was that the Panasonic models could not match the picture quality that this Samsung offered at a better overall price. I got the TV, two sets of glasses, and five 3-D blue rays (Shrek 1-4 and Megamind) for just over 2K, and added a couple sets of the active blue tooth glasses for less than 50 buck eachThe 2D picture is breathtaking, with incredible detail and very deep rich blacks. I have never seen such good representations of night scenes, where all the detail is still there. The 3D picture is simply stunning - you need to see it to believe it. The 2D to 3D conversion works much better than expected, and even makes your photographs look 3D when streamed to the TV. THe picture quality and response time for ps3 games is also better than I have ever seen.This is also one of the new smart TV's, and it does it well. It has WiFi built in, and a lot of applications and features in this area. I have not used many of the apps, but the facebook is set up very intuitively and works well. While this TV handles all the typical media center duties, I still just use my PS3 for these.The TV has an app for iPods, iPhones, etc that allow them to be full function network-based remotes for the TV. This is especially useful for using these devices to handle the text/typing/etc for facebook and other social networks. It even maps the TV control to motion gestures on the iDevices if you desire.When I bought this there were not a lot of reviews, since it was (still is) a brand new model. I am so glad I took the leap...", "Date": "April 21, 2011"}, {"Title": "brightness pops", "Author": "A. Handlovits \"Alex H.\"", "ReviewID": "R3JZ44EY338V4R", "Overall": "4.0", "Content": "UPDATE: With the fix that Samsung finally developed I can finally enjoy this TV at the pristine picture settings it's meant to be enjoyed at.  Would give it 5 stars but I'll leave it at 4 for the fact that they released their 2011 TVs with this problem in the first place and because it took them so long to release a fix.  As of 2/8/12 the fix is not officially available to download off the Samsung site but if you simply google \"Samsung D series FBr fix\" you'll find the right instructions.Original 1 star review below-------------------------------------------------------------------------It's a great TV minus one horribly aggravating problem.  If I had researched samsung \"D\" series TV a little bit more and knew about this problem earlier I would've never gone with a Samsung TV.  Seems these sets can produce what the hi-def A/V community is calling \"brightness pops\" (highdefjunkies, avsforum as well as others).  It's like the TV abruptly and randomly changes screen brightness, sometimes right in the middle of a scene. It's especially noticeable during movies with black bars and you can watch the black go from darker to lighter during certain scenes, and it is repeatable as well. If you watch the same scene over again it will happen every time.  It can happen multiple times a scene or just once in awhile, but I've never gone long without one and it doesn't matter the video source or any change in video settings I try.  Some settings seem to help reduce the appearance of the pops, but none have ever made them completely vanish, and at the cost of optimal video quality it really isn't a desirable solution.  The pops definitely take you out of the immersion of whatever you're watching and instead of concentrating on a show or movie you become concentrated on watching these brightness pops.  They are not super obvious and are sometimes subtle, my girlfriend for instance has never mentioned seeing them and I don't point them out to her so as not to ruin her experience, but once you notice them, you'll always notice them.The best theory out I believe is that it's a software issue related to energy saving, but there's no real proof of what the cause is, though hardware is very unlikely since not even having a Samsung tech switch out the main board or eco sensor in the TV has proved to fix the problem for anyone.Panasonic actually addressed brightness pops with their newest TVs with a firmware fix and people are very happy and appreciative of their efforts.  Samsung on the other hand has not even admitted that this fault exists with their TVs.  Looking back I wish I had gone with Panasonic, but it's too late for me now.  Only thing I can do now is hope for a fix one day and also warn others of this problem.", "Date": "September 26, 2011"}, {"Title": "Finally!", "Author": "Gidusko", "ReviewID": "RR2DO2KE3CEF6", "Overall": "5.0", "Content": "First let me say, I love my TV. period.This is actually a replacement for a 2010 pn50c6500.  I was almost ready to swear off Samsung for life with that TV.  I purchased the PN50 about 2 months ago and had nothing but problems from day one. When they delivered it the Pilot driver wouldn't go up my driveway he said it was too narrow. I had to go get my pickup and put the TV in the truck and take it up myself.  I should have recognized the bad omen right there.  When I first started up that TV it sounded like I was living under High Tension Lines, It buzzzzed and buzzed. The picture had odd uneven black marks when there was no picture being shown and the black was kind of grayish. I called Samsung support 15 mins after unpacking and they scheduled:Tech visit 1: The Tech came and said I needed a new panel as that would fix the discoloration and most likely the buzz.Visit2: He came back the next weekend and replaced the panel the discoloration was gone but not the buzz. He said I need a new power supply. I was frustrated but felt as long as they make it right, im ok.  I mean these things happen right?Visit3: The Tech guy came back next week and replaced the transformer and off he went.  I prepared myself for some movie time but when I turned on the TV the main speakers didn't work but the sub did.  I called the Mr R on his cell phone (he gave me his card) and explained the situation, he said that that seems very odd so he turned around and came back to see what happened.Visit3.5: He took off the back panel and checked for broken wires as well as tested the speakers in another port.. no go.  This time he said I needed a new main board.  At this point my patience has worn pretty thin. I know every company produces a dud but com'on. I called Samsung to complain that I shouldn't have to have a tech at my house every weekend to fix my new TV! I didn't purchase a TV that's been cobbled together from spare parts! I said I want a refund! They said NO, they will not take it back unless the Tech declares it to be unfixable. I felt pretty annoyed and some pretty serious buyer's remorse set in. I really felt I wasted 1000 bucks.Visit4: MR R came back the NEXT weekend and replaced the main board but that didn't fix the speaker problem outright. He said he was stumped and that the board he brought appears to be new defective. He put the rear panel back on and turned on the TV.. The speakers started working! I was not happy as it means the problem wasn't \"Fixed\" as much as subdued for a bit.  We then noticed my final problem with this TV \"Ghosting\" or \"Image Retention\". The screen would hold ANY image that was on the screen for long after the TV was shut off. The tech sighed and said now we have ghosting and continued to explain that there is a board that writes the picture and a board that deletes the picture and it appears the board that deletes is not working properly. I was done, done... done! I thanked him for his help as he was a very nice guy and I did feel he was competent, I just had a bad TV.I Spoke with Samsung and demanded a replacement or refund. I spoke with several people and after explaining my situation and faxing a copy of the repair invoices they decided to exchange.They gave me a 2011 pn51d6500 because they said they didn't have any pn50s in the warehouse. This was fine by me it's the same model number with some nice little extras.The delivery company came to my house about a week and a half later. They came up to my door and the men boxed up my old TV and set up my new TV!  It took me about 10mins to be completely transformed to Samsung hater back into Samsung Lover.  The blacks are very dark even compared to my previous PN50c6500 and very uniform.  The colors are bright and true. I have Comcast hd and I just ooh and ahh at the nature shows on the science channel. I feel like I am sucked in.  The Thinner bezel looks great and is non reflective. I play xbox and PS3 and I have NO image retention problems or ghosting at all! IR was a big problem on my old pn50 with Net Flix. I could read the Net Flix title for ages after browsing though the shows available. I have no abnormal buzzing (plasmas do kinda hum). When I had the PN50 I would go to Wal-Mart and be mad at myself for not getting a tv there as all the pictures looked better.  Now I am sooo glad I didn't. The image on my PN51 is awesome. I have not tried the 3D yet so I cant speak to its qualities.  I would recommend this to anybody looking for a great TV.", "Date": "April 11, 2011"}, {"Title": "Picture is Great, But...", "Author": "DesertRat71", "ReviewID": "RW9RGORGDK475", "Overall": "4.0", "Content": "This TV appears to be made of quality materials with the exception of the point at which it's attached to the stand. This attachment is cheap plastic. It comes with eight screws so that the customer can attach it to the TV. It's so cheap compared to the remainder of the TV, including the stand itself, that it appears to have been an afterthought. Although the surface on which I placed the TV is perfectly level (I checked it with a carpenter's level), the best I can achieve with the plastic attachment to the stand is a slight left tilt. Shims are not an option as they'd be visible and unsightly and the TV is too heavy to be mounted on the wall by the cable outlet.One of the options available on this model is firmware updating over the Internet. After a relatively pleasant evening of watching an admittedly great picture (despite the left lean), when I turned the TV on this morning I was greeted by a prompt asking me if I wanted the firmware updated to a newer version. I selected \"Yes\". Unfortunately, this selection immediately trashed the current firmware without updating it and the TV will no longer turn on. A call to Samsung confirmed that the firmware had been trashed. I am now awaiting a call from a Samsung designated repair shop to set up an appointment for them to come out and repair a day-old, $2,000 TV. Today is Tuesday, I was told they would call me no later than Thursday.This was my first experience with a Samsung product.*****  First Update  *****The good news: a repairman came out today and took a look at the problem.The bad news: the motherboard needs replacing. This now needs to be ordered, delivered, and installed. Another repair appointment will have to be scheduled and the repair shop has informed me there's no guarantee that this will happen before the weekend.To recap: this brand new TV lasted exactly one day before requiring major repairs.This will be my last experience with a Samsung product.*****  Second Update  *****I received a call from Samsung this morning. They told me over the phone that they had a fix for the problem. By entering a specific key sequence into the remote while the logo was flashing on the TV it was able to finish its upgrade sequence and is now functional. The picture is fantastic and the TV does what I ask of it, which is to display HD programming with great contrast and color. Additionally, it's aesthetically pleasing and is the centerpiece of the living room.I have upgraded my rating from 2 to 4 stars. Had either the Samsung help line or their authorized repair shop been aware of the fix for this issue and had I not been down for 2 days I would rate it at 5 stars, despite the plastic stand attachment.", "Date": "April 12, 2011"}, {"Title": "One Word - Amazing!!!", "Author": "K. Aglione \"Amazon Buyer\"", "ReviewID": "R3POMR94F8C0YL", "Overall": "5.0", "Content": "I was a die hard LED owner and I never thought I would ever consider purchasing a plasma. However over 95% of the LED LCD TVs on the market today use cheap LED edge lighting.This TV puts even FULL BACK-LIGHT LED TVs to shame. The picture is uniform. The colors are vibrant. Fast action scenes look great. The blacks are black not grey like on an LED LCD. Also, the 5,000,000 : 1 contrast ratio is apparent. I was watching a basket ball game and it was so real I felt like I was at the game. I have not had a chance to use the 3d, as I don't really care about 3d, but I will update my review once I use it.The design is also wonderful. It is only 1 1/4 inches deep and energy efficient. Also, it has unlimited streaming options and APPS built into the TV - via the Samsung Smart HUB.", "Date": "March 31, 2011"}, {"Title": "Brightness pops fixed", "Author": "Alyssa Esquibel \"Dasanii19\"", "ReviewID": "RWYPZ1LWFRYCV", "Overall": "5.0", "Content": "Yep, to all those negative reviews in regards to the brightness pops, finally a fix! [...]You can contact Samsung and they will mail you a USB stick with a firmware that will fix your brightness pops. Search avs.com for more info as well", "Date": "February 2, 2012"}, {"Title": "months of research", "Author": "Paul Bonaddio \"PrB\"", "ReviewID": "RV7L4TI9H0W5X", "Overall": "4.0", "Content": "This Plasma is replacing a 3yr old Hatachi 50\" 701. That was my first Plasma I owned. It served me well.A back-story. Last month a purchased the LG lv9500 from a at home shopping network.  It took weeks to arrive.  The full NANO LED LCD was amazing! I never saw HD look so good.  Everything \"popped\" off the screen and black levels were great.  Now here comes the problem.  It was shipped from FL to PA with AIT behind the wheel. The box it came in was mostly in good shape but the packing material it self was horrible-almost no protection.  The frame of the TV was bowed concave.  The picture was affected with backlight bleed.  Even though I love this TV I had to return it and not reorder in fear that it would be damaged again.After weeks of reading online reviews I choose the 6500 as my new TV.  It was shipped with home Direct, a company I never heard of before, then handed off to the local delivery company Custom Courier Solutions. Let me inform you that they are a top notch operation! With Amazon's ordering process everything went smooth.  Within a weeks time the TV arrived at my home.  The \"silver delivery\", which was free BTW, was flawless.  They asked me where I wanted it and they unpacked and put it together and placed it on my stand.  To reiterate, the shipping was FREE oh and the enormous box it came in looked like it was never touched by human hands.So far so good.  As many of you know, coming from a LED LCD to Plasma the picture is different.  At first it didn't have the intense pop the LED had and I was a little bummed out. I was expecting great things from the 6500.  I spent more hours online in the forums reading about other peoples setting.  After I played with the adjustments for awhile I got it to look like the LG LV9500 well about 90% of it-that's a good thing! With 4 more inches of viewing size this TV rocks.  The sound system built into this Plasma is really good.  Night and day compared to the LG that had a built-in 5\" sub.  The sound truly fills the room with sonic fidelity I never herd from a TV before.  This set is very thin for a Plasma, almost as thin as the LG.  The build quality is better then the LG by a lot.  It just looks super high end.  Another interesting note.  The stand swivels. On the Samsung website it's listed as a fixed stand, it is NOT.  The manufacturing date is August 2011 which in it's self is incredible considering I ordered it on 8/15/2011.I had some trouble getting the Smart TV feature to work.  It would do anything.  Then out of the blue a TOS screen appeared after about 3 hours and downloaded all the updates. Now it works fine.The screen treatment is leaps and bounds over the LG's.  It still shows some refection but it's muted.  The LG was really a mirror.There is NO buzz!That's it for now.  I will update if needed.  Have fun my fellow Tech junkies as we all know that online research is part of the game to pick the right tech for us.", "Date": "August 24, 2011"}, {"Title": "Brilliant TV let down with Brightness Pops", "Author": "Ray", "ReviewID": "R9K3AZ2NVQC53", "Overall": "1.0", "Content": "I have owned this TV for well over 3 Months now and have been quite happy with it apart for 2 major flaws...1. Brightness Pops, with all types of Video.. very annoying2. BuzzingSamsung really need to get threr finger out and get the above fixed big time or I for one will be handing this tv back... shame", "Date": "September 29, 2011"}, {"Title": "Gotta see it to believe it!", "Author": "DoomDDS", "ReviewID": "R22RUY5TKAYKTM", "Overall": "5.0", "Content": "Wow!  I mean, wow!  I've been a Samsung plasma guy since 2006.  I upgraded from my starter 42 to the 50 in 2009 and I have upgraded every year.  This 2011 pn51d6500 is amazing!  The colors would make an LED wet itself in shame.  Top it off with the 5,000,000:1 dynamic contrast ratio and the blacks compared to the colors are insane.  I thought my 2010 was awesome but this year is like a brand new beginning for Samsung plasma.  (Avatar Blu Ray will make grown men cry with excitement)  The 3D feature upconverts 2D-3D with the push of a button.  If the glasses weren't so expensive I'd try them out...  The Smart Hub is great.  The plasma has built in wi-fi and connection to apps and the internet are very handy.Bottom line:  My friends with LED tvs, which are freakin' awesome, were drooling over the quality of my new plasma.  It really is awesome!", "Date": "March 19, 2011"}, {"Title": "AMAZING!!", "Author": "D. Bryan", "ReviewID": "R1AJXEAYM7KUTN", "Overall": "5.0", "Content": "I had looked at the lower model PN51D5500 online and almost bought that. I went to a local retailer before I hit the buy button and I'm glad I did. The lower model does not have the anti-glare coating on the screen that this model has. It was also thicker and heavier. I'm so glad I double checked in person and got an amazing TV.My original plan was to get the lower model TV thinking I didn't need the smart features on the TV if I got the Samsung surround sound system with the 3D smart blu-ray player. Now I'm looking to see if there is a lower version blu-ray player without smart features and I am perfectly happy with the ease of use of just turning on the TV and hitting the \"Smart\" button. The smart features on the Samsung blu-ray players are the exact same as on the TV so there's no need to double up if you can save money.I can't believe the picture on this TV. Its just simply amazing. I've used the 2D to 3D feature to convert my F1 races to 3D and that works pretty good actually. I'm even trying to find a copy of a made for 3D movie and the 2D version to see if its even worth paying the extra money for the 3D versions and I'll post an update when I manage to do that.This TV was well worth the extra price over the lower model and any extra cost over the competitors. I'm a huge fan of Samsung though and love that my phone can act as the remote and the \"Allshare\" features let me stream pictures, music, and movies, from my computer or phone to the TV with the touch of a button.", "Date": "September 9, 2011"}, {"Title": "Great TV sans a couple of deal killers for tech heads_Ammended", "Author": "McGraw317", "ReviewID": "R3UBT29CR2AQKW", "Overall": "4.0", "Content": "Although my overall score for this TV is 3 out of 5, I want readers to know that for some of my uses, this TV is incredible. I was able to find some calibration settings for the \"Movie\" mode. I used these settings as a starting point and achieved fantastic color for this mode. This works great for TV and Blu-ray movies [...]. There is tons of \"pop\" in the picture and content is vibrant and true. Where the problems mount up is in the area of input customization. I have other sources, gaming, and 3D content to consider. I use an HD-DVD for up-scaling regular DVD content and I also have 2 Xbox 360 systems in use. The HD-DVD does great for up-scaling the resolution, but the input needs to be brighter, and my son's 360 needs to have the colors muted a bit. Ultra bright colors bother him when playing games. 3D movies are bit too dark as well, and gaming in 3D makes it even worse. These types of things are not possible to correct due to the TV's inability to fully customize each input source independently. My 3.5 year old DLP can do that, but it's not possible on a 2011 somewhat hi-end plasma. The TV has four modes that can be customized, but for some reason only one (\"Movie\" mode) has the full gamut of picture adjustments. For some reason the other three modes are crippled and do not even allow for white balance adjustments, which is what gets that perfect color in the \"Movie\" mode in the first place. The four modes should all allow for complete adjustment. Most users could manage very well with custom adjustment capability on each of the four HDMI inputs. The tech is already there. I'm really perplexed as to why Samsung would choose to hamstring the other three input modes instead of giving the user full control.Features:The TV has a bevy of other features. The apps are very useful. I have experienced a few streaming issues using the wireless, but not many. I am very pleased with the implementation and ease of use of the SMART TV features. The USB inputs are quick to respond, and Computer access is easily done through the wireless network. I've been watching a series from a USB Pen Drive and it functions seamlessly, looks great, and has no lag. I expect that the volume of apps will increase over time. The only thing missing is the ability to use a USB or wireless keyboard. One great addition is that a detailed manual is integrated on the TV and can be accessed with the push of a button on the remote.Performance:I've already ranted about the input customization in the overview, so let's mention other areas of performance. The color quality for the mode that has full editing control is outstanding. Thanks to plasmatvbuyingguide.com for providing such awesome settings for a base. The speed in which the SMART TV performs is great, with little lag to speak of. The wireless setup was a breeze, with the setup taking all of 1 minute. I can't think of a way it could be more streamlined. Input selection is a little strange, as the source button and arrows are a ways apart on the remote and this screen does not allow for much time to make your selection, but it's not hard to get used to. The remote is very solid. It is backlit on command, though it could be a bit brighter. It is packed with functionality and seems pretty sturdy. A nice thing is that it automatically was able to provide basic functionality with a Samsung 3D Blu-ray player without having to input any codes. Since changing the picture mode may be a regular task for some, it would have been great to have a quick button for that, but all-in-all the remote is excellent.DesignThe metallic base is slick. That coupled with the clear stem and clear trim surrounding the outer frame makes this set one of the best looking sets that I saw while shopping. The actual frame is pretty thin which adds to the sleek look. The TV is pretty darn thin for a plasma and setup was easy. I'm guessing the weight with base is comparable to other plasmas. The TV inputs are off-center (far right when looking at the back), which is good for me, but I think the general perception may be negative. There is a provided break-out cable for any analog sources that you may want to use, but because of the inability to tweak the input's visual settings, I will never use anything that requires it. One important item of note: This TV has no analog audio output. Because of this I will replace my audio setup to include a receiver with optical input. Great news for me (I get yet another new toy) but my wife isn't thrilled about the added expense. Overall this TV's design is uber-fantastic.ValueFlaws withstanding, this TV had an absurdly low price point as the time of purchase. It came with a 3d starter kit, which included a 3d Blu-ray player, 2 pair of glasses, 3 blu-rays, and vouchers for 2 additional blu-rays. I purchased 3 additional pairs of glasses because of the price point. I was able to get serious brownie points from my wife for being so thrifty, and those points are hard to come by.SummaryI will not recommend this TV to my friends, because they are all geeks like me, so tech heads and tweakers should look to another set for customization options, but everyone else should pounce on the opportunity to maximize quality, functionality, and general picture quality and buy this set.*****Ammendment:After careful consideration of all of the content in my review, I am compelled to change my score from 3 to 4 out of 5 stars. After experiencing more content on this set, I'm completely impressed with the fidelity and the negatives seem less important. I have managed to find some good settings in the less customizeable modes for 2d and 3d gaming. Though it's not perfect, I believe that giving this set my previous score is unjust. Thank you internet for providing tweaks and ideas.", "Date": "July 10, 2011"}, {"Title": "Brightness Pops annoying, hoipefully a firmware fix comes", "Author": "G33kSquad", "ReviewID": "R9FA9QND77CH5", "Overall": "1.0", "Content": "As an A/V Tech in the industry, not very many TVs fit within my realm \"good\" or \"great\" sets.  When I found this TV, it seemed like I had finally hit the jackpot!  Amazing picture quality and great features.  Once I got my new set home and installed, I started noticing fluctuations in the brightness.  These are instant and random brightness increases in the contrast of the picture, followed by dropping back to the previous contrast almost instantly as well.  This, of course, IS COMPLETELY UNACCEPTABLE.  I suspect that although I have disabled the \"eco sensor\", that it is still somehow malfunctioning.  I came to this conclusion because I have installed and operated so many TVs that do the same thing with their \"eco sensor\" set to ON.  There are numerous others reporting the same problems with their 2011 Samsung \"D\" series plasma TVs on sites like AVS forum.  UNLESS SAMSUNG RELEASES A FIRMWARE UPDATE TO FIX THIS ISSUE, I could never recommend this TV to a friend, or anyone else for that matter.  It would be a shame to let such great potential fall to an issue that could most likely be fixed through an update.  As is stands today (10/09/11), don't buy this TV.", "Date": "October 9, 2011"}, {"Title": "Best value in a plasma, brightness pops finally fixed", "Author": "Jason Bierenbaum", "ReviewID": "R80L1AFVMU8OY", "Overall": "5.0", "Content": "I spent a lot of time researching the various different 55-65\" tv options and ultimately decided on getting a 59 or 65\" samsung d8000 plasma since I wanted \"top of the line\" and thought the panasonic vt30 was just too overpriced. Then I found this tv. Given it was significantly cheaper than the d7000/d8000 series I wanted to know what the difference was assuming it was something fairly signficant. As it turned out the only real difference of note being the lack of ARC (compared to d8000) and the real black filter (compared to d7000/8000) and a slightly different bezel + stand. Other than that, its the same panel and actually uses the same firmware as the d7000. While I'd have liked an ARC, it wasn't worth anything close to the roughly $500 difference. The limited information on the real black filter suggested it didn't do much, so that sold me on this unit. It doesn't come in 65\" so 59\" it was. I figured I could always send it back for free if purchased through amazon.Picture is amazing after using some of the calibration settings posted in various places on the internet. The difference coming from a four year old 46\" Sharp LCD (which I previously really liked the picture on) is obvious and noticable. Blacks are *black*... its hard to appreciate what a difference this makes until you actually experience it. SD programming doesn't look bad for a set this size, but when you see how good HD looks on it, its hard to justify watching anything else. True 1080p material really looks ridiculously good. \"Brightness pop\" issue that many complain about was fixed via a firmware update in Jan 2012 so that's no longer an issue if you are worried about that. Its not \"officially\" released yet so you'll need to get it off a website like AVS or by calling samsung, but its pretty easy to do and I imagine will be part of an official update eventually. There is a little glare which i only really notice if there is a light source directly opposite the tv, but the TV is plenty watchable during daylight hours in our fairly bright living room. Although it does not have the \"real black filter,\" there is some antiglare coating on it.The TV itself looks good with the picture off. The casing and bezel are attractive and thin. The tv isn't as thin as the samsung LEDs and the bezel is wider, but its still thin compared to most other tvs. The stand is pretty solid and heavy, the base on mine was actually a brushed silver metal rather than black like I was expecting. There is a little buzzing if you sit in the right (or probably more accurately \"wrong\") place with the sound off, but its nothing distracting from actual tv watching unless you like to watch tv with no sound...Sound is very good for a flat screen tv, several settings including a dialogue enhancement option. I had bought a sony soundbar (ht 150) too which sounds slightly better, but honestly I think its going back since the tv is good enough.Wireless internet connected without much trouble. The reception seems pretty good, some devices have trouble finding the wireless signal in our living room as the signal strength gets pretty low there, but the tv did okay. Just wish it included amazon instant which is really the only service I'd actually use that I can't get on another device I already have, but unfortunately none of the 2011 samsungs do. I read a few places that amazon was working with samsung to add it, but that was written many months ago now with no updates so I'm not holding my breath.Did not test 3d yet, it didn't come with glasses and haven't gotten to purchase any yet. Fortunately, samsung has some cheap glasses that are well reviewed and only about $20/each on amazon.edit: Bought 2 pairs of the $20 glasses on amazon. The 3D works great. The 2D to 3D conversion is far better than expected, but I still can't see myself using it regularly.", "Date": "February 9, 2012"}, {"Title": "Perfect TV - except for the buzzing", "Author": "Tim W", "ReviewID": "R21ERRN8ZJFZF7", "Overall": "2.0", "Content": "+5 stars for the picture-4 stars for the buzzingI ordered this TV based on the plethora of great reviews on the quality of this display. When I received it, I was certainly not let down - it lives up to the hype. The depth of the colors are nothing short of amazing, and the blacks are deep and inky. There were plenty of detailed instructions on calibrating the display, so I tried one of those. Even better.Now for the sad part. The units (yes plural) I received were BUZZERS. I had read about this on AVS forums before purchasing, so I knew it was a risk. I thought I had just received a bad unit, so I just returned it and got another one. Second unit had the same buzzing, but louder. The buzzing comes from all over the panel, but interestingly enough it is very directional. If your primary seating position puts ear level at the center of the display (left/right and up/down), the buzzing is audible even over normal conversation. During dialogue scenes in movies and TV programs, I found that I couldn't focus on anything besides the buzz.The buzzing is high frequency (I would say in the 10kHz + range), and sounds somewhat like a malfunctioning ballast in a fluorescent light. To be fair, not all of my friends that I pointed it out to thought it was a big deal, but to me it was. For a $1500 TV (at time of original purchase), there shouldn't be flaws like this. My fiance heard it only after I pointed it out to her, but she normally doesn't get the front-and-center seat - that is my seat!Also - a tip for those of you who are going to take the plunge anyway.. If you are in CA, purchasing from Paul's TV (although fulfilled by Amazon) will result in sales tax at checkout. There is at least one vendor that does not charge CA sales tax, I think Vann's is one of them. Unfortunately it seems that Paul's is the only vendor whose orders get fulfilling by Amazon - so I would stick with them in anticipation of needing to return a buzzer.", "Date": "October 28, 2011"}, {"Title": "Fluctuating Brightness Issues", "Author": "Jack Tors", "ReviewID": "R2UJ8VX13U3ULI", "Overall": "1.0", "Content": "I recently purchased this TV and thought it was perfect...perfect until I watched hockey and noticed brightness \"pops\".  The pops happened as the camera panned from center ice to the goals.  It got worse as the game went on.  While watching a movie today, the TV had issues with a movie we watched in which the scene was set in a bright area.I'm also frustrated that I chose this TV over the Panasonic ST30, as the Panasonic also had known issues with fluctuating brightness.  Apparently this has since been remedied via an update.  I now wish I would have purchased the Panasonic instead.Hopefully Samsung will address the issue soon.", "Date": "October 16, 2011"}, {"Title": "SAMSUNG PLASMA SCREEN CRACKING", "Author": "supertrooper", "ReviewID": "RSLMPYNX31AXH", "Overall": "1.0", "Content": "NOTICE: Purchased Samsung 59\"6500 through Amazon/Pauls.  Check CNET, NJ ATTY General, various other blogs. SAMSUNG plasma panels are subject to thermal expansion cracking rendering them useless.  SAMSUNG is resisting warranty alledging \"outside normal use\" i.e. an outside impact / force / not design flaw.  SAMSUNG will ask for a photo, based on the photo will deny warranty alledging consumer abuse. Three weeks, now writing letters to AG, etc.  All cracks occur when TV is on. Caveat emptor, you've been warned.  Suspected cause is Samsung's beautiful new thin case allowing a 60\"inch view advertised as 59.  The problem began with the introduction of this new screen and continues to this day.  The blogs on CNET are outright nasty.  Four stars when it works, zero sitting on the floor looking like someone shot it with a BB gun from the inside..", "Date": "November 27, 2011"}, {"Title": "Samsung riddled with poor Quality Assurance", "Author": "Thomas C.", "ReviewID": "R19ZM3KPDKH905", "Overall": "1.0", "Content": "pn516500 quit working just after 1 year.  The Web shows a class action suit for faulty capacitors over a number of years.  Since my particular model was not on their list of models, the customer service rep said I am on my own.  So, faulty capacitors, the bad power supply or whatever is wrong with mine, I would stay far away from Samsung.  $1200 and it will not last 2 years.  Your better off at rent a center.I've read that Panasonic has much better quality control.  Stay away from Samsung, I wish I did.", "Date": "September 25, 2013"}, {"Title": "Worth the gamble", "Author": "yeast common denominator", "ReviewID": "R2BN47AFOXCLAE", "Overall": "4.0", "Content": "I ordered this set on 12\\19 and was delighted to hear that they would deliver it on 12\\23 before the Christmas weekend. My delight was short-lived when Pilot called the morning of delivery and said they would not be able to deliver until after Christmas, on the 27th. If this were in fact a Christmas present I would have been SOL. I was also very surprised to see only one Pilot delivery person, a woman, show up with the set. I had to help her unbox and mount the set on the stand. Despite these delivery snafus, the set arrived in good shape.I spent weeks researching the pros and cons of this set on various AV web forums before purchase. The potential downsides I saw were 1) Brightness pops, 2) Buzzing, and 3) Screen glare. Since all of my video viewing is done at night, I had no concerns about the glare. And since I believe for every person who posts a problem with a given piece of equipment, there are probably 100 or more who have no issues (and therefore have no compelling reason to post anything), I decided to gamble. The gamble paid off.I have seen no brightness pop issues whatever. This may be due to the fact that even before the break-in period, I adjusted the set to one of the recommended configurations on AVSForum. The impression I got from my forum reading was that the brightness pop issues were almost certainly due to the Eco-mode and power-savings settings. When these are turned off I believe that the brightness pops are no longer a concern.The buzzing does exist on my set, but is so minimal it's not a problem for me. I can only hear it when no sound is playing from the set, and I sit roughly 7 feet from the screen. Even then, it could be mistaken for something else, like an AC unit outside. When watching anything at even low volume, the buzzing is inaudible. (It is very bizarre how it can be so directional, though.)I can't speak to how this set compares to any similar flat-panel sets since I have used a projection system for all of my viewing previously. So, of course, the black levels and contrast ratio of this set look fantastic compared to a 4 year-old projector. The one issue I may have to contend with is the heat. The set gives off a significant amount of heat from the top. In the winter, this is an advantage. But during a Florida summer, while the central AC is struggling against high-80's outside temperatures, this TV\\space heater might get a little annoying.I have only spent a small amount of time trying out the SmartTv aspects of the set, but so far I am vastly underwhelmed. The interface is cluttered and confusing and slow. The only thing that looks useful is Netflix, but my PS3 already gives me that. I had hopes that it could see the shares on my network drives and play video files directly, but no. It requires video-server software (like Tversity) running on a computer in order to play files. Pretty lame. My WD Tv Live can do a better job with a cleaner interface. Oh well.I had no real hopes for the 3D aspects of this set. I have considered 3D a gimmick desperately in search of a market. But the few movies I checked out in 3D were fairly impressive. 3D might catch on after all.", "Date": "January 26, 2012"}, {"Title": "30 Days Old - Already Needs Service", "Author": "SH", "ReviewID": "RTQJZO4454046", "Overall": "2.0", "Content": "Got this about a month ago. Decent picture, easy setup. Though I should have done a bit more research online before buying. These TV's have a lot of problems with heat and the various electronic boards (power, display) inside. Power went out, then sound went out, now both are out. Obviously under warranty but Samsung won't schedule an appointment for a freaking week. Disappointing.", "Date": "January 16, 2012"}, {"Title": "Love My Plasma!!", "Author": "ThePostman", "ReviewID": "R295AAXN8JS92P", "Overall": "5.0", "Content": "Just gonna throw in my likes on this awesome plasma.Picture is great. viewing angle is unbelievable (they should just say view from any direction)The Smarthub is the future of tv, jump on, it's only gonna grow bigger.THE FLASH DRIVE ACCESS. grab a movie from the net,put it on a flash drive and plug it in. THE PLAYER IS BUILT IN.movies,music,photos. put them on the flash drive and the tv plays them.Connect your WINDOWS 7 laptop to the TV through WIFI and stream movies,music,photos.This is no longer a TV. IT's 1/2 computer.This TV is built solid. The base is metal. The BACK of the tv is METAL. The tv frame is a hard high quality plastic.Buy this Tv. Pay extra over model 550.better value then model 7000/8000Update 2-10-12Tv still awesome. No problems. Wish it had the Amazon Prime App (still a no go on 2011 sets). Bought 3d glasses and its worth the extra expense. You old timers that remember the old VIEWMASTERS from the 60's and 70's will see a familiar view. It mimics the depth of those old slides.Update 4-09-12As this TV gets phased out for the 2012 model thought I'd update 1 more time. NO buzz. No brightness flux (turn off the eco settings, folks). I wish Samsung had invested in producing Apps for the Smarthub. I have my laptop connected to the PC input and along with a wireless keyboard and mouse , I now have a 51\" computer in my den. With that I am able to access Amazon prime,Hulu,xfinity, and surf the web from my couch. BUT the one feature that no one mentions that I will once more praise is : THE FLASH DRIVE ACCESS. I use this every week to watch movies.", "Date": "December 26, 2011"}, {"Title": "Awesome TV", "Author": "ehoffscott", "ReviewID": "R1VOEQ7F2L73ER", "Overall": "4.0", "Content": "I started looking for a new TV a couple months ago, and ended up deciding to purchase the LG 55LW6500 LED 3D TV.  I really liked that TV for the few weeks I had it, until I headed over to my buddy's house and checked out his new Samsung plasma.  I was blown away...and kind of pissed.  I couldn't understand how the picture on his TV was so much better than mine.  The blacks were amazing, the colors popped, and everything about it just looked straight up better.  So I went home, turned on my TV, and immediately decided to return it and pick up a Samsung.Amazon was awesome during the return process, and my new TV was dropped off at the same time Pilot came to pick up my LG and send it back to Amazon.  As soon as I turned it on, I was so happy I made the decision to buy it.Out of the box, the blacks aren't the most incredible I have seen.  But after playing with the calibration for a bit, I got it pretty close to my friend's Samsung and it looks phenomenal.  The whites aren't quite as bright as they were on my LED, but I can accept that because the difference in blacks is so good.During the day, the TV can seem like it's not quite bright enough compared to the LED...but at night it's not noticeable at all.  It really looks great.Now, the difference between the passive 3D on my old LG and the active 3D on the Samsung.  I liked the passive 3D on the LG because the glasses were so cheap, and the effect was pretty decent.  However, there was a double image on everything that the camera wasn't focused on.  This meant I was playing with the 3D depth settings throughout any show or movie I was watching, trying to get the right elements to be in focus.  It was extremely annoying.  The active 3D on the Samsung, however, is nothing like that.  Obviously, the glasses are stupidly expensive which sucks.  However, I was shocked by the 3D effect on the Samsung and how far ahead it is of the passive 3D on the LG.  With the active glasses, the are absolutely no double images like I had with passive, and everything looks great.  I get a way better 3D sensation with the Samsung than I had before.So, case in point...  if you are dead set on getting an LED like I was, I would recommend checking out the newer plasmas first.  I hadn't even considered getting one because I assumed the technology was dying off judging by how little you hear about it now compared to LED.  I was way wrong.  The newer plasmas look so much better than LED.  Check them out!You definitely won't be disappointed with this TV.", "Date": "November 17, 2011"}, {"Title": "Great picture.  Fun 3D", "Author": "Gregory P. Johnson", "ReviewID": "RZZD90I8Y4VHI", "Overall": "4.0", "Content": "Extended warranty company said repair of light engine on my 5  year old rear projection TV was more expensive than a replacement. I used their check to pay for most of the price of this TV with 3d Blu-ray player and 3D kit with 2 pair of glasses, 4 Shrek 3D Blu-rays and a coupon for Megamind 3D.  Picture looked great in stores and better in my home.  Did not notice difference from Panasonic which many rate better.  Glare in not a problem even with a lamp on beside me.  I can see reflection, but it is not annoying.Apps are great and probably the best laid out.  Does not have internet browser. A big gripe for me is that I can find no way to label the HDMI inputs.  The Samsung Blue-ray labels itself, but I want to label my receiver and satellite TV inputs.  Watching this TV is like seeing HDTV for the first time.  Two words... picture perfect.Watching in 3D is amusing, but the real treat is a great 2D TV.  Watching tennis and Little League Baseball was particularly interesting.  I wouldn't want to wear glasses long term to watch TV though.  Also, the 3D glasses darken the image but it's still okay.I highly recommend this over other options.  The higher priced Samsungs get you internet browser but not much else for much more money.  Price with freebies made this a better option over Panasonic.  1080 HD resolution in 3D made this better option that LG, although LG 3D is still very cool and passive 3D glasses are really cheap.  I was unimpressed with Vizio models I reviewed with too wide frames.  Sony and Sharp models cost much more.", "Date": "September 7, 2011"}, {"Title": "Great 3d plasma", "Author": "F. Hartman \"LtColBuckRobley\"", "ReviewID": "R1R7V4JVOV1FOB", "Overall": "5.0", "Content": "This television replaced a Samsung LN52A650 lcd that I had purchased a few years ago.  I wanted a larger size to put in my basement which has no windows so I knew plasma would be a great choice.  I've gotten past the hundred hour break in period and have been tinkering with calibration settings that I've found on various internet sites.  I've found that the movie mode is really the only setting worth using.  The others just wash out the colors too much.  Since this is plasma the picture is not as bright as LED, but I've found the picture quality overall to be stunning.  There is no motion judder which is so important when watching sports as much as I do. The 3d glasses are much more comfortable than the panasonic model I have upstairs and provide a smooth picture with no visible ghosting.  I only wish there were more 3d content on my satellite.As far as the internet apps go, they'll be nice but I've found I am going to have to upgrade my internet service. I use dsl and it's just too slow in terms of its connection to be able to stream movies and stuff.  Looks like I'll have to upgrade to high speed internet which is another cost consideration.  My only other concern is that I can't figure out how to run sound from the internet apps through my receiver and speakers.  It only comes through the tv speakers.  Gonna have to work on that.All in all I don't see how you can go wrong with this. I compared it with the stepdown model (550) and it's noticeably better in terms of limiting glare.  Didn't seem to notice a real difference in picture quality when compared with the higher end 7000 and 8000 models either--at least not enough for me to justify the significantly larger price tags on those models.  I think this one hits the sweet spot price wise.  I do wish it had the full web browser with qwerty remote which is available on the 8000, but I couldn't justify paying several hundred dollars more for that.Looking forward to many great years with this wonderful television.  If you pick one up I can't see how you'd be disappointed.", "Date": "August 28, 2011"}, {"Title": "Definitely worth the money!", "Author": "ivanhoe", "ReviewID": "R38ANUX2U4Y4QN", "Overall": "5.0", "Content": "The picture quality on this tv blows you away. Since it is a plasma, it truly does have better picture, richer colors, and deeper blacks than an LCD. It has way better than my roommate's  tv, which is only a year older and still the same screen size. The sound quality on it is great, but lacks a little bit of bass. It won't be noticeable unless there's something to compare it to. The 3-D on it does not have as good picture as standard 2-D, which is mostly noticeable the closer you are to the screen. It's mostly just a mosquito noise that becomes more apparent once 3-d is activated, due to the brighter screen for the dimmed glasses. Once the glasses are on and the movie is playing, it'll still look great; better than a 3-D movie you'd watch in the theater. The 3-D converter does a good job, but at times has funky ways to show depth. The body design of the tv looks great, and is even as thin as an LED tv. It has touch sensitive buttons on the front bezel to control basic functions of the tv. The port inputs are great as well, including 4 HDMI inputs, a PC input, and DVI input. Unfortunately, it only has one composite/component input, and only a digital audio output, (an analog output will do no good). Overall, it is a great tv that is a steal for the price, especially for a 3-D tv. A very satisfying tv, and I highly recommend.", "Date": "August 11, 2011"}, {"Title": "Good tv, but for one initial issue - buzzing", "Author": "Jkr1770", "ReviewID": "ROS21SWAGOXF8", "Overall": "4.0", "Content": "I was pretty excited when the TV arrived. Sadly, that turned to disappointment when I started it up. There was a horrible buzzing sound that could be heard even with the volume up high. I called samsung and was told the sound is not normal. I have a four-year-old samsung plasma that makes no buzzing sound, so I was a little shocked. BUT, after two weeks, the buzzing sound disappeared. For no apparent reason. I'm not complaining, of course, just seemed odd.  It's since been suggested that it was a moisture issue based on my failure to wait and let the TV acclimate to the temp and humidity of my house. In any event, it's been about four days without buzzing, and now I love the TV.Great for sports and action movies. No pixelation whatsoever. I am still messing around with the picture settings, but picture looked great even out of the box. The super thin design looks great. Speakers have surprisingly decent sound. Now that the buzzing is gone, I really have no complaints.", "Date": "August 3, 2011"}, {"Title": "I really enjoy this TV", "Author": "S. Puckett", "ReviewID": "RC8307P0TEWL2", "Overall": "4.0", "Content": "I love the look and feel of this TV. It's has a very nice picture, good menus, and the smart options work great (Netflix).The main issue I've had with this TV is the volume. It seems like the volume or sound on this TV is too low. I either cannot hear the TV or have to turn it up and it's too loud. I've tried making all the adjustments to the sound available, but have not been able to 'tweak' it to an acceptable level yet. But,did I mention it looks great?", "Date": "March 7, 2013"}, {"Title": "My First Plama...I Like It", "Author": "Carl Johnson", "ReviewID": "R1KUI7RBSB6IGR", "Overall": "5.0", "Content": "This (2011) 59\" Samsung TV arrived intact. The manufacturer's packaging was quite adequate. It definitely takes two (my wife and I) to setup. Once installed, calibrating the picture was a breeze. This is my first plasma TV. It replaced a (2007) 52\" Samsung LCD TV (Fluorescent), which we moved to the bedroom. I immediately saw the improved difference in blackness levels and motion blur. Glare was never a problem because of the way the TV is set back in my entertainment center. To me it lacks the crystal clarity that I enjoyed on the LCD. For instance, the vibrant colors and blades of grass while watching \"The Masters\" golf tournament are just not as spectacular (in my opinion) on this plasma as they were on the LCD (don't get me wrong, the colors and clarity are excellent, just not as breathtaking...HD for me means being able to see the pimples on a persons face). I'm still doing minor adjustments in picture calibration as I write this review. Oh yea, and the 3D (reason I bought it) is REALLY great!!! (Almost forgot about that.) I highly recommend this 3D TV, if you can still find 2011 models. And remember when purchasing 3D glasses to look for 2011 compatible models. I am completely satisfied with this product.", "Date": "April 13, 2012"}, {"Title": "Amazing TV!", "Author": "A. BOMAN \"1080i dreams\"", "ReviewID": "R2K0ZZ7W62N1Y8", "Overall": "5.0", "Content": "Couldn't ask for more.  Very easy set up, great picture quality, razor thin screen and blu rays look phenomenal.  I managed to get mine on an eBay Daily Deal for $799 w/ free shipping- best deal ever... I haven't tested the 3D functionality because I don't really care for 3D TV and the Smart TV feature is somewhat pointless but I bought it for the picture, not the gimmicks.", "Date": "April 12, 2012"}, {"Title": "GREAT PICTURE", "Author": "RICHARD S PAYNTER", "ReviewID": "R2GI0OKONBC4CC", "Overall": "3.0", "Content": "Great picture, not tried the 3D yet so can't comment. Screen is extremely thin and surround is very narrow - a really good looking TV. Assembly was quite stright forward but DON'T try it alone as the screen and stand are both heavy and the handling whilst connect the two is tricky - just not worth the risk of a costly accident!Once assembled I'm a little disappointed with the rigidity of the screen on the stand - even when walking past you can see the screen wobbling very slightly and when touched - even lightly the screen rocks very visibly. With a two year old in the house I will be getting a wall mount for this TV - I'm sure it will look great and be safer. Dropped one star for this. The other star was dropped because of the buzzing - this is very noticable at night when using the TV at lower volumes when my son and wife have retired before me. If you like gaming it is very noticable on start up screens etc but not too much once you're up and running - not a major concern but rather a bit irritating. Picture and sound more than make up for these minor points and very pleased overall.", "Date": "March 5, 2012"}, {"Title": "Awesome TV", "Author": "esotto", "ReviewID": "R61CEW5DYSR1Y", "Overall": "5.0", "Content": "I did a lot of research before pulling the trigger on making a new 3D TV purchase.  This was going to be my first 3D TV and I had some criteria that had to be met: 1) great picture quality, 2) smooth 3D, 3) stylish design.  I did a lot of reading on forums and found the PN59D6500 highly recommended.  I visited several retail stores to visually compare several models of 3D TVs.  The picture quality of this Samsung model did not disappoint.When I went to the retail stores I could notice that the LED TVs were brighter compared to this model.  However, this is not always a good thing. The picture is very crisp and the colors are very warm compared to many of the LED's I observed.  Though the black levels of LED TVs are getting better, I found the Samsung plasma had slightly better black levels from side angles.  I was also very impressed by the smoothness of this plasma's 3D compared to the LED TV's.  The difference between 600 Hz and 120 or 240 Hz is huge.  I could notice some juddering in the 120 Hz and 240 Hz LED TV's, whereas the 3D on the 600 Hz plasma is very smooth.  I don't know if this was mainly due to the speed difference in the TV's or if the 3D glasses also played a role.  FYI, I have the Samsung 3100GB glasses and they are awesome at $30 each.  Very happy with these 3D glasses...they are light, affordable, and sync up flawlessly with the PN59D6500.  They also shut off automatically when you're not watching 3D to conserve battery life.  When watching 3D with the glasses, the picture is slightly darker due to the lenses, but still isn't that bad since pretty much all current 3D glasses are slightly tinted.  Overall, I'm very satisfied with the 2D and 3D performance of this TV.  The Standard picture mode is decent, but the TV really shines when you tweak the picture settings.  Do a Google search and you should find some calibration settings that you can be happy with.  The sound of the TV is very good considering that they are integrated into the TV.  Samsung did a great job with the speakers in the TV.  The sound is not tinny and has a decent amount of bass.  As far as the design of the TV, I'm glad I decided on the 6500 model.  The screen is a little reflective, but less reflective than the lower model 5500.  Also, the bezel on the TV is an attractive metal rather than plastic.  The base is also made of metal rather than plastic and has an attractive/modern look to it since it has a brushed aluminum/titanium appearance.  Another thing I liked about the design is that the TV is very thin for a plasma.  If you were to look at it from the side, you'd think this was an LED TV.From now on, I'll only order TV's from Amazon.  Forget the huge store retailers.  I saved a bunch on tax, the TV was cheaper on Amazon,  shipping was free with Amazon Prime, and the carrier that delivered the TV was very professional.  I got the white glove treatment...I didn't have to lift a finger!  They unpacked the TV and set it up to make sure everything was working.So far I only have a few very minor complaints.  However, these are so minor that I don't think you should be discouraged at all from purchasing this model.  The first complaint I have is that I notice a minor buzzing sound if I am watching directly in front of the TV from about 6 feet away.  All plasma TV's have a slight buzzing sound, but the buzz is only noticeable from a certain distance and angle.  Not that big of a deal, but once you know about it you will notice it.  But eventually when you're watching your program you eventually forget about it or get used to it.  This was something I read about in other reviews of this TV and I knew what I was getting into before making this purchase.  The second complaint I have is that it's 59 inches.  Why 59 inches?  Why not just give us the extra inch and make it 60?  Most of the TV's I saw were either 55 or 60 inches so I don't know why Samsung decided to make this 59.  60 just sounds better than 59 but whatever...not really a big deal.  You can tell your friends it's a 60 and they'll believe you.  The thin bezel gives it a larger appearance.Overall, I'd say that this TV exceeded my expectations.  I highly recommend this TV if you're in the market for a new 3D TV.", "Date": "January 23, 2012"}, {"Title": "You're moving into a land of both shadow and substance...", "Author": "M. Nicholas", "ReviewID": "R3LO0KIB5FXBA4", "Overall": "5.0", "Content": "\"You unlock this door with the key of imagination. Beyond it is another dimension - a dimension of sound, a dimension of sight, a dimension of mind...\"6-month Update: Still love it. Excellent picture, accurate colors, and great motion handling of 1080i Uverse feed, and wireless(WiFi) Netflix instant streaming. The SmartTV interface and apps are still slow loading and cumbersome for entry, but have used youtube and facebook on occasion as well. Playing Netflix instant streaming feed has been seamless. No 3D use, don't ever plan on it, nor do I expect to ever run any dvd or blu-rays with it. I only use the remote for SmartTv apps, and am not a big fan, but the remote is never a show stopper. Watching Frozen Planet on Discovery HD was amazing, though I typically take the accuracy for granted and only watch HD programming. The only thing I could wish for at this point is that I splurged for the 59-inch size.I've had the 51-inch for about a month now, and it has transformed me into a full-time couch potato. Full-immersion. No buzzing, no noise at all. Using plasmatvguide's calibration settings. Incredibly consistent image and colors from all angles. Clean, clean, clean, and accurate. I got scared-off by peeling reports on the more expensive 7000 model. So far, I'm glad I saved the money and got the 6500. By far the best picture and most accurate colors I've seen. The thin bezel and clean styling make this ready for the wall, but the stand is nice too, with an extremely solid feel. Sound is great with standard setting, with equalizer.Smart Hub is a cumbersome and slow. Entry with the remote makes it harder to use and slower. I got it for Netflix streaming. The app works, but can be slow and inconsistent. I'm guessing future models will continue to be better desktop replacements.There's no question it's the best option for the money out there at anything below a grand in terms of picture quality, features, and incomparable style. No-brainer.", "Date": "December 26, 2011"}, {"Title": "What buzzing? What flashing pops?  This TV is a perfect \"10\"!", "Author": "Marooned \"Marooned\"", "ReviewID": "RZJQV466CK3UB", "Overall": "5.0", "Content": "Amazon Warehouse Sales had this TV for a $1080.00 in \"good\" condition (That's about $600.00 off the regular selling price of a new set).  Not \"very good\", not \"like new\" but a mere \"good\" condition. They only had three of them (and now they have none left).  I usually at least go for the \"very good\", but this time, considering the huge savings, I took a chance and went for the \"good\" (and hoped for the best). It took about a week to get to my door (via Pilot). The outside condition of the big carton was scary.  The driver carried it into my house. I asked him to wait while I inspected it for any real damage like a cracked screen, etc.  He helped me open the carton and there it was, this huge TV.  I inspected it with a large flashlight, and to my sheer delight, I started realizing, this baby is brand new with plastic still covering the attached base.  No cracks, no damage, nothing!  The driver even helped me carry it to where I wanted the TV in the living room. So, this part of the review has been about me wanting to share my good fortune with the rest of Amazon customers.I've had the TV for 5 days now.  It's connected to my Pioneer 3D 7.1 receiver via high speed HDMI as the rest of my \"home theater\" units.  I watched regular cable, a blueray action movie, a 3D movie,and, played with the \"Smart TV\" internet functions (The TV updated itself through my WiFi without a hitch), and USB media function (watched a movie through the USB on a thumb drive).  The TV was delivered last Friday so I played with it all weekend.  Just use the \"movie\" mode, and you're done with the \"settings\".The verdict?  No buzzing!  No \"flash pops\" some reviewers complain about.  All I can say is this is one spectacular TV.I certainly got lucky with the price.  It was a real \"find\" at the Amazon Warehouse Sales, and a gutsy move on my part to go for it given the stated \"condition\".  I also feel lucky to have this gorgeous TV in my living room working like a champ without any perceivable flaws.  I hope it lasts a long time.By the way, I read all the negative reviews (and the positive ones)on this TV and, purposefully listened for any buzzing, and/or any \"flashing pops\" during the movie watching (in the loud or quiet moments), and, I detected no such thing.I also want to say though, the product reviews (the positive as well as the negative) on Amazon are indispensable to me.  I won't buy anything without first reading the reviews.  In fact, if it's an expensive item, I print out the reviews so I can read them more carefully before I make a purchase decision.  Come to think of it, Amazon, perhaps you can make those \"reviews\" more manageable (with less clutter) for printing (without having to cut and paste, and then clean out the clutter...maybe have a \"print\" button somewhere...).Finally, thank you Amazon.com for being the best there is.  I buy from you like I buy from Winn Dixie; without a worry in my head.", "Date": "November 15, 2011"}, {"Title": "Great Plasma, Great picture, at an amazing price.", "Author": "great magnet", "ReviewID": "R1ZCX0DB1LXFE1", "Overall": "5.0", "Content": "I really love this TV!! After having it for 3 months now, I can truly say I'm in love with it. The colors and blacks are outstanding, no screen bleed, consistent color across the display. The 3d works flawlessly, unless you have a not so good movie that has sync issues. I really love the Smart Hub features, its great to have netflix and hulu built in. When you watch a bluray on this tv in all its 1080P glory, you will be blown away. The speakers are actually quite good considering the tv is only a little over an inch thick. Compared to my 2 year old sony LCD this thing makes it look like a CRT. I love the fact there there is NO GHOSTING when you play games on this display. My other complaint is the the optical out only puts out 5.1 on media played from the TV, it does not have support for passthrough witch is kinda a pain. I ended up getting a new reciver when i found that out that support HDMI (my old one only had svideo, it was due for an update anyhow). The screen brightness \"pops\" that people are experiancing are due to the eco setting, i have that issue when i turn it on, when its off, there no problems.", "Date": "November 6, 2011"}, {"Title": "Worth every penny!", "Author": "Justin P. McPherren", "ReviewID": "R3SAHVD6JJHS6N", "Overall": "5.0", "Content": "It's only fair that I preface my review by admitting this is my first HD television.  Comparing it to the 32\" SDTV I previously owned is...well...not realistic, or worthwhile.  And needless to say, I can't compare it against any HDTV I've owned previously.  However, I feel like I'm qualified enough to make a review based on a few things -- exhaustive research between LCD, LED and plasma, my experience with this particular tv, and hands-on experience with other HDTVs belonging to friends, family, and tv dealers.  I've had plenty of opportunity over the last few years, while biding my time, to hone in on what I wanted.  I've stood in front of countless HD displays at store level (and living rooms) comparing everything from picture and sound quality, price, and overall appearance.  I've read literally thousands of product reviews on Amazon, Cnet, and other sources.  Time and again, plasma tvs rated higher than their counterparts, this particular tv being no exception, and Samsung was the brand I came back to over and over.This television is absolutely amazing and surprisingly easy to set up.  I have mine on its stand atop a media cabinet in the living room and it looks beautiful.  It's a very well lit room with lots of windows and lamps and I haven't noticed any bothersome glare issues.  The set itself is very thin, light, and sleek.  The picture quality is hands down one of the best I've seen.  The blacks are very deep and the colors vivid.  I watch a lot of sports and action movies (DVD upconverter w/ HDMI is my config) and in my experience these can be challenging in HD if refresh rates are not good.  Not a problem with this television.  Even the fastest action is processed flawlessly.  I've had no negative experiences to speak of regarding picture quality with this set (light fluctuation, shuddering, pixelation, etc), or the annoying buzz that has been described with other sets.  There is barely the slightest hum with this set, but you literally need to be standing right next to it with the volume off to hear anything.  Speaking of volume, this set produces good, but not great, audio.  The sound is better than adequate though, and will only improve with if integrated with a receiver and surround system.  No audio complaints here.Regarding 3D, I did not purchase this set for 3D capability and cannot speak to how well it works.  I don't even have 3D glasses.  Maybe some day.  If 3D works as well as the rest of the set...it should be another great feature.  The Smart Hub is also a nice and I synched the television to my home wireless network flawlessly in about a minute.In short, you'd be making a wise move to purchase this set.  There are certain to be some cons with those more HD savvy and nuanced than myself, but this set absolutely blows me away!  It does what a tv is meant to do - provide visual entertainment - and does it as well or better than any HD set I've seen.  Bottom line - my experience with this set has been nothing but the best.  VERY happy with this purchase.", "Date": "October 27, 2011"}, {"Title": "Entertainment Powerhouse", "Author": "Arlen W. Kirkaldie II", "ReviewID": "R2VDFNS2E8IPL0", "Overall": "5.0", "Content": "Upgrading from a 37\" Vizio LCD television, I was immediately blown away by the high contrast, rich colors and overall design. The TV has tons of settings to customize the picture to your needs, or can be viewed with the 4 default picture settings (Dynamic, Standard, Movie, Relaxed). I have been running my own media servers on my home network and normally access them through my PS3 or Logitech Revue. The Samsung SMART Hub feature accesses these servers but came up with invalid file format errors. The easy fix to this was to change my media servers from TVersity to Samsung AllShare for PC. The features in this television have replaced many external devices, however I find myself keeping my Logitech Revue simply due to its Amazon Instant Video feature (lacking from the PN51D6500).PROs:amazing picture qualityhigh contrast ratiocustomizable 3D DepthCONs:no amazon videolight buzzing after extended use (common with all plasma screens)", "Date": "September 23, 2011"}, {"Title": "Very Nice!", "Author": "Brian S", "ReviewID": "R1JF9G0RRL4FIA", "Overall": "5.0", "Content": "I received this unit about two weeks ago after having the Samsung PN50C6500 unit returned for a technical issue - the picture and sound would intermittently blank out for about a second or two and then resume. Pretty aggravating. I was pleasantly surprised that Samsung actually replaced the prior year model with the current year one as opposed to getting stuck with a refurb unit. The D6500 does display a better picture than the C6500. I wasn't really interested in the 3D feature and haven't even used it yet, but the 2D picture is fantastic. The only disappointment I have is the C6500 had an analog audio out port - the D6500 only has the digital out. Consequently, I'm unable to connect to my stereo. Looks like I'll need to upgrade my AV unit next. Overall, I'm still very happy with the new unit and just hope none of the previous technical issues resurface. Kudos to Samsung for standing by their product.", "Date": "August 28, 2011"}, {"Title": "Great 3D TV", "Author": "BeerLuver", "ReviewID": "R3D7EF13BFEGFP", "Overall": "5.0", "Content": "I purchased this television elsewhere back in May 2011, but thought my own personal review would be beneficial here ;). I have thoroughly enjoyed this TV from the day I unboxed it. The Samsung Apps are very handy; specifically the Netflix one. I do wish they would add more new apps more often though. And it'd be nice if they added Amazon's video feature to it as well ;).The picture quality is excellent. Takes a bit of fine-tuning to get it calibrated just right, but there are numerous online communities & resources to help you achieve good calibration settings for just about ANY television out there.The 3D function works quite well, and with the Samsung 3D glasses ... very comfortable to wear for long periods of time. Watching the Shrek movies in 3D with my 3 yr old nephew was a complete awesome joy for him haha. He couldn't turn away from the TV. The 3D also works great with PS3 games that are 3D-compatible. A different style of video gaming, but fun nonetheless.Sound on this set isn't bad, but it isn't great. It's usable when ya don't want to have a surround sound system on all the time; like for my case living in an apartment. But definitely add a 3D-capable surround system to this big boy, and you will be glad you did.I'll definitely recommend this television; and it's predecessors, to friends & family. Samsung is reigning in the television department these days, and I have no doubt in my mind that they will continue to do so.", "Date": "August 18, 2011"}, {"Title": "Best Value", "Author": "Ravenfan", "ReviewID": "R3G2X717MKQ9LT", "Overall": "5.0", "Content": "Well I have had my set for about three weeks now. I ran 175 hours of slides to help speed the break in up. Picture quality is spectacular!!! This set replaced a 6 year old 50inch panny which was and still is a great set. I really wanted to stick with the panny but with wanting to go up in size the GT30 was a bit out of budget and the ST30 bezel was to large for my taste. The TV seems a bit wobbly on the stand when touched and is a bit scary as big as this set is. I have used settings posted in other forums and tweaked from there. As far as brightness fluctuations I have viewed blue ray,dvd ,3d and directv and I have not seen any. I did one day tune to the NHL channel and I could easily see them. As far as buzz...I don't hear anything coming from mine. I could hear it on my panny. I was leaning all over the place in TV's and this was so far an excellent choice!!! I also want to add that Amazon made me feel excellent about my purchase with their price match as well as their service. I will try an update later.", "Date": "July 12, 2011"}, {"Title": "Spectacular!", "Author": "Volleydude", "ReviewID": "R28B3YUHICCEZT", "Overall": "5.0", "Content": "This TV was bought to replace an older LG Plasma.  I have had this set for about a week now and have watched standard def, hi def cable, and blu-ray movies on it.The image quality, in a word, is spectacular.  The set is so thin that our installers said \"Why would anyone choose LCD if you can get a plasma this thin??\".  The TV picture quality is truly amazing on the out of the box setting.  I haven't done any calibration but unlike many other TVs, it won't need much.The only downside is the light buzzing noise from the fan on the set (downside of such a thin plasma).  I can barely hear this at about 5 feet away, when all sound is off.  From the couch (15'), or with any sound on, I can't hear the sound.Overall, just an amazing TV with spectacular picture quality.", "Date": "July 12, 2011"}, {"Title": "Brightness fluctuations kill the mood", "Author": "zacowacko \"Keep on, keepin on!\"", "ReviewID": "R5M0NDBXUQA2T", "Overall": "1.0", "Content": "This TV has constant brightness fluctuations, entire screen, not just blacks. Samsung replaced all my boards and my entire panel, still does it. Panasonic had same problem with this year TV and fixed with a firmware update, Samsung chooses to ignore us and hope we don't notice. Look for the thread in avs forum \"Does your 2011 Samsung plasma have brightness pops\". There are hundreds of people posting that they do and no fix has been made. Didn't show up until my month was up.  I would post a link but would most likely get deleted, easy find with search. It is annoying as can be, brings you out of what you are watching and washes out picture.Update:  I was only able to live with Samsung ignoring me for a few months.  Sold it on Craigs, eating the loss and bought a Panasonic VT50.The Panny has been awesome, not only is the picture better, but it has none of the pops.  I will post a review of the Panny soon.", "Date": "September 29, 2011"}, {"Title": "Fantastic Picture!", "Author": "Rod", "ReviewID": "R2VYJWN1DQL4LF", "Overall": "5.0", "Content": "Ordering was easy. The TV arrived before the scheduled delivery date. The freight company (CEVA Shipping) called the day before delivery to schedule a delivery time window. The box was delivered undamaged and in good condition. There were no problems with the TV or the parts when I removed them from the box. The stand was easy to assemble and attach to the TV. The instructions for programing the TV were detailed and to easy to follow. The TV has a fantastic picture. I had not realized that my old TV's picture was so bad compared to the new HDTV's. But considering my old TV is a 35\" JVC that is about 15 years old, I should not be surprised. The black levels on this Samsung Plasma are very black. The picture is very crisp and clear. I find myself watching some sporting events that I normally would not watch just because the picture quality is so good. I was worried about the plasma humming noise that I read so much about in reviews. After using my TV for a week now, I can say that it does not have any humming noise that I can hear. The sound quality is good with plenty of volume. The TV looks sleek and expensive with the glass outer edge and being as thin as it is. The PN51D6500 is alot of TV for the money.", "Date": "January 9, 2012"}, {"Title": "future plasma?", "Author": "tomw", "ReviewID": "R2GVYYWVPBCFIU", "Overall": "5.0", "Content": "I decided to move into the 21st century and buy my first flat screen. Read a lot of articles, asked a lot of questions and moved back and forth between LCD and plasma more times than I could count. I was flat screen ignorant but wanted to make a correct purchase. I believe they both have attributes,but overall- the LCDs that I previewed(and I've seen a lot) could not hold a candle to the picture produced by plasma technology.The picture produced by a 4 year old plasma was better to me than any of the new LCDs. Plasma is just so much smother to the eye and natural. Plenty of brightness, and virtually no reflection on this model. I was concerned about heat and burn in, but the new plasma technology has addressed those issues to my satisfaction. The screen is barely warm to the touch. Energy efficient to boot. The vibrant colors and definition are nothing short of amazing. I'll never view sports the same way-pop some popcorn and you're there. US Open was my first experience and I still haven't recovered. Could swear I could see the fuzz on the ball, and no blur. This is all by antenna! I stream my moves thru my computer. Haven't done blue-ray yet saving that for my next surprise. Sports, movies, gaming, internet, this thing does it all, and will do 3d eventually, oh boy oh boy, oh boy, can't wait. A true entertainment center. I could go on and on- please don't pinch this country boy, I just might be a dreaming. Last but not least, thanks Amazon!- everything went perfect.", "Date": "October 6, 2011"}, {"Title": "Great set but flawed", "Author": "Kevin D", "ReviewID": "RND6902CK1UND", "Overall": "2.0", "Content": "Had this set for about 3-4 months and was very impressed when I first got it.  Sadly though the more films I watched the more I realized that the tv had this brightness popping issues.  Hardly visible most of the times, well in the content I watched, but very visible during certain scenes/movies.  Samsung has received to acknowledge this problem and even claim they never heard of it.  Hard to believe when you have a bunch of people reporting that Samsung sent out a technician to fix others TV and replaced if not the whole tv. Still no fix! Don't believe it? Check out Audio Video Science's forum and you'll see a threat/post of where all the owners of the 2011 models are complaining of the brightness pops.  TV would've been 5 stars but because Samsung refuses to admit their is a problem with their tv and lack of a fix it gets 2 stars.", "Date": "September 28, 2011"}, {"Title": "Great TV, with issues", "Author": "William Jones", "ReviewID": "R245PZM2WGI3F5", "Overall": "4.0", "Content": "This TV is a great deal, great picture quality, however it suffers from flickering changing levels. One moment it's a stunning picture, the next moment the blacks are grey. Other than this inconvenience it has been  great TV.", "Date": "January 15, 2014"}, {"Title": "Great picture, decent sound", "Author": "R. Butler", "ReviewID": "R1UXTWIMJQCGZU", "Overall": "5.0", "Content": "The picture and price are great, does a wonderful job with non-HD (older, low-resolution SD material like DVDs, most cable shows, etc). Has a built-in \"smart\" TV mode with limited functionality, mostly used for connectivity to Netflix, Hulu, and things of that nature -- otherwise it's mostly useless (although there are a handful of other apps that are OK).Does a pretty good job in sunlit rooms, and has a good viewing angle.", "Date": "January 16, 2013"}, {"Title": "SAMSUNG  and 'sourcing' input control re its TV monitors", "Author": "WT Exp \"WTBill, PhoneGuy, BC\"", "ReviewID": "R706W4M53AD3", "Overall": "3.0", "Content": "Samsung PN51E6500 51-Inch 1080p 600Hz 3D Slim Plasma HDTV (Black)This is the second time I've come across a situation whereby a SAMSUNG monitor will NOT allow the owner to select his/her 'preferred' default source input.  Also, one will often see a desired input 'listed'(ie PC) ...but it's 'greyed out' and NOT accessible for use (even tho the physical plug-in is there on the back of the monitor!).  The problem scenario I'm having is with the 'default' input being the (TV Tuner or) 'CableTV'.  If you happen to not use it and use only the suggested 'best' input.. an HDMI input as your 'default' ...well, that's too bad because... it will always default to 'CableTV' (Huh!?), never mind what you, the user, want. (I will never be using my big screen for direct-fed 'Cable TV' perse.. so that port is nothing more than a 'snowy' interruption or 'irritation').  I wonder how many more among us bought into the 'onboard TV tuner' that, so often, is just a ($200.) redundancy.  It's one thing to have that capability but, I let SAMSUNG reps know that I'm not happy at the lack of control as regards their arbitrary choice.  Wonder if they 'listen' to consumer wants/needs and change that? Perhaps most of their consumers live in the country and use TV antennae..?  Hmmmm.  Doubt it!", "Date": "December 12, 2012"}, {"Title": "Great TV! 59\" Samsung PN59D6500", "Author": "MW", "ReviewID": "R2786648VZE0BZ", "Overall": "4.0", "Content": "I was hesitant in purchasing a large TV online without at least seeing the same model at a store first, but I saw this TV with a good blu-ray/3D glasses/Shrek combo that was difficult to pass on. My girlfriend was doing everything she could to convince me not to buy a huge, expensive TV. I was tired of my Samsung 32\" LCD TV and wanted something bigger. I still can't believe I pressed the submit order button, but I'm glad I did. I spent 30 minutes weighing the pros and cons while the TV was in my shopping cart. I wasn't sure if it was my imagination or a sales tactic but the quantity shown was going down as I refreshed the description page for this TV as I was deciding. After submitting the order I went through the \"there's still time for more research and cancel the order\" phase and spent a couple more hours looking up reviews and trying to not look at my gf directly in the eye that night...I survived and a couple of days later two guys carried a giant Samsung box up to my place. The TV is HUGE compared to my old 32\" LCD.Physically this TV is beautiful, thin, it has a clear border, and has Samsung's smart tv WIFI access. The picture quality looks great with deep blacks and vivid colors. There are many options to adjust the picture and sound. My friends come by to play games sometimes and I found out that this TV even has a game mode. Another benefit of this model is the realistic 3D effects. You have to wear the 3D glasses to enjoy the 3D effects, which will add to the cost of the TV if you didn't get in on the combo deal.I did find a dead pixel on the screen during my trial period and called Amazon to exchange the TV right away. I was amazed how easy it was to process the exchange and schedule the delivery of the TV. The delivery company Amazon used didn't provide very friendly or timely service but that's not Amazon's fault. The only thing I wasn't informed of until I was surveyed is that the TV delivery service includes setup and disposal of the box and packing material. Those lazy delivery men didn't even offer any of that service but even if they did I wouldn't let them touch my new baby. The second TV didn't have any dead pixels or other issues. I've been enjoying the TV so much it took me almost a year to write this review. I highly recommend this TV for value, it's features, and great picture quality. It has other cool features such as the ability to stream Netflix through WIFI and use your Android phone as a remote control. I was laughing the first time I downloaded the remote app on my Samsung Galaxy phone and tricked my gf into thinking the TV was changing channels by itself.Pros:- great picture quality- lots of customizable settings- gaming mode- realistic 3D- huge 59\" screen- loud speakers- Samsung smart tv WIFI DLNA support- use Android phone as TV remote as long as you have Samsung's remote app installed.- stream netflix on the TV without extra equipment- software update through WIFI- connect your laptop to the tv via HDMI cable to use the TV as a computer monitor.Cons:- heavy TV- slight buzz noise when TV is on but not really noticeable unless it's really quiet.- you will be watching more TV than normal.- your friends and family members will come over sometimes uninvited to watch TV or play video games.- wish it had more ports", "Date": "August 14, 2012"}, {"Title": "Annoying black to white flashes", "Author": "Patrick", "ReviewID": "R1W2KDBCF052PU", "Overall": "3.0", "Content": "I've owned this TV for a little over a year so it's time for a review.  I really wanted to like this TV but there are 2 major FAILs on this TV.Cons1) [...]There is a known issue with the d series TVs from Samsung where the blacks pop into bright whites aka \"brightness pops\" or FBR.  It took Samsung months to release a fix and even then it was not generally available.  One had to search through the AVS forums, find the patch, apply the patch to my TV and it fixes 90% of the issues.  There are still some movies where I see the pops but at this point I just have to live with it.2) No Amazon Prime Instant Video support.  The older 2009-2010 TVs have Prime support but newer TV's don't?  I can't blame the TV but do blame the two companies for not making this happen on this more than capable TV of streaming content from Amazon Prime.ProsThe TV itself is amazing once issue #1 is resolved with that manual patch.  The pictures are far clearer than other plasmas and LED's I've seen.  The blacks aren't the darkest but movies display great.  Sports have zero flicker and movement is super smooth.  Right now I'm enjoying the London 2012 Olympics on this set and it's just pure joy to watch.  From the kitchen, which is 12ft away, I can clearly see tennis balls \"paint the lines.\"", "Date": "August 1, 2012"}, {"Title": "Better than the Theater", "Author": "PeggyC50", "ReviewID": "R1EO2BUVNJ8RU5", "Overall": "5.0", "Content": "At first we weren't sold on getting a 3D TV. The ones we went to in the theater were not that impressive. We went ahead and went with it but didn't purchase the glasses until later. Once we finally saw the 3D movies we realized it was the right choice, the 3D picture is terrific. The glasses are comfortable and hold up for watching long movies either on Blu-Ray or just choosing the 3D conversion. The kids use it for gaming as well. We chose the plasma because we were placing it in a fairly dark room. This was a good for us and we highly recommend it.", "Date": "June 4, 2012"}, {"Title": "SOLID TV", "Author": "abacus \"Get behind the MULE!!!\"", "ReviewID": "R2SUBXJCD7WVQB", "Overall": "5.0", "Content": "I bought it brand new in September and it's been great.  The picture is absolutely beautiful.  The 3D is pretty cool too.  You gotta remember to turn on the 3d setting each time you watch 3D programming and you have to turn on/synch your glasses each time too...  that's kind of a pain.  Other than that though, this TV is a bargain IMO.", "Date": "February 28, 2012"}, {"Title": "Can't go wrong with Samsung.", "Author": "Keith Bull \"Keith Bull\"", "ReviewID": "R2GCB9LEF0WS6S", "Overall": "5.0", "Content": "This is my 3rd Samsung Plasma that I have owned (still own all three).  I absolutely love the picture of them and this tv did not let me down.  I would say after a good month of keeping the brightness and contrast down, the picture is now set to my liking and looks absolutely unreal.  I would put it up against any other plasma or LCD.  The price is great and the tv is even better.  Highly suggest this or any newer model Samsung Plasma.", "Date": "February 20, 2012"}, {"Title": "Questionable", "Author": "D Fisher", "ReviewID": "R3S3WE6ZJOJCKM", "Overall": "3.0", "Content": "Bought 51d6500 the 2nd of January, rec'd Jan 10th and shortly after watching the Superbowl, (Feb 5th) it just shutoff and wont turn back on. A problem I have read about here on the comment page. Amazon is out of stock and will give me a refund, but now the TV is much higher from other sellers. I also noticed the brightness pops but I found it didnt bother me all the time. When I watched a dark movie or just wanted a better picture I would change the picture quality from \"standard\" to \"Movie\" or \"Dynamic\". Then turned it back to standard afterwards.(the tv gets really hot if left in these modes) You get a grand picture and the brightness pops are gone.Now the decision is do i want to try again with this TV?", "Date": "February 6, 2012"}, {"Title": "Samsung PN59D6500", "Author": "Charles B. Tomlin", "ReviewID": "R10SAP391PL3Y", "Overall": "4.0", "Content": "I would give the PN59D6500 a rating of 4.5.  I rarely give a rating of 5.0 because that seems to represent perfection.This is an excellent TV. Plasma TVs are best for darker viewing areas where there isn't light from windows or several bright lamps.  So I would say a good guide is for a well-lighted or brightlylit rooms go for LED and for darker rooms go for Plasma.  My TV is in a room without a lot of bright lights.I use the PN59D6500 for viewing HDTV programs and Blu-ray and other DVDs.  I am not currently interested in 3D and am not using the Internet-Ready devices so I can't address those areas.  I would rate the picture quality as superb.  It would be hard to imagine a better or sharper picture than I view on this TV.  I have not noticed any buzzing as mentioned as a complaint about plasma TVs.  I have heard other people say that the larger the viewing screen the better.  Well, the 59 inch screen of this TV sure looks better than a 55 inch screen.I purchase the Samsung HT-D6730W Home Theater Speaker System to accompany the PN59D6500 and have found it to provide excellent sound.This is my second HD television.  The first was a Sony.  It is not a plasma. I have been pleased with it also.", "Date": "February 2, 2012"}, {"Title": "Excellent display.", "Author": "Harry R. Wismer", "ReviewID": "R18OONIGL7EQ1R", "Overall": "5.0", "Content": "Take out of box,plug in,beware of scrolls and logo's tweak slightly for a week or so and enjoy.Samsung outdid themselves on this one.Not the high end refinement of an 8000 or 7000 but way more than satisfactory.3D is very good and I am learning the \"smart\" part as I go.Had to upgrade my internet speed to 5 mbps or above.Great piece of electronic equipment.Amazon did their part too with fast delivery and setup.", "Date": "December 18, 2011"}, {"Title": "Love this TV", "Author": "kervorka", "ReviewID": "R3UPDG55KDKHP1", "Overall": "5.0", "Content": "For those who have heard terrible things about plasma TV's, I tell you that the picture on this is better than my friends 1080P 240Hz LED.  The ability to get 3D at the price is (around $1000) isnt easily matched.This TV has protection for \"burn in\" that used to be an issue with Plasma. I have relatives that have had their samsung plasma for over 8 years and still running good with no burn in, even thought burn in was unknown when the started to use the tv.For the Size, 51\"....I had a 55\" projection with 1080i and didnt want to go all the way down to a 46\". This is also perfect.  I have read where most 46\" are actually 45.2 where this is a 51\" and actual veiwable is 50.7. that is a pretty decent gain.", "Date": "December 7, 2011"}, {"Title": "GREAT TV", "Author": "B. Sellers", "ReviewID": "R2OBSJ7777IN28", "Overall": "5.0", "Content": "This TV is beautiful. The features, connections, and other riff raff are all pretty cool too (built-in wifi, \"apps,\" etc.). Bottom line is, the picture looks beautiful; and everything else that doesn't really matter performs well as well. For $1,000 I don't think one could find a better TV.", "Date": "October 15, 2011"}, {"Title": "SAMSUNG PN51D6500 Plasma TV", "Author": "William J. Fuerst \"jazz fan\"", "ReviewID": "R2FG2BY15VQIN3", "Overall": "5.0", "Content": "I did the research like most people. I went everywhere from a $2500 to this $1000 TV. This Samsung 51\" is what I settled for and and am pleased with my purchase so far. Setting up was relatively easy except I made the mistake of not watching the TV on the right input for a few days so I was watching the basic cable input and not HDTV. Then I figured out I needed to set the input menu on the right HDMI input. Then AWESOME picture. Now I have to admit I had trouble setting up the online device. But I think it has something to do with my system not acquiring the signal. I'll figure it out in due time.  I also haven't worked with the 3D. It really is not important to me. Watching sports is a great experience with this TV. Clear, bright, and no ghosting at all. I couldn't be happier with picture and the deal I got. My thinking was to save the extra bucks from buying the higher dollar Samsung's as the features were not worth the extra dollars in my opinion yet they have the same picture quality. Yes I know the newer ones have the tint in the screen to cut glare but all the online discussions revealed that the film in the sets were bubbling. That and the fact that our room is dimly lit most the time I concluded therefore glare would not be a problem for us. And I was right. Here's my two cents on reviews. Reviews are great but the one thing they fail to address is the TV reliability. They just review the new TV in front of them. I went the the local TV repair shop last year to take my old Sony Wega rear projection TV in for repairs and asked the people at the shop about what brand and kind of TV the would recommend. They said get a plasma TV because we hardly have any come in to our shop. I asked them about the Visio LED TV that has the highest ratings. They said they get a lot of Visio's into the shop. The components just don't hold up. Get my point. So just decide whether the few extras on the newer sets are worth another $500 or so. I didn't think so.", "Date": "September 27, 2011"}, {"Title": "Stop thinking about it, just buy it", "Author": "SteveO \"SteveO\"", "ReviewID": "R2XA6KWTQ3HPCL", "Overall": "5.0", "Content": "Read the other reviews, and then just buy it, you won't regret it...I love this product!  I did get mine for about $100 cheaper a couple weeks ago on amazon...", "Date": "September 27, 2011"}, {"Title": "Perfect TV for HD and SD", "Author": "wnichols", "ReviewID": "RY4BIQAA124XY", "Overall": "5.0", "Content": "Great TV!  It even looks great with standard definition.  I did have to return the first one due to it not coming with a remote and the anti-glare film peeling already.  The next one was perfect!", "Date": "August 5, 2011"}, {"Title": "Great TV", "Author": "jpsully986 \"John\"", "ReviewID": "R2Q3KDDVOPM1H4", "Overall": "4.0", "Content": "This TV is awesome.  I do not use many of the features yet other than one HDMI port.  But the picture is great.  Switches to 3D mode automatically.  Not overly impressed with the 3D mode with the glasses and everything either but I did not really buy it for that either.  The WiFi connection was very easy but again I am not really using any of those features yet so I can not comment on that.", "Date": "August 3, 2011"}, {"Title": "Great TV", "Author": "Earlly", "ReviewID": "R22K90A1R7EY0", "Overall": "5.0", "Content": "Great TV Have not tried the 3D yet but if it is good as the tv It will Be Great TooThe only thing I do not like is When you hit the info button on the remote the only thing it shows is the picture quality (1080i) and 60 htz I wish it would show the clock , Samsung says it only showa the clock When you have it on TV mode only and it is true.  I do not like that but the rest is Great.iT IS WORTH BUYINGEarl Wimer", "Date": "July 28, 2011"}, {"Title": "Brightness pops create a terrible viewing experience!", "Author": "buck14", "ReviewID": "RYUDAXI9QNMTR", "Overall": "1.0", "Content": "Th brightness level on this TV is constantly changing on its own! It is really bad on hockey games or when watching 3D movies, making them completely unwatchable. Samsung does not have a fix for this yet, so I would not buy this set until they have a solution for this problem. I should have got the Panasonic!", "Date": "October 11, 2011"}, {"Title": "if i could rate this tv a 0, i would.", "Author": "Kevin", "ReviewID": "R2QRE6BGZGWY5Q", "Overall": "1.0", "Content": "the tv was wonderful out of the box.  i loved it.  9 months in, the screen cracked on me.  i contacted samsung.  the only thing samsung did for me was give me the runnaround.  they had me jump through a bunch of hoops by taking pictures of the sides, back, front of the tv and providing my contact info, serial # asap.  after getting all of that done, they tell me, \"sorry, we can't do anything for you b/c the cause of the damage was from an 'impact.'\"  They transferred me to a customer satisfaction department to discuss further and i was on hold for way too long, yet again.  The previous time i was on hold on that line was over 40 minutes before i was disconnected.  This time i hung up after 10 minutes.  You FAIL Samsung.  My advice to TV buyers.  Don't by a Samsung.  You could be next...", "Date": "January 29, 2013"}, {"Title": "Fluctuating Brightness galore!", "Author": "Sofia Hernandez \"Lover, fighter, sister, moth...", "ReviewID": "R2YTTSQ08TVBPZ", "Overall": "1.0", "Content": "One star because it does suffer from Brightness pops and fluctuating brightness!  IF it wasn't for the fluctuating brightness then this television would have been rated 5 stars.  To anyone reading and considering purchasing any television where consumers complain that there is 'brightness pops' or fluctuating brightness, then I implore you to RUN in the other direction and choose their competitor.Samsung does not stand behind this product and has still to acknowledge that this is an issue by rolling out an update like Panasonic had done to remedy the same issue.  Another slap in the face is the fact that in the SAMSUNG SMART TV apps, Amazon is not included nor supported.  Their reasoning is that the televisions in the D line are not recommended for to be able to show the content properly.  They think that these expensive televisions cannot stream Amazon videos!  What a sham!  The Samsung Smart apps are a joke and slow down everything.  There is nothing intelligent about the interface.Aside from the 'pops'... the picture is beautiful/stunning.  The colors are amazing and I can begrudgingly agree with my family that the 3D looks great as well.  I personally hate 3D and always get a headache from it; but I will admit it is a cool fad.  The television was not purchased for the 3D, that was just an afterthought.  There have not been any burn issues and we did not bother 'conditioning' the plasma or calibrating.  We have owned it since October 2011.  We previously owned a Panasonic plasma commercial model from 2004; that television is still beautiful and has been moved to the bedroom.If you are not sure what fluctuating brightness is...  when you are watching a program and the scene changes from dark to bright, or from white background to a darker one, you will notice something like a flashlight popping.  Another way to describe it is that the screen dims and brightens to adjust to the new color.  At times it is barely noticeable; then there are times that the scenes keep on shifting and you feel as if you are going POP POP POP POP and you scream: DAMN BRIGHTNESS POP! (True story!)  In our home after the initial denial that we did indeed notice POPS, then came the depression.  Now we are at a point where we announce it to the whole house and mess up everyone's viewing pleasure.  Many times I will announce 'POPS' in the middle of a scene and my Husband will become upset because he didn't notice them until I said something.  This leads me to believe that EVERYONE'S model is suffering from the same issue but some individuals are more sensitive to it then others.  Then again... maybe those people are just in denial because it would be so sad to think that we all spent thousands upon thousands on a product that seems to have a defect.Does it buzz?  Well, for me it never did; until the day I walked right in front of it and couldn't figure out what that annoying buzzing was.  I swore it was every other gadget.  My husband confirmed by stating that he had heard it buzzing one night when he was napping on the couch and the volume was low.  The way around this is to jack up your volume LOL.So.. it buzzes and it pops and is not a cereal unfortunately.  If it wasn't for those defects then it would be perfect.  I truly believed that after reading countless reviews and researching on the AVS Forums that maybe I would be a lucky one that received a 'newer' model.  NO... there are not lucky ones... just your ability to realize that there is truly something wrong with your television and not your eyes when the brightness fluctuates quickly.Do NOT RECOMMEND!!  Please do not purchase.  Samsung will not release an update.  IF you would like to research the brightness pops phenomenon, then read all the reviews on Amazon, the internet, page dedicated on Facebook and finally AVS forums.  You will regret it the moment you notice that first pop and hear that first buzz.", "Date": "April 18, 2012"}, {"Title": "FBr and ABL: Ruins the 2011 Samsung Plasmas", "Author": "Mike", "ReviewID": "R21RALB5U0GFS0", "Overall": "1.0", "Content": "I purchased this set intending to update the logic board to rid it of fluctuating brightness. I did update the logic board according to Zoyd's tutorial on AVSforums, and I thought it would be smooth sailing from there. I was wrong. the Auto-brightness limiter still kills ANY white image on the screen. I asked a calibrator to come out in case I was just setting the panel incorrectly, and the calibrator told me that the fluctuating brightness would not calibrate out of the display. He was kind enough not to charge me after I told him I would be returning the set, which I have done. Stay far away from these contemporary plasma sets.", "Date": "March 28, 2012"}, {"Title": "Awesome Plasma", "Author": "Jallen", "ReviewID": "R3B9WRSVGK82NB", "Overall": "4.0", "Content": "Ordered Pn59D6500 on Feb 2, 2012 and was here by Feb 6th. Tv was a breeze to set up. Used it on low settings for first 100 hours. Have it calibrated from posts on AVS Forum now. Blu ray is where the tv looks best, especially \"Avatar\". Watched 3d and it was also impressive.  Have noticed some fluctuating brightness like I've read about especially on \"Rescue Me\" on Netflix, but it doesnt bother me. There is slight buzzing when sitting directly in front of tv and is very directional, dont hear any buzzing sitting anywhere else in the room. The color on this thing is breathtaking at times and overall am extremely happy with my purchace. My last tv was an old Sony SXRD rear projection 55 inch, and the Samsungs color and brightness destroys the Sony's which I always thought were pretty good. What a huge difference in enjoyment this tv is to watch compared to the Sony. I would have gave the plasma 5 stars but I think the Smart function is useless. Netflix is the primary use and laggs badly pausing/rewinding/ffwd, and color looks terrible. I will stick for PS3 for Netflix. Also manual tells you to not watch any 2:35 content for more than 15% of television viewing per week and there is no type of zoom fuction on tv for getting rid of black bars. Says in description there is Zoom 1 and Zoom 2 functions but they only work on the 1 input that is component/av! No zoom for any HDMI content, what a bummer. None of the previous is in no way a deal breaker for me though. The only real compaint I have from purchacing this tv is I wish I could have afforded the 64 incher!!", "Date": "March 5, 2012"}, {"Title": "Perfect!", "Author": "Tammy C", "ReviewID": "RT2HOZIGJL8ZU", "Overall": "5.0", "Content": "Coming from a Samsung DLP TV, the Picture Quality of this TV is gorgeous!  Easy to uncrate and set up.  No problems setting up wifi and checking for firmware upgrades.  We have this TV placed in our family room with north facing windows.  I've always been concerned about a glossy display due to reflectivity issues but have found reflections to be a non-issue, any reflections from ambient lighting is easily looked past and become virtually nonexistent from a viewing point of view.Even though breaking in plasma displays is not as important as years past, to ensure the best possible picture I did download and burn off a color slides display break in DVD and ran it for about 100 hours, when not watching programming.  I've been cautious about watching a lot of programming with black bars (I switch the Picture Screen Adjustment from 16:9 to Wide Fit when needed), I've not found any problems with image retention.Some folks on AV forums have complained about some units having a pronounced buzzing, not ours.  Nor do we have any problems with brightness pops.The 3D display is unbeatable for the price, no noticeable ghosting.I'd considered the more expensive models and felt the features offered for the price were well balanced.I don't use the in-TV speakers as I also purchased a Sony soundbar to replace our aged Samsung wireless HTS so I'm unable to comment on the sound quality.We're heavy viewers and I wouldn't change a thing with this unit.BTW, we do use a Logitech Harmony One remote and, while set-up was originally frustrating, it has functioned flawlessly.", "Date": "February 11, 2012"}, {"Title": "Excellent TV poor internet feature", "Author": "columbus", "ReviewID": "R1OPVKS49MGLJV", "Overall": "4.0", "Content": "This is our first HD TV, we've seen other plasmas and LED's and they don't compare to the Samsung, the clarity in HD is awesome! I'm not a huge TV sports watcher, but I'm hooked on football, the detail you see on this TV takes viewing to a new level, with the big screen it truly is as close to being there as you can get. Many of the complaints I've read about plasma vs. LCD/LED are not a problem, I don't detect any buzzing in the sound, glare seems to be handled by a coating on the screen, there's plenty of brightness to handle daytime viewing. If these were problems in the past, Samsung has worked them out. My only complaint is the remote used to enter alpha numerics when going on the HUB, using the standard remote like an old cell phone is tedious, it would be so much better with a keyboard, although Samsung does offer one at a hefty $100. We ordered through Amazon to a third party vendor, a small problem in shipping, but it was delivered about one day late and in excellent condition. Very pleased with both vendor (Vann's) and the Samsung TV.Update 9/2012 on this model's Smart TV feature, it's pretty useless, crashes all the time and it isn't a normal browser for web surfing, only gets services which you need to pay for. It doesn't handle Youtube very well, could it be Samsung is using Android and it goes back to the problems related to Flash? All I get when I try to use it is frustrated. Still love the TV though, but don't buy it as an internet ready TV.", "Date": "January 10, 2012"}, {"Title": "Great TV and met all of my expectations", "Author": "Jason L. Strickland", "ReviewID": "RWCJ6MOZ3P7VK", "Overall": "5.0", "Content": "Received the TV when expected and the delivery person was very helpful in getting it set up. I am very pleased with the TV. I have not had any issues with the \"brightness pops\" that other reviews have complained about. Once I modified the settings to the TV, the picture was great and the sound is very good. Both the HD and SD pictures are very good quality regardless of room lighting or what programs I have been watching. I have not used the 3D setting on the TV because I do not have any of the stuff to do that with. We were able to sink up to our wireless internet very easily. The apps available for the TV are very fun and my wife has enjoyed using Pandora on the TV.There have only been a few things that are worth negative comment, but none of which would drop down a star in the rating. The TV is very reflective so do not set it up across from any light sources such as windows or doors that allow light through it. Most of my electronics are older so they are set up for A/V ports. There is only one A/V port on the back of the TV so I have to switch the cords if I want to use something other than my DVD player such as my Wii or original XBOX. There are plenty of all other types of ports. As expected with Plasmas, the TV puts of quite a bit of heat. When we first opened the Smart Hub, we could not connect to Samsung's app store. We got a message saying \"there is network interference, please try again later.\" I used the Samsung customer service chat room and the tech explained that the network was being updated and it would be available shortly. He was very helpful and that evening the app store was available again. Unless you have the extra money to buy one of the two higher lines of Samsung TV, I would highly recommend going with this one. That is especially true if you can catch it on sale and get the free shipping. I looked at the comparisons of this TV with the higher end ones and the only difference is a few additional things that most people would not use.", "Date": "January 6, 2012"}, {"Title": "Truly fantastic", "Author": "Joseph Mckenna \"DrJoeMcK\"", "ReviewID": "R1F3XBMS082JI1", "Overall": "5.0", "Content": "I am not a nit picking techie.  I just wanted a TV that is big and looks good and can connect to my wifi to view the videos from our computers/phones.  I chose this one because so many of the similar plasmas seem to be reviewed with some significant problem and I felt that if I got the problem that comes up in reviews of this Samsung, I could live with it.  I don't see any of those other problems so many reviewers post about.  I've had the TV for 3 months now and it just looks great and works well with the wifi connection and Hulu Plus and Netflix.  Love it.", "Date": "January 4, 2012"}, {"Title": "Outstanding", "Author": "Eric A. Mauer \"Bonita Eric\"", "ReviewID": "R20F5EUMZIB925", "Overall": "5.0", "Content": "After reading the pros and cons on plasmas - I decided that for the money it was the way to go. I was correct. The picture is great. You have to go and select the best sound for you since the speakers are in the back. For me movie sound mode works. I have tried the 3d simulation twice and I was not all that impressed, but I have yet to try a real 3d movie. Regardless that was not the main reason I bought the TV. I do wish that Amazon was an option under apps for movie rental - I assume that app will become available. A great TV.", "Date": "October 27, 2011"}, {"Title": "I hug it every day", "Author": "John J. Dubois", "ReviewID": "R232EW6FBYQABK", "Overall": "5.0", "Content": "Pros*Excellent,I mean Excellent picture.*VERY little glare from my many windows.*Good response time, though it shows on screen I am at 60hz. Don't quite understand that. Perhaps missing a zero because it was advertised as 600hz.*Sound is adequate and much cheaper than a sound bar for me anyway.*Zero BUZZ with sound off as some posters have spoken of.Cons*Does throw off significant heat. Only time will tell how much it shortens the life span of the electronics. Might come in handy this winter :-)OverallI love it.  I do hug it everyday.  My wife calls me nuts.  I say I am in love with my TV.  Have not tried the 3D yet.", "Date": "October 11, 2011"}, {"Title": "Great Quality and Value TV, Your Money Isn't Wasted On Diminishing Returns", "Author": "William", "ReviewID": "RFXFPO307P2CZ", "Overall": "4.0", "Content": "The PN59D6500 I purchased was open box (very good) from Amazon Warehouse.  Before you move on to the review, note that I read AVS Forums quite a bit.  However, while it has a healthy breadth of information on tv technology, reviews, and issues to help you make a somewhat informed decision, I find issues and criticism on the site overblown at times.  Since you're reading my review, you'll need to understand how my viewpoint differs from those found on AVS Forums and other sources.  I consider many deficiencies to be mere quirks rather than cons.  I love television technology (last tv was a super fine pitch Sony crt) and enjoy reading about difference in image quality.  However, I consider spending additional money to calibrate the television (objective approach) excessive when you can adjust picture settings to your liking (subjective approach).  Lastly, I do not expect sharpness, fluidity or artifacts to be any better than that seen in a typical movie theatre (the blackest black is still brighter than the wall, there used to be film artifacts in the image, etc.).  A television which approximates an average theatre screen is great in my book, regardless of how many other televisions can incrementally improve on its image.  Lastly, I sit about 6 feet from the tv; and no, it's not too close for Netflix quality material or better.Pros:- Black levels are not inky black, but much darker than your average television.  If this is a sticking poitn for you, just realize that it's blacks are blacker than those seen in a theatre.  In comparison to my Sony CRT, it is comparible or better.  In comparison to an LG 60PZ950, it is much better  this tv is also a better value at this time).- Colors are rich, but realistic and brightness is sufficient for daytime viewing on the movie setting (you might like other settings, but movie is my preference).- An anti-reflective screen absorbs a significant amount of the incident light during the day, but I still get some glare which is annoying at times.  If you are set on a plasma, this is very good and much better than my crt.- Smart Tv apps are cool and probably useful in many ways.  I've used Netflix and The Explore 3D (contains a full length 3d surf movie).  You can also connect directly to any device on your home network and browse pictures (browsing is quite slow however).- I dealt with Samsung support to fix an issue with the component video not working correctly (no/weak signal).  Support was fast and no hassle (they agreed to send a technician over on my first call since I already performed the troubleshooting thoroughly on my own).- 3D is great, with little cross talk (I was not actively looking for it, and did not see any when watching Resident Evil Afterlife and the free surf movie).  If you've seen 3D before, this tv provides the experience you expect from the technology to this date; however, this tv is not going to make you \"like\" 3D if you don't already.  For instance, you must be willing to focus only on the primary subject in a scene and not look around to enjoy the periphery (which will seem blurry, 2D paper cutter like, and somewhat translucent).  The 3D glasses from the Shrek/Megamind starter kit did not turn off once during a movie and automatically turn off when 3D content is turned off (they do not automatically turn on).Cons:- There is only 1 component video port (not two as stated by Amazon) and it is shared with the composite video on a cable adpater.  If you have older high-def devices or dvd players, this is not enough. FYI if you have issues with no signal through this adpater, not that this adapter also requires much more force than expected to plug in correctly.- Shadow detail is lacking, but adjusting the gamma can help.  I prefer slightly better shadow details than darker black levels anyhow - seeing black in every dim scene is unrealistic.Quirks:- Low frequency buzz exists, but is noticed at low volumes (you will here it during scene transitions of black and low audio), close distances, and varies in frequency depending on the screen content.  The buzz is generally unobtrusive since you hear it when there is nothing else on screen to get your attention (i.e. it does not detract from meaningful picture or sound content).- Abrupt brightness changes occur sporadically and mostly in the black bars.  You might notice it without looking for artifacts like I did, but after watching a few movies I've concluded its quite rare.- Slow browsing of media on your computer.  I didn't check, but this probably has to do with folder size, number of items in a folder and file size.  This isn't a con since it's already cool that you can browse files on other devices in your network.General Observations:- The volume is sufficient at a 6 foot viewing distance and has no abnormal hiss or fuzz.- Cosmetically, the television is beautiful.  While the bezel is plastic like most televisions, it successfully approximates a dark grey brushed metal.- The stand stability could use improvement, but it will not fall over.- The remote is backlit and has a lot of functionality.  I prefer a simpler remote.Here is a short blurb on purchasing from Amazon Warehouse.  I received the tv in the original packaging with all protective plastic still on the tv; however, the box was heavily distressed.  Fortunately, the television was pristine.  This was surprising since I thought this might only be the case for \"like new\" product, not \"very good.\"  I was probably lucky.  On the other hand, by the time I received the tv the price difference between a new tv from an Amazon fulfilled merchant, Paul's TV, was just $70.  The risk to buy a used, open item at this price range was not worth it even though my specific tv was obviously pristine - I was not anal enough to check the hours on the tv.  Obviously, you have to make your own decision regarding the savings and risk incurred.", "Date": "October 6, 2011"}, {"Title": "Wow! Outstanding", "Author": "Major Tom", "ReviewID": "R2E04PRNRVG89M", "Overall": "5.0", "Content": "First, I have been watching a Toshiba DLP slowly degrade since buying it five years ago, so any TV would have looked good after that experience.Samsung has wowed me and brought our home into the 22nd century with 3D and 2D to 3D up conversion meaning yes, any picture on your TV can be seen in 3D by turning on your 3D glasses even over this old guys bi focal glasses. Picture and sound quality are outstanding through our receiver. All in all Outstanding!", "Date": "July 24, 2011"}, {"Title": "great set, missing Amazon Instant Video", "Author": "Andrew", "ReviewID": "R12DG6PX9461GB", "Overall": "5.0", "Content": "Amazon Instant Video isn't supported on the 2011 D series for some reason. Weird since last years C series worked with Amazon Video. They need to fix this asap. In the meantime, i'll be streaming Amazon thru my Sony BluRay which does have Amazon.", "Date": "September 11, 2011"}, {"Title": "Horrible TV", "Author": "cc", "ReviewID": "R1A63T0YIWVKM4", "Overall": "1.0", "Content": "The TV worked great for 15 months then died, no picture. One day it just quit. Never buy a SAMSUNG item again. Back to SONY for me", "Date": "September 26, 2012"}, {"Title": "samsung 59 inch 3D Smart tv", "Author": "gary harding", "ReviewID": "RFR3UIEQYG9V3", "Overall": "5.0", "Content": "Meets all my expectations,  customer service was great, shipment as on time, box arrived intact and properly packed with shock telltales to indicate improper handling.  tv is outstanding and price was approx. 250.00 less than local stores.  great job, would highly recommend.", "Date": "March 14, 2012"}, {"Title": "Great picture but buzzing was too much.", "Author": "eggy28", "ReviewID": "R2NTCQZNNTKXEU", "Overall": "2.0", "Content": "I bought the Samsung pn59d6500 plasma on 12/29/11.  Everything was delivered great, things were looking good.  After installing it on the wall, I turned it on the first time and heard the dreaded buzzing noise as it booted up.  The picture quality and aesthetics of this tv are superb but I couldn't get past the annoying buzz. I could easily hear it sitting 12ft away with the volume of the tv at 10-15.  I have another samsung plasma a few years old that doesn't make a peep.  The return process took a little time but Amazon was great to work with.  Reading all the reviews, I couldn't get myself to buy another Samsung plasma even if I upgrade to the 7000 or 8000 series, so now my new Panasonic gt30 is on its way :-)", "Date": "January 25, 2012"}, {"Title": "pnd51d490 samsung 51\" plasma 3d tv review", "Author": "mike t", "ReviewID": "RX1AC2XEOD7GL", "Overall": "5.0", "Content": "Samsung PN51D490 51-Inch 720p 600Hz 3D Plasma HDTV (Black)i love this tv the 3d looks awsome and i can't believe the price!!! i didn't purchase it from amazon this time, although the online company that i purchased it from was not willing to help me samsung has gone out of their way to accomedate us. My television broke shortly after i purchased it and samsung immedietley sent someone over to fix the problem. I have had a wonderful experience so don't believe all of the negative comments. The tv is an amazing value and i would recommend it to anyone. it is not 1080p but i honestly have not been able to notice a major difference in the quality of the picture. the resolution is still very impressive.the glasses are blue tooth and very easy to syn and turn off and on. They are very lightweight and comfortable. the only drawback is there is a glare on the tv during the day but all plasmas share this trait from what i hear. if you can afford it buy this tv for you and your loved ones!", "Date": "January 19, 2012"}, {"Title": "Great Picture", "Author": "D. Grenier \"Mainer\"", "ReviewID": "R3IEAP4FHHEYLX", "Overall": "4.0", "Content": "Have had this about a month now; love the picture.  I can't use the Samsung remote for changing channels or sound control as I'm connected with HDMI.  Don't know what's going on with that, set up should be a absolutely straightforward with HDMI; but have this glitch going on.  Other than that really love it so far, but have too many remotes sitting around.", "Date": "January 10, 2012"}, {"Title": "Superior performance", "Author": "PjMod10", "ReviewID": "R1U5POLB6DNTJ8", "Overall": "5.0", "Content": "I was hesitant to purchase a plasma TV after the last few years of impressive improvement in LCD technology, but the quality of the plasma display has been well regarded for many years. After viewing a few LCD and plasma TVs at a local retailer, and found that the picture quality of the plasma's was noticeably better (to me), and the anti-glare on each type seemed very similar (unlike previous LCD anti-glare which was less shiny), I decided to purchase the Samsung PN59D6500 for my main living space.I was replacing a Sony Trinitron flat CRT that supports 720P HD, the picture quality was impressive, and I have several LCD computer monitors that support HD that were not as impressive, so I didn't know what to expect with the new plasma TV.Setup was a breeze, the wireless connected immediately to my WiFi, and I was watching instant content from various sources within a few minutes.  I use over the air digital TV, and they tuner in the TV handles that very well. My Blu-ray player was instantly amazing to me, too. Seeing the full 1080P on a 59\" TV is really eye-opening.I decided to watch some Blu-ray movies again to determine if there was a noticeable difference in quality, and there was.  High speed sections of the movies were flawless, the pictures were always very crisp, the colors looked deeper, and the lighting seemed more consistent.  I know it's subjective, but I'm impressed with the immediately noticeable differences.I've had good success with other Samsung monitors and devices in the past, and this purchase has certainly lived up to my high expectations for their products, and has exceeded my expectations in high quality, simple to use, modern televisions.", "Date": "January 7, 2012"}, {"Title": "A review from an average gaming family!", "Author": "Jane", "ReviewID": "R2FYEPZ0QZTU8N", "Overall": "4.0", "Content": "I purchased this during the 2011 Black Friday deals event- spectacular pricing on a spectacular television.My family is not fond of 3D anything, so I can't tell you how this TV performs in that area.  I can tell you that we are gamers and this is our first plasma television.  I've owned an LED television, as well as an LCD rear projection television, sony and samsung respectively.  I preferred the Samsung Menu so after much deliberation chose this model as the successor!  I had heard that gamers weren't really supposed to use plasma TVs, but then recently I had found new information indicating it really wasn't that big of a deal with modern plasma televisions.As far as value goes, I love this television.  I appreciate the included wiFi and the number of ports on the back.  Getting it internet ready was easy instead of a war like it is with a lot of devices.  I actually sat in disbelief that it was so quick!I like the menu layout.  I think it's nice and clean, easily navigated.I don't like the way the samsung apps work!  I was unaware before, but you can't just run off and download any app you'd like for the television- you can only download applications from the Samsung store, and the pickings aren't as great as I would have liked.  For instance, the youtube app wont allow you to see your own account, your subscriptions, favorites, etc.  I don't mind it so much because I can always use one of my many ports to hook my laptop up and watch from there, but it was inconvenient to learn.  There just aren't as many -useful- applications, unfortunately.  Sure, I can social network to my heart's content, but that's not really why I purchased a SmartTV.The netflix app is standard, as is the hulu and the video purchasing one (vodu?  I forget what it's called)  There isn't an option for an Amazon Prime Videos app yet, but apparently it is in the works.A keyboard is almost a necessity- it's just too much of a hassle to bother with the various keyboards on the applications.As far as the display, I think it's beautiful.  The blacks are true, the colors vibrant- and with very few settings tweaks.  All of the games we play look stunning and beautiful in so many ways, and when used it to play Skyrim on my laptop?  Heaven.  Literally the best TV I've ever seen.The buttons on the television are awkward.  I'm still not sure exactly where they are, (right bottom corner?) but activating them on the way to the bed has been a problem ending in me searching for the remote to turn it off.  I have no clue if there are sound controls on the side, either.  It just resembles a small silver panel and with my TV height (on a low profile stand, similar to most homes these days) I think they're inconvenient.  My last samsung had them on the side, in the center portion of the television - with a large, obviously-a-power-button in the center bottom half.  I suppose I can't expect that with the low profile look, though.On that note, it is quite low profile!  Not the supersuper-nearly-no-borders type, but it's very slim, with nice edges for balance.  The edges are .. silvery chrome, and it gets dusty fantastically easy- which is a big negative since we are a very dusty household.  The black always looks fine, but those edges just get filthy looking!None of these things are really bothersome because the television is just ridiculously beautiful, though.  I will say also that during the day there is significant glare if watching the television from certain angles.  It's better to just draw the curtains for your viewing experience.  I cannot hear the buzzing unless I've muted the television set.  Thankfully. :)What else?  Oh.  The sound is really good.  When we didn't have our soundbar hooked up, it was just really nice sound- not at all flat like you would expect from a television that thin.  I mean, on the older models that were 5-12 inches you could expect rich sound that you would supplement just because you enjoyed having surround sound- but this is even better than those models, reminiscent of how JBL compact speakers sound.Okay, so final breakdown.I actually LOVE this TV.  It pained me to think of the few flaws I love it so much.  The price point is wonderful, too, and negates all of it's flaws.  Even now, what a fantastic price!  I actually purchased through Dell so I could have a warranty plan I was familiar with (the devil you know vs the devil you don't) and even then, SO CHEAP!  Goodness.  I took off a bit because of the Samsung Apps Issue, and then a bit because of the power button fiasco- but this TV is really five stars in my heart.", "Date": "January 5, 2012"}, {"Title": "Nothing short of amazing", "Author": "EnEmGee \"Peace & Progress\"", "ReviewID": "R2EWCHPJLCLZ8", "Overall": "5.0", "Content": "6 years ago I got myself a 54\" HDTV from Panasonic. One of those rear projection TVs that you might barely remember. It was the final year of production for Panasonic. Ever since then, I am hooked on to HDTV. The Plasma HDTV that followed was way too expensive and the following LCD HDTV were too \"unreal\" esp. with their inability to deal correctly with color bands and blacks. Fast forward to Christmas this year, and Plasma HDTVs are at a price point which equals my buying price 6 years ago. Time to buy.So I started researching various HDTV review sites including amazon, avs forums, hi def junkies, and especially televisioninfo.com for a critical objective review from TV experts. Once I assimilated all my information, I made the decision to go for the Samsung D6500 series since it was a step up from the D550 series in terms of wifi, smart tv apps, higher contrast levels and Anti Reflective screen without the drawbacks of the Black Filter found on the next high up series (reduced viewing angle). In short, the D6500 was the best compromise.So why not the Panasonic Plasma one might ask. The true answer is that a Panasonic Plasma is what I wanted in the first place. But after reading all the reviews esp. on televisioninfo.com, I decided to give the Samsung HDTV a shot, especially with the price/feature levels on the D6500. Good thing Amazon has a Free 30 day return policy so it gave me the reassurance to try out my hunch. And I am impressed.It has been about 2 weeks now and I have tried out the HDTV content as well as the 3D TV content on Direct-TV and it has been a stunning experience for me as well as all of my family members. My kids hated 3D movies in the cinema hall as it always gave them headaches. No more. with the bluetooth 3D glasses SSG-3100 and SSG-3500 (purchased as open box items from Ebay) the 3D content viewing is pain free and we can watch whole movies and not even get distracted by the glasses. They are that good. No Flicker, No Ghosting. Pure 3D immersion from any angle in the Media room. I have even sat at 60 degrees from the center and only 4 feet away and it was perfect.As far as picture settings/calibration go, here is what I am using after trying out the presets available. Rather than using any \"software\", I like to adjust according to what I like to see. This is for my viewing pleasure not somebody else's.Picture - Relax modeBrightness - 35Contrast - 100Cell light - 20Color Temp - CoolBlack Level - LowEco - OnSo where do I have it set up? Not on the wall. Why? for the simple fact that I like to move my furniture around every 12 months or so. Secondly, I have a Yamaha 5.2 Receiver, a Directv receiver, a PS3 and my Wi-FI Router. They all take up space anyways so the idea of mounting the TV on the wall to save space sounds ridiculous. My TV is on a table 20 inches high, with the AV components stacked underneath it. At a distance of 12 feet, it is at perfect eye level from my cinema seating sofas. I pity the folks who end up watching their HDTV mounted high up on the wall not realizing that they are straining their necks in that process.So what is not to like? The smart TV apps are good, but anyone who owns a PS3 will realize that they do not hold a candle against the sheer processing speed and power of the PS3 apps. In essence they work, but they are slow to scroll through list of programs, FF and REW, etc.And yes. I am not using the Wi-Fi. Rather it is plugged directly into my Wireless Router.Another thing to mention is that as soon as I turned it on, the TV found an update pushed out from Samsung and it went ahead an updated the TV.To all those who have experienced the brightness flicker/pop (read on AVS), I have not experienced anything like that. Is it due to my settings? or the Samsung update? I don't know, and do not want to find out as I am enjoying the TV as it is right now.The final \"wow\" moment? I also got 10% off the price in my cart as I used my Discover Card.", "Date": "December 29, 2011"}, {"Title": "Broken!", "Author": "Kevin", "ReviewID": "RJVV7T4NY2EWH", "Overall": "4.0", "Content": "Looked forward to receiving my Samsung51\" in time for New Years only to have it delivered with a broken screen(several breaks) dent on back and beat up box(Looks like FedEx got a hold of it).Now I have to wait to be refunded since I didn't buy it from Amazon but another vendor on their site.If you buy from Amazon they would send a replacement immediatley.", "Date": "December 28, 2011"}, {"Title": "Samsung 59\" plasma", "Author": "Dimer", "ReviewID": "R1W4HAXZKH8KYI", "Overall": "5.0", "Content": "Great picture for plasma in darker basement rec room, Smart features are excellent and very intuitive, good value for price paid.", "Date": "November 22, 2011"}, {"Title": "Could not ask for more, a great TV!", "Author": "Kristopher", "ReviewID": "R1JWCP6WKCGXJF", "Overall": "5.0", "Content": "After 3 months I am still impressed by this TV, the picture quality is excellent & so is the sound. I have zero complaints & i would recommend this TV to anyone that is considering buying a HD TV.", "Date": "November 15, 2011"}, {"Title": "Awesomesauce", "Author": "Brian Artiaco", "ReviewID": "R2XL8E92U3620I", "Overall": "5.0", "Content": "The problems with this television?  It's almost excessive in how decadent it is.  59\"  Almost too large.  I  mean wow it's big.  SD quality?  Well, it looks bad... because it's on FIFTY NINE INCHES!!!  No sd signal can withstand this kind of awesomeness.Fin.", "Date": "August 14, 2011"}, {"Title": "Completely satisfied", "Author": "Anthony DiGiovanni", "ReviewID": "R2MJSKBL7R73SO", "Overall": "5.0", "Content": "This is a great TV and the Price was unbelievable! The picture is amazing... I wish It came w/ the 3D Glasses", "Date": "July 12, 2011"}, {"Title": "Stay away from 2011 Samsung TVs!!!", "Author": "Mario Lapointe", "ReviewID": "RLY67SCTBJ5YH", "Overall": "1.0", "Content": "Hello everyone,I'm another victim of the Samsung Brightness pops & I'm not going to stand & wait for Samsung to give me more \"there is no issue to fix\" replies ; I'll be returning my D6500 tomorow in exchange for a Panasonic. Samsung really dropped the ball with their 2011 video processors that are unable to produce black level detail & force the sets to constantly fluctuate their gamma & brightness ... looks like they're only going to focus on their OLED screens from here on anyways (which already has well documented reliability & longevity issues), so it's time for us to focus on companies like Panasonic who actually \"care\" about their customers & buy their more reliable products.Cheers & good luck to you all,", "Date": "January 17, 2012"}, {"Title": "a review for people who debate between plasma and LED.", "Author": "caraveli", "ReviewID": "R31DY67X19UEYO", "Overall": "3.0", "Content": "I was shopping around for a TV for a month. I am not an expert and I was reading reviews and listening to a lot of sales people before I purchased this TV.Long story short, i returned this TV and now I am a proud owner of the UN55D8000. It's amazing how people who love plasma will look at us (LED people) like we are beneath them.The plasma was recommended by sites like cnet and by sales people at best buy and magnolia who claimed that all the directors use plasma TV for it's true colors and deep blacks.Well... If you want deep black you got it! But that's all you get. In my personal opinion you can get real black from an LED and the bright whites when you need it. Unlike the plasma that can never get the bright white (the white is so dull).When I returned my plasma (for being too dark) I was happy. It always felt like you are wearing sunglasses with the TV.You know, it's like when you go outside and it's very bright from the sun and you need sunglasses? You get this darkness (like you have sunglasses) with the plasma. I don't wear sunglasses so I need that white to pop. It's all a matter of personal preference.With a plasma it's like you have tint on the TV all the time, and in a little annoying way you can never take it off!Ask any salesman what TV they would buy and they will say PLASMA. Ask them what model TV they would buy from all the ones they have in the store and than you get a different answer! Suddenly they all love the ELITE, but is it Plasma or LED?The Elite is an LED TV that has the deep blacks of a plasma and the brightness of the LED.LED for me is a win win situation, you get the deep black and the bright white.I know a lot of people will disagree but hay, it's a free world.If you are used to the LCD TV and/ or not a big fan of sunglass ALL THE TIME then buy an LED TV. Don't let anyone convince you otherwise. Your eyes won't fool you! LED is beautiful.If you were and always have been a plasma guy than you are in for a treat! This TV has the best quality picture I've ever seen (until I bought my UN55D8000 that is).If you don't mind tint on your screen than it is the TV for you.I am not trying to start an argument here but I have a saying of \"live and let live\" and in this case I would say go for what you like in the store, and don't listen to anyones opinion about LED or Plasma.Once you decided which person you are then ask about the certain models within this category.Thanks for reading.", "Date": "January 30, 2012"}, {"Title": "Fluctuating Brightness Issues!", "Author": "Jack Tors", "ReviewID": "R3QWDM2CXBL6PY", "Overall": "1.0", "Content": "I recently purchased this TV and thought it was perfect...perfect until I watched hockey and noticed brightness \"pops\". The pops happened as the camera panned from center ice to the goals. It got worse as the game went on. While watching a movie today, the TV had issues where the scene was set in a bright area and the camera panned from one face to another.I'm also frustrated that I chose this TV over the Panasonic ST30, as the Panasonic also had known issues with fluctuating brightness. Apparently this has since been remedied via an update. I now wish I would have purchased the Panasonic instead.Hopefully Samsung will address the issue soon.", "Date": "October 17, 2011"}, {"Title": "GREAT ALL AROUND PLASMA", "Author": "Brian Ricco", "ReviewID": "R24DRLKY9GQYQ6", "Overall": "5.0", "Content": "I was looking for a 50-51 inch screen for the kids room.  The price was right on the 6500 and it was loaded with connectivity, 1080P, 3-D, and everything I was looking for, but at a really great price point.", "Date": "January 12, 2012"}, {"Title": "screen cracked", "Author": "Robert E. Rogers \"bowlerbob\"", "ReviewID": "RKO1U8JGJJ2JJ", "Overall": "2.0", "Content": "This is a nice tv...beautiful pic..nice 3 d...hower after 4 months there is crack in the screen..samsung refused to fix it..said it was caused by external damage...so theres a thousand dollars down the drain..I went out and bought a lg model..never buy a samsung again...sad", "Date": "December 29, 2011"}, {"Title": "Great Specs, poorly delivered", "Author": "D. Carroll", "ReviewID": "R1213YQMK7D2W6", "Overall": "3.0", "Content": "I bought into Plasma over LED.  However, the \"white glove\" shipping via Pilot didn't work out as expected.  When I opened the box (after the delivery truck was gone, of course), the screen was fairly well shattered into about 20 pieces.That problem along with the concern that delivery of a replacement took us well past Christmas and New Years (it was, after all, a Christmas present) led me to my local big box store.  Unfortunately, this model is no longer available at retail, and the only Samsung plasmas were much smaller.  So I wound up back where I started:  an LED.  Smaller, more expensive, but up on the wall and working fine.Delivery (by me, from the store) of the replacement was flawless.It's hard to pick a star rating since I never got to actually turn the set on.  In this case, I mark it down to 3 stars, in order to reflect the poor quality of the delivery.I see my Ottawa address is listed.  I had the TV delivered in New York.", "Date": "December 28, 2011"}, {"Title": "SAMSUNG 59\" 6500", "Author": "Randall Dill", "ReviewID": "RP7KNQ9L6M8GB", "Overall": "5.0", "Content": "This TV is absolutely awesome! For a plasma screen it exceeds all my expectations. Flesh tone are pure and accurate. Make sure you have a large enough room for this monster - and sitting back at least 12 feet from the screen is is an eye-popping experience- especially in HD mode. Do not buy a LED unless you want a cartoon-like picture.  But if you want a natural look, this Samsung TV fits the bill!", "Date": "October 5, 2011"}, {"Title": "wow", "Author": "atwinspin", "ReviewID": "R9QIZ3AL3T2L", "Overall": "5.0", "Content": "If there is something better for a picture I need to see it. Sound is very good ,I feel , my tv is in a corner if that makes a diff. wow", "Date": "April 20, 2011"}, {"Title": "EXCELLANT HDTV BUT DOES NOT SUPPORT AMAZON PRIME VIDEO", "Author": "RC", "ReviewID": "R3LAIRZQFURF51", "Overall": "1.0", "Content": "I purchased almost the identical (50 inch vs. 51 inch) model about a year an a half ago and have been extremely pleased with it. I wanted another TV for my den and bought this model which I assumed would be practically identical to my other one other than the size of the frame. However, Samsung decided on this newer model to NOT support my Amazon Prime videos.  This was not the fault of Amazon.  Although I consider Samsung and this particular model as five (5) stars regarding overall quality, and there are ways to overcome my problem, I did not appreciate the actions of Samsung in dropping support of the Amazon materials and, therefore, ordered a different brand.Amazon was and always has been EXCELLENT in customer satisfaction and promptly picked up the unit and refunded my money.RCC", "Date": "April 6, 2012"}, {"Title": "Bad tv and device", "Author": "J. Dias", "ReviewID": "RT1VKVK041BVP", "Overall": "1.0", "Content": "Received a damaged TV. Company would not replace tv and told me to repurchase. The reason was the cost went up. No Redon why I can't exchange. Wasn't a happy customer", "Date": "January 31, 2012"}, {"Title": "2008 samsung plasma", "Author": "Diana", "ReviewID": "R1TTPZBZ2OPC7G", "Overall": "1.0", "Content": "I purchased a 50in samsung plasma tv in Dec of 2008 and tonight it almost caught fire. my house is still reeking of the hot wire smell. It was a good thing I was home at the time. I checked my warranty and of course it had a 1 year warranty on anything and 2 year on parts and labor. Well mine never made it to three years and it cost me $1500.00 at Sears.I had a Hatachi for thirteen years before. I guess I won't be buying anymore Samsung products.", "Date": "September 16, 2011"}], "ProductInfo": {"Price": "$2,199.99", "Features": "3D glasses not included in box, must be purchased as optional accessory\nMega Dynamic Contrast Ratio 5,000,000:1\n600Hz Subfield Full HD Motion performance\nSamsung Smart TV\n3D picture performance", "Name": "Samsung PN59D6500 59-Inch 1080p 600 Hz 3D Plasma HDTV (Black) [2011 MODEL]", "ImgURL": "http://ecx.images-amazon.com/images/I/51eRnceZahL._SX300_.jpg", "ProductID": "B004MNADZS"}}