{"Reviews": [{"Title": "Decent picture, no headphone output jack", "Author": "SB Leo", "ReviewID": "R7RE5BKRW1FW6", "Overall": "4.0", "Content": "This TV has very good picture with lots of options for video adjustments including the options to turn the Game Mode ON/OFF and to adjust the backlight. I like the Channel Browser feature which gives us the access to the channel list, the favorite channels, and the history list of the channels we've been browsing. I agree with the previous reviewer that we'll need to download the pdf manual from Toshiba to understand all the features and how to use them. The pdf user's guide can be downloaded from Toshiba dot com in the section \"Services & Support/Consumer Products/Televisions, DVD&BD; Players\".Regrettably, this TV was purchased for a family member who has hearing impaired and the TV does not have a headphone jack to connect the powered speakers to improve the sound so I had to return it to Amazon and bought a Samsung UN19D4000 (also from Amazon) instead. The Toshiba 19SL410U does not sound too bad with its built-in speakers but as we've already known, the sound from a 19\" LCD TV still leaves much to be desired even for the people with normal hearing. The 19SL410U has a digital optical audio output and FIXED left & right RCA audio output, both require a full surround sound system to connect to and that's not practical in most cases for a small TV of this size. Even if we connect the TV to the surround sound system via the digital optical or the FIXED left & right RCA output, we still can't control the volume with the TV remote but we will have to use the remote of the surround sound system to change the volume. However, if you already have a surround sound system and don't mind connecting the TV to it, this TV is a great TV with excellent picture.BTW, the Samsung UN19D4000 is an excellent TV with tons of video-audio adjustment options and other features. The picture is one of the best 19\" LED-LCD screens I've ever seen and it costs about the same as the 19SL410U as of today.", "Date": "May 20, 2011"}, {"Title": "Terrible Audio", "Author": "David Hartke", "ReviewID": "R3JDF498GQJP2R", "Overall": "2.0", "Content": "I bought this TV several months ago.  The picture and remote I would rate as excellent.  HOWEVER, the sound is TERRIBLE.  I always thought Toshiba put out quality products but how they let this one out with such crappy sound is beyond me.  I simply could not understand what was spoken!  I suspect they took some crappy speakers from their laptop division and put them in this unit.  I finally went to Walmart and bought some Logitech external computer speakers and they work fine.  However, I cannot control the sound through the remote (the audio out receptacle has a fixed output and the tone level does not work with this output) and have to go over to the right remote speaker to adjust the audio.  If you don't mind buying some external speakers then this is a good TV but otherwise I suggest you look around for something else!", "Date": "January 1, 2012"}, {"Title": "Excellent for kitchen or small bedroom", "Author": "William R Edens", "ReviewID": "R1MCCS4WCO7BSA", "Overall": "4.0", "Content": "This 18.5-inch set was shipped to me packed only in the factory box, but UPS got it here in perfect condition.  Its picture couldn't be sharper, and the sound seems good.  There is a printed setup guide included, but you have to download and print the 62-page Owner's Manual yourself from the Toshiba.com website.  That's a necessity, as the 19SL410U is packed with features and adjustments, and Toshiba's corner cutting is the only reason it doesn't earn five stars.", "Date": "April 22, 2011"}, {"Title": "Sound is really awful - as other reviewers have stated.", "Author": "CharlieK", "ReviewID": "R3TVHNIR2VJIO6", "Overall": "2.0", "Content": "There is absolutely no bass from this unit. Not a great deal of room for adjustment. Yes, it is a small TV, and yes I was warned. But have to say it is really really awful. You do have an option to turn up the volume higher and higher, and often still you can not clearly make out the audio. After prolonged exposure you wonder why you are getting a headache, and then realize it's the TV at 60 or higher.No other issues, it was a breeze to set up and I hung it on the wall with a VISA mount in a kitchen. Picture is lovely.Use this with external sound system, or expect sub-par sound experience.", "Date": "September 11, 2011"}, {"Title": "Decent", "Author": "CDJones", "ReviewID": "R30243CBFF95FP", "Overall": "4.0", "Content": "Easy set up, good reception with an accessory digital antenna, beautiful picture, but the sonic quality is not wonderful.  Still, a nice second TV and a decent value.", "Date": "June 23, 2011"}, {"Title": "Excellent picture, great TV for the price with a TON OF FEATURES", "Author": "S. Koepper \"fd_papa\"", "ReviewID": "R17ODSTMV88VR2", "Overall": "5.0", "Content": "Got this for my 7 yr old daughter's room for Christmas.  So far only hooked up to DVD player (so as to control what she is watching).  Awesome picture, decent sound and every imaginable input you could possibly want.  Sure it is not my Samsung 56\" with 1080p, but I wouldn't put a 19\" tv in my living room either.Well packaged, EASY connection to the included table base, extremely LIGHT WEIGHT was surprising (especially compared to LCD) and simple to setup.This is a GREAT QUALITY TV for an even better price.  Exactly what I was looking for at exactly the price I was hoping to find.  Excellent TV for bedroom, office, kitchen, shop or garage.", "Date": "December 25, 2011"}, {"Title": "I have no complaints here.", "Author": "Art", "ReviewID": "R2T584X1D7IW7N", "Overall": "5.0", "Content": "I had this TV for awhile and nothing is wrong with it.  It serves everything I would expect from a TV.  It has a variety of number of input and output connections. I hook everything up to it. Cable TV, game systems, computer, DVD, Blue-Ray, etc.  Picture is clear as a 720P from a HD source can give.  I don't know why people complain about the sound.  Unless I have super hearing or everyone else is deaf, I hardly ever need to turn the volume up more than 1/4 of the way and it sounds good.  Plus there is always the option to hook it up to an audio system if you want.  Oh, okay, it does not have headphone jacks.  Come to think of it.  I have not even seen a TV around these days with headphone jacks so that is the last thing I look for in a TV.  Anyways, that problem is simply solved with a RCA adapter for your headphones that you can plug into the RCA input.", "Date": "December 6, 2011"}, {"Title": "Great little tv for college!!", "Author": "Amazon User", "ReviewID": "R38UGDTUOMEFLD", "Overall": "5.0", "Content": "I love this tv!! I bought something for my apartment in my bedroom- I knew it couldn't be too big. This was also right in my price range. Easy to hook up and easy to use. Simple, functional, and exactly what I needed.", "Date": "July 20, 2012"}, {"Title": "Toshiba 19\" LED HDTV", "Author": "Robert F. Balthrop \"RetiredDude\"", "ReviewID": "R3DYDZAHY5JXDD", "Overall": "4.0", "Content": "This is a very good product.  The only complaint I have is that the speakers are of low quality and produce a tinny sound.  Otherwise, it is fine -- once I got through the interface between Toshiba Customer Support and Comcast Customer Support, both of whom spent way too much time pointing fingers at the other one.I would definitely buy this product again.  In fact, as my old-time cathode ray tube TVs give out, I will likely order an on-line replacement, if the price performance is as good as this one.", "Date": "May 31, 2012"}, {"Title": "excellent choice", "Author": "pookie, nc", "ReviewID": "R3I78VSVVREJFY", "Overall": "5.0", "Content": "this Toshiba replaced our kitchen area tvsize, features, picture and sound are excellentthank you Amazon for your accurate reviews and excellent service", "Date": "April 19, 2012"}, {"Title": "Great little tv", "Author": "Briggs", "ReviewID": "RWIRNI9MC84JG", "Overall": "4.0", "Content": "Great tv for a great price. Put it in the bedroom and despite what others say, the volume is rather loud even at one. Sound quality is what it should be for a tv this size and picture is great.", "Date": "April 5, 2012"}, {"Title": "Just what we needed", "Author": "Gary Shafer", "ReviewID": "R1LXLNUCHU4MSW", "Overall": "5.0", "Content": "We needed a small flat screen for our bedroom. We live in a 5th wheel trailer and space is limited. After looking at different places and prices versus product I chose this one. I read the previous reviews. The sound quality is pretty good. It does not sound \"tinny\" or cheap. I also have it mounted so the sound is free to emanate rather than being enclosed. This may help. It does not have a clock but no big deal. All the functions work good and for a 720p tv it has a good picture. We have a 1080p Viera in our living room and HD running to it. So I would not try to compare them equally. Great price and great tv for us.", "Date": "March 29, 2012"}, {"Title": "good tv", "Author": "Larry", "ReviewID": "RAI02YT5KW4S6", "Overall": "3.0", "Content": "The TV is pretty good.  The sound could be better, but it's not bad.  They did stick the energy sticker to the actual TV though so it took a while to get the residue off...", "Date": "September 18, 2011"}, {"Title": "breddy gud", "Author": "Sharon Milfing", "ReviewID": "RV8SA8BSEODUB", "Overall": "4.0", "Content": "I have no idea what these other people are talking about, the sound is fine for me.The refurbished stand they gave me was presumably for the wrong model tv and didn't fit as it was. I broke off some plastic pieces and it fit fine, but it was an inconvenience. Quality's good, sound is good, no other problems with shipping.Great tv for the price.", "Date": "August 10, 2013"}, {"Title": "This Seller is a Scam artist", "Author": "Jills", "ReviewID": "R1CXWOPEX49EJL", "Overall": "1.0", "Content": "DON'T TRUST THIS SELLER, I did not receive this Toshiba  from the seller, he sent me a Samsung instead, and the seller originally was going to charge me the same price, the Toshiba was $299.00 and the Samsung should have been $169.00 which I did not know or I would not have agreed to let him send me the Samsung instead, I thought he was sending me a T.V. of the same Value as what I originally purchased, after bringing the price difference to the Sellers attention the seller agreed to give me a refund of $50.00, after I questioned him, so I still paid more for the T.V. he sent than I should have, I wanted a better quality T.V. than I got, it was impossible for me to send it back and I am very disappointed in what I received, he told me that the T.V. sent was a better T.V. but it isn't, DON'T TRUST THIS SELLER!!!!", "Date": "July 8, 2013"}, {"Title": "Ehhh", "Author": "Emorie", "ReviewID": "RBZHJMWQ98ILQ", "Overall": "4.0", "Content": "The picture is decent, the only bad thing is that the sound comes out bad.  I have to use separate speakers in order to get a clear sound", "Date": "June 13, 2013"}, {"Title": "Overpriced", "Author": "AustNalio", "ReviewID": "R36KSGX5S4TS31", "Overall": "3.0", "Content": "It's a TV!!!It is over priced and under performing. The color is off a bit and the specs are really low for the price. You can find an better TV for this price.", "Date": "November 27, 2012"}, {"Title": "Faulty", "Author": "aace", "ReviewID": "R3GCVCJBZK878T", "Overall": "1.0", "Content": "After only 3 months a vertical red line appeared in the middle of the screen. I called Toshiba for warranty repair and it would cost me at least half what I paid for the TV in time and shipping. No more Toshibas for me.", "Date": "May 8, 2012"}, {"Title": "Good little TV", "Author": "Westwood", "ReviewID": "R3TNEC21VIH7H5", "Overall": "4.0", "Content": "This is a good little TV for the money. Great for the basement or kitchen. Picture quality and sound are good.", "Date": "April 18, 2012"}, {"Title": "Love It!  Love It!  Love It!", "Author": "Greg Stotts", "ReviewID": "R2V6I95P6MWPQ0", "Overall": "5.0", "Content": "Great image quality, low power usage, great price!  What else do you need.  Just buy it.  You won't be sorry.", "Date": "April 17, 2012"}, {"Title": "A solid television", "Author": "C. Tate", "ReviewID": "R30ESSUHALTLNQ", "Overall": "4.0", "Content": "We use this as a display monitor in a fairly bright hallway. As such, it is a little underpowered--  seems not quite bright enough.  In dimmer light or at night, it seems fine, however.  It does come with a lot of different mounting hardware options, which I thought was helpful.  Overall, seems totally solid.  Since it's on virtually all the time, I'll look forward to seeing how it holds up in durability.", "Date": "April 11, 2012"}, {"Title": "Great little TV", "Author": "Millennium Management Robert Foster", "ReviewID": "R1B0TXT4G7OM5M", "Overall": "4.0", "Content": "This is good value for money. The sound is a bit tinny but given that it is a flat panel and 19\" that is expected. After all you would not want to watch movies on this little screen so the sound is adequate for news, game shows, and regular TV programs.", "Date": "January 6, 2012"}, {"Title": "19 IN TV TOSHIBA", "Author": "Alana Hamilton", "ReviewID": "R3E5Z1PCP8G9T8", "Overall": "3.0", "Content": "The tv plays ok, nothing special, one reason for low rating is I couldn't get one screw to go in straight into the mounting bracket for the stand, (not 1 out of 8 went in straight), and I know my way around a screwdriver! On top of that I've heard better speakers in pocket transister radios in the 1960s. I connected an old set of computer speakers which gave much improvment! I was hunting something cheap, and guess what, I found it!!", "Date": "August 27, 2011"}, {"Title": "Dimensions are incorrect", "Author": "Patrick", "ReviewID": "R1QBUGH5V5BJOP", "Overall": "3.0", "Content": "The TV is good, but the dimensions listed are incorrect. It is closer to 2.25 x 18.2 x 11.2 inches...", "Date": "February 5, 2012"}, {"Title": "Does its purpose", "Author": "A. Le", "ReviewID": "R23S4YARBKG48M", "Overall": "5.0", "Content": "I use this for viewing a surveillance camera. For that purpose it is very good. It is small so it doesn't take up much room and has good video quality. I have NOT use this as a TV or viewing other video/TV content so I cannot comment on the overall quality of picture and sound. So if you need something small for surveillance viewing then this will do the job.", "Date": "March 3, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Technical Information--Screen Size--19\"::Technical Information--Backlight Technology--Direct LED::Technical Information--Aspect Ratio--16:9::Technical Information--Features--Sleep Timer, Favorite Channel Selection, Channel Labeling::Technical Information-\n-Media Player--Yes::Video--Digital Tuner--ATSC::Video--Analog Tuner--NTSC::Video--Video Signal Standard--HDTV::Video--Standard Refresh Rate--60 Hz::Video--Maximum Resolution--1366 x 768::Video--Scan Format--720p::Audio--Speakers--Yes::Audio--RMS Output Pow\ner--6 W::Interfaces/Ports--Number of HDMI Ports--2::Interfaces/Ports--Composite Video--Yes::Interfaces/Ports--Component Video--Yes::Interfaces/Ports--Digital Audio Output--Yes::Interfaces/Ports--HDMI--Yes::Interfaces/Ports--USB--Yes::Interfaces/Ports--VGA-", "Name": "Toshiba 19SL410U 19-Inch 720p 60 Hz LED-LCD HDTV, Black (2011 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/31M5pZRhiUL._SY300_.jpg", "ProductID": "B004MF9HGC"}}