{"Reviews": [{"Title": "A very decent upgrade for HD fans on a budget", "Author": "J. Howell", "ReviewID": "RXWHXTPNXFCTB", "Overall": "4.0", "Content": "A few months ago, I decided to upgrade from my current 32 inch Toshiba Regza to a slightly bigger TV. After aiming for a 40+ inch, I discovered this TV on Amazon for $600 and decided that this would be a great upgrade. A couple days later, and I received the TV and I have had a chance to test it out. Does it hold up?PROS:-The image quality is excellent and quite beautiful for 46 inches. Just make sure you are the proper distance away (About 8 feet).-Sound is excellent. It is clear and the TV can be quite loud if you want it to be.-HDMI cables are easier to plug in then my previous Regza. In the past, I had to plug them under the device at a downward angle, which was awkward and frustrating. This set allows you to plug it straight in.-120 Hz mode is great for animated videos and if you like your shows or movies to run at a faster frame rate. It isn't so hot for games, but there is a game mode option that turns off 120 Hz mode and lowers it to 60 Hz if needed.-The TV itself feels well built and has a nice black gloss look to it, while the back has a nice metal finish with quality looking ports.-There is a USB slot on the side for viewing saved videos and pictures on the TV. Great for home movies or if you have some videos from the net that you want to watch.-Somewhat of a small update, but I bought a Blu-Ray player and several Blu-Ray movies and tested them out via HDMI. It ran beautifully and had no major problems, so if you are in the market for HD movies and want to mainly use a Blu-Ray player to watch things, then this is a very decent TV.CONS:-You cannot sit too close to the TV without getting eye strain. It is generally recommended that you are at least 8 feet away from the TV to get the best viewing experience. I had to move my furniture around in my room. I tried it from 5 feet away, and games look pixilated from that close to the TV. This isn't too much of a problem if you put it in a living room or larger room, but it might be too big for a small bedroom or apartment.-There are very few options with adjusting the TV. You can turn off the 120 Hz mode if needed, but the menus are a little confusing (They are set up like my old Regza) which is kind of disappointing.-Not wi-fi capable, meaning no Netflix out of the box. You will need to get a blu-ray player, Roku, or video game console capable of using it.-I am not a big fan of the stand that comes with it. It has a similar glossy finish to the rest and is in a football shape, but attracts dust like crazy. It also isn't the easiest thing to install and even with the screws it still jiggles around a bit too much.-Even though there are 3 HDMI ports, one of them is on the side and does not look all that great if you have more then 3 devices. I really wish it came with 3 back ports and 1 side port and not the 2 back ports it comes with.-I am not sure if I am just doing this wrong, but the game mode setting \"resets\" to off every time I turn it to another input. This might be able to be turned off, but is kind of important if you do not want 120 Hz mode for games.OTHER:-I tested my PS3, 360, HD Netflix, and several upscaled DVD on the TV. Like I stated above: my PS3 and 360 were great as long as you were roughly 8 feet away. HD Netflix worked just fine, but it depends on the show and when it was made. Animated shows tend to look better, while older shows might look a bit \"meh\", especially if they were filmed back before 2000. DVD, sadly, do not hold up nearly as well as they used to on my 32 inch. They are still quite watchable from 8 feet away, but you can defiantly tell the graininess now. To be fair, it depends on what movie and when it was made: more recent DVDs tend to look and play much better while older ones tend to look fairly grainy.-This obviously does not have 3D capabilities, but at the moment it is not too much of a con to really count it as one.-The TV is pretty big and heavy. It weighs about 50 pounds and is quite wide, so you might need some help if you cannot lift easily or have a smaller frame.-If you want to turn off 120Hz mode, go to Menu > Picture Settings >Advanced Picture Settings > ClearFrame and turn it Off.What is boils down to is this is just as it advertises: A 46 Inch HDTV. It is not a super TV that has internet and various other bells in whistles, but a TV for people who want a decent quality TV for a excellent price. This is a steal for the $600 I paid for it and I have no regrets whatsoever.", "Date": "July 1, 2011"}, {"Title": "Great for the Price", "Author": "P. Corbin", "ReviewID": "RNZRVNGL3BD62", "Overall": "4.0", "Content": "Slim tv with a great picture.  I have dish network with an HD DVR box connected through the HDMI cable.  I have also tried my new Blu-Ray player with HDMI cable.  The tv has a great picture.  I am very picky on picture quality and I would recommend this tv to anyone.The tv screen also does not have a bad glare with room light or sun coming in from the windows.  We have alot of sunlight that comes into our great room and the screen performs well.  You can see the picture clearly day or night.The only reason I did not give the tv a 5 star rating is for the lack of HDMI inputs on the back.  There are only 2 on the back and a 3rd input on the side but you can see the cord when it is plugged in.  If you have only 2 devices with HDMI cables then you will be fine.Buy and you will enjoy!!!", "Date": "July 9, 2011"}, {"Title": "Great TV for the price", "Author": "Robert Harris", "ReviewID": "R2OLWHJM2SMMT2", "Overall": "4.0", "Content": "The TV was to replace a 46\" Toshiba DLP television.I recently purchased the G310U and actually really enjoy it. So far, I think it's a great tv and has a good bit of potential. At the $599 price point, I think it's almost impossible to pass over when looking at other televisions.Things I've noticed:The stand is a little on the cheap side. It has two tabs that sit in the base of the tv and is secured with 4 screws. Even with the screws, it still feels slightly unstable. I do feel that it is secure, but I would feel better if it were a little tighter fit.The tv will automatically adjust the picture size based on the incoming signal (native, stretched, 4:3, etc.) which is a very nice feature.This tv is currently connected to a TERK HD antenna with a signal booster and out of the box, scanned and found 16 channels. I know that the channels depend on the closeness to the stations, weather, etc, but the time this took to scan, label, and setup was rather impressive.The initial setup itself was rather simple, straightfoward, and easy to go with.The inputs on the back are definitely further to the edge of the tv than they could be. Running the wires and attempting to hide them behind the small neck support was tough. With a simple 3' HDMI cable, one of mine felt a bit stretched and needed to be switched around. I can still see it from the front of the tv, but it's a minor inconvenience. I do think the inputs could be closer to the middle of the tv.Being able to switch and dial back between 120Hz and 60Hz is a very helpful feature. It appears that the tv tries too hard at times to adjust the refresh rate, but having the feature is nice.Overall, a good tv.", "Date": "July 25, 2011"}, {"Title": "Love the T.V.", "Author": "Mada \"Dolarhyde\"", "ReviewID": "R3ML4UV6KBKFUI", "Overall": "5.0", "Content": "Update: TV died after 2 years, it had a great picture, mediocre sound, but just died. Had extended planned but even they would not repair said it was too costly, they gave me Original cash back minus service call cost. Lost about $250 in the deal. Basically I saw it a s a rental T.V. I guess I got money worth, but still feel like I was ripped off. Last Toshiba lasted 15 yrs without a blip. This TV seems to have power supply and main board issue, No way of knowing this till it went out. Did my homework before, and use to love Toshiba's, but never again, It only takes once to get burned and never again. To Toshiba you lost a loyal fan of over 15 yrs, but never again.Just purchased today(April 2011) and have watched for several hours and all I can say is that the HD is phenomenal. Clear, sharp, vivid colors. Details are just so sharp and clear. SD quality is lacking.I had a Toshiba LED 42\" and that didn't even come close to this model clarity. The colors on the LED were weak and milky looking, clarity was way off and could see a fuzziness all over the picture almost like an artifact or a fine ghosting effect. Oh I did forget to mention it was a Toshiba too 42\" 1080p LED with 120 mhz.The sound on this TV is decent, the LED had a tinny sound and could not be heard very well even at 100% this is a little more robust, but still lacking but way better than the previous model. My Laptop PC has better sound than both of the TV's so I would expect Toshiba to get on the ball and fix the sound issues that I have heard about on so many flat screen TV's. Industry issue I think, consumers need to complain and be heard so the companies will change.I wish this model had a RCA style audio out, I haven't upgraded to a digital stereo system, actually I have but didn't want to hook up a 1000 watt stereo. I may reconsider at another time; its just that the room is not that large and it really would be overkill. I wanted to hook-up a 50 watt system but it only accepts RCA type connectors. So, somewhat disappointed that this is lacking the Audio out ports. I don't really want to get a bluray to see HD, I get HD content off the net and have gone digital with all my media so don't really feel a need to buy a Bluray player just to see content. Sounds like a big waste to purchase a disc put in some machine when all I have to do is stream the info over the network. I do wish this had a cat5 or cat6 connection, may have to go out and get a apple TV to stream my content wireless. Have not hooked-up a P.C. and really excited about the quality, computer doesn't have HDMI output so may not get the quality I am expecting.Back to the TV, features are decent and still playing with the set-up, a good antennae is a must have, currently getting about 14 HD over the air channels and the clarity as mention is just great. I have a standard dish set-up non-HD and the difference is extremely noticeable. May have to upgrade just tired of the companies sucking every last dollar out of me. HD should be part of the standard package and not an upgrade option. I digress though.Overall, a Great T.V. the size is great and fits the room nicely without being overpowering, the back light is very bright and may need to adjust. but still nice overall. I would recommend this TV. The price point was great for the size and features. Others I have researched with similar specs were in the $8oo to $900 and up range. The blacks are great on this T.V.I do wish the bevel around the screen was smaller, it can be distracting but usually don't notice. I have seen other TV's with smaller frames around screen, Toshiba needs to work on that.The base is plastic so it does feel a little flimsy, wish it had some weight to it. Thickness of screen on tv is Ok  not a monster like the old tube type that it replaced. It does feel like it would be easy to tip over, make sure to screw in the back and use a wire as recommended just in case or use a wall mount, I find that wall mounts and the back of the TV's give a little and always fearful that the back of the TV will come off I have set-up three wall mount TVs and they all give a little and feel like they are not up to the task of holding the TV up but they all seem to be doing OK. I have my TV on a wheeled base so easy to move around, but the tipping is a concern. The TV weight is decent over all, set this up by myself with no issues or assistance box was a little big for the TV, so getting in the house was a little harder then the set-up. but i did OK by myself.One thing that I wish they did have in the box was a full size manual. They give this set-up sheet where the type is so tiny you need a magnifier to read the info. Glad there was a full and detailed online Manual. I guess Toshiba is trying to go green or they are getting cheap. I say for the money spent, a full size manual should be included. Not everyone has internet, as crazy as that may sound.(sarcasm) If I was older and had no internet connection I would definitely be upset about this.Over all rating, I would say an 8 out 10, just for the negatives that I mentioned. Very happy with purchase though and would recommend. I have 32 inch that I am happy with as well, along the same model line. Have been a Toshiba fan for many years now and give the over all quality of the TV 7 out of 10. I wish it were less plastic and a little more substantial feel to it like the LED had. Since it wont be moved very often I guess its OK.Remote is basic and placement of buttons are decent. Not a universal remote but not a big hangup. The buttons are large and easy to locate and many quick set-ups are right on remote. Input, pic size adjustment, pic mode, and sleep buttons are great and handy to have but the mute and channel return buttons are awkwardly placed. as well as the set-up button. Remote is a nice size, there is some lag when changing channels or adjusting volume but not really a concern. The mute button does have a half mute and a full mute cycle which is a nice little feature to have.", "Date": "July 26, 2011"}, {"Title": "Great Picture, So-So Sound", "Author": "W. Maloney", "ReviewID": "RO0DMUUIJYBX5", "Overall": "4.0", "Content": "The unit shipped fairly quickly from Amazon and arrived intact. Setup was easy and the menus were fairly straightforward to navigate through.  The picture is great, but as other reviewers have mentioned you need to be more than 8 feet from the screen or you begin to see the pixelations (most broadcast programs I've watched so far were at 720p. A sporting event at 1080p was very crisp).  The sound is a let down.  Originally I had a 32\" Toshiba in the same location - a corner of the room - which had forward facing speakers and the sound was excellent and one reason I chose to go with another Toshiba product.  This 46\" Toshiba doesn't have the same stereo separation or bass. The set is a few inches from the wall which may be a factor.  The speaker grills face down and to the rear and when you stick your head behind the screen it does sound pretty good.  With the bass turned up it still feels like there is no bass. It may be better flush against a wall. I'd recommend a separate audio system with this TV if good sound is important to you.", "Date": "August 14, 2011"}, {"Title": "Amazing HDTV for the price!", "Author": "Carny1122", "ReviewID": "R2LEPNRPLW22ZJ", "Overall": "5.0", "Content": "I got this TV over the summer and decided to put it through the rungs for a few months before writing a review. Overall, I'm very, very pleased with the TV.Firstly, I do not believe that there is a better HDTV for the price - Vizio's look like garbage, and all of the comparably-priced ones are off-brand TV's that I would never dream of buying. The ins/outs on this are very flexible (though I wish it had RCA outs for the sound; I had to buy an optical --> RCA converter for about $25 to use with my old analog stereo). The picture isn't bad out of the box, but with some tweaking of the settings to the room that it's in it looks much better. The speakers are reasonably loud as well, though I often just use my stereo. Note that the Optical out is BEFORE the mute function; if you mute the TV, but have audio routed out of the optical output, you will still get sound at the destination (so if your TV is muted, but plugged into your stereo/surround system via optical, you'll still hear the TV's sound).I have my digital cable box, Wii, Blu-Ray, and spare HDMI cable for my laptop all plugged into the TV. Again, enough connections for me, and easily routable. You can re-label the inputs, i.e. HDMI 1 --> Cable, et cetera. Others have complained that the stand feels \"flimsy,\" or small, but I think it's ok. I have my TV stand tilted back about 3 degrees as to prevent it from falling forward in the instance that I get too rowdy while playing Wii (come on, it happens). It does have an anchor point on it and the directions show you how to attach it.The box that it came in was packed to the max with styrofoam, and I intended on keeping it in case I ever need to transport the TV, but the box was ruined in a basement flood. So much for that. Sturdy packing, though.The remote that comes with it is very straightforward, too, though I don't use it a whole lot (digital cable remote is my primary one).When you set it up, tweak the picture, tweak the sound a bit, and you're good to go. Straightforward to setup, looks great, and serves its purpose. That's all I need to make me happy! Great investment.", "Date": "November 1, 2011"}, {"Title": "Loving Toshiba 46G310U 46-Inch 1080p 120 Hz LCD HDTV, Black", "Author": "Manoj Maurya \"Cool Gazzy\"", "ReviewID": "R1XOERARXJTTHH", "Overall": "5.0", "Content": "I have had this for 4 days and am loving it. My first LCD TV which I have been planning for years. In less than 600$, this is awesome. Screen is bigger than I imagined and I get theatre experience. I am yet to play with HDMI and I am playing with my PC only and still, picture is sharp and beautiful.Pros:Big screenBeautiful and quality displayGood soundEnough inputs for audio videoSimple to useCons:No 3.5\" audio ouput, there is some digital coaxial audio output which I can not connect directly to my simple 5.1 speaker systemUSB input doesn't recognise or play videos, it's only for pics and music.No wifi or internet TV but not a cons for this price range. I can always use my PC.All in all a very good buy, would update my review if I find something new.", "Date": "August 3, 2011"}, {"Title": "Luv it!!!", "Author": "nastassja", "ReviewID": "RZUTOEE9K955E", "Overall": "4.0", "Content": "Had a bad experience purchasing a 46\" RCA so decided to spend alil more on this one. Absolutely love it. Shipped quick was up and running on the wall in minutes. Only drawback is takes a few seconds to turn on,not a biggy. I have a 60\" lcd also but the sharpness on this one is way better, and the sound is great for the room I have it in (15x15) halfway volume is more than I expected. Blu ray looks awesome plus the surround sound hooked up. Hope the tv lives up to the review down the line. Overall happy I made the switch", "Date": "July 30, 2011"}, {"Title": "Very pleased", "Author": "A Teacher", "ReviewID": "R19DNXFGM80EM9", "Overall": "5.0", "Content": "We have been very happy with our new Toshiba 46\" LCD.  Upgraded from an old 32\" Toshiba CRT.  I have been researching and looking at TVs for about 6 months.  I knew I wanted a 42-46\" w/1080p and 120hz and a good contrast ratio (hard to find on the internet, but is 50,000:1 dynamic).  I don't mind plasmas but the ones in my price range were only 720p and they look too pixelated for me.  So, when Amazon had this for $580 (and no tax) with no interest financing for 2 years, it was too good a deal for me to pass up.  I had looked at a bunch of Vizios at Walmart and thought I'd settle for a 42\", but this is a great TV.  The picture quality is wonderful.  Colors look great, contrast and brightness are awesome, and it looks as sharp as any other LCD or LED I've seen.  Would a high-end Samsung or Sony be a little bit better? Sure, but this compares well with my friend's near $1000 LG 47\" LED.  Is his better?  Probably.  Do I notice a difference, even after looking at tons of TVs and comparing specs?  No, I can't tell a difference.  I'm guessing the guy who gave the picture a poor review didn't have an HDMI cable (or even know what HDMI is). My Xbox 360 looked good with just the normal A/V cables for a little while.  I paid only 3.99 total shipping for this to get here overnight from Indiana to California.  Awesome.  Anyway, my Cheetah wall mount w/included HDMI cable got here about an hour after the TV did, and when I hooked up the HDMI cable you can really see the difference.  DVDs look great, Netflix looks great (through Xbox), and COD Black Ops/Halo look amazing.  Don't have BluRay yet, but I'm sure that would be great as well.  Do make sure to turn the game mode on otherwise there is some lag.  For us, sound is fine.  We have a smaller apartment, but it is plenty loud without sounding tinny or anything.  The speakers are at least as good as they were on the old CRT.  I may upgrade to a soundbar or something later, but for now it's fine.  I also bought a cheap RCA antenna ($6 at best buy, $8 something here on Amazon) and it picks up a few local HD channels that look amazing.  No way am I paying for cable.  I haven't yet hooked up my laptop, but I ordered a cheap VGA cable and a 3.5 mm headphone jack to RCA to do that with (my laptop doesn't have an hdmi port) and I'm sure it will look great.  Only has a digital audio out, but that is pretty standard now.  Has a USB port that works for photos/music, not sure about videos as I haven't tried it out yet.  Remote is just fine.  Manual isn't really included, just the easy set up guide, but honestly, you don't need it, and if you do, here's a link to it: [...] .Who buys a TV on the basis of the quality of the remote and the manual anyway?  If I looked for the owner's manual of any of my other electronics, I'm pretty sure I wouldn't be able to find them.  So having it online works, but I'm not sure that you'll need it.  I messed with all the settings, but found the default ones to be great.  I am completely happy with the purchase.  We put the stand on for an hour or two to make sure the TV worked, and it seemed sturdy and was really easy to assemble.  Afterwards, we mounted it on the wall and it was pretty easy.  Now it looks great hanging up there and we have a lot more space in our living room.  You won't be disappointed with this TV if you know what to hook up to it.  :)  Thanks Amazon!*** UPDATE:  It's been nearly a year, and the TV looks as good as ever.  No complaints whatsoever!", "Date": "August 2, 2011"}, {"Title": "Great picture, so-so sound", "Author": "Sven Golly", "ReviewID": "R1TFVW5GLJOH3Y", "Overall": "4.0", "Content": "We actually bought two of these when they were under $600. As others have pointed out, the sound is kind of blah but the picture is great. Sharp, good contrast, low pixelation on upscaling, fast response while watching action (120hz helps) and very natural colors. The only drawback is that off-angle brightness drops fairly fast. But I think that's inherent to lower-end LCD's so no worries. Watching TV in a bright, back-lit room is orders of magnitude better than our old Vizio plasma.The sound however is a bit tinny. Not as good as the Vizio. However, it makes a big difference in where the units are located. On an open stand, the sound is good. In a closed media cabinet, not so hot. Since the unit in the closed cabinet is part of our home theater, the TV sound isn't critical. It may have more to do with where the speakers are located in the TV itself than anything. Regardless, there are no fancy options for the sound like expanded stereo etc. You get volume, bass, treble and that's it.All-in-all, we're pleased with our Toshibas.", "Date": "August 25, 2011"}, {"Title": "Great TV for the price", "Author": "mgaeth", "ReviewID": "R1LAR8JEMAUUKY", "Overall": "4.0", "Content": "I did not buy this TV through Amazon, but only because hhgregg had just opened in my area and had this on sale for $580 with no shipping cost when buying it POS.I honestly was not going to buy a TV this past Saturday when I went to check out the new store (although I had shopped hhgregg plenty when living in Ohio) and saw this TV on sale as an in store only price of $579.99.  I had purchased the Toshiba 37\" in the same product line last year about this time, and have been very happy with it.  After comparing many other TVs' features with this one while in the store, I decided to just go ahead and make the purchase (glad I did as it was the last one they had in stock).This is a very good TV picture wise, but the speakers are just so-so just as it was in the 37\" i bought.  Since I have a surround sound system with HDMI pass-throughs, I really have no need for the speakers anyway.Overall, if you are looking for a decent non-3D 1080p TV at a reasonable price, this product is the way to go.", "Date": "August 22, 2011"}, {"Title": "Great bang for your buck!", "Author": "Kakashi", "ReviewID": "RCM3M0N60JEAF", "Overall": "4.0", "Content": "I purchased this TV for my mom who mainly just watches over the air programs. I just received it today and so far it's been terrific. The stand was easy to set up, just screwed in four screws and you're good to go. Quick and painless setup for over the air programs. It's a lot thinner and lighter than I thought it would be, at least compared to my 3 year old 52\" Sony Bravia.For the price I paid $550 with free shipping on Amazon, I'd have to say that this TV performs beyond my expectations.The picture quality is superb, much better than my Sony, although to be fair my Sony is 3 years old.The 120 hz makes everything very soap opera-ish as other reviewers have stated and may take some time to get used to. I don't mind it though, especially for animated movies.The menus are a bit weird, but not nearly as bad as some reviewers stated. It takes a little time to navigate through it, but once you get the hang of it, it's simple enough.The sound is not the best, but it's also not horrendous. I believe the main problem with the sound is the placement of the speakers as they are on the back of the television facing away from the screen. If you place the TV too close to the wall, it may pose a problem. But again for the price this is only a minor problem. An easy fix is to just hook up a sound system to it as most people do anyway. My Sony Bravia's speakers definately beat the speakers on this TV set.The inputs are a bit lacking on this TV. There are 3 hdmis, 1 Digital audio out, 1 USB, 1 PC input, but only 1 component and RCA input. There are no analog audio outs so if your sound system is on the older side, you will need to get an adapter. I was aware of the lack of inputs on this TV prior to purchasing it. Since my mom mainly uses the TV for over the air programing and the occasional DVD, this wasn't a problem.The stand is a bit wobbley, but it's fine if you leave it alone.In conclusion, if you are looking for a cheap TV that delivers terrific picture without all the extras (i.e. WIFI) and plan on hooking up speakers to it then this is a great TV. Perfect for a midsized living room. For what I paid, I am satisifed.", "Date": "August 20, 2011"}, {"Title": "Pretty decent display for an HTPC", "Author": "Andrey", "ReviewID": "R14YTSQ8YTA8Y6", "Overall": "4.0", "Content": "I bought this cheaply to be used primarily as a display for my HTPC. First, no 1080P over a VGA cable, only 720P - this TV just doesn't support it. Not a huge problem, since VGA is not the best link and many of the TVs features are disabled for the VGA input. No internet apps, but I don't need them.Bought a cheap HDMI cable and spent some time battling my videocard to turn off overscan/scaling. If your PC picture has a black border on the edges, doesn't fill the full screen, and the text doesn't look right, your video card is overscanning and you need to turn it off in the control panel (ATI/nVidia).The colors looked very good, but the text didn't. This was a tricky one - according to [...] my sharpness was turned up too high (10), 5 was a better setting for me, text looked much better. I had to turn ClearFrame off right away since I hate the soap opera effect for real (not animated) movies. Color is really good, I watched some Matrix and the beginning of Saving Private Ryan, and with the latter I felt like I was looking through a window it seemed that realCan't try the sound yet, my HDMI out needs a separate driver. USB input is kind of pointless - I tried some pictures and they looked terrible - the TV was scaling them down from 3648x2736 to 1920x1080 and not very well. For listening to MP3s, I guess if you have the TV hooked up to a receiver with a good sound system... but then your receiver might have USB in. Using the TV speakers may not yield the best sound.Number of inputs is decent - 2 HDMI in the back, one on the side, pretty easy to get the cables in. The menu is not too difficult to use, but can be annoying at times. There's a sturdy-looking VESA mounting pattern in the back. The screen is not too shiny, neither is the bezel. There's a somewhat tacky-looking blue line running under the Toshiba logo, but you stop noticing it after a bit.Overall, I'm very happy with the quality of the picture and the quality of the build.I'll update the review the more I use this TV.Edit 1 - input lag. It seems like there's a >100ms input lag on this TV with the default settings. I tried turning Gaming Mode on and using a cloned monitor test at 1280x1024; the monitor is 100-130 ms faster with Gaming Mode off; 30-50ms faster with Gaming Mode on. I will need to get a bigger monitor to run a real test at 1080p. Not really happy with 50ms delay, but I'm not sure other TVs can be faster, and I can always delay the audio track in VLC, but it's kind of a hack and wouldn't work for Netflix.", "Date": "August 16, 2011"}, {"Title": "Great for the money", "Author": "FatherOf2", "ReviewID": "R12VU4P95BB4J5", "Overall": "4.0", "Content": "I've had the TV a couple weeks now.  It's my first LCD, it's now in the room where I had a plasma.  I will say that LCD is much better in bright environments than plasma, the picture doesn't wash out as much.  The picture on this TV is amazing.  In fact it's so good that it creates almost a 3-D effect.  For me, it's kind of distracting but my wife and kids love it.  I'm still playing with the contrast etc. to see if I can get the picture more to my liking but HD channels and DVDs are just incredible.  I will say that picture quality on non-HD channels seems less than ideal though part of me wonders if that's the cable provider (I happened to switch providers just 2 days before getting this TV).  Sports (in HD) and other fast moving images are excellent, better than my plasma.  The one thing I really don't like is the high gloss edges and stand.  In a bright room, you get a lot of glare and reflection off the stand and the frame around the outside of the screen, I don't understand why they wouldn't use a matte finish.  Also be advised that if you get this TV or any other with the Amazon \"white glove delivery\" you're not getting what you think you're getting.  They contract with a delivery company who brings it to your house, takes it out of the box, plugs it in and makes sure it turns on and doesn't have any obvious picture problems, then takes the box.  They do NOT connect to the cable, they don't even attache the stand; you have to do that yourself.  It's not hard to attach the stand, connect the cables or put it on the TV console, just be aware you do that yourself.", "Date": "January 4, 2012"}, {"Title": "After reading reviews here I was a bit hesitant", "Author": "Cc", "ReviewID": "R25ZYIB6EU21NU", "Overall": "5.0", "Content": "After reading the reviews I was a bit hesitant to pull the trigger, but then I read the reviews on many many other tv's and they seemed as bad or worse.. Then I realized people are just .. people. SO I bought it to find out for myself.Picture: Surprised everyone that's seen it. If you could take this tvs picture into photoshop and look at the histogram it would be perfect.. and if not the settings let you adjust it to the proper settings easily. No blown out whites, no lost detail to too darks, etc.Audio: I purchased this with the mindset of buying a sound bar too, but ended up not needing it. Unless you live near a train track or an airport then there should be no problem. It's not tinny at all. It has really good sound for a flat screen.Ease of use and features: 5 stars. I work as a multimedia designer and this let me get the blacks, whites, and colors to where they need to be with no problem. It's very simple to adjust picture size to fit what you're watching as well.The only thing that I thought wasn't good with this was the stand, but I was mounting it to a tilt / swivel tv stand anyway so keep that in mind.You will be very happy with this purchase.", "Date": "December 13, 2011"}, {"Title": "Great HDTV", "Author": "James O", "ReviewID": "R2U5I2IIP2A1EE", "Overall": "5.0", "Content": "I am a prosumer and fairly regularly install professional quality HDTV's in a business type setting.I Purchased 2 of these TV's hoping for a clear, bright, even picture and adequate audio and I am very pleased in spite of the user reviews.I hung both TVs on the wall using a horizontal tilt bracket.  The rooms are approx. 12' X 40' tiled, and at 50% volume it is plenty loud, however it is only 3 inches away from the wall allowing the rear facing speaker design to do what it was designed to do.  Comparing the TV's audio to a surround sound system would be like comparing apples to oranges.  The rear projecting speakers are designed to use the hollow wall as a sound board and essentially creating an amplified bass.  However I still needed to increase the bass to reach a more comfortable listening tone, but as far as small television speakers go, they don't lack in volume.  The users that are complaining about not enough audio are most likely using articulating arm mounts that keep the TV too far from the wall and or have them tucked tightly into an entertainment center essentially killing the audio.I was a little concerned with the flimsiness of the back panel where the VESA mounting holes are set.  The mounting holes themselves were set in the TV very tightly, however the back panel of the TV is not really tightly secured to the frame.  Despite the rear panel's apparent \"cheapness\" the TV really isn't heavy so it doesn't seem to affect the hang.For the money, options, and picture quality, you can't get a better deal.", "Date": "November 30, 2011"}, {"Title": "Great Deal", "Author": "R. Guhl", "ReviewID": "R3W4WQUOOYVZMT", "Overall": "4.0", "Content": "Good quality flat screen at a great price.  Very straight forward TV with all the features necessary to watch cable TV and DVD.  The order was processed and shipped with minimal fuss.  The picture quality is very good with reasonable sound quality.  We are very pleased with our 46\" Toshiba.", "Date": "October 24, 2011"}, {"Title": "Toshiba 46G310U  46 inch TV", "Author": "Suzanne Marconet", "ReviewID": "R1T9BW2BT6P7E7", "Overall": "5.0", "Content": "My TV is wonderful. The picture is great and large enough that i can see it.Toshiba 46G310U 46-Inch 1080p 120 Hz LCD HDTV, Black", "Date": "September 15, 2011"}, {"Title": "Great Picture,Sound,Value", "Author": "gordon ramsey", "ReviewID": "R18C3QEZIG9C08", "Overall": "5.0", "Content": "Picture and sound quality are excellent. Far exceeds my 54 inch 120 Hz Sony at one-third the price.Very easy to install and set up. Attractive physical design/appearance.A real winner!!", "Date": "December 11, 2011"}, {"Title": "Great Price - OK TV", "Author": "MRG", "ReviewID": "R2HO581NKUR6KK", "Overall": "4.0", "Content": "This TV came on-time and was in great condition (always a concern when ordering big electronics online)This TV replaced a 4+ year old Samsung 46\" DLP whose image processor was going bad.  I have been overall pleased with the Toshiba except for a few complaints1. Audio Sync - The audio seems to precede the image on the screen.  Our set up is Cable TV into a TiVo Premier DVR.  The picture is sent through HDMI to the TV, while the audio is sent through Toslink Optical to a sound system.  I would point my finger at the TiVo or sound system, except that we never had this problem with the Samsung, and we still see the picture delay when watching videos through the home theater (sound system).  When watching DVDs, the home theater out puts the sound and sends the video to the TV.  In fact, if the TV speakers are on, you hear two sound tracks about 250 mseconds apart.Overall, this issue isn't horrible, just annoying.  As we have a separate home theater set up in the basement with a bigger TV and better speakers, we can live with this issue on this TV.2. Pixelated Images on some shows - During motion on some shows, specifically reality shows on Bravo and HGTV, you get a lot of pixelation during camera panning.  I have played around with the refresh rate, and the image quality on the TiVo.  Can't quite figure out if this is an issue, or just an effect of the 1080p LCD picture.  (our last TV was only 720p).Luckily we don't see this on movies, sitcoms, or sports.I would highly recommend this TV for anyone looking to get a lot for a relatively small price.", "Date": "September 3, 2011"}, {"Title": "Amazing bargain TV", "Author": "REDDIEorNOT", "ReviewID": "R3TF9YQ1QVG4M5", "Overall": "5.0", "Content": "Let me just say that this is my second flatscreen tv in my short 19 year life. I upgraded from a 32 inch 720P Lg Tv and I just need to say, what an upgrade!!!!Picture-Amazing. I plugged in my ps3 and put in my Avatar blu-ray and was astounded. Sharp, cool colors made me feel like I was there. I immediately turned Clearframe off because I absolutely hate that soap-opera Vizio looking pic.Sound-Good enough. Seriously for me the sound is great in a large dorm room. But yes I said dorm so it's smaller than any living room would be.Price-$600?! I can promise you won't find a tv better than this one for that price.My review is short and sweet buy this TV if you're on a budget and really even if you're not because no matter who you are, this is a GREAT deal.P.S. Amazon was freakin great as always and I got my order delivered straight to my dorm room. Good job guys!!", "Date": "August 25, 2011"}, {"Title": "NO More Parts...", "Author": "Desiree", "ReviewID": "R3GFARUWIW8WDB", "Overall": "1.0", "Content": "After having paid over $800 for this television set, the main board has gone out, 2 years later... I have taken the TV in for repair and found that the part that needs to be replaced has been discontinued.  Called Toshiba for the last 3 days and get sent in circles.  Bottom line is, the main board is no good and not replaceable. Planned obsolescence at it's best.", "Date": "September 11, 2013"}, {"Title": "Piece of Junk!", "Author": "ANTHONY DILIBERTO", "ReviewID": "R3C8N76SOI60U0", "Overall": "1.0", "Content": "I purchased this TV about 2 yrs ago and now im losing video and audio. Contacted Amazon who told me to contact Toshiba who told me to contact Amazon. Never again am I buying a Toshiba,this was a waist of 600 dollars.Always thought Amazon stood behind what they sold but not in this case, very disappointed and I could have gotten the same customer svc from a chain store so back to best buy I go.", "Date": "August 19, 2013"}, {"Title": "From Bad to worse", "Author": "Texas City Engineer", "ReviewID": "R5VINPACYXASI", "Overall": "2.0", "Content": "Bought this TV two years ago, and Boy am I sure glad I bought the extended warranty.  about three months ago, my TV just shut off. no power no response from remote or anything.  Then magically it comes back on by itself.  I thought I was crazy.  so it happened again. ok so I thought maybe it was because we turn the AC off, and like the outside air.  It can get 80+ sometimes in the house, so I thought well, maybe the heat.  I finally called it in to Best Buy.  They sent a company out and they brought two new boards with them.  (Guess they knew what to expect.)  The guy changed them and the TV wouldn't even show any video.  so, they order the parts again.  This time when he changed out the parts, the tv showed a reverse image on the screen. (He said he's never seen that before)  so then they took it into the shop.  they never could get it to work even after replacing ALL the boards..  What a piece of junk.  If they can't keep replacement parts working, how are we supposed to keep buying their (Toshiba) products?  AND  it had a Samsung Screen in it.", "Date": "August 16, 2013"}, {"Title": "Worked great until it didn't", "Author": "Sebastian Becerra", "ReviewID": "R3BCRZDZSG1NN3", "Overall": "2.0", "Content": "Bought this TV just over 2 years ago. It worked fine, until one day it just stopped working. No lights turn on when I press the power button. I think it's probably a power board issue; the part number to replace the power board is PK101V2520I. I'll probably try that. I do not plan to buy another Toshiba.", "Date": "July 25, 2013"}, {"Title": "DO NOT BUY! Please read", "Author": "Chris A. Williams", "ReviewID": "R2MBKB5S52ZSC9", "Overall": "1.0", "Content": "I bought this TV new from Sears on Oct 2 2011. It is less than 2 years old, 11 months out of warranty. It goes off by itself every 10-20 minutes then comes back on a minute later. Researching the web I found this is a major problem with this unit and Toshiba will do nothing about it. Bottom line: I spent over $600 on a TV for 21 months of use. Toshiba...never again. If you would replace it, yes.....but your lack of empathy for your customers disgusts me. Would give it zero stars but it made me pick one.", "Date": "July 16, 2013"}, {"Title": "Basic HDTV for steal of a price!", "Author": "T. Ha", "ReviewID": "RBYDRQDXH2RI", "Overall": "4.0", "Content": "I've used this for over a year now and the TV is holding out great.  There are no dead pixels and the image quality is still superb compared to when I first got it.  My only minor complaint is that there is inconsistency with the backlight.  The lower corners seem brighter than the rest of the screen, this is only noticeable when the room is dark and there is a blank image on screen.  I am not complaining because of the price, but if you want perfection, this may not be for you.", "Date": "March 5, 2013"}, {"Title": "Big-screen", "Author": "James C. Weiss", "ReviewID": "R15BKB54G4CYKS", "Overall": "5.0", "Content": "Awesome! I was really unsure about making this type of purchase online. Delivery was on target. I did my own install. Worked perfectly. Really enjoy, quality is fantastic.", "Date": "January 19, 2013"}, {"Title": "Review of TOSHIBA 46G310U 46\" LCD HDTV", "Author": "Julio", "ReviewID": "R1X64DFTYKWYNL", "Overall": "4.0", "Content": "So far, after all these months of using, I am still 90% satisfied.  Happy that I chose this TOSHIBA 46G310U 1080p 120 Hz 46\" LCD HDTV over other brands.", "Date": "October 11, 2012"}, {"Title": "Great TV, if you're planning on mounting it!", "Author": "Liam", "ReviewID": "R36ETPFT080YFD", "Overall": "5.0", "Content": "Very nice TV, I have not had any problems with it.  I bought this brand new on Sale through Wal Mart's \"Site to Store\" last year for $600.  TV is not too heavy for its size, probably around 40 lbs, so it was not too difficult for the contractor to install this.  Very clear picture for playing ps3.  I don't really need to adjust the picture, since the lights and darks already look great on this TV.  You may want to higher the brightness for certain videogames, because the ones that are darker tend to look even more dark and harder to see on the screen, but again, not a very big deal, and is easily fixable.  I have Directv HD cable, and I have no complaints about the resolution, etc.  Not sure why people are complaining about the sound, it's plenty loud enough for me.  My couch sits very far back from the TV, and I don't really need it on that high to hear it clearly.  There are 3 HDMI inputs, which are enough for most people. I like the one on the side, it's easy to access if you're plugging in and out videogame consoles.  If you buy this TV, plan on either getting it mounted on the wall, or buying a separate TV stand, since the football-shaped stand that is included with it is very flimsy and unstable.  The short amount of time I had the TV on it's original stand really felt like the TV was about to tip over.", "Date": "September 19, 2012"}, {"Title": "Awesome TV!", "Author": "Utah Customer", "ReviewID": "R1EF8JVPWBY1LW", "Overall": "5.0", "Content": "This tv is wonderful! It meets all my expectations! We haven't had any issues with it and it has great sound and picture and is easy to use.", "Date": "July 8, 2012"}, {"Title": "Toshiba - 46G310U - LCD TV - 1080p - Day TWO review", "Author": "Adam", "ReviewID": "R35W1YTBYU0URR", "Overall": "5.0", "Content": "Toshiba - 46G310U - LCD TV - 1080p, 120 mhz.Anyone that calls this image blurry falls under one of two camps: They have it hooked up to cable not hdmi. They sit 9 inches from the tv.Hook it up to hdmi and sit on your couch. It is by far the sharpest, most vivid picture that I've seen on ANY tv...period. It looks better thanthe picture on my computer screen. (imac intel duo core 1920x1080) The picture is so vivid it REALLY feels like you are there in the scene watching it being filmed live.The cost has to make it the single best value in led tvs today. WITH tax I paid $636 total.This Toshiba is replacing my old tv which was a 720p Samsung 42\" dlp. 1080p DOES make a difference. A huuuuuuge difference.I've watched NBA playoffs on it, played a bit of NBA 2k12 on the ps3 and watched a blu ray movie. All were fantastic looking.Some people have complained about the sound...but idk...tweak the eq and set the volume for your preference. I don't hear a tinny sound or anything. The soundgoes from 1 - 100. I have it at 30 as my \"normal\" volume level for a mid-sized living room. I have turned it up to 100...and will admit that it's not booming loud.If you want VERY LOUD...you will need a sound system period.Well that's my two cents...I'd highly recommend the set.", "Date": "May 3, 2012"}, {"Title": "GREAT BUY!!!!!", "Author": "Draws", "ReviewID": "R3ACD1041BL2JW", "Overall": "5.0", "Content": "This TV was worth the money. I'm not a \"techy\" kinda guy and this was just what I wanted. Cool options, but not to complicated!!!! Surround sound isn't necessary, but the TV cost is reasonable enough that the extra cash is \"easy to find\".", "Date": "January 21, 2012"}, {"Title": "Great TV for the Price", "Author": "Peeler3", "ReviewID": "R1BZ9GX4YOMCR6", "Overall": "4.0", "Content": "I purchased the TV to use in my living room.  The price was very attractive to comparable TVs with similar features.  I do not use it as a gaming machine, just for watching.  After a month of watching, I have no complaints.  The picture quality is excellent.  I do agree that it is a bit heavier than other brands for the same size and required two people to install.  For an individual looking for a good quality TV for watching at a low price, I would recommend.", "Date": "January 8, 2012"}, {"Title": "Terrific Experience", "Author": "TF", "ReviewID": "R352AKGOE0ZWPB", "Overall": "5.0", "Content": "From ordering to delivery to setup and usage, our experience with the 46 inch Toshiba 46G310U has been terrific. Picture quality is stunning, sound quality slightly less so. Overall very satisfied!", "Date": "December 13, 2011"}, {"Title": "Could hardly be better for the price!", "Author": "J. DALE \"J. DALE\"", "ReviewID": "R1FMMODPJPZOVO", "Overall": "5.0", "Content": "I just received this TV today, but I think after about 5 hours, I can post a fair opinion about it.SetupThe stand, as mentioned in other reviews, does feel a bit cheep (especially compared to other flat panel stands I've used).  However, I think I know why others have complained that the stand in loose or wobbly.  The included screw had a threadlocker compound on them, which made them somewhat difficult to tighten.  I imagine that those with this problem didn't get it tightened up all of the way.  Mine is tight, and there is no wobble to be found for me.The first thing I noticed after I set the TV on it's stand was that there are no analog audio outputs (contrary to the item's description on this site).  This means I'll have to buy a DAC and an optical cable, which takes away from the great value of this TV for me.The inputs are well placed for the most part.  Being on the side, they're much easier to get to when reaching behind the TV. The side input will almost certainly leave cables visible from the front.  It doesn't matter to me because I only have 2 HDMI cables that need to be connected.First impressionThe picture on this is absolutely gorgeous.  I want to rewatch every movie I own!  It looks miles better than the other 2 TVs in the house (42\" Phillips 1080p 60 Hz, and a 32\" Sony Bravia 720p 60 Hz).There are many options in the menu, just about anything you want or need.  One thing I'll miss is the feature on my Sony that shuts the TV off if no buttons are pressed for a predetermined amount of time.The remote feels light and cheap compared to most others.  Works great though.For some reason, my Windows 7 HTPC doesn't like this TV.  Everytime I restart my PC, it resets my screen resolution to 1024 x 800.  I have to go into settings and change it back to 1090p (1920 x 1200) everytime the computer starts back up. Big pain for the moment, though I'm sure I'll find a solution.  This only happens on the Toshiba, not either of the other TV.  All of them were connected the same way.Overall, I love this, and I'm glad I bought this instead of the other TV I was considering.  Buyer beware, shipping was a nightmore, although Amazon did all they could to help.  Beware of the shipper, Home Direct USA).UPDATE:Still loving the TV, but I wanted to update to say that my HTPC's screen resolution problem was completely unrelated to this TV.  It was resetting it's resolution because of a service started by Windows Live Mesh.", "Date": "December 8, 2011"}, {"Title": "Out with the old and in with the new", "Author": "Skiman", "ReviewID": "R1QX1SRM4EUW2L", "Overall": "5.0", "Content": "Excellent product. Perfect picture, great value, 120 MHz with HD keeps the screen fresh vibrant and clear during all of the major sporting events.  Free delivery and I found the best deal.", "Date": "November 8, 2011"}, {"Title": "Excellent television", "Author": "nanasande", "ReviewID": "R2XE3W7X2UES05", "Overall": "5.0", "Content": "We purchased this television locally this summmer, and our grown children thought it the best quality they'd see, so we have purchased 1 from Amazon for their family Christmas gifts.  Without exception, the pictures are clear and beautiful.  Our kids were really impressed with the delivery, also.  Delivery personnel did an excellent job of coordinating time of arrival with the home owners.  They were meticulous about placing the tv in the room for use, unwrapping carefully, and inspecting for damage.  Thanks for a great product and an excellent delivery.", "Date": "November 4, 2011"}, {"Title": "Pretty reasonable for the price", "Author": "c2y", "ReviewID": "R3IUQV0J0FA9XL", "Overall": "4.0", "Content": "The picture quality is fine. It's easy to be too critical if you think you have a lot of viewing experience, but if you don't have a side-by-side comparison, it's a lot harder. I see good sharpness, color and contrast, and not a lot of image blur in fast moving pictures. It's not an LED backlit set but it still claims to have a dynamic backlight intensity adjustment. Viewing angle is ok, no 75 degrees off axis please.As for the much maligned sound quality, yes the sound is not great. But if you're looking for a home theater, you better have a home theater sound setup to go with any set. The sound is ok, the speaker appears to be facing backwards so that may have an effect on quality. There is no depth in the sound so it can be a little tinny sounding to some.This leads to the input/outputs on the set. There aren't many analog ones. No analog audio out requires you to get a d/a converter if you want to hook it up to an older stereo. Only two analog inputs(component and composite) so if you have older equipment this may be a limitation. (If you're considering this set, you may be on a budget, which means using older stuff with it.) I wouldn't worry about fancy apps and wireless connectivity. You can get it later through a Blu-Ray player.As for reliability, only time will tell. Readers of Consumer Reports magazine give the brand a reasonable record.", "Date": "October 29, 2011"}, {"Title": "Great Value", "Author": "jay", "ReviewID": "R1HBZRRQ5HHPMW", "Overall": "4.0", "Content": "The T.V. is everything I hoped for and then some.  Excellent picture, and above average sound for what the speakers are.  No issues during set up, it was painless.  The only reason I did not rate it 5 stars was the delivery.  I tracked the shipping and the unit sat on the local delivery dock from friday till del on wednesday, 8 miles from my home.  I could not understand this, but all's well in whosville.  Would recommend the T.V....geeat value.", "Date": "October 21, 2011"}, {"Title": "Great for the price.", "Author": "jake", "ReviewID": "RSXVUGW4Z8JL3", "Overall": "4.0", "Content": "Perfect, only negative is lack of inputs for devices in the back.  Great buy and am enjoying this perfect picture!", "Date": "October 20, 2011"}, {"Title": "Very pleased", "Author": "M. Freeman \"Hi\"", "ReviewID": "R1TA82154NS1CJ", "Overall": "5.0", "Content": "This is a great TV for the price.  So far I can't think of any negatives. Picture quality is outstanding and sound quality is more than adequate. I'm very pleased with this purchase.", "Date": "September 12, 2011"}, {"Title": "awesome buy", "Author": "Sterno", "ReviewID": "R1JY6OZ1QPZW4V", "Overall": "5.0", "Content": "I am now a Toshiba convert from Sony.  Such an awesome buy I bought another one.  State of the art at a bargain price.", "Date": "September 6, 2011"}, {"Title": "Good enough for family use.", "Author": "Oliver Luo", "ReviewID": "R30WVSXH793X1K", "Overall": "5.0", "Content": "Like the size and price of this TV. For about $520, you get what you want for most family entertainment. Good deal!", "Date": "September 6, 2011"}, {"Title": "Toshiba HD tv.", "Author": "dalrj", "ReviewID": "R3SVWC8GQ6LW6K", "Overall": "5.0", "Content": "Excellent product for the price. Picture quality is clear and vibrant.  Good sound. Very, very satisfied. Setup and operation very easy.", "Date": "September 3, 2011"}, {"Title": "A Great Value", "Author": "DTroy", "ReviewID": "R1U0CLB4O6KHEV", "Overall": "4.0", "Content": "For $600, this TV is an excellent value.  Despite an earlier post, my family is very impressed with the \"crisp\" display.  Like most HD TVs, standard definition programs do appear fuzzy.  If the primary broadcast source is not in HD, HDMI will not help.  I have a cable box connected to the TV by HDMI (Mediabridge) and the box is connected to the cable outlet by high quality coaxial cable which may or may not help.  The SD picture is reasonable (and very good for Wii) provided you are not sitting on top of the screen.  I sit 8 -10 feet away which works very well for a TV of this size in HD or SD.  The colors are saturated out of the box and I am still trying to get the color reproduction just right.  It's taking a little more trial and error as the picture pre-sets are limited vs. other TVs meaning you must rely on mannual adjustments.  Once made, the TV will save them under \"preference\" unless you loose power and then you have to start over (save your settings on paper). The only picture issues I have seen are with some shady scenes in movies and some broadcasts.  The differences in darkness levels next to each other show a pixilated picture that looks sort of like heavy dust on the screen (I cleaned it to be sure).  I believe there may be a setting to get around it, but I haven't figured it out yet.  However, this has happened only a handful of times and only for a few seconds at a time.  The picture conditions this happens to are rare.  The darks are pretty good for a TV at this price level and I actually found it better than some LED models.  You can see the light bleed-through from some edge-lit LED models when next to this TV which pushed me to a standard LCD model rather than LED.  Whatever you do, turn off \"Clearframe\" for nearly every type of broadcast except sports.  This will keep the refresh rate to 60 mHz rather than 120 mHz preventing the dreaded \"soap opera\" effect.Yes, the sound reproduction is rather poor.  It has only 7 watt speakers vs. 10 on most other TVs.  You have to max out the bass setting to even get the sound close to being full and it still falls short.  Volume has never been an issue with any broadcast or movie - I have never had to turn it up above 40 which is quite loud.  I will be investing in a good sound bar in the near future to improve upon sound quality which I would recommend to anyone.In short, this TV is an excellent value.  That would not be the case at $900+ where the competition gets pretty stiff.  However, at $600-700 you can't do any better and it will be adequate for a majority of people.  To some it up, the leading consumer magazine said that this TV has a better picture that one TV costing twice as much.  I was sold!", "Date": "January 5, 2012"}, {"Title": "Great TV for the bucks", "Author": "VeezKnight", "ReviewID": "R4ALFKN68F5N0", "Overall": "5.0", "Content": "My wife found this television on a two-day sale at a local electronics store for $577. But before we actually purchased it, I checked here to see the reviews. Based on the good reviews here, and of course the sale price, we got the second to last set in stock, and I'm glad we did. We were able to get this 46\" set for nearly $100 less than a Sony 42\" set we were considering.At first I wasn't too thrilled with the picture. I hooked it up to our Fios cable box using the coax cable that had been connected to our old rear projection Sony. The picture on the Toshiba was good, but not great. I had read where it's best to use HDMI cables with 1080 HD, and noticed in this TV's instruction sheet where HDMI are shown as being necessary to product a true HD picture. A relative of mine has a Sharp Aquos 42\" HD set that is connected to Fios using coax, and it provides a brilliant razor sharp picture even without an HDMI cable. So I wondered.I nearly bought two 6-foot HDMI cables at Kmart (because we were there and it was convenient) for $19.99 each, but remembered having read about HDMI cables available through Amazon that are much cheaper. I ended up buying them here for a mere $7.50 or so each. When they arrived a few days later and I plugged one of them in from our Fios box to the Toshiba TV, I thought my wife was going to jump off the couch. The picture was so much clearer it was amazing. Wow, what's not to love about high definition!!It could be that this set, when compared to others such as the Sharp, is more dependent on HDMI cables. Nonetheless, I highly recommend this TV. For the money, I really don't see how you can beat it. And if you do buy one, be sure get yourself an HDMI cable to connect it to your signal source.", "Date": "October 4, 2011"}, {"Title": "Great TV - remote kind of sucks", "Author": "AustinDINKs", "ReviewID": "R3A464FWOB612L", "Overall": "4.0", "Content": "I bought this to put in my bedroom - my fiancee tends to fall asleep while watching TV and it's sometimes a pain getting her to get up and move to the bed - and I HATED watching TV/playing games on the old tube TV we had in there.The picture is good - been watching a lot of DVD's and playing my XBOX360. Not as awesome as my Sony, but as a secondary TV, the price I paid for this 1080p, 46\" LCD TV was very low relative to my other options. I could have spent the same amount for a much smaller TV, but honestly I don't think you can really tell the difference in picture quality for most things - I only got a pricey high-end Sony for my living room because I have my six-core gaming computer hooked up to it. The Xbox 360 only comes in at 720p.Sound is about the same as any other build-in speakers I've experienced, though the minimum volume level is still pretty loud, especially since there isn't all that much space between my bed and the TV.My only real complaint is that the remote-TV connection is horribly unresponsive. I'm not sure if this is an issue with the remote signal not being strong enough or the TV hardware/software taking too long to process and respond to the signal, but it always takes a few hard button pushes to switch inputs, channels, etc.", "Date": "September 30, 2011"}, {"Title": "Great value!", "Author": "Dave M. Sanda", "ReviewID": "RKRIPJHSH8QKC", "Overall": "4.0", "Content": "We bought this (our 1st TV off the internet) & it has been a great value. Picture is great, sound could be a little louder with volume controls (we're only in our 40's!) but all in all it was a great deal.", "Date": "September 7, 2011"}, {"Title": "An Excellent Value", "Author": "an anonymous source", "ReviewID": "RZZ6CQGYYTMBB", "Overall": "4.0", "Content": "The picture is good and the sound adequate.  I haven't noticed any motion blur.  It's a bit slow to turn on.  The remote is pretty intuitive, though I would have laid it out a bit differently.  I am tempted to give it an extra star because it was by far the best tv for the money, but I think four stars is quite fair.  Comparable televisions from other brands were all several hundred dollars more at the time.  Amazon was very quick to deliver, and delivery was free.  I have had it for several months now and am quite pleased.", "Date": "November 16, 2011"}, {"Title": "Good TV...not so good Sound", "Author": "Y. Dialani", "ReviewID": "R1EMLUH4U2DSHL", "Overall": "4.0", "Content": "I was happy with the amazon shipping. Nice TV , Nice colors. Sound is Bad. But , I bought Vizio sound bar for 100 bucks and that seals the deal.", "Date": "September 11, 2011"}, {"Title": "Toshiba 46\" LCD TV-JUNK", "Author": "toshibaisjunk", "ReviewID": "R1DFD6HP2WG8Q1", "Overall": "1.0", "Content": "Toshiba does NOT stand behind their products!!  We have had our 46\" LCD Toshiba for not even one and a half years now and it did not get used for 3 months and also is in our 2nd living room where we use this tv to watch our movies so this tv is well under-used.  The main motherboard went out on this tv. The main motherboard meaning the brains of the tv is shot!  After only 1 1/4 years in our possession.  It is passed the 1 year warranty by 3 months  I'm here to tell you that Toshiba does NOT stand behind their products!!  Even with this tv well under-used and not used for 3 months, all Toshiba could say was 'sorry, it is passed the warranty' and basically agreeing with me that they, in fact, do not stand behind their products.  Don't make yourself a victim and be screwed out of a tv that you spent alot of money on and it not lasting but only about a year!!", "Date": "March 18, 2012"}, {"Title": "Broke after 20 days", "Author": "Alexis Meyer", "ReviewID": "R2P4WOM5T8DDE", "Overall": "1.0", "Content": "This TV was great - we'd been saving for it for over a year. When it worked, it was great! But after 20 days the power & sounds stopped working. The green indicator light would blink and it would shut itself off. We called Toshiba and they had to order the part, and then schedule another appointment that could take 3 weeks! When we finally got a repair man out, the part that was ordered wasn't the problem so we had to go through this all over again. We've now been paying our cable bill for over a month for a non-working TV. We're sending it back to Amazon (thank god they'll take it back!). Just be wary if you purchase this TV. Toshiba was ridiculous to deal with.", "Date": "February 16, 2012"}, {"Title": "Blurry, only good for cartoons", "Author": "charisse", "ReviewID": "R1Z2PN37BKCZ7J", "Overall": "2.0", "Content": "I bought this item going off by what others wrote in there reviews. I own a 42\" Vizio 120hz 1080p, which I like. This tv is suppose to have the same features at a good price ($600). The tv casing is nice, but when i turned it on, it was a big let down. It is blurry, I watched movies new and old, new ones looked blurry, older ones like a another review mentioned looked even worst. Sports like football, the ball looked blurry as it was passed. The only thing that looked crisp and beautiful were cartoons, so if you are only watching cartoons this is the tv for you, also video games looked nice. I did have this tv connected to a HD receiver with an HDMI cable also the PS3 connected with an HDMI cable. I gave this tv a week and then returned it free to Amazon with no problem. I bought from Amazon a LG 47LK520 47-Inch 1080p 120 Hz LCD HDTV 47\" LG 120hz 1080p. for $735 free shipping. Spend an extra $135 but it was so worth it, crisp, clear picture in every way. I do recommended the LG and stay away from this 46\" Toshiba not worth the money even at $600.", "Date": "January 4, 2012"}, {"Title": "Christmas with Toshiba", "Author": "Danny W. Hull", "ReviewID": "RIYRRW2XA97OL", "Overall": "4.0", "Content": "Great tv at a great price. Picture is great the only thing wrong with this tv is the speakers, not too good but that is a problem with all Toshiba's tv's.", "Date": "December 27, 2011"}, {"Title": "Good value item", "Author": "Zak", "ReviewID": "R19CWIBXRWL4VF", "Overall": "4.0", "Content": "Very good bargin for a large screen television.  Excellent picture.  Sound could be improved but overall satisfactory.  Too early to  comment on long term quality.  Have had good success on purchases through Amazon.", "Date": "October 24, 2011"}, {"Title": "Toshiba 46-Inch Surprise!", "Author": "DesignerMan", "ReviewID": "R39ZXY1MCBB30B", "Overall": "5.0", "Content": "Adorama Camera and UPS are just a great combo with Amazon.com - Order and delivery were perfect - This 46\" 120 Hz LCD is the best for HD Full Screen.Toshiba 46G310U 46-Inch 1080p 120 Hz LCD HDTV, Black", "Date": "August 20, 2011"}, {"Title": "Picture great/sound not so great", "Author": "irishxtine", "ReviewID": "RIALHYYANIWDB", "Overall": "3.0", "Content": "We love the tv and the picture quality, the fact that you can change it from video games to sports and movies, however the sound is awful.  We have it up  to 100 all the time and it's still not nearly as loud as our other tvs...even at 25.  We have 2 other Toshiba that are fine.", "Date": "October 14, 2011"}, {"Title": "Better than nothing.", "Author": "Jim", "ReviewID": "R1WMBJ9L33PDOW", "Overall": "2.0", "Content": "Like I said, this TV is better than not having a TV. It \"auto detects\" the device that you have plugged in to it and sets it's own resolution accordingly. This is annoying since I would like to be able to set it manually. With Dish Network it sets itself to 1080i and the picture is OK if you're across the room from it. When you get closer it starts to look like a \"paint by numbers\" picture. The only time that the picture looks crisp and clear (not great, just decent) is if we're watching a DVD. The older Vizio TV that we have in the family room absolutely blows this picture away when connected to the same Dish box. This Toshiba also \"auto switches\" to different input sources if it senses that you've turned some other device on (like your VCR), this is a highly annoying \"feature\" that will have you cussing at it. So far I haven't found a way to make it quit doing this. The longer that I have this TV, the more I regret buying it.ProsI can watch shows and movies on it.ConsThe picture is not very good.It decides what the resolution should be set to.It changes inputs if you turn any other equipment on and then you have to change it back to the input that you wanted.", "Date": "March 23, 2012"}, {"Title": "Toshiba 46Inch LCD HDTV", "Author": "EOMeara", "ReviewID": "R27O1XD1QUSQLN", "Overall": "2.0", "Content": "Would not recommend purchase.  We had the TV for only 3 months when it \"shut down\".  The first repair did not fix the problem.  The second repair did fix the problem after ordering more parts.  We were without the use of the TV for almost 2 weeks.  Buy local and get better service for electronics.  This was our first on-line purchase of an electronic -- we will not do that again!!", "Date": "March 12, 2012"}, {"Title": "Failed After One Month", "Author": "Jason L \"geek\"", "ReviewID": "R1EU6OWQ5Q6CXA", "Overall": "2.0", "Content": "The TV was decent enough when I first opened the box - internal speakers aren't too bad (not as great as a stereo system of course), TV resolution was sharp and I really didn't have any complaints...until I went to turn it on earlier today.Much to my surprise, nothing happened. After checking the Toshiba support website, I tried a \"power cycle\" (unplug for 30 seconds, plug back in and press power button on the unit itself) and still nothing. SO, I called Toshiba tech support. After 15 minutes, Toshiba arranged for a repair tech to come to my house (I'll update this review if necessary once the repair was completed).The funny thing is, when I called support, they didn't know I had registered the product online more than one month prior. My issue with this is, if they can't manage a simple product registration correctly, how can they build a TV correctly? Answer: they can't. At least not this time.Not impressed.", "Date": "November 6, 2011"}, {"Title": "Burnt out within 10 minutes", "Author": "JR \"JR\"", "ReviewID": "R15FGDQ7UB462L", "Overall": "1.0", "Content": "Just purchased this new \"June 2011\" brand.  Plugged it in, set it up.  All easy enough.  Picture looked great, sound was great, for the price. Within 10 minutes the picture bled and the screen went blank.  Quality control was simply terrible!  I would get a protection plan with this model; otherwise, sadly not worth the trouble.Also the stand is very unstable and cheap. The four screws are a must!", "Date": "August 25, 2011"}, {"Title": "Vertical lines are coming", "Author": "jtech50", "ReviewID": "R2VTWFPP86PG08", "Overall": "1.0", "Content": "Toshiba's are known for what's called vertical banding so you can expect to begin seeing them in 18-24 months. Good luck with Toshiba's support because it's non-existent!", "Date": "November 15, 2011"}, {"Title": "Toshiba needs to Send a printed Manual with product", "Author": "SouthFlorida_isgreat", "ReviewID": "R2H55P3CV11JZY", "Overall": "1.0", "Content": "I have purchased other Toshiba TVs before and they were excellent! well this one is going back. First thing NO manual, just an Easy Setup Guide with tiny print even with my glasses I could not read.  when I called the customer service I was told it's \"online\" that's ok if you have access to the internet in your home and can multi-task. I am disabled and have a vision impairment so telling me to let my adult child read the manual online for me is NOT good customer service. The picture quality is poor and the remote is cheaply made, Toshiba just lost a loyal customer.", "Date": "August 1, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "1080p Resolution: See colors and details like you never have before! Enjoy 1080p Full HD.\nClearFrame 120Hz: Using advanced computer processing, ClearFrame 120Hz improves picture clarity and reduces motion blur\nHi-Res PC Input: Enjoy high definition images when you connect your PC to your TV.\n3 HDMI-CEC: Easily connect to high-definition video, and amazingly immersive surround sound in one cable.\n1080p Resolution: See colors and details like you never have before! Enjoy the highest level of HD picture quality with 1080p Full HD.\nAction packed content has never looked better! Using advanced computer processing, ClearFrame 120Hz improves picture clarity and reduces motion blur\nClearFrame 120Hz. Vesa Mounting Pattern: 400mm x 400mm\nEquipped with invisible stereo speaker design, LCD HD TVs pipe out clear, natural sound that makes movies and gaming so much more.\nInvisible Speaker Design:", "Name": "Toshiba 46G310U 46-Inch 1080p 120 Hz LCD HDTV, Black", "ImgURL": "http://ecx.images-amazon.com/images/I/417APHv7mgL._SY300_.jpg", "ProductID": "B004MFDL14"}}