{"Reviews": [{"Title": "Unbelievable TV Experience", "Author": "CyberDude", "ReviewID": "RDSGDI7CK5MLM", "Overall": "5.0", "Content": "I thought I'd share my odyssey with this TV. It has been quite an experience.TV Purchase and Delivery========================After several months of hesitation, including several hours of agony on Black Friday constantly refreshing the Amazon website, I finally pulled the trigger and ordered this TV. Actually, I had ordered the WD-82738, but Paul's TV called the next day and informed me that that model was out of stock. Would I like to be upgraded to the WD-82740 for free? I said, heck yeah! So, I ended up buying this TV for $1,799. Incredible! But this was only the beginning.Paul's shipped out the TV and it arrived in 3 days. I was home that day as the delivery truck arrived. I watched from the window as a lone, older gentleman (he seemed like he was 70 years old) stepped out and proceeded to unload the TV by himself! I was mortified! One delivery guy, and an older guy to boot, trying to deliver a TV that seemed to me like it weighed more than a Mini Cooper. Anyway, I ended up going outside and lending him a hand. After all, it was my TV and I did not want any accidental drop. More on that later.When we brought this beast into the foyer, I knew immediately that the gigantic box was not going to make it down to the basement. So we proceeded to strip the TV bare and were able to carry it down. Boy, this TV is HUGE. I mean, humongous! And very, very heavy. You can't imagine how big 82 inches are until you stand before it. On our way down, my hand slipped once, and the side I was holding fell from one step down to the one below. A small drop, but one that left my heart beating feverishly, wondering if the TV had been totaled or the lamp broken. Well, after what seemed like an eternity, we were able to negotiate the steps down to the basement and set the TV on top of the Pinnacle stand I had bought and setup a couple days earlier. The old delivery guy stood back breathlessly but eagerly and watched as I plugged in the unit and turned it on. The fun was about to start.TV Viewing==========After I loaded the remote batteries, I stood back and - drum roll - hit the power button. The screen comes to life in 10 seconds flat. Then, the amazement begins. The picture is just glorious! Absolutely magnificent! So crystal clear, you feel like peeling the picture off the screen. This TV was built for HD viewing. Don't bother watching SD on it. In fact, due to the massive screen size, SD appears a bit pixelated and blurry most times. However, after you see HD on this monster, you will never want to set your eyes on SD again. The old delivery guy must have stayed for at least 20 minutes, not wanting to leave this glorious picture behind. He kept muttering \"wow\" under his breath. I was speechless. He eventually got me to sign the delivery papers and reluctantly left me alone in my cave.Watching my AT&T; U-verse on this TV is truly an immersive experience. Netflix movies stream in full HD and I just can't believe it. NFL playoffs? Wow, you don't want to know. You have to see that one for yourself because I truly cannot describe how it looks and feels. Each time I turn this TV on, it never ceases to amaze me. My man cave is now more or less a full blown movie theater. The 8 speakers that are mounted on the front of this set are so powerful and the surround sound so impressive that I decided not to bother hooking up my home theater speakers. Thankfully, my man cave is fully sound proof because I was concerned that the TV would disturb the neighborhood. I have never had to crank the sound above 30 on a scale of 100, and the TV speakers just boom like crazy. I find myself rushing home after work now. My wife is mad at me for not showing myself in other parts of the house these days. But she understands. Sometimes, she even visits me down in my man cave and stays for a few minutes, silently, taking in all the amazement. Life is good.3D==First off, I am not a fan of 3D. In fact, I actually think it's a bit lame and overhyped. However, since this model features a built in 3D emitter, I decided to try it out. Using the same pair of Mitsubishi 3D glasses available here on Amazon, I have viewed some 3D content. The picture is quite impressive and literally jumps out at you. But, since I am not a fan, I'll stick to my HD for now. Not much going on here.Network Connection==================Since the TV sits literally a few feet from my home office, I simply ran an Ethernet cable to it from my router, which allows the TV to update its firmware automatically and allows me to utilize its built in web apps. My only gripe here is that although they have loads of apps, they lack Netflix. Really? How could they have missed that? Oh well. I hope they add it in a future firmware update. For now, I have to go through my Blu-ray player to stream Netflix. A minor inconvenience, but I thought you should know.Wrap Up=======Buying this TV has been a wonderful experience for me. I hope it helps you make your own decision. If you are buying this TV, make sure it will fit wherever you intend to put it. The box barely fit through my front door, and this is NOT a small door. We had to push it through. Sideways, it took up the entire width of the front door with not a millimeter to spare. Yes, the box is that big. If you have a screen door, you are better off getting it into the house that way. Get out your tape measure and take measurements in advance of your purchase if necessary to avoid a rude shock when the TV gets to your house.I bought the 82\" Pinnacle stand from TigerDirect. Heavy, but easy to assemble. It took me a couple of hours to assemble, with bathroom and hydration breaks. It has the same width as the TV and looks great. You can buy the cheaper 72\" model, but the 82\" TV will hang out on the sides and might look a bit awkward. It's an aesthetic issue, but it may not be worth the extra $100 for some people. The 72\" stand can hold this TV's weight just fine. IMHO, if you are springing this much money to buy a TV, you might as well spend a little bit more to get the matching stand. The TV sitting on the stand looks quite symmetrical and beautiful and enhances the look of the man cave / home theater space.That's my 1-month report for now. I will provide any updates in the future if necessary. I am glad Mitsubishi is still making DLP TVs. For the price you pay for some lame 55\" LCD HDTVs, you could get yourself an immersive DLP experience with spare change to host a viewing party for your entire block. I highly recommend this TV. Good luck in your search!", "Date": "January 10, 2012"}, {"Title": "Immersive TV viewing", "Author": "ShoppingGeek", "ReviewID": "R3R9DO45N01JEM", "Overall": "5.0", "Content": "First: kudos to Amazon for using \"White Glove Delivery\". Two guys brought in the TV, unboxed it, set it up, made sure it worked, and took away the packing material.Since I was replacing a 65\" Mitsubishi DLP (started getting white/dead spots), all they had to do was plug in the power and the HDMI cable that runs to my receiver.The old TV took 20+ seconds to power up, which was very annoying. This one takes about 10 seconds. (Man yelling at his microwave oven: \"Hurry up! I don't have all minute!!\")The picture is huge compared to the 65\" set. It makes for an immersive experience whether watching tv shows/movies or playing video games.My TV table/stand is about 30\" high, which was fine for the old set but is too high for this one. I'll give myself a chance to get used to it, but may have to buy a shorter table. The 65\" TV was deeper (front to back) than a plasma or LCD, but it never seemed that bad. The 82\" TV is much deeper, maybe a couple of feet.I haven't hooked it up to the Internet yet because my Blu-Ray player already has Internet, but I'll probably hook it up because that's how you get firmware updates.I'm giving it 5 stars based on picture quality (and size), ease of set-up, Internet capability, and past experience with the Mitsubishi 65\" TV.UPDATE, DAY 4:Well, I may have spoken too soon. I received the TV on Monday and by Wednesday, it started acting flakey and on Thursday, I get nothing but a blank screen. I called Mitsubishi who contacted a service company in my area who says it will be a week before they can come out. Getting a bad TV doesn't bother me that much - these things happen. What matters is how such problems are handled, and a week delay in getting a tech out is unacceptable.UPDATE, DAY 12:If a week delay in getting a tech out seemed bad, I'm fairly seething at the fact that it will be TWO WEEKS before the tech comes out. I won't bore everyone with all the details, but both Mitsubishi and the local service rep have really dropped the ball on this. I still think the TV is worth 4 or 5 stars based on the 3 days it worked, but a TV is only as good as the people supporting it, and they have been terrible. Unfortunately, you can go to about any support forum on the Internet for any electronic device and find the same gripes about lousy support for anyone unlucky enough to get a faulty product right out of the box, so I guess that's just how things are these days.", "Date": "December 6, 2011"}, {"Title": "After Cali...LOOKS AMAZING", "Author": "JT", "ReviewID": "R1CJFSD2A095HR", "Overall": "5.0", "Content": "The TV is huge, but the colors are a bit off at first, when you turn it on, it takes about 2-3 mins to warm up. Most people will turn it on for the first time and set it to HOME use.... my friend is a tech guru so I got him to come over and do a calibration with his laptop and tools, as well as the advance settings, and ever since then, it's been nothing but flawless with color and picture... speakers are weak, but we have 7.1 surround set up so that wasn't important to us... excellent buy, but make sure if you don't know someone that you find someone to help you calibrate it, simply setting the advance settings is great, but a professional calibration for someone who isn't tech saavy is much better.", "Date": "December 28, 2011"}, {"Title": "I LOVE THIS TV!", "Author": "N. Maki", "ReviewID": "R2J0CACLIEM496", "Overall": "5.0", "Content": "I have been watching and researching these mega-size Mitsubishi DLP TVs for almost 2 years.  In that time I learned that they do not quite match the picture quality of some higher-end LCD or Plasma TVs, but it is a tried-and-true technology that provides a very good picture at an exceptional value.  I briefly considered the 80-inch Sharp Aquos, but I just cannot justify spending $4k on a TV, and I was thrilled to find this beast for sale for well under $2K around the Super Bowl.  Even though it's huge, it's actually fairly light considering its size and it was easy to move onto my stand with the help of the delivery guy (I was very happy with all aspects of my purchase and delivery from Paul's TV).  I found the picture quality to be fairly accurate right out of the box, but I decided to buy Disney WOW: World of Wonder [Blu-ray] in order to fine-tune the picture quality.  This calibration blu-ray helped me set the brightness, contrast, color and tint to fairly accurate levels.  While I believe that a professional calibration is valuable, I'm not willing to spend several hundred dollars for that service.  As such, the Disney calibration disc is easy to use and made a noticeable improvement to the picture (Note: I think the \"Natural\" setting provides the best color accuracy with some minor tweaking). I was a little worried that I might have buyer's remorse after purchasing this TV or maybe regret not stepping up to the 92\" model, but at almost half the price, I'm very happy with my decision.  Overall, I am absolutely 100% satisfied with this TV.  If you've been on the fence about buying this TV, quit stalling and pull the trigger; you won't regret making this purchase!", "Date": "March 15, 2012"}, {"Title": "Love this set!", "Author": "Alfred dela Cruz", "ReviewID": "R2FHLITN21BVHO", "Overall": "4.0", "Content": "I must say this set is glorious!  I've held buying the set until my Pioneer Elite 64\" analog 1080i HDTV went kaput.  The clarity and sheer size of the image is AMAZING!  I can't wait to watch Manny Pacquiao fight in two weeks with this set.  The HD image is simply beautiful.  I'm running an HTPC with Ceton InfinTV 4 tuner card with a quad core i7 through and Asus 6770 Radeon.  DO I game on this, yes!  I play Battlefield 3, Mdern Warfare, heck even Half Life 2.  I set up a folding table with wireless kb and mouse about 6-7 feet in front of the set and I must say, the experience is very immersive.  Combined with 5.1 surround through my M&K; S-150P/S-2510Ps and dual 15\" Velodyne HGS subs, it is very exciting and a lot of fun!  I am always amazed at how adept this tv is with any material I throw at it.  1080P, 720P, and 480P content all look very good and of course 1080P is simply glorious.  I can see individual white hairs on ESPN's SportCenter's Stan Verret's head.  Out of the box, the image is very good, however, I have not had it calibrated, which I have heard will improve the image significantly.  THat'll have to wait, as I am content for now.  I even surf the internet and while the letters are not as sharp as that on a dedicated monitor, it is very readable, just have to increase the font size quite a bit.  You TUbe content esp 1080p unsurprisingly looks great.  I watched the Avengers trailer back in 1080 and could not believe the stunning clarity I experienced even through YouTube's high compression streaming.  Pop in a BluRay or any high bitrate .mkv HD content and watch out - prepare to pick up your jaw off the ground.  For the price, this is a great set, you won't regret it people, unless you have a small family or living room and cannot accommodate it.  Currently, I sit about 12 feet away, which to me is too far.  I'm going to reconfigure the room so I sit about 9 feet away, which is ideal according to THX's recommendation.  As far as using a stand, you might need to make a custom one, as there are very few stands that can accommodate this set.  Currently I am using our old coffee table which is about 22 inches high, ideally, you'll want to set this at about 12\" and you'll be very close to watching at the set's centerpoint.  Another thing you can do if you use a higher stand is to tilt the set forward slightly, if you don't mind watching looking up somewhat.  Unless I'm lounging, I find that it's uncomfortable looking higher to watch and would rather bring the set down so I can watch with a more level line of sight.  Also, the brightness is more even all across the screen.  With regards to bulb replacement, I am aware of its need to be replaced about every 2 years, that's ok with me, as I am aware of rear projection DLP's limitation of using bulbs, but am not ready to plop down 5K for and LCD of similar width.  Fast moving scenes don't suffer from ghosting or slow pixel refresh inherent in LCD panels.  Blacks are very good though not like plasma's deep and almost-absolute blacks.  It's a compromise with regards to a balance of cost, features, and performance versus LCDs.  For now, I am more than content with this set, and look forward to its improved image after calibration down the road.  All I can say is that our family really really enjoy watching through this set.  Everyone who stops by to see it are simply wowed by its sheer size and glorious picture.  Enjoy this set, you'll love it!", "Date": "May 25, 2012"}, {"Title": "All Positive Feedback is Correct", "Author": "Kennard Nears", "ReviewID": "R1VG4XO999C1QC", "Overall": "5.0", "Content": "I love this TV, well I should not love an inanimate object, I really really like this TV. The picture is awesome and the 3D is something to see. My ex-wife saw the TV and want to get back together, we sit and watch it for hours. The 2D to 3D is great, have to play with settings. I really really like this TV so much I just bought another one for the bedroom, everybody tells me I'm crazy then I can't get them to leave. This is my MAN CAVE and I do as I please. Husbands buy the TV then before you tell your wives, send her two tickets for a trip or a cruise, she'll be OK, especially as she grows to really really like the TV too. We are MEN and we like it BIG. No real draw-backs, I understand it takes a little longer to come on and other issues with this type of TV, so I am very satisfied. Will update you later as I use the TV more often.", "Date": "February 27, 2012"}, {"Title": "Let's See....", "Author": "Ajelandro", "ReviewID": "R3BBC7AICVCER9", "Overall": "5.0", "Content": "Before delivery. Ok I finally purchased this TV after looking at the pros and cons of the DLP technology. After reading a lot of reviews over the web I came to the conclusion that there are 65 percent of possibilities of regretting of making the purchase. I will be posting my review in order to let other people know of my experience on buying this TV.Stay Tunned :)Ok.. today received the TV about 30 minutes late NOT A PROBLEM, I know this is not a pizza so I didn't get it for free hehe. well The TV came in Intact! I saw a CEVA truck approaching to the neighborhood so I went to open my garage door because I saw a lot of reviews saying that the box was huge and I was afraid that it wouldn't fit trough the main door, but everything went just as I expected. the TV fit well. and the door from the house to the garage is not really wide it measures about 50 inches and the tv measures about 32. although there was only one guy driving the CEVA truck he did all the work himself. I wen't to the truck to help the him out, but the guy almost did all the work unloading the TV and carried all the way to my living room himself with a 4wheel flat cart, unboxed the TV we put it in the TV stand. and turned the TV on connected to an Air Antenna and started the programming and calibration. I signed for all the paperwork and the carrier took the box. Then, I connected my Blue-ray player to check out the quality of the screen and I had problems with the Audio. I tried to figure out if there was a problem with the audio on the Settings. turned off and on the speakers and still no audio was coming out from the TV. I called Mitsubishi Customer service and they told me how to restore the TV to Factory settings and boom! no more hassle! the TV works great, the Image quality is way better than I ever expected the Sound is Awesome!! the Air Channels are all showing up! I can say that this is the best TV I ever had ever!! I haven't connected to the Internet because you can only connect it via LAN or you have to buy a USB wireless card to connect it via WI-FI. I ordered the cables trough the Internet because it's cheaper and we will see how that work to me. I hadn't had any time to make a review today because I was too busy watching movies and TV. but right now before going to sleep I decided to finish my review of the 1st day having this amazing TV.If you are thinking about buying this TV, be my guest! I recommend it 100%. Looks good it a lit room, but once you turn the lights off looks way better and you feel like you are at the Cinema.", "Date": "February 1, 2012"}, {"Title": "Super TV", "Author": "Dan", "ReviewID": "R3SQ7HW8Q8LA7S", "Overall": "5.0", "Content": "We have only had this TV for 10 days now and all I can say is WOW. The delivery crew carried it up a flight of stairs, unpacked it and had it running in 3 minutes. The picture is amazing, better then Samsung and Sharp 60\" LEDs we looked at. We watched a NFL game on Sunday and it felt like we were on the field. If you are thinking about buying this TV, go for it, you won't be disappointed you will be amazed.", "Date": "December 21, 2011"}, {"Title": "wowzers!", "Author": "Adam S. Hayes", "ReviewID": "R2E4DU7X8BT00W", "Overall": "5.0", "Content": "Ok, so it's really 4.5 stars, only because the box it came in was so huge and I fulfilled by Paul's TV didn't bring it inside just to the threshold. It took me about an hour with 2 friends to manuever the tv downstairs to my basement. But once that was all done, the TV works great, very impressive and so far no problems at all. I have a 3D Blu-Ray player hooked up to it and so far have only tried SBS (side by side) with the Xpand X103 glasses.. amazing!For $1650-1700 range with free shipping, this TV (if you have the space for it) is definitely the best buy.", "Date": "January 24, 2012"}, {"Title": "Can't explain how good this television is you have to see for yourself.", "Author": "cstout2667", "ReviewID": "R3P9JNR6T7Q1W1", "Overall": "5.0", "Content": "Was very upset when TV arrived was delivered on its back in an old rusted out pickup truck. When I got in house and hooked up all my fears went away. This is the most awesome TV I have ever seen.", "Date": "December 28, 2011"}, {"Title": "Can't beat it for the Money", "Author": "LiquidD", "ReviewID": "R16HY61YKG0XNN", "Overall": "5.0", "Content": "Short and Sweet and to the point... I own the Aquos 80\" LED television which is the most vibrant on the market, paid 5k for it. This DLP 82\" is not as bright, but it does have a comparable picture for a third of the price.  Bought this Mitsubisi off of Amazon, had it delivered in 5 days, under $1500.  Clean bright picture that doesn't blurr when you are up close.  Great for movie night. Could not possibly go wrong with this tv.", "Date": "November 2, 2012"}, {"Title": "One Happy Camper", "Author": "Tom D. Grudzinski", "ReviewID": "R1L69KUSD6AT09", "Overall": "5.0", "Content": "Believe the 5 star reviews.  This is a bad boy. Huge, but the picture is not compromised because of size. I got it for the New England Patriot New York Giant 2012 Super Bowl and it has not disappointed in any way. The quality of picture is better than expected for the size. My 3D player is a Sony PS3. I bought Mitsubishi compatible 3D glasses and a more powerful emitter.  The tv has a built in emitter but we sit back so far from it I wanted to make sure the emitter signal was strong enough so I bought a more powerful emitter, maybe not necessary, don't know.  But with Mitsubishi compatible 3D glasses you are set with this tv (the 82740). If you have a PS3 like me, set the tv 3D setting to checkboard. You'll know what I mean once you go into 'settings'. Did not need the 3DA-1 3D Adapter Pack, which I almost bought after researching, but it would have been for not. It is for older model Mitshubishi tvs, not newer ones like the 82740. Some 3D movies are definitely better 3D than others.  Try Journey to the Center of the Earth, or Rio, 3D version.  I can't throw down $30 or more to buy a 3D movie I may watch once, but you can rent 3D movies online too. Google 'who rents 3D movies'. Our house is gorgeous except we have an unfinished basement (unsheetrocked walls, bare studs with insulation) that has the only room big enough for this tv.  But we spend most of our free time sitting in our crappy basement because this tv is stunning. It is hooked into a home theater sound system too. A friend of mine called watching the Super Bowl at our house a 'media event'.  We will have to move this tv into storage when we finish the basement.  That will be a sad day because of the seperation anxiety I will have. Our basement may have to stay unfinished for a while longer...just so I can keep watching this tv.... LOL", "Date": "March 2, 2012"}, {"Title": "great TV", "Author": "Michael Stephens \"typical engineer\"", "ReviewID": "R284QNW50LWP5A", "Overall": "5.0", "Content": "I have had this for a couple of weeks.  It is amazing.  I upgraded from a 62 inch DLP.  As far as TVs go in my opinion the bigger the better.  I have a large living room so there is plenty of space.  For the same price, I would have gotten an LED or LCD 25-35 inches less.  Recently I tried the 3D.  It was very cool.  The only thing to look out for is that this TV is MASSIVE.  It isn't too heavy but it is so large that it is a little hard to handle.", "Date": "February 22, 2012"}, {"Title": "real big TV", "Author": "Jason", "ReviewID": "R1Z81GTQGFUW47", "Overall": "5.0", "Content": "This tv is way larger than it looks at best buy. The screen is bright and clear. Does take a min to warm up any have the picture brighten up.With my 5.1 powered sub it is a real home theater experience.  If it will fit in your home get it.", "Date": "December 14, 2011"}, {"Title": "pretty good TV, but beware: IT HAS ONLY ONE AV/COMPONENT PORT", "Author": "ABC", "ReviewID": "RO59MU3Z7P0ME", "Overall": "4.0", "Content": "First, I want to say, I bought the WD-82738, but this advice applies to basically all of these large mitsubishi DLP models, so I decided to re-post my WD-82738 review here.Before I write my review, PLEASE READ THIS:IF YOU WANT TO BUY THIS TV OR ANY 82\" TVs GO TO DECIDE.COM. Why? Because the price of these TVs are extremely volatile and you do not want to unnecessarily overpay. I've been following its trends closely and trust me, if the decide.com trend graph showed that the price at any point in the past was lower even if it was a long time ago and seemed to be anomaly, the price of the TV will return to that old lower price within a month or two. Just be patient and keep an eye out for the price fluctuations.If you don't know what decide.com is, just go to decide.com, and search \"82 inch mistubishi tv\" and it'll be self-explanatory.Now onto the TV review:This TV is pretty good. The picture quality is satisfactory, and the price is good. The speakers for the TV are very mediocre, so you would want to get a surround system. Also, beware: the TV HAS ONLY ONE AV/COMPONENT PORT and a couple of hdmi ports (I think 3 or 4 if I am remembering correctly). That means if you have a cable box, a dvd player, a wii, and an xbox, you'll have to keep reconnecting and disconnecting each one of those devices if you want to use them which is quite frankly absurd. TVs this size usually have 7-8 of these jacks in the back and one easily accessible one in the front. Even $150 TVs have at least two or three of these.But don't fret, there's a solution to overcome both the av/component jack shortage and the mediocre speaker shortcomings: buy a home theater system with an A/V receiver. I bought this one for $477 and it worked perfectly: http://www.amazon.com/gp/product/B005EP2HKW/ref=oh_o00_s00_i00_details. Any should do though.Basically, you can connect all of your devices into an A/V receiver and then output the A/V receiver to the TV via an hdmi cable. That way, you can use the receiver to switch through your devices. But be careful: YOU NEED HIGH TRANSFER RATE CABLES WHEN YOU CONNECT TO THIS TV. So don't get cables that are too cheap or your picture will either not appear or might flicker.Good luck!", "Date": "February 10, 2012"}, {"Title": "Outstanding Picture!", "Author": "C Bussey", "ReviewID": "RBFCJKXLEXFPK", "Overall": "5.0", "Content": "I did not think I could see a better picture than the on my 2005 Mitsubishi 65 inch DLP model until I saw this one! Fantastic visual. Even the 3D picture quality is more than I expected. Good job.I can see room for improvement in the Stream TV area as far as available apps. Where's Netflix?? Also a built-in web enabled device rather than the optional USB would be more convenient.The smart phone or tablet app for remote control will not work for me but I am not sure how much I would use that anyway.I am very happy with how well my digital cable box and my Panasonic 3D Blu-ray player interfaces for stunning 3D output. My Sony AV receiver and speakers complete my home theater requirement for sight and sound.I highly recommend this TV.", "Date": "August 23, 2012"}, {"Title": "Great tv!", "Author": "Dom", "ReviewID": "R3MU8DKM5BIOJA", "Overall": "4.0", "Content": "Fast delivery, the tv is huge and the picture quality is spectacular, the 3d movies is like being on the movie theater", "Date": "June 23, 2012"}, {"Title": "It's Huge", "Author": "JSD", "ReviewID": "R22AWKX4N7OPOX", "Overall": "5.0", "Content": "I was going to buy a video projector until I found this television.  It's very large and has a great picture.  I was worried about the viewing angle but it's not a problem at all.  Xbox looks great and even SD shows are tolerable.  Can't beat the price.", "Date": "March 12, 2012"}, {"Title": "BANG FOR THE BUCK!!", "Author": "Jk Lewis \"That's right SON!!!!!!\"", "ReviewID": "R3SZGIVGYI3YJ9", "Overall": "5.0", "Content": "This TV is fantastic, I had the 2007 65\" and it had a problem at the five year mark, the mirrors started to freeze to the point of no return. Mitsubishi fixed it for $200 which was not great but better than the alternative. Over a year later the 65\" is working fine and still looks great, only 1 bulb replacement in 6 years. The 82\" has had no problems but it is less than a year old. The TV's contrast is a bit better than my 2007 plasma but the picture itself is stunning. 3D looks great but it needs to be played in torch mode unless the film is fairly bright. I love playing video games on this big boy!! the only down side is it takes a pounding in a room with to much sunlight, but most TV's do (we have 3 huge bay windows in the room so that might be the reason). As long as this TV does not have the same problems that plagued the 2007 DLP's then I will not be adjusting my review. Anyone buying a TV you cannot beat the size and picture qualtity to $$ ratio. This is the best deal for an 82\" TV hands down.", "Date": "August 28, 2012"}, {"Title": "WOW what a TV", "Author": "Santa", "ReviewID": "R29Y2TETAODT15", "Overall": "5.0", "Content": "WOW, what a TV.  My husband thought I was crazy looking at the 73inch, and after doing research between LCD/LED/DLP and prices and convinced my husband to think about the 73in, I found the 82 was only a couple hundred more, he decided go big 82 it is.  (CyberDude your review convinced me to go 82).Delivery - our delivery took 2 weeks (we live in the sticks and delivery company only comes to the area every other week.)  The 2 guys unloaded the TV on the driveway (WOW it's big), they uncrated and inspected....everything looks good.  They carry in the house, place it on the stand.  Was very happy with the delivery.It took us a few minutes to set up DirectTV....drum roll, picture is awesome.  The HD channels are beautiful.  Watched out first football game Thursday night.....WOW.  I'll never watch football anywhere but my living room. I felt like I was on the 50yard line.Looking forward to 3d and internet access from this TV.  LCD/LED is the latest technology and for almost $4,000 you can get an 82 inch LCD/LED TV.  But for under $1,700, if you've got the room, for the money this is the TV.Very happy with my first purchase from Amazon.com, Paul's TV and the delivery.", "Date": "August 18, 2012"}, {"Title": "Mits 82\" DLP", "Author": "JB", "ReviewID": "R2B2AOOUV9AMH7", "Overall": "4.0", "Content": "Picture is great, once u figure out the proper screen settings that work for you. Channel lag is Jus a little annoying but after awhile u kinda get use to it. Watching movies is awesome too. Just like being at the cinema. Big screen just soaks you into the movie. I went from a 72\" to an 82\" with some hesitancy just because the screens are so big but I'm so happy I did. If u want to save about $2500 compared to the 80\" Sharp LED, DLP is the way to go....", "Date": "August 12, 2012"}, {"Title": "Love the TV so far, but need a reasonably priced stand?", "Author": "Zoey's mom!", "ReviewID": "R3IMXJMKYXTSFB", "Overall": "5.0", "Content": "Nice tv, actually the people on it seem life size!  I need a good stand for this tv.  Any suggestions?", "Date": "February 23, 2012"}, {"Title": "Love it.", "Author": "Pat Farley", "ReviewID": "R7RH1CVIZJ0RV", "Overall": "5.0", "Content": "The 82\" 3D Mitsubishi WD-82740 is technology at it's finest.  The tv is awesome, it's better than the 3D in the theatre's.  I keep watching The Polar Express and Nightmare Before Christmas over and over; just amazed at the quality. I can't wait to watch Toy Story.  For the price and to have this in your home is unbelievable.  I purchased mine from Walt's and there was no shipping.", "Date": "June 1, 2012"}, {"Title": "Very good", "Author": "snow flake \"snow flake\"", "ReviewID": "R135KRRC0TN99W", "Overall": "5.0", "Content": "It is pretty big size, and I very enjoy this tv. It is have sharp pictures,. The only Small issue is it is heavy, so it is not so easy to move to different place once in a while.", "Date": "January 2, 2014"}, {"Title": "one of, if not the best TV for the money", "Author": "JASON STERN", "ReviewID": "R2FQW0UZJPAL20", "Overall": "5.0", "Content": "yes, it isn't a flat screen. but price a LCD or plasma at this size.yes, DLP bulbs dim over time. but at least you can replace the bulb easily, unlike non-LED backlit LCDs,more or less impulse bought this when it was on sale. I had a 52\" Samsung LCD, which I figured I would put into a den and use for gaming, but this thing is just so immersive that I do a reasonable amount of my gaming on this.the biggest complaint is that the backlight isn't as powerful as LED LCDs.what most reviewers don't say is that the bulb has a burn-in period. as a result, when I first got it, I was terribly disappointed with the quality of the backlight. I went so far as to buy (and return) a DarbyVision Darblet to try and improve the picture quality. but eventually, a combination of the bulb entering its prime and me getting used to the picture quality happened, and so now, the thing looks amazing at night (where I watch most of my TV) and good during the day. I definitely have to close the blinds during the day to avoid light shining on the matte material and overpowering the TV's colors.", "Date": "March 10, 2013"}, {"Title": "Superman Television!", "Author": "AlwayzDreamin", "ReviewID": "R2LV0OL5PB5SRY", "Overall": "5.0", "Content": "I replaced this television from a 58 Samsung Plasma and it's great!  Everyone who's seen it is wowed by the size and picture.  The 3D work flawlessly as well.  If you're thinking about going big, don't hesitate on this bad boy!  Step your game up!  LOL...", "Date": "March 10, 2013"}, {"Title": "Tv 82 in", "Author": "Carrie", "ReviewID": "R25LWITVIRP6HI", "Overall": "5.0", "Content": "Awesome tv. Worth every bit of the money!!! Very happy!! If you are ever thinking of buying a tv ... This is the tv to buy.", "Date": "December 26, 2012"}, {"Title": "82 inch tv", "Author": "Lisa Arrowsmith", "ReviewID": "RTFVTIXHIN1AB", "Overall": "5.0", "Content": "Took over time they said for it to arrive. Which was aggravating. But truly an awsome tv. You feel your right there with people on screen.", "Date": "December 24, 2012"}, {"Title": "Mitsubishi WD-82740 82-Inch 1080p Projection TV", "Author": "1sexyblackman", "ReviewID": "R1L42SP372MP5", "Overall": "4.0", "Content": "I just purchased this nice big TV off of Tigerdirect.com for $1399.00 with shipping. This is a graet TV and I love. I would say awesome,but I can't. The only reasons why is because it has no audio output device. So I had to purchase a new receiver with hdmi inputs to get my surround sound going, because the speakers on this tv is not that great but they work okay. The packing could have been much better but the TV arrived in awesome shape thanks AIT shipping company. The delivery from AIT was oustanding he help bring it into my home. He did not did not get upset that I wanted to open the box to check the TV to see if it was damage. He even stood by as I unpacked it and plug it in to make sure the TV powered up and displayed a picture. Just wish I would has purchased two of them now and not just the one I have. My Blueray player, Xbox and Playstation looks outstanding on this TV. It's like being in a movie theater but at home in your own house. I would buy one again in a heartbeat.", "Date": "December 16, 2012"}, {"Title": "Very Nice TV.", "Author": "Andres hernandez jr", "ReviewID": "R1HA52O22490PK", "Overall": "5.0", "Content": "When I recieved the Mitsubishi TV I couldnt' wait to open it. I quickly opened the box and I was amazed by its massive size. My previous TV was a 55 inch Mitsubishi that I bought 8 years ago and it still running without problems so naturally I stuck with the same brand. I was blown away by the size of this TV. The picture quality with an HDMI cord and on HD channels is jaw dropping. Its like having a movie theater in your home. The picture is crystal clear. The audio is loud and  great on surround mode. I play alot of video games on the Xbox and the TV has no problems keeping up with the fast movement on the screen. I highly recommend both Mitsubishi brand TV's and in particualr this model. The price is very affordable and you wont regret buying it. My friends who have 73\" TV's from Samsung were amazed by mine so that says something. I have not tried the apps or the 3D yet so no review on that. In the end great product, great price great brand so stop reading and buy it already.", "Date": "December 4, 2012"}, {"Title": "Big screen, cheap price", "Author": "Keith", "ReviewID": "R2AOHEP1UPWC3I", "Overall": "5.0", "Content": "I purchased this TV to replace my 7 year old Mitsubishi 63 inch DLP. After viewing this TV for a month, both live TV (including football) and Blu Ray movies, all I can say is \"wow\". The picture is really sharp and lifelike, and the colors accurate and brilliant. In my view the picture on this TV is just as good, if not better, than on my friends 80\" LED LCD, at about one third the cost.  If the depth of the unit is not a problem for you, I don't think you can go wrong with this TV. I am using it in a dedicated media room, so the depth is not a problem for me. 1080P Blu Ray discs are absolutely stunning, and the size, combined with a good surround system, makes for a truly \"theater like\" experience. Delivery took a little longer than expected, but it was well worth the wait. The delivery guys placed it on the stand, and waited while I hooked it up and turned it on to make sure that it was working properly. A little tweaking of the settings and \"voila\" it was ready to watch. I will probably invest in a calibration disk to recalibrate for best picture after I get a few more hours on it.", "Date": "December 4, 2012"}, {"Title": "I really like the Mitsubishi 82 inch tv.", "Author": "Tim Jones", "ReviewID": "R1YR7IJPRDUNUL", "Overall": "5.0", "Content": "I would recommend the Mitsubishi tv as great buy for anyone with a large room,it's lik being at the movie theater.", "Date": "November 5, 2012"}, {"Title": "near perfect", "Author": "fred", "ReviewID": "RAW6ERT2PT1OA", "Overall": "4.0", "Content": "wish it was a newer model and a bigger model as yell. but now they are not being made anymore gotta get whats availible", "Date": "May 6, 2013"}, {"Title": "Very Very Poor Service", "Author": "Gary V", "ReviewID": "R120Q4DBVLNZE6", "Overall": "1.0", "Content": "The TV arrived damaged. It has been a nightmare to get the TV sent back and receive credit for it. It has been over 45 days now and no credit has been received. I would NEVER purchase another product from this company again.", "Date": "December 11, 2012"}, {"Title": "Size matters and 82\" is great viewing", "Author": "DEEK", "ReviewID": "RX25XMRS01H9G", "Overall": "5.0", "Content": "My 82\" WD82740 was delivered this evening. WOW, what a TV!  The picture is great viewing at 3' away and to the side of set by 3' is still clear and great picture even when that close.  NO pixels can be seen and picture is still the greatest. I had a Mitsubishi  5'- 60\" reflector TV in 1982, it still works. Bought the second one in 1988 to put in new Media room. Didn't have the beautiful walnut cabinet with bi fold doors the first had but was several thousand bucks less. Both TV's are still gong strong, bought by people I know. The second I had up until I sold the house. Never had a service call on either one. The newer TV HAD to go with the house simply because getting it down the steps and around a corner was nothing less then a miracle. They were pretty deep then. Didn't want to go through  getting it out.  Besides, having a big screen in the media room was a great selling point, good for the theater decor and for me monetarily. Went to a slim 44\"  because I knew I would be moving again soon and to be used in the bedroom. Didn't expect this big screen to compete with that TV but, it actually wins the competition! The picture quality is outstanding!Hooked up to my direct TV and WOW. Concern about distance from screen? There are no pixels to be seen. If you sit up close it would be hard to see the whole picture so recommend you back up at least 4' or you'll look as if you're watching a tennis match to keep track of what's happening. I had concern about light [the older ones had to be watched in dim lighting] but there are four 60 watt lamps lighted against the wall in the room with clear bright screen, no reflection. I had more reflection on my 44\". Sound? I have it half way up, it's plenty loud. Can't imagine having it any higher and not blast me out of the room!  I'm using the sound it has and am glad I didn't buy an additional sound system. I'm in LOVE! [with my TV]Have to rave about the delivery too.  I bought mine on Amazon with Pauls TV being the seller. Amazon? Has always been my preferred place to shop on line. Pauls? Has a strict customer satisfaction rules. The gentlemen [TWO men] who delivered it went out of their way to make sure it was working perfectly before leaving. They commented on Paul's concern for everything being right.  Notice on delivery -right on time, with prior appointment followed by a call the evening before and again when 15 min. away. Paul R. with a third person delivery company, Buehla Companies agent #0267 , remarked how particular Pauls was and the guidelines they had to follow. A checklist rating was filled out. All I can say is, Paul's TV is the place to buy! AND to Paul's TV, that delivery service reflected your concern in customer satisfaction! Personable, nice, professional and concerned with my satisfaction. As far as Mitsubishi is concerned, been a lover since 1983 when I took a chance on that big beautiful walnut wrapped sucker for 6,000 and never regretted it. To me, Mitsubishi has always been the best in big screen reflector TVs.  Oh, the price!! You get a h--- of a lot of TV for the buck!Go ahead, go for it, it's quite a viewing experience!", "Date": "November 15, 2012"}, {"Title": "I've owned if for just over a year and its failing!", "Author": "JM", "ReviewID": "RJB5R8LV3CFMV", "Overall": "3.0", "Content": "I give this TV 3 stars because when it worked it offered a great picture and we really enjoyed 3D movies and Xbox game play on the huge screen. I cant believe at just over 1 year the TV is now rebooting itself on a regular bases.  We first noticed the reboot maybe two months ago. Just figured it experienced a a glitch and so restarted.  The reboot happened a couple of more times in as many months and today its just acting all out crazy. Switching between different input signals reboots the TV, 9 out of 10 power ons results in a picture with no audio, switching into 3D mode reboots the tv and switching from 3D back to standard mode reboots the tv.  I did purchase a 4 year SquareTrade warranty for this beast of a TV so we'll see how they perform.  I'll report back once I've contacted them.  Get the extended warranty!", "Date": "April 6, 2013"}, {"Title": "Amazing", "Author": "John Hill", "ReviewID": "RD0LJ7EA40RSI", "Overall": "5.0", "Content": "I had a 60 in projection and went for the 82\" 740 ..... awesome...With Vudu $2 digital upload of the movies you currently own on disk ....to Vudu connection makes it really easy to watch your favorite movies", "Date": "April 27, 2012"}, {"Title": "Definitely not a plasma", "Author": "Denise O'Byrne", "ReviewID": "R3553AWELTB61C", "Overall": "4.0", "Content": "I'm just a little dissapointed in the picture quality.  I had a 42\" plasma before this DLP and I was not ready for how a DLP looks in comparison.  Unless you are sitting directly in front of a DLP even this size the picture is not as bright as you sit at different angles.  Any direction you look at a plasma looks the same.  There's no way you can get a screen size this big for the price I paid for DLP but you may want to consider size and price vs. quality of viewing.  1080p is really no good unless you are watching a BlueRay or a PPV movie in 1080p because satellite is still just transmitting 1080i.  So for every day viewing the picture is just submaximal.  A nice feature of the TV is that one is able to plug the internet into the back so the firmware on the TV constantly stays updated. The TV also comes with VUDU so you can immediately use the PPV movie service if you wish. With my BlueRay I have to download the firmware updates from the internet onto a disc and insert the disc and unless I check the website all the time I never know when there's an update so being able to just plug the TV directly into the internet and have it update itself is nice.  The TV's stand is 37\" long and 14.5\" deep so if your TV stand will hold 133.5 lbs you can use your existing stand.  I bought a $47 black wood stand at Wal-Mart that holds up to 135 lbs and so far it works perfect and fits perfectly under the TV. The TV stand I bought sits about 19\" tall and I highly recommend the shorter the better since this TV almost touched the ceiling with my 32\" high TV stand I had the 42\" plasma on.  The stand I bought also holds my stereo receiver, satellite receiver, blueray disc player and still has room to stack more so look into this if this is of interest to you. All the sound is hooked into my surround sound system so I don't use the TV speakers.  I bought 3D glasses that don't need the external 3D emitter.  The glasses just use the internal emitter so you don't have to buy the 3D setup kit that is advertised with the TV.  Just by DLP linked glasses and you'll be good to go.  I'm trying not to copy any thing the other reviewers have said so there's not much else to say except to go to the store before you buy a DLP if you are not used to viewing DLP.  It's definitely different than plasma.  I've never owned LCD or LED so you'll have to see for yourself if there's a difference.  I know you definitely can not beat the price for this size so if size is your thing this is the best bang for the buck.", "Date": "December 5, 2011"}, {"Title": "Good Television", "Author": "T. R. Mala", "ReviewID": "RCEM2YAMHWCL6", "Overall": "4.0", "Content": "Nice television. Good picture. Good overall value. Some minor nitpicks: Just wish the thing didn't look and feel so cheap. I'm a fan of solid wide bezels and the bezel on this thing is super thin. Visually, it's just bland looking. Wish the design was more stylish.", "Date": "April 4, 2012"}, {"Title": "DLP not for me", "Author": "Mike", "ReviewID": "R10EIQKRXAUF2I", "Overall": "2.0", "Content": "Picture not bright enough for my family room, factory settings were all at the brightest settings. Voice and picture were out of sync.", "Date": "February 24, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004ZL2OAO"}}