{"Reviews": [{"Title": "3D TV done right", "Author": "Vynny \"Vynrod\"", "ReviewID": "R2O70N0UKKXFA1", "Overall": "5.0", "Content": "My previous TV was a three-year old Panasonic HDTV 50\" plasma and so I'm able to review this TV with some experience with another set that had similar specifications. I wasn't expecting massive leaps in image quality and merely purchased this TV because of the low price it was at and the fact that I wanted the 3D experience.I have to say however that once tweaked, this set is leaps and bounds beyond my older TV. The image is clearer and is much brighter. Of course as I said you have to tweak it to get that perfect image and by far in a way the most essential tweak is to switch off the terrible energy saving option that infects this television. The theory is this 'intelligently' dims areas of the unneeded sections of the screen to save power since plasmas draw a lot of juice. The reality, however, is everything looks dirty and dim even at 100% brightness. In fact with the energy saving setting on, the more I tweaked things, the dimmer the TV seemed to get. Thankfully it's just a quick disable of this option and retina-burning brightness is the wonderful result. Just how I like it.Once I was satisfied with the image settings I immediately played the IMAX 'Ultimate Wave Tahiti' 3D blu ray to stretch its legs. And I was blown away. Everything looked so clear yet... in 3D! And I love the fact that the menu options are also in 3D meaning that tweaking the depth settings whilst playing a 3D movie is extremely easy (and quite effectively bizarre).Now there's a lot of features on this set - youtube, web browser, vudu, games, apps and so on and I've yet to try any of them. This is due to the fact that this 'wifi ready' set doesn't have wifi; you have to buy the LG AN-WF100 Wi-Fi USB Adaptor or use a cat5 cable. I almost dinged the overall rating stars because of this. Even sub-$100 gadgets like apple TV has wifi built in. I decided against the ding and have ordered the dongle but boy is it frustrating to spend four figures on a set up only to find you're missing a 1 inch long peripheral that cost $20 or so.  This also means I haven't had chance to try the supplied extra mouse pointer wii-like remote controller (you also get a nice light-up normal remote) although it does look interesting.Sound is also unused in my set up as I have a 7.1 receiver. Usually sound on these sets is passable but nothing to write home about - I can't imagine this set pumps out huge bass because it's so thin, but perhaps the speakers are in the base or something. In all honestly if you're getting this TV then you probably already have equipment that sounds better than the in built speakers though.Almost certainly due to the high brightness that I have this set I do notice a lot of inherent memory. This is often thought to be burn-in on plasmas and I read in another review for this plasma TV that they were whitewashing the set every night to rectify it. Please don't do this! Temporary image retention is normal for a plasma and it self corrects itself fairly quickly once you start watching something else. This set 'suffers' from it no more than any other plasma that I've seen and I just wanted to put that out there in case you bought it and thought you'd ruined it with some burn in.So what we have here is a utterly stunning TV that's got everything you need. It's ten steps ahead of my three year old plasma in all respects plus it's 70lbs lighter. I cannot recommend this TV highly enough regardless of whether you're into the 3D thing. What a great set.", "Date": "August 4, 2011"}, {"Title": "Loved it until it went RED!", "Author": "Nancy E Thompson", "ReviewID": "RW5EHI58H8601", "Overall": "1.0", "Content": "I bought this TV (LG 50PZ750 plasma) for Father's Day and had it just less than a month. I LOVED it..easy to set up,remote easy to use, GREAT picture, accessed Netflix easily, yadayadayada...UNTIL one morning we turned it on, after having the power completely off, and the screen was tinted RED all over. After some time it would flicker between a normal picture and the black/red picture. I googled LG PLASMA PROBLEM and found something about LGs,Phillips, and Magnavox plasmas having this problem. Didn't need to read any more so I called AMAZON and asked to return it for a refund. I'm SOOOOO glad I bought it through Amazon...no hassel..no shipping charges..veerry easy. Their shipping company just comes to my house and picks it up.I was also just within the 30 day return limit. I'm replacing it with a Samsung Pn51D7000, a little pricier, but also a great deal on Amazon.  I STRONGLY suggest that any TV buyer do these 2 things: 1. SAVE the shipping box, you can't get a refund without it) 2. Buy an extended WArranty from SQUARETRADE.I bought the warranty (4 yrs, about 135.00 with promocode on their site) and Squaretrade REFUNDED the entire amount since the TV was being returned. All in all, I loved the TV , but because I bought through Amazon I was able to get a full refund and not have to go through the Manufacturer's service process.", "Date": "July 15, 2011"}, {"Title": "Great 3D Plasma", "Author": "rmsuriani", "ReviewID": "R3G18YGGQ4J6ER", "Overall": "5.0", "Content": "I did a lot of research before finally deciding on the LG 60PZ750 reading reviews from other websites. The specs on the LG looked good, and it has a lot of extra features for the price. A friend mentioned they paid much more for a 60 inch w/out 3D.Last night I watched my first sporting event in 3D, the NBA finals. I thought I would get tired of wearing the glasses, but they didn't bother me after my eyes adjusted. Basketball in 3D was amazing. A totally different perspective. I only wish they had the same announcers as the ABC broadcast?? 3D isn't for everyday use, but is great for big sporting events and movies.The HD picture is great. I am still tinkering with the settings, but the game in \"sport\" mode looked great.The  TV is very thin, but heavy. Not a big deal, but you will need 2 people to mount it on a wall. I also purchased the wifi usb dongle and it worked great. I haven't watched a movie on netflix yet, so I can't comment on the quality. There are a ton of network features that I will begin to explore when time allows.My only negative comment is the TV issues a warning when you switch to 3D mode, and the only way to turn it off is with the LG TV remote. I use a universal remote that controls Directv and my receiver when \"watching TV\" so I have to keep the little \"wand\" remote handy. I am sure I can modify the universal to fix this, or possibly turn off the warnings,  but I haven't figured that out yet.", "Date": "June 3, 2011"}, {"Title": "Great Price, Nice Pictures, Wonderful 3D, Love It", "Author": "An old but not  really old man", "ReviewID": "R39LXFGRRECYBA", "Overall": "4.0", "Content": "I bought 60pz750 from Amazon after a lot of research in comparison with other leading brands.  Finally I chose this one by the size, price, and functionalities.  The TV arrived perfectly but the default settings made me struggled and confused.  The default energy setting is using intelligent sensor which consumes less power but the screen became darker and lack of vivid pictures.  Since I did not buy any professional installation, I have to figure out by myself.  It is not that difficult just so confused why this new TV's quality is so bad at the beginning.  After a couple days playing the setting, I realized that I can change the energy mode.  When I changed it back to normal/standard, the picture came back nicely.  The display quality is good; about the same as my 3 years old Samsung Plasma's HDTV.  The sound is flat that I may have to find a sound bar.  Some people are saying it is because of the TV becomes thinner so as the sound.The Smart TV is kind of useless to me.  LG should have built in the wireless instead of we have to buy one.  In the past I used HDMI cable to connect my PC to the Samsung plasma TV.  I think I may have to do that way again.  It is much easier to type or navigate using a PC. The Magic Motion Remote is ok, not great.  I wish LG could provide a remote control with keyboard.I just used the standard display because it is better than any other mode.  So if you are thinking you may get better display by buying this model, think twice.  I would suggest people just get the PZ550 model.  You don't get much benefit from the higher end model like PZ750 and PZ950.The 3D is nice.  However the programs from Direct TV are horrible.  They keep on playing the same over and over.  I wrote an email to complain.  They replied politely saying it will be brought up to their management's attention.  I got 2 pairs of free glasses from purchasing the unit.  The nose piece can be lifted to sit on top of my eye glasses.  I wish it can be even better since my glasses have a bar across the two lenses.  When the 3D glasses sit on my glasses, it can't cover the whole glasses.  It is not totally bad but still not perfect.  If you wear contact, you will not have this issue.  The 3D glasses turn off from time to time without reason.  My guess would be the timeout issue (or function) in case no one using it.  It can be either good or bad.  It doesn't bother me much.  I don't have experience on other brand's 3D so I can't comment too much. In general, I am satisfied with this one.The TV's glare is a concern if you have a lot of lights coming from the outside.  Unfortunately, it is my case.  My old plasma TV is smaller so the glare wasn't that bad.  Since this one is big, I am having so much trouble.  People suggested hanging on the wall and tilting it.  I have not tried that yet because my TV is good to sit at the corner.  I don't watch TV much during the day so hopefully I can live with it.I checked the power consumption from the specification that it is 570 watts.  I noticed there is a lot of heat coming from the back.  The label at the TV says the cost of electricity is less than $40 a year.  I don't know that will be true since I don't use energy saving display mode and I watched more than 5 hours.  This TV does not get 5 stars from me but it is still an excellent one and I am going to keep it.", "Date": "June 27, 2011"}, {"Title": "No Glaring Problem!", "Author": "Jereth", "ReviewID": "R286XLN99U4RY7", "Overall": "5.0", "Content": "The LG Infinia 60PZ750 60-Inch was delivered on October 8, 2011 from Amazon.com. So, I have it now for over 2 weeks. The delivery was fast and all Amazon TV purchase is white gloves delivery, meaning they will schedule the delivery date and bring the TV up 1 flight of stairs in to your home. They will also haul all the trash away. I chose to keep the box, but let them take away the strings and the plastic foams.The TV itself is gorgeous, it looks bigger than I imagine in the space I wanted. I even went to Bestbuy to look at a 60\" TV in person, but it seems bigger at home.I wall mounted the TV over a fireplace with windows on 2 sides, and bit glass door on the 3rd side. I'm not going to lie, if you're looking for the glares, you will see the reflection on the TV. However, this doesn't bother me at all as I was able to watch the TV no problem. It doesn't hinder you from not able to watch it during the day time at all. I actually never notice it anymore after the first time I viewed it when I was looking for reflection.I won't go in to details about the TV, since other reviewers took care of that. What I will cover is how to get your TV cheaper from Amazon.com!Right now, and when I purchased it the TV is listed for $1699.99. If you purchase it from other vendors you will not be qualify for the LG Active 3D Plasma HDTV and Glasses Bundle.First, find a list of \"Eligible Websites\" that Amazon will price match. I used Vanns.com to price match my purchase. At that time Vanns was selling the TV for $1309.Second, call the Big Ticket Items department at 1-866-423-5355 and get a per-authorize price match from Amazon.com. This way you will not risk any investment before your purchase. Get them to price match whatever price you find from an eligible website. You will then have 24 hours to complete your purchase before the price match is voided.That way you avoid buying the full Amazon.com price, but you will get full benefits of buying it from Amazon.---What are the benefits?1. Amazon will deliver the TV using the white-gloves service I mentioned.2. You will be buying from Amazon with their top rated customer service support. This alone is worth the purchase from Amazon.3. If you have the Amazon Store Card, you won't have to front all your money on the TV right away. The TV qualifies for 0% interest for 24 months. Meaning the money that will buy this TV sits in a bond gaining interest while you're paying it off. It came out to about $55 a month using the Amazon Store card.4. You will be eligible to receive the LG Active 3D Plasma HDTV and Glasses Bundle. That alone will save you about $100.5. This is really up to you and your location, but you also save on the sale tax. Which is another $78.54 that I saved.---So, this TV is definitely worth it. If you want to save even more, look for a deal on the LG 60PZ550 60-Inch 1080p 600Hz Active 3D Plasma HDTV with Internet Applications and go through the same procedure. Same screen and everything, but you're just missing the smart wii-like remote.If you're looking for a big screen TV, this is it! It's the best bang for your buck. BUT!!! Get it through Amazon.com using price match, so you get the best of both worlds.Do not be afraid of the glare during day time, there's no issue with it. The LG Infinia 60PZ750 60-Inch is highly recommended.", "Date": "October 26, 2011"}, {"Title": "Excellent Plasma TV", "Author": "Mark Gallagher \"mjbg666\"", "ReviewID": "RRFT579MKVDSO", "Overall": "5.0", "Content": "Just received my LG 60PZ750 yesterday (August 4, 2011). I am very satisfied with this plasma. Picture is gorgeous in 2D, have not tried the 3D features yet, but can't wait to. This is replacing a 3 year old Panny, which I was never really satisfied with. The LG is superior in all regards. Better blacks, better clarity, better tv speakers, much, much better web/streaming features. I will probably never buy another Panny product again. Panasonic admitted their plasmas black levels WOULD deteriorate and offered not even an apology to the suckers (like me) who bought one. LG has produced an exceptional product at, by far, the most reasonable price. I actually paid less for this tv (through Amazon, with a 2 free pair of 3D glasses thrown in to sweeten the deal) than I did for the Panny. I went from a 47\" to this 60\", but because of the stunning design of the LG, the extra size is not that overwhelming, especially in my rather small living room. It is a shame that this tv has not been more critically reviewed by such sites as CNET, who only seem interested in a plasma television if it's made by Panasonic, Samsung. I did a lot of grappling myself with review after comment after forum, before finally settling on the LG, and I have no regrets whatsoever. Yes, there is still a lot to tinker around with in the very detailed menus, but this is all part of the technology game, and to LG's credit, they offer tons more flexibility in settings than other manufacturers. You will read a lot of \"experts\" talk about LG's inferior black levels compared to Panny's and Sammy's -- don't believe it. I'm not sure what these experts are using to make these claims, probably some complicated and, in practical application, useless meter readings. I prefer to let my own eyes be my judge. And the verdict is brilliant!", "Date": "August 5, 2011"}, {"Title": "Lovely TV", "Author": "Christine Paluch", "ReviewID": "R21YV0URGWW5UC", "Overall": "5.0", "Content": "This TV is absolutely fantastic.Let me be clear, my boyfriend who has the TV has a seperate sound system by Marantz.  The sound system is no slouch by any means.  But when we hooked up the TV, we actually did not plug in the 5.1 system. The TV was loud and clear.  While it may not be perfect to many ears, for many people the sound coming from the TV may be \"good enough\".  Some people may always want more, but for many the tv will be all you need.The picture on the TV picture looks fantastic.  There are several different modes, including two THX modes for those who do not want to spend the time callibrating the TV.  For those who are more interested in going through that process, there are two custom modes.The 2D-3D is a gimmic.  It should not be a selling point.  The 3d picture for regular 3d movies is a bit mixed.  My boyfriend could barely tell, while I thought it looked pretty sharp. This was with Avatar as a test (Avatar, or a 3d animation movie should always be the test).  With that being said...3d here is more or less a bonus for the price point.  We were not really considering 3d tv a necessity, just 1080p and a decent set of features.The smart TV functions are pretty nice and were a selling point for us.  Netflix, Amazon and Hulu all worked fine.  We actually decided NOT to get a Roku box because they were available.  As an added bonus, Crunchyroll the anime video streaming service has an app.  Not a big deal for everybody, but a nice added bonus.  We actually decided against getting a roku box because the features were good enough to lean against getting it.The TV does require a seperate piece for wi-fi.  But a wired network works for us in this case.Overall this tv for its price point is a very good choice.Also this should be a note.  The power consumption for plasma tvs has dropped over the last few years.  They used to be energy vampires, but the newer ones on the market are no longer the energy hungry devices they once were.  Considering the fact that picture quality for plasma's is better than LCDs.", "Date": "September 22, 2011"}, {"Title": "LG 60PZ750", "Author": "T. Burke", "ReviewID": "R2JDW934M8I19T", "Overall": "4.0", "Content": "Have had this TV for a week now and am completely satisfied with it. The picture is brillant and sharp, the controls and menus are easy to use, the LG Smart Apps offer all sorts of great options from games, news and educational items. They have an app for 3D tours of cities and places around the world which is fun and educational, plus a great way to try out the 3D features.  I have watched baseball, football and hockey games and the detail is outstanding. We also have an XBox 360 hooked up, Rage looks unbelievable and Black Ops plays great on-line. Lag times have disappeared from what I had on our DLP set, you can tweak the settings to get even better results if you want. The 10-point calibaration opions are more than other sets out there, giving the tech head plenty to play with. One item I picked up in other reviews was screen glare, have had much of an issue with this but recommend indirect lighting behind viewer. I highly recommend looking at this TV, great features at a great price.Side note: Did pick up a lot of background lighting reflection on the 3D glasses, I cut back on the lighting behind me and was good to go.", "Date": "October 11, 2011"}, {"Title": "Fantastic", "Author": "Errk", "ReviewID": "R69UOXB00OZSX", "Overall": "5.0", "Content": "we were very excited for a new tv to replace our old DLP set. I did a lot of research and decided on this one. We hung it on the wall, fired it up, made a few adjustments, and it is all we hoped for. Great tv, the apps are very nice. I have it hooked up on a wireless N system and there's not even a hiccup. We've been watching netflix a lot!", "Date": "June 16, 2011"}, {"Title": "Great TV - Good SmartTV", "Author": "Gerardo Pedraza", "ReviewID": "R32CEO00B9GLMK", "Overall": "4.0", "Content": "The image has great quality and brightness.  The sound is good too. This is my first plasma TV so I was not used to see that images that are still are burnt for some time, nothing permanent yet.  Looks good, weighs a ton (I put it myself on the wall.) 2 USB inputs, used the WiFi dongle that I'm selling now... never had issues with it, but now I have ethernet in that room.  LG apps that they offer in the website are really bad.  I can't see a use for any of them.  I only use the \"premium\" which are netflix, hulu, and a few others.  I love that this TV can stream from a PLEX mac or pc server...! and that it has DNLA which hasn't worked that well due to my Win7.  What I hate is that there is no Pandora just MOG. I wonder why LG includes Pandora only on their Bluray players but not on the TVs... well at least in this one.  Maybe you could buy a DumbTV and a net bluray player to make it Smart, and have Pandora.  Anyways... good TV so far.  I have had LG, Phillips and Sony LCD's before so that is what I used to compare and the image quality and price combination on LG is really good.  Oh I forgot... It comes with a remote that you can move with your hand like a Wii controller, which is not really a quite finished accessory. I would have preferred the Glasses I guess... oh oh ... just so you know the glasses are expensive! around 100 each because they need to be active.  Passives, which work with LCDs, are less expensive, around 20 dlls.Hope this helps.", "Date": "December 19, 2011"}, {"Title": "Very nice TV", "Author": "Surfnet", "ReviewID": "R1SHW4VRVAJT00", "Overall": "5.0", "Content": "Received this TV 2 days ago and the picture is great. Be sure to turn off the energy saving options to get best picture. Only low point is the sound. Not that its bad its just not the best. I give the sound 7 out of 10. We use the Built in Netflix and Hulu plus with the wireless adapter (LG AN-WF100 Wi-Fi USB Adapter)over 5Ghz N network with no issues. Me and the wife are very happy.One note: The first TV they delivered had a shattered screen. We rejected delivery and we had another TV from Amazon within 2 days. Be sure to check your TV when it is delivered!", "Date": "August 3, 2011"}, {"Title": "good tv, no flash support", "Author": "tibor", "ReviewID": "R34KH6YW9HSFC3", "Overall": "4.0", "Content": "I've had this tv for a little over a week.  For the most part, it is a nice tv-picture quality is good, basic set-up was easy, lots of features, etc.  However, one of the main reasons I chose this tv was for the web apps and this is where it seems half-baked.  Netflix, amazon instant streaming, and hulu all work well and were easy to set up.  Additional apps are limited and others, such as youtube are just plain unusable.  This wouldn't be an issue if the included web browser(nice feature) had flash support.  Lack of flash support seems like a major oversight for a network connect television and has been an annoyance on several occasions already within the first week.Summary, this is a nice tv with good features for the price, but know how you want to use it.  If web apps and access are critical features for you, look elsewhere.LG- how about a firmware update with flash support?  Make a good tv great", "Date": "September 4, 2011"}, {"Title": "WOW", "Author": "Gerhardt M Bauman", "ReviewID": "R3MZRX9N222E30", "Overall": "5.0", "Content": "I received this LG 50pz750 two weeks ago and all I can say is wow,  Great Picture.  It beats my other LCD in picture quality.  I hooked it up to Directv and again wow.  The Directv 3D channels are amazing.  My daughter loves the 3D.  The magic wand remote is great. I thought you might be interested in my pros and cons.ProFantastic picture; Easy remote; 3D Wow; great price under $900ConsGlass screen can reflect lights (we use it in the basement where it is dark).Not as bright as a LCD using the 50% brightness setting (research \"burn in plasma\" on internet)Needs more internet appsFinal comment - yes, I would buy another.", "Date": "August 26, 2011"}, {"Title": "Great picture and features!", "Author": "M. Casanova", "ReviewID": "R1HYXE1WB9L0SO", "Overall": "5.0", "Content": "I received this tv and the glasses last night. There is no issue with the glasses turning off randomly. The T.V works great the motion control is really cool. I did run the update right off the bat. This is not wireless unless you purchase an additional device. If you plan to mount this on the wall you will need 4 of the 6 millimeter pan head bolts. The picture is incredible both 3d and regular. You can rent the 3d movies through Vudu on the internet for 6.99!", "Date": "July 2, 2011"}, {"Title": "I'm in love (again).", "Author": "Average Joe", "ReviewID": "RWGIIWW1JWVEQ", "Overall": "5.0", "Content": "This is my 3rd plasma TV in 3 years.  I have a Panasonic 50\" which I like and a Samsung 63\" that I love.  The picture on this LG 60PV750 (60\") looks to me to be every bit as good as my Samsung and, from what I could tell from in-store displays, as good as the Samsung models on display.With no discernable difference in picture quality between my two favorites, I chose this set for its styling.  I bought an ultra thin wall mount (from an ee b ay seller).  With some planning for cable runs and using recessed wall connections, I mounted the LG tightly to the wall.  When I was done I measured it and it only protrudes about 2 1/4 inches.  It is a very clean look which was important to my wife because we mounted this TV in a heavy traffic area of our home.  The last thing she wanted is for the kids to be running by and crash into a TV sticking out from the wall.The other reviews cover most of the things I would review.  I have had no operational problems.  The magic motion wand is cool and my kids are enthralled by the 3D.  I'll admit I'm worried that they'll break the 3D glasses because they are fairly expensive, but I've had the TV for 2 months now and so far the glasses are holding up.  My programming source is DirecTV so we have some 3D programming.  It's pretty hit and miss.  In my view, some of the programs look like the old fashioned shadow boxes with 2D images set at various depths, but some of the shows are simply amazing.  Football is pretty exciting in 3D depending on the camera angles.I installed this TV in an upstairs area with LARGE open windows directly behind the viewer and to one side.  The direct reflection from the sun was an issue for me so I installed wooden blinds on the windows.  It's not that the light washed out the picture because room brightness does not hurt the image quality.  It's just that the front glass is very reflective and will reflect almost mirror like.  I've learned that I only really use the blinds on the window directly behind the viewer.I do not use a surround sound system because this wasn't intended to replace our Samsung as our primary viewing TV.  It sounds fine for TV programming and kids movies.  My wife and I even watch HBO shows and BluRay movies on it sometimes instead of going to the family room.I got the wireless dongle because I couldn't get cat5 to the TV without major issues.  The wireless works flawlessly, but has a blue light that is too bright for my liking.  It's off to the side and behind the TV, but it can be seen if you are along the wall.  I suppose it's there so you can tell if it's working, but after a month, I put tape over the light.I use the Smart TV functions very little because I rarely want to set in front of the TV and surf the net.  I did connect this TV as a second monitor for my iMac with an HDMI cable and adaptor.  The computer is within bluetooth range of the TV so I can carry the mouse, keyboard and/or track ball to the TV and use the TV to display the family photos and videos that I have saved on the computer.  No messing with discs, video cameras, etc. And we don't need to take people into my messy home office area.  My wife really likes that.In short, its a great quality picture and the TV also has some nice value added features.  I would buy it again if I was making the decision again.UPDATE (2-9-12):  I am a member of Amazon Prime.  I just found out today that this LG model is on Amazon's list of devices so I can stream to the TV from the Amazon Prime video collection.  An unexpected bonus.", "Date": "January 31, 2012"}, {"Title": "A stunning picture", "Author": "Bruce Lautenschlager", "ReviewID": "R1CWQ7QETO98S6", "Overall": "5.0", "Content": "I won't babble on about every feature, because there is a lot of them, I just want to hit a couple of bullet points that I would have liked to seen were I considering purchase.It's a awesome picture. You cannot complain about the quality of it. I'm not necessarily impressed by the 3D features, but I've barely tried it and it is very low on my priority list until some content arrives that I am interested in (football...primetime shows...).The \"magic wand\" remote is not a gimmick, it's actually pretty convenient. It's essentially like a Wii-mote, and once you'll use it you'll understand. My cable remote does the daily duty, but when you do need the TV remote, you will learn to love this - far easier to input user names, etc. - just to name one reason.About the only 2 caveats, (for some) - the set is heavy, as almost all plasmas this size will be. If you plan to wall mount it, make sure the wall mount and wall can support the weight. Metal stud walls will almost certainly require reinforcement to be safe and secure. Also, the glare from the screen can be an issue if the room and windows and TV are not setup correctly. No issues at night - but here in sunny south Florida, with windows all around, I occasionally have to tilt the set one way or the other, and it's not an issue any longer. If that doesn't work for you, consider the room you're putting it in and the window placement and window coverings. Good blinds or curtains make it a non issue, also.Anyway, if those 2 items are manageable for you, this is a stunning TV with a ton of features for a great price. I did purchase the LG wireless USB adapter for it - I highly recommend it. I compared it to wired ethernet in the house, and saw no times where I had a wireless performance issue. Plug and play, I've never had to remove it, reinsert it, test it - it just plain works. Spend the $35 for one if you can't run a Cat 5 cable to it - it's well worth it.", "Date": "December 28, 2011"}, {"Title": "Great Tv", "Author": "Carl E Brown", "ReviewID": "RYNFH3DQL150B", "Overall": "5.0", "Content": "This set is great once I got the HD set up thought my cable provide. This set is good if the screen is farther away from the viewer at least 12 ft.  other wise picture isn't as good. 3D is great too I really was surprised.", "Date": "December 16, 2011"}, {"Title": "Awesome TV - Great 3D", "Author": "kikin49", "ReviewID": "R3SSLEKZA1CR0M", "Overall": "5.0", "Content": "I am so impresses with this TV.  The picture is great and the 3D implementation is awesome and what a deal with Amazon throwing in a couple pairs of 3D glasses.  I am glad I went with Active Shutter instead of Passive on the 3D to get the full 1080p resolution.  All Black Friday there were better deals on the 55\" Samsung/Panasonic/Sony/LG LED LCD's but I am glad I held out for this Plasma with 3D at 60\".", "Date": "December 1, 2011"}, {"Title": "Good But Not Great", "Author": "physicsGuy", "ReviewID": "RF4HPDQ3OXJ70", "Overall": "3.0", "Content": "UPDATE 2012/01/17: I finally got my 3D glasses. Guess what? You can't put the TV into 3D mode when using SmartApps like Vudu.  So Vudu offers 3D material now but you can't watch them in 3D on this TV. Way to go, LG! You really thought this through. Hoping for a firmware update from these idiots.UPDATE 2011/12/14: I am lowering the rating from 4 to 3 because the inability of the zoom to properly deal with classic letterbox of 16:9 in a 4:3 frame, or a real 4:3 frame in general without distortion, as described in detail below, is really annoying and inexcusable. it isn't rocket science. I find myself switching to an external tuner that transmits pseudo 4:3 to the TV, to watch this kind of material zoomed to fill the screen without distortion. I shouldn't have to do that.  This continues a long, sad tradition of sloppy, unthought-out software from Korean vendors LG and Samsung.UPDATE 2011/11/14: I noticed that one of the recent firmware updates took care of some of the zoom problems I discussed in my original review. A little more detail is needed now to describe what they did. The zoom now zooms in all directions in certain scenarios, so you can get rid of the bars on all 4 sides of pseudo letterboxed 16:9 material (described later).Details: It turns out the LG zoom is now a little more sophisticated. It detects whether you have real 4:3 (grey bars on side are not a part of the picture) and zooms them away if you pick zoom level 1, and zooms only a little bit vertically so you don't lose too much of the picture but theoretically reduces the distortion a bit.  In reality, the vertical zoom is so small that people still look fat. You can increase zoom level, losing some of the picture all around the edges. Doesn't fix proportions (fat people) (uses nonuniform zoom of level 1 as starting point).  [My old Toshiba has a mode where only the edges get stretched horizontally so that the main action in the center remains undistorted! LG, are you listening?]On pseudo 4:3 material (black bars on sides are part of an actual 16:9 picture, as broadcast or as sent by your set top box) or pseudo letterboxed 16:9 (black bars on all 4 sides are part of the actual picture), the zoom doesn't do anything until you go above level 1, and then it zooms uniformly in the vertical and horizontal directions (good). You can go up to level 16 which fully expands the typical pseudo letterboxed 16:9 to fill the screen without distortion. On pseudo 4:3, you are losing top and bottom picture as you get rid of the side bars, but no distortion.  Would be nice to have a no-loss but distorting option for pseudo 4:3.  [My old Toshiba allows you to apply the different scenarios yourself instead of detecting and imposing stuff automatically.]If you have true classic letterbox (16:9 broadcast for 4:3 TV set; black bars on top and bottom are part of the picture, grey bars on side are not part of the picture), then LG's scheme is problematic still.  The grey bars will go away with zoom level 1 but only a tiny bit of the black bars on top and bottom will go away, and everyone will look fat. You can increase the zoom level to get rid of the top and bottom bars, but the proportionate amount of the horizontal picture will spill out over the left and right edges (i.e., missing now), and everyone will still look fat. So LG still doesn't quite \"get it.\" It needs an option to zoom uniformly from the beginning for this scenario instead of starting with a nonuniform zoom level 1.To be honest, since I was concentrating on this last scenario in my original review, I can't be 100% certain that any of the stuff with pseudo 4:3 or pseudo letterbox is new. I think it is because I probably tried to deal with it before. But at least you have a full description of the zoom feature now.  END OF UDPATE.UPDATE 2011/11/12: I am raising my rating from 3 to 4 stars.  Maybe I am getting used to a bigger TV or maybe the frequent firmware updates are doing something (about 4 so far in two months).  The TV is acceptably sharp to me now on HD material.  I was at a friend's house looking at small figures in a football game sent by Dish Network to his Vizio 47\" LCD (about 3 years old).  On the small things like heads bobbing in a crowd or letters on uniforms when the camera is zoomed out, I'd say the Vizio has a little more \"edge\" on it.  For anything bigger than that on good HD material, I'd say this LG is about as good.One thing you should know in case you have an old analog input sound system you want to use, the LG only has optical digital out for sound output.  So you'd have to get an optical to analog audio converter (try monoprice dot com), and I'm not sure if the level is fixed or if the volume control of the TV will adjust it.  If not, you'd have to use your audio system's remote (if your old analog audio system has one).  If you use a set top box instead of the built in tuner, you could hook the analog audio out from your set top box to your sound system.  My U-verse box has analog out that is controllable by the box's remote.I bought a Belkin Conserve Smart AV power strip/surge protector that can switch off the receptacle for my non-remote audio system automatically when the TV turns off.  The TV draws little enough power when \"off\" (these new things always draw some power) to trigger the non-adjustable Belkin just fine. Also, my Logitech Harmony remote supports the LG.END OF UPDATE. Original review follows:Perhaps I've been spoiled by my CRT HDTV (Toshiba 34HFX84).  I bought that 5 years ago b/c I knew CRTs' days were numbered and they had the best picture quality.  Unfortunately that is still true today.  Although one might think that a 34\" CRT can't do justice to 1080i, everything on it looks super sharp while the new LG 50pz750 50\" plasma sometimes looks a little fuzzy on the HD material.  I can't explain why it doesn't consistently look fuzzy.  Once in a while, you get (I guess) a perfectly focused shot with a high quality HD camera and you go \"Wow!\"  But why the LG so often looks a little fuzzy when the old Toshiba CRT doesn't, I don't know.  My wife noticed it right away, too, so it isn't just me.  I have tried the LG with its built in tuner, the HD QAM tuner I use with the Toshiba, and with the HD STB from the cable company.  The results are at least consistent.  I am trying to get used to the not-always-snappy-sharp image and decide whether to return it or not.  Just in case a plasma needs a little \"burn in\" period, I am trying to keep an open mind.I know if you view a large-screen TV too close up, it can look blurrier than a smaller TV at the same distance. I corrected for that in coming to my conclusion above. I.e., I viewed the LG from an appropriate distance.Also, the CRT scales standard def much better than the LG, occasionally looking almost like HD. The LG never gets close.One irritating design flaw with the LG is that is does not have a proper zoom to deal with letterbox material.  If you receive standard def 16:9 in a 4:3 letterbox (grey bars on side where no picture gives 4:3, black bars top and bottom to crop out blank area to achieve the 16:9 within the 4:3 area) than you want to zoom in all directions to fill the screen almost uniformly w/o distortion.  But the zoom on the LG only stretches horizontally. It won't zoom vertically to essentially overscan away the black bars. So there is no way to scale up this commonly broadcast format properly.  The Toshiba has multiple zoom options for dealing with different scenarios.  This points to either laziness or a lack of understanding on LG's part as to what broadcast scenarios a user would often encounter.Some good: Nice internet apps and streaming service options.  Detects firmware updates automatically, although you have to enter the admin screen to actually download and install it.  Some useful shortcuts on the remote.  The included Magic Wand remote is much better for dealing with the cursor for pressing links and entering text in boxes. I wonder if there is a way to connect a regular keyboard. THX Bright Room mode is suitable for my not-so-bright LR without further adjustment (though I did tweak the brightness up a little more). Built in patterns for doing and storing a minor calibration yourself (Picture Wizard). Seems to have all controls in advance menu item to do an ISF calibration.Some more slightly bad:  There is no README or anything to tell you what the firmware update is supposed to do for you. Some redundancy among menu choices (e.g., picture mode changed by both picture mode menu item or AV mode menu item; latter also changes audio, with a smaller subset of video choices. Somewhat confusing and redundant.) Some common settings buried in menu (e.g., brightness and contrast; there should have been a shortcut on the remote for these). Edge enhancement makes standard def much worse (turn this off in menu, buried deep). Sharpness control, another buried item, doesn't seem to do much. Certain modes are incompatible with other settings, causing some confusion (e.g., THX video mode will turn off energy savings and will change aspect ratio to \"Just Scan\" from whatever you had it set to. Mysteriously, you can change it back to 16:9, 4:3 or whatever and then Just Scan is greyed out. Maybe it will change it back to Just Scan after on/off? Seems like a bug to me.). Some buttons on remote are very close together (e.g., hitting up arrow will sometimes hit the home button instead). Remote is not universal. Remote backlight is not automatic. You have to press a button to turn on the backlight.I did not purchase the 3d active glasses yet. So I have not tried out the 3d or 2d-to-3d features.I bought this for $850 from Paul's TV, fulfilled by Amazon with free SuperSaver shipping..  Went up by $50 next day, so price seems to fluctuate. Should have asked for an Amazon price match (was $1150) so that I could have bought it directly from Amazon.", "Date": "September 21, 2011"}, {"Title": "WiFi Connection uses ONLY proprietary LG connector", "Author": "donnak", "ReviewID": "ROMI42BO9HYQ4", "Overall": "4.0", "Content": "I purchased the NETGEAR Universal WiFi Internet Adapter (WNCE 2001) to use with our LG TV (specifically LG 60PZ750 - 60\" plasma 3D). I was hoping to purchase something I could use with our 2 Panasonic Blu Ray players and our Samsung TV besides the LG TV. All worked except the LG. It simply doesn't work. Netgear support suggested I call LG. LG support said only their proprietary WiFi connector would work but suggested I call Netgear! Bottom line, it works fabulously with anything except an LG TV.Other than this the LG TV performs flawlessly!", "Date": "August 18, 2011"}, {"Title": "Just what I wanted", "Author": "JK", "ReviewID": "R130DSF92M21RH", "Overall": "5.0", "Content": "Now that I have had this tv for a couple weeks, I feel it is time to post a review.  I agree with many of the reviewers that you must play with the settings to get the image just right.... for YOUR EYES.  I'm not going to dock this tv due to very poor user guide - that is not that what I would consider a true review of the tv's performance.  I'm not going to pretend I'm an expert with home theater so I will post some of the things I figured out on my own that help the image quality.  First of all, turn off the energy saver.  I used a \"WOW\" blu-ray disc to help me set the over-all image and learn about what some of the settings actually do.  My blu ray and direct tv box run via hdmi into an onkyo receiver, then to the tv.  I figured out that I had the receive adjusting the picture.  I could not figure out why the grass on golf or football looked so blurry during action.  Once I set my receiver to \"pass thru\" it correct this problem.  The 2d to 3d setting is not like a true 3d source, but does give the picture some extra depth.  I see some lag from direct tv source but never from blu rays.  The lag I see depends on the channel and the colors involved.  If color is over saturated, then a little ghosting appears.  I'm going to say that is about the source quality and not the tv.  The 3d looks so cool!!  I found the if we sit a little closer, a few feet closer, the effect gets better.  Really, in my opinion, you would want a very large screen to get the best 3d results from home.  The menu and settings seem easy enough to get to and use.  The 3d glasses have not, up to this point, ever disconnected while watching a movie.  I could not however, watch more then one movie with the glasses on. Although you can not perceive the flicker in active 3d glasses, I still feel my eyes \"see\" it, thus wear out my eyes after a while.  this is not about lg technology but the over all process for all active glasses.  The image quality is great in 3d.  Just watched Tron 3d and all I can say is wow!!!  I spent a lot of time going back and forth between led and plasma.  I do not like the \"soap opera\" feel of led tv's.  This tv has a film mode to help in juttering.  With this on, you get a very small amount of the \"soap opera\" feel - which is PERFECT for me.  The image does not look over processed as some of the \"higher end\" tv's.  The color is very vivid and realistic.  Again, this is my eyes and you can only judge based on your eyes.  Please be aware that the HDMI imputs are on the far left of the tv.  Not the best spot based on my set up but could be good for someone else.  Seems a bit strange to put them here instead of the middle of the tv.All and all this is a great tv.  I'm not going to say \"great tv for the money\"..... this seems to be a knock in my opinion.  It is a great tv and worth everyone penny.", "Date": "January 1, 2012"}, {"Title": "TV died 3 months after 2 year warranty ended... No video only sound", "Author": "Happy Camper \"Happy Camper\"", "ReviewID": "R11IRXIUAMA64T", "Overall": "1.0", "Content": "Exactly 2 yrs 3 months from date of purchase... 20 minutes ago this TV died cold and dead. No picture only sound remains... I'm furious! Just researched this issue and it seems that a great deal of LG plasma TV's are dying within a few months after warranty ends... Don't think yours will be different. I'm done with LG for life... My lifetime.Signed \"Very DISSATISFIED Customer\".", "Date": "November 22, 2013"}, {"Title": "Black band", "Author": "HWAG", "ReviewID": "R39OCJX4NK355O", "Overall": "1.0", "Content": "I loved this TV until it began to display a black vertical band about 2\" wide, slightly left of center. This makes the TV unwatchable.  This problem began to manifest itself shortly after I had the TV for two years--just beyond the warranty period.  LG has been unhelpful so far. (And they have the worst customer service interface I have ever seen. It's almost as if they want to frustrate you sufficiently that you stop trying to contact them.)  Maybe I will give Panasonic a try.  I certainly won't be giving LG any more business.", "Date": "July 4, 2013"}, {"Title": "Great Flat Screen", "Author": "Carl Leroy Harrold \"Weird Harold\"", "ReviewID": "R3GLJ78EUDJG2L", "Overall": "5.0", "Content": "Great TV at a GREAT price with Great viewing Sound is good and picture quality is great 3D is Great too", "Date": "May 31, 2013"}, {"Title": "Very nice", "Author": "Joseph Ridenour", "ReviewID": "R1GONFR4SIE0G4", "Overall": "5.0", "Content": "So far we love our TV! Though when we first got it, the streaming stuff was worthless. They have since patched the software and it runs Hulu, amazon, Netflix and Youtube just fine now. It is nice to not need to power up the PS3 to stream stuff. The tv has been doing it's job well. Nice picture. Very happy with this purchase.", "Date": "February 13, 2013"}, {"Title": "Great tv.", "Author": "E. Bowden", "ReviewID": "R3GY6DPYBR8M6G", "Overall": "5.0", "Content": "Best tv I've bought in years.  Quality of picture on tv is amazing.  No complaints what so ever.  Very happy.", "Date": "December 18, 2012"}, {"Title": "Amazing", "Author": "Jwake", "ReviewID": "R28FN33YRM9PR4", "Overall": "5.0", "Content": "This is an amazing T.V. Everyone that comes over is absolutely amazed by it and two friends are even getting there own after seeing this one.  Upgraded from a 42 inch HDTV and the first time I turned on my PS3 with this T.V. the graphics jump was as if a next gen system came out.  You will not be disappointed by this T.V.!", "Date": "February 19, 2012"}, {"Title": "Superb 3D Action!!!! Its amazing", "Author": "AAAAT|G", "ReviewID": "R2INBA4IXFRSPQ", "Overall": "5.0", "Content": "TV is really cool.  I have a Vizio 3D TV also.  The LG 3D is WAY BETTER.  Very realistic and kind of creepy actually.  The magic wand remote is cool, and you can play Soduku on this TV, and download games!  The color is great once i turned off eco mode which is factory set for some dumb reason.  The black levels however are not as good my Vizio 3D TV, also the blu ray motion is not quite as good as the Vizio, but the 3D makes up for it.  Great TV.", "Date": "November 30, 2011"}, {"Title": "LG Infinia 60PZ750", "Author": "D Cagley", "ReviewID": "R2TKKUCU7QT936", "Overall": "5.0", "Content": "My wife and I Absolutely love this TV.  Awesome picture, great features, the 3D mode on this television is great along with the 3D glasses.  Overall look of the television is clean, very skinny, hugs the wall nicely.  The price is worth the television.  Internet ready, 3 HDMI ports, video cable ports.  Awesome!!!", "Date": "November 30, 2011"}, {"Title": "Love this TV", "Author": "danewell", "ReviewID": "R111LORN2DL80R", "Overall": "5.0", "Content": "I am extremely happy with the TV. The delivery guys even help me set it up, since it is a huge TV and I am new to my area.  My buddies came up last weekend to hang out and they are a little upset that they spent twice as much on other and their picture isn't as good or has as many features. The only thing that is missing is Pandora, but its not a huge issue since I can run that through the PS3.", "Date": "November 30, 2011"}, {"Title": "This TV is magnificent!", "Author": "Oleksiy Kolisnychenko", "ReviewID": "R2QWNCMEY67EP4", "Overall": "5.0", "Content": "This is my first TV in years - 60\" screen is huge and gorgeous. Picture quality is great, amount of features is just right and design is beautiful.I was worried about delivery (Northern NJ) by Pilot. It was timely and painless: two-person crew arrived on time and did what they needed to do.", "Date": "October 8, 2011"}, {"Title": "Real Bad Service", "Author": "Sharon C. Teal", "ReviewID": "RI3TUWRKF4SJE", "Overall": "1.0", "Content": "It has been six weeks ( plus) and still not repaired.  Two service visits (each10 days after part arrives).  They never have parts with them.  They come, test, order part an then when it gets here, give them a call.  Oh shucks, 10 days for next available appointment.  Repairman shows up, oh shucks, part didn't  fix it.  Next part ordered.  Call us when it gets here.  5 days later...call to service... \"part here, please come.\". Oh shucks, 10 days before we can come back,  guess what...part not the fix.  OMG!!!  Still waiting.  No t.v. To watch.  LG service the absolute worst in the history of service.", "Date": "December 15, 2011"}, {"Title": "Great At First", "Author": "Sweeeeeet", "ReviewID": "RIH02HB88VT6D", "Overall": "1.0", "Content": "This TV was awesome at first, after the first 100 hours of the so called \"Break in\" period, the tv started to flash black as if i was changing to a different input. It would flash black between every 5-10mins of watching anything. Having it replaced as we speak. The 3D is also amazing, but with this issue, I'm not sure if i'll be getting the exact same tv. sucks though because i actually liked the tv.P.S It sucks as far as shooter's and fighting games go. too much input lag. Hope this helps anyone looking to make up their mind on purchasing this tv..", "Date": "December 12, 2011"}, {"Title": "Paid a lot , got a little!", "Author": "Kim Miller", "ReviewID": "R1HRCQ0H1UN1V1", "Overall": "1.0", "Content": "The speakers are out on this TV 1 year after purchasing! We spent a good bit trying to get a great name brand TV and the best quality and have ended up wasting our money!", "Date": "December 26, 2012"}, {"Title": "Excellent TV", "Author": "PWB", "ReviewID": "R1Y4STDM4SEKMB", "Overall": "5.0", "Content": "Have had this television for nearly a month.  Was not looking to make this purchase but really had no choice with the black Friday discount that was offered. The setup was very simple.  Make sure you order the dongle as well to enjoy the \"smart\" TV benefits.  I like to be green as much as the next guy but the first thing you should do as the others have said is to turn the energy save feature off.  The picture bursts with lively color once it is off.  The 1080p picture is very crisp.  Comes loaded with a bunch of excellent movie/entertainment apps such as Netflix, Amazon Instant Video, Vudu, Cinema Now, facebook, twitter, youtube and a web browser among others. Does not have Pandora which is weird but you can fill this void with your smart 3d blu ray player.  Setting up and transferring your accounts on this TV was very simple.I had no interest in 3d but again, the price on Black Friday demanded that I not quibble with extra features that I didn't care for.  I must say the 3d picture is excellent, much better than I ever expected and my kids think I am a hero for it.  Directv has 3-4 24/7 3d movie networks as well as ESPN 3d.  The 3d is unbelievable good on those channels.  You can make any channel 3d-ish with a push of a button on the remote.  While it does produce a 3d \"effect\", it really does not compare to the 3d experience on a true 3d channel or from a 3d blu-ray disc.  It is an active 3d so count on 75 bucks a pair for active 3d glasses.  LG has been running a special that provided 2 pair free with the purchase.  They will turn off after about 10 minutes if you are essentially sitting still and that is easy to do.  Simply push the button and you are back in business.  You will be inconvenienced for about 2 seconds.  Not a big deal at all.The TV comes with 2 remotes including a Magic Motion remote that works like a Wii remote.  Very handy when trying to enter the title of a movie in a search field.  This is the first piece of what I hope will be a very nice home theater system.  It is loaded with all of the inputs necessary for a top end system. Based on my experience, I couldn't been happier with the purchase on this product.", "Date": "January 9, 2012"}, {"Title": "LG Infinia 60PZ750", "Author": "Tarzan", "ReviewID": "R2V7RHMZC2I2PW", "Overall": "5.0", "Content": "Delivery was Quick, smooth and the guys very helpful (uncrated item and asked if they can set it up for me).Installed TV on a Rack mount without any issues.Connected to AV receiver, blue-ray player, PS3 and HTPC. Tested out unit excessively with all kinds of formats and signals even 3d blue-rays, 2d to 3d conversion the past weeks: All I can say so far \"WOW\" how brilliant it is and 3D rocks. Would buy it anytime again. Also thank you Amazon for your perfect service....", "Date": "December 27, 2011"}, {"Title": "Oh My Gosh !", "Author": "Signmakerman", "ReviewID": "R249V21OSS3QZF", "Overall": "5.0", "Content": "I waited until a 12-year-old rear projection TV blew up before ordering a new TV. This unit is what I got to replace it.SUMMARY:I have never seen a picture with this quality anywhere. I have been in local television station control rooms and they can't even touch this.GOOD THINGS:I said I would never buy a plasma, but I was wrong to think that. The depth of color is incredible. HD movies and sports are real-life.Amazon had it to my door in three business days without a problem.Setup was easy.Internet movies stream without a problem of any sort.Games are perfect.The size makes you feel like you are in a theatre. 60 inches is not too large!ONE BAD THING:The speakers are OK. The sound comes out the back and I admit I didn't buy this for the sound. However, add an external speaker and you are in business. A great speaker is cheap.CONCLUSION:I totally love this TV. The 4-year service plan offered by Amazon for under $200 is a bargain too.", "Date": "December 12, 2011"}, {"Title": "Great TV set", "Author": "Luis Calderon Leon", "ReviewID": "R30OFF2NM6RTJ0", "Overall": "5.0", "Content": "Great TV, if intelillent sensor is activated can be a bit dark, but in THX modes is brilliant... It was cheap too.", "Date": "November 12, 2011"}, {"Title": "Bad HDMI  connection?", "Author": "IkeTech", "ReviewID": "R1TT0ZDZUCVNIJ", "Overall": "3.0", "Content": "On my new 50PZ750 there is a problem with the HDMI cable connection between the cable box and TV, picture flashes on and off and sometimes the there is no sound, all starts while changing channels, changed to a high speed HDMI cable and different cable box, same problem.", "Date": "August 6, 2011"}, {"Title": "Good TV for non-Videophile", "Author": "dazelmer", "ReviewID": "R24XAEUB5R69DX", "Overall": "4.0", "Content": "Pros:  Large screen, bright display, 4 HDMI inputs with ARC, Computer VGA input, Digital Audio Out, Network Connection, screen resolutionCons: Display ratio is taller than most widescreen movies leaving black bars, HDMI video inputs require audio through HDMI also, Heavy, power consumption, Burn in.Simple background:  I received this TV in August of 2011 (just in time for football) and now it is mid February.  Having used it for over 5 months I feel that I can now give a proper review.Speakers:  For the first 4 months I used the TV speakers for all my video sources (computer, blu-ray, and cable provider).  The speakers are decent.  You can hear the people talking and hear all the important sounds but they are nothing compared to having an actual speaker system.Inputs:  As the information states, this tv has 4 HDMI, coaxial, VGA, component, composite, and ethernet inputs.  The onscreen input selector doesn't allow you to provide useful names for than HDMI 1, HDMI 2, VGA etc, which is unfortunate, but the image can be changed.  This doesn't seem like that big of a deal, but I guess if you have all the inputs full it might get difficult.  The display does tell you which devices arise on and which are off, that is the most helpful part.Network Connection:  There seems to always be a firmware update to this tv.  That gets annoying fast, especially since I never see any direct reason for the update.  I have occasionally used Netflix on the TV and it has a pretty decent interface. Searching is simple.  I haven't used any other web interfaces on the TV, but that's not the TV's fault, it is because my DVD player was already configured for the internet and I'm lazy and didn't want to set up a new device.Display:  The image is sharp, the colors are good, and it is quite large.  I live in Seattle so I don't worry too much about ambient light ruining the picture.  Blu-ray movies look spectacular on this TV, as do any digital or HD signals from the cable company.  One downside to the display is that it is not the same aspect ratio as widescreen movies, so you will still have black bars on the top and bottom.  Another downside is the common Plasma problem of burn-in.  Using my computer for video input leaves a solid bar on the bottom of the screen and if it is left on for more than an hour the bar stays there when I change back to cable inputs.  However, the ghosting quickly goes away with a new input.  After 6 months there are still no permanent ghost images.Other:  flipping through digital and analog channels is annoying.  The channels do not go sequentially (3, 3-DT, 3-HD, 4, 5, 5-DT) instead it does all the analog signals first then the Digital and HD signals.  If you have a cable box this wont matter, but if, like me, you just connect to the antenna then you will notice this problem especially if some of your favorite channels send a digital signal and others don't.  In Seattle with no comcast TV service you get Discovery and Joe TV analog signals, but Fox, CBS, and ABC have digital signals so typing in the channel number works best.3D:  I have no experience with the 3DRecommendation:  This is a great TV and I love it and am happy I bought it, but with how prices have changed in the last 6 months I now recommend an LED backlit display over this.", "Date": "February 19, 2012"}, {"Title": "Very Nice", "Author": "Greg Shivers", "ReviewID": "R22XWX6QN4Y15G", "Overall": "4.0", "Content": "I am loving this TV so far. I have it connected to a PC outputting 1080p video and 3d during games and movies. Everything has looked wonderful.I also love that it has Netflix and Amazon built into it. The vudu app is also really nice but the 3d movies do not work correctly. If LG would update the software to allow 3d within Vudu and other apps then I would not have a single problem with this tv.Oh and just a word for when you order it. This think weighs around 150-200 pounds due to the glass front. Make sure you have a few people to help you move it around.", "Date": "January 5, 2012"}, {"Title": "Awesome Picture!! Great Price!!", "Author": "Tim", "ReviewID": "R3GWPF7NEH7MP9", "Overall": "5.0", "Content": "Purchased TV right before Christmas and am very pleased with the picture. Brillant colors and black levels. The only complaint I would have would be the battery operated 3d glasses, shuts off with no movement within 10 minutes. But for the price I would say it is a great TV.", "Date": "January 2, 2012"}, {"Title": "LG Infinia 60PZ750", "Author": "Tresa Echlin", "ReviewID": "R2BOXVXPHCRKMZ", "Overall": "5.0", "Content": "The TV arrived right on time, excellent condition, and works surperbly!  The only thing was getting the screws which came with the TV to fit properly.  There was paint on the threads and it was a bear getting them in correctly so we could mount the TV on the wall.  Otherwise, an excellent purchase, an excellent TV, and we get a lot of compliments on the picture quality!  I would definitely recommend this TV to family and friends!", "Date": "December 30, 2011"}, {"Title": "Excellent for online content", "Author": "Mike", "ReviewID": "R3KX696WBUFLG3", "Overall": "5.0", "Content": "The picture is great, but the online content really stands out. The motion remote works perfectly like a wii remote for the web browser, among other features, and it's very easy to access things like Netflix. The picture wizard also works excellently, it walks you through different settings asking you to make adjustments and figuring out your preference. It made the color, brightness, etc. just the way I like it. The only con is it does heat up quite a bit, and it makes an electronic buzzing noise at times (but you really can't hear it with normal volume level). It's my first plasma so I'm assuming these things are normal for a plasma.Normally I wouldn't buy anything but Sony for a television, but this LG has been very satisfying, if that says anything about it.", "Date": "November 10, 2011"}, {"Title": "LG", "Author": "cp", "ReviewID": "R3O890CTCTV7ZB", "Overall": "5.0", "Content": "Recent purchase. It was delivered as promised and it was very easy to set up and use. The 3D feature was a plus.", "Date": "October 31, 2011"}, {"Title": "woooooooo  weeeeeeee", "Author": "dino30127", "ReviewID": "R1WTQ21DFH5OE0", "Overall": "5.0", "Content": "well i can give yall one word great just order the 3D glasses and wi fi duggle cant wait woooooo weeeeee", "Date": "October 26, 2011"}, {"Title": "Awesome TV", "Author": "AMF", "ReviewID": "R1PD1UAES30PZ", "Overall": "4.0", "Content": "Love this tv.  The picture quality is fantastic.  The smart tv functions are great. The 3d is awesome but the refresh rate seems to give me a headache, passive 3d doesn't seem to effect me the same way.  Money well spent.  Love The Stuff!!!", "Date": "November 21, 2011"}, {"Title": "Awesome TV without awesome price.", "Author": "Tadeo C Ditico", "ReviewID": "REF1B7XDCK6R3", "Overall": "5.0", "Content": "This TV is excellent in 2D or 3D. I'm glad I bought this TV instead of samsung or panasonic which are both cost way too much.", "Date": "June 18, 2011"}, {"Title": "Don't know about this one", "Author": "D. Grenier \"Mainer\"", "ReviewID": "RIAV4HP7513LL", "Overall": "1.0", "Content": "Can't give this a recommendation because the TV kept shutting off after a few seconds.  Had to return it.  Purchased a Samsung instead.", "Date": "January 10, 2012"}, {"Title": "Best Tv I've Ever Owned!", "Author": "Jess", "ReviewID": "RHBDEIL74KS8O", "Overall": "5.0", "Content": "I have not recieved this set yet but am definiatly looking forward to. I ordered it today, july 9th. During a promotional period where you get savings until july 9th at midnight from amazon. Plus the free two pairs of 3d glasses until july 30th, with free shipping on everything. I ended up paying 999.30 for the tv and got the two pairs of 3d glasses for free. I ended up saving almost 950$ on this set, glasses, and shipping. I will update my review once i recieve this set.UPDATE - 10/30/11So Its been about 4 months and almost 900 hours later, and all that I can say is I'm Totally impressed by this Television.I'll go into further detail.Picture Quality Etc.-----------After gazing at my set for almost 900 hours i can say i'm impressed, not only by the vibrancy of the picture but the consistency in the display and Contrast ratio which is about x 1 million then my previous lcd set. Many people get confused about what technology they should buy, led, lcd, plasma, basically all higher end models included led tvs which use either edge lighted led  basically what the name implies, the leds are placed on the edge of the screen then special filters and reflectors inside the display panel evenly distribute the light), then theres fully local dimming led tvs that have blocks of leds on the back of the display that brighten/ dim depending on the picture on the screen that will allow a overall better picture quality compared to edge lit and lcd tvs. Earlier sets of local dimming led TV's often had light blooming  uneven lighting on the display that led to light leaking into light or dark scenes) but as the technology aged and they worked out the troubles newer leds don't often have these issues, and then we have plasma technology that uses a phosphor based pixel system that independently gives different charges of current to each pixel allowing for better black levels and colors as the pixel can turn off or block light, (lcd or liquid crystal displays often have trouble with this because they have a twisting structure that changes depending on the current of the input video source  so they cant fully block light hence their poor black levels and contrast ratios) , Plasmas tend to offer bigger pictures for a lower price then thier main competitors leds  but they still offer great picture quality for the price, and lcd tvs that use a florescent back light are becoming cheaper as leds are moving mainstream. Then it comes down to refresh rate, and all the gimmicks that TV manufactures like to throw in. The highest refresh rate at the moment offered on led tvs is 480hz, To achieve this they use a scanning back light, a processor that duplicates frames to add extra frames to the picture to make the motion smoother. While plasma technology I believe offers 600hz sub frame technology which is better at least by my eyes and doesn't have that artificial look that 120-240-480hz led/lcd tvs often tend to have, also called the soap opera look. Viewing angel wise, plasmas is the ruler in this category, why? because plasmas create their own light, they don't rely on a back light that can cause light bleed and light unevenness if you stand off center, Plasmas tvs are so good infact that you could basically view the tvs all the way to the side until you lose picture with the same quality and brightness as you would standing directly in front of the tv. This LG PZ750 has excellent viewing angles vertically and horizontally which is important if you plan on hanging this tv on a wall or are in a wide room. Also the black levels are very good, compared to lcds and even some higher end led sets from Samsung and other brands. Color reproduction tends to be very lifelike and accurate if correctly calibrated, even the built in picture adjustments work very good. Many people also complain about glare on plasma tvs let me confirm to you future buyer that this tv is not bad at all, its better then some led tvs and alot other plasma tvs out there, if you have major open windows all around the tv then it might be alittle annoying at times but if you just have a light in fron of the set its not distracting at all.PICTURE ADJUSTMENTS----If your're the type of person that loves to customize the picture of your displays then this tv is for you, Almost everything you could imagine for a professional calibrator could be found in the built in picture adjustment menu. There some included picture presets that work very good, the two I use most are THX Bright Room and THX Cinema for bright room viewing and night time movie viewing, both offer realistic color temperatures, brightness and clarity you would expect from a high end TV.Sound Quality----So you make a tv thinner and thinner, where does that leave room for speakers? Not much, most tvs tend to have extremely tinny bass less sound, Well just let me say that these speakers have none of that and impressed me for how thin this Tv is, The speakers are down firing from the bottom of the tv and appear to be oval speakers about 5 inches long on each side, the sound quality from them is more than adequate for movie viewing, music listening, and video gaming.  This tv also includes, 3d stereo surround, Clear voice which tries to make dialogue louder. Auto volume which cuts down on the nauseating blaring commercials for your local lawyer or family business. But if you absolutely need to run out and buy a surround sound system this TV does output up to 7.1 hd surround sound through the optical connection on the back of the set.Design---When I first received this TV I was totally impressed by the design, It looks like a expensive piece of machinery hanging on your wall, the Black frame with the blue accent is very eye catching when the room is lit. The frame is also very thin and is also flat to the body of the tv which LG calls edge to edge compared to other tvs out there that tend to draw your eyes away to the frame that is bulging out and doesn't stick flush, this tv looks very classy and modern at the same time. Remember when plasma tvs always use to be thicker then their competitors lcds, not anymore. This tv is very thin for a plasma tv, that some people might think its a led  please correct them (:Software-----Median enthusiasts, this is the TV for you!Like streaming media like Netflix, Hulu, Amazon Prime, and many others? This TV has them all and implements that very well in the home screen, which you can choose from a variety of internet streaming applications that is always updating  did I mention this TV receives updates to ensure you that your tv is always up to date and any issues are resolved)You also have dlna capabilities which is great if you have a cell phone or network sharing. You also have built in YouTube, and web browser which unfortunately doesn't do flash content :( and much much more.3d content---I received two pairs of 3d glasses, all I can say is WOW! the 3d picture is amazing, no cross talk or ghosting at all in many of the different 3d videos on YouTube plus movies including Bolt! 3d and Toy Story 3d. The picture may not be that bright compared to some super bright led screens but its still very excellent. The active shutter glasses are very excellent and comfortable to wear, they don't give me headaches or anybody else that has tried out the tv. If you want a tv with a solid 3D viewing experience this Tv would also be a very good choice.Ok so I'm going to leave my review there, If you have any questions just comment and I will be glad to answer any technical/support questions you may have.", "Date": "July 9, 2011"}], "ProductInfo": {"Price": "$1,399.99", "Features": "Bring your content alive with full 1080p HD 3D technology\nTHX 3D Display certified ensuring you're bringing an uncompromised 3D HD experience home\nSmart TV allows you to access limitless content, thousands of movies, customizable apps, videos and the best of the web all organized in a simple to use interface\nThe 600Hz Sub Field Driving virtually eliminates motion blur", "Name": "LG Infinia 50PZ750 50-Inch 1080p 600 Hz Active 3D THX Certified Plasma HDTV with Smart TV (2011 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/51pLDIVKq6L._SX300_.jpg", "ProductID": "B004LFCYRM"}}