{"Reviews": [{"Title": "Better than your ordinary TV!", "Author": "CMack", "ReviewID": "R35CQQVICRC9MB", "Overall": "5.0", "Content": "This TV is great! There are some mixed reviews out on the internet about this TV but the reality is, most TV's can not do what this TV can. There are some limitations to what the TV can do and some down side to the actual specifications of the TV but the positives out way the negatives by a lot. I will start with the negatives:The first major negative for me is that the TV is only 60 Hz. While this is lower than most TV's out there this size, you can hardly notice a difference. The second major negative is that the TV's processor is also a little weak and causes the TV to lag a little when loading an application. Because of the slower processor speed the TV is not very good for playing video games online but can still work fine for games in regular story mode (Offline). The third major negative about this TV is the fact that some websites block the TV from gaining access to their site. Most of the websites that do this are working on special deals or have already made deals with Sony or Google and only a few websites actually block the TV. The fourth negative for me was that fact that this TV uses an Audio Optical Cable out in order to hook up surround sound which meant I needed to buy a new receiver because my old one did not have an Audio Optical Cable IN.Now for the positive features of this product: The first major positive feature of this TV is the fact that it self updates, meaning every so often new software is available that makes it better or easier to use. As of right now each Google TV product should be running Android Honeycomb 3.1 or higher. With The newest software update you have full access to Apps, Widgets, and every feature Android tablets are capable of doing (Except a touch screen) all on your large screen TV. The second major positive feature is Internet access on its own or at the same time you're watching TV! There are not many other TV's on the market that have a full Internet browser! The third major positive feature is instant movie/TV show rentals/streaming on your TV. No longer do you need to watch Netflix, Amazon, or HBOGO movies (or any other streaming service) on your laptop/desktop or third party device like a PS3, you can just watch it on your TV. The fourth is HD upscale; this TV can upscale a picture or movie that is being displayed in a lower resolution to 1080, which is nice if you have a bunch of standard definition DVD's at home that you like to watch. Another cool feature that I have not tested out myself but have heard about is a TV web cam (If anyone has tried this please leave a comment bellow letting me know how it works.)Some of the other features about this TV worth mentioning are a universal remote that is functional and easy to use. Note: the mouse on the remote isn't the best but it's not the primary source of maneuvering around on this product. The TV also has multiple USB ports, remote streaming from your phone or computer and an application that turns your smart phone into a remote control! One of the coolest features I like about the TV is Google itself. I use a lot of the features Google offers online like, Google Drive, the calendar, and chat (have not tried video), along with Facebook/Google+ and other websites that I can access right on the TV. This is a Great TV and is worth checking out for yourself!*If you think you want to try the Google TV out but don't want to pay all the money for a new TV you might want to check out the Sony NSZ-GT1 Wi-Fi-Enabled 1080p Blu-ray Disc Player Featuring Google TV! Its a blu-ray and all of the features of the TV in a nice looking box that cost around $200.00. I Also have one of these hooked up to a Samsung plasma in my living room and it rocks! Google TV is now available on LG's new LED TV. LG offers a updated processor and faster refresh rate, making it a much faster, thinner TV worth looking at!", "Date": "February 15, 2011"}, {"Title": "Excellent device, with a few flaws...", "Author": "johnnycab", "ReviewID": "R386GI1IMMFE3I", "Overall": "4.0", "Content": "I wanted a TV for gaming and video-on-demand (particularly Amazon). I haven't had cable TV in years and get all my media from the internet, so the idea of having a non-internet-connected TV seemed ludicrous.When I began researching TVs I was astonished to find there are basically no televisions that have WiFi and full internet connectivity. And even the XBox 360 I'm buying is crippled by Microsoft so that web browsing is difficult or impossible.I really like the form-factor of the remote. I considered the Logitech GoogleTV offering but their mini-keyboard approach seemed inferior compared to Sony's game-controller-style remote. My major problem at the moment is the optical trackpad / thumbpad DOES NOT WORK! When I click it the cursor appears, and occasionally it will respond and move across the screen, but 9 times out of 10 it is completely unresponsive. All the other keys work flawlessly so it doesn't seem to be a signal problem. Perhaps the remote is defective, but I sure don't want to return this TV just to get a functioning remote. Current workaround is plugging in a wireless USB mouse which works perfectly but is inconvenient.Setup was easy; however, the mounting brackets on the TV did not slide fully onto the stand, preventing me from putting in the mounting screws. No amount of force/jiggling would allow it to slide fully on, but it's on well enough to stay.Documentation is sparse and I had to search the web to figure out how to add/delete bookmarks and the like. Still if you can get around an Android phone you should have no problem with this TV; it is essentially an Android device with a very large screen and a custom UI.I would say if you have a decent TV already, go with the Logitech box (or the Sony one if you happen to want a BluRay player). But if you're upgrading to a new screen and are happy with the 40\" (or 46\") screen size this unit is a good way to go. Part of the reason I didn't want a separate box is that I expect Android/GoogleTV will be built into most televisions within a couple of years...if consumers get to choose between a dumb standalone box or a WiFi-connected fully internet-ready device, which do you think they'll pick?", "Date": "March 6, 2011"}, {"Title": "Input lag, read update at bottom (Will not work with PS3, XBOX360, Wii)", "Author": "D. Maxon", "ReviewID": "R3EM5A8XWMVYMO", "Overall": "1.0", "Content": "I spent a long time shopping for a new TV and turned down a bunch because I wanted something cheaper. Once I saw everything Google TV had to offer, I ended up deciding to spend more.Picture: I have seen some complaints about the picture quality but have not had the same feelings myself. I am in love with audio and good sound, an audiophile, but not a big \"Nice picture\" kinda guy. That being said the picture quality seems awesome. Watching Planet Earth in 1080 was amazing and Disney animated movies (Like Toy Story, Shrek) look fantastic. My daughter is mesmerized with the picture on these movies. As I am sure a lot of you are aware of, the picture quality of a Blu-ray depends a lot on the movie itself so there are some movies (Like Napoleon Dynamite) that do not look the best and leave you feeling ripped off if you paid too much. I like to use Toy Story 2 as a good test of picture quality because it is not made to have that \"fuzzy\" theater look and is very colorful. Toy Story 2 looks AMAZING! The one complaint that I think has a little merit is the depth of the blacks in films. But it is such a minor problem that I have to point it out to people to make them notice. Maybe \"problem\" wouldn't even be the right word, it just could be better. Its not like this TV is made with an AMOLED screen, the blacks are back-lit and therefore not perfectly dark.Hardware: The TV itself seems built pretty well. Along with the HDMI jacks there is an optical audio out that makes me very happy. Unlike my last Sony TV, this set turns the built in speakers off when external audio is connected. On top of that the software allows you to disable the TV sound altogether (When you press volume on the TV it says its disabled) and that is perfect for me because I have a great home theater setup and feel the TV speakers are useless (For me, an amateur audiophile) The included stand on the TV could be better, but its nice and sturdy and gets the job done.Software and Google TV: This was the strong point and weak point for me.  First of all having Google TV built in is a very useful and impressive feature. The other options for Google TV require external devices that just can't do what a built in version can. My wife and I love being able to access our TV applications and channel line-up and still have the show we were watching in the corner. The applications allow you to watch Netflix and more and includes Google Chrome for web browsing. The web browsing is just about as good and fast as my home PC. The people that complained about the speed must have been using wireless. Since I stream a lot of movies it is important for me to be able to connect my Ethernet cable right to the TV. The built in processor (1.6 GHz Atom) seems to be able to handle web browsing without breaking a sweat.The downside for the Google TV is the lack of an Android market (For those of you that don't know, Google TV runs on Android). It seems there is so much more that this TV is capable of that it doesn't do. For this reason and this reason alone I gave it 4 instead of 5 stars.Google makes the promise that the Android market will be available for this TV this year (2011) and if it was any company other than Google, I would have waited. But Google is usually pretty good about following through with their plans so I took the leap and purchased this TV even with this problem. Once they open the Android market I foresee a lot of possibilities opening up.Don't let me down Google!***Update6.13***I don't play much video games and don't own any consoles but found that after connecting my computer to the TV there was an input lag (Also a lag with Wii, PS3, XBOX360, Etc). I wanted to play one of my first person shooters on the TV instead of my monitor. I found there was enough of an input lag to get in the way. I contacted Sony about this and got this response:Spencer_ > Users may experience a slight lag or delay in response time when connecting the Internet TV device to a game console.Spencer_ > This is a natural result of the advanced processing circuitry in the Internet TV device.Spencer_ > This is normal operation.Advanced processing makes my TV have a lag? More like poor design. They could have at least apologized and said they were working to fix it. This TV has been great otherwise, but this is a joke and their poor response, unwillingness to try to fix it, and lack of information about the input lag before buying this TV makes them go from 4 stars to 1.Shame on Sony.", "Date": "April 9, 2011"}, {"Title": "you put your tv in my computer...your computer is in my tv", "Author": "Animals R Friends", "ReviewID": "RYQ4YPJRT6H0X", "Overall": "5.0", "Content": "We have been waiting years for just the right tv. I bought this sony googletv to replace my 20\" sony tube tv (yep you heard me right 20\") that I bought 14 years ago and was still going strong. So I dont have much to compare with as far as picture quality or sound or internet. I was blown away by the picture (when I finally got it hooked up) and the sound is nothing short of amazing when hooked up through my receiver. I actually heard lines in movies I have never heard before. Only complaint you cant watch hulu or some online shows through the network website. Closed Caption does not work through tv must set up with your cable box instead. Love the picture in picture. Beautiful people arent as beautiful in HD.", "Date": "December 7, 2010"}, {"Title": "Best Purchase for Disabled Person Stuck in Bed", "Author": "Carl Franklin \"Author and Professor\"", "ReviewID": "R2LN33KSTTVE2T", "Overall": "5.0", "Content": "I'm writing this review primarily for folks who may be limited in their mobility and are looking for ways to maybe improve their quality of life just a little. In my case, I bought the TV for a master bedroom. I purchased the 40\" model because it would insure enough room to be able to watch TV and work on the internet at the same time. This is a very important issue, especially for someone with limited mobility. Before, my wife used her laptop for internet access and a 32\" TV on the wall to watch satellite TV. Having both on the same screen actually makes the experience a lot easier for her.Picture Quality -- We have a large (55\") Samsung TV that allows 1080p viewing in the living room, so I knew that some screens would simply be too big for a bedroom. When it comes to HDTV, being bigger is not necessarily better. It has to do with viewing angles and what the eye can see given the context and position of the screen. We had also been using a Sceptre 32\" HDTV in the bedroom, but it was only capable of 720i viewing.When I got the new Sony running I was amazed at just how clear the picture is. I knew Sony made good TVs, so I had expected some improvement. But it was easily 3x better than the Sceptre 32 at 720i resolution. In fact, it was significantly better quality than my 3 year old Samsung 55\" at 1080. We watch a lot of Netflix, especially older TV shows, and they even come through really well.Amazon recommends that you have a 40\" screen when viewing from 10 feet or more away. Our bedroom is about 15 x 15, so we are easily 10 feet away from the screen. That meant that the 32\" Sceptre was below the minimum recommended for HDTV, and this may account for some of the quality difference. But it is not enough to make up that big difference I am seeing. I attribute that to this being a really good TV.Sound Quality -- I know the TV manufacturers and retailers will claim they put these anemic speakers in their TVs because \"most people use home theater systems.\" Frankly, that's a lot of Bologna! If you're paying $800 for a TV you should get sound quality better than my 50 year old transistor radio playing an AM talk station gets. With that pet-peeve out of the way, let me say the sound quality is only fair to good. You can probably get by with it if you are only watching older TV shows. But if you like movies or anything that will have a need for good sound quality you will have to spend the extra money to buy a soundbar or home theater system.I initially invested in an RCA Home Theater system with Blu-Ray player, and the sound was great. After about 2 hours, though, the Blu-Ray player started making a noise, and when I took it back to the store I was told that model had a long history of noise problems. I have not replaced the system, yet, and hope to do so next week. I'm sure some sort of soundbar or theater system will be a welcome addition to the setup.Google TV -- This system uses Google and provides access to the Android Market. I use a Droid X for a phone, which also means I can control my TV with the Droid. More importantly, I can get the same games and other software on my TV now. Better still, I can access my Gmail account easily and control my calendar system from the TV. This is pretty cool. You also use Chrome for the net browser. If you're not a Chrome user then it will take some getting used to. I hated Chrome for the first week or so I used it, and still have not gotten used to the oddities that make it so much different from Firefox or Internet Explorer. I have to say, though, that my net sessions don't crash as often using Chrome on my computer, and now that I have it on my TV as well I think I'm slowly becoming a Chrome fan.Netlix -- In my mind this might be the biggest selling point of the Google TV system. Recently Netflix went to a dual pay system where you can buy the DVD package, streaming package, or the combination. I use the combination, so I have access to all of their DVD library. The streaming package is the real advantage, though, when it comes to the TV side of things. The greatest part is there are NO commercials, and you don't have to fast forward through them like you do when using a DVR. I'm sure Netflix will expand their library, and there are some \"old\" shows that I'd like to see on the streaming (such as Newhart, Taxi, etc.), but all in all this is a wonderful feature.Switching from live TV to Netflix is really simple as well. With my living room system, I have to turn on the PS3, login, connect to Netflix, and then I get to watch the streaming stuff. If I want to jump back and forth between streaming and live TV it can take several minutes, 2 remotes, and is generally a pain. With this system, though, the switch is as simple as hitting the \"Home\" button the Sony remote and then selecting Netflix. Going back to live TV is even easier. Add to this the DirecTV DVR and you can pretty much always find something to watch. And if you can't, then there is always the other options on Google TV.Other Options Like Qriocity and Youtube -- I have not used the Qriocity system yet. It is a pay-per-view type of system, and I've simply not had the time or inclination to check it out.As for Youtube, I never used it much on the computer. But now on the 40\" TV screen I find myself drawn to it for some reason. Just something about watching some dunderhead skate board kid crashing onto a handrail guarantee he won't breed that is sort of fun. Surprisingly, there are some pretty decent things on Youtube as well. I play guitar and I've been using some of the homemade and a few of the commercial guitar videos to help me learn different riffs and techniques.As the entertainment choices expand on this system I can see that it will be a great purchase. My only fear is greed! If Sony decides that their Qriocity system is not making enough money they may \"update\" my system so that I'm limited on the types of things I can access. For right now, though, I have access through the home network to the Internet, and there's plenty of reasonably priced options for my entertainment. I could even see a fellow dumping all of the satellite and their high-priced pay-per-view stuff in favor of the online servers. Drop your cable or satellite service, which often costs $100/month or more for multi-room access, and put the money instead into services like Netflix and Qriocity. But then, I'm guessing the folks at Sony already had that figured out when they put this TV on the market.", "Date": "September 3, 2011"}, {"Title": "excellent tv", "Author": "har", "ReviewID": "RP3AHBDHWHTZ3", "Overall": "5.0", "Content": "This TV is beautiful, the picture is great and the sound is wonderful if you are watching and listening to in a normal way.  It does so much that I am sure you will never be able to use it at its 100% capacity.  Maybe it doesn't HULU or GURU but NetFlix is amazing, the Internet works just fine if you have good Internet connection, obviously if you don't you will have problems.  The remote is great; you do have to use both hands but which other remote has QWERTY in it?Overall this is a great TV, first round for SONY/GOOGLE they do upgrade the software which did make a difference in my case.  I would recommend this to someone looking for a one stop TV, obviously if you are looking for the top of the top, you would not get it all in one unit therefore do not try to compare a TV with a surround sound system a PC and a TV tuner altogether.This TV is great for everything you would need the TV to do which is to watch TV!  But it also has many extra wonderful features.", "Date": "February 10, 2011"}, {"Title": "Not for Gamers", "Author": "Mr. G", "ReviewID": "R32VO97PWZ2XJG", "Overall": "3.0", "Content": "I recently purchased this for my Son to replace an old Sony Hi-def CRT TV.  My Son is an avid XBOX 360 gamer, so I figured, no problem, this is basically a computer within a TV, so it should be fast enough to meet my Son's needs, plus it is such a cool looking TV and he was enamored with it's appearance (he is very particular).He and I were both excited and we quickly set it up and he started playing.  That's when the trouble started.  Within 5 minutes he was complaining about input lag.  What is that?  Well it is a delay imposed by the TV on rendering frames and it causes the responsiveness of the game to be unusable for 3rd person shooters.  He was devastated, the cool TV that he wanted so much was not usable.So, back to the store it went and we had to go buy a less desirable looking unit that was fast enough for his gaming.Sony, what are you thinking?  Come on.  This unit should be fast enough as it has a computer in it.  Even Sony admits on their eSupport web site that this may be an issue.  Shame on you Sony for creating a great looking easy to use product that kids can't play games on.Buyer be ware.  If you are buing this for a child who plays video games.  Think again.I will say though that it is a cool TV.  If you aren't playing video games.  I would recommend it.", "Date": "April 23, 2011"}, {"Title": "Decent but not ready for an $800 price tag yet", "Author": "J. Rowland \"JasonNYC\"", "ReviewID": "RX4PMC5EFK37F", "Overall": "4.0", "Content": "Pros:-Decent picture-lots of stuff built in-nice qwerty remote that feels good in the hands and is easy to type with-netflix and pandora built in-updates frequently through google-works most of the time-decent sound quality from the built in speakers for an led tv IMHO--nice for Pandora-decent interfacing with cable boxes and dvr'sCons:-thick and heavy compared to other LED tv's due to computer components inside I assume, almost plasma like-frequent updates from google and needs them to work, also annoying at times like a PS3 with the updates-works most of the time, not 100% reliable even with a good internet connection, Netflix has issues almost on a daily basis-the \"mouse\" is HORRIBLE and barely works making surfing a real task, it's a thumb style track pad and it stinks (my only MAJOR complaint)-slow processor, basically a 2009 model netbook in the tv, it won't replace your computer let alone your tablet or even your smart phone for surfing.  As a net surfer it's kinda bad actually-not that many apps and no google market place as has been promised for some time-not a great picture quality compared to cheaper LED models with it's slow refresh rate and generally poor picture (but the average person won't really care and will think it's ok)All in all, it's not bad but it isn't great or even really good yet.  The reality is it's not very user friendly unless you are a first gen. adopter type of person.  I don't mind it but \"Mom\" will typically hate it.  As a computer, it is crippled heavily by the worst thumb track pad in the entire world.  It's so bad that I think I might actually have a broken unit.  If the track pad worked well it wouldn't be too bad really.  Clicking on a link can take several drunk swipes and usually leads to frustration.  It's a mediocre tv, a mediocre computer, and all at a very high price.  I would suggest, for the price, buying a cheap LED tv and an Ipad or other cheaper tablet device until this whole internet TV thing catches up to modern technology.  As it is now, it's kinda like going to a fast food restaurant and paying fine dining prices.  Sure, the food is decent and it fills you up but it's really expensive and it still tastes like fast food.So why am I keeping it?  Frankly, when it works, it's pretty cool and the way I hope technology will continue to go.  Also, I got it half off because I know someone otherwise I would never have bought it at full price or even 25% off.  It's almost ready for prime time but not at MSRP or even close.  And yet, I still gave it four stars.  Go figure.  It is cool though.  Plus, if the market place does eventually come to this TV, it could be a game changer for it.", "Date": "April 22, 2011"}, {"Title": "Crashes! Do not buy.", "Author": "Charles E. Conconi", "ReviewID": "R2SJBVX3UYUYBZ", "Overall": "1.0", "Content": "I owned the Google TV for about two months it was OK, nothing exceptional and then last Friday I was prompted to do a system update. I dutifully clicked OK and waited... and waited.  Nothing.  The TV froze and would only show the SONY logo in white taunting me.  I called Sony tech service.  After a lengthy series of what amounted to \"kick the tires\" the rep gave up and said I needed to talk to a technical expert.  She said they would call me on Monday morning as they don't work weekends. I grumbled and waited and waited.  About 2:00 I called to find they had no intention of calling me.  And, by the way, you don't really need to talk to a technician.  They can't fix this over the phone.  To me, that says that this is a VERY COMMON PROBLEM.  Why I had to wait three days to find this out, I'll never know.  I asked the \"customer service\" rep what I was supposed to do with my 4 yr old twins that I'd promised to watch a movie that past weekend AND SHE HUNG UP ON ME!  Sony refused a refund.  They did offer me a refurbished TV and another wait of a week of more AND I had to give them my credit card information again.  Really?! My TV was only 2 months old and they want to give me potentially a much older and also previously non-working TV as compensation for my troubles? I asked for a refund or a new one.. no go.  Products fail occasionally, but rigid and bad customer service is intolerable from a company like Sony.  I'll never buy another Sony product again.One other major technical negative - no backlight on the remote, so you can't use it in a dark room.", "Date": "September 26, 2011"}, {"Title": "Great visual quality along with the apps, makes for my favorite toy!", "Author": "yungbull2010", "ReviewID": "R25685CNO9SC6N", "Overall": "5.0", "Content": "Pros:Pretty easy setupGreat visual/audio qualityLove the AppsEasy navigationSynchronizes great with Google,Youtube,NetFlix, etc.Sleek designWireless and Wired network connectivity is almost flawlessCons:Remote is a intricate and needs a glow in the dark function (But the Android Google TV remote is perfect for night use)Remote functionality is still in the works, some buttons don't work well with cable box", "Date": "February 22, 2011"}, {"Title": "A good start", "Author": "M. Larson", "ReviewID": "R3W51ZJ1QFY5TB", "Overall": "4.0", "Content": "This TV is a good start to merging internet video and live television.  I enjoy watching netflix and youtube without going through another gadget.  Updating facebook from my tv is fun too although I haven't figured out how to upload photos through it yet or if it's even possible.  It does have limitations however.  I can't watch Hulu and several other video sources that I'd like to watch.  Also, the audio quality is lousy.  Cant they include some decent speakers with these expensive tv's?  I swear it's a conspiracy to make me purchase an additional surround sound system.  Overall I'd recommend it for anyone upgrading a current tv.", "Date": "January 9, 2011"}, {"Title": "We love it!", "Author": "Judith E Nicholls", "ReviewID": "R22BCH0P48AI79", "Overall": "5.0", "Content": "Being techy people, we didn't know whether to buy a regular TV and use a notebook computer with it or try a google TV despite some websites blocking google TV and similar devices.  We already have  computer/TV setups and the extra overhead of starting up the computer does limit their usefulness. We have broadcast TV and Netflix only, so we do watch some programs on the internet.  In the end we finally decided to spring for a Sony google TV.  Sony NSX-40GT1We are very happy with our choice.  Several of our favorite channels are now available on it, including MSNBC and Comedy Central.  It has 4 HDMI inputs, which is nice for people with lots of toys.  We use one for a DVD player and one for a brite-view Air-Sync HD which feeds it from the Tivo in the next room. The Tivo serves not only what is recorded on our two Tivos but also videos stored on our computers. So it is a very capable device now, and nicely integrated.I see lots of complaints that the remote is too big, but we would like it larger or at least with an easier to use mouse.  I'm waiting for a compatible remote that I like better.  We also have an Android phone configured to control it and the mouse is easier to use on the phone.My only other complaint is the screen is very reflective.  We have windows in the room with no curtains and lots of reflections on the screen.  The TV previously in this room was an analog TV so since those screens are not shiny and not even flat, reflections were never a problem. Our other digital TVs do not have such shiny screens.  This big shiny black thing is very visible in the room, especially one with traditional furnishings.  To me, that is not a good thing...", "Date": "February 14, 2011"}, {"Title": "TV & Computer all in one", "Author": "Potion99 \"potion\"", "ReviewID": "R2G9F9ANQI9SS4", "Overall": "5.0", "Content": "I bough the set at worst buy and also 42\" lg line model 5300 refresh rate @120hz where as Sony 60hz. The price at worst buy at the time I bought both TV, price are pretty much the same.Try out both TV and couldn't tell the difference between 120hz & 60hz, but what I do notice is that Sony picture have sharper image than LG. After fumbling with the picture quality option on both TV, the winner is Sony. I'm guessing because of the glossy glass usually called (true bright which make pictures clearer). Internet  build in on this Tv is plus feature, if you got bore watching TV just switch to internet and no need to get up and turn on that bulky computer and the best part is that it will work with Iphone or Sony smart phone as additional remote.The good: Good clear & sharp picture quality @60hz, Internet build in with N card also work with 5.8hz router, plenty of hdmi input, menu driven are straight forward, nice LED that lit up SONY logo in the front :) which can be turn off, additional remote can be conjunction with Iphone. I did not have any issues connecting @5.8hz also the atom 1.6ghz is plenty muscle for browsing the web. Nice fit in your hand remote control but little confusing at first but yes there is always manual for everything.The bad: Google chrome does not work with few website due to plug-in incompatibility, once in awhile during internet browsing I will get an error with the browser complaint about the plug-in but hey what the heck...we get this all the time using IE, Mozilla & so forth on the computer and top of it all we have to worry about getting spyware malware or virus, this you don't.Overall I think it a great TV, Amazon price is still higher than worst buy even after tax & free shipping. The last time I saw a great deal was @abtelectronics where they listed for 700 free shipping, but sold out after 1 night and the price went back up to 799.", "Date": "April 28, 2011"}, {"Title": "Great Value, tons of features....", "Author": "Elijah Fulton \"elijahblake\"", "ReviewID": "RCIGMP9K2XTVN", "Overall": "4.0", "Content": "Update***So after the price drop 6+ months ago and right when they did the first update to 3.1 I decided to buy the 32\".  It made a huge difference in the TV's responsiveness and overall usability.  I have no problem populating the program guide, Netflix works like a champ, as well as YouTube.  Those are my primary uses for the TV..The one problem I seem to be having now though is streaming movies from my PC.  I can stream movies to my tablet, phone, ps3, but my Google TV will stream them and then stop playing the movie after about 10 mins, some times it even skips to another movie. Not sure what's going on with this, I don't think it's my wireless router because all of my other wireless devices have no problem.  And this didn't use to be an issue, I also don't think it's an issue with the wireless connection on the TV because it plays YouTube and Netflix without any hiccups (mostly).I'm considering running an Ethernet cable to it just to make sure that doesn't fix the issue, but haven't found the time yet...  If not for this issue I would give it a 5/5...I admit i'm a bit of an Android Fan..  I've owned 3 different Androids and even done a little dev work..  This was the main reason I decided to take a chance with the Google TV.  But after owning it about 10 days I took it back to Best Buy.  Honestly I don't think this is ready yet.  I know that it's currently got Android 2.1 as it's OS, so maybe when they update to a later version of Android \"This Summer\" it will make things more fluid...It just seems to lag a bit between switching from Live TV to Netflix, Media Player, or even just pulling up the Menu..Another Problem I personally had was I could never get my Program Guide to populate.  I have Comcast and had this TV in my bedroom just connected with the coax (No Receiver).  I've read where other people had the same issue and i tried Deleting the Profile as suggested SEVERAL times, i even tried nearby zip codes, even Factory Restoring (nothing ever worked)Also this TV's picture is definitely not up to par with other LED's..But the Main Deal Breaker for me was i noticed it had a dead pixel..  You could see it anytime there was a dark scene.  There was 1 Green Dot lit up.Overall, I think this has definite potential to be pretty cool.. That is if the update can tweak and fix a lot of issues..  I'm really hoping that the processor that Sony went with is enough to pull off all they're trying to with this TV though...But as it is now I don't recommend this product..", "Date": "June 9, 2011"}, {"Title": "Can't hook my PC into the TV!!!", "Author": "chipmalee \"chipmalee\"", "ReviewID": "RG7IZ8AHAC7EW", "Overall": "3.0", "Content": "MAJOR FLAW...there's no VGA input.  All other Sony models have VGA.  Sony really missed the boat on this one, otherwise, this would have been a \"keeper\".PROs:1.  The picture is phenomenal.  It's big and crystal clear, almost what you expect a Sony to be.  I refuse to pay for cable so I got a coat hanger TV antenna and it works perfectly with a pre-amp (google COAT HANGER ANTENNA on YouTube).  Gets CBS, NBC, PBS and several UHF (Fox, ION, CW, WB) but does not get ABC.2.  Google TV fires up instantaneous if you have an active WiFi.  See my comments about waking up to it.3.  The TV PIP is larger than usual so you won't miss the smaller details on TV while browsing the web on full screen plus there's also an option to increase or decrease the PIP size with the keypad.CONs:1.  There's no VGA connection.  I brought it hoping to hook my PC to the TV so I can do work at the same time monitoring what's on TV.  Google TV is not for working.  There's no place to copy and paste.  You are basically like browsing a magazine at the dentist's office. WORKAROUND: Buy a new computer with HDMI but that's spending extra money so not that great of an idea. Don't try a VGA to HDMI converter...researched it and doesn't work too good.2.  The keypad is not easy like a TV Remote.  I miss those easily accessible features like \"last channel\" and sleep.  You have to hit several keys to get there but I haven't figured a work around yet.  And that's how unfriendly the keypad is.  Especially in the dark, it's hard to type in those HD subchannels like \"12.1\". WORKAROUND: Bookmark the channel. To get back you have to click \"Home\" and cursor to the bookmarked channel, \"Enter\".  That's at least 2 steps...not as easy as a \"last channel\"3.  The built-in On Air broadcast TV Guide doesn't work.  It's blank, thus worthless.  I've researched and worked on it for more than 8 hours.  Still no data.  So I bookmark Zap2It.com to view my TV schedules. WORKAROUND: There's a \"What's On\" app when in home menu. App will only give you the title of show and minutes left. Stick with Zap2It, set up an account, and keep the cookies on.4.  There's no dual tuner so you can view several channels at once.5.  There's no reset button.  Google TV locked up or crashed on me couple of times.  Only needed to unplug the unit once to reboot.6.  Google TV needs Google account to sync and TV voice command (option turned on) tells me every time it syncs.  But I don't know what Google is syncing.  Is it syncing my web surfing activities?  Can't find any info.7.  NEW! USB ports doesn't play most videos. Plugged flash and tried playing AVI, WMA, FLV...can't find files. Specs says Sony will play MPEG4 but only had MPEG so plugged that in and only got sound...black screen.Comments:  There's nothing like waking up in the morning and click on the Sony without turning on my PC and checking on the weather because I have leached onto my neighbor's unsecured WiFi.  There's no wait for a PC to warm up.  I like to say, life is almost worth living...if only I can hook up my PC to it.  I'm returning this TV in hopes that the Samsung or Panasonic Smart TVs will have VGA input.UPDATE:  Added \"WORKAROUND\" comments to help consumers hack Sony's missing features.I've returned the Sony and now trying out a LG. Even though I only gave Sony 3 stars, I am going to give LG 2 stars because it's even harder to work with. More to follow. The CrunchyRoll app which gets Asian TV shows and movies on Sony Google TV will not let you watch it unless you pay for premium membership.  However on the LG Smart TV, it's FREE. Don't know why...maybe Google has made some enemies.", "Date": "October 3, 2011"}, {"Title": "Great Bedroom TV", "Author": "Tech Man Ben \"Ben\"", "ReviewID": "R3VN56QSZNQVED", "Overall": "5.0", "Content": "Sony 40GT1-Review Time spent with set: 4 Hours-My Tech Level: HighUnboxing:+ TV is Sexy! White back and black front, looks like a 40\" iPad. Tv is thin. 4 HDMI. Wireless & Wired network.Psychical Setup:+ Was super easy, TV is super light and thin. Mounted in Minutes. Press connect button on side of tv to mate controller very first time.Software Setup:- Scans my cable signal slow! 20 minutes?- Thought it was a little tough to figure out all setting and get used to the remote.TV Configured:AWESOME! This TV runs Android 3.1 natively. It actualtly is the menu system for the whole TV. If you are familar with Android at all then this will be easier to get used to. I am an Apple man so it a few more minutes. It has a quick launch menu that lets you access a ton of APPs, that run great on the TV. Pandora, Netflix, Chrome, Market. Once configure the GoogleTV really shines.I took about 15 minutes to explain to the wife how to use the remote and she was off, she really likes it as well.This TV actually replaced a small computer connected to a LCD in the bedroom to watch netflix and movies from my server, listen to pandora and surf the net. I am extremely happy, I no longer need a PC hooked up.BLURRY?I don't plan on hooking up a gaming system nor a pc. But just using it a multimedia TV (Bedroom TV) it does every thing and looks beautiful doing it! No lag or blurring noticed.Recommend?YES", "Date": "December 11, 2011"}, {"Title": "Best Tech purchase I've ever made.", "Author": "Informed", "ReviewID": "RMGLUAXNJKFX0", "Overall": "5.0", "Content": "I did a lot of research on this item before purchasing it and I can honestly say that I was skeptical.  I decided to take a chance and it was the best tech purchase I've ever made.  The reports of lag in gaming are nonexistent.  I called Sony to ask about this and they said that it is true that lag does happen when gaming but I have played football games and codmw3 and no lag whatsoever.  The google tv integration is flawless and it does come with Android Market installed.  Here's a list of Pros and Cons.Pros:  - If you have gmail and you use it, this is the tv for you.  - Chrome browser is lightning fast.  - Easy and self explanatory setup...no need for a manual.  - Can use android phone with a free app to control the tv...and it works just as well as the stock remote.  - Great picture and sleek design.  - Picture in picture is a great feature.  - Beyond affordable for everything that you get.  - Widgets, apps, and streaming work seamless and quick, especially twitter and youtube.  - Easy sync of apps already on your android phone. (For the apps that are formated to work on the tv...which are a lot.)  - Can't tel any problems with the refresh rate  - Gaming has never been better.Cons:  - I waited in line too long to get this tv on Black Friday.  - Seriously, I can't find any.", "Date": "November 25, 2011"}, {"Title": "Nice TV", "Author": "Rush", "ReviewID": "R3TOKB0XM5O41F", "Overall": "4.0", "Content": "I just got it and a week later on Nov3rd it upgraded to Android 3.1. Everything changed now so whoever got it earlier will have a different experience. Its mcuh better then a \"dumb\" TV alot more things to play with sort of like an Ipad or a Droid phone and the video quality is really good. Very detailed video adjustments with black correction macro and color correction macro and color temp etc. It gets very sharp. The blacks are much better then on older LCD TVs even better then on my older \"plasma\" TV. That was the biggest problem with LCDs before. The TV controls everything with one remote which is very convenient. HDMI inputs do lag but I connected Wii through component video and it works fine and it should with Xbox and PS too. This Tv is really not designed to be a monitor so gamers can get better results with other products but it does so many other things its worth the compromise. All HD video content works really well and looks great.Not as fast as laptops with high end video cards so don't expect that level of performance but its as fast as any ipad or a phone. Very nice TV set especially for the money. Currently doesnt have the Skype app but it should come up in the Android market soon.", "Date": "November 4, 2011"}, {"Title": "Wow!  The future is now.", "Author": "RocketDog", "ReviewID": "RR6Z5U9WJTMQC", "Overall": "5.0", "Content": "This is my first flat screen purchase and I'm so glad I waited until this internet-TV hybrid was available.  It was a breeze to hang on the wall and looks great -- blacks are deep black, colors are bright.  Having it pre-loaded with Netflix, Pandora and able to stream my Amazon Instant Videos turns it into a complete home entertainment screen -- I haven't even set-up a DVD player with it -- everything I need is available through these streaming options. It's fun to be able to watch food & home improvement channels and be able to search for recipes and products online at the same time.That ability to stream whatever we'd like to watch is great when guests are over.  The Google TV set-up and the full featured, keyboard-enabled remote are super easy.  This is a great television for people who are used to surfing and watching TV at the same time -- I couldn't be happier with this purchase and recommend it highly!  (Pro tip:  Just be sure you work with your internet provider to assure you have sufficient bandwidth for effective streaming.)", "Date": "June 19, 2011"}, {"Title": "Useless for Amazon Prime", "Author": "L. Radford \"The Library Cat\"", "ReviewID": "R2XHUBZ3YN794L", "Overall": "1.0", "Content": "If you are buying this to view your Amazon movies, DON'T.  Buy a Roku.  The Roku will play internet videos quickly with no lag.  I have yet to get an entire 30 minute video to load on this thing.", "Date": "June 21, 2011"}, {"Title": "Happy customer", "Author": "Glen Foster \"Glen\"", "ReviewID": "RKYY7I33Z039O", "Overall": "5.0", "Content": "I have had this TV for a month now.  I wanted to wait a bit to get a good feel for the TV before sending in a review.The picture quality is awesome.The remote took a bit to learn but I was fully expecting that.  You get new equipment with new technology, you will have a learning curve.It was fun learning to use the browser.  It can be a little finicky at times but as a sports freak, it is fun watching the game and having the browser open for stats.The set up was quick and relatively painless.I have read the reviews talking about lag with gaming systems.  I don't know what they are smoking.  I use an Xbox 360 with the TV.  The picture is crisp and the response time is exactly the same as with any other TV I have had.The sound quality through the speakers wasn't the best but I have it connected to a sound system and it works perfectly.This is an awesome product and I hope it sees a wider adoption that what it has seen so far.", "Date": "September 16, 2011"}, {"Title": "EPIC FAILURE!!!", "Author": "Jason \"Peeps\"", "ReviewID": "R1YRY3YSQIX0D2", "Overall": "1.0", "Content": "I purchased this TV to be the centerpiece in my media room/office. Meaning it will be used for movies, gaming on my Sony Playstation 3 and as my computer monitor. I figured with the so called advanced processing circuitry and the fact that it was specifically designed to access and display web based media that it would be the clear choice for my needs...WRONG! From the second I hooked it up to my computer (it's running a six core processor, 8Gb of ram and a Nvidia GTX 570. I just listed that so you wouldn't thing it is my computers fault) there was an immediate and unfathomable amount of input lag from what the mouse was doing compared to what the cursor on the screen was doing. The input lag was so bad that it made it even hard to try to open a desktop icon because I kept passing them up. I checked and rechecked everything and found everything to be set up and connected perfectly. I then tried the PS3 and found it had the same issue making any game I tried virtually unplayable. I decided to browse the forums looking for NSX-40GT lag and found this to be a HUGE and documented issue with this TV. I thought how does Sony put out a TV that you can't even use with their own product, the PS3. Disgusted, I contacted Sony and spoke to three different drones over the course of an hour that kept repeating the same thing...\"Users may experience a slight lag or delay in response time when connecting the Internet TV device to a game console. This is a natural result of the advanced processing circuitry in the Internet TV device. This is normal operation.\"...Lag is \"NORMAL OPPERATION\"?! and they call it 'advanced circuitry\"...wow. After beating my head against the wall I threw my hand in the air disconnected the hunk of plastic they call a TV and will be returning it in the morning. Sony's attempt to cover the obvious flaw in the engineering of this TV by updating the status of this issue as \"normal operation\" should be criminal. Do yourself a favor and stay away, far away.", "Date": "December 8, 2011"}, {"Title": "Video Game Consoles Will Lag!", "Author": "S. Bolday", "ReviewID": "R3HT0R05ON6TR7", "Overall": "1.0", "Content": "I hooked my Xbox up to this Sony Google TV and notice terrible lag.  After talking with the Sony rep, who was helpful, told me that all Sony Google TVs will lag when an Xbox or PS3 is hooked up to them.  She explained that the hardware is not fast enough to handle video games properly.  Other than that, the TV is great.", "Date": "August 26, 2011"}, {"Title": "Good - but DO NOT for video games", "Author": "pizzaforeveryone", "ReviewID": "R13L37LLFG8MKY", "Overall": "2.0", "Content": "Hello! I've had this model for about a month, and love it for youtube, vimeo, and netflix. Looks good, too.But I was really disappointed to learn that for gaming, I had serious issues with \"lagging\". The screen runs about half a second behind your controls. I have a wii--I'm not even a serious gamer, but learning that there's nothing I can do to fix it is a big disappointment, especially because this is my first HDTV. I just wanna play some mario--but this problem renders mario unplayable. I tried switching to a component cable, but no help.Other TVs have a \"game mode\" that corrects this problem, but not this TV. They have no plans to fix it, and you can see Sony's official stance here (they call the problem \"normal\") [...]I bought the TV based on google and sony's brand names. Hop they fix it someday with a software update. I should have done more research on the subject before buying.I'll just keep playing mario on my 18 inch old as heck TV with built in vhs deck.", "Date": "October 27, 2011"}, {"Title": "Best tv I have ever used", "Author": "Vic", "ReviewID": "R5X2LQMLAQZ8P", "Overall": "5.0", "Content": "I really don't know how to explain. The only negative ( and is same for all tvs) is you have to buy at least an hdmi cable which is not cheap. But once you have your tuner running through hdmi or other digital connections you will be seeing tv for the first time. There is no clearer picture out that I have seen. On the real hd channels you will notice some of the pretty people , well, aren't so pretty. And hd is there enemie. Very easy to use, the only difficulty is going through all the apps and options so you can bookmark your favorites. I have a very slow network and I still have no buffering issues ( hbo go aside ,no matter what it buffers) Netflix runs smooth and initial setup is a guided process made easy. You will want to adjust as your needs and familiarity of tv/cable/wifi systems are more defined . But as I said is fairly easy to fine tune. This being said by someone who is a technical dinosaur! All I can say is hdmi or higher connection, then sit back and enjoy tv like never before!!!", "Date": "August 19, 2011"}, {"Title": "Great TV, tons of potential!", "Author": "Stephen", "ReviewID": "RGPLN68IJ5126", "Overall": "5.0", "Content": "I spent months looking at different tvs, trying to figure out which was best for my first HDTV.  I figured despite it's lack of 120 Hz like a lot of other tvs, the picture quality would be great and I could never tell the difference anyways.  The picture looks great.  I believe setup would have been a breeze, but somehow I also got a mixup with Comcast, so the channels wouldn't switch with the remote, not a knock on the tv though.I saw a bunch of reviews about this tv and they were mixed, but anything that was negative was some quasi-professional nitpicking.  Overall I find the remote to be different and fun, the home screen and search experience makes you feel next generation of viewing.  Netflix worked like a charm, and I could view Dexter in HD, which was gross, but awesome at the same time haha.  I haven't had this TV for 24 hours, and I'm really looking forward to learning it more.  And with the updates and impending addition of google app market, this should keep anyone busy for sometime.Overall I love the design, the metal bear-trap stand and the internet capabilities.  I have had no problem with the browser, it is responsive.  I believe any knock anyone has written on it has a internet-speed issue, not a tv issue.  I'll try to update this as I learn more to give any negatives, but with the gift card special included, this was a very good tv to buy, and I'm happy to support the upcoming Google TV community.  I believe the more the better experience this will be for all.  It's definitely not an ordinary tv, it feels more than that.", "Date": "March 9, 2011"}, {"Title": "Excellent beginning", "Author": "HB \"HB\"", "ReviewID": "R19AT1L0JTZ1WW", "Overall": "5.0", "Content": "Just got my 40 inch Sony google tv.Excellent quality,friendly user interface and android compatibility.waiting for many more updates and apps.I would suggest it to anyone who's looking for a TV with internet/or someone who is about to buy his first one.Great price for an LED/LCD tv with internet,and on the top of that it's SONY.", "Date": "February 14, 2011"}, {"Title": "Great TV-Needs Manual", "Author": "Gus", "ReviewID": "R1NPSEM5CP3E60", "Overall": "5.0", "Content": "We have had this set for about two weeks and love almost everythingabout it. It is very hi tech and has an endless amout of features.The main problem is there is very little documentation. The helpmenu is not easy to work with and the internet help informationis limited and has poor indexing. If this set came with a good,detailed manual it would be the best you can get. If your patientwith the internet part of the setup you will be happy. If you don'ta little tech inclination and patience, well you know.", "Date": "January 12, 2011"}, {"Title": "Incompatible with ALL gaming systems", "Author": "MattyB", "ReviewID": "RSPARXVZCZ6YX", "Overall": "1.0", "Content": "This unit has a display lag that makes ALL VIDEO GAME SYSTEMS UNPLAYABLE ON THIS TV.  As others have noted in reviewing this product, I also confirm that I experienced this same issue and just returned the TV for an older Sony Bravia LCD model today (and now everything works perfectly).I spoke with a Sony Support representative who acknowledged that latency is a \"known issue\" with the NSXGT series and they are \"actively working to correct the problem.\" Of course, I can't sit on a TV that doesn't work and pray they come up with a fix. This is really unfortunate as everything else about the TV was truly excellent.I can't believe that a company responsible the Play Station would be naive enough to call this major glitch, \"normal operation.\" Anyone who plays games knows that a 1/2-second delay is even enough to make a casual game of Wii Bowling a nuisance.Gaming is hardly a niche application. Imagine if you bought a cool new 'advanced' Internet TV only to get it home and after hours of setup and hair-pulling you find out that it's not compatible with ANY DVD players... and, \"oh yea, we -- Sony -- knew about that; it's 'normal'.\" That would be enough to tarnish the stars off of any review...In all, I am a fan of Sony products and even returned this TV for a different Sony model which works perfectly. However, I am very disappointed that Sony chose not to provide this full-disclosure upfront on a flagship product. I hope they get it right in the future, but for now, DO NOT BUY THIS TV if you intend to use ANY gaming systems with it. They simply WILL NOT WORK.", "Date": "November 28, 2011"}, {"Title": "I cant believe the criticism this TV gets! it is AMAZING!", "Author": "G. Poli", "ReviewID": "R3K5ESYVK84H09", "Overall": "5.0", "Content": "WOW that all you can say when you use this. mine arrived in feb 2012. having said that I am so impressed. i bought this tv after seeing my nephews 32 inch model. I was so taken by its features i bought it online the same day. i had to order from Sears because it is discontinued now. after impulse purchasing i went to Best Buy to talk to a tv salesman to find out why it was discontinued? (i heard so many theories online and was concerned) he said it was discontinued because in the end on March they will be coming out with a newer model with much better feautres(actually thats now at time im writing this) Im cant image how they can get MUCH better. this thing is so awesome.So quick rundown about the negative review that worried me...the REMOTE? fantastic! yes it looks different, this tv has redefined everything you can do with a TV. All that THIS TV  does cannot be done with a standard remote.  its amazing it all fits in roughly the same size remote (square inch wise i mean, it is a bit more square than most) It works like a touch screen although there no \"screen\" on the remote.. you just slide your thumb or finger over the direction pad and the courser moves on the screen! ive never seen anything like it before? yeah you can use the pad buttons most of the time if you prefer but it is so naturalk felling to use the touch sensor you wont use it any other way. I have to say if you compare this remote to most other smart tv remote you see why i am saying it is so fantastic, some of the smart tv's i have tried use a Nintendo Wii style remote for typing?? OMG have you ever tried to type a long web address by pointing a curser to letters on a screen? its takes so long that in my opinion make the net a seldom used feature because of the difficulty and time of imputing info. try it if you haven't experienced it because it imediatly speaks for itself.(although other manufacturers are quickly realizing this and i am starting to see the other brands switching to this kind of remote) fortunately you DO NOT have that problem with THIS tv because the full keyboard is right in your hand and much to my surprise VERY easy to use and no learning curve because the keys are laid out just like the computer keyboard. you have to TRY it before you pass judgement you really do it does LOOK awkward but in fact it is far from awkward. oh i almost forgot, the remote works my Comcast cable AND DVR without problems. every single function is supported i do not even need to use the Comcast remote (i let my guests use that one) Setting it up?  you dont really need to do much? it asked me what cable company i have? i chose from a HUGE list of providers most i never even heard of! THEN it asked my zip code, then it supplied a video feed and channel number info for a few test stations and asked if they were the same stations that appeared on the list that Comcast says (like is channel 3ABC and is channel 421 HSN ect) after that it is complete?BROWSER? it hasnt failed me yet ANYWHERE? social networking, XXX content (including videos) just for test purposes of course lol, online picture sharing galleries, my fathers personally hosted websites, what else.... um i dont know like i said i have not EVER had a issue reaching a site.. ill update here it that changes. i HAVE heard of restrictions to 3 (1,2,3) websites and they are all news sites (i have heard) that supposedly block videos being viewd? but there are so many news site you CAN see? and PLEASE DONT EVER FORGET this IS a tv? you can tune in to the REAL news anytime you want even PIP it while your browsing?UPDATES? My tv has updated itself twice (always asking permission first) and i have had NO Issues with either one? it takes less than 5 minutes  to complete each one so far. How can i comment beyond that?APPS? gosh i dont know, there are few PAGES of Free ones? and god knows how may paid ones, i stopped browsing after a few pages just cuz i kept hearing that there were virtually NO apps avalible? i dont know how you can reach that conclusion i have personally seen more that 150? how many OTHER tvs have that? I admit this it a non issue with me as i dont intend on  buying apps for my tv? I do love the free pandora app and the classy fireplace that crackles away in the background! and the media player and the netflix!I dont know what else to say those were the biggest features that concerned me after my impulse buy. this thing is a amazing piece of hardware you cannot be disappointed. it doesn't make coffee or go to work for you? im sure there will be some critisisim for that? ill update this if i have issues its been about 1 moth now and this thins is WAY more that just a conversational piece! I love it!...oh thats right i forgot to mention (some here criticized me for not saying)if you want to use the remote for your cable box to there is a small cable (called a IR blaster cable and it is shipped with the tv. it has a plug like a headphone jack) that needs to be plugged in the back and has a sensor on it with a piece of self adhesive tape (the hole piece is about the size of a 5 cent coin) it can be stuck on the back of your tv with just the tiny led like bulb protruding for reception. the hole installation took me 2 minutes, and only that long cuz i wanted to decide where to stick it? (i chose to hide it deep in my entertainment center so it cant be seen even though its so tiny)", "Date": "March 3, 2012"}, {"Title": "Great TV! Could have been perfect", "Author": "johnnydoggs", "ReviewID": "RHKX8UTPXQ1RY", "Overall": "5.0", "Content": "The good: 1080 pixel, built in wifi, gorilla glass screen, beautiful design (looks like a giant ipod, great new software update with apps, netflix, crackle, etc etc. The bad: hulu, abc, cbs, nbc, and prob a few others purposely BLOCK google tv from viewing their sites which are free for anyone with a computer. Their jealous bitches and won't stop me from buying or enjoying this tv. Theres plenty of other stuff to watch on here anyways and who the hell watches free network tv anyways. They know google was going to make people drop their pay cable tv if they could get all those stations for free online. Also the sony keypad remote is great and fun to use.", "Date": "December 31, 2011"}, {"Title": "Games do work on this TV if you put in the proper settings.", "Author": "jph89", "ReviewID": "R1JGHCQ44GC706", "Overall": "5.0", "Content": "Despite mixed reviews, I decided to buy this TV for my room because I wanted a full 1080p/internet TV to replace my old 20\" Samsung.  I have a nice TV downstairs that plays my PS3 games very well too, so it wasn't the biggest risk if the \"lag\" appeared for me.  After playing around with it, I noticed you could set each HDMI port to a specific setting.  If you make the port that your PS3/Xbox in under the game setting, it runs perfectly fine.  Now, I have no idea how a FPS game online works, as I don't play games like COD or Battlefield, But games like Skyrim, Batman, and Uncharted work very well.  Also, I have not noticed any apparent lag with my Wii yet playing Zelda or MH3.  So I just wanted to make a review saying it IS possible to game on this TV, despite contradicting reviews.", "Date": "December 28, 2011"}, {"Title": "good, can be better.", "Author": "klee33ny", "ReviewID": "R23WMLJ3EICEVF", "Overall": "4.0", "Content": "bought it online. received it in a week. opened it and connected to Internet with built in wireless. worked immediately. if you plan to use it with your family or friends, create a new google account for the tv. had the tv for a month and still happy with it. media server streaming - a good feature if you have win 7 homegroup set up. can't wait to see android market upgrade.", "Date": "September 23, 2011"}, {"Title": "MY THOUGHTS !", "Author": "B. Falkoff", "ReviewID": "R2QKG8M7V95D5G", "Overall": "4.0", "Content": "my thoughts.if you can get this TV for 699.00 or less then you have a good deal.The color contrast and image on this set is great.looks great watching news and shows in HDnot as good with motion as other Sony's but still better than the older projection TVsbut the developer's of this TV  played a big joke on Sony lovers.kinda like a PC. once in a while has a delay in volume control. also had it to restart on its on once.if your like me and prefer to use a Sony remote while watching TV, dont expect all features of your remote to work. like  (jump) (wide) (menu). etc.but i like the idea of it having Internet, but the mouse part doesn't work as well on the tiny keypad, id recommend getting the Logitech Revue keyboard.after that said i think this is a great TV for a main set and for those that dont have cable and like playing on the net.i hear more apps are coming soon and the google TV will be better than ever.anyway i got mine cheap and I'm keeping it. once all the little kinks are worked outi think google tv will catch on.", "Date": "August 17, 2011"}, {"Title": "Might be great someday, but not today.", "Author": "JL \"J\"", "ReviewID": "R1YXOZKEJXTC4I", "Overall": "2.0", "Content": "Today's TVs are very different devices than those of even 5 years ago. You really need to know what you want out of a TV because the innovation and differentiation between manufacturers is significant. It's definitely a great market for consumers.What I thought I wanted out of a TV was this: a device running on a flexible and future-facing platform that leverages the best of internet video, apps (that I would actually want on a TV like Netflix, IMDb, etc.), and old-fashioned television. The Google TV seemed like the obvious choice.Unfortunately, it's not quite there yet. I've now used this TV for over a month and I am looking to get rid of it. I wanted to like this TV because it had so much potential. If it's helpful in making your decision, below are the reasons why I wish I wouldn't have purchased it. Also, you should know that I have the latest software on it (Honeycomb), in case you were thinking that update might fix some of this. Sadly, it doesn't. = )The Remote- The remote looks cool, but using it is entirely frustrating. I'm sure there's a logic as to when to use the trackpad wheel on the right, and when to use the nav wheel on the left, but it's certainly not intuitive. The buttons are easy to accidentally press because they are small and several. It's easy to bump the remote, and that causes a mouse cursor to jump onto the screen which doesn't disappear for about 30 seconds. I ended up downloading the Google TV remote for my iPhone and just sitting the physical remote aside.Android Doesn't Seem Ready for TV- The OS the TV is running is Google's Android and it is very exposed. The TV runs apps, and when they need an update a notification pops up on your screen every few hours (even if you are watching something). Sometimes the updates don't work and it just continues to notify you. I've been trying to update the NBA app (which came installed on the TV and can't be removed), for weeks, in order to get rid of the notification pop up. When I try to update, it gives me an error message saying the operation failed and to try again later. Another fun OS error occurs when I try to use the Google TV Remote app for my iPhone to control the TV. If my iPhone is dormant too long, it generates a large error message on the TV screen that pretty much blocks the middle of the screen (and whatever you were watching). The error says the connection failed. When you select OK, which you can only do by finding the physical remote and using the annoying tiny trackpad, it gives you another error indicating the Remote Control app failed. At this point you've lost your focus on whatever you were watching. There's something very annoying and unnatural about the error messages and notifications popping up in the middle of my movies that served as the final straw for me.No Hulu- There's no Hulu Plus app for Google TV and there's actually no way to view Hulu on Google TV. It just gives you a message indicating that it's coming soon (as it has been for months and months and months). Every other Sony TV with Internet connectivity currently being sold offers Hulu Plus. I never realized how much I liked having Hulu on my TV until I couldn't get it.YouTube Doesn't Work Sometimes- When you try to watch a YouTube video it prompts a box asking if you want to watch it in the browser or on the YouTube app. I honestly feel it would be nicer if it just chose one or let you set a default to limit complexity (maybe there's a setting I haven't discovered). After a few videos viewed in the browser, YouTube just stops working in the browser until you kill the browser app and reopen it. Sometimes the same thing happens in the YouTube app. It's very hit or miss.Very Few Apps- Google TV advertising boasts several apps, but there are only a handful of apps actually designed for the Google TV. Most the apps offered appear to be designed for Android tablets. Some of the tablet apps work out OK, but Google clearly hasn't built a strategy for how to limit dysfunctional features by device yet. For example, some apps offer errors when they can't access features like vibration or screen brightness, etc. One app was unable to use the TV's internet connection so it didn't work. This is disappointing because they are offered in the app marketplace on the TV. You would assume that the majority of features would be functional on the TV if they are offered on the TV's store. Unfortunately, that's not always the case. So they kind of work... but not really. To be fair, you really don't want every Android app on your TV; only a few are relevant (like Flixster, Netflix, IMDb, etc). It's just annoying that Google isn't moderating the content well.Searching is Confusing- You would assume that Google would do search well on Google TV, but it's not quite there yet either. If you hit the search button on the remote from within Netflix, for example, you would assume you are searching Netflix. Instead, you are searching the entire OS, all videos on all apps and services (like your cable or satellite). I hope Google offers developers an API (or perhaps they already do and nobody uses it) which allows the option to narrow search to within an app with the hardware search button in a future update. If the search functionality worked intuitively, it would be very useful.Settings... a Nightmare- Because the TV (even the hardware) thinks of itself as an Android Device... like, literally thinks of itself as a giant tablet, all of the hardware settings are in the Android settings app. It's sometimes tough to know what's a function of the OS and what's a function of the hardware. That makes it difficult to find the right settings. It also seems that some of the settings you would expect on a TV are just absent.The Hardware is Cheap- I don't want to hark on this too much considering the price point of this TV, but the hardware is really cheap. It's also pretty poorly designed for wall-mounting. For instance, the speakers are on the back. If you mount the TV, the volume sounds muffled, but your neighbors will likely complain since it's reverberating through the walls. Another annoying hardware element is that, by default, the Sony logo on the front glows a brilliant white whenever the TV is on. It's pretty difficult to navigate the Android system settings to find the option to turn that off. Trust me though, you'll want to turn it off right away. The light is very distracting with movies. Lastly on the hardware front, the low refresh rate results in ghosting. It's most evident on games.I waited for the first major revamp, hopeful that Google TV would finally be a perfect fit at this price, but discovered it's not. I wouldn't recommend this TV unless you really need a browser on your TV; the fully-functional Chrome browser is it's only real strong point. I gave it several weeks thinking I would eventually fall in love with it once I learned to use it better or once I found it's \"killer app\" or \"killer feature.\" Turns out it just doesn't have one.I hope these experiences I've shared help you make a well-informed decision. If you really want to tinker with Google TV (and I'd posit that tinkering is all it's really good for at this point), you may want to consider the less expensive Logitech Revue connected to a different TV:Logitech Revue Companion Box with Google TV and Keyboard Controller.If you are just looking for a good way to get Netflix, Hulu, Pandora, and some other key content on your existing TV, I'd consider a Roku. It's got dozens of apps/channels to bring web content to your TV at a very reasonable price: Roku LT Streaming Player. There are some differences between models though, so read carefully before buying.If you have an iPhone, iPad, or Mac (and don't mind not having Hulu), you are better off with an Apple TV. They are fairly inexpensive and work well with your other Apple products. They allow you to do things like push YouTube videos you start on your iPhone to your Apple TV, access iTunes Match, shop the iTunes store, stream your music from your computer, etc. Apple TV also has an incredibly well-designed interface built around simplicity (something Google should really consider), and intuitive navigation: Apple TV  MC572LL/A  (NEWEST VERSION).If you are interested in what I have my eye on to replace this Google TV, I'm considering a Panasonic Plasma model with VieraCAST. It has all the web apps and YouTube you could want. it also has a video adapter for Skype that allows you to create 3D video (imagine sitting around the TV on Christmas morning while it takes all the video for you in 3D). Plus it has dozens of apps including Netflix, Pandora, Skype, Hulu, YouTube, 3D, etc: Panasonic VIERA TC-P46ST30 46-Inch 1080p 600 Hz 3D Plasma HDTV. Some of the Samsung Smart TVs also look pretty amazing.Thanks for reading, hope it helped, and I hope you enjoy whatever you ultimately decide on!", "Date": "January 11, 2012"}, {"Title": "Impressive TV, but read the reviews so you know what you're in for!", "Author": "MarkOTheBigO", "ReviewID": "R2BPCMH90036X8", "Overall": "4.0", "Content": "This TV is used in our bedroom. I got this TV in September for my wife, to replace our old 22\" tube TV. I waited a couple months for us to use the TV before writing this review. We are in our early 50's.Pros:Even when it's off, this TV looks great - very sleek and clean, back side is white.All printed documentation that comes with the unit is in English only. No multi-language excess garbage.Way more features and frills than we'll use today, but we'll be able to explore and make better use of these as time goes on. For now, it's just a TV and Netflix for us! And it's a Sony.Cons:1. Shipping box is the original Sony box...ie, no added protection. This is totally inadequate for this TV. The box had a 1 inch puncture in the middle of the bottom, with some scratches on the unit on the underside.2. Where's the User Manual? Just a Quick Setup Guide (10 pages, generic for all 4 of the NSX models), a single sheet about unpack aging & installing the stand, a sheet on tip over cautions, a 12 page reference guide, and a 50 page EULA book (totally useless) that's as thick as what a User Manual should be.3. Took a long time to get the remote to sync up. Instructions do not say about how long it takes, neither does the on screen menus. After 40 minutes of changing batteries, moving around, trying different buttons, turning off the lights and other TV/stereo stuff, etc. I finally took another (actually about the 5th time) look at the quick reference set up troubleshooting. It says if the remote don't sync, get closer to the TV. Well I did that before, but this time I got about 1 foot away from the sensor on the TV and it worked. Jeez that's weird, what good could this remote be if you have to be a foot away? Well apparently this is only for setup; after setup in normal use the remote works anywhere in the room with no problem.4. Could not get the wireless working at setup, waited and waited and the on screen display just did its `searching' without giving any status update. Instructions say it could take 15 minutes, so if it doesn't work after 15 minutes with no status update what do you do? Try something else, and wait 15 minutes again...and again...and again. Finally I used a wired connection, but that did not work the first time either. After power down and up again, it finally found itself and was able to continue with the setup.5. The setup process FORCES you to have a Google email account. Note: Not just any Google account - specifically a Google EMAIL account; and if you do not already have one, you are REQUIRED to create a Google email account before it will even allow you to continue the setup! What kind of crap is this?!6. After getting a football game on, I put this Sony next to my 2-yr old Toshiba 37 inch 37HVL66 LCD TV for comparison...uh-oh. Did not look nearly as good as the Toshiba - the Sony had dim, dull colors. Had to change to `Vivid' picture and then it was much better (comparable to the Toshiba). Then I did some more changes with brightness, contrast, color, etc and finally got it set a little better to my liking - and looking slightly better than the Toshiba.7. The remote - mixed feelings on this one, buttons too small. Intuitive? Not for me, and no way for my wife. But we can turn it on/off, find TV channels, and watch Netflix.8. My 17 year old son tried his xbox360 and yes the ½ second time lag makes this unusable. But I knew about this, and was ok with the tradeoffs before I bought it. I actually now have even more second thoughts on this, since someday this TV will be the 'old' TV, and then it goes to the basement rec room...and then more likely to be used for gaming!9. When set to the `power save' mode, it will take ~40 seconds for the TV to come up when you turn it on. We got used to it, this is sort of nostalgic actually...just like the TV's from the 60's! Not a big deal really.So I was going to return this TV before the free 30-day trial period was up, just because the TV was pretty expensive and complicated and had minor shipping damage etc. Costco had good prices on smart/internet TV's at the time, and they included 2 year warranty's. But my wife grew to liking this TV, and all its other fancy features that she has no idea how to use, so she wanted to keep it. I also think she was a bit giddy that I surprised her with an expensive TV, just because I said she needed a good one - And not for her birthday or xmas or anniversary, but just because she's worth it. So it's a keeper!", "Date": "December 1, 2011"}, {"Title": "You've been warned.", "Author": "bigjim369", "ReviewID": "R2W105DIB4KDKO", "Overall": "1.0", "Content": "We've had this unit for about three months and it has never amounted to much--it's mainly a device for selling you services you probably don't want.  It has maybe  a tenth the power of the smallest, oldest iPad, and it constantly screws up even the simplest chores.  We are highly experienced computer users so when we tell you the user interface including the joke of a remote keyboard is a disaster, you should pay attention.  Lest you think we exaggerate, read the CNET review we tried to give you a link for here, but of course Amazon won't allow that.The last straw for us was the recent \"honeycomb\" update.  After installing the update, the Netflix app died and no amount of effort would bring it back.  After two days and many hours on the phone with various customer representatives that involved such fun things as disconnecting our wifi, buying an ethernet cable, and hooking up the tv directly, the final outcome was that the update had broken it and it couldn't be fixed.  The solution offered was to return our almost new unit and receive a used one.Our personal solution was to buy a computer-to-tv cable to enable the functions we need and forget Google tv.  I wish we'd never heard of it.", "Date": "November 7, 2011"}, {"Title": "Don't buy if you are looking to use apps", "Author": "Cameron Maclean", "ReviewID": "R3175N1LI0M7KG", "Overall": "1.0", "Content": "I've had this TV for 2 years now and use it without cable. My review is based on the fact that as a smart TV it simply fails.The layout for Netflix is actually very limiting, so when browsing for movies they only show you a handful of selections. So you can use pretty much any other internet access to Netflix to get a real understanding of what movies are available and then search Netflix on your Sony Tv to find them. Apple TV and Samsung Smart TVs both have a much better design.The worst aspect is that HBO GO app is just a link to Google Chrome. Literally no user interface effort put into the HBO GO app in over 2 years and the streaming is spotty at best. Renting movies is also a process and never easy. Sometimes I can rent movies from YouTube and sometimes I can only pay to rent a movie, but can't watch it. Amazon renting doesn't always work either. Surprisingly, if the Sony movie rental place has the movie you want, it works.I just spent a weekend with a Samsung Smart TV to realize how terrible Sony and Google have been married. It is almost like Google and Sony put together a half-assed product, and in their failure decided never to improve it. Due to this fact, I not only recommend avoiding this TV if you are looking for a smart TV, but will definitely never be buying a Sony/Google product again, knowing that they can just leave a cool product design like this to slowly fade on their customers.", "Date": "September 8, 2013"}, {"Title": "Do more research, do not waste money", "Author": "nonameplease", "ReviewID": "R2DP8SH779FEMM", "Overall": "1.0", "Content": "I did little research before buying this TV two years ago. I had actually not even owned a TV for over a year before buying this one, so it seemed very cool at first with the wi-fi streaming. It was fun at first watching Netflix and using Pandora without a lot of wires and additional boxes. BUT, you CANNOT use the Pandora app anymore, I have to go to Google Chrome and pandora.com to login to listen and that takes about 5 minutes to get going. Netflix locks up all the time. I contacted Sony about my google TV and they said my internet was too slow. REALLY? Works fine with ipad and either of my laptops, and was okay for the first 1-2 years. I disconnected everything wireless to make sure I was not drawing down the bandwidth. Still bad. SO, I upgraded my DSL to 3megs after Sony suggested I do so, and still crappy. Pandora app still not working, Google Chrome worse than dial up, Netflix still chokes. TV was okay for about a year, now I am NOT happy. And, I am also paying $25 more a month for faster internet that I did not need. Oh, I also cannot watch Hulu. Another waste. Oh, and when I put a photo card in, I cannot view the basic jpeg files. I could go on and on. YouTube will no longer work, really making for an unhappy two year old! I am not tech savy, but the TV was okay for a while, now it is just a regular TV to me. Will research Apple TVs next time and read a lot more reviews.", "Date": "February 14, 2013"}, {"Title": "Sony Google TV is a wonderful TV", "Author": "Jennifer West", "ReviewID": "R3JO1WSVMWMVC0", "Overall": "4.0", "Content": "We personally have two of these Sony Google TVs in our house.  When searching for a new TV, we typically tend to look at CNET and look at the reviews and specs that are offered there.  With this TV, we were really looking for something that we felt visually was comparable to my husband's Panasonic Plasma TV, which they do not make anymore.One of the coolest things this TV comes with it the very intuitive remote control.  If you are not a computer person, you would NOT want this TV remote.  If you are a gadget person and love new cool gadgets, then this TV remote is for you.  It has options for the HOME screen, you can set your timer, you can navigate through your cable or Netflix, and also with this TV, navigate through the Internet.  The TV wirelessly syncs up with your home internet and is basically a computer TV after that.Another neat feature this TV has are the App options.  My children all love the fireplace App.  When they all want to \"camp out\" in the living room tent, they like to have the fireplace app on with either a little added jazz music, or even the sound of a thunderstorm.  The options are truly neat!The TV in and of itself is obviously large.  If not hanging on a wall mount, the TV can take up a lot of space with the way the stand is set up on it.  My daughter has this TV sitting on her dresser, and is only able to have the small cable box on the stand with it.  Her blue ray player will not fit because of the width of the stand.In addition to the good picture and sound quality, the TV is very sleek and aesthetically appealing to any room.While I recommend this TV whole heartedly, I do not recommend this TV for the person who may be electronic or computer lacking.  In essence, I would not recommend this for my aging parents, but would recommend for any of my friends and acquaintances.", "Date": "November 28, 2012"}, {"Title": "I love this thing", "Author": "Jood", "ReviewID": "R17Z52RSAVZCON", "Overall": "5.0", "Content": "I really really like this TV, very impressive screen.The LED makes it amazing.Also you can download apps on it. I play Xbox on it, there is no problem with it. I don't know why some people say there is a problem with video games, I think because their HDMI cable.", "Date": "March 25, 2012"}, {"Title": "Not Worth Crap For Gaming But Awesome TV!", "Author": "Pink Breadsticks", "ReviewID": "R13QXKWOX5NCTG", "Overall": "5.0", "Content": "If you are just wanting the perfect TV for movies and Internet then by all means this one is the best. With the processor and wi-fi capabilities you are set for exciting entertainment. Movies and Tv shows are sizzling on the screen. But if you want to play video games it is not worth the headache. It is hard and tedious to setup any gaming system and then lots of old games will only play in black & white mode. Online gaming is almost null nad void witht he refresh rate. So forget xbox live etc. But surfing the internet is a breeze. It is just like a huge computer and their is no end to where you can go. It operates like android with the market and so many apps you can get for your TV!And you can connect a regular USB keyboard and mouse for more fun. Even a wirelss mouse! You dod not have to use the included sony keypad which takes some getting used to. the letters and buttons are microscopic. Also you have Google Chrome And can get angry birds on this Tv! WOW!", "Date": "March 15, 2012"}, {"Title": "Good TV but limited Browser", "Author": "P. Collins", "ReviewID": "R1JHSOS5AEV36H", "Overall": "4.0", "Content": "The TV is excellent but I have experienced a couple of problems with the Google Android functions.  Sony have been very responsive in providing support but they have advised me that the Browser does not currently support PDF files.  Some App's don't work on this Android implementation also.", "Date": "December 30, 2011"}, {"Title": "Very flexible viewing options", "Author": "Simple Man", "ReviewID": "R23GB12KCYDCJ2", "Overall": "5.0", "Content": "I had this TV about 2 months, after it updated to newest software Honey comb by its self, it gave me more choice on internet entertainments, free movies, musics and more, plus web browser. I used  Google Chrome everyday for my favorite live TV streaming from my country. I love it,than ever before on this TV age. The price go down and affordable. Thanks for the technology. I hook up Sony sound bar, it intergrated with TV automaticly, sound now more boom more exciting every shows. I also watch local TV ,when I am bored I switch to internet applications or Google Chrome, endless entertainments.", "Date": "December 13, 2011"}, {"Title": "Google tv", "Author": "Patrick S. Morris", "ReviewID": "R1SVSQHENOOEI6", "Overall": "5.0", "Content": "Having the Logitech Revue on another tv, between the two the Sony google tv is executed so much better. First reason being i don't have cable boxes, so the revue can't be used with tv content. The Sony google tv can integrate tv just plugging your cable in. I didn't miss it until i had it, it completes the experience. On capabilities, I would give Sony the strong advantage. I'm not sure what's different inside, but the Sony seems much faster, streaming hd video gives thr Revue a real work out, sometimes not working, but the Sony handles it just fine.  We've been able to stream Mtv shows and it upscales to hd stream no problem. The Revue had real trouble with this.My only real gripe is the keypad. I like the keypad itself but I'm the kind of person who will learn the layout of channel buttons to find at night without looking, not possible with this one. We use it at night in our bedroom, and you cannot find the number buttons without looking, and using the light of the tv. Backlit keypad would be much nicer. The thumb sensing mouse thing ( what is it?) works ok, but seems like it could be better. The remote is otherwise full of usefulness in a small package.The tv itself is beautiful. Chrome stand, high quality materials, not cheap plastic everywhere, glass front that goes to the edge, the sony on the front lights up, smooth white back so you can have it visible if you have that application, a nice cover over the cords in the back. I have a Sony 46v5100 that is 1080p 120hz that the Revue is on,  and the Sony google tv is a much nicer performer. I get a much nicer picture from the google tv, and dont miss the creepy 120hz. I'm not a tv expert, messing with tv tuning dvds or anything, but I do know that this one is a high quality display. I feel like since it is sort of a flagship for them with the Google tv, you get more attention to quality and detail. And since people are getting ants in there pants waiting for honeycomb based update with market, you can get an exceptional quality tv that was to be the flagship for a steep discount. But believe me Google tv is not dead, I've seen the leaked update for the revue, google tv is very much alive, and the update will expand function greatly. So take advantage while everyone labels it a failure, Google is taking regular steps towards release of the next version, just recently releasing the development kit for community application builders. This tv should not dissapoint, unless you don't mix well with new technology, but if that's the case, why are you looking?", "Date": "August 27, 2011"}, {"Title": "Great combination of tv/internet.", "Author": "Mike", "ReviewID": "R3164162POZ5YV", "Overall": "5.0", "Content": "I just got this TV a few days ago.  It is amazing.  I am already proficient at the Android OS (B/C of my Droid X) so this helped me become familiar with the ins and outs of the TV quite fast.  The only thing I can complain about is the optical sensor that controls the mouse.  You have to be directly pointed at the TV for it to truly work well.  I bypassed this issue by downloading the Google TV Remote on my Droid X.  I was able to hook up the IR Blaster to control my older Sony surround sound and DVD player.  Big plus to get rid of two remotes.  As for the picture quality, I have 4 HD TVs and it is as good or not better than the high end 120hz 46 inch I have.The TV looks awesome plus it runs Android.  Android is an awesome operating system because Google continously updates it and improves the layout/apps (I have witnessed this on my phone).  For a first generation product this TV is amazing.  Even if Google TV doesn't take off the TV is well worth the money.  I purchased the TV from Amazon for just under $1000 and the priced dropped two day after I got it to just over $900.  I was refunded the difference by Amazon's price guarantee.  Plus I got a promotional $200 Amazon gift card.  This is like getting the TV for $700.  When I was pricing Sony TVs (I only buy Sony products) the cheapest 40 inch tv was over $600.  With this TV you get so much more for a few dollars more.Overall, well worth the money.  If a second generation TV comes out I'm sure you won't be able to get it at near the price of this TV.  Beside, google will update the software and it will be just as good as a new generation google TV.", "Date": "March 12, 2011"}, {"Title": "Sony TV with internet (google)", "Author": "Gilbert L. Nicholls \"Gil\"", "ReviewID": "R3021IQ40IQKZH", "Overall": "5.0", "Content": "The Sony google tv is the most advanced unit we could find.  We have beeb using it for about a month, it was easy to set up.  Our WiFi router (from Verizon)is a bet flakey and it sometimes looses things from our network.  (It will not assign valid IP addresses).  We did not have that problem with the Sony until yesterday.  When the router screws up the only solution appears to be to reset the router.The Sony TV is fine, I do not notice that its being 60 HZ affects the picture.The google TV feature is not quite refined yet.  For some reason some internet shows which can be seen using Google's Chrome browser on a PC are blocked from being seen on Google TV!  For example hulu will only allow shows to be seen on google tv if you buy a paid subscription from hulu.  Other apps such as Netflix work fine.  All email seems to be available on the tv and is anserable from the tv.", "Date": "March 10, 2011"}, {"Title": "Terrible Customer Service by Sony", "Author": "caricbear", "ReviewID": "R3N9FVYQ1ONYNJ", "Overall": "1.0", "Content": "Have had this Internet TV (NSX-40GT1 40-Inch 1080p 60 Hz LED HDTV) for exactly 6 months. Really haven't tried all of the features, but what I tried I have been fairly satisfied with. It is pretty straight-forward in setting up and getting it going. The remote is a little difficult to understand all of the functions, but I can get by with my types of use.Here's the catch... Sony service and warranty!!! First of all, I wish you could read the warranty info before buying. Here's what has happened: At exactly 6 months, I turn the TV on and it has a reddish vertical line about 1/3 to the left of the right hand side running all of the way through the LCD panel. I tried updating the TV, tried unplugging it, checked my other TV's to make sure it wasn't the cable companies fault. Nope, just this TV. So, I go to Sony's Website, get the email address for tech support and send them the info on the problem. The next day, I get a return email with suggestions to try and fix it. Of course none of them work. That begins my journey into the vast void of Sony customer service.I call the number they provided, go through numerous menu's, wait on hold for a great deal of time, then finally speak to someone. Of course their call center is outsourced and I can barely understand the person. That person says that they can't help me and gives me a different number, but will transfer me. After waiting, and my cell phone minutes are ticking off, I get another barely understandable person. They can't help me, so again I am transferred. This person says the TV needs an LCD panel replacement, and they can send me a \"refurbished\" TV. If it was within the first 30-days, they would send me a new one. I tell them that in my experience, when I have received refurbished electronics in the past, that the functionality might be okay, but I am getting someone else's used product and usually, there are scratches, dings, or something else less than what I had purchased. Secondly, if I wanted a refurbished product, I would have bought one in the first place and at a cheaper cost. So that person transfers me to the repair department. Then I'm told I need to speak with someone else. I'm given another number to call. They also transfer me... finally, a person says that it can be taken to an authorized Sony repair business and gives me a case number and a number to call. I call the repair place, and they tell me that Sony has told them that they can't do these types of repairs. So I call Sony back, go through the menu, wait on hold, then get transferred again. Now, this person says that there's another repair shop and calls them to verify and tells me that the shop will call me. Okay, 2 hours has gone by by now. I wait all day and no call, so I call them. Then I get a voicemail and leave my info. The person doesn't call me back. So the next day I call them again. \"Oh yeah,\" he says. \"I'll call Sony and see what they want me to do.\" I said they already gave you the case number and instructions... He says he still has to call them and will get right back to me. And by the way, he is in another town 108 miles away!!! Of course I don't hear from him.So today I call him back, and he says he still has to call them and will get back to me in 30 minutes. So I wait all day long and still haven't heard from him. Now my head wants to explode!!! I then call Sony back before they close for the day. Go through the extensive menu, then get another barely understandable person, and of course, I have to explain everything and then get transferred and of course was given the 6th Sony telephone number. The bottom line is that they are now forcing me to accept a refurbished TV. But first I have to send them a proof of purchase and give them my credit card info.All in all, I've spoken with 13 people, and have spent more than 4 hours on the phone!!! It will be the last Sony product I ever buy, and I have learned a valuable lesson, try to get ahold of the manufacturer's warranty before purchasing a product. I am really disgusted with their lack of customer service and their broken product!", "Date": "February 1, 2012"}, {"Title": "Gamers Beware", "Author": "Derek Westerfeld \"derock\"", "ReviewID": "R3BCBUT1RCZ460", "Overall": "1.0", "Content": "Do not buy this if you intend on watching Blu-ray movies or play video games without experiencing some sort of lag.  Boutght this TV because of the price and because of the picture.  The salesman said it is great for video games.  Turns out he was just blowing smoke and just trying to make some commission.  Anyway, it is a good TV if all you are interested in is the internet and watching basic cable.  The TV was designed for the internet in mind.  The TV's refresh rate/processor cant handle all of the information that a video game or blu ray can throw at it which is why it will lag.  Ended up returning thr TV and getting a KDL 46NX720.  So glad we did because it is so much more superior.", "Date": "December 3, 2011"}, {"Title": "Excellent TV.", "Author": "M2G \"m2g P34CE\"", "ReviewID": "RP8CN50GNBMMA", "Overall": "5.0", "Content": "I Have had it for over a year and it has only gotten better with time. You can download some wicked apps, Its like what you have on your last generation Android Phone, only faster, and much bigger. Also Picture in picture is awesome. Menu if very intuitive. The remote control is great. after a year of use still using the same batteries. I mostly use it as my main monitor for my gaming computer.", "Date": "October 11, 2012"}, {"Title": "Just Want I Wanted", "Author": "Sharon Killoran", "ReviewID": "R3RUC43E79ZK6P", "Overall": "5.0", "Content": "I gave up cable but wanted to be able to watch Netflix on something other than my computer.  The Sony Google TV was just what I wanted before I knew what I wanted. Best Buy and Target were out of stock and I spent weeks checking back with them and eventually thought to try Amazon which had it in stock and shipped it to me within days. I plugged it into the wall and set it up within 15 minutes. No other wires or cables needed as it picked up my wireless signal and I have never looked back. Now I get to watch movies and documentaries through Netflix with great clarify. I even check my email on the big screen, surf the web and listen to Pandora.  This product exceeded my expectations. I highly recommend it.", "Date": "April 13, 2012"}, {"Title": "Sony google tv", "Author": "Td", "ReviewID": "R2755A054GQGFO", "Overall": "5.0", "Content": "We started off with buying the 32inch as we like to watch streaming videos like netflicks. To purchase other tvs and then the wireless adapter adds another $100. We also love the looks. There is a downside as there is no flash which is annoying.We now have the 32inch in the office, 40 inch in the bedroom and the 46 inch in the tv room. Also love the remote.Disappointed tHat Sony have discontinued this model , would have hoped that they would have improved the features.", "Date": "April 10, 2012"}, {"Title": "Great picture and  love the internet capabilities", "Author": "mznpwrsr", "ReviewID": "R16NSIJBLA15OK", "Overall": "5.0", "Content": "This tv is amazing. I purchased it on black friday and do not regret it at all. The picture is amazing. The contrast is great. The tv by itself looks beautiful with a white back and a sony symbol that lights up when on. The remote is easy enough to use when you gotten used to it. The only problem with it is the little tracking pad mouse but you dont need it to often so its okay. The price I bought it for was a great value and I love this tv!", "Date": "January 22, 2012"}, {"Title": "LOVE LOVE LOVE", "Author": "ms_anaa23", "ReviewID": "RXTCXUHE8CJUU", "Overall": "4.0", "Content": "I love this TV. I recommend calling the Sony helpline. Have them walk you through all the steps when setting up. Make sure your cable and wifi is properly set up before setting up this TV. If you can, buy a really long ethernet cable. This will help just incase the TV does not pick up the wifi signal.", "Date": "January 15, 2012"}, {"Title": "Sony 40\" Google TV", "Author": "paolo sabatini", "ReviewID": "R8JA409R54BGD", "Overall": "5.0", "Content": "Attention anyone looking to buy this unit, Target and Best Buy currently sell for five hundred ninety-nine dollars??!! Love this TV just don't want anyone to pay too much.", "Date": "January 2, 2012"}, {"Title": "Dissapointing", "Author": "Dinopepsia", "ReviewID": "R3A54QX6F02W2V", "Overall": "2.0", "Content": "The TV itself is ok, not nearly as good as my old Samsung, but acceptable for the price.The Rovi guide however does not work. I spent many hours with Sony support and my time is precious to me so the \"price\" is now not so good. All of their suggestions failed and my guide still says \"no data\" for each channel. A Google internet tv with no built in guide!", "Date": "December 21, 2011"}, {"Title": "Glorified browser!!!!", "Author": "alexdom22", "ReviewID": "R2YBBDFIH7YX8B", "Overall": "3.0", "Content": "I had always considered Sony as a top brand TV maker. I will have to review that thought! I needed to upgrade my Panasonic 32\" Viera with something bigger and that was a true HDTV (1080p). After some  research, I found a great deal on the Sony on Amazon. I must say that the idea of a GoogleTV did pick my curiosity. As far as the Internet functions, I was not disappointed, but the the TV quality really sucks for a Sony!!! The image is grainy, when the image contains many colors it has a tendency of being over saturated (sorry if the term is wrong, but it seemed appropriate). For a flat screen TV, the sound is ok. But the strength of this tv is its \"smart capabilities\", its remote take some time to figure out but is pretty cool!!!", "Date": "December 19, 2011"}, {"Title": "Cons and Pros, big on both.", "Author": "annieoftirol", "ReviewID": "R2BHMCPIPQN11H", "Overall": "4.0", "Content": "I am rating my overall user experience: First the bad: 1)This is a complex tv. The remote really takes studying and a lot of practice, because of the integrated google wifi, and other, functions. I CANNOT BELIEVE THAT THE TV COMES WITH A 50 PAGE BOOK ABOUT VARIOUS LAWS AND LIMITATIONS BUT ONLY A FLIMSY 11 PAGE QUICK START MANUAL! NO PRINTED USER MANUAL. A tv of this complexity absolutely needs a hands on user manual. I constantly want to look up various functions and have to go online from one place to the next to finally (hopefully) find an answer. That is a big minus for me. 2)I have an old red/white audio speaker/receiver set up and tried to hook it up through the headphone jack, the sound is horrible, tinny and small. On my last tv, an aoc, this set up worked fine with great sound quality. The only other audio out here is the optical digital out, so I'd have to get a converter ($20-30) to get a hopefully better sound.If you don't have a high end audio system with optical digital, this tv will not work well.3) I already have a high end android phone and love it, including the android market, but compared to the android phone,the tv apps here are a joke. There are only about 50 apps in this tv 'market'. I tried a couple and they froze constantly.Most apps that are already on the tv, cannot be uninstalled. Much of it is bloat ware. I could not download the apps I already bought for my phone on the market. I had thought I could use my phone apps on the tv also, but that was wishful thinking. 4) I cannot access my email pop server. Just get a blank screen. One of the things I really was looking forward to was reading my ( non google)e-mail on the tv. I am also having trouble accessing some other  sites, just get a white page. I do not know if this is a limitation of google chrome or of the tv. There is no documentation to help.The good: 1)The picture looks to be of very high quality to me. I only watch basic limited cable and also antenna tv. Both come in beautifully. 2) I love that I can be on the web and still watch the tv channel in the PIP. 3) WIFI/google was very easy to set up with my home wifi. 4) The design is really top notch, the tv is much heavier than an LED tv but looks sleek and light.All in all,I had doubts about keeping this tv because of the limited sound options and the complexity of the tv/remote functions and usage. Then I realized that an LED sony tv without the google function would cost me more that this one did on sale. Since I love the picture and style of this tv, I guess its a keeper after all. I will probably upgrade my sound system in the future. I am hoping Sony will continue to update the software on this tv, because it definitely needs it.I appreciate the amazon 30 day return policy,as it gave me an opportunity to test out this tv without feeling stuck with it.Edited 12/18/2011. I hooked up my old Sharper Image audio system to the headphone plug and now have very good  sound. I have also used netflix and am totally pleased with the picture. Streams flawlessly. Picture quality remains excellent, I am more enthralled with this tv and am upgrading to a 4. Documentation issue remains a minus for me.Edited 01/26/2012: After another month of usage, I find the following: The tv function works great and I am very happy with it. Crystal clear picture on HD. On the other hand, the google/android function is pretty bad. I guess I am spoiled by my flawlessly functioning Android smartphone and the many things I am capable of using it for. The tv just isn't there yet. It seems to need a lot of software and hardware work (stronger processor) to be truly useful as an internet tv. The very limited number of applications that actually work well,the constant freezing, the constant stopping and starting when trying to play online videos,the many error messages and 'force closes' etc, etc, etc., make its use as an internet tv very frustrating for me. It's easier to just use the laptop and stream to the tv via HDMI cable.The good: The one great discovery was that my smartphone handles an android market application that turns the smartphone into a remote for the tv. So I use my sleek phone as a fully and very smoothly functioning remote for the google tv. Is that great or what?Would I buy the tv again knowing what I know now,after 2 months of usage? Probably not, I would wait for a more developed version. The frustration with the internet part of the tv is just too great. I like the idea but I feel that this product was brought to market before it worked the way it should.", "Date": "December 16, 2011"}, {"Title": "Very good TV", "Author": "Tonyg", "ReviewID": "R366B9BQOGODGX", "Overall": "4.0", "Content": "Got this TV on about 9/30. Delivery was on time and it arrived in good shape, no nicks or dents. Set up was fairly straight forward though I had to call the support for assistance with the IR s for the remote. The support person knew exactly what to do and that part was done efficiently and quickly.The Tv is very good, not great. I think that my expectation of other Sony TVs is what did it. I have played with and continue to try different calibration settings. The Blacks are not deep blacks. I also have a 6 year old Panasonic plasma that has a better picture to me, but this Sony has a very good picture.Starting takes a few seconds but I have no problem with that. I am still learning the remote but am comfortable with it for what I currently use. No problem with using the applications as Netflix etc. It all works fine. I do like all the different options to see what is currenly on etc. Love having the internet at my tips while in bed.Overall, I do like this TV alot. My younger daughter is now saving to by her own. Received my first software update this week and looking forward to more.", "Date": "November 1, 2011"}, {"Title": "sony nsx-40GT1 LED", "Author": "Russell C. Belcher \"biker boy\"", "ReviewID": "RMJRAXT4YEAJS", "Overall": "5.0", "Content": "The Smartest, Smart TV on the market, Period. This TV will do it all. No complaints here. I am totally satisfied with every feature on this LED tv. Sony has more APPs than anybody. Very easy to set up. The complaints I have read about this TV tells me that some buyers just don't know how to use this TV. Picture is perfect, I hooked my sound system up with no problems, same with DVD BluRay player.Fast internet access, actually faster than my computer. Five stars all the way. I replaced a Samsung 40 inch LCD that quit working after only 3 years, I will never buy another Samsung TV. Sony is the BEST.", "Date": "September 30, 2011"}, {"Title": "Fantastic!!!", "Author": "Eiric Baardsen", "ReviewID": "R50UEW16ORTFS", "Overall": "5.0", "Content": "Fantastic product!!! Can't believe this hasn't taken off more!! My family and I are in love with this Sony Google TV!", "Date": "July 31, 2011"}, {"Title": "Glad I bought it.", "Author": "Ozzie \"osvaldo cruz\"", "ReviewID": "RV7XNREXZKEW3", "Overall": "5.0", "Content": "This Google t.v. is exceptional and I recommend it. My only \"con\" remark is that it has no component in' or out's, other than that set it up and enjoy both,the t.v. and goggle!!!! Update,now that I've had the t.v. for six month it is the best deal I made.It's in my bedroom and I don't bother going to my computer anymore.", "Date": "July 28, 2011"}, {"Title": "Sony Google Tv \"The Best\"", "Author": "BroChris", "ReviewID": "R3O28KQYM75Q2W", "Overall": "5.0", "Content": "Greatest introduction to the future of internet meets HD TV.  Everything the internet has to offer and more from the comfort of your bed or couch!", "Date": "June 14, 2011"}, {"Title": "only one small problem", "Author": "siobi", "ReviewID": "RIY6NUXDNY00D", "Overall": "5.0", "Content": "I bought this tv with the intention of using the internet to stream videos and not have any cable or dish network.  What I didn't realize is that the television doesn't pick up ANY television stations without an antennae.. Which because I live in a rural area will run me 75-100 dollar (according to the sales guy at best buy who explained to me why I couldn't get the tv portion to work)  That being said, I really enjoy this product. It has good color and sound, the remote is easy to use and even a technologically challenged individual like me can figure it out. Also there is plenty of content I can stream so I don't really miss having regular tv channels", "Date": "January 4, 2012"}, {"Title": "Do NOT buy if you think you might ever want to play games on it...", "Author": "H. Keefe", "ReviewID": "R2R9KLMXK26TV5", "Overall": "2.0", "Content": "For starters, the picture on this tv is fantastic, whether it's coming from a BluRay, Netflix, or live TV. I LOVE the picture quality. I also absolutely love that with the Plex app available on the Android Market, I can pull up all my tv shows and Movies that are shared from my server downstairs (it happily plays full 1080p content over my network which is wonderful!) If that's not enough, the netflix app works great, and the tv does a decent job of giving my a good listing of cable tv as well. It would be nice if Hulu would stop being stupid about allowing me to stream their content to this tv though (seriously, it just boggles my mind that they stubbornly refuse to allow this to happen on Google TV devices...) I am giving it one more month and I will be cancelling my Hulu Plus account if I still can't pull it up on this tv without hooking up one of my gaming consoles.Speaking of consoles, this is where this tv really falls short. You might notice the fact that there are 4 HDMI inputs, plus 1 composite input, which would let you play whatever gaming devices you like, but you would be mistaken. This tv is TERRIBLE for playing games. I have read complaints for many tv's out there about lag with games, but I have never seen anything THIS bad. It truly is unplayable, and Sony very arrogantly states that this is how this is TV is intended to function. Don't expect a Firmware Update from Sony to add something like a game mode to this TV. This is a huge bummer. Currently, my PS3 sits hooked up to it for BluRay and Hulu Plus, but since finding out just how awful the delay times are, gaming is not even an option, so I would kind of like for my PS3 to go back downstairs on my old Sony Projection TV where I can actually play games. What a JOKE. Absolutely pathetic.All in all, I kind of wish I would have passed on this TV. I still like it, but for all the awesome things it does, not having the option to play games is totally lame, and Sony flat out refusing to address the issue really bums me out. If we could hold out hope for a firmware update that would allow the TV to bypass all the processing that goes on to enable playing gaming, it would sting a bit less.If you have absolutely no interest in playing games on this television, and don't think you ever WILL have an interest in the future to play games, you really will fall in love with this TV. Minus the gaming thing, it's actually a really really great TV, with features on offer that you simply cannot find on any other TV. The remote really isn't that bad either,and even better than that, if you have an Android phone, you can get the Google TV Remote app for free and control your TV with your phone instead (which I find works even better than the included Sony remote).If I were to do it all over again, I would have purchased a regular HDTV, and then bought Sony's BluRay/Google TV combo box separately. This would give you all the great features of the Google TV integration, PLUS you would be able to hook a console or PC up to it and not experience the laughably bad delay times you will find with the all-in-one TV version.", "Date": "December 18, 2011"}, {"Title": "Good product", "Author": "rodi", "ReviewID": "R3M22FN5CWIJMD", "Overall": "3.0", "Content": "We purchased this TV about 6-7 months ago. The quality has been good and the remote has been very easy to use. The biggest downside is that you cannot watch Hulu or watch shows on any of the network channel websites (example: ABC). Google does this to force  you to pay for Netflix and it can get quite annoying since Netflix is a season behind!!", "Date": "December 12, 2011"}, {"Title": "Changed my TV world!", "Author": "sastudio", "ReviewID": "R45SW3EH3RIM6", "Overall": "5.0", "Content": "The Goggle TV is amazing.  Fast to install and very easy to get this bad boy up and running.  The picture quality is better than I expected after ready the reviews.  The winner that has changed my viewing world is the seem-less interface with web.  I never use cable any more.  There are plenty of streaming options from sony,netflix etc. Also, like the google fone more and more specific app's for the google TV keep on coming.  I totally recommend this TV.", "Date": "April 13, 2011"}, {"Title": "Sony google TV", "Author": "Penny J. Barwick \"p3452\"", "ReviewID": "R3G5OAENJRMQUY", "Overall": "5.0", "Content": "I had another Sony that had a projection bulb that was going to cost a small fortune to replace.  I like the products Sony makes and haven't been disappointed yet.  I bought the Goggle TV with hopes that I could get TV shows and movies and not have to go through amazon unbox.  Many of the channels work like a charm, some are just beginning to catch up.  The set up was smooth and easy.  If you use a keyboard for a cell phone you'll be able to use this one too.  It's bigger, but doesn't feel awkward in your hands.  Picture quality is beautiful.  The quality is beautiful and you feel as though you are standing in the middle of scene of any TV program or movie.  Watching TV while you surf the net is great.  I have a college student in the house and she can check her grades while we watch a show, or see what the schedule will for school for the week.  All in all a great product.  I have not found one disadvantage to the product.  We don't have cable or satellite and use an over the air antennae.  I call it my starship enterprise antennae due to the shape.  We live in the middle of a rain forest and still get good reception.  Made the right decision and bought the right product.", "Date": "March 13, 2011"}, {"Title": "No cord included", "Author": "Johnnie Williams", "ReviewID": "R2QSHATJ8NSXQJ", "Overall": "3.0", "Content": "I bought this product from the seller.  I was really nervous because when the package arrived there was no cord included in the box.  Who sells a tv with no power cord?  Luckly the TV worked great, but it would have been nice if the cord was included.", "Date": "August 28, 2013"}, {"Title": "AWESOME T.V.", "Author": "Vikas", "ReviewID": "R1G7YLXFO9CYUC", "Overall": "5.0", "Content": "This TV is perfect. great picture, great sound. No complains. Truly an internet TV. I would highle recomend this TV.", "Date": "August 27, 2013"}, {"Title": "I love this smart TV", "Author": "sanjurman", "ReviewID": "R2D02E1TQ3N1S1", "Overall": "5.0", "Content": "Great picture, great sound without a sound bar! I can access the Internet, watch Netflix, or any of the other applications offered through the Internet. A great purchase!", "Date": "May 13, 2013"}, {"Title": "After 2 Years", "Author": "stinnergy", "ReviewID": "R3CP2WWO6LBL2G", "Overall": "4.0", "Content": "I'm anti-payTV and after spending last weekend with the wife and kids (boys 10 & 5) viewing TV in a hotel room, I'm convinced of my view.  We have an old antenna in our attack with coax going to Sony/googles in the master BR and the living room.  With free signals from San Francisco and Sac, espnGO,YouTube, crackel, websites, and if I ever want to spring for a movie from Netflix/amazon, apps ... What more is needed?  Not all the apps for my pad are available for Google TV.  At this point  Iheart radio isn't a TV app, but if it was really needed, I could plug it in to one of the TV ports from the tablet.  When first purchased (2 years ago) it was a gamble without knowing the future of the format, but I am pleased!  Updates have been great.  Most recent update allows flinging YouTube from the tablet to the TV and cueing other YouTube videos to follow.  I'm curious about the new voice control.  It would be cool if the voice on a tablet remote app would allow the new voice control update - not that I would use it that much, but to would still be cool.  I should mention we have home wifi.", "Date": "April 8, 2013"}, {"Title": "A great TV", "Author": "K. Melton", "ReviewID": "R2PIDH47017RR6", "Overall": "5.0", "Content": "This TV has been excellent for us. The quality is great and we don't need an extra console for streaming video.", "Date": "March 18, 2013"}, {"Title": "LOVE IT", "Author": "AmAzOn FaN JD", "ReviewID": "RUH045JCA92PM", "Overall": "5.0", "Content": "While I am sad that it can't work with many companies/sites like ABC etc etc.  But the customer service for this product was simply amazing.  Truly good people and product arrived in excellent condition.  Good quality TV and competitive pricing.", "Date": "February 28, 2013"}, {"Title": "Couldnt be Happier", "Author": "emkay", "ReviewID": "R3VNF7WQERG883", "Overall": "5.0", "Content": "This TV can do everything. I love being able to steam netflix, and youtube without a separate box. The picture with an HD box is amazing. Volume is great. Really couldn't be happier.", "Date": "February 11, 2013"}, {"Title": "So much potential...", "Author": "R. Ray", "ReviewID": "R1W6QW1RGRJN5J", "Overall": "2.0", "Content": "All in all it is an okay TV. Much better than one that is non-networked. However, in my estimation, the fact that it does not play Hulu (despite having the Hulu app icon) as well as other video (like ABC.com) is a MAJOR limitation. It's like having a car with no doors. It works fine, but it's just very incomplete. Not sure what other options are out there, but this is a lukewarm option at best.", "Date": "February 8, 2013"}, {"Title": "love this", "Author": "Cory Parsons", "ReviewID": "RNUE5P0790UTT", "Overall": "4.0", "Content": "i love this smart t.v as it is the best one yet that i have bought and am gonna buy another.", "Date": "January 5, 2013"}, {"Title": "Sony - Great Features", "Author": "NCRadioman", "ReviewID": "RVA6VF54KF1UZ", "Overall": "5.0", "Content": "Actually got two of these for our daughters for Christmas 2011.  Both continue to ply very well, great features/aps, and were easy to set up.", "Date": "December 28, 2012"}, {"Title": "Incredibly crisp picture... Love all the features", "Author": "Howard", "ReviewID": "R2LC93XLKHM725", "Overall": "5.0", "Content": "Our family bought this TV last year after Christmas.  The picture quality is better than even the most expensive TVs we saw when we bought it. With a click of a button we can go to the internet and watch YouTube or do a search.  Another button gets you into netflix and for those of us on DirecTV, this adds more film watching options.Not sure why this didn't catch on except I'm sure the well funded inferior products threw cash at dissing it.  That's what happens in the \"free market\".  Unfortunately those with the most resources can force their inferior product into the mainstream by throwing a lot of cash at disinformation.  bummer", "Date": "November 25, 2012"}, {"Title": "Simplicity, convenience and elegance", "Author": "Thomas E Chang", "ReviewID": "R3PDOVJ3EQ06M1", "Overall": "5.0", "Content": "When we bought the NSX-40GT1 in Dec 2011, we were looking to transition away from an insanely heavy 24\" television from the 80s. Needless to say, we don't watch much TV, and we've never subscribed to any TV services. We're not into gaming either. We only watched DVDs and the occasional VHS. However, we do use the internet excessively from a variety of mobile devices. So really, we were looking for a television that had the simplicity, convenience, and elegance of a mobile internet device, but with a screen large enough for our living room (we live in an historic bungalow, so our living room is not large). The NSX-40GT1 continues to fit that bill. We now subscribe to Netflix, though we still don't subscribe to cable TV. Between the Chrome browser, YouTube, the Google PlayStore Apps, Netflix, our first gen Apple TV, and our DVDs we now have way more entertainment than we have time or motivation to engage in. Even the Netflix seems like an unnecessary expense at times.Our only concern is that Google will neglect, or even abandon the Google TV service like they plan to do with their iGoogle service (really misguided move IMO).  At this point in time, we are still seeing new apps in the PlayStore arrive every now and then, and the occasional update, so I have no complaints. I just hope Google and the App providers don't forget about those of us who invested as the first generation of adopters. But supposing that happens, the TV is still excellent even without the apps, and we don't fear total obsolescence any time soon.Oh, and the picture and sound are good quality. For our purposes, it's tough to imagine a TV that fits the bill better.", "Date": "September 11, 2012"}, {"Title": "Best Smart TV", "Author": "Fela", "ReviewID": "R8BOAV13SKYBC", "Overall": "5.0", "Content": "Out of all the T's I've bought n the past ten years, this is by far the best performance, best looking best at its best ....I love this freaking TV....It does everything....", "Date": "September 9, 2012"}, {"Title": "Its been more than a year now and still love it", "Author": "Manoj Paudel", "ReviewID": "R2T3DOEYUPKXTE", "Overall": "5.0", "Content": "Love this TV. Chrome browser and an awesome youtube app is worth every penny you pay for this tv.  Only thing I am not impressed is keyboard.. it somehow feels not right but rest is awesome.", "Date": "August 27, 2012"}, {"Title": "Good Buy", "Author": "Vijay", "ReviewID": "R118ZMLCONGHS2", "Overall": "4.0", "Content": "Performance of this TV has been really good ... this is my first internet tv and also my first LED/LCD based television.  colors are good ... there is an yellowish tinge sometimes on black background images ... not that distracting though.  Internet option is really good. able to watch live cricket matches over this television by browsing to few free links.  Overall impressed with the quality of television.  1 disadvantage is the glossy screen.  Sometimes makes it hard to watch tv with a light from behind us.  we have to compensate by darkening our ambience.  remote is really good to use ... very easy and intuitive to operate.  Overall a good buy for a normal user.Before buying i had read a few reviews who really wanted to use this as a computer than a television.  probably for those folks this television is going to have some hickups ... but for normal television users who want netflix/internet access thru a television .. this a very good buy ...", "Date": "August 22, 2012"}, {"Title": "Love the TV on many levels", "Author": "L Family \"Avid book reader\"", "ReviewID": "R1LR29NEEI11DB", "Overall": "5.0", "Content": "Bout this TV in December 2011 for Christmas. Best TV on many levels and with growing number of Google TV Apps gets better with each day. The only slight issue with regards to picture quality is: If one views the TV at an extreme angle there is a little less clarity and a washing out of color. Wish Sony made more Sony TV's rumor is that in 2013 they will with LG and Samsung as well. Love My Google TV and being made by Sony its excellent!", "Date": "August 14, 2012"}, {"Title": "fantastic tv", "Author": "bsmpm", "ReviewID": "R1SIC0MZTU83OQ", "Overall": "5.0", "Content": "We purchased the 40inch just over a month ago. It's very beautiful and it's awesome to be able to quickly surf the net. The remote is very sufficient and easy to use plus to have a key board right on it makes it so much better than any typical remote. We do have to sometimes use our regular cable remote to select \"yes\" and \"no\" like when you want to delete something on your DVR and it ask \"are you sure?\" but still no big deal. It's cool to be able to adjust the screen to which ever side of the tv you want when it's picture and picture plus adjust the size of the screen. It is over all a great price and great investment. I would strongly suggest anyone who is interested in this tv to definitely buy it", "Date": "July 30, 2012"}, {"Title": "The future of Television is so evident", "Author": "Gunnar Forsgren", "ReviewID": "R62MC1AYI8121", "Overall": "5.0", "Content": "This is the coolest TV set that Sony has ever come up with. I got the NSX-46GT1 and love everything about it. The potential for the future of Television is so visible here. Yet Sony decided to drop the product line based on U.S sales. That was a very unwise decision by Sony who need every technology advancement they can find. Here they had the upper hand in many respects.Now instead the reverted to selling anonymous TV sets that few care about. Well those early sales results likely much a result of product reviews in Android 2.2 days. Once Android 3.1 was out on them (and now 3.2) these TVs took on a different life. As an app developer I see all the potential and am very happy about my NSX-46GT1.", "Date": "May 26, 2012"}, {"Title": "Awesome TV", "Author": "Abi", "ReviewID": "R2HRFLGARM1SN8", "Overall": "5.0", "Content": "This is a very good TV. Myself and 2 other my friends got this TV in 2011 October. All works fine.", "Date": "May 8, 2012"}, {"Title": "Lots of new options", "Author": "James Thomas Pease", "ReviewID": "R1NFM6B03HQQAP", "Overall": "4.0", "Content": "I am very pleased with this product. It opens up a whole new world of ,entertainment options. I can link with my laptop,android phone and tablet as well. Everything in HD. Its great for surfing the web.", "Date": "March 23, 2012"}, {"Title": "Love it", "Author": "Thomas R. Carter \"HiTech\"", "ReviewID": "R2L78RBFF3F309", "Overall": "5.0", "Content": "we have had this of a couple of months now and this is a great TV. my sones use it all the time for netficks and youtube. The only problem with this TV is the remote is a bit awkward for controlling our cable box, the the flexability of the keypad is worth it.", "Date": "March 12, 2012"}, {"Title": "Worth waiting for!", "Author": "martin goldwasser", "ReviewID": "R374TK1MK9RC0Z", "Overall": "5.0", "Content": "As the title states, this HDTV was certainly worth the wait. My wife and I did our homework, and it certainly paid off. It is a real bargain for the money. The picture quality and sound are excellent. As hockey fans,we feel like we're closer than rinkside. What a treat following the puck! The Google feature works great and the remote makes it so easy to navigate from one site to another. As for looks, the sleek design, anchored  on the paperclip stand, looks great in our den. If you are in the market for an HDTV, this is the one for you!", "Date": "March 11, 2012"}, {"Title": "A nice HDTV", "Author": "Evelyn Kim Dang", "ReviewID": "R1EQ9YK5WM0NT8", "Overall": "4.0", "Content": "Overall, this HDTV is nice.Honestly, I don't know why people are having problems with the remote. If you're somewhat tech savy, then this is the perfect tv. It's fun to use and has a really smooth look and feel.This HDTV works with ALL consoles. The only problem that this HDTV has so far is that there is a slight lag when you are playing video games. I'm going to try and calibrate the tv and game(check game's options.), and hopefully it will be at the right pace!", "Date": "March 9, 2012"}, {"Title": "Google TV", "Author": "Hat", "ReviewID": "R3VNE81XLLZBL2", "Overall": "5.0", "Content": "This is an awesome TV. The picture quality is excellent. This TV was easy to set up and has a great remote. Thank you Amazon!!", "Date": "March 6, 2012"}, {"Title": "Lived upto my Expectations", "Author": "Rockman", "ReviewID": "R1EEEBMMC3WQ7I", "Overall": "4.0", "Content": "Initially I was very confused as there were so many options available for internet TV varying on different parameters like pricing, features, TV dimensions etc. Pricing was more concerned for me as my budget was around $500-700 max for internet TV and in that range this TV fitted the best. The prime feature I was looking for was inbuilt youtube app & browser and Sony-G TV fullfils both of these. The browser is just like any other browser it has Google-Crome browser inbuilt and you can open any website mostly the same way you open any in your PC or Laptop. Picture quality is nice but the only area where I see it lacking is low refresh rate (60Hz). Hence while playing inbuilt games you'll not feel good as the screen flickers alot. But overall I'll say good deal if you like 40\" internet equipped TV with inbuilt wi-fi.", "Date": "March 3, 2012"}, {"Title": "Great TV", "Author": "Suresh", "ReviewID": "R3TMQGDHBZYMXS", "Overall": "5.0", "Content": "I cant give comparative review when it comes to picture quality as I am not much aware of other LED TVs. But I am very happy with the picture quality.I feel it would be little difficult for some people to use it (I may not be correct atleast my parents are not able to use it sometimes)I used Netflix a lot with this.  There are a lot of streaming sites which stream HD videos/movies/documentaries.Actually this just like an android tablet which is zoomed in size minus touch screen.Happy With...- I was able to stream videos from my laptop/pc to this with my wireless network.- Able to connect my external drives.- There are add-ons U can install in chrome so that when U open the link in chrome (in laptop) and click on send to tv the same link is opened in TVs browser (this comes handy when U found some video or something and want to open the same link in TV)- Can play some games... though I am not happy this with as there are not many gtv supported games available.- There is a feature in latest windows media player (play to) which plays the movie on tv instead of pc/laptop (just like streaming)- I use it for browsing sometimes (though rare)- Updates happen easily.- Looks beautiful :-) Looks like a very big Ipad.Not Happy With...- We can't play all the video formats (most of the video formats I had were not supported, though we can stream them from pc/laptop with DLNA) ******  (Just for this reason I dont want to reduce a star :-))- I felt, its capabilities are not used to the fullest (I think gtv is still evolving and in its very young age)- I read that HULU is not supported though I am not aware of this as my TV doesnt support it(might be something like netflix)", "Date": "March 3, 2012"}, {"Title": "Amazing TV for the price", "Author": "Analogue Junkie", "ReviewID": "R14U059TU99ELF", "Overall": "5.0", "Content": "I purchased this TV last week and I absolutely love it.1. Picture QualityAbsolutely stunning! Great picture quality. I can't believe how good the picture quality from Netflix and Amazon instant movies is. Picture from AT&T; U-verse looks great (plugged in with an HDMI cable). I haven't seen too many complaints about picture quality from other reviews, but if you happen to see any I would absolutely disregard them.2. I/OTons of inputs, more than my 56\" Samsung DLP. Over all plenty of I/O so no worries there. My favorite feature are the 4 usb ports. You can plug in a flash drive or external hard drive and play .avi, .mkv, and other movie formats directly on your TV flawlessly.3. Google TVThis feature is amazing. Google TV takes your cable (or satellite) service and combines it with services such as Netflix, Amazon Instant, etc. and gives you a well organized browser to choose from different movies and TV shows. It definitely creates a fun, and quite unique, media experience.4. Android appsLet me start off by saying I am a die hard Apple fanatic. I own an iTouch, iPhone, iPad, iMac, and several other apple devices. I was expecting to be disappointed by the app selection for the TV. Although I still prefer Apple apps hands down, there is a surprisingly good selection of different apps to choose from.5. Keyboard RemoteI have read quite a few complaints about the remote and I say rubbish!!! This remote is the coolest TV remote I've ever played with. Works great, optical mouse isn't perfect but I really don't use it all that much. The main thing I love about the remote is it can control all of your devices so you don't have 5 or 6 remotes to fiddle with.OverallI love this TV and I am so glad I purchased it. I would recommend this to anyone looking for an internet TV with loads of features. I had a few concerns after reading some reviews, but any bad things I've read are because of the following:A. People are stupid and/or techno-retardedB. One person says their Google TV is stupid and only does Netflix well. That is complete rubbish, I have browsed the internet on the TV and if it takes you 10 minutes to type a few sentences you have some serious problems. It plays videos from netflix and amazon instant well, works excellent with all input devices I have connected to the tv and there are some cool apps to choose from.C. I think some people just hate everything", "Date": "February 29, 2012"}, {"Title": "We love this TV", "Author": "Kim", "ReviewID": "R3QITN1JEW0DXE", "Overall": "5.0", "Content": "We have never had a big flat screen TV before this was our first.We live in the country and do not have satellite or cable for our TV, we use free over the air antennae that is all. We only get 10 channels from our antennae.  What we like most is that our Prime membership allows us to watch thousands of movies and old TV shows on the Google TV--for free!  The kids also like to watch YouTube videos.  I like being able to Google information while sitting in my recliner in the living room.I think the set up was very easy, just follow the directions on the screen.  Using the remote is easy too.  Sony has great support if you have a question you just call them and speak to a real person.  We ordered this from Amazon when the 40 inch was $650, it goes on sale from time to time.  We set it up ourselves, no problems.We have had the TV for about a year and only had it go off one time but Sony showed us how to reset it: just the regular ctrl/alt/del buttons and it worked fine again.Much better than just a big screen TV and if you wait for a sale it really isn't much more expensive it at all.", "Date": "February 27, 2012"}, {"Title": "Great TV", "Author": "Deveree \"Deveree\"", "ReviewID": "R1TXGWX2GVE5NZ", "Overall": "4.0", "Content": "I am so glad I got this tv it is fantastic! I bought it mostly because with it being internet ready I can mount it above my fireplace and still connect to my Netflix and other tv viewing wirelessly. The app store is fun too - you can completely customize this tv to your specific needs and wants. Thanks Sony and Google for making the perfect tv", "Date": "February 25, 2012"}, {"Title": "love it", "Author": "ashley__sf", "ReviewID": "R1LVD5ZVQ1ZU5G", "Overall": "5.0", "Content": "i really like the tv, i have it connected to my soundbar from sony too and its wonderful. the internet aspect is a nice feature, saving time if you need to surf and offers picture in picture while surfing. its my only android os device, and i like it.", "Date": "February 19, 2012"}, {"Title": "Frustratingly good product", "Author": "Strapjack", "ReviewID": "R2E0VMHLYVCW9P", "Overall": "3.0", "Content": "Bought this TV 3 months ago. Had an old 32 inch Sony picture tube set before. Thedifference was breathtaking. This set looks so good and the picture is so stunning, I just stare at it sometimes. We have it with the Sony BluRay 3D Surround Sound Home Theater system so the capabilities are quite vast. Downloaded a free app that makes the screen a spectacularly colorful aquarium. The Ipod docks a nice feature. The picture in picture while on the internet is a great feature. The frustrating part of this is that the 0ptical finger sensor, which moves the pointer like a mouse, does not work sometimes, usually just when you need it the most. So then it forces you to shut off your TV, and get on your home PC.", "Date": "February 18, 2012"}, {"Title": "Amazing TV- PERIOD!", "Author": "Armilano", "ReviewID": "R2JVOD63CD5TBV", "Overall": "5.0", "Content": "I've had this TV for 2 days and I am blown away!  Awesome picture, and I still have crappy old school cable. The sound is about what I expected for an LED TV.  The TV itself looks awesome.  Other than the $3000 Samsung units, it's the best looking one I have seen.  I am a Samsung guy and I just couldn't pass this TV up for the price, and I am glad I didn't.  The only beef I have with it is the screws for the stand, damn near imossible to not strip them.  No biggie since it will be wall mounted soon anyway.  The remote is not Sony's best.  The mouse takes some getting used to and it should be backlit.  The features are endless.  Took about 30 - 40 min for the initial updates, no biggie.  I dare you to find a nicer unit for $600.  I will however reccommend making sure you have a TRUE high speed internet connection and HD cable to truly appreciate this machine.  The free shipping only took 6 days, Best Buy was 2-3 weeks, so Thanks Amazon!  I will update my review once we switch to HD cable.", "Date": "February 17, 2012"}, {"Title": "Like a Giant IPAD!", "Author": "valerie", "ReviewID": "R2ZZ7J053VK30C", "Overall": "5.0", "Content": "Sleek design and great wifi reception. I use it to study on line and it is perfect! I have not connected it to tv at all because netflix and all internet acessible chanels are available! I LOVE THIUS TV! Surfing the net is sooooo simple!delivery was actually early and very smooth! great buy! It was a little more than at a local name store BUT it was never in stock so worth every penny! LOVE AMAZON!", "Date": "January 25, 2012"}, {"Title": "Amazing TV for key features in it LED/Internet/SoundQuality/Overall Design", "Author": "TechUser2012Gen", "ReviewID": "R2HM5QY8CQOI75", "Overall": "4.0", "Content": "I am not a gaming guy to start with, so I can't emphasize/negate those reviews on video gamingconsoles.I want to highlight more on internet part of this TV which is amazing. As long as you've decent internet connection, this TV is gonna thrive. I bet myself on it.You've android TV apps includes YuppTv, apps include kids story books to games etc whatever on the android market. This TV updates itself with latest software fixes and updates. so I'm sure if there is any compliant about the issues related to software, The BASIC TRUST is that Sony should be working hard to post the updates into your TV as they got the fixes and newer features (remember the major update around Nov 2011).In addition to this, TV has amazing sound quality, fantastic LED picture, 1080pixel quality, vibrant contrast features, HDMI capabilities, identifies and streams (plays) videos/photos/music from your laptop if connected in the same wireless network, connects to internet wirelessly (also), With Browser you can access internet for videos etc, as internet is endless you've endless options of entertainment, not sure on virus and antivirus matters so far though.I am extremely content that I've surely got every pennny back in return.Cons: If possible I'll ask all below features from sony in future (may be for slightly higher price range: if there are no models in similar price range):--> internal memory from current 8GB to 16GB or 32 GB.--> ability to store streaming videos (like youtube videos) into internal memory--> better capabities to manage photos/videos/music on internal memory (and copy them to pen drive etc and vice versa)--> 120 Hz refresh rate--> a HDMI cable in the box--> a usb drive with some sample videos/photos/music and user guides/how-to manuals in it.--> possibly sleeker key board with backlit as an option--> built in WiDi receiver--> PDF view capabilities (did not test it really: but its a guess to read any attachments of emails)", "Date": "January 5, 2012"}, {"Title": "Sleek styling and beautiful picture", "Author": "Wordworm", "ReviewID": "R3LOSX0HWFT06G", "Overall": "5.0", "Content": "This tv fades into the background when not on. Very clean lines. We are loving streaming video directly from the tv. Sound quality mediocre, after all, it is just a tv. Getting speakers and receiver to get the most out of its features. It was great to have the big box delivered right to the door. Easy to unpack and set up.", "Date": "November 27, 2011"}, {"Title": "from the future!", "Author": "asher217", "ReviewID": "R2TQJUYSVUNQGT", "Overall": "5.0", "Content": "I love it!  The remote controls my cable box and my ps3.  In addition, I can watch amazon instant video!The picture and sound are great and the remote is so cool!", "Date": "October 29, 2011"}, {"Title": "Super Tv", "Author": "Jimmie K. Autry \"Sweetie Pies Chosen\"", "ReviewID": "R3HI82CYZIW0LN", "Overall": "5.0", "Content": "I think it is the best tv for any price. It's very light and 2 seconds to the internet with my mifi card. Amazon never disappoints, It came free shipping in four days, I love it.", "Date": "September 24, 2011"}, {"Title": "TV Doesn't last", "Author": "James", "ReviewID": "R21DOYXNVQQ89N", "Overall": "1.0", "Content": "I bought this TV for the bedroom.  It gets less than 1 hour a day of use.. usually even less.  It gets turned on in the morning to watch the news while I iron.  In less than 1.5 years of use its dead.  I have a blinking red light and sony support is of no help at all. The \"helpful\" tech told me that the light was a code that would tell us what was wrong but that they didn't have the info to decode it.  Keep in mind I CALLED SONY.  Google told me that it is a power board issue, at less than 1.5 years.  I have a Vizio TV in my living room (what is supposed to be a low quality set) that has lasted 9 years!  The high End Sony hasn't made it 1.5... SAD that the quality has gone down that far.In other words if you want something that lasts don't purchase this product!!!!!", "Date": "August 13, 2013"}, {"Title": "lousy media player", "Author": "confused", "ReviewID": "R23SFWMSBLPGAR", "Overall": "1.0", "Content": "Very limited on the video format it will play If you plan on streaming video to this TV through Ethernet forget it. as a basic TV its ok...", "Date": "December 28, 2012"}, {"Title": "poping", "Author": "Joe", "ReviewID": "R1NCM4A3KNNVP1", "Overall": "1.0", "Content": "Brand new tv after 45 minutes it starts to make a popping sound only way I could make it to stop by on plugging sony would not fix it so I sent it back to amazon", "Date": "January 2, 2012"}, {"Title": "Great picture, phenomenal functionality.", "Author": "DewDrop720", "ReviewID": "R28CM9FUTP153Q", "Overall": "4.0", "Content": "Love this tv!  The remote is a bit of an adjustment but makes app/web navigation a snap.  The internal wifi receiver is a valued amenity.  The only limitation is the number of connection points for other/older AV devices.", "Date": "December 31, 2011"}, {"Title": "Outstanding value for the price", "Author": "GC", "ReviewID": "RHBWSCB7O6SSL", "Overall": "5.0", "Content": "This TV is an outstanding value for the price. No need to worry about having a wifi compatible DVD player or Xbox, or Roku. It does it all for you and it all interfaces seamlessly. The picture and sound are fantastic. Lower refresh rate is no issue, picture and brightness are great. Sound is much better and any other flat screen TV on the market.This TV is a very playful set. Good looks, picture in picture capability, browsing the web while watching your favorite show...it does it all. Set us was a breeze and the quality of the materials and finish is far above any LG or Samsung TV currently available on the market. I would recommend to anyone who is looking for the best bang for their buck! No hesitation or remorse!", "Date": "November 30, 2011"}, {"Title": "Do not buy it.", "Author": "Nibler", "ReviewID": "R3LCJQADBVDI08", "Overall": "1.0", "Content": "Mediocre TV , mediocre streaming player.Do yourself a favor and buy a good HDTV with option toconnect to your laptop or PC as a second monitor,so that you can stream Netflix and such thru it.Everything works  veeeeeeeeeeery slow.", "Date": "June 16, 2011"}, {"Title": "sony tv might not be a samsung", "Author": "Khoneding Vongthongkham", "ReviewID": "R2FQA2SSIUNXWQ", "Overall": "5.0", "Content": "sony tv ive had this tv for a few years now it works great for me picture might not be as good as our samsung in the living room but im very happy with my tv i can surf the net on it fine", "Date": "January 17, 2014"}, {"Title": "Only plays Sony apps", "Author": "driftless", "ReviewID": "RGDS4MJLDCWQ0", "Overall": "2.0", "Content": "You can only use apps whose companies have paid Sony for the privilege.  If you want to read a pdf download, forget it.  If you want to listen to music from a radio station that streams m3u, forget it.  This is not the internet, this is Sony over IP.", "Date": "November 21, 2012"}, {"Title": "Doesn't support any media player app with subtitle support", "Author": "Gaia Rockweiler", "ReviewID": "RD8BYO0LBESE6", "Overall": "2.0", "Content": "This TV is a DUD! It can't display subtitles with any of the media player apps. What kind of terrible design is this? Now, if I want to watch Japanese anime from a USB device, I have to hard-encode the subtitles into the video. Terrible!", "Date": "November 18, 2012"}, {"Title": "Useless device!", "Author": "Bora Ozturk", "ReviewID": "R2GP42ANXRZ4N6", "Overall": "2.0", "Content": "I am a huge google fan. They undoubtedly have the best search engine, best online map tools, best satellite imagery, etc. I was convinced that their TV should be superior as well. My only comparison benchmark is my 4 year old Sharp \"smart TV\". Frankly, after paying $600 I don't know what additional benefit I am getting over my old Sharp. I can watch Netflix with both devices. I can not really do anything more with my google TV. It has an extremely clumsy remote. It just took me 10 minutes to write a three sentence comment on my friend's facebook page. I gave up! The cursor doesn't freely move. All in all very mediocre web browsing experience. I tried to open a video in facebook, the message said \"you need to update your flash player\". When I tried, the flash page said \"you already have flash installed through google chrome\". I don't quite understand what these messages are supposed to mean. All i know is that I can not watch some of the videos in facebook. There is no hulu. The software is very buggy. The only thing this device does well on the smart front is Netflix.Just to be fair (and hence my two stars) the picture is beautiful. It is a Sony TV after all.  If my expectations were less on the \"smart\" features and more on the traditional TV features, this TV would have been totally fine. It just is not that smart of a TV unfortunately.", "Date": "February 10, 2012"}, {"Title": "A Steal for the price!!!", "Author": "Thomas Bernstein", "ReviewID": "R295VOKUB9AFJB", "Overall": "5.0", "Content": "This is the future of TV! Picture quality aside (not that it isn't great) the functionality of this set blows all other smart tvs out of the water. I can surf the web, download and play games from the android marketplace, and even sync files wirelessly from my computer, all while showing live tv in the corner of the screen. Of course, it also has netflix and amazon. In fact, this tv reminds me more of a giant ipad with television built in.The picture quality is absolutely stunning for being only 60 hz. The blacks are black, and the brights are beautiful. i did notice some very very VERY slight graininess when viewing dark parts of blu ray movies, but that may have more to do with my blu ray set up - cheap player, cheap HDMI cable - than the actual tv since i've only noticed it on movies and not my other hd content.The audio sounds better than most led televisions, but then again thats not saying much. I would have been fine with the sound as it was, but I went ahead and hooked the tv up to some cheap computer speakers with a sub.There's not much to say about the build other than its thin, sturdy, and beautiful. I'd expect this thing to last until the screen quits.The only real complaints I ever came across when researching this tv was that it had video game lag and possible problems with brightness uniformity. My set has no brightness issues whatsoever from what I can tell. As for the video game problem, I haven't tested it out myself yet since this tv is only a secondary set i'm using for my bedroom, but I will update the review if I do. Even if there is a problem it wont really bother me as video games aren't the reason why i bought this tv.Overall, this tv is incredible. For $599 (originally $999), I almost felt like I was stealing. With a price like that, I can only guess they are trying to move all of their inventory so they can replace it with a new (more expensive) model. If I were buying this as my main entertainment television, i would probably wait for the new version since most of the gaming problems will probably be fixed and it will likely have more hz. As a secondary tv for a bedroom, this set is more than perfect.UPDATEI finally got around to testing out my wii and i will admit there is a small lag. Fortunately i was able to go to custom picture mode and make a setting that eliminated most of it. Also, a couple days ago google rolled out an update to Honeycomb 3.2, which among other things, made browsing the internet much much faster. the performance is now comparable to my computer if not faster at times. The loading times for apps is much shorter and the menu is now extremely snappy. All three of those things were my only real complaints about the tv. Now with the update there are no issues to speak of.", "Date": "January 9, 2012"}, {"Title": "Best Internet TV", "Author": "H. KC \"WWF praiser\"", "ReviewID": "R1P7KFALJ65A0I", "Overall": "5.0", "Content": "Best internet TV in the market. Superior quality of video and Image. You can watch YOUTUBE and other videos. It has full functional Chrome browser... Super like it!..", "Date": "December 23, 2011"}, {"Title": "The TV shut its power off unexpectedly. Why", "Author": "qinghantang", "ReviewID": "RUZ7PT8MHX6EX", "Overall": "4.0", "Content": "I bought a set right before Black Friday. It works fine except the power was shut off unexpectedly twice. The sleep timer was never set. I am thinking about if I should return the set to Amazon.", "Date": "December 18, 2011"}, {"Title": "Sony NSX-40GT1 40-Inch", "Author": "Juan Zapata", "ReviewID": "RQMF6WG5RI9HX", "Overall": "5.0", "Content": "Excellent computer, the TV is exceeded my expectations, the image is clear, the menu is very good, but what I like most is the remote control.", "Date": "January 3, 2012"}, {"Title": "Amazing best tv I've owned.", "Author": "Ray Fish.", "ReviewID": "R87RRI6GGTGWP", "Overall": "5.0", "Content": "this tv is so amazing it has so many features and setting internet speed is very fast and the picture quality is amazing!!!", "Date": "November 22, 2011"}, {"Title": "Sony Google TV doesn't feel like Full HD TV", "Author": "Harshwad", "ReviewID": "R1A46E9LZQDR7V", "Overall": "3.0", "Content": "I bought Sony Google Tv 40\" recently. I read several reviews before purchasing this TV and i felt its quiet good.Built-in Wifii, Google Chrome, Netflix, Youtube features were extra-ordiniary. Whereas, when comared with other LED, Full HD TV's 1080p Sony Google TV is lacking behind. I tried changing all the settings, but there is no luck.Seems Sony aimed at providing Interactive TV, not with the HD Quality.", "Date": "August 8, 2011"}, {"Title": "Seemingly Lacking For All The Glitz and Glam", "Author": "A. Coler", "ReviewID": "R1L1LKBYX63OR7", "Overall": "2.0", "Content": "It took me an hour to set this up with on air antenna. For some reason, it wouldn't pick up my zip code area which is located between 2 major cities and gets transmissions easily from both. After letting it sit for 20 minutes on the screen saying it couldn't find my zip code the 2nd time around after chatting with tech support it finally detected my zip code area.Then, I couldn't get all the stations I got with my $40 converter box. It took a few times and I have nearly all but still missing 2 channels.Google TV is the name given for the package of internet shortcuts included in the internet menu.The problem with this is most are useless short movie clips, obscure internet videos that aren't the least bit interesting, and a few radio stations, with access to Netflix and Amazon movies IF... you pay for those. There are some movies but they are stretched out to about 2.5 hours with all the commercials they put in them. Forget that. But, I will say that the quality of an internet movie is amazingly good, as others have commented on Netflix movies (haven't done this yet).The news site presets offered are mostly liberal in content. There are about 3 CNN sites, MSNBC, NPR, NY Times, USA TOday, no FOX NEWS of course.If you have older components such as (SONY) VCR, Older (SONY) Play station, Older (SONY) DVD, camera with USB cord forget about being able to hook them all up, they are completely obsolete to this TV as it only has a SINGLE component video (while most TVs half this price offer several) and 4 HDMI inputs and 4 USB inputs for...?....something with USB outputs? I don't know, I just know my camera pics wouldn't show up on it when I hooked my camera to it using USB cable.It has no audio out (like my old 27\" tube Sony had). I ended up getting a Y chord out of the head phone jack to hook it into my surround sound (lame).Added: I did find that if I put the VCR between the antenna and TV coax connector and turn TV to channel three, it would work, thus hooking anything with RCA jacks up to VCR front inputs will work too.The picture is good, after I customized it to my liking. You better be a tech wiz because the menu is extremely difficult to navigate. It has a LOT of options and the names of each option are somewhat vague.The remote is kind of nice for typing but if you want to put in a station quickly, you have to use 2 hands for the decimal point for over the air stations. The same for settings, it takes 2 hands and 2 buttons. It will not give you a quick list if you put in a number like my $40 converter box did. I could use one hand for my old converter box remote and quickly put in stations. Not so with this Sony beast remote.I couldn't get the Menu icon to work. Tech support told me to resest to factory which would lose my entire setup. Forget that. I can still get to settings by pushing 2 buttons on remote at same time (crazy).At first I didn't think it would run my old Sony AV receiver but after a while I figured out that the optical wires that came with it can be positioned over the sensor to the old receiver and the old code can be entered in the TV settings to run it. HOWEVER, it will not run it until the TV is fully booted up and if you turn your TV off first, you cannot turn your AV off using that remote. The functionality is limited, changing inputs and volume, on/off is it I think , maybe pause.It has a screen saver for the internet displays but takes an extremely long time to activate. I didn't see anywhere to adjust that time. (added: I did find this eventually and set it to 10 minutes)An old Sony remote will control this TV (slight plus).Some said it does not have this but it does have a \"last channel\" feature if you hit the \"Tab\" button on remote (weird).It locked up a few times navigating through the menu, complete with a \"submit\" option for sending the error (a la Windows style) to...Sony? not sure.This TV could have been so much more useful but they seemed to have concentrated on making it merely a novelty without practicality.After 2 weeks of trying to figure it out, I'm stuck with this thing but I would recommend looking for another internet TV with more features, easier menu, more convenient remote, less liberally biased internet content options, and better backwards compatiblity, as far as input connectors go, for older technology if you need it.", "Date": "June 13, 2011"}, {"Title": "Skip this", "Author": "roger", "ReviewID": "R3NOJS2QDQRZBE", "Overall": "1.0", "Content": "If you plan to get Netflix .... Have fun spending forever finding what you are looking for!!!!I got this tv about 3 months ago and loved it. We mostly have watched Netflix and DVD Blu Ray stuff.A few days ago I see google tv does updates to the tv which are downloaded to the tv.Well this new update changed everything for the worse.Now when I try and access Netflix I spend 10x, at least, the amount of time to fine something.Unwanted unneeded \"updates\"!Wow, don't we get enough backwards change for the sake of change so some programer keeps their \"job\". thanks google tv", "Date": "November 4, 2011"}, {"Title": "Bought over one year ago. Now dead.", "Author": "john", "ReviewID": "R1QR8Q2Q5O36S2", "Overall": "1.0", "Content": "Bought over one year ago. Now dead.  Do not buy.  The start is too slow. The keyboard is awkward. And very limited application.", "Date": "November 22, 2013"}, {"Title": "awesome!!!", "Author": "master yi", "ReviewID": "R2IOH787W2PYFM", "Overall": "5.0", "Content": "Thanks for awesome product!!!like it. like it. like it like it. like it. like itlike it. like it. like itlike it. like it. like it", "Date": "March 17, 2012"}, {"Title": "Almost bought this tv, but.....", "Author": "The One", "ReviewID": "R729ORC1R32O0", "Overall": "4.0", "Content": "I found this tv to be great with almost everything. I even found a great price for it considering all the other higher prices.Only problem was with streaming mp3 music and divx video from our networked computers. Sony prohibits it and this was a deal breaker. I suspect they prohibit it because it cuts into their sales of dvds and cds.We ended up just purchasing a regular lcd tv and adding the Logitech Revue with Google TV. Now we can stream all our music and video with no problems.", "Date": "March 8, 2012"}, {"Title": "IF YOU WANT A STEAMING PILE OF MANURE, GO TO A HORSE FARM!!!!", "Author": "Janilani", "ReviewID": "R2TV34KFDEFHN5", "Overall": "1.0", "Content": "I bought this lovely Sony NSX40GT1 a year ago and was told it would operate \"just like a computer.\"  I found out later on, that I couldn't stream Hulu content or VH1 content because it said my device was incompatible.  OK...no biggie.  I could still stream YouTube and Netflix.  Just 3 days ago, I was able to stream HBO GO and MAX GO with no problem.  NO MORE!  I was on the phone with the cable company for 2 days straight trying to figure out what the problem was.  So I deleted my cache and history and attempted to re-download the HBO GO app.  IT NOW SAYS IT IS INCOMPATIBLE WITH MY GOOGLE TV!!!!  The cable company wasn't even aware of this.  WHAT. THE. HELL?I can't get ANYONE from Sony or Google to tell me why my expensive device is now incompatible with HBO GO because they have NO CUSTOMER SERVICE PHONE NUMBERS.  I've watched TV series, movies on HBO GO for a year and now my devices is incompatible????DO NOT BUY THIS DEVICE OR ANY \"GOOGLE TV\" UNLESS YOU ENJOY ANGRY BUTT PENETRATION FROM A JAILHOUSE GOON.Sony AND Google have no phone service for customer support either.I WAS A SUCKER!!!  DON'T BE ONE TOO!!!", "Date": "June 17, 2013"}, {"Title": "Shame on Sony", "Author": "Tumbles", "ReviewID": "R1R57TP10KEFDM", "Overall": "1.0", "Content": "I read some of the reviews on the internet for this TV but felt the reviewers might be a little hard on this great new concept, bud sadly I was dead wrong.  The poor picture and slow speed of the internet were singled-out the most and now I know why.  The picture quality IS HORRIFIC and Sony should be embarrassed to put this out for sale.  Not only is the picture quality unacceptable, but it is NOT always compatible with thier OWN systems - ie, the Home theatre system!!  I am returning this and waiting until Sony and Google have received enough of them back in the warehouse to fix this dianosour!", "Date": "January 23, 2011"}, {"Title": "Weak wifi radio", "Author": "Fitz", "ReviewID": "RU2QLG1OA2DSG", "Overall": "2.0", "Content": "Wifi radio is weak and constantly drops connection (when it is actually able to connect) stay away from this. Buy a roku or apple tv and hook it up to a non Internet connected tv. I have to use a roku with this tv. The roku connects fine, but the google tv does not connect. Do not buy this.", "Date": "September 14, 2012"}, {"Title": "not impressed", "Author": "Alex \"average joe\"", "ReviewID": "R2NWFXLFEMY92T", "Overall": "3.0", "Content": "I was in the market for a new 40\" TV.  I shopped around and found this Sony.  It cost the same, $600, as the similar Sony LED TV without google TV, so I took the plunge.  First thing that I don't like about the TV two of what I consider very basic TV functions.  In order to set the sleep timer you need to dig down a menu tree.  That's ridiculous since this is a function I use pretty much every day!  Not to mention that you need to press two buttons simultaneously to get to the menu.  There is no last channel button on the remote.  So you can't jump back and forth between two channels.  This remote must have been designed by a woman because men can't live without the last channel button. :)  The remote is also pretty big, but when you start to use the google TV functions you will be happy they included a full keyboard.  It makes a big difference.The other part I am not thrilled with is the picture quality.  HD channels come across with an OK picture, for an HD TV.  Other channels look pretty bad.  I tried playing with the basic settings, but I could not improve the picture much.  I'm not sure if I need to get a set up DVD and run it through it's paces or if this is as good as the picture gets.  I think I just need to adjust the settings because with internet content and when using my PS3 the picture is very good.  In either case I would have expected the TV to come out of the box with a better picture when using the built in tuner.One thing that is very obvious is that what ever picture manipulation they use for internet content works very well.  Youtube videos that only look so-so on a computer come across as passable on this TV.  There is a PIP function so that you can watch TV and surf at the same time, but I was not too thrilled that the smaller window has only 4 distinct locations on the screen.  I would have preferred to be able to size the window to the exact size I want and to be able to position it to the exact location I want.This runs some flavor of Android, so you can download apps to run on the TV.  So far I have not tried that function yet.Right now I am on the fence as to whether I like this TV or not.  There are some good things going for it, like the built in computer and ability to run internet content.  But the missing buttons for the sleep timer and last channel really turn me off to this TV.  I'm going to try my picture set up DVD on the TV to see if I can tweak the picture to get the best out of the TV.  I'll do a follow up in a few months.", "Date": "March 15, 2012"}, {"Title": "good product", "Author": "Neil Harris", "ReviewID": "R59X1Z18NXRAJ", "Overall": "5.0", "Content": "For the non-discerning, non-audiophile, this is a great product. We just wanted a reasonable TV. Sure the sound is not out of this world, but it's decent enough for what we paid for it.The only problem is the lack of googleTV apps.", "Date": "June 1, 2011"}, {"Title": "DO NOT PURCHASE IF YOU'RE A GAMER", "Author": "marivera", "ReviewID": "RM1EHW7KQ1NZ5", "Overall": "1.0", "Content": "This TV is good as an internet TV. You can login to facebook and youtube just fine, but when you plug in an xbox 360, the lag is too much to deal with and i dont want to play anymore. Especially first person shooters where timing is essential. I contacted SONY and they said \"Some users may experience a slight lag or delay in response time when connecting the Internet TV device to a game console. This is a natural result of the advanced processing circuitry in the Internet TV device. This is normal operation.\" How is this normal???? Sony should publish the response times as a disclaimer. Its horrible for gaming. I do not recommend this TV for gaming. If I didn't wait so long to plug my xbox into the tv, I would have returned it the same day i got it, now I am stuck with it... I am currently using an old tv until i can get a new one to replace this since SONY has no intention on addressing the problem because after all, it is NORMAL OPERATION...", "Date": "December 5, 2011"}, {"Title": "Intuitive handheld keypad?", "Author": "volodoscope \"Artist by heart, geek by nature\"", "ReviewID": "R328P2F56C1LYV", "Overall": "1.0", "Content": "Intuitive handheld keypad? I don't think so. With 40 plus buttons, this is nothing of intuitive. Constantly crashes, gets disconnected. No support from Google, and they claimed that this is the future of TV. How is it future if Google totally forgot about this whole project?The picture quality is ok, and a weird cut off on the button looks little funny hanging on the wall. There's more USB connections than anything else in the back. I returned it in 20 days and got LG 42\" LED. I would say all these \"smart tv\" are just a joke to sell more crap you don't need.", "Date": "November 23, 2011"}, {"Title": "packaging is not good. Old item.  screen has pixel issue", "Author": "Not a good product", "ReviewID": "R17OZ6WAELVVZ6", "Overall": "2.0", "Content": "I found my package in broken condition.  TV looks fine but when operated it has some hole in screen and showing green light from that(if you look more accurately).  I have asked for new TV but I found a old one!!!Asked for a replacement.  I am not sure how will be the second one sent by amazon.  If not new then I will return it again and will not purchase from amazon any more.", "Date": "December 8, 2011"}, {"Title": "Bad Picture Quality", "Author": "William McMullin", "ReviewID": "R6ROOZCHERAH2", "Overall": "1.0", "Content": "Netflix's picture quality over this TV is horrible.  It's very fuzzy.  The picture is far better on my supposed lesser quality bedroom TV.The sound quality on this TV is great though.", "Date": "December 4, 2011"}, {"Title": "Thank you for your comments", "Author": "TNB \"TNB\"", "ReviewID": "R2NTJ9YPT2J80G", "Overall": "1.0", "Content": "Thank you everyone for your comments. Between the reviews here and online i decided not to even try any of sony's tvs. There are more cons than pros. I will wait a few years and see if sony can work out their problems before i purchase another product from them. The fact that eveyone is saying the same thing is a sign for me. I don't like when sony monitors the comments on any website and responds to customers like they haven't tried everything like contacting them. This isn't customer error so stop trying to mislead ppl. All of this reminds me of when the PS3 came out and everyone's system over heated and sony didn't have a solution nor did they refund our money. When they realized their was a problem they quickly came out with a thinner version of the PS3 to cover up the problem. I honestly don't know how they are getting away with this but customers need to unite and do something about or history will keep repeating itself.", "Date": "February 8, 2012"}, {"Title": "sony tv", "Author": "champ", "ReviewID": "R2FWM4H0R7GLA9", "Overall": "3.0", "Content": "When Iordered my tv ,it was supposed to have an alarm system It does not have one. So I did not get what I ordered. This is not good for selling your productes.", "Date": "December 3, 2011"}, {"Title": "hi", "Author": "marcos", "ReviewID": "R2JTZ8G19A8KNF", "Overall": "1.0", "Content": "i have one sony google tv. 40 itch not real size. i find out size it 37 half.  not 40.  i did buy from store best buy sale. but i was enjoy sony google tv used it then i will gift my family. i will other new. i not going buy sony google tv fake size itch.", "Date": "May 22, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "It has 40-inch, full 1080p HD, LED-backlit Internet TV powered by Google TV\nGoogle TV brings TV and Internet together, and seamlessly searches your TV, the entire web & apps\nIntel Atom Processor (1.66GHz) for world-class HD video, audio, and advanced graphics\nSurf the web while watching TV using Dual View, stay up to date with an upgradeable OS\nIncludes keypad controller with mouse functions, QWERTY keyboard, optical finger sensor", "Name": "Sony NSX-40GT1 40-Inch 1080p 60 Hz LED HDTV Featuring Google TV, Black (2010 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/41wlDmArq-L._SX300_.jpg", "ProductID": "B004BB4VVI"}}