{"Reviews": [{"Title": "Samsung UN40D5003 TV", "Author": "B. Van Houweling \"bruce\"", "ReviewID": "R3H16IVJM5CV2X", "Overall": "4.0", "Content": "This TV has one of the smallest form factors of any of the 40\" flat screen LED TVs so fit in my rather small space 38 1/2\" x 24 1/2\". It has excellent picture and sound. The only reason that I rate it 4* instead of 5* is because it has rather limited inputs and outputs on the back panel (2 HDMI, 1 component video which can alternate as a composite video in) there is no VGA in for a computer, no S-video in, no audio out). It think it is an excellent value. Samsung obviously went with less inputs and outputs and putting their priority in the picture and sound quality of this TV.", "Date": "July 27, 2011"}, {"Title": "Great tv", "Author": "JL", "ReviewID": "R1LI1QFJ0NAGD6", "Overall": "4.0", "Content": "Great picture and price. To get a LED Tv for this price is a steal. Picture looks great, can't notice the difference between a $2,000 tv to this $700 tv. You can work around by not having an Audio Output. It doesnt come with a lot of Inputs and Outputs but I think it has enough. It has enough inputs for a blu-ray player, Xbox 360 and my directv box, thats all I need.", "Date": "August 21, 2011"}, {"Title": "HOME THEATER SOUND POSSIBLE WITH AN A/V HDMI AMP", "Author": "Happy Howie", "ReviewID": "R4V2KCYO3Q4MA", "Overall": "4.0", "Content": "Because this unit doesn't have any audio outputs, the work around is simple.All you need is an audio video system with a HDMI input and and one output.Most A/V Amp's have three HDMI inputs and one HDMI output, so if you have a Blueray, DVR, SAT or DVD players with HDMI ETC. that all use HDMI, you simply plug your Blueray ETC HDMI cable in the input HDMI jacks of the A/V and output another HDMI cable into the TV. Most A/V's passthough function gives audio both to the TV and/or just to your sound system.So there you are!", "Date": "August 20, 2011"}, {"Title": "Good LED TV, but can't use speakers or Headsets!", "Author": "Julie", "ReviewID": "R3H0WI66KM0XAK", "Overall": "3.0", "Content": "Hi! I just returned a 27\" Samsung and purchased this 40\" one. I actually purchased the 5004 model which is basically the same. The picture and sound is great. But I have a huge problem because I like to watch movies and listen to music loudly and I am living with my elderly mother. I had no problem with the 27\" Samsung because it had all the outputs to put in additional speakers and use a headset if I wanted. This TV CANNOT do this. So I will be returning and purchasing one that has more audio outputs. Don't know what else to do. It should have a simple jack to plug in a headset. Doesn't make sense to me.", "Date": "September 12, 2011"}, {"Title": "Great buy for us", "Author": "John", "ReviewID": "RY3U1BMXGH0G5", "Overall": "4.0", "Content": "I purchased this razor thin LED TV for my daughter's apartment and used Amazon points with a promotional offer to cut the purchase price in half from the already low price on Amazon. It is ideal for the intended purpose.  Excellent picture and sound, very easy to set up, and very easy to use with the Cable & TiVo already in the apartment. This is a very thin, sleek, and elegant looking TV.  For some people the input/output sources available may be a limiting factor but for us this was not a problem.", "Date": "November 13, 2011"}, {"Title": "This T.V Is awesome!!", "Author": "guy triying to find a mouse", "ReviewID": "RF1M6RR9KYHGW", "Overall": "5.0", "Content": "This is my first big-O led lcd anything tv it has everything I wanted 40\" display 120 motion rate great for gaming and its a crystal clear LED lit display here's the break down nice and easy.The GoodBig picture low pricegreat graphics better than others in the same price rangethin not paper thin but wai thinner than my old camel hump tube TVloud awesome for gamingmany features timer turns off if there's no action after a period of time. and other great ones too many too list...i like the timer..The Badonly two HDMI inputs good enough for me not so much for others maybeno way to connect a sound system easilyshiny plastic in front gathers dust really fastback side is a bit odd might have trouble installing it in most wall mounts get universal one might helpit lags a little every once in a while nothing majormay not be good for big open spaces because of sound rangeThe Neutralit has touch sensitive buttons for vol channel power etc. while this is a badass feature it might be annoying for others speacially since they dont light up so if you're in the dark it does tend to bug you a bitvolume is loud but not great there isn't a nice range in sound while for example watching movies, while gaming it sounds amazing thoughConclusionGet one for you, get two one for you and the parents, get three one for you, the parents and the catthe point is get one you will be happy it has a simple yet elegant look..looks great next to a 1st gen ps3 ;)", "Date": "December 30, 2011"}, {"Title": "Good visuals, awful sound", "Author": "John Stossel", "ReviewID": "RMKA659G5C54K", "Overall": "4.0", "Content": "I bought this on special during black Friday (Black week?) and paid a mere $500 dollars for it. That said, I still considered returning it after hearing how terrible the stock speakers are.Being rear facing speakers, the sound is diminished 10 fold already, and at this slim of a form factor the speakers aren't big enough to handle anything bigger than conversation (and even THAT is incredibly thin). That disappointment was curtailed with the addition of a Sony HT-CT150. To circumvent the lack of optical cable hook ups on the TV, I just ran my PS3 by HDMI to the back of my Soundbar's sub and connected the HDMI out from the sub to the TV. It works like a charm and sounds pretty great for a sound bar (but that's another review ;)The picture is outstanding. I'm upgrading from an old CRT so pretty much anything would have provided better HD picture, but I did alot of research before choosing this particular television. For those curious the break down of my research is as follows (not a professional, just did a lot of research and made my decision based on these points, take them as you will):LED/LCD- (what this TV is) is the newest technology available. These edge-lit models allow for super thin form factor and the LED lights are very bright. They're optimal for a brightly lit room, handle blacks better than their LCD counterparts and are sold at a premium for that extra brightness that comes with LEDs (and apparent bragging rights over having the newest toy). Keep in mind that this UN40d5003 is only 60hz, that means fast motion can look a little sketchy at times (hardly noticible without side by side comparison or a previous TV that handles better), if you go to a store and notice yourself bothered by motion you may consider a 120hz TV instead. Long explanation made much shorter: it(120hz) handles pictures at a faster refresh rate and can \"correctly portray Blu-Ray content that was filmed at 24 frames per second because 24 divides evenly into 120, and not 60. Again, this can be tough to catch but may bother those more sensitive, or those desiring the absolute truest representation of their films on their new TV. In my experience with this particular model, I notice a little motion blurring at times during slow, lengthy pans in very busy scenes but for the most part never even think about this being a 60hz TV. In addition to handling motion better, the 120hz requires extra processing which can (especially in Samsungs) create a bit of input lag. This can mean alot if you're a gamer (as I am) and should be taken into consideration. You may even consider taking your console to the store to test the TV you'd like for changes in your game play. With this model, I notice absolutely zero input lag when playing COD Black Ops(online and off), Heavy Rain, or Uncharted. It's been an incredible experience each time as I enjoy how crisp and clear these new visuals are.LCD- Basically the same as the LED televisions but not quite as bright. If you took one home you more than likely would never notice, but side by side comparisons expose slightly richer colors in the LED (IMHO). LCD can save a bit of money though and should be considered as pretty much equal in all aspects to the LED models. (the blacks on LCD appear slightly more \"washed out\")Plasma- In every forum I read, these were the king pin TVs. The best of the best. Store lighting is purportedly awful for viewing these sets due to how florescent light effects the glossy screen and how the picture is displayed. I agree. In store, I hated these models. The blacks looked washed out more than any other set and the picture wasn't anything to call mom about, but at a friend's house I watched SALT on a 46 inch Panasonic plasma and was very impressed at the black levels and fluidity of the picture. It was impressive. These don't suffer from the motion blur and stutter that effects LCD and LED and provide the best black levels of any of these sets (CRT maintains its seat as king for blacks and is apparently the standard of comparison but also weighs more than 15 plasmas;).) That true-ness of picture, rich, inky black levels, and lack of issues with motion make it appealing to videophiles and even gamers. Burn-in that plagued sets years ago is almost entirely absent from newer models but should still be considered. Using newer technologies can only reduce the risk. HUDs from games like Gears of War 3 (Horde mode with HORDE on screen for long periods of time) risk burn in and can be a serious deterrent for gamers considering this technology. Do your research.The picture on this set is beautiful. The only bother is that during very dark scenes (almost black) there are soft cones of light that expose the hint of edge lighting in the top two corners. This is distracting at worst and some may not notice it(my girlfriend is unbothered by it). It can be reduced by turning the contrast down but is apparently a known issue in lower end LED/LCD flat panels. The blacks are impressively rich, the detail of the picture is crystal clear with 1080p showing up beautifully. Call of Duty really looks fantastic on this screen. I can't over-emphasize how incredibly rich the color is. Compared with Toshiba, Sony, LG, RCA, and Panasonic models in this class I chose Samsung every time. Again, go compare at Best Buy and see what picture is most to your liking.Long novel cut very short: If this is under $600 dollars, buy this TV. It has great picture quality and if coupled with a sound system via HDMI (no optical cable may irk some but didn't bother me with my set up) it serves as a phenomenal set for living room or bedroom. However, if you are looking for even decent stock sound without an interest in purchasing or setting up external sound LOOK ELSEWHERE. The stock speakers are so bad it's not even worth purchasing. They are easily the worst I've heard on any flatpanel. And if image uniformity might bother you, check out a store model and see if you notice the cones I spoke of in the corners on black scenes.Four stars for picture quality and my price of $500 (when coupled with soundbar). Anywhere past $600 and you can do much better. Hope this helps!", "Date": "December 7, 2011"}, {"Title": "Audio output is definitely possible!", "Author": "K. Tu", "ReviewID": "R350W8AEEJ70XS", "Overall": "4.0", "Content": "Snagged a Samsung 5003 on Black Friday and I couldn't be happier. Picture quality is amazing especially when playing Elder Scrolls: Skyrim. The stock audio is rather poor as other reviewers have said however I was able to I fixed my audio output problem with the Sony HTCT550W 3D Sound Bar Home Theater System with Wireless Subwoofer. Simply connect to to your tv via HDMI cable to the receiver (comes with the home theater system) and then you can plug your blu ray player, cable box, or game console (using hdmi cables) into the receiver.1) Buy this TV if you don't care about the poor audio quality2) Buy if this is on sale3) Buy this TV if you are going to purchase a home theater system regardless of anything else! :)", "Date": "January 6, 2012"}, {"Title": "Superior picture - But have to work around port issues", "Author": "Robert", "ReviewID": "R1SIH8PW4H4HF1", "Overall": "5.0", "Content": "Bought the Samsung model UN40D5005BF which is identical in specs to this one IDENTICAL JUST TAGGED DIFFERENTLY A KOREAN MARKETING PLOY TO PREVENT PRICE MATCHING! Needless to say the lack of HDMI PORTS and audio out of any type was/is wrong. But the work arounds are as follows buy a HDMI multi-port switcher for approx. $12.00 from amazon several to choose at reasonable prices. As for audio issue just ran everything through my Sony Surround Sound receiver directly from other devices, just have to switch through remote control to the correct devices input. This is not to say the Samsungs speakers are bad. Definitely not,  the speakers are quite good. Highly recommended ...for the price you are buying a quality LED panel/screen/TV. Check my review about this link 3 Port HDMI Pigtail Switch with 50 cm HDMI Cable", "Date": "November 30, 2011"}, {"Title": "great tv within it's limits  and price", "Author": "shokat", "ReviewID": "R28VAFPQN08IC6", "Overall": "5.0", "Content": "first of all, this tv's picture is just amazing! we are new to hd tv's and every time i walk by i seem to mutter\"wow\" under my breath. i did my research and decided that  Samsung led  was the direction we wanted to go. this TV was delivered to our door with 2-day shipping and we got it Wednesday before thanksgiving. price was great at $499.00. we had also purchased a Panasonic 5.1 surround sound system with a bluray player. there was some confusion as to whether or not this TV was 60hz or 120 Hz. hd programs usually list 720-1080 pixels at 60hz.there is a box in the upper left hand screen that shows what the program was filmed in. this TV is actually 120hz, but not all programs are filmed at 120hz. this has not been a problem so far, but i was expecting 120hz based on the Samsung info for this tv which is correct! we also had to run hdmi cables from the hd cable box to the bluray player and then through the tv to get surround sound.it was basically plug and play! there are only 2 hdmi ports on the back, but once we figured it out there were no more problems. all in all we are very happy with our purchase.  bluray disc's are just incredible as is the sound. if you have a limited budget-we paid right under $1000.00 for all-this just can't be beat in our opinion! do your homework and just enjoy!", "Date": "December 23, 2011"}, {"Title": "OK, but...", "Author": "VA552", "ReviewID": "R2AU1A8CZ6LRHY", "Overall": "2.0", "Content": "The picture quality is certainly adequate for a TV at this price point, however, there are some serious shortcomings that the purchaser should be aware of:1) There is no audio output (of any kind) so if you planning on hooking this to a sound system you're out of luck.2) Inputs are very minimal, there are 2 HDMI ports and, although the specs say 1 composite input and 1 component input, there is, in reality, only one because the use of either negates the use of the other (they share one common hub).3) The original specs (when I ordered) said the TV had PIP.  It doesn't and the specs have now been corrected.4) Samsung lists this TV as having 120CMR which kind of implies 120Hz.  It's only 60Hz.6) I bought this at a Black Friday price which is pretty much what the set is worth.  Regular price = be aware of it's shortcomings.", "Date": "December 24, 2011"}, {"Title": "Great Picture! - Dreadful audio!", "Author": "AndyB", "ReviewID": "R1NJWMZ9A5ETLS", "Overall": "1.0", "Content": "I was very excited when I saw the picture quality of this TV in store.  And it was on sale!  Could it get much better? I thought not and bit the bullet and handed over my hard earned and left feeling pretty smug that this was the buy of the year.  Sadly my euphoria was short lived. The audio is dreadful and I really do mean that.  My aging iphone has better audio! ok so that might be a little exaggerated but please believe me, only a little! I find it very hard to believe that Samsung, a trusted brand, would stoop so low on quality control to even allow this to leave the factory!Trying to contain my disappointment I decided on the pragmatic and thought what could I do to salvage the situation?  So I committed more of my hard earned on the Samsung D350 Soundbar, thinking direct connection to HDMI2 and we're golden.  Errr... no! No HDMI connection on the soundbar and no other audio out connections on the TV!I do have a work around with the soundbar's optical inputs which connect to the Sky+HD set top box.  But this of course means I only get decent sound with the TV channels through Sky.  For my Samsung Blu-ray and xbox360 I am stuck with the utterly awful TV audio.The zero stars on this review is not an oversight.  I cannot with any clear conscience recommend this TV to anybody.  For your own sanity avoid this TV as you would death itself!Correction, it wouldn't let me post this review unless I gave it at least one star.", "Date": "March 21, 2012"}, {"Title": "EXCELLENT Quality", "Author": "steffyCT", "ReviewID": "RMVX8B86BCZ3D", "Overall": "5.0", "Content": "This is the best purchase i've made on amazon. The television is supreme quality with the most amazing picture. The only thing i would chage is that the holes for the HDMI cable is centered directly behind the middle of the tv. I purchased the tilting wall mount and it makes the tv stick out from the wall on one side.", "Date": "February 6, 2012"}, {"Title": "Excellent customer service!", "Author": "hmp0919", "ReviewID": "R1NIY9IB3V9Y46", "Overall": "5.0", "Content": "This was excellent product just as described. It shipped fast and I was able to tract the product the entire time. Good Seller!", "Date": "January 5, 2012"}, {"Title": "good price for limitted functionality", "Author": "Mehrdad Orang", "ReviewID": "R323NV0CK3XC80", "Overall": "5.0", "Content": "Great value, if you are NOT looking for internet usage functionality and connecting your TV to your home theater sound system. I saw many negative comments here before buying it, but as I read through them I noticed that most of those complain are about lack of those two things which I didn't need at all.", "Date": "December 24, 2011"}, {"Title": "Very nice TV", "Author": "ME", "ReviewID": "RETMM4JA3A6YH", "Overall": "5.0", "Content": "Very good tv great picture very clear even in fast moving objects. a lot of people are complaining about no audio out on the tv but unless you are watching over the air tv you don't need one. you can hook your blu ray/dvd or cable/satellite audio out to your sound system. the speakers sound good not the best but nothing to complain about.", "Date": "December 4, 2011"}, {"Title": "Don't buy it as a PC monitor.", "Author": "Reala", "ReviewID": "RQ9UVO1NRTKT2", "Overall": "3.0", "Content": "The pixel structure isn't PC friendly, producing a very noticeable PenTile-ish sawtooth effect on any sharp edge.  This could be down to Samsung's panel lottery and bad luck on my part though, so your results may vary. The PC Mode unfortunately does nothing to reduce this effect.", "Date": "November 28, 2011"}, {"Title": "Good Picture", "Author": "Sam", "ReviewID": "R356LMMT1TR5K3", "Overall": "4.0", "Content": "We do not have cable nor dish. If you look at the picture you can not tell. The HD looks great from the local stations. I shopped around and it appears that all stores has it for $499. If I had purchased it online, I would have saved $38 in state tax and most sites will ship it free.", "Date": "November 27, 2011"}, {"Title": "Great Picture, Horrible Speakers, No Audio Output!", "Author": "markabtex \"scifi addict\"", "ReviewID": "R2HH9ZJZ66MADH", "Overall": "2.0", "Content": "I hated having to return this because it has a great picture. The major flaw that could not be worked around is that the speakers built into the TV are some of the worst I've ever heard on any size TV. I have a 19\" Vizio LCD TV that has better sounding speakers. I can't say I was suprised since most of these new ultra thin LED TVs have poor sound. I had actually planned to hook this up to a seperate Sound Bar Speaker anyway. I was suprised to find that this TV has NO audio outputs so you can't hook up an external speaker. I can't believe that Samsung was so cheap in the Design of this TV. A great picture means nothing if you have tinny sound coming from the TV. Do NOT buy this if you plan on using the built in tuner for over the air TV since the only way you can get sound from it is the cheap built in speakers. If you plan to use it as an HDTV monitor for a cable, satellite box, or Blu Ray disc player and you run your sound through an A/V receiver, then this may be a good choice for you.", "Date": "November 28, 2011"}, {"Title": "GREAT TV", "Author": "waldo", "ReviewID": "R2YY7ORVN1TT3V", "Overall": "5.0", "Content": "Samsung delivers a great picture which is bright and clear.  I purchased three of them in various sizes.  The delivery process was without a problem and exactly on time.  Speakers are fair to ok.Only 2 hdmi ports, but if that is all that you need, not a problem.", "Date": "March 13, 2012"}, {"Title": "Missing a very important feature", "Author": "Button Pusher", "ReviewID": "R1L687V3WPBZ0D", "Overall": "3.0", "Content": "It was time to replace my 5 years old 32\" LCD this. I knew I was going to replace it with LED TV. The new LED TV is much more lighter than the LCD TV it replaced. Both foot print are the same on width and height, but the depth is thinner on the LED TV(Which is given). The reason why the same width and height is that old LCD TV has these large built-in speakers. Which is my main complain about this new TV compare to my old TV. The sound is soooo tinny, no base at all. Which could be easily resolve by me, if it included an analog or SPDIF audio output. Yea, I know about HDMI output with the NEWER receivers. I already have this Sony receiver that's only few years old, but it has no HDMI support. So I have spend couple hundreds dollars just to audio output? Samsung, you really disappointed me.I wish I waited a couple of days, because Amazon had this LG 42\" LED TV for the same price. Which included 3 HDMI outputs, and both digital and analog audio output.Lesson learned, don't just jump so quickly because of a \"good\" deal. Read all of the specs first. Because sometimes, something better might comes along.", "Date": "February 25, 2012"}, {"Title": "Finally Satisfied", "Author": "Nick", "ReviewID": "RMKWKUJAX8Y7T", "Overall": "4.0", "Content": "I spent a lot of time trying to find a great deal on a tv and finally settled on this Samsung 40 inch LED.  The picture looked great when I turned it on for the first time, but then I noticed three dark spots that would show up when lighter colors were on the tv.  I was hoping it was just dirty or greasy spots, so I cleaned the screen.  Unfortunately the spots were still there after cleaning.  I ended up calling Samsung's customer service, and after jumping through all the hoops, got set up with a local repair shop.  They ended up replacing the entire panel.  Now that the spots are gone, the picture is truly excellent now IMHO.  Although it was a hassle, I am impressed with Samsung's customer service.  They really seem to stand behind their products.", "Date": "December 7, 2011"}, {"Title": "picture quality disappointing", "Author": "careful shopper", "ReviewID": "R3KX0GGOOZAQX2", "Overall": "3.0", "Content": "motion blur with sports.  disappointing.  called samsung, told me to push INFO button, which says 60 Hz (TV says it is 120 Hz).  Time warner says my box is best available.  not sure what to believe.  all i know is the picture blurs with fast movement, like watching somebody run.  seriously considering returning and buying something cheaper with better picture quality (like my ancient LCD upstairs).knew the audio outputs were an issue from everyone else's review, so knew that wasn't important to me.", "Date": "November 12, 2011"}, {"Title": "Great picture, POOR audio", "Author": "RocketBeta", "ReviewID": "R35T68POFKX8S2", "Overall": "1.0", "Content": "Design: 9/10The speakers are downward-firing and not visible from the front of the TV.  The frame surrounding the screen is about 1\" thick with touch-sensors on the bottom for power, channel, and volume controls (no actual buttons on the TV).  I feel like pressing them can be hit or miss sometimes, for example, when you press power to turn on the TV, there's a slight delay, so you might press it again and end up turning it off.I've heard other people complain about having difficulty assembling the base.  The holes where the screws go aren't drilled in all the way, so as you're placing the screws, you might wonder if you have the right screws.  They fit, but you have to manually torque the screws in, which is a bit of a pain.  The holes should have been drilled properly.The screen itself is completely reflective, no matte finish, so glare is something to consider when placing the television.  I'm definitely pleased with how light the TV is and how it doesn't get hot even after hours of use (unlike my old Bravia).Picture: 10/10The picture is fantastic.  The \"Clear Motion Rate\" that Samsung uses is kind of ambiguous...  Like what the heck does that mean?  I was afraid it would have that \"fake\" or \"camcorder\" look you get from televisions with high refresh rates, but you don't get that with this TV.  The TV displays extremely deep blacks and crisp, colorful images throughout.Audio: 0/10If I could do it over, I would NOT purchase this TV because the audio is horrendous.  It's absolute garbage.  Whoever at Samsung that performed the quality check and thought this was acceptable should be fired immediately.When I heard the TV at home for the first time, I honestly thought my set was defective (maybe it is?).  The sound is very hollow with no bass.  If you took a set of headphones and cranked the sound up to the max, that's what it sounds like.  The slender design is nice, but it doesn't lend anything towards good sound reproduction.  By comparison, my Sony Bravia, which I was upgrading from, had it's own little sound bar under the TV which sounded pretty nice.  Sony had the right idea of separating the speakers from the TV.Literally, the audio quality is comparable to my iPad, which is completely unacceptable coming from a $600 television set.  Playing with the audio presets and equalizer does nothing to mask poor speaker quality.  To add insult to injury, there's no audio outputs either.When I purchased the TV, I already had an Onkyo receiver, so bypassing the TV's poor audio wasn't a problem, but I don't always wanna fire up the receiver if I'm just watching the news or some random TV show that doesn't warrant the use of a power-sucking 7.1 receiver. But it's embarrassing to show off a nice 40\" TV to friends only to find that the audio sounds like laptop speakers.Bottom Line:  2/10I can deal with the fact that there's only 2 HDMI inputs and no audio outputs, but the awful speakers are a tough pill to swallow.  Like I mentioned, if I could do it again, I would not purchase this TV.", "Date": "December 10, 2011"}, {"Title": "Decent TV for the price but....", "Author": "C3Troop", "ReviewID": "RNUB213JYXBT2", "Overall": "3.0", "Content": "First off, I have two Pioneer Kuro's to compare this TV too, so I'm not sure how fair the comparison is.  I got this TV from the chase sale the other day for my garage/work out room.  The TV is very light weight and slim, perfect if you're going to hang it on the wall.Picture quality-The picture is bright and vivid, as you would expect from an LED TV.  However, there is significant motion blur.  I could not watch this TV as my primary TV or on any fast moving scenes because it gets very, very grainy.  Again, I have Pioneer Plasmas, so take it for what it's worth.Sound quality - Horrible.  I have an expensive sound package hooked up to one of my Pioneers but the other one is just running off the stock speakers and sounds infinitely times better than this TV.  I'm not sure how anyone would listen to this unless they had external speakers.So I got this TV for $269 dollars through my points at Chase.  For 269, this is an awesome TV.  However, there is no way I would pay 700 for it.  I would prefer to buy a used Pioneer Plasma or save for something else.And for what it's worth, standard def picture looks very good on this TV, but high def kind of a let down.  Go to a store and watch the TV before you purchase it.I give this tv three stars because it was so cheap and is still a Samsung TV which is hands down the best in my opinion since Pioneer no longer makes TV's.", "Date": "November 29, 2011"}, {"Title": "NOT Internet compatible", "Author": "S. Neufeld \"slappy\"", "ReviewID": "R1NA6XE04LNCKB", "Overall": "3.0", "Content": "While tv is fine, and works etc., I was most disappointed to find that even with the 60$ wireless LAN add on, this tv has NO Internet connectivity-- there is a USB to view pictures or music files, but it can do no more. The factory site confirms this, but the amazon description is flat wrong.", "Date": "December 1, 2011"}, {"Title": "Cheap / Stripped down", "Author": "dew", "ReviewID": "RLTV94ICXPZ4F", "Overall": "2.0", "Content": "Purchased Samsung 40\" (UN40D5003)TV from Office Depot.  Shame on me for not looking at the specifications better.  1) It has NO PC port which we need for Video projection.  Now we have to purchase couplers/converters for VGA to HDMI. (non-standard).  Called Samsung Tech support and was told that a VGA to HDMI coupler will work.  Not sure if it will until I receive the coupler..2) The TV will be wall mounted.  NO screws came with the unit.  The mounting takes 8M screws.  Had to make trip to HDW store $$$$.  Purchase 4 TVs in the past and all had mounting screws attached.Purchasing on internet - buyer be aware!!!!Dennis", "Date": "January 11, 2012"}, {"Title": "internet ready?", "Author": "johnny", "ReviewID": "R1SM129YCDK1W8", "Overall": "4.0", "Content": "Anyone care to share how this television is internet ready? I purchased this TV and i am finding a difficult time finding any sort of internet settings", "Date": "November 29, 2011"}, {"Title": "I doesn't work with your home theater or surround sound system", "Author": "lat", "ReviewID": "R2MSQ8W2IQCY7O", "Overall": "2.0", "Content": "The TV is great for the price, and as usual, it was great shopping with Amazon, but we found a HUGE problem with the equipment. You cannot use it with a surround sound system or a home theater because it does not have audio out options. Only audio in. We spent two hours chatting with the Samsung technical support, and there is no way you can connect a sound system to it...", "Date": "August 17, 2011"}, {"Title": "Lack of several features", "Author": "Kanagaraj", "ReviewID": "RJ0TQLKPY1302", "Overall": "1.0", "Content": "1. It does not support 230V2. No audio output3. You cannot turn the TV without turning stand.Picture quality is good.", "Date": "December 17, 2011"}], "ProductInfo": {"Price": "$699.99", "Features": "1080p resolution\n1 USB (JPEG/MP3)\n60Hz", "Name": "Samsung UN40D5003 40-Inch 1080p 60 Hz LED HDTV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/31K2up5aSCL._SX300_.jpg", "ProductID": "B004VRJ3FG"}}