{"Reviews": [{"Title": "A beautifully engineered product", "Author": "George T. Workman", "ReviewID": "R3IHXQYRZCAP2G", "Overall": "5.0", "Content": "Noticed the Sharp 52\" LCD - LED TV walking thru Sears - an amazing 2D picture that seems a little 3D.  No interest in having to wear 3D glasses to watch TV.  I am of the older generation and a sports fan.Replaced a 4 year old 50\" Sony LCD projection TV in Great Room.  Have tried a Samsung 46\" TV, great picture, poor video controls for non 1080p, ended up with a Sony 46\" LCD TV in bedroom.Installed the Sharp 52\" Aquos TV 4 days ago.  What a wonderful experience.  TV is everything I expected and more.Here are the highlights:1. Great 1080p picture with more colors than experienced with other TVs due to Quad Pixel technology Green Red Blue and Yellow.  Watched US Open golf and amazed at the bright colored shirts of the fans in the stands.2. Smart Menu system with ability to adjust just about anything.  Have used it to setup TV and Wireless Internet connection with a little help from Sharps customer support.3. The Remote is nicely organized and has a button \"View Mode\" that allows you to instantly expand the TV source to fit the screen.  This was buried 3 levels down in a menu on the 4 year old Sony 50.  Now with one button you can fill the screen when playing an older DVD wide screen 2.35 or watching many non HDTV programs.4. Best customer service group I have ever called.  I actually read manuals but when I get stuck trying to implement something new - like Internet Wireless connection - good technical support is critical.  Sharps customer support is wonderful.  Some guy was patient and stepped me through setting up the Wireless Internet connection to my PC / Linksys Wireless Router.  He then guided me to check Sharp HE LC52LE830U 52-Inch 1080p LCD TV -Blackmy new TV's firmware and we then over the Wireless connection updated the TV's firmware to the latest release.The only CON:1. Like most of the new flat panel TV's there are no forward facing speakers so clarity of voices seems muffled.  I have bit the bullet and ordered a Sharp TV sound bar to remedy the situation.  I have a wonderful Onkyo AV Receiver with full 5.1 surround sound but just want to play most TV programs and sportscasts with just good TV speaker sound.Update: December 2011.  In July I added a Sharp soundbar and now with 5 months of use, I am happy to say the Sharp Soundbar solved the major CON of this TV.  The sound bar with 5 small speakers projects the sound forward so voices are clear and sports/movies sound fine.  There are adjustments for bass, treble and subwoofer.George", "Date": "June 23, 2011"}, {"Title": "best 2D hdtv out there", "Author": "Amazon Customer \"Dave S\"", "ReviewID": "RTY46C5OFO7SU", "Overall": "5.0", "Content": "Like most people, I did a ton of research before dropping serious cash on an led hdtv. I researched and looked at Sony, LG, Samsung, Toshiba, and a few others. Professional reviewers rave about Samsung and LG, although I can't really figure out why. The Samsungs all have a glass screen, which does make the image look sharper and improve contrast, but reflects everything in a bright room, so not very practical. The LG's? Well, to be honest, I only gave LG a cursory look because I've not had much success with that brand in other products I've owned. Sony gets good reviews too, but Sony does not make their own panels. Sony uses Samsung and Sharp panels, so why not buy a Samsung or Sharp instead? Not to mention Sony's are incredibly expensive. My sister has a Toshiba, but to me it's like LG as I've not been pleased with the brand in other products of theirs I've owned. So essentially it came down to Samsung or Sharp because they're both innovators in the LCD television industry and manufacture their own lcd panels. Sharp invented the technology, and Samsung has continuously been on the cutting edge of the technology.Why did I go with Sharp? I looked at both the Samsung 55D6000 and this Sharp. The Sharp gives up 3\" of screen space, but both can be had for almost exactly the same price if you shop around. I believe the Samsung was twenty dollars more on Amazon as I type this. The Sharp has a few advantages over the Samsung that ultimately swayed me. First, my first hdtv was a Sharp 46\" LC-46D64U and that tv was awesome! Still works like new, and I gave it to an HD-less friend of mine when I got this set. I had that for four years and it never gave me an ounce of trouble, so I know sharp is reliable. Second, the quattron picture really is much better than the other tv's I saw. I know, I know..........I saw the CNET review where they had to \"adjust out the inaccuracies of the extra yellow pixel,\" but frankly, CNET is generally wrong. Just look at the comparison between the customer reviews and CNET reviews on almost any product and you'll notice a huge disparity, in either direction. So I don't give CNET much weight in any decision I make. Believe me, the colors are more vivid and colorful on the Sharp. If I want super accurate color reproduction I can do two things: 1. Adjust the settings on my tv, or 2. Walk outside and look around. The image is amazing on this TV. The second consideration is Sharp's customer service, which is so good it's borderline unbelievable. Four years ago, when I got my first Sharp, I had a ring of dead pixels. I took a picture and emailed it to Sharp. Sharp called me the next day and told me they were shipping a new replacement to me. It arrived two days later and was perfect. On this set, I noticed some uneven backlight, and although it didn't really affect the picture, even on dark scenes, I emailed sharp a picture to see if they knew how to adjust it out. They called two days later and said they would exchange it for a new set, and the new set arrived three days later. It's perfect. From what I've read, if you have an issue with a Samsung, they do not send out a replacement set, they send out a tech guy, who will look it over, and then leave, have to order the part, show up two weeks later, tear apart your new tv, install the parts, and generally you'll be left with the same problem. Flashlighting and backlight bleed is a real problem on the Samsungs. I've never had that on a Sharp. The corners have no flashlighting, and there is no backlight bleed. There was a bit of uneven backlighting on a standby screen on the first tv, but not on the new one. I also had a nightmarish experience with Samsung customer service in the past where I had a 22\" monitor that quit working. I had to call Samsung 9 times over the course of 42 days to resolve the issue. In the end, they sent me a refurbished unit with over 32,000 hours of usage on it. The one I sent to them had 2200 hours of usage. I was just north of irate over that, and I still have a bad taste in my mouth about it. I am sure Samsung makes a good television as they are currently the sales leader. But for me, it came down to reliability, image quality, and customer service, and Sharp has the advantage in all of these areas.Sound Quality. One final consideration was the sound. People always say, \"If you're going to get a tv this big, you should have a sound system hooked up to it.\" True enough, and I do. But it makes little sense to me to get an ultra energy efficient television, and constantly run a 1000 watt sound system with it. I use the sound system for blu rays, and some netflix stuff, but not for normal daily viewing. The Sharp has two 10 watt speakers and a 15 watt subwoofer. This subwoofer is not powerful of course, but it makes all the difference in terms of sound quality and is an option usually reserved for top tier models of other brands, like Toshiba for instance. The TV sounds great, and doesn't distort at higher volumes. It's great for watching the news or broadcast television shows. If you want your bones to rattle during a movie, use your AV system, but for regular viewing, these speakers are wonderful. I listened to the LG and Samsung speakers in the store and was horrified. I mean they were awful.The apps on this TV work well. I like the favorite channels buttons and the ability to put 3 apps on a favorite button. I have mine hooked up to an ethernet cable because it's much faster than wifi, so can't comment on the wifi.In summation, this TV is excellent. It has no flashlighting or backlight bleeding. the darks are extremely dark, the apps work well, the speakers are good, and the customer service is the envy of the industry if you have a problem. If my prior sharp lcd hdtv is any indication, this will also be a reliable tv. It also just looks good whether on or off. I love this set, and I'm sure you will too if you purchase it.", "Date": "October 21, 2011"}, {"Title": "Sharp 52\" LED HD TV", "Author": "Ken", "ReviewID": "R2YCK53MIA7DAV", "Overall": "5.0", "Content": "This is a great TV for the price which could not be matched at any local stores here in south Texas. I was looking for a good size tv without 3D, I just would not be happy with having to watch my tv with a pair of glasses, I digress. The ability to sync up with my wireless router was very simple which I'm always using it for Pandora. The DLNA was a bonus as I originally was under the impression that this type did not have. Although I have not used it yet, I think its a cool function to have. The 120 Hz is a noticeable difference between a 60 Hz 42\" that I replaced. From what I read, the 240 Hz was overkill which did not provide double the experience as 60 to 120 offers. Anyways, if you are looking for a good quality tv with nice features, menu options, many connection ports and an awesome gaming monitor (PS3 for me) then this is an excellent buy.", "Date": "August 23, 2011"}, {"Title": "Sharp Aquos Quattron 52-inch", "Author": "Darren L. Webb \"dw573\"", "ReviewID": "R2WWMR4WRNM2TR", "Overall": "1.0", "Content": "I purchased a 52-inch Sharp Aquos Quattron approximately 6 months ago, beautiful unit, looked great. Started having problems with discolored horizontal lines in the screen, called the local store where I purchased it from and was told to bring it back to the store. The tech at the store called me the next day and told me that the \"panel\" was bad, and that Sharp would not allow it to be repaired, but rather that they would replace it, that's where the fun begins, the Sharp rep told me on the phone that it would be two days until authorization would be sent for replacement, 2 days later, no authorization, another phone call to Sharp got me nowhere but another 2 days. Here it is almost 2 weeks later and another phone call to Sharp has revealed that I can expect a refurbished replacement unit in about 10 days. At this point I'm just about ready to say forget it. While their product looks great, I cannot offer a review of the picture quality as it had lines in it since I brought it home, as for the service, I can tell you plenty about that, Sharp is 2 days away from everywhere, after having been indirectly called a liar by a Sharp rep,I find their service is far less than satisfactory, I have also decided that I will not purchase another Sharp product again, not even a light bulb. So in the end, if you wind up with a warrenty issue with a Sharp product, all I can offer is best of luck, they have lost me as a future customer.", "Date": "January 27, 2012"}, {"Title": "This picture is so good it's scary!", "Author": "GreatStuffNow \"GreatStuffNow\"", "ReviewID": "R28HBGEZ38539U", "Overall": "5.0", "Content": "We had a Sharp Aquos 52\" model LC52D92U for 3 years...so we have experience with HD television. That TV was stolen last week, and because we were happy with the first Aquos, I bought this new model with Quattron technology. OMG! The picture on this TV is so brilliant it is like you are in the room! When you have it set to Dynamic (Fixed) mode, you can literally see the pores (and all other imperfections) on the actors faces (not always a good thing). Even on older movies, not filmed in HD, the picture is absolutely mesmerizing. There is no comparison to the previous model...this thing is just one step below 3D--it is utterly amazing.Plus, the wireless Internet connectivity was a breeze to set up and now we are downloading movies from Netflix with ease.Many thanks to the thieves who stole our older model (which cost $800 more)...we didn't know what we were missing!", "Date": "September 22, 2011"}, {"Title": "Brilliant Blacks and Whites!", "Author": "Barbara West", "ReviewID": "R1WY4M3VOC23GC", "Overall": "5.0", "Content": "I LOVE this TV!  The colors are unbelievable. The black is VERY black. I have it set up next to a smaller, 37\" LED TV (Vizio) and the thing we noticed right away was the crispness of the black and especially, the white is very brilliant. The base swivels which was a bonus. The screen is semi-matte so there's no glare - this was one of the main reasons I even looked at this TV. I like the 52\" size - the picture is very 3 dimensional compared to the smaller TV. So far, the only setup issue is getting audio through my HDMI cable from my laptop. But I don't think this is the TV as it has all the settings. Best picture is Dynamic setting and tweak it until you get what you like.", "Date": "August 27, 2011"}, {"Title": "Outstanding HDTV!!", "Author": "Kevin W", "ReviewID": "R19MB84V2MF8CR", "Overall": "5.0", "Content": "This 52\" Sharp Quattron has an unbelievably detailed, realistic picture!! In an ALCS game this year, a pitch in the dirt showed individual pebbles and dirt flying...... WOW! Seeing individual hairs on talking head's hairdos isn't really pleasant, but the HDTV detail is there. Just be sure you have a $30 to $40 HDMI cable (coax just won't give you the picture you are looking for!) - it only took me a week to figure that out. Would recommend this 52\" TV for large rooms (sitting viewers 12' from screen) but it's easily viewable from 25' away.Setup was fairly painless, but give yourself thirty minutes to go through the wizard and get a picture. Figuring out what Sharp means by \"Cable/Antenna vs Set top box\" really meant (we have cable through a set top box) and what Sharp meant by \"Skip TV input\" is NOT intuitive but OK. Instruction manual is also difficult to navigate, so it's great that the TV set itself up, generally.TV audio is just OK, as seen in other reviews, but we've run this TV audio through our existing surround sound DVD system, as planned, and sound is now excellent. Use a digital audio cable (fiber optic) there, too, for a better audio experience.For the money ($1200), this LED HDTV was an excellent value. This year, anyway!!", "Date": "October 12, 2011"}, {"Title": "Outstanding Sharp Crisp Color", "Author": "LOUIS PAONE \"drlgp\"", "ReviewID": "R2MF432UELSZNR", "Overall": "5.0", "Content": "I purchased this TV in January because I saw it displayed at an electronics store and thought it had the best quality HD picture of any of the other TV'S I saw.When I received it and set it up I was very disappointed with the color quality and the sharpness. So, I started to try and adjust the colors myself. It was better but no where near the picture I expected. So I called Sharp technical support and explained my problems with them. They were able to take over my set from where they were and re-adjusted all the settings for color, sharpness etc.( Their support is fantastic) The bottom line is the set is absolutely incredible since Sharp made the adjustments. The colors are sharp and crisp and a true pleasure watching.In short the factory default settings have to be adjusted to really get a true HDTV quality picture.Also, do not expect to much from the speakers. They are just adequate. So a surround sound system solved that problem.This is a great HDTV and have no regrets purchasing it.", "Date": "September 28, 2011"}, {"Title": "Great TV for a Great Price", "Author": "Oscar Burgos Jr. \"BoogieNYC\"", "ReviewID": "R30N5SEF6LFR6Y", "Overall": "5.0", "Content": "After owning the 60 inch version of this model I purchased the 52inch for a smaller room and am extremely satisfied. Clear crisp video quality easy to use. Highly recommended.", "Date": "May 25, 2011"}, {"Title": "Stellar pic", "Author": "Bob Buddy", "ReviewID": "R2YLQ270V95CET", "Overall": "5.0", "Content": "The Quattron 4-color system really expands the color spectrum, seemingly adding detail beyond HD, and the pic has a depth, almost like 3D, that I haven't seen on any other set.  My wife, who usually yawns at technology, was very impressed too.  Go see this one before you buy.", "Date": "September 24, 2011"}, {"Title": "Awsome LED TV!!", "Author": "Daniel", "ReviewID": "RLIJ9YWE70ISS", "Overall": "5.0", "Content": "Just bought this TV after a long search for a LED tv. This TV has everything I was looking for.Lots of HDMI ports(4), 120Hz refresh rate, good resolution, right size for my living room(52in),WI-FI ready, very thin, very light and it has a very small frame too. Got everything set up andplayed a BD movie(Toy Story 3) and let me tell you, it looks sooo good. Very bright colors andresolution, it almost looks 3D. Me and my family were very impressed with how good Blue ray andDVD movies look on this TV. HD channels look very sharp with beautiful colors.  The standarddefinition channels are not that great(as expected) but still very good. Internet connection waseasy to setup but I dont think I'll be using it too much. I also noticed the light bleed somepeople have complained about, but is really not an issue unless you are super picky. Its onlynoticeable on very dark scenes and it does not detracts from enjoying your movie or show. Thisis a common issue with LED TVs. I have read the same complain with different LED TV brands as well.Honestly you won't notice unless you are looking for it during dark scenes. I absolutelylove this TV and I highly recommend you put this model on top of your list ifyou are looking for an LED TV.", "Date": "November 19, 2011"}, {"Title": "Great TV", "Author": "Crashley \"ABMS\"", "ReviewID": "RA19KQLZDM76W", "Overall": "5.0", "Content": "I reviewed different HDTVs a lot before deciding on getting another Sharp Aquos.  Once again, Sharp did not disappoint.  The picture is so fantastic that it seems as if you're watching a play instead of a movie.  It's almost unsettling.  The colors are vibrant and it automatically adjusts it's brightness.  The built-in wifi and apps are awesome features to have- listening to Pandora on my TV is great.If you're a gamer, you'll be happy to know that this TV keeps up with the PS3 and PC gaming without any problems.", "Date": "August 31, 2011"}, {"Title": "bad customer service", "Author": "Dennis E. Cox \"dekapden\"", "ReviewID": "R27WMG64FRE2YK", "Overall": "1.0", "Content": "I purchased this TV just before Christmas online from Sears with a store pick up.  When it was first turned on a series 2\" by 5\" white bars appeared on the left part of the screen.  My first call was to Sharp customer support who assured me that it was a bad HDMI cable which I replaced with a new cable ($$$).  This did not cure the problem.  On the next call I was told that the problem must be with my dish service but when I told them that the problem also was present when watching the DVD, they said if I would send pictures and videos of the TV in all moods.  Several videos and about 15 pictures had to be uploaded.  A week after the 12-48 hours they said I would be contacted, they agreed to ship me a replacement.  After another week the replacement arrived and was set up for me but I was advised that I needed to wait 2 hours to turn it on so that the TV could warm up (enough time for them to get out of town!).  The replacement TV had a different problem, snow falling across the whole screen. I got the same answers from customer service.  I refused to buy a third HDMI cable.  Uploaded another batch of videos and photos and a week later they said they would send out a repair person.  The local repair shop came to my house and installed a new main board--no joy!  The technician surmised that the power supply was bad and packed the TV off to their shop.  Another week goes by and I finally call the shop and they inform me that they have not received the part.  Armed with the part number for the power supply and the direct number to the Sharp parts department, I called and was informed they did not stock that part and had no way to obtain it!  Back to their sorry excuse for customer service and was told they would get back to in 12-48 hours, yea right.  After a few days I did what I should have done from the start--I took it back to Sears who graciously took it back and issued a full credit.  Never buy from someone that you can't return the product to.  If I had bought this from some online shop that makes you deal with the manufactures customer service, I would still be taking a TV holiday.  Buy the way, who won the Super Bowl?", "Date": "April 14, 2012"}, {"Title": "sharp quattron 52 inch flat screeen television", "Author": "stormy93", "ReviewID": "R1K68XHNSMXO7F", "Overall": "5.0", "Content": "This was purchased for a family gift at Christmas.  Out family absolutely loves this new tv.  It is huge, the color is absolutely fantastic.  Extremely easy to get mounted and ready to watch.  I will purchase another one if the need should rise.  Great television.  Thank you so much for your great prices.  Sandy", "Date": "January 13, 2012"}, {"Title": "Good TV", "Author": "Kevin", "ReviewID": "R15TJ5U2WDYTHE", "Overall": "5.0", "Content": "I love this TV.  Good picture and quality. Sharp TV's have a lot less screen glare than most other TV brands on the market, so they are great for rooms with lots of sun light or other lights.", "Date": "January 3, 2012"}, {"Title": "Amazing TV!!!", "Author": "Shopper from RC", "ReviewID": "R2UALSHQTJHELF", "Overall": "5.0", "Content": "I owned a 50-inch Mitsubishi big black box TV for over 11 years. Although still working perfect, just had to update to a flat panel and HD! I researched for weeks and narrowed it down to the three \"S\" - Samsung, Sony or Sharp. Shopped at Amazon, Costco, Sams Club & Best Buy. I was able to see all three \"S\" TVs at Best Buy right next to each other on the wall. This Sharp, by far, had the best picture! Amazing crisp vivid awesome colors! I am 100% certain I made the right choice and wouldn't hesitate to recommend this TV to family and friends. Buy it, you won't be disappointed!", "Date": "November 20, 2011"}, {"Title": "Better then Sony 55\"", "Author": "L. Stemm \"larry_ohio\"", "ReviewID": "R2WIRB7BVNQ0AQ", "Overall": "5.0", "Content": "I had to down size from my Sony 55\" tv due the small space I had now.  This Sharp is brighter and the colors can't be surpassed. Will I have had it for a while and it just gets better.  I wish I could find out what sound bar to get.", "Date": "October 31, 2011"}, {"Title": "Great TV if you only want it for 2 years", "Author": "Marc Tardif", "ReviewID": "R3I5UAIYP5QPU1", "Overall": "1.0", "Content": "On it's 2 year anniversary, it developed a thin vertical blue line just off center on the screen.  Searching the forums shows that it's happening to a bunch of different Sharp TVs even newer than mine.  Some have said that the repair man says it's the panel and it's unfixable.  $1200 bucks down the toilet.", "Date": "September 13, 2013"}, {"Title": "Love it!", "Author": "Brandy", "ReviewID": "R3TCO0KZT326Q5", "Overall": "5.0", "Content": "I purchased this tv in December 2012. Delivery was fast but no set-up. I really like this tv. I do not use all of the features that the tv has offer but this far I have no complaints. The setup was very fast and simple. Highly recommed this tv. I was looking to purchase another one but the price is currently too high. When I purchased it I paid 1100.00 . It is now running at 1500.", "Date": "April 22, 2013"}, {"Title": "very happy", "Author": "strbildr", "ReviewID": "R2SNWRV682IJBV", "Overall": "5.0", "Content": "i agonized for months before buying this.  bottom line,  sharp makes a great product, was reasonably affordable , specs, picture, apps all great .  only thing is , you always wish you bought something bigger , that's just the nature of these things.", "Date": "January 27, 2013"}, {"Title": "Great tv esp., since these models are gonna b discontinued!", "Author": "fs", "ReviewID": "R2FH5WHFXXPEG6", "Overall": "4.0", "Content": "Plasma prob. Produces best in regards to motion and picture. AND, boy have plasma prices FALLEN! But, the screen glare is terrible and turning people away (me included). That's 1 reason I went with this Sharp led, MATTE finish.Overall, this set is great and the sound seems pretty darn good for a TV to me (I'm somewhat of a musician, maybe I'm a bit deaf?!) this TV is still new to me and I'm tweaking picture, but I'm pretty darn happy right now.These models going away so u MAY b able to grab this model for under $1000 TOTAL (I grabbed for under $900). Some r still trying to sell these for upwards of $2100.I easily went overboard (arg!) researching reviews/specs vs Samsung, etc. but overall, thought this was the best choice. It's not a 2013 TV, but it's brand new to me!Why not 5 stars? Becos in the end it's just a TV.", "Date": "January 26, 2013"}, {"Title": "TV is just \"Ok\"", "Author": "REG", "ReviewID": "R2EERA4PZJAPLF", "Overall": "3.0", "Content": "I recently has a 42LG40 that was a great TV.  It was only a 42inch so I wanted a larger sized tv.  I upgraded to this sharp as I have heard sharp makes great Tvs.  I ordered it from another website, the price was good, the reviews were good so my expectations were fairy high.  Upon the TV arriving I spent alot of time on calibrating the TV to suite watching TV, as well as playing Xbox 360.The pros of the TV is the picture quality.  The colors are pretty accurate although my LG had a better overall picture (more accurate)I like the black levels.  One of the downside with LGs is their \"greyish\" blacks.  This is most noticeable in low light rooms.  The Sharp surpassed my LG, as blacks all seemed very dark which caught my attention.The menu setup, and the features of this TV are very well. I like the fact that it has built in wireless which is nice since my LG needed an adapter.  The apps have all worked well however I dont use them much since my xbox 360 does these same apps only much better.Sound quality is pretty good, better then many LCD TVs I had prior, but since I have surround sound I dont use the TV speakers, I merely tested them out.The cons.  The TVs picture is done well however transition of scenes more so cable/HD broadcast the transition is very poor.  Many times you can see the back round flicker.  No I am not speaking about the backlight setting that adjusts itself.  Basically if you are watching a program you can see the backround go lighter darker lighter darker lighter darker as if the TV is struggling with the picture.  Some may notice it maybe some may not but for me this is becoming hard to watch any TV broadcasts without being distracted by backround images.  It becomes the most apparent when in darker low light scenes. It is also not my cable provider as my LG never had this issue.  I read a review online that this was so bad that rated the TV as poor and almost not watchable so I know I am not the only one.Now onto fast motion (sports). For the most part sports are not too bad when using this TV.  Some fast motion causes the screen to do the \"block image\" even when using the TV 120hz enhancer.  The issue with that is even when leaving the 120hz on all the time TV shows become slow motion (soap opera) like.  Which means you have to turn it on for sports, then turn it off everytime you want to change to regular TV programming.So far these short comings have me on the fence of possibly returning the TV.  I may still keep it as the thought off taking the stand off reboxing, and shipping it back has me on the fence.  I am still giving the TV some more time to hopefully change my mind to keep it.  I honestly think their are much better choices for the same or less $.  If it was up to me I would keep looking.  I will try to update my review if I have more to add.", "Date": "December 13, 2012"}, {"Title": "Because of this TV I will never buy another Sharp product again.", "Author": "cel007", "ReviewID": "R2I4C0CJ8PKDHG", "Overall": "1.0", "Content": "We have had this tv for over a year and half now and I don't know how many times my husband or I have muttered 'God I hate this TV' in all that time.  I had originally gone to a local electronics store where Sharp was their featured product. When I found a better deal on Amazon I chose to buy it via the site.  Our main problem with the tv is it constantly has little glitches that prevent it from working correctly. I am sure some of this is also human error on our part, but one should not have to consult the encyclopedia of a user manuel every time you need to make minor adjustments. We also could have just gotten a lemon, who knows.  Basically, it constantly malfunctions. The power button for instance, must be pressed HAAARRD for it to work. It is not a raised button on the TV and only works about half the time. At the moment it does not work at all and can only be turned on or off with the remote unless we unplug it from the wall and plug it in again. This is minor, but come on it's just the power button! That's only the beginning. And for us, the end of any other Sharp products in our household. Our other LG flat screen is about 7 years old and works like a charm. We'll be using their products in the future.", "Date": "November 24, 2012"}, {"Title": "Excellent picture quality but Sharp has stopped this model", "Author": "Ketan", "ReviewID": "R21VY2VM79Q5EL", "Overall": "4.0", "Content": "This is first review am writing for any product because of special experience.Have ordered it online from Amazon and \"HH Everything\" as seller.Was amazed by picture quality.  Sound is good given size of speaker which can fit in TV.However after three months of use found one black line in middle of screen.  Called Sharp support center and came to know it is refurbished unit.  For refurbished unit warranty is for one month only but Sharp was ready to replace with extra $300.Called HH Everything (seller), got excellent support from seller.  After knowing all details they provided new unit which is 3D version i.e. LC-52LE835U.  Just received and so far so good.  Planning to update review in case of further un-usual experience.", "Date": "September 10, 2012"}, {"Title": "Great TV, easy to setup and use!", "Author": "npersad", "ReviewID": "R2L9EULZ1I3LJX", "Overall": "5.0", "Content": "Sharp is the best when it comes to customer service and high quality products. Great, realistic picture quality and great internet features.", "Date": "January 13, 2012"}, {"Title": "52\" SHARP AQUOS", "Author": "T. Sutton", "ReviewID": "R2WUSDP98QFJTT", "Overall": "5.0", "Content": "a  COMPLETELY satisfying experience dealing with Amazon. The Sharp Aquos has one of the best pics I've ever seen. Easy to set up and of course the built in WiFi is a real bonus if your a movie buff. I give it 5 stars and would recommend it as a choice for anyone.", "Date": "January 6, 2012"}, {"Title": "All I can say is WOW", "Author": "Lakeguy51", "ReviewID": "R1Q8URYEHUV02E", "Overall": "5.0", "Content": "I purchased this unit in mid summer and have really enjoyed it. The picture quality is excellent and many people have commented on how lifelike the image. We live in a area without high speed internet so I cannot comment on the integrated applications.  I heartily recommend the Aquos series of Sharp TVs.", "Date": "January 1, 2012"}, {"Title": "Great Picture and Quality!", "Author": "Betty J. Rascon \"Bettrick\"", "ReviewID": "RS93EEPSRPRMV", "Overall": "5.0", "Content": "I purchased this TV 3 months ago and the picture quality is so clear because of the extra color from Quattron. I am so happy that I purchased this TV.  Thanks Sharp on developing a great TV.", "Date": "December 16, 2011"}, {"Title": "Sharp LC52\"LE830U TV", "Author": "mr. bob", "ReviewID": "R31K9ZDJAN5SY0", "Overall": "3.0", "Content": "The first tv arrived and we set it up and it worked for a few hours before we had a green line down the middle of the tv.  We called sharp and they said they would have to send another tv and this one can not be fixed.  The second one arrived 2 weeks later. It was supposed to be here in one week.  The tv has been working fine and we have had it for a couple of months now.  I dont like that it loses contrast in the picture anytime you are not standing right in front of it.  You still have a good picture but it looks like you need to adjust the contrast when you move just a little bit to the left or right.  The sound id ok but not great from the tv speakers.  When I called sharp the first time they were very helpful and nice. After getting the 2nd tv and finally reading everything (paperwork).  I was reading the info that came with the tv and it was talking about the great service that goes with an Aquos owners tv. It says that you can call in and they would help you with the set up of the tv.  They say that after you hook it up to the internet, they will help you make all of the adjustments to the tv with them taking control of the tv through the internet connection. That was a bunch of crap, I called to ask about that for my tv and he said that was not true.  So, I guess, as soon as they get your money, thats it.  My purchase with Amazon was great. They always treat me great and I never have had a problem with them. I buy many things and always use Amazon.", "Date": "December 12, 2011"}, {"Title": "Great Experience", "Author": "chevchelious", "ReviewID": "R3QULMWUIJW021", "Overall": "5.0", "Content": "I have had yet to own a HDTV or an LCD TV for that matter until buying this beauty!I did a lot of research and the price is absolutely spot on with the features it has compared other brands of similar TVs.Setup was really easy. I love the motion plus.  It makes it super realistic.  I got mine through Warehouse Deals, via Amazon and got a great deal, Like New for half of MSRP. And it arrived pretty much as a new item.  you could tell the packaging was opened once, but I expected this.The only downfall and mind you it's a minor one, is that the advertised DLNA capabilities only work over Ethernet cable and not through WiFi.Great buy!", "Date": "October 31, 2011"}, {"Title": "TV purchased thru Amazon", "Author": "David Stockman", "ReviewID": "R1T0T039OCM69X", "Overall": "5.0", "Content": "The new HD Sharp TV that I just purchased is the best I have ever seen...better than those plasma sets that my friends own.  I have owned Sharp products for over 40 years, and never had a problem with any of them.  When connected to a Sony surround sound system this is a total winner.", "Date": "October 12, 2011"}, {"Title": "sharp 52 aquos tv", "Author": "webelimin", "ReviewID": "R3R1HQ64T2A9OL", "Overall": "5.0", "Content": "This Television is Great I bought it about a month ago and easy to install I bought a wall mount  still have to hide the wires) Color and brightness is the best I have seen. The addition of the yellow must have done something to quality and the led is much brighter than regular lcd or I replaced my dlp with this .. Very nice television also I have a bose Sound system on mine and you know bose...", "Date": "September 28, 2011"}, {"Title": "Fabulous TV, Great price, Flawless delivery and settup!", "Author": "John Gondol \"olde retired preacher\"", "ReviewID": "R1UJTMPL7K3DM3", "Overall": "5.0", "Content": "When I went to my big box retailer to compare HDTVs, I was particularily impressed with the picture produced by the Sharp LC52LE830U 52\" TV.  After looking at several other models, I determined that the LED-LCD model TV was what I wanted.  I compared prices and found that through Amazon, I could purchase the set for $350.00 less than at my big box retailer and have it delivered for free.  The caveat was that the box that the set came in had been opened, but full factory warranty would apply.  Even though this is a major investment, the savings were just too great to ignore, so I decided to make the purchase.  The promise was that the set would be delivered within 10 business days.  I was called on the ninth business day after placing my order and told that the set could be delivered that day.  Delivery was made at the agreed upon time, the set was removed from its box(which looked like it had been scuffed), and was settup for me.  The set was turned on to make sure it worked, which it did.  I signed the necessary paper work and the courteous delivery men were gone in a little over 30 minutes.  My TV has performed in an exemplary manner; the picture is fabulous, the sound strong, and controls easy to use.  With the savings on the purchase price, I was able to buy a four-year extended warranty and still have over two-hundred dollars less invested in my TV.  I am completely happy with this shopping experience!", "Date": "January 31, 2012"}, {"Title": "Extended Warranty Worth Considering", "Author": "Objective Reviewer", "ReviewID": "RWLQSLQUXCMIA", "Overall": "3.0", "Content": "2 Days out of warranty, the predecessor to this model (which I owned) developed symmetrical defects in each upper corner of the set (the chassis that could be seen through the back of the TV matched the defect that appeared on the screen).  Sharp provided a one time replacement as the defect was very obvious and barely out of warranty.  So, at least for me, service was great!  The replacement sent was the newer model which had some pluses and some minuses out of the box (e.g. cheaper stand, but wi-fi connectivity).I routinely watched hockey (and most sports) on the dynamic fixed setting on my first Aquos and there was NO motion blur at all - none.  However, the newer \"improved\" model - with all variables being constant - produced nasty motion blur watching sports on the same setting.  I altered many settings in the \"dynamic\" setting to try to reproduce the visual quality of the dynamic fixed and NO motion blur was detected.  So, my replacement set is \"fine\" but leaves me with a question about why the motion blur defect in Dynamic Fixed exists on the newer model but was not present on the previous year's model.Properly calibrated, I think the set is reasonable in quality etc., but I am now slightly regretting not having purchased perhaps a slightly more expensive Plasma model (motion blur can occur on any set, but sports/motion blur seems to be, overall, less of an issue with Plasma).If sports is your thing, I'd recommend two things.  One, extended warranty (for any display - Sharp or other) and, second, I'd consider a minimum 240 Hz LED/LCD or preferably, a plasma television.", "Date": "December 28, 2011"}, {"Title": "Great TV", "Author": "jbrown", "ReviewID": "RA0XJIQ6CKDSD", "Overall": "5.0", "Content": "The picture really pops with the yellow added to the color mix. Arrived in great condition the shipper was helpful in unloading and inspecting the TV.", "Date": "January 13, 2012"}, {"Title": "Sharp Quattron 52 inch led lc52le830u", "Author": "pilgrim", "ReviewID": "RBCXRZZJQTFDI", "Overall": "3.0", "Content": "I would like to say thus far the set seems good quality. Spending a little time trying to get it adjusted. Had to take it out of the eco mode to get the picture bright enough to begin with. Picture clarity is very good, but seems to at times get into a mode where the lighting changes to what can only be described as \"soap opera\" picture. You know what the daytime soap opera pictures look like. The lighting changes to that type of picture. Then just that fast goes back to what I consider normal theater lighting. Must have something to do with an automatic setting I have yet to discover. It is some what annoying.Shipping took forever. It took a full two weeks to get the set. Spend the extra money to get expedited shipping unless your in no hurry at all. I'll get back to you later on the lighting issue when and if I get it figured out.I hope it will just be a adjustment issue.", "Date": "December 27, 2011"}, {"Title": "Very disappointing picture.", "Author": "Mike Lightman", "ReviewID": "R1SWOLNW9803WA", "Overall": "2.0", "Content": "There's a lot to love about this Sharp tv. Picture quality is not one of them.This wifi-enabled LCD is thin & light. I was able to put it on the wall myself with minimal grunting. The speakers are no where near as bad as everyone says they are. They are rear-facing, so the sound is muffled, but not bad. Wifi set up was a total breeze. It saw my network, took the password and boom, I was listening to Pandora. The apps are pretty ridiculous too. The main app selection is limited - Vudu, Netflix, Blockbuster, Napster & a few others. But there's a lot buried in that Vudu app. Pandora, Facebook, Twitter, Discovery, TED. All worked without a hiccup.Now, let's talk about this picture. I'm coming from a plasma, so this screen is a major disappointment. Everything looks dull and muted. There's an embarrassment of riches in terms of picture tweaking options. But, none of it helped. Colors were blown out and subtle shades melted into one another. The blacks are especially splotchy. Movement is also a major issue. I was watching Mel Brooks wave his hands while sitting in a chair and there was major pixelation. I called the super Sharp tech support people, and they had me turn off all the extra stuff--like 120Hz Fine Motion--they push as enhancements. Overall, everything looks dull and unimpressive.This puppy went back, replaced by a Panasonic Viera", "Date": "November 6, 2011"}, {"Title": "Not satisfied at all - had to return it", "Author": "Abeszta", "ReviewID": "R20PUFUYASD43G", "Overall": "2.0", "Content": "I'll be short and to the point.  After spending $1,300, I had high expectations for this TV (even tho it is considered a lower quality TV).  When it arrived, I was excited to have upgraded from 42\" to 52\", but thats about all I was satisfied with.  The design is very vanilla.  I was aware of this prior to purchasing, but it was even more apparent in person.  Picture quality was very underwhelming.  No WOW factor whatsoever.  When I mentioned that to a friend, he said, \"I didn't want to say anything because I felt bad, but I noticed that as well.\"  Along with the limited selection of Apps, that was enough for me to return the TV.Purchased the Samsung D6400 55\" to replace it and could not be any happier.  When I finally set it up, I got the WOW factor I was looking for, in every aspect.  Wouldn't purchase any other TV!!  AND it was only $200 more than the Sharp on Amazon!!!", "Date": "November 3, 2011"}, {"Title": "Problem three days after it arrived", "Author": "Colette Fraley", "ReviewID": "R2791GY2DSE2C1", "Overall": "1.0", "Content": "TV looked great for three days. On the fourth day, a thin red vertical line appeared on the left side of the screen. Don't know yet whether this is just a bad apple or if there is a flaw in the model.", "Date": "July 20, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004NOVLRK"}}