{"Reviews": [{"Title": "Not ready for Prime Time", "Author": "Mike", "ReviewID": "RYHHF40JUHGCL", "Overall": "2.0", "Content": "First, for disclosure, my friend bought this Haier unit on a one day sale from Fry's Electronics for just under $200. So no reflection on this Amazon vendor. Just want to warn others about this TV.Per my pun in the title, I'm not very happy with this \"TV.\" Truly, it isn't ready for Prime Time.The picture took a little tweaking (default sharpness is WAY too high), and surprisingly, even with strong cable signals, you have to set the Noise filter to \"Weak\" (as opposed to \"Off\") or else you get jpeg artifacts (or something like them) floating in backgrounds and old analog channels looked pastel-ish. Once you tweak it, the picture is okay and the sound is fine.But the real killer is the tuner itself, and somewhat related to it, the slowish, sometimes forgetful brains of the TV.The tuner has problems locking on frequency on the higher channel numbers, say in the 120's. Sometimes it does and sometimes it doesn't. (As an Electrical Engineer, I suspect some sort of PLL design problem.) The first set my friend bought was worse, and wouldn't lock on to a lot of high channels. An exchange unit does better, but still won't lock on one channel. When was the last time you ever saw a TV that couldn't tune channels?Given the history of the units bought on sale at Fry's, one wonders if the units we experienced are gray market rejects, sold at a discount? Maybe full price units do better?The Remote, and the brains behind it, seem slow and forgetful. For example, after you run through the show/hide menu of channels, it takes about 10 seconds before the TV is ready for input. It's almost like the thing has a one bit, 1 Hz microcontroller for brains. It takes about 15 to 20 minutes to do a first time channel scan, whereas her other units can do it in five.Even after you've set preferences, they will sometimes change on you for unknown reasons. (Cosmic Rays? An old engineering joke.)And worse, the channel recall only seems to recall your last channel for a minute or two! So if you don't keep flipping back between channels, it must figure you're happy where you are (never mind that most commercials sequences run about three or four minutes) and it forgets the last channel and clicking \"recall\" simply brings up the channel you're currently on. Really bizarre.The remote itself is semi-usable, typical of Chinese/Japanese designers who don't seem to grasp ergonomics.I like the Electronic Programming Guide, which our more expensive, brand name units don't have, but the on screen fonts on this unit are tiny, very hard to read from six feet away and I see no way to adjust font size. I'll post some pictures if someone asks me.The box says \"Official HDTV of the NBA.\" Guess that proves that if you jump through enough hoops, anyone can get an endorsement.P.S. You're asking why she keeps it? She doesn't watch it. She bought it more for \"decoration\" in a guest room and wanted a cheap 26\" TV there for the occasional once a year visitor. Were it up to me (it's not) this TV does not pass the \"man cave test.\"", "Date": "October 23, 2011"}, {"Title": "Should not have gone to market", "Author": "K. Curtis", "ReviewID": "R1NIGH79EO2SBZ", "Overall": "1.0", "Content": "This TV really needs a thorough trip through the Quality Control department before they sell any others.  The TV has problems viewing cable channels randomly (but frequently).  The speed at which it can process the presses of button on the remote is extremely slow.  However, when it does show a picture, it works as you would expect it to - you can hear the sound and see images on the screen.There really are not any pluses to this TV - it's just a TV.  If it didn't have any probems, I'd give it 4 stars.  Nothing fancy.  I do like that I can plug the cable line in the side (instead of the back) so it mounts flush against a wall.  Plus, I like that it has a VGA port meaning I can use it as a monitor.However, the 2 drawbacks are enough to warrant me to say don't purchase this TV.  (In fact, I'm returning mine tonight).  I'm hooked up to basic cable.  When viewing channels under 20, it works fine. However, when channel surfing to channels above 20, the TV will occasionally freeze up, show a blue screen, and do nothing.  There are 2 recovery methods from this issue - either wait and randomly press buttons on the remote or the side panel and hope one eventually works.  (If one does eventually work, it could be anywhere from 20 seconds to 5 minutes.  I gave up after that).  Then you can go into the menu system to where you can add and delete channels and change the channel there.  Then exit out of the menu system and continue surfing until it happens again.  The other solution is to detach the cable TV line, wait about 20 seconds, go into the menu system, change the channel, then plug the cable line back in.I tried to minimize the issue by deleting all duplicate channels above 20 as well as the ones that commonly caused it to lock up, but even then others caused these same problem.The TV remote speed is also annoying.  After pressing channel up or down you have to wait a full second before you can do something else.  When in the menu system, you have to wait about 1.5 seconds between selecting an an action and changing it's value.I bought this for $125 new.  I personally wouldn't pay more than $50 for it and even then, would probably be very annoyed.  It seems like it would work fine as a computer monitor, but as a TV monitor, it's severely lacking in quality at almost any price.", "Date": "August 12, 2012"}, {"Title": "hardly a TV set", "Author": "zadeni", "ReviewID": "RDNJWOL7WQERZ", "Overall": "3.0", "Content": "It is a nice monitor for PC. You can also view your digital photos on it via USB, the quality  of the display is pretty high. But I am still pretty much disappointed since I intended to use it for my cable network.", "Date": "February 20, 2012"}, {"Title": "Nice TV", "Author": "Wanyce Cofell", "ReviewID": "R3D3SE9GJBMKC0", "Overall": "4.0", "Content": "I bought this for my son and it has everything he needs. Great picture and lots of custom options to program.", "Date": "December 21, 2012"}, {"Title": "Great small flat screen for the bedroom!", "Author": "H. Shaver", "ReviewID": "R27S6W7GD6814E", "Overall": "4.0", "Content": "Living in Atlanta we have many digital broadcasters!I do not have cable everywhere. But it does have the internals to connect to those providers.The reception is great. Cannot imagine how good it be if it was hooked to cable or a satellite! Lots of features! Great price also!", "Date": "August 8, 2012"}, {"Title": "poor screen", "Author": "John A. Piccoli", "ReviewID": "RU68E2Y2W8PTG", "Overall": "1.0", "Content": "The tuner is not very good. You might wait 15 sec before you see a picture when changing channels.The screen has blotches of bright and dark bands.It is hard to call this a TV.", "Date": "June 30, 2012"}, {"Title": "excellent TV for the price", "Author": "sillygirl", "ReviewID": "R1ZZIA89PRW30X", "Overall": "5.0", "Content": "I bought this for my bedroom-not really wanting a tv in the bedroom but my husband did-First-i should mention-I have a haeir washer-that has saved my life at the laudromat-and because of the great washer-i went with the 32 inch for the living room-in other words i like the haeir brand-good solid products at a fair value.Now i actually enjoy the bedroom tv-the sleep feature and auto volume leveler keep things quiet.Excellent Tv-be not afraid...", "Date": "June 17, 2012"}, {"Title": "The best TV I had so far..........", "Author": "yobunhua", "ReviewID": "R27WWGMSTOSWV4", "Overall": "5.0", "Content": "Just wondering some here had negative feedbacks about this TV...I was enjoying mine for almost 6 months now without any troubles. I had indoor antenna connected to it and cant believe the reception I would say its better than with cable.....It was amazing TV .....thanks", "Date": "April 11, 2013"}, {"Title": "Great bedroom Tv", "Author": "Mike", "ReviewID": "R2CQDPMNFTGHHH", "Overall": "4.0", "Content": "I bought this tv at ABC Warehouse for 150 which was a decent price. I bought this for my bedroom tv and monitor for my computer. It has 1080p which is what I wanted. It also can have surround with hdmis.Pros: Very nice for the price. Average size. Easy to set up and put together.Cons: Can be dark at points.", "Date": "June 6, 2012"}, {"Title": "Haier Quality and picture is remarkable!", "Author": "Sajid G. Mulla", "ReviewID": "R3J8YKFJVGGSUR", "Overall": "4.0", "Content": "I'll be honest before I started using this brand I was weary about its quality. I set this TV up in a business and it is perfectly acceptable colorwise and picture quality.When a brand is advertised by the NBA I am weary because of  the extensive marketing but this TV is perfectly acceptable picture wise and input options.If the price is in the acceptable range for you do not hesitate to purchase this for the bedroom.", "Date": "January 26, 2013"}, {"Title": "Unbeatable for the money!", "Author": "M. Chavez", "ReviewID": "R2MJS6YLKAFCXT", "Overall": "5.0", "Content": "I read people complaining about the remote or how it can't find channels. People are going to complain about everything, it's the world we live in. I'm leaving this review based on what should matter for a tv/monitor this size and price. First of all I didn't buy it expecting it to work like a $2,000 LED. The first thing I did out of the box was connect it to my blu-ray player and watched a movie. The picture quality is amazing at 1,000,000:1 contrast ratio. I couldn't find another tv this small by any manufacturer with this level of picture. If another company makes one this small this quality it would surely cost $100 or more than I paid. What I was finding in the price range was horrible quality such as 1,000:1 or 14,000:1My purpose for buying this tv is to use it as the main monitor for the surveillance system I just purchased. I can say as a computer technician/videophile I absolutely love it. It completely exceeds my expectations. I can see wonderfully clear images day and night and I couldn't have made a better decision for the money. I literally looked at over 50 tv's and monitors before deciding on this model. I must say I was even impressed with the sound of the speakers. I turned the tv all the way up and the distortion was minimal. Everyone knows you don't buy nice LED tv's for the speakers but in this case even the speakers work exceedingly well. It's also incredibly light and thin.  Just remember people, this tv wasn't made to be your main home tv or to outperform a high end 5,000,000:1 LED but in my opinion the quality and performance outdo it's affordable price.  I recommend this unit to anyone that understands what they are getting. Really people, if you are expecting the world spend more than $179..... really! Happy shopping :) Haier LE22B13800 21.5-Inch 1080p LCD TV -Black", "Date": "March 13, 2012"}, {"Title": "Don't buy haier", "Author": "L Potts \"LP\"", "ReviewID": "R3F19NPSIBTMDF", "Overall": "1.0", "Content": "I bought this tv in 2010 and yesterday I turned it on and the picture comes on with sound then the picture goes black and all we have is sound. Haier says out of warranty and I have to ship back at my expense to have repaired. Cost will end up being more than new tv.", "Date": "August 21, 2012"}, {"Title": "Grate picture and a good price", "Author": "Dennis Friedman", "ReviewID": "R8V1B9V6HM2RI", "Overall": "4.0", "Content": "I can't believe this picture, it's grate and I don't have a Hi-Def.receiver yet. I ordered this TV from Amazon on the evening of Nov. 24, 2011 and had chosen 5 to 8 day free delivery and it was in my house (Ohio) by 8:00 pm on Nov 28,2011.  I can't say much about the setup because with Dish Network you only use one channel, sound is ok nothing to barge about, I really love the auto volume leveler, I always hated the loud commercials.  The PC Input takes a VGA cable, The remote must be pointed at the TV to work.  Product Dimensions: 30 5/8 in. side to side and 21 1/4 high with stand.  Thank You. Dennis Friedman", "Date": "November 29, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "19\" LED HDTV\nUltra Slim LED HDTV\n720p HD Resolution\n1366 x 768 Native Resolution\n3W/channel speakers", "Name": "Haier LE19B13200 19-Inch 720p 60Hz LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/31af8MotVqL._SY300_.jpg", "ProductID": "B004UK72J8"}}