{"Reviews": [{"Title": "Big, Bright, Screen!", "Author": "Speed-Racer", "ReviewID": "R19E918IS1HUFN", "Overall": "4.0", "Content": "This amateur review will be in two parts, the TV first then buying it through Amazon.I read a few online reviews of this TV and all the criticisms were wrong.  Some said the sound is poor.  It is not surround sound, but from a thin TV it is very robust.  I find it more than adequate for everyday viewing.  I turn on the surround sound for parties and Blue Ray viewing.  Some complain about lag.  I say to those people, you prob need to check what is imputing into the TV, because I see no sign of lag.  Some complain about the color.  This set has spectacular color right out of the box.  I see no need to tweak the factory settings.  I am particularly amazed by the depth the set produces.  Some even complained that the TV has no light sensor.  I don't get that as not only does it have one, the default setting actually actively tells you each time it adjusts based on the room light.  You can turn it off.This TV has great color and brightness for someone looking to light up a bright room and it's flexible enough to dim it down automatically when it gets dark.  My personal opinion is that the color blows away the 65\" Plasmas that are competing with it.The second part of this review is about buying it from Amazon venders.  You need to understand that they keep rotating on who is selling this set through Amazon.  You need to understand that some of these people are one-man operations.  They are going to send this to you via freight (only way you can do it) which in my case took ONE MONTH.My strongest points are that this is a great TV, but I advise you to consider buying it from a local store.  If it's just a difference of $100, I would take it through local delivery.  Time is money.", "Date": "September 9, 2011"}, {"Title": "Excellent Television - Best I have ever Owned.", "Author": "GatorMan", "ReviewID": "R3S6GDK3XF79NB", "Overall": "5.0", "Content": "This TV is simply wonderful!!  I love the WiFi - the super clear picture - all the HDMI ports - Gotta love the 240 for the motion.  Only little bad is the remote is not laid out real good - but I use my Logitech Harmony - so no big deal.The picture is simply amazing and bright.  People ooh and aahh everytime they see this massive tv in my house.  Glad Sharp went with a Black Case - my older 60\" LED from Sharp had a clear and silver - not fond of that.  Splurge and get the best in my opinion.", "Date": "September 19, 2011"}, {"Title": "Sharp LC-70LE734U", "Author": "Jim B", "ReviewID": "RVJDP9RVC8BWG", "Overall": "5.0", "Content": "We bought the Sharp LC-70LE734U at HHGregg (retail store) for $2659 + tax and free delivery.  Delivered next day.  Set up was simple, connecting it to my home theater system (replacing a Sony 52\" XBR4 which went into the bedroom). I cannot rate the sound and the remote control as I don't use them (use Harmoney One and Pioneer 1120-K full time).  The picture is nothing short of incredible!  We sit approximately nine feet from the TV and with the large screen size we feel totally immersed into the HD experience.  The picture is sharp, colors are brilliant and it has the feeling of depth perception.  It gives the impression that the actors are real and that you are not viewing a movie.  Call me crazy but it is that good!As the TV is only 2 days old, we can't speak to its longevity.Highly recommended so far.", "Date": "November 10, 2011"}, {"Title": "Incredible, Amazing, Value, Well Made", "Author": "David Tanaka", "ReviewID": "R2PYV4TS3EQC2L", "Overall": "5.0", "Content": "I have had this wonderful TV for 2 months now and must admit that it is simply incredible. Sharp, with their 10th generation (newest) production facility in Sakai City, Osaka Prefecture, Japan, has done a magnificent job producing a very well calibrated and accurate LED TV.The picture was good out-of-the-box but I used the Disney WOW: World of Wonder calibration disk to tweak the picture on the Sharp LED and sound on the Yamaha AV receiver. The Disney WOW blu-ray disk did wonders for the picture. After calibration my Sharp LED picture was so amazing my friends and family could not believe it. The picture and colors were so sharp it looked 3D without 3D glasses. You'll love the Disney WOW disk.PROS:- The flat-panel is manufactured in Japan (Sakai City, Osaka Prefecture) in Sharp's newest 10th generation plant. It's the world's first LCD panel plant employing 10th-generation glass substrates that can produce cutting-edge large LCD panels. The LCD panel plant is the first facility in the world to adopt 10th-generation glass substrates. Using Sharp's proprietary UV2A*4 photo-alignment technology, the plant is capable of producing high-contrast, energy-efficient panels of 40 inches and larger, marking a new era in large displays.- Energy efficient- Its matte screen and high potential light output make its bright-room picture quality superior to that of large plasmas. It comes with excellent help and support options and built-in Wi-Fi, and consumes less power than plasma models.- Full-array LED backlight but wish it had local dimming- Nice aesthetics, mostly glossy black, with a medium-size bezel, with slightly rounded-off corners- The Aquos illuminated caret logo in the bottom center can be turned off- Thin 3.5-inch depth (for a full-array LED backlit) and low profile.- Quattron is not a gimmick. It is a fantastic technology and makes the picture pop w/ color, brightness, clarity and accuracy. In addition the Quattron technology produces very accurate and pleasant skin tones.- Inputs chosen with 1 button action.- Improved internet suite- 240Hz refresh rates, USB and built-in Wi-Fi- Not too heavy for such a large TV coming in at 92.6 pounds.- High end, affordable, huge 70 inch LED TV with quality, professional grade manufacturing.CONS:- No dedicated TV input button on the remote and no remote control backlight. To watch TV broadcast I have to first press the Input button, then cursor to the TV input option. This is not a big problem anymore since I got the Logitech Harmony 650 Remote Control.- Broadcast TV channels are slow to change. Not a problem anymore since I watch TV using Media Center on my Windows 7 PC computer. It has a channel guide for quick channel surfing.Overall, a fantastic LED-LCD television that outperforms their competitors.", "Date": "December 29, 2011"}, {"Title": "Awesome tv set", "Author": "Fotbalfan", "ReviewID": "RYJPJ4R03FQD0", "Overall": "5.0", "Content": "Purchased the TV yesterday and the \"factory set\" picture is the best I have seen in a set.  I have messed with a few of the setting and really am amazed at the depth of color.  It looks in some cases almost 3D. I've spent the day viewing movies, NFL football and various other programing, I have not seen a weakness yet in the set.  Watching Lord of the Rings movies revealed actors incredible costumes and makeup, that again hadn't been able to see before.I would definately recomend the set to anyone considering it.", "Date": "November 27, 2011"}, {"Title": "Nice!", "Author": "icebergmikey", "ReviewID": "RB085HMXJMW7M", "Overall": "4.0", "Content": "I bought this TV a few weeks ago from Costco...TV works great. The internet options aren't the easiest to figure out and use, but the picture is superb! I now watch everything in HD, there is nothing like it. I actually think my basement area is too small for the size of this TV, but its worth the money! I am having some difficulty hooking up my surround sound with the TV and the instructions aren't that clear. I may need a different cord or something, haven't figured it out yet. It reminds me of old Martin Lawerence tv episode, when he bought the Hasitashi 1000...This TV is the same! LOL", "Date": "October 25, 2011"}, {"Title": "Great TV", "Author": "T", "ReviewID": "R2V8E1E6WELYY1", "Overall": "5.0", "Content": "We received this TV yesterday through Amazon (Huppins). The TV was ordered last Thursday evening. The TV arrived the following Tuesday in excellent condition.  We have read many, many reviews on this TV. Some were good and some were critical of the picture.  We have our cable box, Mac-Mini,  Blue-Ray and X-box connected via HDMI cables. The picture is absolutely amazing. One thing that people must realize is that not all TV programming is filmed in HD. On a TV like this , the difference between the regular channels and the HD channels is huge. On the HD channels, the picture is excellent. We are very happy with this purchase and recommend it to anyone else.", "Date": "February 15, 2012"}, {"Title": "Best TV I've Ever Had", "Author": "MEL47", "ReviewID": "R1881R2L6IVMZ8", "Overall": "5.0", "Content": "I've been watching this TV for about 3 months now, and it absolutely meets my expectations, which were pretty high to begin with. The LED backlighting and color technologies produce really superior brightness and contrast, as well as a depth of field that I've never seen before. With certain source material, like blu-ray, it's as close to 3D as 2D can get. It took me about a month to get the picture where I wanted it, but I haven't touched it since then.Since I run all my source material and audio through an AV amp, I bought this TV for the picture quality only. I use only one HDMI input and none of the audio or WiFi-related features, so I can't comment on them. After some experimentation, I can't tell any difference between the 240 and 120 refresh rates, so I'm not sure it's worth the extra $100 or so for the 734 model vs the 733. Since I got the lowest price I've ever seen for the 734 here at Amazon, that doesn't bother me all that much. The only downside so far is that my wife and I have become even bigger couch potatoes than we were before. Oh, well...a small price to pay.", "Date": "April 14, 2012"}, {"Title": "Sharp 70-inch Aqous Quattron", "Author": "Thunder", "ReviewID": "R2OLXD03LOGSA6", "Overall": "5.0", "Content": "In a word, this TV is spectacular. The picture is so crisp, clear, and brilliant.  I couldn't wait to un-wrap it and watch an HD channel, I wasn't disappointed.  If you don't have a 70-inch screen or above, you have to know this is a life-style change.  The picture is huge and in your face (I'm sitting 11ft back), and extremely sharp.  Watching an HD channel is like looking out of your window, you would almost say the picture looks fake; but what you are seeing is such a clear defined picture it's amazing.  I put in the HD movie Avatar, Incredible!.  Make sure to use the 240mhz Fine Motion Enhanced.", "Date": "April 10, 2012"}, {"Title": "No real internet access, poor soft keyboard navigation", "Author": "Amazoner", "ReviewID": "RP6S3T0620ZAC", "Overall": "2.0", "Content": "I've bought this about a year ago from East Coast Electronics. The product is great except one major, big flaw.I'm not sure if this is made on purpose by Sharp or not, but you don't have real browser experience with this TV. Yes, you can connect it to your home internet via wireless, but you are limited by accessing only specific widgets which sharp offers, like MSNBC, weather channel, some sport channel and few applications like Netflix. If you want everything else beyond this you are stuck. There is no way to enter URL and navigate to the web site you want. Because of this I'm giving sharp 2 points. They misled customers about it's \"Internet Ready\" tv, and one discovers this only after it has bought it.", "Date": "January 25, 2013"}, {"Title": "AMAZING TV AND SUPER CUSTOMER SUPPORT", "Author": "Cajun Boy \"Cajun Boy\"", "ReviewID": "R1X27R4W3DXAUS", "Overall": "5.0", "Content": "FIRST, IT IS IMPORTANT TO SAY THAT THE SHARP CUSTOMER SUPPORT TEAM IS THE BEST I HAVE EVER DEALT WITH.  WE HAD AN ACCIDENT WITH OUR  TV SHORTLY AFTER WE GOT IT HOME AND COULDN'T BELIEVE HOW HELPFUL THE SHARP FOLKS WERE TO LEND SUPPORT.AS FOR THE TV ... IT IS SIMPLY AMAZING.  THE PICTURE IS BRIGHT, THE COLORS ARE THE BEST I HAVE EVER SEEN.  WHEN FOLKS SAY IT IS JAW DROPPING BEAUTIFUL, IT IS THE TRUTH.  I DID LOTS OF RESEARCH BEFORE I PURCHASED THIS TV AND COULDN'T BE HAPPIER WITH MY CHOICE.  I CANNOT UNDERSTAND WHY ANYONE WOULD RATE IT LESS THAN A 5 STAR.  WHILE WE HAVE HAD THE SET ONLY 2 MONTHS IT IS TOO EARLY TO KNOW HOW IT WILL PERFORM AS IT GETS OLDER,  BUT THAT IS TRUE WITH ANY PRODUCT.  AS FOR NOW,  ALL I CAN SAY IS \"WOW.. WE REALLY LOVE IT\"THE SHARP FOLKS HAVE REALLY COME UP WITH A GREAT PRODUCT.", "Date": "June 19, 2012"}, {"Title": "Excellent", "Author": "Tim", "ReviewID": "RRP5BVX0GO1O3", "Overall": "5.0", "Content": "The Sharp LC-70LE734U is an excellent TV. I'm very happy. I compared the different models and made the right choice. The 735 would have been the only upgrade but the 3-D option I didn't think I'd use much. The shipping was very convenient and professional. I was worried having such an expensive item shipped to my home but the shipping company had shock indicators attached which I activated after opening the package and was surprised how easily they activated. The picture is all I hoped for.", "Date": "April 9, 2012"}, {"Title": "WOW Factor on size, pictire just OK", "Author": "NH PLUMBERR", "ReviewID": "R3NIKL31H46M3F", "Overall": "4.0", "Content": "I must have read 200 reviews over the past few weeks regarding this and other 70 inch TV's. I purchased a Vizio 55 inch LED 480 HZ 3 D TV only 10 months ago but really wanted a BIG set. At first the absolute size is astounding and jaw dropping especially to short term visitors. But the more I watch this I realize that I traded size for quality. My 55 inch Vizio has a  much better picture at least to me. My wife does not notice any difference and thinks I am crazy. I will live with it but there is a difference in picture quality, not much, but it is there. Good thing I went for the 240 HZ or things might be worse. All in all, I won't be returning it but as the adage goes you get what you pay for. That is why the really good sets of this size are all 5 grand. Oh well, life and football go on.", "Date": "December 12, 2011"}, {"Title": "Great picture quality", "Author": "Jim K.", "ReviewID": "R3B03M14RVH62Z", "Overall": "5.0", "Content": "Great TV, excellent picture. I love the internet ready feature. I also hooked up Apple TV and it is wonderful .", "Date": "December 10, 2013"}, {"Title": "Great TV", "Author": "James Appel", "ReviewID": "R3C52QFS0DCH2V", "Overall": "5.0", "Content": "This was a great TV.  By \"was\", after a few months a line appeared across the TV.  Contacted Sharp, they advised the model was no longer available so they were going to upgrade a replacement.  Sent a current year 3D version.  Still going strong after 1.5 years with zero issues.  Helluva picture (never even use the 3D).", "Date": "April 8, 2013"}, {"Title": "Poor picture quality", "Author": "M. Wildy", "ReviewID": "R1SEAG4RR6TO13", "Overall": "1.0", "Content": "I bought this TV after seeing it in several stores. In the store the picture looked very good. When I got it home the picture quality was ok in HD, not great. In SD it was horrible. Luckily Amazon is terrific about their returns. I would NOT buy this TV. I bought a Samsung PN60E8000 plasma that was 100% a better TV for around the same price.", "Date": "March 27, 2013"}, {"Title": "Sharp TV", "Author": "Keith A. Shepherd", "ReviewID": "R3UX32ONKN992U", "Overall": "5.0", "Content": "This tv is now over a year old and we still get compliments on it. The Quattron system is amazing, so much clearer than a regular tv without it. A blu-ray will knock your socks off with it's absolutely beautiful lifelike picture. When they offer Quattron in a larger size than 70 we will get it. Haven't used the wireless functions so can't comment on that.", "Date": "March 10, 2013"}, {"Title": "Great TV for the price", "Author": "JB in Livingston,TX", "ReviewID": "R2X4DCYC3QY9XI", "Overall": "5.0", "Content": "I didn't buy this TV from Amazon but I still made a good deal.  I've had the TV since May and so far it's met all my needs and I can't wait for football season.  It has a crisp edge regarding the screen colors and the black to color or to white.  For a large screen I am very pleased with the color contrast.  I suggest that if you are going to get this TV, you need to have a large enough room so that you are sitting at least 15 feet from the screen.  My neighbor came over and saw the picture on my TV and said \"what can the technology geeks do next, this is perfect.  How can they improve on this\"?  If you have an extra $2400 or so to spend to upgrade and want BIG, this is the TV for you.", "Date": "August 8, 2012"}, {"Title": "Best TV I`ve ever had", "Author": "jcutright", "ReviewID": "R2PWBYMNKQKBV8", "Overall": "5.0", "Content": "This is the best and brightest and clearest TV I have ever brought. It is a little heavy though and you will need help to set it up and put the base on.  It takes at least two people to lift it without damaging it, although it is sturdy after you get the base on and sets very well on a stand or can be hung on the wall.  They have went down in price by now, but we are very pleased with this purchase.", "Date": "April 13, 2012"}, {"Title": "Impressive screen size, not picture", "Author": "Pizza Holiness", "ReviewID": "R1VOF2WN6YSCN0", "Overall": "3.0", "Content": "First- I understand how this works, stretch an image and stuff gets grainy.  If you have a room large enough, you will not sit close enough to notice this.  However, if you have a normal size room and sit less then 10 feet away from the TV, as I do, it was blurry.  I switched all the processors on and off.  I adjusted levels.  It got to be acceptable, but not amazing.  For the cost, you get a large picture.  Most people, especially those switching from older technology will be content.  However, if you have a high end 55\" in your bedroom, then you watch this TV, you will be wanting a clearer screen.  If you had a tube tv or 720p older plasma, this will blow your mind in clarity.  One amazing thing, everyone's jaw drops when they see it, and football is AMAZING!", "Date": "October 28, 2011"}, {"Title": "Love it!", "Author": "Sweetie", "ReviewID": "R3L1XPMZNQTQER", "Overall": "5.0", "Content": "This was our Christmas present.  We really like it.  The picture is great on movies and tv shows.  Pretty standard on news shows.  The size is wonderful.", "Date": "December 28, 2011"}, {"Title": "Would never buy it again", "Author": "Thoughtquifer \"Not Fooled\"", "ReviewID": "R2J3HEK1DEGUAZ", "Overall": "1.0", "Content": "Bought this tv--not from amazon.  The picture is nice, but really, on take two i'd do plasma.  and even with the 240 hz, it still has plenty of blur--again, i'd do plasma on the next one.  it has a wireless function.  this is actually cool, you can for instance stream netflix from your wireless--until Sharp, in its very, very finite wisdom, decides you must download an update that takes an hour to load before you can use that \"app\" again.  You can't use this \"app\" until you give up an hour of your life watching your tv try to swallow an update that is goodness knows how big.  and your tv is basically a worthless lump in the meantime. Can't watch cable, can't watch the VCR while it uploads. Seriously, this is the most stupid thing I have run across in a consumer electronic product in years and years.  Whoever at Sharp figured this out should be run over by a tank, shredded and then fed to livestock.  I would give this less than one star were it an option.  Hindsight being what it is, well, maybe you'll learn from my mistake.", "Date": "April 30, 2012"}, {"Title": "crappy picture, poor reliability", "Author": "Tyrion", "ReviewID": "R18NUOEXJG49PH", "Overall": "2.0", "Content": "First thing I noticed when I turned on this television was the color clipping that occured - particularly for red colors. There was basically no gradation in any part of the picture that was red colored. I tried adjusting all settings, but could not fix this.After three weeks, it became a moot point when an entire column of pixels became stuck - luckily I had bought the TV at Costco and they took it back no questions asked.I bought the LG 65\" and its got a MUCH nicer picture.", "Date": "November 6, 2011"}], "ProductInfo": {"Price": "$3,999.99", "Features": "Built-in Wi-Fi\nFull HD 1080p X-Gen LCD Panel\nUSB Viewer with Music Player\n240Hz Fine Motion Enhanced, Backlight System: Full Array LED\nDimensions With Stand - 38.78\" x 25.96\" x 11.61\" (W x H x D), Dimensions Without Stand - 38.78\" x 23.80\" x 3.46\" (W x H x D)", "Name": "Sharp LC-70LE734U 70-inch Internet Ready LED TV", "ImgURL": "http://ecx.images-amazon.com/images/I/31CukajqjiL.jpg", "ProductID": "B004OCW94A"}}