{"Reviews": [{"Title": "Great HDTV! Amazing Picture Quality. SONY does it Again.", "Author": "paper tiger \"Adriel August\"", "ReviewID": "R1HHLHNL2KXLT", "Overall": "5.0", "Content": "*** Before reading this review understand that watching a movie on a new TV right out of the box will not provide the best picture. I spent hours and hours perfecting the settings and features of this 3D HDTV before I even tried to watch something. This Sony 3D HDTV has a huge amount of options and when set just right, you will not believe your eyes.Pros:+ Amazing Picture Quality. Clean crisp images with amazing depth.+ Netflix, Amazon and other streaming programs launch and run easily.+ The Sony menu system while watching is great. Change options and features as you watch.+ Very beautiful TV. It is a work of art and even while off I can't stop looking at it.+ Built in WiFi+ Built in 3D TransmitterCons:- Sound is not the best. The speakers are mounted in the lower bottom of the set which is nice because they are hidden, however this greatly hinders the audio quality. This is not an issue to me though as I have never used a TV's built in speakers to watch a flick.- The TV itself is a little wobbly. The stand is quite simple and seems almost too light to hold the TV up. But this goes with the simple clean look of the new Sony HDTV's. I ended up mounting my TV to the wall and I think it looks great up there.- Not really much of a physical manual. It is actually on the TV in the menu. \"i-Manual\".I purchased the Sony KDL55HX729 55\" Class Widescreen 3D LED HDTV over the Sony BRAVIA EX 500 Series 55-Inch LCD TV, Black due to the built in WiFi and the built in 3D glasses transmitter. They are not too expensive purchase separately, however the less extra junk I have sitting around the better. I like that everything is built in and it was well worth the extra money.This is a great Sony 3D HDTV. I have seen Samsung 3D and Panasonic 3D and I would say this is just as good, if not better. I watched Resident Evil: Afterlife [Blu-ray 3D]in 3D the night I got it and I was blown away. But I honestly didn't buy this TV for the 3D. I was simply looking forward to an upgrade from my 6 year old 52\" SONY HDTV, which was great, however so much new technology has been released.My old Sony HDTV had a large frame with speakers in the front and a \"glass\" frame around it. It took up about 4 1/2 inches of space on each side, which was pretty, but very unnecessary. The KDL-55HX729 has a very simply clean design with hardly any frame and the speakers are hidden one the bottom/back. The screen is quite reflective, however this is not an issue while viewing. It simply makes it clearer while it is on and a little nicer to look at while it's off.One of the first things I watch was Life (narrated by David Attenborough) [Blu-ray]on Blu-ray. LIFE is an HD nature documentary type program. Watching this blew me away, especially while watching the close-ups of the little bugs and reptiles. The color and depth felt incredibly realistic and very true to how nature intended.One gripe I had as compared to my old LCD TV (non LED) is the LED lighting on this TV is much more noticeable. When the screen is black, I can see some very minor spotlighting or flash-lighting or whatever you want to call it. This is where the LED light is. Also when the screen has a large white moving object on it I can see thin hazy dark lines that I believe is the frame-work that holds rows of lights behind the screen. I noticed this while watching LIFE and there was an above shot of an iceberg and then the camera moved upward. While the camera was still I really couldn't see these lines in the screen, however when the camera shifted upward it was noticeable. So when the screen is still and white you really can't see the lines. However they popped out to me when there was large white movement with darker backgrounds surrounding it. This could just be me nitpicking, however I thought it was worth mentioning. It is nothing worth returning the TV over.Another small gripe is the sturdiness of the stand that upon this beautiful expensive TV sits. The TV pivots and turns, which is nice, however I think they would have been better off taking the flexibility away and simply making a strong sturdy stand. I would say mounting this TV to a strong wall or an equipped TV stand may be a better option if you are worried. But this TV is about 6 inches thinner than my last TV. I think I may just not be used to something so much smaller and less bulky.The Sony Xcross menu system is great as always. Internet programs and Netflix are great and fast. The movement of the menus, programs and simply turning on and off is very smooth and simple. The options are great. There are a few new options that I had to mess around with and test out, however the basic brightness and contrast are the same settings I had on my old Sony HDTV. There is a slight learning curve with an LED HDTV. The light is slightly different, and as a rule for me with TV's, I always lower the backlighting and up the brightness. Keeping the backlight down will increase the life of the TV, plus a backlight set too high will give washed out images. Simply up the brightness if you feel it is too dark.Due to the amazingly realistic picture quality I can over look some of the smaller issues with this TV. It is the closest to perfect I have ever seen. The design, PQ and features make this a piece of beautiful artwork that I am proud to display in my home. I highly recommend this series of Sony 3D HDTV's and look forward to this baby for years and years. Also I purchased a 4-year warrantee from SquareTrade for under $250. Well worth it for piece of mind.*** Update ***I have now owned this Sony HDTV for over a year now and I have run into some very minor slight issues. One issue was a dead pixel after 6-8 months of ownership, which does happen no matter who makes your HDTV. However Sony was great and came and replaced the panel right away. Another issue was that the TV would simply restart (turn off, then back on) from time to time. Again, it was very minor and it was only a few times. Sony troubleshoot'ed some common issue with me, I reset to factory defaults with no change, and then they came a replaced one of the small boards in the TV. This fixed the issue and I have not had any issues since. I still love this TV and highly recommend it.", "Date": "June 8, 2011"}, {"Title": "underrated", "Author": "Kevin K", "ReviewID": "R1ZJ5HBKJG91QE", "Overall": "5.0", "Content": "**Before you read this review please know I had no chance to test the 3D!  It was of little importance to me, and I didn't have glasses :(  **I was able to borrow 5 different 2011 LED televisions to do a comparison in home.  So this will be a review/comparison of the Sony and other sets.  Among the contenders was this Sony HX729, Sony NX720, Samsung D6400, LG LW5600 and Sharp LE835u.  Whew!  (i know)  After days of testing, tweaking, watching, my top pick was this Sony HX729.  A *very* close runner up was the Sony NX720 or Samsung.. but they just didn't have the black levels or response time to match the Sony.Highlights of this TV:Deep black levels (for LCD/LED)Fast pixel responseGreat motion handlingAlmost zero ghostinglow input lag (for gaming)Lowlights:speakers are pretty badContrast AND Brightness diminishes quickly when moving off-angle.  (LG was AWFUL in *dark* scenes when moving off angle.. had severe black washout.)Needs more fine-tune color calibration controls.Clouding (they ALL had some degree of clouding, more or less)Sony remote is just strangeThe clouding issue was pretty mild on both Sonys. (the Sharp was TERRIBLE).. but your milage may vary.If you plan to watch this TV from all different spots in a large room, you may want to steer clear due to viewing angle losses. I sit on my couch directly in front of the set 99% so its not a big factor for me.The Sony NX720 gets a lot of buzz on CNET and other sites, but I can assure you the HX729 set a better set.  The only thing the NX720 has over the HX729 is the \"monolithic design\" and slim/hidden connectors in the rear.  Please know the HX729 has antenna and component connectors facing directly rearward, making a flush wall-hang very difficult!  The Sony NX720 and Samsung are hidden/flush.  If you don't plan to hang your TV, its a non-issue.", "Date": "December 13, 2011"}, {"Title": "Awesome", "Author": "M. Haider \"AH\"", "ReviewID": "R1WADZ21KQNPP8", "Overall": "5.0", "Content": "WHY THIS MODEL:I bought this TV through Amazon last week and it arrived a few days ago. I've had a good amount of time to play with all its capabilities. The out of the box settings are not that good, so the settings do need some adjustment. This TV is an unbelievable deal coming from SONY as it has the EXACT same specifications as the more expensive HX820. The only difference is that the HX820 has monolithic gorilla glass design. I've compared this TV with both the EX720 and the HX820 and this TV delivers a picture almost identical to the HX820 for a much cheaper price than the HX820. The original listing price for the 46HX820 is $2,600 while my 46HX729 was originally listed for $1,900. Trust me, $700 more just for just the monolithic gorilla glass on the HX729 is not worth it. Don't by into the opti-contrast gimmick that Sony says monolithic gorilla glass provides, the HX729 creates black as black as the black frame. I was originally looking to buy the EX720, but after finding out that the panel frequency on that model is actually only 120hz, I settled on this model which is the cheapest SONY 3D TV with 240hz panel frequency. (The EX720 is motion-flow 240, however its actually frequency is only 120hz.) Specification wise, this TV is much better than the EX720 in multiple categories such that the Hz is twice as fast, it has X-reality PRO*(2 processing chips instead of 1), dynamic LED, local dimming, etc. It also the cheapest model to have wifi and the 3d transmitter built it. Surprisingly, it has a glossy display. I thought that this display was the same as the EX720 which is semi-matte but this TV definitely looks more glossy than semi-matte (That's a plus to me because matte can distort the sharpness a little bit) As far as LCD TV's I couldn't find any other LCD with 240hz panel frequency for this price that looked this good. I would say that this is the best quality/price ratio you will find.2D PICTURE:The 2d non-HD picture is actually pretty good on this TV. The problem with buying decently sized HD televisions is that they seem to stretch out and distort an SD(standard definition) signal. Surprisingly, the X-Reality Pro engine does a nice job tuning up an SD input. Of course, it doesn't make the picture look HD but makes it look better than many other HD TVs will make the SD picture look. As far as HD picture, my girlfriend and I cannot stop saying how incredible and real the picture looks. So far, I have tested BBC's Life series on here in 1080p and he scenes look unbelievably crystal clear with the most vivid colors on a TV I have ever seen. It literally gives a 3D effect without 3D. It looks so clear that it seems like we are actually there watching something through our binoculars. There is absolutely no ghosting effect or distortion whatsoever. The only bad thing I can say is that the picture is so clear that you can sometimes tell when the filmer did not have the camera completely in focus. As far as the motion flow 480, I watched one of the NBA finals game last night and there is no jitter, it is completely smooth. The only downside to using 480 Motionflow is that the back-light is dimmed. I find using the 240hz panel frequency know as the \"clear\" setting as opposed to \"clear pro\" setting is the best. I also was able to test out streaming HD content through Netflix. Although the picture was not as good as it was through the blu-ray player it was still pretty clear. But trust me, content through the blu-ray player doesn't even look like you're looking at a TV. The last thing I really like about this TV is how many settings there are for the picture, there must be at least 50 different settings categorized into about 15 groups. As far as the things I don't like(but don't really care about), is that I notice a very tiny amount of light on the bottom corners of the screen when the screen is black. When I say tiny amount I mean about a cm^2 of noticeably brighter back-light. It's no big deal though as when watching Life I only saw it every 2 hours or so for a split second. The other thing I didn't don't like is that the back light is a litter bit dim without adjustment. I turned up the white levels and turned on some setting when I got it and it looks fine now.3D PICTURE:After ordering a defective pair of glasses and replacing them, I finally got a chance to test out the 3d. Even the simulated 3d is amazing. The simulated (2d to 3d conversion) doesn't pop out at you dramatically, but it adds so much depth to the picture. It looks as if you where looking into a window and watching what was going on inside. The real 3d content is identical to the experience you would have in a theater. The 480hz motion flow and the panel frequency of 240hz makes the 3d nearly flawless. Very rarely you will see a double image but that can be fixed by turning down the glasses brightness setting.GAMING:I used to play video games a lot when I was younger but slowly stopped playing as I got older. Nonetheless, when I got this TV i decided to whip out the xbox. Ever since, I've been playing a few hours a week. This TV is amazing for gaming. It has a game mode that you can put it on, by doing so you can select if you want quality or speed. The speed setting greatly reduces input lag to a point where it seems like there is none. The quality setting helps with motion blur.Content:This TV is loaded with content. Amazon and Netflix have content in HD. The only downside is that this TV does not have VUDU. However, you can always buy a blu-ray player that comes with Vudu.Design:I was having second thoughts after I had ordered this 46 inch TV. I was honestly thinking 46 inches would be too small. However, I found out that a 46 inch TV looks remarkably smaller in a store than it will in your home. While unpacking this TV I thought they had sent me the 55inch TV by accident. This 46inch TV in you're home will look like a 55inch TV looks in a store. Unless you're watching your TV from 20 feet away, you really don't need a 55 inch TV. A 55 inch TV will look tacky and overpowering if you don't have the room. I also really like the thinness and small frame size, it's very compact. The screen finish is very nice as well. When I had ordered this TV I was having second thought about getting a semi-matte or matte screen since it can distort the sharpness of the picture. However, this TV didn't turn out to be matte or semi-matte at all. Maybe I don't know what semi-matte is, but I can definitely see clear undistorted reflections of my room and myself when the TV is off. This TV just looks expensive.Sound:The sound is not the best. It's not bad but it's just average. You can hear everything very clearly with no distortion, however, it won't provide the sound dimensions that external speakers will.Overall:As I stated, this TV is the best quality/price LCD you will probably find. It is the cheapest Sony TV that provides the panel frequency of 240Hz and X-Reality Pro engine that the flagship HX929 provides. It is also the exact same spec-wise as the HX820 but for a price closer to the lower end models; NX, EX, etc. Disregarding the great specifications, this TV will bring an amazingly real picture to your living room.", "Date": "November 16, 2011"}, {"Title": "Excellent Value", "Author": "D. Reinsel \"WorkAtHomeDave\"", "ReviewID": "REXY53KZQF9DN", "Overall": "5.0", "Content": "Why spend double for the Sony top of the line, XBR?  This television is fantastic.  Everything works perfect, it looks great. Sound is so-so, but it is hooked up to a home theater system, so that's no big deal.This is a great tv.", "Date": "September 17, 2011"}, {"Title": "A few  months later/ a year later/ new sat service", "Author": "Paul Bonaddio \"PrB\"", "ReviewID": "R28XVC956877TV", "Overall": "5.0", "Content": "I have had the HX55 729 for almost 3 months now.  I paid almost $300.00 more then it is now and have no regrets. In the past year I have had a LG 55\" nano, Samsung 59\" D6500 Plasma and now the Sony HX 72 series.  These TV's replaced my Hitachi 701 plasma-which I loved.  Out of the 3 listed above, I think the LG had the BEST picture quality ( full led backlight with dimming and NANO tech). I had so sadly! return it because it arrived damaged, a warped frame, and a replacement was not available, so so sad!!! The Samsung plasma was good but it never got bright, whites were grey and it never delivered the \" pop \" we all seek.  After hours upon hours of research and limited online reviews, I took a leap of faith and picked the Sony.  It's an upper tier like, just like the HX820 but without the flush glass on the front. The 820 was hundreds more for IMO for just aesthetics.  The 729 is great!  Yes it took some time to get the picture just right because out of box was really bad and made me have second thoughts.  After calibration, it's better then the Samsung and about 95% of the LG NANO.  I have no LED bleed from the edges and only the slightest blotch-clouding on sky blue, solid colors in the upper left hand side that is not noticeable in almost all I'm watching.  I am overall happy with my choice of the 55\" HX729.  I only wish Sony made a 60\" version of this model, the next one up in the 729 line is the 65\" and was thousands more. I have a pic I took showing the blacklevel of this LED LCD tv, but having trouble uploading- I will keep trying though!Please feel free to contact me with questions.UPDATE: 8/30/12After just about a year I'm still in love with this HDTV.  Sony puts out updates every 2 months and the TV takes care of the rest.  I think the updates are about the online content as nothing really much changes that I can see.I have never had even 1 slightest issue with the HX 729.  I have a perfect LCD panel, no light bleed even in the high contrast image-where there's both the blackest black and bright white together.  I'm highly impressed with this TV and would buy again without a  second thought.  I only wish it was bigger! I will upload more pics showing this TV and the high contrast/ deep blacks it can produce when fed a quality signal.  Sony is putting out new versions of the high end 9 series this month previewing in Germany in a few days, let's see what Sony comes up with next.  I sure hope their quality remains as I will buy a new one in the next few months and put this wonderful monster in by bedroom.Update: 11/8/12I got DTV installed last week.  I had Dish for years.  OMG! there's a huge difference with DTV HD channels on the TV.  The clarity is absolutely astonishing.  I really thought the Sony shined before, but with this new service it's even better then I ever expected.  The only change to my equipment was the DTV's newest receiver/DVR.  All the same HDMI cables are being used.  I'm not endorsing DTV over Dish but I can't help to comment on such a huge difference.  Before you ask, It was the 622 VIP on dish with the latest updates installed.", "Date": "December 7, 2011"}, {"Title": "Great tv for the price", "Author": "H. Le", "ReviewID": "R3B9OGCA2BV2Y8", "Overall": "5.0", "Content": "I bought the Samsung PN59D8000 a few weeks ago from Amazon.com, and while I was pleased with the picture, it had some horrible buzzing issues and I returned it. Since that tv was supposed to be the best plasma Samsung had to offer, it was quite disappointing. I decided to get the Sony KDL 55 inch HX729 LED instead.  I am very happy with the tv (i had previously owned a sony lcd tv), especially the image quality when watching blu ray movies.  Regular over the air hdtv is fine, ps3 video games look great.  240hz definitely is a noticeable improvement.  TV has bravia sync, so it easily synchronized with my sony surround sound system.  Plenty of inputs.  Great styling.  Lots of customization options.  Built in wifi. I am not too impressed by the online widgets, but have no need for them either. The only other disappointment is the cheap remote control (not even backlit).  There is always a higher price to pay for Sony products, but if you dont want to gamble with quality issues with cheaper tvs, Sony is your best option.  I debated between this and the Sony NX720, which are priced comparibly.  the NX720 has \"monolith\" bezel styling, but I went with the HX729 for the 240hz. Finally got the 3d glasses yesterday, and watched some 3d clips from the free 3d sony experience widget.  Wow, it was fantastic.  Had no issues with blur or crosstalk.  Also played Wipeout HD in 3d on the PS3 and had no issues.", "Date": "February 10, 2012"}, {"Title": "Best TV, ever!", "Author": "Alessandro", "ReviewID": "RMD2D002GZ4EN", "Overall": "5.0", "Content": "This is one incredible TV!  It sets up easily, has a flawless picture, and has tons of incredible features.  You can't go wrong with this one!", "Date": "December 4, 2011"}, {"Title": "Amazing picture from an amazing TV!  Sony does it best!", "Author": "Trevor Mankus", "ReviewID": "R1NICTK5H265LM", "Overall": "5.0", "Content": "I bought this TV in November 2011 and cannot think of anything negative to say about it!  I picked it up for around $1,850 (it is cheaper now!) and got a great deal.I have the TV wall mounted in my basement with a Samsung 5.1 surround sound system installed.  My basement is often referred to as a theatre room from friends and family due to the size and quality of this TV.The picture is bright and colourful.  I followed another reviewers advice and turned off the Sony system setting of ambient lighting.  This made the picture pop a bit more.  I watched playoff NHL hockey and NFL football on this TV and both are AMAZING.I can't comment too much on the TV sound output as I stated previously I am using an external Surround Sound system.  I also cannot comment on the stand it comes with as I have a wall mounted solution in use.I love Sony's menu system - it allows you to still watch TV while changing options and features.  I also love the built in WiFi - since I purchased the TV I have downloaded 2-3 system updates via WiFi and it makes me feel good knowing it has the latest and greatest firmware.I have not yet viewed a true \"3D\" blu-ray movie yet, but plan to in the near future.  The simulated 3D move doesn't seem to be anything out of the ordinary, but this seems to be the general consensus on Google.  Simulated 3D mode is not worth it - you want true 3D (blu-ray and all).", "Date": "July 19, 2012"}, {"Title": "Simply Sony", "Author": "Neel Joshi \"nsnfo\"", "ReviewID": "R20IF8D49AO7K6", "Overall": "5.0", "Content": "I shopeed for a flat screen at some of the local stores. Settled on this product after visiting the Sony Store. Would have bought it from the store however were out of it. @Best Buy was told to get a Samsung. Looked good but not compared to Sony.", "Date": "June 18, 2012"}, {"Title": "Amazing picture quality and reasonable sound for an appartment", "Author": "Eclipse", "ReviewID": "RWZO7WL6NFEF3", "Overall": "5.0", "Content": "I have been using this LCD in every aspect including PS3, HD channels, regular channels and blue ray. It really has an amazing picture quality. There are few comments on its sound that its not up to the mark. If you are living in an appartment, for me, its more than enough.We have to understand, that you cannot get the crunch of home theater from LCD speakers.", "Date": "June 17, 2012"}, {"Title": "Amazing Picture Quality and Features! Speakers could be Better.", "Author": "Deon \"Tech Junkie\"", "ReviewID": "RSKPZ8YA1K36R", "Overall": "4.0", "Content": "Pros- Incredible picture and great flexibility in user controls (Recommended for advanced users only).- Black levels are very good due to local dimming feature which can turn off the LEDs in certain regions of the screen as needed. When \"they\" say off, \"they\" mean off. With better black levels, colors pop and images appear to be sharper.- Buil-in WiFi is an absolute Plus. Nothing worse than having to run ethernet cables all over the living room- Built-in features such as Pandora, Netflix, Hulu Plus, Amazon VOD, etc. Also supports skype with an optional camera attachment for the television.- DLNA compatible. I can now wirelessly stream content from ny DLNA compatible device on my home network to the television. Sony has even created an Android application (Sony Media Remote), which allows you to use your Android phone as a remote control for the set. You can browse the different video services (not Netflix or Amazon VOD), and the TV automatically starts to stream once a selection is made. You can also wirelessly stream video files and pictures from your Android DLNA device directly to the set. Very cool at parties.- Support for 3D content. Even though I don't plan on ever using it, it's good to know that the feature is already there.Cons- Loudness of on-board speakers. The built-in speakers are pretty disappointing. On my KDL-32EX503 television that's in the living room, I can easily hear audio with volume set to Level 20. With this television, the audio can easily be at 40, and I'll still struggle to hear certain things in a slightly noisy environment. This probably has a lot to do with how slim the televisions are being made now. There's just not enough room for a large enough transducer to carry the audio users would need. So, if you live in a Metropolitan area, be prepared to hook up to a surround system or a sound bar if you want to hear the game over sirens and loud pedestrians.SummaryGreat purchase! Not a single regret since I've purchased this television. If you are in the market for one, I highly recommend this tv.", "Date": "May 7, 2012"}, {"Title": "Very nice TV.", "Author": "J. Stafiej", "ReviewID": "R1E37AAK0MMVAU", "Overall": "5.0", "Content": "I've had the TV for about a month.  I still need to take the time to tweak the colors and adjust for the \"soap opera\" effect I've read about but I'm very happy with the TV.  The main reason I wanted a TV was to switch from LCD to LED to reduce the heat.  This TV seemed like a great value.  Being 3D and a smart TV was an added bonus.  I also like it doesn't have the glass front.  The glass fronts I saw at Best Buy had a horrible glare to them, I don't know why someone would want that.  Also it works well with my Sony bluray player and receiver.", "Date": "April 23, 2012"}, {"Title": "Phenomenol TV", "Author": "Jo Jo", "ReviewID": "R378PMX3YVNOHW", "Overall": "5.0", "Content": "This is a fantastic TV at a reasonable price.  The only disappointment, is that it is not capable of accessing the internet for browsing.  This feature was not clear to me until I received the product and contacted Sony...not a big deal though.  The color quality is amazing and even the sound from the TV (on console) sounds better than most.  We also purchased a surround sound set and now the sound is outrageous!", "Date": "March 18, 2012"}, {"Title": "Gift to self", "Author": "Slammer13", "ReviewID": "R2Q6A5OFKBPRLJ", "Overall": "4.0", "Content": "I have done much research on 3D Televisions and I knew I wanted to get a Sony Bravia. Great High Definition picture and when broadcasting 3D breath taking. Clarity and color top shelf. I love the Smart features that allow you access to many Internet based options. I love my gift to myself.", "Date": "January 11, 2012"}, {"Title": "Close to Perfect", "Author": "L. Frakes \"lfrakes\"", "ReviewID": "R3203OPCX2GS8", "Overall": "5.0", "Content": "We shopped this TV hard, and had placed an order with a company in northern NJ based on their price and quick delivery. Three weeks later we were still waiting and the company was being less than honest with us. They had offered COD which I readily accepted since I didn't know much about this company. When I called to cancel the order, they complained about COD orders, and I asked them if my TV would have arrived if they had my money in hand.  I then checked on Amazon, and found their price even better. Standard delivery was great and we received the TV earlier than expected.We are very happy with every aspect of this TV from setup, connection to wireless router, and beautiful picture (ok, not so happy with the sound, but we expected that and bought a Sony home theater system which works great.", "Date": "August 8, 2011"}, {"Title": "Awesome picture quality", "Author": "Manindra Kumar", "ReviewID": "RDSDTNNSLXP18", "Overall": "4.0", "Content": "Its been almost 2yrs since I bought this & whenever I see its vibrant colors, I fall in love again... Though sometime the smart TV crashes & Sony needs to fix it..", "Date": "November 1, 2013"}, {"Title": "too much goodness", "Author": "Steve Yang", "ReviewID": "R32BURI6S5EO2M", "Overall": "4.0", "Content": "this tv does everything i need it to do.  i got a good deal on it but think i couldve saved a few hundred dollars by going with a cheaper model.  i tried selling it at one point but couldnt let it go.", "Date": "May 15, 2013"}, {"Title": "SHEER PLEASURE", "Author": "tomboy", "ReviewID": "RM6S0DAY2G6MX", "Overall": "5.0", "Content": "If you're interested in a lot of tech talk then read another review. We are not tech types, just ordinary citizens who wanted a TV with a terrific picture, was user friendly, had readily available and knowledgeable support people and internet so we could stream movies.  This one does all that and we are delighted.  We upgraded from a Visio and it's worth every penny.", "Date": "February 10, 2013"}, {"Title": "great tv", "Author": "Angelo D'Errico", "ReviewID": "R1KONIC1RAMXTO", "Overall": "5.0", "Content": "Bought it from Tiger Direct through amazon it arrived shortly right to my front door,free of charge,great picture,great looking tv.Fantastic Price even for today", "Date": "January 23, 2013"}, {"Title": "Can't happier with this purchase", "Author": "vichsu", "ReviewID": "R3H0FH9QG6NBJD", "Overall": "5.0", "Content": "Got this as I was upgrading from my Sony first generation HDTV (57'). Read reviews from many places about LCD TVs and finally I chose to buy this one.I am glad I did.. Many people overlook a fact that technical aspect of a product is just a piece of entire user experience. It is about a balance. While other brands such as Samsung offers TV better prices with equivalent specs, Sony made a product that is piece of a balance. I am a gamer and movie fan. I value TV based on these aspects.Pros:Great picture quality, although color may not be as natural as you wish right out of box but it is more than adequate and you can adjust settings easily.Fast response rate as I have not noticed any ghost issue with my fast action video games on PS3 or Xbox360.Video scaling is quite impressive, I am very impressed with just regular DVD video with this TV.Easy and intuitive to navigate through on-screen menu, plus response of actions is satisfactory(e.g change Channel/Input).Good number of IO ports with optical audio out.TV stands allows swivel so you can turn its panel left or right.Cons:Remote control, I did not like Sony's remote control layout, but I hate Samsung's and others even more.Speakers are weak, however, I don't expect on LCD flat panel TV can offer strong audio output. Good thing is I do find the sound is quite clear and works for most regular TV use cases(unless you want cinematic audio experience all the time) . BTW, I do not rely on that at all when I've got my full duty audio system.", "Date": "December 10, 2012"}, {"Title": "Waited for my first Flat screen and it was worth it!", "Author": "Beastwhite", "ReviewID": "R1KW2I4JWEWYJN", "Overall": "5.0", "Content": "I debated which brand and model LCD TV I wanted to buy.  I knew what features I wanted but didn't want to pay the outragous price to get them.  I narrowed my selection down to Samsung, Sony and LG.  I wanted the 240hz refresh rate and some sort of edge lit with dimming feature.  After months of shopping and watching the prices I finally pulled the trigger and bought the Sony.  I have owned a Sony rear projection TV for some time and live with the poor resolution.  I have got to say the Sony KDL-55HX729 was a great decision.  The picture is clear with nice dark blacks and no noticable bleed through.  The 240hs refresh rates makes watching NASCAR and other sports easy on the eyes.  I think Sony cut back on some of the features and quality on the newer version, that is why I went with this model.Installation was easy!  All the connections I needed were on the back panel.  I even found the sound quality acceptable for most TV watching, although I prefer to use my stereo with the digital optical connection.  I also have a Sony BD player that works seemlessly with my TV.  I can use the same remote for both and the TV switches inputs when the BD player is turned on.I am a pretty particular about my picture quality and I found the Sony to give me exactly the kind of performance I was expecting.  I did not even see a need to mess with the calibration.  Maybe going from poor resolution to something light years better, I am still overwhelmed.  If you are like me and looking to upgrade to this TV is a great choice.Still a bit pricey for just watching TV.", "Date": "October 8, 2012"}, {"Title": "Very satisfied", "Author": "Pete P. Villanueva", "ReviewID": "RS3RH211E1QYO", "Overall": "5.0", "Content": "The product is super good. I am very satisfied. It is what I expected. I have been a Sony product user for the last 30 years. Sony products are very reliable especially when it comes to TV.", "Date": "September 7, 2012"}, {"Title": "great tv", "Author": "Allan Trzcinski", "ReviewID": "R2JZUN04M0HF5C", "Overall": "5.0", "Content": "Am buying alot of 3d blu ray movies and 3d games now because of this tv, as always some of the scenes look great  in 3d but other times it doesn't even seem like you're watching a 3d movie that's not the tv but the movie, but overall it's great to watch movies and to play games in 3d, and yes the tv is great for me, I've had no problems with it and the picture is way better and brighter than my 73 inch tv", "Date": "August 21, 2012"}, {"Title": "Outrageous", "Author": "Ronald L. Esarey", "ReviewID": "R2QARIJ0L6C4IH", "Overall": "5.0", "Content": "I had a 4 year old Sony projection tv 55 inch Bravia.After 4 lamps and 2 light engines the warranty place I had,told me to go down to the store and get a new tv.I could of had the EX500 straight up deal,meaning me paying no money.I noticed motion flow problems with that right away.I never had an LCD HD tv yet,got an LG plasma,so right away Im asking what they have in a plasma.He has a floor model of a Panasonic(GT30) got there,that has all the features this 729 has,Consumer Reports rated it very well along with the other models.I pay like 250.00 difference and get it.Not knowing its coming without a book,and none of the extras,like a thing to make the internet work and hook components jack in.Then I notice during a white or bright picture(that was VERY NICE) it had an imagine burn.So I called them and told them I did not want this tv,I really liked it too,though it did get really warm after play,the guys that picked it up noticed it. Then they bring this SONY 729,I made a deal on the phone for it was all they had in a box,that was comparable to what I had,at that time.WOW what a picture if that Panasonic was a 10 then this was an 11!! I sold video products since 84,so I do know what Im looking for and this is it.The sound is average,what I expected,but all that internet stuff was too cool and hooked the whole thing up,kept it at factory settings except I changed the picture mode to VIVID,and make sure the energy saver button is off.No back lighting problems I can see.This took about 10 minutes without the book.Though there is one and one built in the tv.I have my 3-D glasses on ordered from here,I got the 250 model ones.Two pair were 105.00.Back to the picture,the black as as black as can be!! There is no motion flow problem,like with the EX500.Best I can sum it up,its the best tv in every way I have ever owned,and I have had some nice ones.HIGHLY recommend it!! Edit I did get my 3-D glasses and the 3-D is really cool.Consumer reports rated this 729 number 5 on the latter(under 3-D tv's),the 929 was rated one.Looks good in standard too,looks like some type of upscaling is going on,they never looked so good!", "Date": "March 29, 2012"}, {"Title": "Best TV I've ever owned.. and I've owned a few!", "Author": "HaileSelassie", "ReviewID": "R20K7ISSXMP93N", "Overall": "5.0", "Content": "This TV completely exceeds any expectations I ever had for a TV. I got this TV for an amazing price during Black Friday... basically half price... $1300 off regular price.The Sony Smart features are spectacular. If you've used a Playstation 3, the interface is almost exactly the same. It really feels like I'm using a \"device\" rather than a TV with a bunch of apps. It's even got a full web browser (just wish there was Flash support so I could stream online TV episodes through the browser).You can stream from networked devices that have media servers (ie Windows media player, Itunes, etc). You have access to Netflix, Amazon Prime/OnDemand, Sony On-Demand, Crackle, Hulu, Youtube...and a bunch of other streaming media. By downloading and small app to my computer... I can even use my little Netbook as a full keyboard for my TV... WOW!The 3D is great! I've watched several 3D movies and all were just like watching a movie in the Theater. I play 3D games on my Playstation and other than the problems that come with 3D text rendering weirdly... it's loads of fun!Lastly, it's a Sony... with my PlayStation and Bravia sound system... I ended up getting a bluetooth Sony Universal remote so I could control everything... Awesome! I love this TV! No doubt you will too!!", "Date": "March 21, 2012"}, {"Title": "one of the best i have this is", "Author": "rich", "ReviewID": "RIUNTICLJQMLF", "Overall": "5.0", "Content": "this is one of the nicest TV e have i gave this one to my brother after he fell in love with mine mine is the 52 inch and i think this is a better modelbut its still a Sony i like that", "Date": "March 11, 2012"}, {"Title": "Stunning Picture", "Author": "lonestar", "ReviewID": "R31NBHACQAX4ME", "Overall": "5.0", "Content": "I was amazed after seeing the picture, Black is BLACK and the color palate for all the others is stunning..Bought this on Black friday (1am) and got one hell of a deal. I had been looking at a 3D Vizio 55\" for months hoping it would hit the $1200 range. Was stunned to get another Bravia for that price. I bought the 3D as I suspect it will be the next coming thing, was happy to pay extra for this model although it was not all that much. Hoping that more shows will come out soon in 3D over Direct TV..I have owned  Bravia Products for several years and have found them to be quality products. So this was a very pleasant surprise.As for the 3D have only watched a couple of shows on it finally Got the latest Pirates of the Carribe in blu-ray 3D it was great.Was not able to initially hook up to the wireless Internet from the TV, however the Sony 3D Blu-ray home theater I got on sale (also on black friday @ 3am saved about $600 on it) did in a heart beat, so no worries. Get streaming Netflix and I suspect others but have not had time to play with them..Mounting it was a breeze on a full motion bracket once I got the bracket mounted on the wall.The plug and play of it all was easy to set up,  I STRONGLY recommend the HDMI cables that Amazon branded and sells as they as great and 1/3 the price of the other store named units..I got the free shipping and received the unit a couple of days before I thought it would get here..frankly getting rid of the boxes for the TV and  home theater was a pain..  Not something I wanted at the curb to advertise to thieves come get me. Had to cut them up into small pieces to get them inside the recycle tubs took three weeks to get them all gone..", "Date": "March 2, 2012"}, {"Title": "great Tv", "Author": "ldbbeck", "ReviewID": "R2N5VMZFIVCAET", "Overall": "5.0", "Content": "Comes in great with direct tv or my local hd antenna. I have mine on a stand with all of the component hook ups on the far right side of tv it makes it harder to hide to wires from sight. They must do this to make wall hang up easier. The stand for tv could be more sturdy.", "Date": "February 6, 2012"}, {"Title": "Sony In denial-Not ready for 3D", "Author": "Outdoor Bob \"Live the Wild Life\"", "ReviewID": "R4PLO6MQW9DHP", "Overall": "3.0", "Content": "For the last year I have been fighting with Sony about the prevalent ghosting (crosstalk)and even though they have replace (currently with a KDL55HX729) and repaired my TV I still have crosstalk.  It is really evident in the show stopper moments in 3D such as in Despicable Me where the pink ticket floats out of his pocket when he is in space and comes toward you.  How disappointing. For those of you that say you do not have a crosstalk-please tell us what you did to get rid of it! If I were to do it all I would have not have spent the extra money on the 3D and got a larger screen.  The Picture on this and the other Sony KDL 55HX800 was/is flawless!  And there service is very good.  They just need to accept defeat and go back to the drawing boards and redesign a better technology and stop pandering the customer.  Tell them the technology has some crosstalk issues and it doesn't work and be done with it!  Wish I would have waited.", "Date": "January 3, 2012"}, {"Title": "great product and service", "Author": "Bao Q. Tran", "ReviewID": "R3E4D2DPA36X1Q", "Overall": "5.0", "Content": "great product more than happy with quality of picture and 3D picture.It is Sonny quality , true color on black and on human skin color , others could not match on this factor.Wireless internet is a little bit low in bandwidth but overall excellent tv for the price.", "Date": "December 27, 2011"}, {"Title": "Sony LED TV - Amazing", "Author": "V. Kalkunda", "ReviewID": "RDNA960DF93HA", "Overall": "5.0", "Content": "This TV is amazing and perfect and would recommend that same brand to everybody. It was also available for a great price and within my budget. Tiger Direct was very professional and shipped the product as they promised on time. The product was also delivered on time and in perfect condition. We were able to easily unbox and install the TV. The logistics company was very helpful in agreeing for a convenient time for delivery, which worked very well for me since the delivery date was a working day.Great seller and an even greater TV", "Date": "December 25, 2011"}, {"Title": "Fantastic TV", "Author": "Aaron Dwoskin", "ReviewID": "R2ZF3F5VQHL3RU", "Overall": "5.0", "Content": "I actually bought a Samsung 55 inch smart TV and wasn't impressed. This Sony was cheaper and seemed to have the same amount of features. This TV has not disappointed and has actually impressed me beyond belief! Picture is amazing, as a newer HDTV should be. The screen does reflect light, so placement in front of a bank of windows would not be ideal, but should not be an issue in the correct setting. As an added bonus, this TV is supported with the Sony iphone/ipad remote application, which opens the TV up to web browsing, youtube videos, amazon videos, etc...  with ease. I am very happy with this TV and would buy again!", "Date": "October 22, 2012"}, {"Title": "Missing parts from factory sealed TV.", "Author": "Amazon Customer", "ReviewID": "R3PGCX1Q5VQJHC", "Overall": "1.0", "Content": "My Sony HX729 55 in TV was delivered today in a factory sealed box and was missing the neck, screws and hex wrench needed to attach to the stand. What kind of QA/QC was going on that it could be sent without those key parts? Sony was polite but could only offer to send the parts in 2-3 weeks. 2-3 WEEKS??? Are you kidding me? Sony was unwilling/unable to even try to expedite the order. Sony...if you are reading this, you made a mistake on packaging, but by not doing your best to make ammends, you are losing a customer. Potential buyers, beware!", "Date": "February 2, 2012"}, {"Title": "I think mine is defective", "Author": "Sci-Fi Fan", "ReviewID": "R39L6IG4ZBZVGE", "Overall": "1.0", "Content": "The TV is great but DVD upscaling does not work. I have tried it with two different Blu Ray players and my Xbox 360.  I have tried it through my A/V receiver and with direct hook into the tv.  It seems that the TV will only accept the 1080p signal from the BD player. When I try to change the scaling to anything other than 1080p I get a black screen.SONY customer service SUCKS!!!!!! 4 hours of 2 online chats. They said to call the repair line for in home service-- a number that doesn't work, it rings with a repeated message.  The next tech place was a 2 week repair. So, Best Buy is replacing the unit since its within 30 days. Hopefully I can revise this rating with a new unit.", "Date": "October 7, 2011"}, {"Title": "Problems with Sony", "Author": "R E Nelson \"rolnel2\"", "ReviewID": "RQ42T7XITW0U9", "Overall": "1.0", "Content": "Please note, this  review has more to do with Sony  and its  policies than the TV itself.  We ordered this model from an Amazon vendor (out of state for us) and it was shipped within a day.  There were problems with the shipping company(it was tracked as arriving in our city a full five days before it was delivered; and delivery was made only because I was complaining), but it was delivered and we set it up.  It worked perfectly--for a day.  Then we noticed a stead stream of \"snow\" visible in HD in all the black color areas.  I would have called the dealer, had we purchased  it where we lived.  Instead, I called Sony, who sent a technician who immediately said it was the front panel and further told me it was a manufacturing problem, not a shipment problem.  Sony  wanted to repair the tv--after having it for only 2 days when the problem occurred.  I was concerned that there might be other manufacturing problems and wanted them to replace the tv with a new one.  They declined (more like refused) and said they would only honor the warranty.  I packed the tv up and returned it to the dealer I bought it from for a full credit and went out locally and bought a replacement.  Overall, not a good experience.  And the fact that I have been a long-term Sony customer (I purchased Sony TV's in 1974, 1978, 1989, and 2006 and was happy with all of them) and was denied the remedy I thought fair didn't sit well with me.  The one day the TV worked, it was fine, but I was disappointed in the purchase and in Sony's response.  Major purchases like this, made long distance via the Internet, may not be the best.", "Date": "October 5, 2011"}, {"Title": "Not good...", "Author": "Ir bass", "ReviewID": "R3MEFQXE4CO3JE", "Overall": "1.0", "Content": "I got mine and i'm not impressive with this tv, i have a samsung 32\" that i got it in 2007 has a better quality picture than this sony.It looks like a old tv quality, and i have time warner cable with good quality channels, and it's not good, with HD channels it get better but i can see lags.I don't know what's is going on with sony , but they are not doing good anymore like before.This tv has price , but quality is not good.I should get the samsung LED but i got sony and now i'm stuck with this tv.I saw a lot good reviews, but mine tv doen't work like that.I have KDL55HX729.I don't like to do reviews like that , but i spend too much moneyon this tv, and it is not worth.Look for another tv.", "Date": "November 18, 2011"}], "ProductInfo": {"Price": "$2,487.00", "Features": "Remote Control (RM-YD061)\nAC Power Cord\nTable Top Stand", "Name": "Sony Bravia KDL-55HX729 55-Inch 1080p 3D LED HDTV with Built-In Wi-Fi", "ImgURL": "http://ecx.images-amazon.com/images/I/51LA2ueMAVL._SY300_.jpg", "ProductID": "B004QXHF4G"}}