{"Reviews": [{"Title": "spectacular!", "Author": "Ogen Perry", "ReviewID": "R1196KEZNLQIH8", "Overall": "5.0", "Content": "I was a bit worried because I had not found one of these TVs at any local retailer.  But judging by the specs, I knew it was the one I wanted so I took a chance.Well, it's been here two days and I am just awed.  I mounted it on the wall with a new flat mounting system which I also bought to replace the previous one I had.  The depth from the wall to the front of the TV, including the bracket and the spacers is one inch!  When off, the TV looks like a piece of art.  completely black, with an extremely narrow frame around the actual display.Installation, both the physical aspect as well as the connections and software, was all very straightforward.  I've been able to test several of the internet apps (Pandora, Yahoo widgets) everything is intuitive and beautiful.  Have not yet tried streaming movies but did log in to the various services and confirmed the ability to browse the libraries.I had DVR'ed several episodes of \"Human Planet\" in HD and was saving them so this TV could do them justice.  It certainly does.  the colors and resolution are great.  There are some fairly advanced capabilities for tuning the color, contrast etc... as well as several presets for different types of contents such as movies, sports, etc...  If you don't find the picture pleasing, check if you are in the wrong preset.I had assumed that the sound from a TV this narrow would not be its strong suit.  I was wrong.  Of course I use external speakers but when testing Pandora, it was easier to let it play through the internal speakers.  I was in for a very pleasant surprise.The only aspect which is less than perfect is the picture through the VGA port.  I have a laptop connected to the TV using a very long VGA cable.  The resolution in that mode is not great.  However, it may have do do with the length of the cable.  Ultimately, I plan to replace the laptop with one that is HDMI capable.  In any case, with all the apps that come on this TV there is no longer much reason to connect it to a computer.I will write more after I have used it for a few daysA couple of thoughts:To really do this justice, you should mount it using the slimmest wall bracket you can find.  I purchased the Monster Flatscreen mount which is less than 0.5 inch deep.  Whether you use that one or another one I highly recommend a flat mount rather than a tilt mount.  Remember that the space between the TV and the wall is tiny.  Since the TV itself is huge, you will want to plan the wiring carefully.  I had to buy a longer HDMI cable just to reach the plug.", "Date": "September 28, 2011"}, {"Title": "Very Happy with my purchase!  I'll tell you why.", "Author": "CorpusJ", "ReviewID": "R3EOS56ZBNVEHT", "Overall": "5.0", "Content": "First off, I think Meg1st either does not know how to setup an LED TV or is simply ignorant to how to manage large TVs.This TV is really an awesome TV.  It is easily as good of a picture as the 52\" Samsung 120Hz LCD and the 55\" LED Samsung 240Hz I own.The only 2 issues you will hear from anyone are below:1. Clouding while showing dark screens2. The stand feeling flimsyFirst, Clouding. This problem only occures when you are switching from a scene mode (Theater 1, Theater 2) to Game or PC mode.  During movies or TV and even games you will not have this problem.  We have had the tv for a few weeks now and it has performed great every time.Second, The stand.  I have the screen mounted to the wall, so I can't really comment on how flimsy the stand it.  I do know that it feels really solid and heavy.  Plus, I looked at 3 of these at the Electronic store here and they all looked very solid.  They didn't lean, tilt, or apear to be in any danger of falling forward or backwards in any way.The TV is super super thin also.  It's almost too thin (a good thing).  The thickness is about the same width as a dime.Everything seems to be working great so far.  No problem or issues yet.", "Date": "January 26, 2012"}, {"Title": "I'm Pleased With The Purchase", "Author": "MajoboJRod", "ReviewID": "R2UM1VXCXNW8QE", "Overall": "4.0", "Content": "The picture (sharpness, color, etc.) exhilarates me, though it took me a while to adjust it the way it felt natural to me.  The sound is nothing spectacular, but it was easy to connect the TV to my stereo audio receiver/amplifier.  The 3-D sports look highly realistic, though Verizon FIOS, at least so far, is only showing 6-weeks-old college football games.I love being able to play Pandora on this TV, and I've also used Skype, both of which are part of the NetTV suite, which also includes Netflix, YouTube, VUDU, CinemaNow, and Blockbuster.  (In order to use Skype, I had to purchase a Skype FreeTalk webcam that is easily placed on top of the TV, not to mention it matches the TV's black color and modern look.)I had no problem connecting my Wii, but I was disappointed I couldn't connect it in HD.I've connected my laptop PC to the TV, and the HD picture on the TV is as clear (but MUCH BIGGER :-)) as it is on the PC.  Hooking up the PC, of course, extends programming to anything that's available on the Internet.The actual physical TV box is quite spectacular, in that it is only 5/8\" thick.Overall, I'm pleased with this purchase!", "Date": "November 23, 2011"}, {"Title": "Amazing picture", "Author": "Peanut", "ReviewID": "R1FZ49FYZB6WFR", "Overall": "5.0", "Content": "Im so happy with this purchase! The picture is simply the best.  It's got everything built n like the wifi plus it has the nettv and other online services.", "Date": "March 30, 2012"}, {"Title": "What a disappointment", "Author": "ragrillo", "ReviewID": "RPTCB1PF4QL25", "Overall": "2.0", "Content": "I ordered this TV based on the reputation of the brand and what seemed to be a stellar array of features.  It is ultimately about the image though, and in this case, it was a terrible disappointment.  The set I received is likely defective, because it has these white spots all over that you can see through the movies.  The construction is also poor.  The bezel is very thin for such a huge TV, to the point that light sifts through the seams in the back.  It's not well balanced when installed on its base, so it leans forward.  One only thing I can rave about: the sound is impressive: clear and crisp.  Dialogues are clear, and not muffled as in other thin TV sets.  All in all, stay away from this TV.  I am returning it and likely buying a Samsung.", "Date": "October 22, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Dynamic 3D TV, 480Hz\nFine Local Dimming\nQuantum BLACK Panel\nNet TV with Yahoo Widgets", "Name": "Toshiba 65UL610U Cinema Series 65-Inch 1080p 480 Hz Local Dimming 3D LED-LCD HDTV with Net TV, Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41UyJlbln4L._SX300_.jpg", "ProductID": "B004MFBHB0"}}