{"Reviews": [{"Title": "PC Monitor/Xbox 360", "Author": "Chris", "ReviewID": "R1ON3CCWSOE3M2", "Overall": "5.0", "Content": "I brought this TV as a monitor for my computer.I like that the speakers are built in and if you have hdmi on your computers video card it reduces the need for an additional soundcard and audio cable.My only complaint is that there is a pc/dvi mode for the hdmi ports that makes the pc image look really clear and it was difficult to find it existed at all.  For the first week of use the text was very blurry on the monitor and it was only through reading on message boards that I found this option needed to be changed.  It is not an obvious option as I had been through the whole menu on the TV many times.  Once this option is set Windows looks great at 1080p.I also have xbox 360 hooked up to the second hdmi port and that looks great as well.Overall this is a very nice TV or monitor for 250 bucks if you are going to be sitting pretty close to it when using it.One other negative might be the stand as it doesn't really allow you to do anything.  What you see is what you get.  It's not a problem for me though.", "Date": "June 17, 2011"}, {"Title": "Samsung quality......knock on wood", "Author": "M. Bailey \"Snookums\"", "ReviewID": "RK9W4FPANT3N4", "Overall": "5.0", "Content": "OK....so here I was looking for a bedroom TV to hook up to my bluray and Netflix streaming. Finally gotten rid of the old clunker Haier tube TV from years ago.At first, I was taken by the design of a Vizio 26\" somewhat widely carried by many retailers and also on the internet. So I went out and bought it at a local retailer. Psyched. It fit perfectly in the intended bedroom spot. Looked great too. Dead remote....couldn't get past the first set-up page. Tried everything. Very pissed off. A bad omen. Such disappointment. Returned it for a refund.Then.....I discovered this Samsung. Always liked Samsung. Even though the size was a bit smaller and it looked like everybody else's flat screen, I found that it is 1080p with a 120khz refresh rate. Granted the 1080p res isn't anything to write home about with such a small screen, the 120hz refresh rate (better pic with fast motion) hooked me along with the LED illumination. Bought it. Set it up. Hey! It works!! Fantastic picture.Pros: Samsung - 120hz refresh rate - sturdy remote control - slim design - excellent picture.Cons: NONE really. But....there is no audio output on this particular model. You must rely soley on the set's speakers. Some people have complained of this, but they should have inquired first before buying. Some complain of the audio quality, but...if you go into the settings and work with the set's audio equalizer a bit you can get it to sound quite nice for a set of it's size.  Remember, this is a small set intended for the kitchen, bedroom, dorm or study. Not a home theatre. Part of this could be worked around if you have a bluray with audio outputs.", "Date": "September 11, 2011"}, {"Title": "With a PS3", "Author": "Tinker", "ReviewID": "R3FOAP0VEJW6P", "Overall": "5.0", "Content": "This is used exclusively with The Boss' PS3 console, and it's a very nice screen.  Coincidentally, the day this was delivered, she brought home a similarly-priced, identically-spec'd 24-inch Toshiba from a local B&M;, and the differences are night-and-day.Both have a stunning picture, head-on, but as you move off-axis from directly in front of the screen, this Samsung holds color gamut at far greater angles than the Toshiba, and remains viewable at least as far to the side as you can go and still see the screen.  Colors may not be so great at that angle, but you can see them.  With the Toshiba, all you see is a dark panel.We previously had a Sony Trinitron CRT connected to the PS3 console, and I thought it worked mighty good at that role.  I'm not a gamer, but when I look over her shoulder now, I can see parts of the games I've never seen before, and not because of the wider aspect ratio.  Stuff that was hidden in the dark areas now pops out.This is the first LCD television I bought, and I bought small and cheap because of the problems inherent with LCD screens.  This one has sold me.  Still have to be careful with brands and models within brands, but I like 'em and am actively shopping for a larger screen for the living room.As a bonus, The Boss says the games look so much better - and different - she can go back and play her old games all over again.  If she does that, this set will have paid for itself in a few months.Highly recommend this where it's size fits the size of the room.  Fantastic, lucky, first buy.", "Date": "July 5, 2011"}, {"Title": "Great TV!", "Author": "DyseMan", "ReviewID": "R15U95V47405R2", "Overall": "4.0", "Content": "The TV is great it has a nice bright picture and it is crystal clear.  I like the 120Hz refresh rate it makes sports look better.  The only thing I was unaware of was the lack of audio outputs.  I wanted to hook this TV up to speakers and I can not do so because there an no audio outs what so ever.  Other than that the TV is everything that I expected and I would go with a Samsung again in the future.", "Date": "July 28, 2011"}, {"Title": "Not \"Internet ready\" as advertised", "Author": "Mark L. Dyson \"Spinny\"", "ReviewID": "RLOI6BFW3Y6G", "Overall": "2.0", "Content": "Before I wrote this, I searched the net for a fair definition of the phrase \"Internet ready\" as applied to a TV. Universally, including Amazon's own definition, you can expect an Ethernet port, and usually some means to connect via wi-fi, either built in or by adding an adapter.My first hint of trouble was the lack of an Ethernet port.  The next hint was the absence of any mention of networking in the manual.  I connected a Samsung wi-fi adapter (one that based on the supplied chart should be the correct model). No dice.  I have another Samsung HD TV that does work in this manner, so I'm familiar with the procedure and have the online Samsung documentation for connecting a 5000 series unit to back my efforts. It simply did not provide any network configuration options.I contacted Samsung tech support next. At first the tech said it should have worked, but when I insisted it didn't he went away for an extended period to look further. When he returned, he apologized but stated this TV can not be connected to a network.And that's it.  It is advertised as being \" Internet ready\" when it in fact is not.  That is false advertising.I give it two stars overall instead of just one because apart from the falsehood it appears to work as your run of the mill small screen HDTV and the picture isn't bad at all.", "Date": "September 21, 2011"}, {"Title": "Great for small room.", "Author": "Hear & Now", "ReviewID": "RBLS4EJ4SRJV5", "Overall": "5.0", "Content": "We redecorated a small room and mounted this TV at eye-level while sitting. Whoa. Crisp, clean image running off the antenna. Picked up the $15 articulating mount. Makes it easy to adjust viewing angles to different sitting positions. Great \"other TV\" for family gatherings when you don't want to watch what the crowd is watching.", "Date": "November 10, 2011"}, {"Title": "Perfect for me", "Author": "Mikey", "ReviewID": "RB49W4P789IOC", "Overall": "5.0", "Content": "I don't usually write reviews but there aren't very many for this product so I decided to do one.I have this tv in my room hooked up to my play station. Picture quality is very good and sound is not bad either.Pros:120 hz1080pgreat priceenergy efficient.Looks good in bright environments.Cons: The stand is very wobbly. I like to rest my feet on the desk but i can't now because it wobbles the tv. which is really disappointing but I'm sure there is something I can do to fix it.Conclusion: I'm giving this tv 5 out of 5 stars because it was exactly what I was looking for. A solid tv, with the specs I wanted at a great price. 5 stars for the tv. 1 star for the stand. I have only had this tv for 2 days now so I will update if I have any further issues.", "Date": "June 23, 2011"}, {"Title": "Samsung's \"Clear Motion Rate\" is NOT 120Hz Refresh Rate", "Author": "Dan", "ReviewID": "RE9H7QVYYEVNU", "Overall": "4.0", "Content": "I purchased this TV after being misled into believing it was capable of producing a 120Hz refresh rate, which turned out not to be the case. Samsung's \"Clear Motion Rate\" is not equivalent to refresh rate, and I'm not even sure what exactly it does to enhance video smoothness. That being said, it's still a decent TV for $220, (which it was at the time of the review, $250 not two days earlier when it was purchased).If you're looking for a 22-inch LCD LED TV with a 1080p native resolution, this product will suffice. Just be sure you understand that you're not getting a 120Hz refresh rate-capable set; the refresh rate is the standard 60Hz.One more thing: there's no audio jack on the rear of the panel, so you can't plug in headphones. Not too big a deal, but that would've come in handy for discreet, late-night viewing where nearby persons may be sleeping.", "Date": "May 14, 2012"}, {"Title": "Almost Gave this TV 2 Stars", "Author": "Mr. Bingo", "ReviewID": "R3RY580GUXNJPE", "Overall": "5.0", "Content": "I actually did give this TV 2 stars at first, until I read a review by Chris informing me of the PC/DVI mode he found.  I was about to start the process of returning it, and I've only had it for a few hours so far.  My primary use for this TV is a computer monitor and will soon hook up a PS3 to the other HDMI input.Here is how to turn the PC/DVI mode on.  It is most counter intuitive.  It really is simple though:1. Plug in PC to HDMI/DVI port on back of TV2. Push Menu button3. Scroll down to (Input) Source List Push <ENTER>4. Scroll to Edit name Push <ENTER>5. Scroll to HDMI/DVI Push <ENTER>6. Scroll to PC or DVI/PC Push <ENTER>7. Now Exit the menu, you're finished.You will notice the picture changes when you scroll over PC selection.  The picture for the PC should be clear, text should be clear!", "Date": "August 15, 2012"}, {"Title": "No audio output!", "Author": "Edward Tripp", "ReviewID": "R2QXPUAHURXRA6", "Overall": "1.0", "Content": "I was very disappointed to find that this TV lacks even the most basic audio output, a headphone jack. I cannot understand why Samsung chose to save a few cents and not include user outputs. Furthermore, the built in speakers are tinny and weak--thus my preference for headphones or my own speakers. Otherwise, the TV is fine, with a very clear picture.", "Date": "May 21, 2012"}, {"Title": "great little tv", "Author": "Anita K. Ohm", "ReviewID": "R3E22F5IZW9P2L", "Overall": "5.0", "Content": "Got this TV and love the size, the picture quality, the sound.  It all works for me.  If you have a tv unit that does not have a big space, this is the answer.  It is a terrific buy.", "Date": "September 2, 2011"}, {"Title": "Great TV, if you don't mind the sound & NO exteranl headphone/speaker jack", "Author": "Casus Belli", "ReviewID": "R1KAGWNR68LQO6", "Overall": "3.0", "Content": "Great TV, if you don't mind the sound & NO exteranl headphone/speaker jackThat pretty much sums up my review for the Samsung model un22d5003bf.I bought one locally and was briefly extremely pleased.PROS:It it an LED HD TV.It supports 1080p High Definition resolution if you have it available on your station or media. Most stations (even digital ones) still broadcast many programs and movies in 480p and non HD DVDs are in 720p.It has a \"simulated\" 120 Mhz refresh rate to reduce blurring during fast motion, such as sports events, action videos, etc.  Samsung calls this \"Clear Motion Rate 120\"It has 2 hdmi & 1 usb port/s.It can double as a PC monitor and is very clear for either reading or gaming.It has a thin profile and is lightweight for wall mounting.It has several adjustments allowing one to get the most out of the tiny back facing stereo speakers.CONS:As has has been said, the screw-in base is somewhat feeble and unstable, and leaves one with an  insecure feeling.It does not have true but rather a simulated 120 mhz refresh rate, \"Clear Motion Rate 120\" for fast moving images.As with most TV's I've found the internal sound quality to be inherently inadequate.It lacks an external headphone/speaker port.The killer con for me (worth 2 out of 5 stars) was No external headphone/speaker jack. This did not allow me the option of plugging in my superior external speaker system or my headphones when I needed to keep the noise level down and not disturb anyone.This was the first time that I purchased any TV that lacked this option and I was truely surprized that anyone, especially Samsung, would create an otherwise outstanding TV and not provide an external headphone jack.Samsung customer service verified that there was NO work around to hook up my external headphone or speaker system on this unit, so I sadly had to return it.I was told that the samsung hdtv model un22d5010 might have an external headphone jack, but I have not been able to confirm this with an actual owner or technical person.The model un22d5010 does appear to be identical to the un22d5003bf in every other way, so it may be the better TV for me if I can confirm that it actually has an external headphone/speaker jack.For persons who are satisfied with the intrinsic speaker sound of most TVs, and forsee no need for external headphone use, then the Samsung model un22d5003bf is an otherwise very good, albeit somewhat expensive (due to the newness of LED technology) HDTV.For the rest of us, make no assumption that a new TV will come with an external headphone option that we once thought was ubiquitous.", "Date": "December 17, 2011"}, {"Title": "An Impressive TV/Monitor So Far", "Author": "Tom Lawson", "ReviewID": "R1A4LVJXMGZTOR", "Overall": "5.0", "Content": "I purchased this TV to replace a 17 year old 13\" Magnavox and a 10 year old ViewSonic Monitor, so far so good. It doesn't have many inputs and the Component and A/V inputs are shared (meaning you can't have both plugged in at once, or if you can I haven't figured out how yet). The picture quality really is excellent, especially as a widescreen monitor. I have an older PC system and am running it through the TV via a DVI-HDMI cable. There is no VGA input on this TV, which I was expecting (because I didn't read the specs carefully enough). The picture quality is also excellent as a TV; I have a VCR and DVD player connected to it as well as some gaming systems and they all look great. I can't comment too much on the sound as I have all my electronics hooked up to my stereo receiver. It should be noted however that this TV has no audio out so you can't hook up headphones or external speakers directly to it. For it's size and probable use though, the audio sounds good. It was easy to set up, with all the controls being pretty intuitive. My only real problem with the TV would be the stand. It seems stable enough and I have no fear that it will tip over or break, but it's non-adjustable. This isn't too big a problem as the TV has a pretty wide viewing angle, but it still seems like it should have some adjustments on it. Overall I'm very satisfied with the TV so far, though I've only had it a few days.  Will it last as long as my Magnavox? Odds are it won't, especially as I'm using it as a dual purpose unit, but for however long it lasts, I think it'll be a good little TV.", "Date": "October 12, 2011"}, {"Title": "22\" Samsung HDTV", "Author": "Don Finch", "ReviewID": "R1BDTGLCFU1435", "Overall": "5.0", "Content": "I  bought four of these to place in guest bedrooms and the kitchen.  They are clear, not to big, but big enough.  The picture is excellent, and I am proud of my purchase.", "Date": "October 10, 2011"}, {"Title": "Amazing clarity, unreliable color...", "Author": "Amazon Customer", "ReviewID": "R39LJG0U28CK9J", "Overall": "4.0", "Content": "Picture Quality great, colors, not so much; I bought this TV after researching every TV 22-24\" for my small bedroom. The TV I am replacing is an amazing Samsung LN19A650. The minute I plugged this in I found the color of the picture absolutely atrocious. I called samsung and we went through changing some of the settings around, spent 2 weeks trying to make it work, I even bought the Disney \"World of Wonder\" TV calibration DVD to get the best settings, nothing doing.The color is not *always* horrid, but in most scenes it's almost as if they just make up colors. Oh look, red, lets make this bright perfect primary, oh, that's grass, let's make it bright as can be, all oceans must be intense blue, oh, khaki, who needs it. That would be not horrible but my goodness, faces come off super peachy or really tan and monochromatic, often jaundiced. faces of brown or olive people can be very washed out, it's really awful. So i went to best buy to check out the TV's on display just to make sure i didn't have a wonky set, the tv's there were the same. Again, most scenes were perfect but too many exhibited the same problems i was having with the one i had bought, washed out neutrals and exaggerated greens and blues and unnatural skin tones. I tried all of the pre-set settings as well as custom settings. Movie mode was the most normal but still too many scenes exhibited poor color interpretations. I then bought the 22\" LG led tv (LV2500) and in comparison the Samsung picture was so much crisper with no background picture noise but the colors were so much more reliable and consistently appropriate on the LG.[EDIT} In the end the best setting for me ended up being turning all the colors way way down. Now the colors are better some faces end up a little off color sometimes, but for the most part it's pretty good now.Everything else about the samsung is just fine.OUTPUT/INPUTS: Yes, there are limited output/inputs, if you want more options than the 5003, the samsung un22d5000 is the EXACT same TV except with more input/output options. I bought the TV very aware of that but having more speaker volume was important to me and the 5003 has a total of 10Watts whereas the 5000 has a total of 6Watts, no idea if that actually makes a difference.MOTION RATE/REFRESH RATE: Regarding the 120hz drama, it's a little confusing for them to have marketed this TV like that but anyone who is buying it for the 120hz should know enough that refresh rate is never described as clear motion rate and they could have figured it out before buying the tv. For TV watchers 60hz vs. 120 on a tv this size won't make a difference, not to mention there is no other TV with a 120hz under 32\". No idea on what that means for gamers, there's a discussion on amazon about this, consensus seems to be that 120hz is not better than 60hz.SOUND: Yeah, not so hot. In some circumstances the \"surround sound\" set to on it much better, usually movies. Unfortunately it isn't so good for television shows.VIEWING ANGLE is poor, but dealable, just gotta make sure to sit eye level to the TV.The colors were almost a dealbreaker for me, thankfully I was able to find a setting that worked, quite happy with my tv now. Now the sound is the most bothersome thing.", "Date": "February 8, 2012"}, {"Title": "Absolutely Not 120Hz, it is 60Hz !!", "Author": "SD \"Miss_Nostalgia\"", "ReviewID": "R3Q603C8ZE46OU", "Overall": "1.0", "Content": "First things first, this Samsung UN22D5003 is not 120Hz, it is 60Hz and I find it as no coincidence that after the Black Friday Sale this was corrected. This item's original 120Hz description along with a few reviews are misleading and outright lies. I bought this television from Amazon on Black Friday in-part due to being assured by these inaccuracies, and now following returning this item, writing this review and seeing the ratings of `5-stars' and the 120Hz to 60Hz details adjustment by Amazon after the fact , I'm just fuming.Ultimately this television from the start of use was disappointing. I bought it primarily for gaming and this is not a gaming TV. At 60Hz gaming on my PS3 had the dreaded `ghosting' effect, as well as movies, and cable. Also the sound was poor even after utilizing an HDMI cable. I utilized every input and settings available to make sure this television wasn't salvageable, yet it's simply crap. Lastly the 120 cmr (clear motion rate) is a deception. DO NOT BUY THIS!", "Date": "December 1, 2011"}, {"Title": "Disappointed doesnt cover it...", "Author": "Eric L", "ReviewID": "RR0HPIKL7FX10", "Overall": "1.0", "Content": "I bought this set from another online retailer, but felt it was worth leaving a review on Amazon as well.First the positives.SCREEN: For a $180 TV, this LED screen is great.  Decent black levels.  Good color.DESIGN:  Good looking set.  Very slim, especially compared to other low end LED's in this range.  Not as thin as my 46\" Samsung LED, but still not bad.SIZE:  Perfect size for my home office.Annnnd now the negatives.SOUND:  Terrible.  Just plain terrible.  Anyone who says the sound is great must have hearing issues or just not care about sound quality.  Its completely devoid of any low end.  No bass at all.  Gun shots in The Dark Knight sound like cap gun from my childhood.  Music is pathetically bad.REFRESH RATE:  This is listed on many sites as a 120Hz set.  They dont just say CMR 120, but literally list it as 120Hz.  This is not true.  This is a 60Hz set.  This is just false advertising at its worst.AUDIO OUT:  There is none.  NONE.  Not even a dang headphone jack.  How on Earth does this make sense?!I will be returning my set.  Probably.", "Date": "July 27, 2012"}, {"Title": "Huge disappointment", "Author": "Dave N.", "ReviewID": "R2WZ3RMVDDTYAR", "Overall": "1.0", "Content": "I was looking for a tv that could go from my bedroom to my pc to my RV.  What I got was a tv that went from my pc, to my bedroom and back to the store.  The color was way off and no control settings would fix it.  After spending hours on the phone with Samsung, they suggested I hire a home calibration service from Best Buy or the like.  First of all, the calibration service would cost more than the TV did so that was a non-starter.  Secondly, I've been in the computer support business for ... scary thought... over 20 years, so I know how to calibrate a monitor/tv so I'm not going to pay someone for something I do myself all the time.  Samsung's support said they would take it in for service and they would be sending a shipping label via email.  After a two day wait, I decided to return it to the store instead.  Thanks Target for their understanding.  It has been three months now and Samsung still hasn't sent a return shipping label.I will never buy another Samsung product!!!!!!!March 31, 2011 updateAfter looking around for another 22 inch tv I thought I was going to end up with a Samsung anyway as it had the resolution I wanted for use as a second monitor for my computer.  I looked at Vizos, Sharps, Sonys, etc. and came across a closeout on the now discontinued Sony 22BX320 for $189 at Shopko.  I really wanted an LED tv with 1080 resolution but settled for a 720 Sony and am quite happy.  The default color was a little off but I only had to change the to add a little green and I'm done.  It couldn't be easier.The TV is hooked up to an AppleTV so now I have unlimited Netflix streaming and iTunes access.  I wish the tv was a little bigger but if it were bigger, it wouldn't fit in my RV when I go on trips which is the reason I went with this size anyway.  The size if fine for my bedroom.Too bad Sony is dropping out of the small TV market.  I would have liked an updated version of this TV but I'm more than happy with what I have especially at the clearance price I paid.  Oh, this model has a room light sensor so the picture is adjusted to room lighting.", "Date": "March 9, 2012"}, {"Title": "A dramatic discount from prior model UN22D5000NFXZA", "Author": "China Dreamer", "ReviewID": "R1OX2G3Q2E7YYC", "Overall": "1.0", "Content": "This new model replaces the 2011 model that has only 1 digit difference in model number: UN22D5003 instead of UN22D5000. The UN2D5000 is a FAR SUPERIOR MODEL in EVERY WAY - design, looks, contrast ratio (3.2 million to 1 in the UN22D5000, versus 22,000 to 1 in the UN22D5003). The UN22D5000 has optical out audio, component adapter & RCA stereo in adapter, 2 HDMI in, and a separate PC video in, and a separate PC audio in (and automatic PC input screen adjustment). Same 120MHz Clear Motion Rate. Elegant Touch of Color TV design with a silvery stem in the TV stand for the 2011 model UN22D5000, but cheap rounded plastic for the 2012 model UN22D5003! Yes, you read it right, a heaven and earth difference (or drop) in features and quality. In addition, note that in the 2011 model UN22D5000, it is the VERSION AY02 that is the SUPERIOR MODEL, compared with the older VERSION AY01. I had both. Samsung in general no longer makes high quality models in the 2012 \"E\" series, unless it is in the very high-end ones (in prices). You may still find some Amazon Marketplace sellers selling mostly used 2011 model (UN22D5000) but on rare occasion brand new - even though listed under used (check description for each seller), and be sure to ask about which version: AY01 or AY02. AY02 is vastly superior to AY01, like a different or newer TV. I can't explain the difference. My eyes tell me so and so would yours. When I first turned my AY02 model on, my heart skipped a beat - \"Wow!\" \"I am in love.\" AY01 the older model is OK, but nothing that causes my heart to jump out of my chest or go into fibrillation. When I saw the new model UN22D5003 in the store, and the differences, I said to myself, \"No way.\" Version AY02 of the 2011 model UN22D5000 (or UN22D5000NFXZA if you are searching for it on Samsung's site) is the way to go. Amazon may still have them but be sure to distinguish between version AY02 apart from version AY01. There is a big difference. For pennies a day, I would rather have version AY02 - how can one place a value on the delight of the senses? These are dirt cheap compared to what something like this would cost 9 to 10 years ago. In 2003, an NEC 20\" LCD (heavy, bulky, low-resolution) TV/monitor at Costco cost $ 1,100 and it was considered a good buy! (Plasma TVs then? $ 15,000 an up to $ 50,000 to my best recollection!)", "Date": "October 10, 2012"}, {"Title": "Samsung 22\" LED HDTV from Amazon", "Author": "HBR", "ReviewID": "R2JDKXFTDKJGMN", "Overall": "5.0", "Content": "I almost deleted this review request without comment, but I realized that when I was about to BUY a new TV for my mom who is in a nursing home, I read the reviews of others and made my decision based on those words. So here is what I think about the Samsung UN22D5003 22-Inch 1080p Clear Motion Rate 120 LED HDTV (Black) that I purchased for my mom.First of all, it came, not only by it's posted delivery date, but I received 2 notices that it was on schedule to be delivered early. It was, yea! That was a bonus.Secondly, it was easy to set up. Pretty much plug and play.And as for product quality, the picture is bright and easy to look at, the audio is clear AND my mom can work the remote without a problem.All in all, I am most satisfied with this TV and with the service I received.", "Date": "May 22, 2012"}, {"Title": "Why this tv deserves only 1 star", "Author": "Anonymous", "ReviewID": "R3TSQW0WF6LHMD", "Overall": "1.0", "Content": "I bought this television looking for a compact HDTV that offered 1080p and a 120hz refresh rate to use in my dorm room.Pros: Compact size, stunning imageCons: THERE IS NO AUDIO OUT!!! That means NO means of connecting to external speakers, NO way of using headphones, and NO way of connecting to a home theater.BUYERS BEWARE!It's a shame, I like everything else about this TV", "Date": "August 25, 2011"}, {"Title": "I'm bitterly disappointed", "Author": "Barbara Greenfield", "ReviewID": "R3SBYRLAY6PJOX", "Overall": "2.0", "Content": "I hate to be the bearer of bad tidings, because I’m such a Samsung fan, but I have to do it.  I am utterly disappointed with my recent purchase, the UN22D5003 BFXZA Samsung  LED TV. I currently also have an 18 month old Samsung  40” LCD TV that I absolutely LOVE.  The color & picture clarity are spot on – I’ve even had people remark to me how great my picture is.  This is why it was a no brainer when it came time to purchase a second TV.When I first received the UN22D TV, the color was OFF – overly saturated with yellows & purples, but not consistently, and not on every channel.  I was on the phone with Samsung’s customer service multiple times, and even with tweaking different settings, nothing helped.  At this point, being a Samsung brand, I was sure I had received a rare  ‘lemon’, and returned the original to the retailer for a new UN22D.  To my utter surprise & disappointment, the replaced TV was no different than the 1st.Now I’m back on the phone with Samsung, and they’re telling me I need service.  Honestly, this TV doesn’t need repairing, it needs to be a different TV all together.  I was even on the phone with Samsung's higher level customer service people, as well as on their Facebook account, begging them not to make me go the servicing route, but I got nowhere. Even if servicing would help, which I'm convinced it can't, I resent having to service a product that I just bought.I'm really not happy with this TV at all - I would NOT recommend it.", "Date": "December 21, 2012"}, {"Title": "Great small TV for bedroom.", "Author": "Gary Andrew Weller", "ReviewID": "RG36HQ4XEZ52H", "Overall": "4.0", "Content": "Good picture and quality television for the price.  The only negative is the sound.  The volume isn't there.  There is hardly a difference from volume level 20 to 40.", "Date": "September 6, 2011"}, {"Title": "Will not play video thru USB, VERY deceiving description.", "Author": "sfc", "ReviewID": "R325PXBBXTABZ5", "Overall": "1.0", "Content": "I purchased this TV purely for the USB input so I could play videos from a external hard drive or jump drive. This tv will not play them. This is the information right from the Samsung web site.Connect Share JPEGConnect a thumb drive or digital camera quickly and easily. User-friendly interface allows access to videos, a music playlist and pictures via the remote.Not an option with this TV. Last Samsung I will buy. My new LG brings up a menu on movies upon the inserting of a jump drive.Buyer beware!!!!!Samsung UN22D5003 22-Inch 1080p Clear Motion Rate 120 LED HDTV (Black)", "Date": "April 3, 2012"}, {"Title": "NOT a 120hz tv", "Author": "D. Herasme", "ReviewID": "R16XG0F0N30035", "Overall": "1.0", "Content": "This is not 120hz. This is 120MCR Clear Motion Rate. Samsung use this just to make you think it is 120hz. I returned it after it was opened and discovered it is not 120hz. Samsung list the TV on their website as a 120 Clear Motion Rate TV. So, I dont know why amazon insist in having it listed as 120hz.DO NOT buy if you want a 120hz tv that is 120hz.", "Date": "September 29, 2011"}, {"Title": "samsung 22\"", "Author": "badipete", "ReviewID": "R3KTZW1ITATV63", "Overall": "3.0", "Content": "was refurbished. sound is bad. first time i have had a problem with a refurbished item. .live and learn thru life", "Date": "June 10, 2013"}, {"Title": "Decent picture, no line-out for audio", "Author": "J. Angelo", "ReviewID": "R3FU3TMGTKQJ9H", "Overall": "2.0", "Content": "Samsung quality, decent 1080 picture, remote is intuitive, but I didn't think to look for an audio-out jack on it- all the other 7 TVs I have bought recently had one, so why look for something so obvious?But this TV doesn't have any audio line-outs. No digital coax, no optical, no stereo RCA, no even a crummy 1/8\" headphone jack. I bought it to use with an XBOX and had to buy another adapter to use HDMI for the picture with the sound from the XBOX going to a receiver. A TV with HDMI input and NO audio-out jack is a dead-end. Cannot recommend this TV- I bought a Westinghouse for half the price, same size, with the correct inputs and outputs, with 1080 picture.", "Date": "May 30, 2013"}, {"Title": "Samsung tv", "Author": "brit", "ReviewID": "RU4V59MJAXPCD", "Overall": "3.0", "Content": "I would recommend this tv for a kitchen or bedroom. The sleep timer is more tedious to access than other tv's. No button on the remote. You have to go to the on screen guide each time. Otherwise a great tv for the money.", "Date": "November 12, 2012"}, {"Title": "Samsung UN22D5003 22Inch Clear Motion Rate 120 LED HDTV", "Author": "SMG", "ReviewID": "R1P1UOI88C4SQN", "Overall": "2.0", "Content": "I have always been very happy with Samsung products, unfortunately this product does not measure up.If you are straight in front of it you get a great picture, but move a little below, or off to either side, and the picture is distorted. Not typical for Samsung.", "Date": "October 20, 2012"}, {"Title": "Great!!", "Author": "Joe", "ReviewID": "R2UHFXFHUNZ1QJ", "Overall": "5.0", "Content": "This is a great TV and the price is even better.  After finding this offer online,  I looked around locally to see if this was a good deal. This TV usually runs someone about forty to fifty dollars more if you buy it in a store.  This is my first LED TV and I couldn't be happier.  It showed up within three days of purchasing it.", "Date": "March 25, 2012"}, {"Title": "This a very good TV!", "Author": "Doug Garrison", "ReviewID": "R531RYEF42ZW3", "Overall": "4.0", "Content": "Iam using this TV mainly as a Monitor for my PC and to use with my Xbox 360 and for this purpose it works great.I wanted to address the 2 main complaints I have read about this TV , that being 1) no audio out for headphones or speakers and 2)use as a PC monitor. In regards to the first issue , if you are using a pc or 360/ps3 the headphones or speakers would utilize the audio in jacks since the audio source would be either the pc or 360/ps3.The only time you cannot use headphones or speakers is when you watching broadcast television or cable.That being said how hard could it have been to add the audio out option?In regards to use as a pc monitor I have read a few reviews stating that they could not get the colors or resolution right when using HDMI to hook up to a PC, I had the same problem at first but the solution was simple. You have to rename the connection to pc if using a HDMI cable or PC/DVI if using a DVI adapter by pressing first the source button then the tools button and then edit name. You will see a list of options then select PC. After I did that the screen looked great. These directions are in the manual but I was screwing around with color and contrast options for 2 hours before I decided to take a look. If your image has borders go into your PC's videocard options and look for the overscan adjustment.All in All I am very happy with the product , but I deducted a star for the lack of audio out and for the stand which I think should be more solid.", "Date": "December 31, 2011"}, {"Title": "Warehouse Deal", "Author": "E. Jones \"ej\"", "ReviewID": "RP4H6TTIIYEEP", "Overall": "5.0", "Content": "This warehouse deal said that they TV has some scuffs on the rear, however I could not find anything marked or scratched on the TV at all. Arrived in the original packaging, even the remote batteries were still in the shrink wrap.", "Date": "December 2, 2012"}, {"Title": "Samsung=value for your dollar.", "Author": "Jeff D", "ReviewID": "R3ODOC6I91FKC2", "Overall": "5.0", "Content": "We upgraded 4 TVs and all of the Samsung products, from 22\" to 40\", are exceptional....money well spent!!!!!!!!!!!  We recommend Samsung without hesitation.", "Date": "December 1, 2012"}, {"Title": "Great tv for the kitchen", "Author": "Harold M. Spriddle", "ReviewID": "R272TZFM3AJKQG", "Overall": "5.0", "Content": "I read the feedbacks on this tv, the only real complaint i saw was the audio. I figured i would give it a try since i own several samsungs and i love them all. They did not let me down, this is a great tv for your kitchen / office. The picture is samsung greatness with factory settings and the audio sounds good. I'll probably get me a 26 inch for the garage, the wife already thinks im crazy.....lol", "Date": "September 27, 2012"}, {"Title": "Can get a better TV for the price", "Author": "Sam Park", "ReviewID": "R2UBG6G5GK4SDS", "Overall": "2.0", "Content": "Love Amazon's speed of delivery and return policy; the return policy unforuntaely had to be used for this Samsung since the remote was defective - only the volume worked on it. Otherwise, the reason for the low rating is primarly due to the lackluster features on this unit compared to other Samsung TVs in the same price category one can get at Costco. Also at this size, 22-inches, one really doesn't need 1080p but it's a nice feature along with the 120Hz refresh. Returning mine for defect.", "Date": "August 17, 2012"}, {"Title": "WHY OH WHY would you not have any sort of Audio Out!!!!", "Author": "Jon Stewart \"Jon\"", "ReviewID": "R173Y4JQOPOJ5U", "Overall": "1.0", "Content": "Come on designers... on a TV this size, it's a given the speakers are gonna suck.  So why isn't there an audio out?  I use (or tried to use) in our office for watching TV while using a treadmill.  Could hear it with it up full volume over the treadmill sound and I was literally a few feet from the TV.  Yeah the treadmill is kinda loud but that is why it has speakers in the treadmill with an audio input.  I went to hook the audio out from the TV into the treadmill input... UH OH... no audio output.  I couldn't believe it.  There should be a warning that there is no output on that.  I guess the extra 2 cents to put any sort of audio out was not in samsungs budget for this thing.  Back to the store it is going...", "Date": "November 27, 2011"}, {"Title": "A Bit Flimsy", "Author": "PUD", "ReviewID": "R2JJPIYIQBI6TL", "Overall": "3.0", "Content": "Purchased to replace an older, heavier LCD TV in the kitchen. I have it mounted to an under-cabinet flip-down VESA mount. Video source is a Directv HR22 HD DVR. The picture is more than acceptable especially after tweaking the settings. The Audio is certainly lacking but passable after some tweaking. The TV itself is thin (good) but flimsy (bad). When pulling down from under cabinet, it flexes so much that it pops the HDMI cable right out of the port. I've adjusted the Omni-mount flip-down mount to where it barely holds the TV up when pushed up out of the way, so when pulled down carefully, the flex is minimized. Normally I wouldn't care much about how sturdy an LED TV is, but this just points to the overall low quality feeling of the unit. I have other Samsung TV's, and this one just doesn't seem to be up to their usual standards; especially at this price point. For now, it's okay; but as a constant upgrader, this one might be replaced sooner rather than later...", "Date": "March 13, 2012"}, {"Title": "Better than expected", "Author": "Jean C. Arthur", "ReviewID": "R3HUQ1DHSL44UQ", "Overall": "4.0", "Content": "I suddenly found myself in the need of two televisions.  I use one in the room where I have my bike trainer because I have to have something to make sitting on a bicycle and pedaling without going anywhere tolerable.  My house is small so I wasn't looking for a huge television after both my Toshiba flat screens went bad in rapid succession after just over one year of use.I got this Samsung after looking at lots of reviews and it has met all my expectations.  The picture is very sharp with no distortion that my eye can detect.  I took away one star because of the sound.  I sometimes have to put the volume on the highest level to hear it.", "Date": "March 11, 2012"}, {"Title": "It is 120hz", "Author": "MOrlando", "ReviewID": "R3IJZ6PUIPOG5V", "Overall": "5.0", "Content": "Just to clear something up, this is a 120hz TV. There is a similar model with 60hz, but the model is UN22D5000, as opposed to this which is UN22D5003. I think the other reviewer clicked on the wrong one. I have seen this at many places for $199, so I wouldn't advise anyone to pay more than that.", "Date": "November 25, 2011"}, {"Title": "Does not play video files through USB port !!!", "Author": "Eric Katsov", "ReviewID": "R14NJCY7PTPXA1", "Overall": "1.0", "Content": "This tv has a USB port, but it will only display pictures or play mp3 music through it. When I hooked up my external hard drive via USB it did not play any videos on it because it simply does not have this option. Advertising is deceptive for this product because it says it will play your media files, but says nothing about no be able to play videos ... on TV ...from your USB drive. Other than that it is just a standard TV and by the way it is not that thin.Also, if you are planning to put it on your wall, you have to make shure that is positioned about 2 inches away from the wall because HDMI and Power cables plug directly perpendicular into the back of this TV and they need space behind the TV to stick out. I almost bought a slim TV wall mount for it, but decided to wait till it arrived to my house. I am glad I did, because I had to use my already installed wall mount that holds the TV 2 inches away from the wall to be able to hook up my Roku via HDMI.", "Date": "August 11, 2011"}, {"Title": "wobbly waste of time", "Author": "B. Barrie", "ReviewID": "REDZ5FATKBCZ2", "Overall": "1.0", "Content": "argh!  didn't even get to plug it in - could not solidly attach plastic base to TV - inherent design flaw - two short screws, two short, plastic dimples and the base stem is off-centerafter reading additional reviews, this is definitely going back - wobbly base issues, sound issues and 'clear motion rate'- what a waste of time and effort", "Date": "February 3, 2012"}, {"Title": "False Advertisement", "Author": "Jack", "ReviewID": "R2E40083TK7KBU", "Overall": "1.0", "Content": "I was lead to believe that this set had a refresh rate of 120Hz. That is a flat out lie.It has a SIMULATED 120Hz refresh rate.It actually only accepts a signal up to 60Hz and then SIMULATES 120Hz with that signal. The really sad part is that I bet most of the people who have bought this product have never bothered to open the user manual, and are thus none the wiser.If you are looking for a 120Hz set, don't buy this product.", "Date": "August 31, 2012"}, {"Title": "Refresh rate is deceptive.", "Author": "Red Cloudy", "ReviewID": "R2E0WG7YG9HG6B", "Overall": "3.0", "Content": "I nearly purchased this television because it was the only affordable option that combined all of the current features (Backlit LED, 120Hz refresh, etc.) in a small screen (<32\"). After doing research on TigerDirect.com, however, I learned that the \"120Hz\" figure only refers to a bogus measurement that Samsung uses to determine \"the thinnest line a TV can display in a moving image.\" The actual refresh rate is 60Hz.You may not care, unless you anticipate using the active-shutter glasses that NVidia uses for its 3D imagery, as I did. Still, the product description is misleading, and you may be able to find a better value by searching for plain old 60Hz televisions.Edit: Other reviewers have noted that the processor can enable 120-hz refresh, but after reviewing the information on Samsung's website, I am not convinced that this TV is capable of producing the two distinct images per 60hz cycle that would be necessary for active shutter 3D glasses. I would be interested to hear whether anyone else has attempted to use the unit for this purpose. It seems that it is designed primarily for predicting intermediary images when, for example, tracking movement in a sporting event.As for owning the television, I clearly stated that I hadn't purchased it and only wanted to indicate my reasons for choosing an alternative. My review didn't presume any knowledge of picture quality, software performance, etc.", "Date": "July 22, 2011"}, {"Title": "1080p at 22\" w/ Samsung quality and less than $200. Good buy!", "Author": "nicdnyc \"nicdnyc\"", "ReviewID": "R28F96Q2ZDYAII", "Overall": "5.0", "Content": "I got this for $197 to give as a Christmas gift (2012). There's a newer model UN22F5000 for $177 (as of October 2013). It replaced an old flat-screen, non HD, kitchen TV for my parents. I have zero complaints. It's light and thin. It was the only 1080p option I could find at such a small size.", "Date": "October 11, 2013"}, {"Title": "Great hdtv", "Author": "Roy C. Lewis \"zzoom\"", "ReviewID": "R320CRD9WBIHKS", "Overall": "4.0", "Content": "I have two of these sets.The 1080p picture is truly amazing with a good signal.The one real complaint is that the set does not have audio out.That's a pretty serious fault for our use, because at certain times we use RF headphones with the tv silent.This wasn't a deal breaker for me,though. I'm an engineer and installed audio out jacks, but for most, it would be a noticeable fault.Hence, the 4 stars instead of 5.", "Date": "September 27, 2013"}, {"Title": "A little small", "Author": "Kim \"Mystery and Thriller reader sometimes a ...", "ReviewID": "RGMWJ9UZHPF8E", "Overall": "4.0", "Content": "It was a little smaller than I expected. But it works fine. It is an alright buy. I would recommend for computer use.", "Date": "July 22, 2013"}, {"Title": "TV", "Author": "Mary Rix", "ReviewID": "R3CIC0HVMQFB9Z", "Overall": "3.0", "Content": "In addition, note that in the 2011 model UN22D5000, it is the VERSION AY02 that is the SUPERIOR MODEL, compared with the older VERSION AY01. I had both. Samsung in general no longer makes high quality models in the 2012 \"E\" series, unless it is in the very high-end ones (in prices). You may still find some Amazon Marketplace sellers selling mostly used 2011 model (UN22D5000) but on rare occasion brand new - even though listed under used (check description for each seller), and be sure to ask about which version: AY01 or AY02. AY02 is vastly superior to AY01, like a different or newer TV. I can't explain the difference. My eyes tell me so and so would yours. When I first turned my AY02 model on, my heart skipped a beat - \"Wow!\" \"I am in love.\"", "Date": "July 10, 2013"}, {"Title": "Samsung UN22D5003 22 inch 1080P 60 HTZ LED TV 2011 model", "Author": "MovieMark", "ReviewID": "R1JA1DY6ZFFKJH", "Overall": "4.0", "Content": "Is great !  The only thing I couldnt get to work was an external speaker from the yellow \"speaker jack\". Perhaps, it must be a powered speaker in order to hear it? Not exactly sure though. The sound from the built in speakers is really good though for a tv of this size. Picture good, remote good. It is advertised at 120htz, its not. but, for a tv of this size, it does not need to be. Unless your gaming 24/7, you wouldnt even notice the difference between 120 htz and 60 htz, especially for a tv of this size. Refresh rate just not as much of an issue as with those bigger sets. Nice price too !!!!!Love it  5 stars if I could figure out how to get external speakers from the unit working.", "Date": "June 6, 2013"}, {"Title": "Returned for Electrical smell", "Author": "littledutch \"littledutch\"", "ReviewID": "R3TIHWHTA581O3", "Overall": "1.0", "Content": "Returned for Electrical smell.  Smelled bad from the moment it was turned on.  Didn't go away even after several minutes.", "Date": "May 29, 2013"}, {"Title": "The Samsung TV was broken.", "Author": "Jef A.", "ReviewID": "RXH2N2234TZJ3", "Overall": "1.0", "Content": "The Samsung TV did not work.  It would not turn on.  I sent it to Samsung for repair.  Now I have to wait for weeks to get it returned to me.", "Date": "May 22, 2013"}, {"Title": "Kitchen perfect", "Author": "Renee", "ReviewID": "R3TW7UA1THDWE9", "Overall": "5.0", "Content": "Love the size and its light weight, but needs a small speaker for sound if your husband is playing the other tv [60 in] in the livingroom. But all in all great picture. I recommend it for a small room.", "Date": "May 18, 2013"}, {"Title": "Good TV, not a good monitor, \"Clear Motion Rate 120\" is nothing", "Author": "Chuck Nasty", "ReviewID": "R3FIPPNNOMGFGM", "Overall": "3.0", "Content": "For starters, this display is not 120hz as Clear Motion Rate 120 would imply. Obviously there are no 120hz inputs, but there are also no features in the TV to turn 60hz images into 120hz like most \"120\"-boasting TVs have.I want to use it as a monitor, but it displays the PC image very poorly. For one, the red tint on the display is very overpowered for some reason and I had to lower it in order to get a semblance of normal white. Then the display is not pixel-perfect. The display oddly blurs and sharpens things, so as to make TV/games look better and smoother, and to be honest, they do look better. However, on a PC desktop, this means you can't just have a normal pixel and a sharp font. Words are either blurry or have the nasty artifacts that come with the \"sharpness\" setting and there is no way to just make it display 1920x1080 normally without filtering it heavily, making it no good for a monitor outside of playing games.Other than that, it has great colors and a fantastic black level, and lots of great options to adjust the image. But I'm upset about the 120 thing being meaningless and it being no good as a monitor. The stand also can't be adjusted at all, so if you want to view the screen at eye level, you must stack it on top of something so that it is up to your level.", "Date": "May 14, 2013"}, {"Title": "Great product for the money", "Author": "Patti", "ReviewID": "R1RPPUCUNC4RIO", "Overall": "5.0", "Content": "My second Samsung television.  Not the best sound quality but nothing you can't fix with a cheap set of speakers.  Very nice little tv.", "Date": "May 3, 2013"}, {"Title": "The perfect screen", "Author": "A. Kerr", "ReviewID": "R6I4QFFAN4M8H", "Overall": "5.0", "Content": "Finding an LED TV under 24 inches that does 1080p without breaking the bank was difficult, but through the Warehouse Deal I snagged this for under $200. It currently serves as my second computer monitor, or my desktop gaming screen. I like to occasionally stream to Twitch or record gameplay, so having a second screen next to my computer setup was ideal. I can use this TV at anytime as a computer monitor which is another plus!I am a little biased when it comes to Samsung TV's; I own three now (living room, bedroom, and now office) because they consistently provide a clear, crisp picture; they have great color tones, and they have never given my a single issue. This TV is great!", "Date": "April 30, 2013"}, {"Title": "GREAT SET FOR BEDROOM!!!!!!", "Author": "THOMAS LINDSAY", "ReviewID": "R87ULSP132H65", "Overall": "5.0", "Content": "IT IS A BEAUTIFUL,SLIM BLACK 22  INCH SET. GOES WITH OUR  FURNITURE  AND WALL COLORS., EASY TO USEAT A DISTANCE WITH REMOTE. WE ARE AMAZED IS SO THIN!!!!!! FITS RIGHT IN!!  RECOMENDED BY OUR SON!!!HE  HAS ONE TOO!!!  THOMAS LINDSAY  THOMAS LINDSAY", "Date": "April 20, 2013"}, {"Title": "Excellent", "Author": "Darrell Reed", "ReviewID": "R3B17C5MO8SXFV", "Overall": "5.0", "Content": "The TV is great, with a great picture. I did not think that I would like LED, but I love it. Delivery was right on time.", "Date": "April 7, 2013"}, {"Title": "Great for the price.", "Author": "Doug", "ReviewID": "R3S27ZGL9WN1Z6", "Overall": "5.0", "Content": "This is a great value; not the best in the world but as good as it gets for the price.", "Date": "April 5, 2013"}, {"Title": "PC Monitor", "Author": "Joey", "ReviewID": "R1ENQD0WJKFFQH", "Overall": "5.0", "Content": "Similar to what everyone else is saying, this is a great product for the price and all that. The biggest thing that I needed to know is that, if you are planning on using this as a monitor for a computer, be sure to name the type of input that you are using as 'PC' otherwise the screen looks pretty bad. Once you name the HDMI input as PC then the screen looks instantly much better.", "Date": "March 11, 2013"}, {"Title": "Better than I expected!", "Author": "Mr. Hacks \"Mr. Hacks\"", "ReviewID": "RO7WGKJ5XYHIU", "Overall": "4.0", "Content": "If you are looking for a great HDTV and a great computer monitor, you can have both with this device!The Samsung UN22D50003 allows you to hook up up to two HDMI sources and one composite source and one USB device all in a 22\" package.If you are looking for a good starter HDTV and not sure where to go in terms of 60Hz or 120Hz or whatever, go with this device.Just about anything else on the market will sell you a 22\" 720p device with poor image quality. This device offers no compromises. It gives you everything you want in a TV, everything you need in a TV, and everything you've ever wanted for a computer montior in a single device.This TV is also ideal for folks who use their computer a lot.  Adjusting the Picture to \"Movie\" mode dims the screen ideally for both movie watching and to reduce eyestrain for folks who like to work on their computer. (Just remember to get up and stretch for about 5 to 10 minutes about every hour to avoid any physical complications from working too long infront of the computer.)I couldn't ask for a better TV and such a low price.  If you don't make a whole lot of money, like myself, but have been saving up for something you can use that does everything except the new high-end stuff like smart-TVs do (i.e. web, built-in PVR, Picture-in-Picture, etc.) but are good a pinching pennies, get this TV. Then with the money you save, go buy a Roku 2 XS and sign up for Netflix or Amazon Instant Video for a low fee.The only flaw with this device is that there is no Audio Out ports.  It would be great if someone could come up with a hack that if you plug in a Bluetooth dongle and have like a Bluetooth Wireless Speaker Adapter (Logitech makes this device), and a digital amplifier hooked up to a set of old stereo speakers, you could significantly enhance the sound. (Did I mention I like to do stuff with computers?)  But that seems to be the only flaw other than you might want to some sort of plastic screen cover to ward off the dust and prevent scratches to this pristine screen. Otherwise the cat or the kids will touch it with their dirty mits.Also, for the folks who don't know how to install the stand with the screws, remember: Lefty Loosy, Righty Tighty.  But I do agree, there should have been like an extra screw and a strong piece of fishing line to really secure it to the wall.Final pitfall, the mercury lamps lighting the back lights. If TV fall down and go boom, TV will need to be put into a plastic garbage bag before getting it fixed.To end this review, I would like to state dramatically **The day has come for an affordable HDTV/Computer Monitor that everyone can enjoy!**", "Date": "March 2, 2013"}, {"Title": "Perfect for kitchen,small bedroom,den!", "Author": "D. R. Ulmer", "ReviewID": "R13UTQQL8PL7EN", "Overall": "5.0", "Content": "I have researched this 22\" HDTV reviews and every source I could find. I was a little skeptical about the sound issues as being reported by other reviewers. I have to say,I was pleasantly surprised at the ease of setup and overall picture quality derived from digital cable. And the sound is what you would expect for a unit of this size. I realize that this is a 2011 model,but your eyes and ears will not be able to tell the difference between this set and a newer model. Running a bluray player through HDMI cable produces stunning audio/video quality! The bottom line:You can't go wrong with this Samsung HDTV! Get em while you can!", "Date": "February 27, 2013"}, {"Title": "Good TV", "Author": "Daniel", "ReviewID": "R1QKI58RPSV0OB", "Overall": "5.0", "Content": "We bought this tv to go in our bedroom. It works well for that placement. Not too large, but big enough. Sound works fine for the smaller bedroom as compared to a living room. Good picture.", "Date": "February 10, 2013"}, {"Title": "FAST DELIVERY", "Author": "cori stecher", "ReviewID": "R1QQ8102JA04WJ", "Overall": "3.0", "Content": "FAST DELIVERY TV IS NICE BOUGHT FOR KIDS ROOM THE ONLY THING I DONT LIKE IS THERE IS NO POWER BUTTON ON TV SO IF U LOOSE THE REMOTE YOUR SCREWED!!!! GONNA PUT A GPS DEVICE ON IT LOL", "Date": "January 30, 2013"}, {"Title": "Good TV, very poor sound", "Author": "Sherrinsford Holmes \"sford\"", "ReviewID": "R22CPTSCK8QA5T", "Overall": "2.0", "Content": "Limited features and poor sound make this a 3 star item.  The complete lack of customer support and amount of BS they put you through makes it one star.  I've been a Samsung guy for over 30 years, but this is my last one.  As far as TV's, it's better than LG.", "Date": "January 19, 2013"}, {"Title": "I like it.", "Author": "Lance Clauser Marine Service", "ReviewID": "R1J2E762TQLMOH", "Overall": "5.0", "Content": "I'd say above average picture quality and the sound is acceptable. I use an antenna [not cable] and the reception is very stable. I use it as a bedroom set so I don't have anything else hooked up to it.", "Date": "December 30, 2012"}, {"Title": "Excellent buy.", "Author": "Male College Student", "ReviewID": "R2FQ4Y5QHZZ0F7", "Overall": "5.0", "Content": "Please keep in mind that this TV's MSRP is around $250, and I purchased it for $188, and this heavily factored into me deciding on this TV. I got a lot of bang for my buck, as a college student I don't know if I would have spent the extra $65. However the price doesn't change the attributes of the TV. I got this to put in my mom's kitchen, its low enough for typical cupboards, but big enough that I can see sports scores from anywhere in the kitchen. The TV looks great, set up was incredibly easy, and its less that 2 inches thick, so it doesn't waste any space. Also, the differences between this and the 2012 model seemed minimal to me, especially in aesthetic appearance and how the back is set up. My only gripe is that the base is not as sturdy as other TV bases I've come across. However, it also does not swivel, and the base is perfectly fine when it's just sitting there. Another Samsung I am extremely pleased with.", "Date": "December 26, 2012"}, {"Title": "Loving it!", "Author": "Louisa \"Dawn to Dark Reader\"", "ReviewID": "R25L1ZI3FH6I32", "Overall": "5.0", "Content": "I have wished for the same HD quality for my office TV for months, and my husband made it my Christmas gift. It is small in size, but big in quality. I love the sharp definition of the screen image, and now I have the extra HD channels provided by my PBS station available while I pedal away on my bike.", "Date": "December 26, 2012"}, {"Title": "Bad for off-axis", "Author": "R. S.", "ReviewID": "RPWGZH9Y6EYF2", "Overall": "4.0", "Content": "Samsung makes the best TVs out there, bar none.  And yes, I do understand that small sets are notoriously bad for off-axis viewing, but this set is exceptionally bad.  Mounted it up high in my wife's bathroom and it is unviewable unless she watches in the mirror which adds a little distance.  But if you are viewing this set head-on, it looks amazing.", "Date": "December 21, 2012"}, {"Title": "Amazing", "Author": "Brinton Berg", "ReviewID": "R1S269P6240RFV", "Overall": "5.0", "Content": "Its small but gives a really good picture.  It is light and quite portable.  I really needed a tv like this.", "Date": "December 17, 2012"}, {"Title": "Great TV", "Author": "Jim Zilch", "ReviewID": "R1QRSQI2YWH9MH", "Overall": "4.0", "Content": "Great TV, Love the quality of the picture. The only problem I have is that I also wanted to be able to use it as a Computer monitor and it does not have a 15 pin connector (VGA) input for that purpose.", "Date": "December 11, 2012"}, {"Title": "Multiple task item", "Author": "Russ Mitchell", "ReviewID": "R9ODICLO7HF76", "Overall": "5.0", "Content": "Love Samsung and this met my standards.  I sit at the computer and watch this TV now connected to any cable. Regular indoor antenns and the picture is excellent.", "Date": "December 11, 2012"}, {"Title": "Love Samsung", "Author": "Frances R. Dickman \"Duchess of Westbury\"", "ReviewID": "R39FN1Q2W8FTJS", "Overall": "5.0", "Content": "This is my third Samsung TV and perfect.  I couldn't be happier with Samsung as they really stand by their televisions.  I know this because I had a problem with one a few years ago and they sent a repair person to fix it.  Never gave me a hard time at all.", "Date": "December 9, 2012"}, {"Title": "great and safe item", "Author": "alan", "ReviewID": "R32BUG5D99SZ3A", "Overall": "5.0", "Content": "Purchased for my 6 year old girl.The TV has a study design and I feel safe leaving my girl alone with it .She figured out the controler quickly Best bucks I have spent in a long time which is why I count on Amazon for all my electronics buys.", "Date": "December 8, 2012"}, {"Title": "Great buy, good TV", "Author": "Chris from the Midwest", "ReviewID": "R2ZGN0JMJX3NYM", "Overall": "5.0", "Content": "We bought this TV to go into a nursery, to compensate for those long nights of feedings and fussy babies.  It was out of the box and set up in less than 5 minutes.  Plugged in, DVD Player hooked up, and good to go.I am a big fan of Samsung TVs.", "Date": "November 26, 2012"}, {"Title": "uses hardly any electricity!", "Author": "albow", "ReviewID": "R1EGW7M1HIUEKD", "Overall": "4.0", "Content": "Yes it could use more connections, but the most important feature in a TV is the picture.  This set has a great picture with perfect tune-ability of color, sharpness, and everything else that makes the picture worthwhile. For the current price I think this set is hard to beat.", "Date": "November 24, 2012"}, {"Title": "Works great.", "Author": "kwilks", "ReviewID": "R9525ZRQKRULN", "Overall": "5.0", "Content": "Has a great picture, The sound is good, and remote is easy to use. Will recommend it at for general use.", "Date": "November 23, 2012"}, {"Title": "So far no problems", "Author": "Joe Scientist", "ReviewID": "R1W7MDT2WTYNEU", "Overall": "4.0", "Content": "This is my first HDTV.  I have had the product for about a month and no problems so far.  It is not hard to set up but it does take a long time for it to scan for active channels during setup.", "Date": "November 22, 2012"}, {"Title": "Good picture.  Sound is borderline", "Author": "CB \"Hi-Tech Red-Neck\"", "ReviewID": "R343N58CH8XKUG", "Overall": "4.0", "Content": "The picture on this TV is good, and it's extremely light weight - allowing it to be easily hung on a wall.However, the sound level is borderline.I put the TV into the fitness area of the basement.  When riding the stationary bike, or worse yet the treadmill, the sound from the built-in speakers is inadequate.  Unfortunately, there is no audio out port to even be able to connect external speakers. I was thinking of connecting external powered PC speakers, if there was even a headphone jack.  But there is no such option.", "Date": "November 19, 2012"}, {"Title": "Samsung UN22D5003", "Author": "J. Campbell \"souper\"", "ReviewID": "RQSBENYX1ZQ6", "Overall": "4.0", "Content": "I bought this for use in a small bedroom, and couldn't be more pleased. This unit has a 60Hz refresh rate, but with the 120 Clear Motion Rate, there is almost no visible motion blur. And, the picture is absolutely fabulous!!! , If there are any downsides, they would be (1) weak speakers  and (2) no audio out for use with external speakers (like a sound bar) . But, the speakers are adequate, and shouldn't deter anyone from buying this little gem.", "Date": "November 16, 2012"}, {"Title": "Samsung 22 TV", "Author": "Donna", "ReviewID": "R1QZKBCY1AGMIP", "Overall": "5.0", "Content": "Excellent bright detailed screen! Clear picture in different lighting. I am very happy with the quality of this LED TV.", "Date": "November 13, 2012"}, {"Title": "Not good for game playing.", "Author": "Worachart Pirunruk", "ReviewID": "R16CLMV6EV078Z", "Overall": "3.0", "Content": "A little bit slow when play game that use a lot of graphic. But overall look good. Sound is good. Good for movie.", "Date": "November 10, 2012"}, {"Title": "great little TV", "Author": "James Clark", "ReviewID": "R15YBPDTPGQHCI", "Overall": "5.0", "Content": "I ordered this TV for my room in a college apartment, its perfect for a small bedroom! I also use it to watch Netflix from my laptop, or watch hi def movies and the picture is phenomenal! Great buy!", "Date": "November 4, 2012"}, {"Title": "Lightest TV this Size", "Author": "Zack", "ReviewID": "R1XSLF6ZWL174M", "Overall": "5.0", "Content": "This was the lightest TV I could find at this size.  I have this TV hung from a wall in my travel trailer.  Easy to lift on and off the mount and move around.  The weight had to be low to not rip the thin travel trailer walls.", "Date": "October 31, 2012"}, {"Title": "excellent", "Author": "Reeves", "ReviewID": "R1ME6QQLA562LC", "Overall": "5.0", "Content": "Very much impressed with this product.  Arrived early and was very easy to install.  Would recommend it to everyone that wants a small screen LCD TV.  Thanks", "Date": "October 28, 2012"}, {"Title": "Quality Price and Picture is Great..Priced Just Right", "Author": "James", "ReviewID": "R2RGJA0CX3CJSK", "Overall": "5.0", "Content": "I was looking for a High Definition full 1080 TV just small enough to fit on my desk at work.  This fit the bill and it delivers an outstanding picture and is just right.  Remember it's not the main TV for the entire family and guest to watch...just right for individual use.  I enjoyed the picture and quality of this TV viewing Blu Rays Movies, it is the second one I have purchased, the earlier one was for the grand kids room.", "Date": "October 22, 2012"}, {"Title": "Great screen for the price", "Author": "MG", "ReviewID": "R2HC4XH7UZJG3P", "Overall": "5.0", "Content": "Samsung did a great job designing this unit. Thin/ narrow frame gives a full picture viewing area. Crisp clean colors and great clarity from the 1080p. Hard to beat all the features of this small unit for the price.", "Date": "October 21, 2012"}, {"Title": "Samsung 22 \" LED TV", "Author": "Stanley H. Jackowski \"Stan\"", "ReviewID": "R38O4PAKO93UV", "Overall": "5.0", "Content": "This is a neat little LED TV. I got it to replace a 19 JVC Stereo TV that was 20 years old. The sound is not quite the same but I have tin ears I'm told. Great picture and easy to set up. I would recommend this to any one wanting a small LED TV. I plan on getting a 24' LED TV for the kitchen replacing a regular TV with a LED there also. They are more energy efficient and great picture.", "Date": "October 18, 2012"}, {"Title": "Good", "Author": "Samantha Powell", "ReviewID": "R2DQDG3GPOZ231", "Overall": "4.0", "Content": "Arrived at a good time and is fine so far. It is a nice tv for a bedroom or bathroom.", "Date": "October 17, 2012"}, {"Title": "Samsung TV", "Author": "TamTam", "ReviewID": "R1S95C98HHQ723", "Overall": "5.0", "Content": "This is the third Samsung that we have bought. This one was purchased for our son's dorm room. Although smaller that the other TVs we have odered, it was the perfect size for his room at school. It was very easy to set up!", "Date": "October 12, 2012"}, {"Title": "Great TV.  Worth the purchase!", "Author": "Jeff", "ReviewID": "R38P4RII5R424B", "Overall": "5.0", "Content": "This TV is great.  We use it in our bedroom to replace an old 19\" CRT with builtin VCR that we had had for way too long.  The sound & picture quality are great. It is easy to set up and get going.  Plus, you get the brand recognition of Samsung which (in my opinion) puts out quality products.  Our main TV is also a Samsung and is awazing.Don't get me wrong.  If you are looking for a computer monitor or gaming system monitor, this may not be the TV for you however it isn't supposed to be. It's a TV not a computer monitor. If you are looking for a well priced, quality TV for a small space, this is the perfect fit for you.  Stupid me, I origninallywent with cost over brand recognition and purchased the Westinghouse 24\" LED TV.  The sound quality was so bad that I had to return it, even though I typically only listen to TV in our bedroom for 10min per night before I am fast asleep.  The sound was that bad that I couldn't handle it even for that short of time.Again, great quality TV with great picture, great sound and easy to set up and use.  You won't be disappointed in this.", "Date": "September 25, 2012"}, {"Title": "Good Price, Good TV", "Author": "No more scratching", "ReviewID": "RJIN2E3K7V1Z7", "Overall": "4.0", "Content": "Pleased with this model, has all you would want, except maybe the higher DPI. Not that heavy either, a good bargain for the price, but I would always buy new on a TV is had the option.", "Date": "August 21, 2012"}, {"Title": "Amazing picture and performance for gaming", "Author": "Brian V.", "ReviewID": "R28BV2F8Y82RNR", "Overall": "5.0", "Content": "I'm a gamer; Xbox 360, and I've been looking for the right gaming TV for sometime now. As a gamer I need high resolution, 1080p, and a good refresh rate to reduce motion blur. After adjusting settings for personal preference, the Samsung UN22D5003 provides the performance I need from a TV for gaming.This 22 inch Samsung TV provides a sharp picture and wonderful bright colors using an HDMI connection. Even though the TV is 60Hz with 120 Clear Motion Rate, it has no issue keeping up with the fast pace action of Battlefield 3.If you're looking for a great TV for gaming I strongly recommend the 22 inch Samsung UN22D5003. And yes some gamers prefer a smaller TV for gaming.Note: I don't use the built-in speakers. I'm using a set of Tritton gaming headsets for all audio.", "Date": "July 21, 2012"}, {"Title": "My Mom loves her new TV", "Author": "Amazoniac", "ReviewID": "R7VWPDE700VKT", "Overall": "5.0", "Content": "My Mom has never owned a flat panel.  So I thought i'd treat her to one on Mother's Day.  I did some research first about LEDs vs LCDs and read a few product reviews as well.  For the price point I was trying to be mindful of this was the best choice for me.  The tv arrived a little sooner than I was expecting so my Stepdad didn't get a chance to hide it for me.  Aww well, it all worked out and most importantly my Mom is happy.  She raves about the picture quality and the size is a perfect fit for her small bedroom.", "Date": "May 8, 2012"}, {"Title": "Nice Picture Quality", "Author": "Sik403", "ReviewID": "RVYEB1J8TQXKY", "Overall": "4.0", "Content": "Using this TV for a month now, I am impressed by the picture quatity. But one thing, you cant use the VGA cable directly with this TV, you need Component Adapter (BN39-01154W). Which charge $20.HDMI work perfects, no issues with this.Overall very impressed.", "Date": "April 23, 2012"}, {"Title": "Everything I expect from Samsung and more!", "Author": "deschene2k", "ReviewID": "R2HOM6BWZVCB4U", "Overall": "5.0", "Content": "I've been a Samsung fan ever since I bought my first cell phone, which was a Samsung, 15 years ago.Since then, I've had other Samsung phones, our home's primary HDTV, desktop computer monitors, a recent laptop and now this 22\" LED HDTV for our guest room.  This UN22D5003BF (okay, maybe their marketing people need to work on model names) has more than I need for connections, automatically detected my cable providers recently changed all-digial channel line-up including identifying and removing scrambled channels after the autodetect pass AND I didn't have to use their adapter box!  The picture is stunning (like my Samsung monitors and laptop).  Add the ease of removing any channels that I didn't want, naming inputs (for our old Samsung DVD player that got replaced with a Samsung Blu-Ray this past Xmas), it's automatic settings for everything from time to display brightness to picture format (based on input), etc. . . .  I couldn't be happier.  And finally, as always, Amazon.com came through on price and delivery yet again.", "Date": "March 27, 2012"}, {"Title": "Very Good but pricey for features", "Author": "marcodream", "ReviewID": "R28ODGWHSQX1HZ", "Overall": "4.0", "Content": "Great small unit although a little pricey for features and the sound is not great as with most all lcd and plasma tv's. Probably could have purchased a larger screen with same or more features at close to price paid !", "Date": "March 17, 2012"}, {"Title": "Nice Television", "Author": "John Stewart", "ReviewID": "R2LBAMWZHTS6MQ", "Overall": "5.0", "Content": "We are very happy with this television. We bought it to replace a similar one that gave up the ghost. The color looks good and it sounds good as well. We have this TV in a small guest room/sitting area connected to Dish Network.", "Date": "March 11, 2012"}, {"Title": "Very Satisfied", "Author": "B. May", "ReviewID": "R35U8SO5R076WE", "Overall": "5.0", "Content": "This was bought for my sons bedroom and has been a great little TV. All of our TVs are Samsung and never had any trouble with any of them.  Amazon got this to us exactly when they said they would - Love Amazon.", "Date": "March 11, 2012"}, {"Title": "VERY HAPPY WITH THIS PURCHASE", "Author": "LOVIN IT", "ReviewID": "R23OCPZ3PMFZVW", "Overall": "5.0", "Content": "THIS WAS A VERY QUICK & EASY SETUP & I AM VERY HAPPY WITH MY PURCHASE. PICTURE IS GREAT & SOUND IS GREAT", "Date": "December 24, 2011"}, {"Title": "I cannot hear it very well when on treadmill", "Author": "Francis Bacon \"Parrothead\"", "ReviewID": "R2B567RX8V1QFR", "Overall": "3.0", "Content": "I'm a big Samsung television fan as of the last few years.  I specifically looked at Samsung when my wife and I decided to 'upgrade' our workout room television set for Christmas 2011.  The picture quality is adequate for us.  Unfortunately, it sounds like the sound is coming out of a tin can (to me).  The sound isn't any better than the old clunker we are getting rid of.  Running the volume up to 100% still wasn't great.  I'm thinking - No problem, I will just buy a cheap pair of amplified computer speakers and plug them into the TV.  I couldn't figure out how to do it by the user manual so I'm thinking I have now become my grandparents trying to get that new VCR hooked up!  Anyway, I called tech support to help me with an obvious easy fix that I just couldn't figure out.  But No!  It turns out it cannot be configured for this simple solution!  So I'm going to return this television for this very reason.  I might upgrade to a slightly larger Samsung TV but I will pay closure attention to the speaker system.  Our 32\" Samsung in our bedroom has great audio quality.  I am a little hard of hearing so this television, in a quieter atmosphere, with someone with better ears than mine might be just what you are looking for.", "Date": "December 5, 2011"}, {"Title": "Misadvertised to the max but still a great display.", "Author": "Colton Hass", "ReviewID": "R2K7DBA79TPTKR", "Overall": "3.0", "Content": "This Tv is only 1920 x 1050 NOT 1920 by 108 which is full 1080p I realized this when Hooking up my Computer to the display and when I was in 1920x1080 There were pieces of the screen missing but When It was at 1050 It went right to the edge as it's supposed to. Also as for the 120hz Clear motion, This is another example where they say it is something that it is not just to market it to people. You cannot output 120hz video to this monitor(tv). It only shows up as a 60hz monitor. The 120hz marketing might be someway of making 60hz look better but it is not 120 Hz.That being said. This display is amazing It is a nice pixel density very good colors and the matte finish is always a big thumbs up. I am debating getting another for a dual monitor setup with my new computer I am building... We shall see.Also If your missing some options in the menu it is most likely because you are still in store demo mode... but most of you don't need to know that.", "Date": "December 4, 2012"}, {"Title": "Lack of Internet support", "Author": "Tony", "ReviewID": "R2NKGVGA4ED4XM", "Overall": "3.0", "Content": "I have been on the watch for a small HDTV with wi-fi or ethernet connection. As I browsed thru amazon's internet ready products I got excited to find this samsung product at the price it was. Only to be disappointed with further research to find this particular model does not support any kind of internet connection not even with a USB adapter.Pro: Based solely on other reviews this product works well as a second monitor after finding it's feature to optimize specifically for use with computer via HDMI.con: If you live with multiple people, like in a dorm room for college, this NOT having the AUX out put for sound could cause some turmoil between you and your roommate.", "Date": "August 29, 2012"}, {"Title": "No power after 2 months", "Author": "Lawrence J Zaker", "ReviewID": "R35SAWNBPJQCY0", "Overall": "2.0", "Content": "After having owned the television for 2 months, there is no power to the set and it has to be mailed back to New jersey.", "Date": "May 8, 2012"}, {"Title": "Pretty good.", "Author": "AEJ", "ReviewID": "R195Z2Y5Z458IC", "Overall": "4.0", "Content": "I bought this TV after reading some good reviews. When I bought it, I was led to believe that it was a 120hz set, as was stated in the description until just a few days ago. It is a 60hz set in actuality. I'm unhappy about this, but it's not the end of the world.Pros:*Thin and light, as it's supposed to be.*HD media looks very good.*Holds colors very well from side-to-side angles.*Volume is very sufficient for the smallish room it is in.*Sleek design.*Very low electricity consumption.*Fairly inexpensive.Cons:*Not 120hz, as advertised.*Non-HD media looks anywhere from crummy to just okay/kind of good. From my reading, this is not restricted to just this set, and is prevalent in many HDTV monitors.*Picture washes out quickly when viewed from even slightly below or above level.*While cost is manageable, there are similar sized(even slightly bigger) sets that cost $10-$20 less, though I cannot comment on their comparative quality.I like this TV. I do wish that the original description had been accurate, as I spent more on this set for a feature it did not in actuality have. For non-HD media, I usually have to scale down from the 16:9 ratio to 4:3 ratio to make it look good enough to not be bothered. As stated though, this is a widespread problem with many HD type TV's and monitors. I personally paid $249 for this set, and it has since been as low as $239. I think it is a pretty decent product for either price.Thank you for reading.", "Date": "January 30, 2012"}, {"Title": "Gaming TV", "Author": "Phan", "ReviewID": "R1SYGCZ9T9J9KY", "Overall": "5.0", "Content": "After playing on a old SDTV for 5+ years, I decided it was time for an upgrade. I wanted a TV big enough for my room, but not big enough that it'll hurt my eyes(I can't play on big TVs). A 22\" was the perfect size for me. The TV arrived in perfect condition and took less than 10 mintues to set up. I've had the TV for about 2 weeks now and have not been disappointed. I bought this TV for gaming, and so far, I have not notice any controller lag. I would defintely recommend this TV to any friends. Also, I haven't noticed the \"wobbly stand\" that the other reviewers have commented on.Pros:Great, clear graphicsGreat soundNo controller lagCons:NOT 120Hz as advertisedNo headphones jackOverall: I am completely satisfied by this purchase and would purchase it again if given a second chance.", "Date": "December 2, 2011"}, {"Title": "not real 120hz", "Author": "Jake", "ReviewID": "R18RP6M7LXTKVS", "Overall": "2.0", "Content": "This is not real 120hz. I purchased it with the intent of using it as a computer monitor in 120hz. Not only that, but it did not come with the screws to attach the monitor to the stand.", "Date": "September 28, 2011"}, {"Title": "Very disppointing", "Author": "sedels", "ReviewID": "RV9RTLL3SVQI3", "Overall": "3.0", "Content": "I wanted a 1080 bedroom TV. The reviews of all the smaller TVs (26\" and under) are at best mixed on the sound quality, so I took a chance on this set. I found the sound unacceptable. My spouse commented that it sounded like a speakerphone. Because there is no audio out jack of any sort, I couldn't easily use external speakers I returned it immediately and exchanged it for the 720p Samsung 26EH4000. The sound was vastly improved (not to be confused with good) and was listenable. Good picture quality. If you have the space for the larger set, I strongly recommend moving up.", "Date": "December 6, 2012"}, {"Title": "Great price for a Multi purpose high end TV.", "Author": "Charles", "ReviewID": "R1CBTTOU29JJFW", "Overall": "5.0", "Content": "This is my first 1080p TV and I've happy I purchased this TV. I did my research about high quality smaller TV sets and this is one of them for sure.There are multiple HDMI ports and the screen has a touch power and setting buttons if you don't want to use the remote which has a nice look to it as well. The abundant settings to mix and match to what you want as your display is perfect as well. I've been using this HDTV for gaming, my PC display, and watching TV shows and movies as well and all of these uses work great with this TV.The display is crystal clear and it turns off on it's own if left on to long which is great if you just happen to forget to turn it off. The stand is also sturdy and not easily knocked which is great since my desk is somewhat wobbly.The only downside to this TV is that there is no audio jack for headphones on this TV, but that really isn't much of an issue for me since I'm using a headset that uses the TV's composite input.", "Date": "November 26, 2012"}, {"Title": "head on view only", "Author": "Lawrence Bernier", "ReviewID": "R2XXOUV4XIR3KI", "Overall": "2.0", "Content": "This TV has a good picture ONLY when you watch it head on.  The picture gets worse as you move from the straight on viewing.  I am very disapointed .  I expected better from Samsung.", "Date": "April 24, 2012"}, {"Title": "as advertised", "Author": "Devon Ross Telford", "ReviewID": "R3LHRM3QXXW3KL", "Overall": "3.0", "Content": "with the exception that it isn't 120 hz.  it was 120 clear motion rate...  but when setting up the tv it only said it was actually 60 hz", "Date": "November 27, 2011"}, {"Title": "works", "Author": "NekoLLX", "ReviewID": "RMQI0PBYZMDZP", "Overall": "4.0", "Content": "It has some odities on some channels no matter what mode you use it in and cuts off the edges but has a crispt and clean look and signal. Get it and enjoy.", "Date": "May 8, 2014"}, {"Title": "Very good small screen TV", "Author": "Scott Oran", "ReviewID": "R11ZRC86IIJP5N", "Overall": "4.0", "Content": "We use it in our kitchen, and it is perfect for the small area we have it in. The picture is excellent and it serves our purpose for watching while cooking and eating meals. We own another larger screen Samsung TV, and are very pleased with that TV too.", "Date": "March 27, 2014"}, {"Title": "No audio output", "Author": "ortzinator", "ReviewID": "R3LXLT614L6XI4", "Overall": "4.0", "Content": "Great little TV. Only a few complaints:-No audio output.-The base is very wobbly. It wobbles almost and inch from side to side.-The buttons on the front are impossible to see in low light. I had it for weeks before I realized it even had buttons. This isn't usually a problem because I usually use the remote. The remote, by the way, is very good. One of the best I've used in a while.", "Date": "March 8, 2014"}, {"Title": "Love it", "Author": "William A. Broderick", "ReviewID": "R2XPYNKCWZ4O61", "Overall": "5.0", "Content": "Quite a bargain.  Easy to setup, easy to use.  Everything shows very well.  Integrates very easily with my sound system.", "Date": "February 22, 2014"}, {"Title": "I love this TV", "Author": "David", "ReviewID": "R3HQ2VOV7GWCK2", "Overall": "5.0", "Content": "I bought this tv for my son who is an occasional gamer. He uses it for XBOX, WII and TV. This product has all the connections you need to run a great envornment for a small room or as an extra computer monitor for work or home. Samsung has produced a great product. Offers very deep blacks and very bright screen settings. The speakers are phenomenal. I never let my son set the volume past 17 (goes to 50 i believe). He can connect cable box, Xbox and wii all at the same time, and if he had a computer he could add that to the input as well.This TV also offers a digital player that will allow you to play your digital movie copies from an external hard drive. You can control the movie like a dvd player from the remote, once inside the environment. This has proven to be a great tool to have when you have kids that dont put dvds away after they watch them. It has allowed us to preserve the dvd while still allowing my son to watch his movies.If i had a quarrel with this TV it would be the backlight. It isnt noticeable when you have an input running (TV, Game), but when it is a black screen, you can see the white lights behind. A very nit picky observation, but not enough for me to drop it to 4 stars. Great TV that offers a lot of versatility.", "Date": "February 17, 2014"}, {"Title": "Great Price", "Author": "Kevin R. Mullins", "ReviewID": "R3MP5SV20WNKYW", "Overall": "5.0", "Content": "This product arrived on time and was ready for deployment right out of the box.  The setup was easy and the quality of the display is great.", "Date": "February 7, 2014"}, {"Title": "Samsung TV 22\"", "Author": "Michael V", "ReviewID": "RAW4T9DXN96AR", "Overall": "5.0", "Content": "Great little TV for my needs. Nice picture, and the sound not bad at all. Great price and features. This TV fits perfectly for where I have, and so far no problems.", "Date": "January 25, 2014"}, {"Title": "What can i say? Love this thing", "Author": "Tommy L.", "ReviewID": "RUS8CSPVFZWU3", "Overall": "5.0", "Content": "This TV is perfect for me, might even passed this down to my sis or cousin so i can purchase another one. this displays the content great in 1080p. my recently purchased Chromecast is beautiful, my games like The Last of Us and God of War look wonderful. Remote is comfortable to hold if anyone wondered lol. Overall my experience with this TV is a 10/5. Greatly Satisfied.", "Date": "January 10, 2014"}, {"Title": "Not happy;(", "Author": "Star Postell", "ReviewID": "R2CZYQIL608JLT", "Overall": "1.0", "Content": "TV was great until it started turning its self off and on over and over again. I'm very upset I paid more to have a name brand and all I got was a tv that isn't sure if it wants to stay on or not;( my husband read some reviews on different websites and found that there is a problem with this and they will warranty it if u pay to ship it off and wait several months for them to fix it and send it back;( not happy", "Date": "January 1, 2014"}, {"Title": "Great picture, but...", "Author": "M. Corvin \"Corvinus\"", "ReviewID": "R3BU84TGS7QDFC", "Overall": "3.0", "Content": "I was looking for a 1080p tv to go above my wife's tub that was not too big (wide) and low profile (thin). This was literally the only tv that had these specifications under two feet wide that I could find.Hooked it up and had a really great pic and vibrant colors, but.,,The viewing angle sucks. I mean terrible. If you mount this tv on a wall up high (4-5 feet up) and you are sitting in a chair or in the ground the picture goes a blackish purple and what was beautiful now looks awful.So great picture and great price, but you need to have it on a tabletop or down low, parallel with your eyes, or you will be sorely disappointed.", "Date": "January 1, 2014"}, {"Title": "The Perfect Kitchen TV", "Author": "A. Moskowitz", "ReviewID": "R16YD0QNE2K61C", "Overall": "5.0", "Content": "I did my research on many TV's to find the right one to replace the old 15 inch (diameter) TV. I wanted a TV that was at least 19-22 inches (diameter) and discovered that most 19 inch screens were only 720p.  My research found that there were ample models available with 1080p in the 22 inch (and above) models and that is where I maintained my focus. I decided to stick with what I know, and went with Samsung models, since I own 4 other Samsung models of various sizes, and have never had a problem.This TV was ready to go, out of the box, and sat perfectly on the counter, with setup taking only minutes. I spent $50 on a GOOD \"Monster\" HDMI cable, to make sure my picture quality would remain 1080p \"quality\".Needless to say, the TV works flawlessly, and the picture quality is exceptional. I have read other reviews that stated the base was \"wobbly\", but I have not had similar experience thus far. This is another solid purchase, if you are looking for a reliable Kitchen TV that has a respectable viewing screen. It also has a low profile, and fits easily under my cabinets.", "Date": "December 28, 2013"}, {"Title": "Love this TV", "Author": "M. Miller", "ReviewID": "R29XX307SUDO4L", "Overall": "5.0", "Content": "I love this TV and very pleased with this purchase. Great picture quality and perfectly suited for the guess bedroom.", "Date": "December 28, 2013"}, {"Title": "Excellent TV", "Author": "B. A. Schultz", "ReviewID": "R2F21JXTSXMLT2", "Overall": "4.0", "Content": "No complaints on this TV. The sound could be crisper but who really cares. It's a basic TV that could even be used for a monitor. It's perfect for our family room. We view movies on our larger set.we have another Samsung and it has proved to be a reliable brand. An excellent TV for the price.", "Date": "December 26, 2013"}, {"Title": "Would have returned it", "Author": "Woodshop Man", "ReviewID": "R22T25P4W2AIBA", "Overall": "1.0", "Content": "I would have ordered a Sony TV in the first place, but Sony didn't have one that fit under our kitchen cabinets.This TV has good color/sharpness in the DVD mode, but terrible in the cable mode. My previous tube type Toshibadidn't have this problem, so it's not the cable setup.On cable, it has a definite greenish ghosting.Now one of the HDMI inputs have failed in this TV and I'm forced to have it serviced.I would have sent it back, but it was a gift to my wife (she loves to watch NCIS while cooking) and so the 30 day return period had expired by the time I gave it to her.I'll probably end up using this TV down in my bar and getting her a new one.I will never buy another Samsung again.", "Date": "December 21, 2013"}, {"Title": "Know what size you need", "Author": "D from Norhole", "ReviewID": "R206JPRZPNU22S", "Overall": "5.0", "Content": "A word of advice to people considering this TV. Know what size you need. Bought this for my grandmother to use in her bedroom. I haven't bought a TV less than 40 inches since they all went wide-screen. If you are using this in a kitchen or somewhere where you will be viewing it within 5 feet, it'll be a beautiful TV. Lots of features and great picture. However, it didn't work for what I needed it for. Ended up buying her another TV (40 inch) for her bedroom and hooking this up as a computer monitor. Works great for that too because I was able to clear room off her desk by getting rid of the speakers. Overall, great TV just know what size you need.", "Date": "December 16, 2013"}, {"Title": "A great buy!", "Author": "Amy Ludtke", "ReviewID": "RXOS78CDEFHPY", "Overall": "5.0", "Content": "Great TV and a great buy!  Works perfect in a teenagers bedroom.  Nice picture, cable ready, and really sleek too!", "Date": "December 9, 2013"}, {"Title": "Nice small TV", "Author": "Glenn Graham", "ReviewID": "R3T03S867LNKRU", "Overall": "5.0", "Content": "Super TV, love it in the office. Perfect size. Only complaint is that there's no aspect ratio/zoom setting that matches the Comcast digital broadcast size perfectly. If you don't zoom (full image) there's a slight black line at the top and bottom (meaning that the picture has a wider aspect ratio than the TV). So I zoom the image which does two things. It zooms in and appears more like the image on maybe a 34 inch TV. But now you don't get the edges of the image and for many sporting events the score is partly off the screen. Also max volume level is just adequate, not great. But sound quality is excellent, so I'd rather have quality over loud noise. And the price was a great bargain, getting it on sale during the holidays.", "Date": "December 8, 2013"}, {"Title": "small and dark", "Author": "Dmama05", "ReviewID": "R2J2343W6VR1GA", "Overall": "3.0", "Content": "Bought for our bedroom and its a lot smaller than expected. We have it sitting on our dresser and unless you are eye level with it you can see anything on the screen.  Just doesn't work well for our space.", "Date": "December 2, 2013"}, {"Title": "Clear bright picture.", "Author": "D. Jenkins", "ReviewID": "RKNNCQSIEXYTP", "Overall": "5.0", "Content": "I bought this because I am so happy with the Samsung wide-screen LED TV I bought last year. Great picture, great performance.", "Date": "November 16, 2013"}, {"Title": "Just what I needed", "Author": "Randy", "ReviewID": "R20L0M87C4GW6D", "Overall": "4.0", "Content": "The sound leaves a little to be desired, thus the -1 star. However, for my purposes (X-Box 360 and DVD's), this was a great deal. I've had no stability issues, which some other reviewers have mentioned.", "Date": "November 6, 2013"}, {"Title": "Userfriendly out of the package", "Author": "Dio Genes \"art poet\"", "ReviewID": "RWBE1D3Z2MHY0", "Overall": "4.0", "Content": "The TV was so light weight, that I could carry it with no problem. I put the TV together as simple as 1, 2, 3", "Date": "September 12, 2013"}, {"Title": "Great picture and love the HDTV", "Author": "Mary Ruth Richards", "ReviewID": "RETIFMEY32N3E", "Overall": "5.0", "Content": "This TV was purchased for a guest bedroom TV.  It is the perfect size for this and I use it a lot when needing a retreat.", "Date": "August 20, 2013"}, {"Title": "Excellent", "Author": "Matt Lynch", "ReviewID": "R3KINWH0E3A647", "Overall": "5.0", "Content": "Phenomenal price, no defects. Great picture quality, especially for its price. Easy installation and seamless use. Recommended buy. Thank you", "Date": "August 20, 2013"}, {"Title": "Samsung 22 inch TV", "Author": "Joan Vandermolen", "ReviewID": "RMEQL8WPINBGJ", "Overall": "2.0", "Content": "This is a good product , but it was too small for my bedroom. I returned this one and purchased a 32 inch TV.", "Date": "August 10, 2013"}, {"Title": "Quality LED TV", "Author": "Donald L. Anderson \"sticks\"", "ReviewID": "R1WARASKY17OBI", "Overall": "5.0", "Content": "Picture is very good as I am using this TV on basic cable hook up.  Light weight with easy to use menu and controls.", "Date": "August 10, 2013"}, {"Title": "problems with assembly", "Author": "Vince", "ReviewID": "R2M0O4H39JYXMF", "Overall": "3.0", "Content": "Unit had a damaged base when received and had to call tech support to repair.However, they sent the correct part to repaid the unit and it worked fine.", "Date": "August 8, 2013"}, {"Title": "Samsung TV", "Author": "Dan Stowell", "ReviewID": "R1PTPH1YF3XM55", "Overall": "5.0", "Content": "Perfect TV for my garage shop. Just added a HD converter, and the HDTV picture is outstanding. I highly recommend it.", "Date": "August 4, 2013"}, {"Title": "Nice TC , Great Picture", "Author": "Paul F. Fraser \"Freddy Fraser\"", "ReviewID": "R2Y79PCKYVX8BH", "Overall": "4.0", "Content": "Better than expected. Have this hooked up to reg coax at a vacation house and still te pic is very good.", "Date": "August 2, 2013"}, {"Title": "Couldn't ask for more", "Author": "Jehovah T.", "ReviewID": "R35FQ817ISL0W9", "Overall": "5.0", "Content": "I bought this tv to use as a monitor for my desktop and the two go together perfectly. I also stream movies off of netflix so the 1080p is really useful. The size is great for my room. I have a friend who has one of those huge tvs in his room and I think it's a bit of an overkill so when buying, I kinda wanted to go for something smaller. My opinion, the big tv's should be in the living room. Anyway, another thing I love about this tv is how light it is. Almost doesn't feel like you're carrying a tv at all. The sound quality, however, isn't the best, but it's not bad either. Guess it's really up to the owner's opinion on the sound quality. Anyway, one bad thing about this tv, and I'm assuming it's because of how light it is, is that the tv is very wobbly on its stand. Bump the table that it's on top of and the tv will shake enough to worry you, so be careful with this thing. Overall though, I'd recommend buying this as a bedroom tv or desktop monitor. Just don't let kids too near it.", "Date": "August 2, 2013"}, {"Title": "SAMSUNG UN22D5003 22-IN TV", "Author": "RICHARD T HALL", "ReviewID": "R3F8FW7STGJ9C0", "Overall": "2.0", "Content": "THIS TV IS GOOD LOOKING AND HAS GOOD FEATURES BUT IF YOU DO NOT HAVE A HD DIGITAL CABLE BOX YOU DO NOT WANT THIS TV. THE PICTURE IS PRETTY SHARP BUT THE COLOR QUALITY IS NOT GOOD.  MDMALLERS@COMCAST.NET", "Date": "July 31, 2013"}, {"Title": "Great purchase", "Author": "Music lover", "ReviewID": "RKFXEM94RYA1D", "Overall": "4.0", "Content": "I like my new small TV. My old one did not have the HDMI cable slot. The only drawback I see is that it stays on all the time, even when it's turned off. I guess the energy consumption is minimal, but it's different.", "Date": "July 29, 2013"}, {"Title": "Awesome TV!", "Author": "Elizabeth McFarlane \"Your friendly American\"", "ReviewID": "R79IM2P32U9SM", "Overall": "5.0", "Content": "I got this around Christmas from parents in 2012 and I've been playing my games on it ever since.Pros:1080p HD (just like what it says)2 HDMI ports (I love that because I can have my PS3 and my Xbox hooked up to it)Stunning graphicsIt arrived fast is what my mother saidKind of cheap! Very inexpensiveCons:I really don't consider this as a con, but I will just tell you anyway.While I was playing Hitman: Absolution (over like 6 weeks ago) the graphics were really crappy on that game on the Xbox version on my TV. So I really don't know if it's the TV or the game...Overall: I give this 5 stars, it is a wonderful TV for your bedroom and for gamers! Get it!", "Date": "July 26, 2013"}, {"Title": "every thing I need", "Author": "Dennis", "ReviewID": "R2YBS4RH0JXGPA", "Overall": "5.0", "Content": "The picture quality is great and the size is right for my needs. I game alot so I was very happy with the picture quality and responsiveness.", "Date": "July 22, 2013"}, {"Title": "Samsung UN22D5003 22-inch 1080p 60Hz LED HDTV (Black) [2011 MODEL]", "Author": "Yolanda Taylor", "ReviewID": "R89M1RTX2M1RX", "Overall": "5.0", "Content": "My grandson loves his tv. Works great!!Just the right size for him.Mostly uses it for his video games but likes the color on his cartoons.", "Date": "July 16, 2013"}, {"Title": "decent tv for the price", "Author": "Diane Vogel", "ReviewID": "RWSU3Q0JOM8UA", "Overall": "4.0", "Content": "picture quality is crisp and vivid.  sound quality is mediocre (when watching tv, sounds like you're in a tunnel a little).  purchased this tv for the spare bedroom primarily to connect video game console to (to get them out of the living room).  it fits the purpose great.  quality product for the price.", "Date": "July 16, 2013"}, {"Title": "Good TV", "Author": "Jaeg", "ReviewID": "R1RR3TWR842RFP", "Overall": "5.0", "Content": "This TV is the perfect size for our guest bedroom.  It works well, and we are happy with this TV.", "Date": "July 9, 2013"}, {"Title": "Good little TV", "Author": "L. Robinson \"ababyvoice\"", "ReviewID": "R1VYCFI6BNU6TT", "Overall": "4.0", "Content": "Has a great picture. The sound seems a bit low even when increasing the volume. The TV seems smaller than 22 inches. This is a good TV for a small space.", "Date": "June 18, 2013"}, {"Title": "Excellent for a small space.", "Author": "RickyZ", "ReviewID": "RHLGIVSACGPF9", "Overall": "5.0", "Content": "Excellent picture, good sound. unobtrusive graphics (i.e. volume). I have this mounted on a wall so I cannot vouch for the stand that it comes with, but I would recommend this TV.", "Date": "June 14, 2013"}, {"Title": "Very good", "Author": "Cyn", "ReviewID": "R3MB4CFRCWSMF2", "Overall": "4.0", "Content": "The Tv worked perfectly, with absolutely no problems. It was the Correct size & came with all the right pieces. Overall I am satisfied.", "Date": "June 11, 2013"}, {"Title": "Kitchen TV", "Author": "Susan Stachura", "ReviewID": "R363MQBOTY8UNJ", "Overall": "5.0", "Content": "I do a lot of cooking and baking; and I have to watch tv while I work.  This tv works great with an apple tv,as I don't have cable in the kitchen.", "Date": "May 30, 2013"}, {"Title": "tv", "Author": "Ms. Lucille A. Artuso", "ReviewID": "R17LSCC938VJOE", "Overall": "5.0", "Content": "I was very happy with my purchase.  The tv works greatand it fits right where i needed it to", "Date": "May 23, 2013"}, {"Title": "Perfect TV for my desktop computer", "Author": "Mew", "ReviewID": "RVCVDLQXHJQAQ", "Overall": "5.0", "Content": "I was searching for a decent-sized monitor for my home desktop computer. But I needed something that would be reasonably priced and have a reputable brand name. Inquiries at my local electronics/appliance store yielded fruitless results. I finally found this Samsung 22-inch LED HDTV and am incredibly happy with my purchase. I'm able to do the work I need to on my desktop computer., and the fact that this is an HDTV allows me to High-Definition movies!", "Date": "May 22, 2013"}, {"Title": "NICE MONITOR", "Author": "James Henry", "ReviewID": "RQSXBTAQ0DPNI", "Overall": "5.0", "Content": "WHAT CAN I SAY IT WORKS AS A TV AND MONITOR, VERY HAPPY WITH PURCHASE AND WILL SAVE THIS BUYER..", "Date": "May 20, 2013"}, {"Title": "OK for the price", "Author": "Burt", "ReviewID": "R2W7RXXG2L7ZTK", "Overall": "3.0", "Content": "Works good, viewing angle critical for good picture. Purchased for use in an RV so the size was perfect for the location.", "Date": "May 10, 2013"}, {"Title": "Samsung TV", "Author": "Kerry B. Sparks", "ReviewID": "R1O8IL7WS2UA91", "Overall": "5.0", "Content": "I love this Samsung 22-inch TV.  It is perfect for my kitchen when I am preparing dinner so that I can keep up with the news at dinner time.  I would recommend this product.", "Date": "May 6, 2013"}, {"Title": "Amazing", "Author": "chucky", "ReviewID": "R39PTM5PH4HHG3", "Overall": "5.0", "Content": "This a great TV for the price. The picture quality is beyond expectations.It fits great on the cable receiver in my bedroom. The size is great since I didn't want to mount it.  I have no complaints.", "Date": "April 29, 2013"}, {"Title": "great colors easy to use", "Author": "saulsays", "ReviewID": "R65Q3CZ41L2KR", "Overall": "5.0", "Content": "best reception when using an hdmi cable rather than standard coaxial cable for hd programming. some channels still do not televise their programming on 1081 which means that not all channels will use this TVs full potential.", "Date": "April 27, 2013"}, {"Title": "Excellent small HD TV", "Author": "daveb", "ReviewID": "RLFGP8GAD5KPF", "Overall": "5.0", "Content": "This is a very affordable small TV, and is ideal in a small room while viewing at a distance of 3 to 6 feet.  The picture quality is top notch, and looks as good as a 120hz TV.  While the sound quality is not good on the default settings, tweaking the equalizer as others have suggested for Samsung TV's works well.  Great value.", "Date": "April 23, 2013"}, {"Title": "Nice TV", "Author": "Kathy in Boston", "ReviewID": "R850ZYS2LDYA", "Overall": "5.0", "Content": "I got this TV for my bedroom. When I received it, I thought it might be too small; but the picture and resolution are great, so this TV worked out just fine.", "Date": "April 23, 2013"}, {"Title": "Great picture", "Author": "Cypress Cowboy", "ReviewID": "R1YI0RJSGIL7T5", "Overall": "4.0", "Content": "The picture quality is very good.  Disappointed  that I ordered the smaller TV for my purposes.  Obviously my fault, but my wife loves it so its a winner.", "Date": "April 22, 2013"}, {"Title": "Great TV 1080p & 120hz True Motion Technology", "Author": "Trunkzdbz", "ReviewID": "R24HNTINVWXMR1", "Overall": "5.0", "Content": "Samsung UN22D5003 22-Inch 1080p 60Hz LED HDTV (Black) [2011 MODEL] This TV is great for a small bedroom or for a computer monitor, the stand is perfect for the TV so don't pay attention to the negative reviews on Amazon about the weak stand thats a lie. I bought this TV for my mothers 59 birthday and she loves it, it has a great picture at 1080p you can't go wrong and it is a 120 hz true motion picture TV many on Amazon say its not there wrong it comes right on the box 120hz true motion technology so it is a 120hz TV, for this price its awesome. The TV looks elegant and fits snug anywhere in your room its black is nicely done all around. All in all a 10/10 for me.", "Date": "April 21, 2013"}, {"Title": "Samsung TV", "Author": "AJG \"BIG BLOCK ARNIE\"", "ReviewID": "RH64N3J66FT24", "Overall": "5.0", "Content": "I chose this rating because the televisions perform just as we expected a Samsung TV to perform. No regrets, we Love them. Thank you for two great TV's and great service.", "Date": "April 21, 2013"}, {"Title": "very nice", "Author": "VICKIE", "ReviewID": "RGB1BWYJ04A99", "Overall": "5.0", "Content": "I love this tv its just the right size for our bedroom. It's easy to setup an the auto scan picked up channels I never saw before.", "Date": "April 20, 2013"}, {"Title": "samsung", "Author": "josephine gonzalez", "ReviewID": "R3KWQUOVXSL50L", "Overall": "4.0", "Content": "The TV is clear and the price was inexpensive but worth thebargain.  I haven't had any problems with the TV.", "Date": "April 17, 2013"}, {"Title": "Love it!!", "Author": "Margaret A. Miller", "ReviewID": "R30UIIG8ZBV2IM", "Overall": "5.0", "Content": "I wanted one to fit into a niche in my kitchen.  This fit perfectly and it gets all the channels with a lovely picture too.  We love it!", "Date": "April 17, 2013"}, {"Title": "Great item", "Author": "Douglas Barnes", "ReviewID": "R1AEXIK6GIIZVF", "Overall": "5.0", "Content": "I use this as my tv and Computer monitor. It was real easy to hook up and it has a great picture.", "Date": "April 16, 2013"}, {"Title": "Perfect", "Author": "DrewHasty", "ReviewID": "R3L29F7K20L7O1", "Overall": "5.0", "Content": "I bought this tv for my daughters room.  I hung it on the wall with a small mount I also purchased from Amazon.  This tv is perfect for my daughter.  Excellent picture and great sound.", "Date": "April 14, 2013"}, {"Title": "nice tv for bedroom", "Author": "norma jean kringer", "ReviewID": "R33NJC7U5Y6BFQ", "Overall": "5.0", "Content": "I needed a tv for my bedroom and found this little cutie.  I do think I would rather have a larger one but bought it on a fair deal and I can always move it around somewhere else but I'm not sorry I have it as the viewing is sharp and I don't need to mount it.", "Date": "April 12, 2013"}, {"Title": "excelent tv for the price", "Author": "Oseas V. Vazquez", "ReviewID": "R3IEDDHV3FM0I2", "Overall": "5.0", "Content": "It has been a good experience to use this tv. It meets all my expectations. I would highly recomend this product.", "Date": "April 11, 2013"}, {"Title": "Great bedroom TV", "Author": "Joan S. Hickey", "ReviewID": "R1NBLZLUTW3N3J", "Overall": "5.0", "Content": "I was looking for a smaller TV for our bedroom.  We only use it to watch the news and weather when getting ready to go out. This is perfect.  The picture is a great size and very clear.  The remote is easy to use.  It is unobtrusive because of its small frame. I am very happy with my new TV.", "Date": "April 9, 2013"}, {"Title": "XBOX 360/Desktop Monitor", "Author": "L. Snyder", "ReviewID": "R1H40C9TU3CCB3", "Overall": "4.0", "Content": "First, I have to say, this thing is freaking beautiful. The screen rates are great, colors are good and It literally brings a depth to anything you are looking at. I like in a one bedroom apartment for college and the size is a perfect balance for comfortable viewing, gaming or writing essays with multiple documents open. The number of HDMI ports is a blessing and makes cabling much much simpler. With all of this in mind here are some problems that I had.1) you have to set up each input to format what type it is receiving. I.e. HDMI1 is \"game\" and HDMI2 is a pc connection. If you fail to do this the picture quality goes down and even makes text blurry.2) There is not a dedicated audio in for the \"HDMI/DVI\" connection which effectively means that if your desktop does not have an HDMI port your desktop audio cannot run through the TV speakers without an additional converter (around $30 more dollars). For myself, I use a DVI to HDMI cable and wear headphones. If your computer has an HDMI out this will not be an issue however alot of desktops these days have DVI instead (CURSE YOU DVI).3) the stand is kind of short, it was awkward for me when it was sitting on my desk so I use a little stand that the TV and stand sits on. Purely preference.4) the curved nature of the remote means that it falls of of any edge you place it near. Late night viewing can be a hassle as the buttons are not lit and everytime it falls off of the counter you have to go hunting for it.All in all, I gave the product 4 stars, I bought this item on sale and I love it, totally worth the purchase. While there are some \"cons\" with the product they are mostly preference based and probably will not effect most users.TL:DRGreat for xbox/pc/PS4 users as long as you do not use DVI connection. PRETTY.", "Date": "April 6, 2013"}, {"Title": "Es un artefacto muy útil y bonito", "Author": "Pedro", "ReviewID": "R22MMMTOJX20YB", "Overall": "5.0", "Content": "La televisión es muy bonita, tiene una imagen lúcida y nítida, los colores vivos, el sonido bien modulado, es práctico para un dormitorio en donde se lo pueda empotrar en la pared, el control remoto tiene buen alcance, me gustó mucho el aparato.", "Date": "April 6, 2013"}, {"Title": "Great TV", "Author": "Kathleen Baete", "ReviewID": "R1ECTM0RJ2RKRG", "Overall": "5.0", "Content": "I am so pleased with my Samsung 22 inch TV.  It was delivered in perfect condition, right when they said it would be, even gave me a tracking number to track it.  I set it up myself, couldn't be easier.  The picture is clear and sharp and I am very pleased with it.", "Date": "April 6, 2013"}, {"Title": "Nice little TV", "Author": "Desmond H. Pierre", "ReviewID": "R2GQ5B3QB8U6M0", "Overall": "5.0", "Content": "Nice little TV, i was even considering getting the same model in a bigger size like a 32 to 40 inch. My only complaint is that you can't use headphones on it or computer speakers for that matter. But the audio is pretty decent for a flat screen.", "Date": "April 5, 2013"}, {"Title": "Picture quality, automation and audio.", "Author": "Thorleif Knutrud", "ReviewID": "R3EUUMYDFP1O1Y", "Overall": "4.0", "Content": "The picture is excellent, the automatic features are very helpful to set it up for your particular TV/Cable and other applications. The audio was a slight disappointment, I suggest the use of separate loud speakers.", "Date": "April 1, 2013"}, {"Title": "Nice !", "Author": "S.HBurk", "ReviewID": "R2SGV482MMLL9B", "Overall": "5.0", "Content": "Looks great, awesome picture and sound. Very Good Purchase. Can be used for computer monitor also. Light wt. Use in son's room and doesnt take up alot of space. Would purchase again.", "Date": "March 31, 2013"}, {"Title": "Samsung 22in LED", "Author": "Brad Malmsten", "ReviewID": "R2IHBBK4HMU8OZ", "Overall": "5.0", "Content": "Purchased this to replace an old clunker we had in bedroom. Good picture as expected and easy to mount on articulating wall mount without taking up much space.", "Date": "March 28, 2013"}, {"Title": "great little tv for the price", "Author": "Amazon Customer", "ReviewID": "R2LY4P3AQPWO1T", "Overall": "5.0", "Content": "My son bought this for himself  and it has been a real winner.  Just right for a teen-aged boy's bedroom.", "Date": "March 28, 2013"}, {"Title": "A beauty!", "Author": "Balbec", "ReviewID": "R3NBRD4C9L8OFW", "Overall": "5.0", "Content": "This tv arrived only a few days after the order was placed, well in advance of the predicted date of delivery!The picture is excellent, and the sound is quite good compared to other sets of this size. Set-up was easy and blazingly fast!We are very pleased in all regards.", "Date": "March 26, 2013"}, {"Title": "22\" Samsung", "Author": "Bill", "ReviewID": "R3W37FA6D0E010", "Overall": "5.0", "Content": "Nice little tv for the money! Works great, the plug n play mode is awesome. Just what I was looking for!", "Date": "March 26, 2013"}, {"Title": "great product", "Author": "John W Jenkins", "ReviewID": "RO79JVQ8CCGVJ", "Overall": "5.0", "Content": "arrived on time and is a great addition to my mothers bedroom.no problems viewing for any angle . picks up dtv local channels via an indoor antenna", "Date": "March 25, 2013"}, {"Title": "no problems so far", "Author": "David Hilton \"Dave\"", "ReviewID": "RRVV1WQBK3P3", "Overall": "5.0", "Content": "took no time getting it set up.  audio and visual meet my  needs.  it sets in front of treadmill and able to hear 75 to 90 percent (depending on program and sound quality of program) and 90 to 99 percent of dvd viewings.  treadmill obviously loud and when not in use, must turn down volume to hear 100 percent.", "Date": "March 23, 2013"}, {"Title": "Worked great from the start", "Author": "Brenda Gilbert", "ReviewID": "R18TF7ILJVQGC4", "Overall": "5.0", "Content": "Have not had any problems at all with this Samsung TV. After 2 mos. still working perfectly, TV fits just right in my kitchen, doesn't take up any space.", "Date": "March 22, 2013"}, {"Title": "EAST TO USE", "Author": "Jack Adelstone", "ReviewID": "R29L1CA1CEUW9L", "Overall": "3.0", "Content": "Picture adequate but viewing angle is somewhat limited for good contrast. Gives acceptable full screen picture with adequate content for 4 x 5 standard non-HD cable channels received without a STB using zoom 1 mode. Full HD pictures received on local digital cable channels w/o STB are full16 x 9 in normal mode. Setting picture size on a single channel in each format (4 x 5 &16 x 9). carries over automatically for all  other channels tuned by the single tuner in each picture format. Very user friendly. Price was right!", "Date": "March 20, 2013"}, {"Title": "Nice little Samsung.", "Author": "Arenotsaints", "ReviewID": "R3ITXJJ267S7C8", "Overall": "5.0", "Content": "The HDTV arrived well packaged with no damage to the shipping package.  The product was easy to set up and, after a few minor adjustments, was giving us a high quality picture.  Wish I would have ordered the 24\" but still an excellent HDTV for the price.  Highly recommended!", "Date": "March 17, 2013"}, {"Title": "Great tv!", "Author": "Margaret M Smith", "ReviewID": "R2TYL0TUMYZ9AG", "Overall": "5.0", "Content": "I purchased this for in our RV.  Great picture and suites our purpose perfectly.  Easy to install. Shipped very quickly. Very happy.", "Date": "March 15, 2013"}, {"Title": "Great picture", "Author": "Pitter \"fragrance snob\"", "ReviewID": "R2J6UY4G65VOXZ", "Overall": "5.0", "Content": "The screen looked so small out of the box however it is a perfect size for our bedroom. We have no problems with the sound and the picture is great.", "Date": "March 12, 2013"}, {"Title": "Best Bang for your buck color TV but.....", "Author": "Philip", "ReviewID": "R31DDNAYHRZK74", "Overall": "4.0", "Content": "Hi Folks,If you want the best bang for your buck and just to use it for TV cable/satellite or DVD/VHS Play than this is it.No port for internet, but the Samsung color and quality speak for themselves. The only critique I have is the stand that the TV sits on leans forward and you must secure the TV otherwise it can fall forward. Other than that it is the best bang for your buck in that size.Hope this helps.Blessings,Phil", "Date": "March 12, 2013"}, {"Title": "Good Guestroom TV", "Author": "youngncgal", "ReviewID": "R1P7CFSK68F1KI", "Overall": "4.0", "Content": "We bought this TV for our guest bedroom. It is a perfect size, with limited sound.  The picture is extremely clear and the set works very well with an APPLE TV.  The stand was a bit of a pain to install, but my husband was successful with it. It is very sturdy when installed properly. The remote is acceptable, however I wish there was a separate sleep button as opposed to having to go thru 2 menus to set it up.", "Date": "March 10, 2013"}, {"Title": "Nice little TV", "Author": "David W Shin", "ReviewID": "R1ZU19M0YZF0FF", "Overall": "5.0", "Content": "We bought this TV for the kitchen and we are absolutely enjoying it.  The quality of picture is great and we really like the built-in TV-guide feature.", "Date": "March 9, 2013"}, {"Title": "Good TV for the prices", "Author": "A. J. Laing", "ReviewID": "RKY8L73FGM6LR", "Overall": "4.0", "Content": "The visual quality of the TV is very good, and it has HDMI inputs.So overall a good product.My only issue is that the sound quality of built-in speakers is a bit cheap.", "Date": "March 8, 2013"}, {"Title": "Great for bedroom or kitchen.", "Author": "Rocco Albertelli", "ReviewID": "RH5HB22GL9HNZ", "Overall": "4.0", "Content": "Very nice picture. The audio due to the down facing speaker can be a little tinny if the t.v. is sitting on a hard surface. Placing a table cloth under the it seems to resolve this. It really isn't that bad though anyway. This unit has no audio out jacks. The built in speaker though seems just fine for use in a bedroom or kitchen. The sound level is not an issue when used in this capacity. No complaints thus far. Very happy with purchase.", "Date": "March 7, 2013"}, {"Title": "Excellent quality", "Author": "Wayne G.", "ReviewID": "R2A05EQGXDKR3V", "Overall": "5.0", "Content": "Screen display is excellent for HD broadcast. Intend to use this for both TV and as an HD computer monitor, but have not connected to a computer yet.  Very easy to connect, convenient connection points.  Stand is high quality.Resolution better than \"standard\" TV display.", "Date": "March 6, 2013"}, {"Title": "Great flat screen.", "Author": "Bock", "ReviewID": "RFDF63NWW6VZ6", "Overall": "5.0", "Content": "Had to have a new TV quickly that would fit in a small entertainment center and this is perfect. Sound it a bit low, but I use it in a small room.", "Date": "March 6, 2013"}, {"Title": "A good tv for a bedroom for a gamer etc.", "Author": "Raymond M", "ReviewID": "R74O5NDKQR2B4", "Overall": "4.0", "Content": "What's great about it: Price, HDMI, good for gamingWhat's not so great: Sound quality could be better.I brought his tv during the holidays and black friday sale at best buy for about 200 dollars. Before my purchase I did a little research on bestbuy etc. and found this tv to pretty much fit my needs. I just found out today that I cannot connect small speakers to this tv after having a chat with samsung customer service. By the way, there customer service has been good to me thus far. I chatted with them twice and both times I didn't have to wait very long for support. My only thing I can point out regarding this tv is the sound. For a HDTV of this size compared to other tv others on the market it is okay but could be better. While watching a movie i find myself adjusting the volume from time to time because I can't seem to get it just right. When I'm playing my ps3 I dont have to adjust the volume as much for some reason. Right now this tv is connected to an old VCR, remember those? Also it is connected to my ps3 slim and even an old video game system. (An original X-box system) I am using one HDMI port in the back of the tv and there is another HDMI port not in use. By the way, you have to figure out how to adjust the video settings on your ps3 directly to unlock the full 1080p potential on most games otherwise the tv might switch to 720p instead.Easy to set up, Great value and features for the price. Easy to use remote control.About me...Casual viewer and GamerI would recommend this to a friend!Internet Connectable? Don't Know", "Date": "March 4, 2013"}, {"Title": "Beautiful display with a wide viewing angle.", "Author": "Ashley", "ReviewID": "REKO9S3025OB6", "Overall": "5.0", "Content": "My husband and I got this TV for our computer room and not a single dead pixel. We each have our computers setup on the sides and this TV is on a shelf in between them. This means that neither of us are seeing this TV from directly in front of it, (probably closer to 145° angle) and the colors are true. This is a great TV with lots of ports for connecting things. I would highly recommend it.", "Date": "March 4, 2013"}, {"Title": "22\" Samsung", "Author": "Shirley", "ReviewID": "RO92417KLZHD2", "Overall": "5.0", "Content": "As usual, I'm happy with my Samsung.  I've tried a 42\" and 32\" and now a 22\".  Love them all.  Great quality for the money.", "Date": "March 4, 2013"}, {"Title": "Great", "Author": "Dylan C OLeary", "ReviewID": "RE4LA0KIJ2RJL", "Overall": "4.0", "Content": "Perfect little gaming tv for a dorm room. No lag. Also works great as a computer monitor. Sound quality isn't the best.", "Date": "March 3, 2013"}, {"Title": "Great Buy", "Author": "bookwork86", "ReviewID": "RYO14VJY65X2Z", "Overall": "5.0", "Content": "Great TV with an excellent price. Makes a grat TV for the wii and will get plenty of use. :)", "Date": "March 1, 2013"}, {"Title": "Overall it's a BASIC flat screen TV", "Author": "Jennifer Merry", "ReviewID": "ROTZCR55JOMXI", "Overall": "3.0", "Content": "Pro: Lightweight, easy to assembly, user friendly instructionsCon: If you are prone to lose/misplace your remote control please be aware that there is no power button available on the TV unit.  Quality of pictures are standard with or without high definition selection.  Dimension of the TV is smaller than what I expected.", "Date": "February 27, 2013"}, {"Title": "Works Great in Kitchen - No scratches even thought it's refurbished!", "Author": "Chuck \"Chuck\"", "ReviewID": "R3TEWE5LMZVV8M", "Overall": "4.0", "Content": "Looked new out of the box, even though it was a returned item.  Works great in my kitchen, easy to set-up, and its just what I needed to mount on the wall to preserve counter space.  If you've never ordered a refurbished product from Amazon, you should consider it;  I've done so three times now, and have been very satisfied, not including the significant amount of money you save by not purchasing a brand-new version.", "Date": "February 26, 2013"}, {"Title": "Great Buy. We got 2.", "Author": "TiaAnder", "ReviewID": "RO3MSPBOB62VH", "Overall": "5.0", "Content": "We got one of these for our son for Christmas. It was easy for him to set up (he's 19) and install himself with cable hook-up. The size is nice and seems to be working well. In looking at them again after Christmas, I came back to the same purchase again for myself to put in my office. The stand could be better as it is just a hard plastic, but seems to be holding up. It does not swivel or anything like that- so once it's on, it's on. Overall a great deal for the price and brand.", "Date": "February 25, 2013"}, {"Title": "Very nice display", "Author": "John J. Bowden Jr.", "ReviewID": "R62VHJ6IS2XT0", "Overall": "5.0", "Content": "Got this for my daughter for Christmas.  She uses it for Netflix (via a BluRay player) and discs.  Good sound for a TV this small.  Very good picture.", "Date": "February 23, 2013"}, {"Title": "Great TV", "Author": "Karen K. Hall \"k hall\"", "ReviewID": "RTUVBQG03BN8K", "Overall": "5.0", "Content": "I actually bought this for my sister for her bedroom.  I love Samsung and have 4 of these smaller TVs.  The sound is much better than the LGs.  It's a great product for a good price.", "Date": "February 23, 2013"}, {"Title": "Power problems", "Author": "Thornburg", "ReviewID": "R2IBSYZ83W89V0", "Overall": "3.0", "Content": "When I plugged the TV in for the first time, its power just kept cycling on and off. I have to return it, so can't review it any further.", "Date": "February 22, 2013"}, {"Title": "Loved it", "Author": "Bun", "ReviewID": "R3O51RHZAN64NH", "Overall": "5.0", "Content": "It was a great price and the resolution is great. I expected to be heavy but it was really light.", "Date": "February 20, 2013"}, {"Title": "Samsun Televsion", "Author": "Tycho", "ReviewID": "R4H1X65LF0N94", "Overall": "5.0", "Content": "My twenty-two inche flat screen televsion clours are bright and clear!  It fits very nicely on my huge desk next to my computer.", "Date": "February 20, 2013"}, {"Title": ".great little TV", "Author": "Helga M. Strong", "ReviewID": "R2L83XYHEKENYB", "Overall": "4.0", "Content": "We wanted a small TV for our dresser; this was the right size and it gets a great picture. I would recommend it.", "Date": "February 16, 2013"}, {"Title": "Good TV, Bad Remote", "Author": "J. Kelley \"J K\"", "ReviewID": "R1ST81HCUV4IWF", "Overall": "4.0", "Content": "22 inch tv is perfect for my bedroom.  But how could they NOT have backlite the remote control.  And no one should have to press 6 buttons to set the sleep timer", "Date": "February 15, 2013"}, {"Title": "TV sounds is tinny", "Author": "ReMax Corrie", "ReviewID": "R2EB1PZ20J4MB8", "Overall": "2.0", "Content": "Price and picture are fine but  sound is tinny would have like some ports also I would not recommend it", "Date": "February 14, 2013"}, {"Title": "Nice little TV", "Author": "M. Seggio", "ReviewID": "R12TA300D81XG6", "Overall": "5.0", "Content": "We purchased this tv for a bedroom and have been very pleased. I have it connected to PS3 for both gaming and streaming Netflix.  The picture and sound are very good.  One random nice feature is that the remote has lit buttons.  I like this TV for the money.", "Date": "February 14, 2013"}, {"Title": "Great Tv", "Author": "Patricia M. Taft \"camropt\"", "ReviewID": "R2XYIW1L1Z5PZN", "Overall": "5.0", "Content": "Was very happy with my order. It came fast and was package very well. I would tell a friend. The color is very scarp and clear. Has a easy hook up to your cable or satellite .", "Date": "February 13, 2013"}, {"Title": "KITCHEN TV", "Author": "COMP GUY", "ReviewID": "R24C23WQ89YP0Q", "Overall": "5.0", "Content": "Perfect size for our needs and great picture.Samsung quality can't be beat!Easy set up and remote is easy to navigate", "Date": "February 13, 2013"}, {"Title": "Samsung TV", "Author": "Robert A. Sharp", "ReviewID": "R2P2WROCD9DU8W", "Overall": "5.0", "Content": "Arrived on time and at a good price.  So far, very happy with the quality and size as it is a bathroom tv", "Date": "February 13, 2013"}, {"Title": "Great Little TV", "Author": "David DeBoer", "ReviewID": "R21V9F20XUGTA5", "Overall": "5.0", "Content": "We wanted a small tv for the gandkids to watch when they come to visit and for my wife to keep up with news while doing housework.  It looks great and works great.", "Date": "February 10, 2013"}, {"Title": "NICE LITTLE TV SET", "Author": "John E. Hetsch", "ReviewID": "R22EAZ2IIQQHOL", "Overall": "5.0", "Content": "I GOT THIS TV FOR MY BIRTHDAY.  I HAD NO TV IN THE BEDROOM AND FIGURED IT WOULD BE A GOOD SECOND TV SO I PURCHASED IT.  SO FAR I HAVE ONLY HAD IT ON FOR A COUPLE OF HOURS, BUT IT HAS AN EXCELLENT PICTURE AND I AM HAPPY WITH IT.  IT TOOK QUITE A WHILE TO SET UP BUT IT WAS WORTH IT.  SO FAR NO PROBLEMS AND I LIKE IT VERY MUCH.", "Date": "February 10, 2013"}, {"Title": "Samsung TV", "Author": "Derrick Akins", "ReviewID": "R1I71UAI1PDIFA", "Overall": "5.0", "Content": "I received my TV  one day before Christmas for my Grandson and it arrive in a nice blue bag with a gold ribbon wrapped around the top, I was impressed.", "Date": "February 10, 2013"}, {"Title": "Samsung 22 inch led TV", "Author": "R. R. S.", "ReviewID": "RNG6R5AS28QH9", "Overall": "4.0", "Content": "Great TV. fro the price. Fantastic picture. Sound a little tinny, but still not bad.. We have it set up in the kitchen.", "Date": "February 10, 2013"}, {"Title": "No Audio Output", "Author": "Stacy Wong", "ReviewID": "R12P24IQA3MYME", "Overall": "1.0", "Content": "I was really bummed about this TV. The picture and size all are perfect... The only MAJOR downfall is that there's no audio output. This was purchased to be used in a cubicle with headphones to not disturb others. I'm a huge fan of Samsung but will have to purchase a Vizio for my cubicle...", "Date": "February 8, 2013"}, {"Title": "Great TV for the price.", "Author": "Thomas J. Cullen III \"TJCIII\"", "ReviewID": "R1WVXKCMH7TAVK", "Overall": "5.0", "Content": "I just upgraded to this Samsung from a sanyo tube TV and I must say I am in awe of this T.V.  There is nothing bad to stay about This T.V. First off This TV is the perfect size when upgrading from a 20 inch tube. It fit perfectly. I was going to go for the 32\" but decided on this. The Picture and the Sound Quality is Amazing and it really packs a Movie Theater Quility. There is a lot of Negative Comments on the sound but as I said above \"Movie Theater\" Quality. I didn't have to hook up speakers or anything like that. Also The HDMI Cabel that hooks in to the TV from all HDMI capable devices really sharpen the picture and sound experiance. All in all I am very impressed. Even the stand is very sturdy. You have to make sure it is screwed in Tightly. I think it is safe to say that bigger is not always bigger. Great tv for the price!", "Date": "February 4, 2013"}, {"Title": "Small room TV", "Author": "Frederick Steve", "ReviewID": "R3CQNS9X1JGOVO", "Overall": "5.0", "Content": "I put this TV in a hobby room and it is great so far.  Sound is decent and it fits anywhere.  I don't have it hooked to HD yet so can't comment on that.", "Date": "February 4, 2013"}, {"Title": "poor sound", "Author": "4", "ReviewID": "R2UPPPIY368U5J", "Overall": "3.0", "Content": "Set has a great picture and terrible sound. Speakers face the hard surface instead of the front. Samsung help line was no help.Saw an article about getting it off a hard surface and that helped a little by puting a cloth under it.", "Date": "February 3, 2013"}, {"Title": "perfect size for my kids room", "Author": "Bree", "ReviewID": "R2MHIBN80OQU0A", "Overall": "5.0", "Content": "We bought this for our kid's Christmas preset. It has great picture and sound quality and of course my kid loves it.", "Date": "February 2, 2013"}, {"Title": "Samsung flat screen- couldn't be better.", "Author": "BERNICE", "ReviewID": "R1ELU8A2QMDY8H", "Overall": "5.0", "Content": "This 22 inch TV is just the right size for our bedroom.  The picture is so clear and perfect.  Would recommend to all.", "Date": "January 30, 2013"}, {"Title": "Decent picture, horrendous sound.", "Author": "M. Dahl", "ReviewID": "R3DSS92JRZTU7M", "Overall": "3.0", "Content": "The picture is pretty solid. I would recommend this for somebody looking to throw a tv in the office to catch the news or something. But if you're looking to watch movies or do any gaming, I would steer clear. That, of course, is a moot point if you're planning on pairing it with a surround sound.", "Date": "January 29, 2013"}, {"Title": "Amazing", "Author": "Karen \"Vannessa\"", "ReviewID": "R2NKE7LB4AI5AA", "Overall": "5.0", "Content": "As usual Samsung never seizes to amaze. I love everything from this manufacturer. High quality & good style. It was easy to mount on the wall and nice resolution.", "Date": "January 29, 2013"}, {"Title": "Great TV", "Author": "reece", "ReviewID": "R31IC2QT7JYYN8", "Overall": "4.0", "Content": "TV has worked like a champ and has a great picture quality. The only issue is it is a tad bit small. The TV sits on a dresser which is only 4 feet from our foot board on the bed....add another 6 feet to where our heads lay and we are about a total of 10 feet from the TV. 10 feet from this TV is cutting it pretty close to being a little too small. But hey it works great and comes with all the hookups for PS3, 360, PS2, Blue ray player and all that jazz", "Date": "January 23, 2013"}, {"Title": "Awesome Little TV", "Author": "Coach D \"Coach D\"", "ReviewID": "R8I796CLR7U87", "Overall": "5.0", "Content": "No complaints here!  Hard to find a name brand 1080p TV in this price range.  Just perfect for my office!", "Date": "January 23, 2013"}, {"Title": "Great TV! Happy with it!", "Author": "Eric H.", "ReviewID": "R3CB9EY1L8VETG", "Overall": "5.0", "Content": "Great TV! Purchased for my daughters and they love it! They only use the antenna and it receives the signal well!", "Date": "January 21, 2013"}, {"Title": "Wow! What a picture!", "Author": "T. P. Drohan", "ReviewID": "R34EKGW9R1ZQEF", "Overall": "5.0", "Content": "The 1080p on this little TV is amazingly crisp. I heard that you only need 720p on smaller TV's because your eye can't see the difference but seeing the picture on this 22\" proves this theory wrong. I now want to buy a couple more and wall mount in the home. This one I purchased is in the kitchen and fits nicely under cabinet while on it's stand. Takes up hardly any counter space because you can push it back against the wall. The sound is a bit tinny sounding and only slightly improves when you turn on the simulated surround setting. So,I might add an external speaker later on or wire into surround system but for now it is just fine.", "Date": "January 20, 2013"}, {"Title": "Great TV", "Author": "bobby bennett", "ReviewID": "R1LK2INTRZWZTB", "Overall": "4.0", "Content": "Good picture, works perfectly. I would recomend the tv, I use it in the kitchen. Easy hookup, easy to use.", "Date": "January 19, 2013"}, {"Title": "Purple!", "Author": "MA-reader", "ReviewID": "R1QYADDBV0PJNA", "Overall": "2.0", "Content": "I bought 2 of these TVs at Christmas, and am having a problem with the color. Blues are off, no matter how I try to adjust the color, and I feel like I've tried everything. The Patriots, who wear navy uniforms, are suddenly in royal blue, and actual royal blue strobes to purple. It's driving me nuts. I don't see anyone else here mention this problem, has anyone else noticed this? I'm considering returning them, but reading the other reviews, everything at this size seems to have one problem or another. The fact that both of my TVs are doing this is an indication that exchanging them for the same model won't help. And, unless you are directly in front of this TV, at eye level, the colors wash out. Really interested in other people's thoughts. I have only a week to return them under the return policy. Thanks!", "Date": "January 17, 2013"}, {"Title": "TV review", "Author": "beverly", "ReviewID": "R3S1BWRONTL17D", "Overall": "5.0", "Content": "received in a few days in great condition.  Would of been nice to have had the box covered with something but there were no problems at all.", "Date": "January 14, 2013"}, {"Title": "Nice", "Author": "stephanie gaddie", "ReviewID": "R1UTPTXD6SECPJ", "Overall": "5.0", "Content": "I ordered this Samsung for my living room.When it arrived much to my surprise the television was much smaller than I thought. But I must say the picture clarity was remarkable! I was pleasantly surprised.", "Date": "January 13, 2013"}, {"Title": "GREAT!", "Author": "GTman05", "ReviewID": "RLO4V43WJ51PC", "Overall": "5.0", "Content": "I bought this for my girlfriend for Christmas because I was re-doing her room for her. I have a LCD TV and I wish I had gotten an LED LCD TV like this one. It has very great picture which is expected from Samsung and every TV show or movie is in high def. The only thing I had a problem with was the speakers. I feel like they could get louder but then again that's my opinion. Maybe a purchase of a sound bar for under $100 will do the trick. If it's in a small room then this TV is great! Medium to Large rooms I recommend a larger screen size and maybe a different sound system. Besides that, Samsung never fails me when it comes to picture quality.", "Date": "January 10, 2013"}, {"Title": "great TV", "Author": "John B", "ReviewID": "R380P2TK8W9ZWD", "Overall": "5.0", "Content": "perfect for bedroom. i was scouting for a TV long time ago with brand but not pricey. this samsung TV is really a great choice and the price is very reasonable.", "Date": "January 10, 2013"}, {"Title": "tv", "Author": "Sherry \"Mrs. A.D. Watson\"", "ReviewID": "RLK1IS9IZJAFG", "Overall": "5.0", "Content": "we needed a small up-to-date tv for our living space. this works perfectly, was easy to set up and the sound that comes out of this small tv is very very good. works very well with the HDMI set up for our roku we use.", "Date": "January 7, 2013"}, {"Title": "nice but a little wanting", "Author": "Gracy", "ReviewID": "R2EHXDBL0RQOJW", "Overall": "3.0", "Content": "I bought this HDTV hoping it to be all that it was advertised to be. It served me well except that when compared with my LG it fella little short. For one, it was only good for viewing when sitting real close to the monitor. When used as a computer screen, it was as nice as I wanted it to be. It was a nice buy for the amount of bucks I paid for it.", "Date": "January 5, 2013"}, {"Title": "Decent unit, serves its purpose", "Author": "Dew \"dc2133\"", "ReviewID": "R38O6L7EC5QWNH", "Overall": "5.0", "Content": "Installed this on an existing ceiling mount, mostly to watch the news and some shows. Not really looking for a fancy unit or a large TV for where it is placed. It fit the ceiling mount perfectly. I only wished it came with the M4 screws.  So far so good.", "Date": "January 4, 2013"}, {"Title": "Very Happy", "Author": "Robin W. Gates", "ReviewID": "RJRNFWHYQ551H", "Overall": "5.0", "Content": "I've had this TV for about 18 months.  It has performed flawlessly.  The picture is great and I had no problems with the setup.  I have bought other Samsung produces based on the quality of this TV.  As with all electronic devices these days, there is a learning curve on understanding all the menus.  I got this through Amazon and the delivery was excellent.", "Date": "December 31, 2012"}, {"Title": "Good picture - very thin form factor", "Author": "K. Beasley", "ReviewID": "R2W03K9YWJ4D66", "Overall": "4.0", "Content": "I bought this model because of the dimnesions ... I had a very tight space I wanted to put this in and minimal depth was critical.  The TV is only 1.6\" deep but this is a bit decieving because you have to consider the input panel is straight off the back and the connector you are going to use will add to the depth requirement.  The picture is good and sharp with no perceptable motion ghosting (even though it is a 60Hz display) ... but I would expect that because its only 22\" and 1080p.  Despite the number of reviews that bark about poor audio, I found that the sound is not bad considering the small size.  Booming, room-filling sound from a set of small, 1.5 inch speakers is an unrealistic expectation, (c'mon, folks ... these are basically laptop PC speakers).  As far as the complaints about no audio ouput, I checked the specs again and there is no mention of one, so I am not sure about this complaint.  Most configurations will drive this display with a cable box or sat reciever anyway ... If you need an audio source for exteranl speakers or headphones, just use the audio from the box\\reciever (read: Y-adapter if you are not using HDMI).  Side-to-side viewing angles are resonable but you will need to angle the TV down if you plan on mounting it in an elevated position.  Just a small angle viewing upward will quickly wash-out the picture ... this is why I gave it 4 stars instead of 5.  Overall, I am very pleased.", "Date": "December 30, 2012"}, {"Title": "Good TV!", "Author": "J.P,", "ReviewID": "R3BOA975OB18DW", "Overall": "4.0", "Content": "We upgraded the TV in our girls' room to this newer and (slightly) bigger model. Great picture and mounts easily. The sound is much better than I expected with this size television.", "Date": "December 28, 2012"}, {"Title": "GREAT SET FOR OFFICE OR SMALL BEDROOM", "Author": "J. B. MCCRUDDEN", "ReviewID": "R3A98B82C8UV3H", "Overall": "5.0", "Content": "Fits perfectly on top of a book case in my home office and works great!  Sound is much better than I expected from a set of a this size.Living in South Florida, and with Direct TV, I did not set it up to receive HD since my larger Panasonic Plasma in the family room often will lose the signal during a storm or heavy rain. In most cases, the standard signal gets through ok on the non HD feed and we can continue watching a show in either my office or bedroom which has a similar set-up on a Samsung 24\" set purchased a couple of years ago.", "Date": "December 27, 2012"}, {"Title": "review", "Author": "stef16", "ReviewID": "R1QTKME2Y00E2T", "Overall": "5.0", "Content": "perfect size and look for what I need and wanted. great picture when watching movies and sound is good as well", "Date": "December 27, 2012"}, {"Title": "Perfect!", "Author": "Kelly Musarra \"2katz\"", "ReviewID": "R2WJ4CWNMK6RXM", "Overall": "5.0", "Content": "Purchased for use in our guest room for mom and dad's visit. Although it's a little smaller than envisioned, it's the perfect size for the room and has a fantastic screen image.  This is now the best TV in the house!", "Date": "December 27, 2012"}, {"Title": "rb007-Samsung UN22D5003 22-Inch 1080p", "Author": "rb007", "ReviewID": "R2B2QXRMNYMM6T", "Overall": "5.0", "Content": "Good tv for a gift to someone who wants a small tv for viewing in the kitchen. Would recommend . Good picture.", "Date": "December 26, 2012"}, {"Title": "Happy", "Author": "Gary R Waddell", "ReviewID": "R215J1G9DSLUUS", "Overall": "5.0", "Content": "I am very pleased with this product and the shippng was very quick.what more do you want me to say?", "Date": "December 26, 2012"}, {"Title": "Great size and value for the price.", "Author": "Super Plumber \"Super Papa\"", "ReviewID": "R1SQ3N4E9BUJE0", "Overall": "5.0", "Content": "Bought this TV for ourselves for Christmas.  Great TV for the kitchen.  Also have the same TV mounted in the bedroom of our travel trailer.  Great size for both places.  Easy set up.  Great value.", "Date": "December 26, 2012"}, {"Title": "Good Qualtiy", "Author": "K. M. D'Amico", "ReviewID": "R2K2DRRN3QGSEH", "Overall": "4.0", "Content": "Good for the kitchen- not to big but enough so I could see things clearly - nice colors - needed HDMI cord but once resolved it worked great.", "Date": "December 26, 2012"}, {"Title": "super TV", "Author": "Pete \"Pete\"", "ReviewID": "R33HX4FOCW5LAT", "Overall": "5.0", "Content": "I love ths tv no problems use it in my rv and and no problems just a lot of comments on what a great picture it has.", "Date": "December 25, 2012"}, {"Title": "Samsung TV's are the best!", "Author": "A. Horne", "ReviewID": "RESSM9KRV9DVI", "Overall": "5.0", "Content": "All of our TV's are Samsungs. They absoutely have the best picture quality. I can walk into a store where multiple TV brands are sold and I can tell which one's are Samsungs immediately due to picture clarity and overall quality! We bought this TV for my dad's engine room (where he builds motors) along with a wall mount kit. It works great! Only one thing, you kinda need a speaker system for better sound, but for where the TV is we really can't complain. It's a great product at a great price! Highly recommend any Samsung TV!!", "Date": "December 25, 2012"}, {"Title": "Great TV", "Author": "Andrea", "ReviewID": "R27Q3X9GUKVKZU", "Overall": "4.0", "Content": "Bought this TV because we wanted to have one in our bedroom. We both like different shows and having an extra TV makes it easier to watch our shows. The reviews I read on this product are the same as you read today. I was kind of worried about the sound, because most people said the sounds was bad. This is not the case. For this TV which is used in a bedroom(not living room or big open area) has good sound on it. The picture is wonderful and my living room has a Samsung TV too, but bigger size and I can tell a major difference between the two. This one is easy to turn on and you don't have to point directly at the TV as with the other. Overall good TV for the price.", "Date": "October 29, 2012"}, {"Title": "Amazing Product!", "Author": "ele381ta", "ReviewID": "R1PNPHT3UTW273", "Overall": "5.0", "Content": "Awesome product, bought it as a replacement for my last LCDTV that had broken pixels. Crisp quality and is a very nice addition to my living room.Would highly recommend this to friends and family!", "Date": "September 30, 2012"}, {"Title": "Great as monitor and TV", "Author": "Arpan", "ReviewID": "R1Y79HTVZ7USXG", "Overall": "5.0", "Content": "The picture quality is great both for viewing text at close range and 1080p video while sitting back. The USB thumb drive feature is also pretty cool.", "Date": "September 30, 2012"}, {"Title": "Great picture", "Author": "ele381ta", "ReviewID": "R36UGJK280Y95X", "Overall": "5.0", "Content": "After moving into my new apartment, I was missing the movie-theater style HDTV that I had but recently broke.So I bought this Samsung 22-inch HDTV for bedroom, and I must say, I have not regretted it for a minute. It has incredible sound and picture quality, and is compact enough to fit in my room easily. Additionally, it seems to work great with the XBOX 360 and PS3 systems I have.I would definitely recommend this to anyone looking for a TV for their kitchen or bedroom.", "Date": "September 30, 2012"}, {"Title": "sharp and clear beautiful color", "Author": "Allen Millikan", "ReviewID": "R3UXA364CATWFN", "Overall": "5.0", "Content": "I bought a Philips led tv and it broke within a month.  Bought this Samsung and love the color so much better than the other one.  Hopefully, this one will last a long time.", "Date": "September 29, 2012"}, {"Title": "Great TV but I would recommend another Samsung for a monitor", "Author": "Sajid G. Mulla", "ReviewID": "R2JWN0H9OF48ZF", "Overall": "4.0", "Content": "I have bought and replace a lot of TV sets for a small business and regarding quality I would always recommend Samsung. I noticed small problems in this set that is common in all  sets of all brands now  and that is the build quality which is poor and  the inclusions of cheap plastic screws, and this set also has a poor quality wire which is only a small two prong instead of three.This TV has two hdmi inputs and component inputs this is fine if you have a newer videocard with a hdmi input, but compared to the Samsung B2230HD it just doesn't have the options of a vga input or  the magic angle viewing options that has standing, lean back, or other options for different viewing environments.The sound options does have a SRS option but it does not have an option for clear voice for low sound broadcasts or amplify sound option. I do like SRS but I don't like to turn on one option to amplify sound I like a variety of options and sadly this set does not have it.I knew this going in and was going to replace my B2230HD set with this since it has LED  and the B2230HD doesn't. The picture in this set is very clear for watching TV but that is not the only thing I use a set for. I decided to put this in the hotel room and stay with my old Samsung set. The stand is very small and does take less space but sadly it doesn't hold up because of the poor build quality of the stand.This is the sign of the times though all sets are smaller and leaner but I prefer a stronger build quality in my products since I grew up that way but sadly if I buy another set in this 22 inch set price range I know I will be disappointed.", "Date": "September 27, 2012"}, {"Title": "Great Fit, Great Price, and Fast Delivery", "Author": "M. Baker \"micbaker132\"", "ReviewID": "R3DY41OIWK7OGP", "Overall": "4.0", "Content": "Looked around for some time and chose this Samsung LED TV because of the specifications.Needed a small TV and this one fit the best.Picture quality is \"Outstanding\".Only drawback, the speaker/sound quality is not the best, which is the only reason for not giving a 5-Star rating.", "Date": "September 22, 2012"}, {"Title": "Works as stated", "Author": "Courtney", "ReviewID": "R2HNF1OEM92DUF", "Overall": "4.0", "Content": "This TV has really great quality, and the sound is decent. The only downside is the stand is not super stable, but no serious issues.", "Date": "September 19, 2012"}, {"Title": "Awesome tv.. Sound could be better", "Author": "Spitzfire13", "ReviewID": "R2ZANPK4JHXM3P", "Overall": "4.0", "Content": "Its a great tv that you can put in a small room. Very nice picture and quality. The sound could be better but I'm not complaining its a nice tv", "Date": "September 17, 2012"}, {"Title": "very good", "Author": "miguel", "ReviewID": "R2YHNSCAPRKWP8", "Overall": "5.0", "Content": "excelente producto recomendado vendedor serio y responsable, envio rapido y oportuno no tuve ningun tipo de inconvenientes muy buena compra", "Date": "September 7, 2012"}, {"Title": "Pretty good", "Author": "Fed", "ReviewID": "RZ29LK8KPMW3E", "Overall": "4.0", "Content": "Was searching for a 22-inch tv so i can get rid of the old 18-inch lg that is still ok but does not have 1080p for my games. Initially i wanted to get the sony 22\" instead but read that the sound is really bad, and this samsung one is designed much better with more features. For a budget tv, the picture quality is great and sounds better than my old lg tv. There is no audio out port as mentioned by others, but not really a problem unless you absolutely need to use headphones with this tv. The ps3 games that I play on this tv appears much brighter than before, and the best part is that everything is 1080p now. Also, the viewing angle on this tv is much greater, and there are angles where i cannot see from before but now appears fine. Delivery was right on schedule and no problems when the package was opened. Easy install and hookup, and can also be used as a computer monitor.The only problem i had with this product is the stand, which is not adjustable whatsoever, and should be more stable. Thats why i give this 4 out of 5, due to the poor stand quality. Other than that, everything else is great.", "Date": "September 6, 2012"}, {"Title": "Great TV", "Author": "john", "ReviewID": "R1AT0JL1S5MQ85", "Overall": "5.0", "Content": "Did alot of comparison shopping, before buying this tv.  There where cheaper one's and more expensive one's, but after reading 49 plus reviews decided on this gem.  So far this tv has been awesome.  My teenage son uses it for gaming, tv and part time monitor for his computer.  There has been no gliches and has a great picture and setting features.  Thumbs up on this gem.", "Date": "August 20, 2012"}, {"Title": "Flat Screen TV", "Author": "Ron \"Ron\"", "ReviewID": "R332JM75EM6HN7", "Overall": "5.0", "Content": "This was a great purchase. The picture and color is fantastic,very light weight and smart looking. I would say that any looking for a small TV should consider this unit!", "Date": "August 20, 2012"}, {"Title": "Amazing Tv For its Price.", "Author": "Amazon Costumer", "ReviewID": "R2LZWT2PRIMXZB", "Overall": "4.0", "Content": "I ordered the Samsung UN22D5003 22-Inch 1080p Clear Motion from Amazon on August 1st with FREE SUPER SAVER SHIPPING delivery estimate was August 6 however i received my TV today August 4th, Amazon always delivers. so far im loving my TV, i use a standart box cable so im gonna need to upgrade to fully experience the magic of High Definition. If you own a standard cable box from your cable provider the picture its a little blurry when plugged in from the normal A/V anteenna cable. other than that, colors a great sound not so much but if your gonna use it for a small room its the perfect choise, i also hooked it up to my PS3 and it looks amazing if you are a sound whore you might want to hook it up to your HOME STEREO SOUND SYSTEM but i have no problems when gaming since i own a  headset.To summ it up, BUY THIS TV IF YOU ARE ON A BUDGET AND YOU WANT IT FOR GAMING OR PERSONAL USE. i'd give it a 8.5/10 4 STARS!Enjoy!", "Date": "August 4, 2012"}, {"Title": "Perfect for bedroom, excellent picture", "Author": "LovesToCook \"Michelle Bobbish\"", "ReviewID": "R3LQIRNU5GBQZ2", "Overall": "5.0", "Content": "I bought the 22 inch LED as the picture quality on LED is better then your standard flat screen in my opinion, and I needed a small TV for the guest bedroom where I do my Jillian Michaels Body Revolution workout DVD's. I needed something small enough to sit on a console table vs wall mount, but big enough so when I was doing my floor excercises, I could still gaze up and see the TV. This fits the bill. I can see and hear everything very clearly regardless of whether standing, sitting or lyind down. Audio is strictly from TV, no output jacks for surround but thats fine with me. I have to wonder though, since there are component jacks and A/V jacks on the back of the TV, if you could hook up to a receiver (using the receiver's speaker inputs/outputs). Thats another story though. For my use, its perfect. And for the price - most def would recommend.", "Date": "July 21, 2012"}, {"Title": "Nice little TV for the kitchen", "Author": "Mike from Wyckoff NJ", "ReviewID": "R14HTED44MG2HU", "Overall": "5.0", "Content": "Produces a nice little picture ideal for the kitchen or small bedroom.  Easy-to-use remote.  Nice screen image.  Decent audio.  Good value for the money.", "Date": "July 16, 2012"}, {"Title": "Good basic small tv", "Author": "Just a guy", "ReviewID": "R3M0LNQGB3RE09", "Overall": "4.0", "Content": "This is a nice basic small tv.  The picture is very nice and the sound is acceptable.  The viewing angle is fine side to side, but not up and down.  I have this on a bracket in my home gym, and it is fine when I'm standing on the treadmill, but not really viewable when lying on the floor.There is no audio output and no headphone jack.  The speakers are not exceptionally loud, but are loud enough to get over the noise of my treadmill (barely).It has a 75x75 VESA mount.  The HDMI and coax plugs come straight out of the back (perpendicular to the screen), not sideways, so you won't be able to get this very close to the wall.Frankly, I liked the older model - Samsung UN22D5000 22-Inch 1080p 60Hz LED HDTV (Black) [2011 MODEL] - better.  It has a headphone output (so you could always attach a sound bar) and the input cables are parallel with the screen, so you can get it much closer to the wall.", "Date": "June 11, 2012"}, {"Title": "samsung 22inch tv", "Author": "T. BLAKELY \"fuzzy\"", "ReviewID": "RK97BBNUHX8JW", "Overall": "5.0", "Content": "very pleased with the tv.will buy from this site again enjoy watching the tv very nice picture will buy bigger screan tv later.", "Date": "March 11, 2012"}, {"Title": "Samsung UN22D5003 22-Inch 1080p Clear Motion Rate 120 LED HDTV (Black", "Author": "L. Lynch", "ReviewID": "RPJPI8XT83D4Y", "Overall": "5.0", "Content": "Samsung UN22D5003 22-Inch 1080p Clear Motion Rate 120 LED HDTV (Black), turned on right of the box and looks good. Purchased as a gift.", "Date": "March 1, 2012"}, {"Title": "Great tv", "Author": "Msquared \"MaryM\"", "ReviewID": "R1KSIMKFBBCTJP", "Overall": "5.0", "Content": "Bought this tv for a kitchen and it works well for the 22\" size.  The picture and sound are great and it is very nice for a small area.  Would have bought larger for a living room or den.  Received it very quickly and was surprised it arrived before the date that it was expected.  It was well packed and easy to set up and work.Haven't had it long enough to know if there will be any problems but for now am quite satisfied with the purchase.  So far no complaints at all.", "Date": "February 27, 2012"}, {"Title": "Always trusted Samsung Products", "Author": "Jore", "ReviewID": "R2OWKLW4K61B99", "Overall": "5.0", "Content": "Just purchased this at a local B&M; store and this TV is awesome. It was actually on sale which was a plus. I currently use it as a PC monitor connected via HDMI and also have DirecTV HD service connected and love it. This is probably my 5th samsung product since last year and all have been outstanding.Can't go wrong!", "Date": "February 21, 2012"}, {"Title": "Great value", "Author": "Annasha", "ReviewID": "R1Z0PJYCVTHCX7", "Overall": "5.0", "Content": "I went shopping for a T V for the kitchen at  PC Richard was impressed by this Samsung model. I viewed similar 22 inch TV's this one had the best picture. Unfortunately,no salesperson helped me so I made my purchase at amazon.Great price,great performance if you are looking for a 22inch don' t look any further, you will be impressed also.", "Date": "January 24, 2012"}, {"Title": "Lovely and functional TV!", "Author": "Feli", "ReviewID": "R2S2KV5QWW8E1J", "Overall": "5.0", "Content": "Everyone coming to my house  kitchen just love this  22 inches LED TV. Attractive and highly different --- visitors say. Set up is easy, and I attached a  bluray  player with amazing picture clarity/definition. Buy one more like this for my garage  to replace the old TV there. Highly recommend !", "Date": "January 13, 2012"}, {"Title": "Amazon TV", "Author": "Rudy", "ReviewID": "RIY7NIMY3YBM5", "Overall": "4.0", "Content": "Very pleased with this new flat panel TV that was purchased for my daughter to use. It was easy to install, works perfectly, and no problems involved with it. Price was very good and delivery was fast. Recommend this product to anyone needing a small personal TV.", "Date": "January 2, 2012"}, {"Title": "Samsung 22-Inch, 1080p 120Hz LED HDTV", "Author": "Richard J. Valley", "ReviewID": "R3A8PQN6T76Y1R", "Overall": "4.0", "Content": "Set-up quickly. Appears to be what I expected. Haven't had time to view it much, but my wife likes it. I have another, larger Samsung, and it is everything I wanted in a TV.Samsung UN22D5003 22-Inch 1080p 120Hz LED HDTV (Black)", "Date": "December 30, 2011"}, {"Title": "Smaller TVs for Kitchen or Bathroom", "Author": "Jim Earl \"Jim\"", "ReviewID": "R2VQ164E517U53", "Overall": "4.0", "Content": "We replaced two poorly performing non-HD televisions with 22-inch Samsung LED HDTV's that have a top rating by noteworthy evaluators.  It has made a big improvement.  The picture is perfect, and the sets have many features that are easy to adjust to get the picture and sound just like you like it.  The price of these TVs was much lower than we expected to pay.  We're really satisfied.", "Date": "December 26, 2011"}, {"Title": "Good value & great picture for the size", "Author": "Kevin", "ReviewID": "R2N85PTI39HQPQ", "Overall": "4.0", "Content": "We have really enjoyed this HDTV since we got it. The picture is great for the size. It fits perfectly in our kitchen area. We had to get used to the sound because it was different than the TV we used to have. Easy controls on the TV and the remote, too. Great buy!", "Date": "December 26, 2011"}, {"Title": "Two thumbs up", "Author": "happy", "ReviewID": "R24I3L2536VYLH", "Overall": "5.0", "Content": "Two thumbs up. One for the product and one for the timely delivery. I couldn't believe I could get that quaility of TV for such a low price.", "Date": "December 25, 2011"}, {"Title": "good affordable tv", "Author": "ea", "ReviewID": "R1SWCHO8P60IOJ", "Overall": "4.0", "Content": "For my immediate needs it's just what I need. I placed it in a rather small room to watch TV at times. Great image quality.On the other hand, I would like to have some apps to take advantage of this technology, I'm a Samsung Mobile products user and I'd like to have a remote control installed but it won't let me since it's not equipped with wi-fi.", "Date": "December 13, 2011"}, {"Title": "Love it!", "Author": "BreezyPaige", "ReviewID": "R32QH1O3IWI5PB", "Overall": "5.0", "Content": "This is a great product! I already had the exact one in the 42'' and this one might even have better graphics than the big one. It's funny, the remote looks exactly the same, but smaller too. And both of the controllers work on both TVs, which I'm not sure if thats a good thing or not. If one goes missing, I still have another, but sometimes both will turn on if I am just trying to turn one on. Anyway, great buy! I am usually pleased with Samsung products =)", "Date": "December 12, 2011"}, {"Title": "nice basic tv", "Author": "Berner owner \"Puppy owner\"", "ReviewID": "R3LLSGPRPSTB1D", "Overall": "5.0", "Content": "I got this tv for my exercise DVDs.  Nice little tv for the price. Easy hookup. I didn't need anything fancy. Picture solid.It's a small tv & can be used as a computer monitor(supposedly) so I would have liked to adjust the tilt of the screen. I can't see that it adjusts easily if it does at all. That's the only con so far.", "Date": "December 7, 2011"}, {"Title": "Great bang for the buck", "Author": "SPC E", "ReviewID": "R214NZM3T1FQDY", "Overall": "5.0", "Content": "This turned out to be a great TV for my deployment. It came within two weeks to a small COB, and doesn't take up much room in my tent area. Picture looks great, and does its job of playing my xbox. For the price, I would tell anyone to grab it.", "Date": "December 6, 2011"}, {"Title": "great tv", "Author": "Eugene A. Reese", "ReviewID": "R39EMRWFRAGWQT", "Overall": "4.0", "Content": "My only comment is that the 5000 instead of the 5003 The 5000 has a higher contast ratio 3,200,000 compared to this one,all and all thought samsung is making the best leds out there right now and you get your money's worth trust me.", "Date": "December 4, 2011"}, {"Title": "external mornitor", "Author": "Amazon Customer", "ReviewID": "R3RL20D3V1YWUP", "Overall": "5.0", "Content": "Bought this as an external monitor for my mac pro, along with a DVI ( old mac) to HDMI cable. As long as the setting is correct, I use this as the main monitor, fit to screen, re-calibrate the color, it works very nice, and the resolution is as good as the mac screen. The only con is that the renew rate is 60Hz instead of 120Hz, but that can be because of my graphic card.", "Date": "November 29, 2011"}, {"Title": "Samsung 22 inch 1080p 120 Hz LED HDTV used as monitor", "Author": "Horseshy", "ReviewID": "RHNHJVBYKFDF6", "Overall": "4.0", "Content": "I bought two of these televisions.  I had wanted to use them as dual monitors, but things worked out differently.  One is now a monitor, the other my desk TV.  The TV is fabulous: Crisp, clean, almost seems like the people are in the room with you despite the smaller size.  Monitor is a little more iffy.  Getting a good image required a LOT of tweaking settings, but did finally manage to get it comfortably viewable.", "Date": "November 28, 2011"}, {"Title": "Worst TV I have ever had", "Author": "Saul G. O. Vazquez \"Saulo G\"", "ReviewID": "R3K8RIDHOJIK6I", "Overall": "1.0", "Content": "I bought this TV because of the its 5 stars rating by that time and the true motion chipset.Plese keep away of this TV, angle view is its biggest defect, you can barely perceive the image once you stop watching it perpendicularly.As a monitor it is also a crap, colors are not natural. Sound is also low and wrecky when in top level.OH, I amost forgot. When testing your TVs  chose a dark image (preferably full black) and turn ambient lights off, if you don't see the screen in uniform black then it is of low quality. I did it with this Samsung, it had several lightened areas which means it was awufuly failed.I returned it and gave a chance to VISIO, the best I could have done.", "Date": "October 28, 2011"}, {"Title": "TV does not stand up on its own", "Author": "S. Mead", "ReviewID": "RTRZ4ME17UNAM", "Overall": "1.0", "Content": "I purchased this TV through Amazon and did not even get to the point of plugging it in. I attached the base to the TV (with the two included screws) only to have it flop forward toward the floor. On page 27 of the manual, it actually says that the TV does not stand on its own....I could not believe it when I read it!! There is an illustration of a \"kit\" that you have to order containing a string and one screw. You screw this screw into the back of the TV to affix one end of the string. The manual states that the owner of the TV must purchase an additional screw to be screwed into the wall or TV stand. Then the owner must tie the other end of the string to this second screw in order for the TV to stand safely. Where to order this kit....??? I could not find the answer on Amazon or on the Samsung website. Through the Samsung website, I did a live chat with one of their reps, who told me that the only place to get the kit was to call their sole parts supplier at an 800 number. I didn't even bother.... Inconceivable that a piece of string and a screw required for SAFETY would not be included with purchase! Sent the TV back to Amazon the next day.", "Date": "October 23, 2012"}, {"Title": "Great TV for 20 min", "Author": "Blake Hansen \"Njal\"", "ReviewID": "R3T7LNLFEEZANH", "Overall": "1.0", "Content": "I have had consistently good luck with Samsung products ... until this one.  After the unsual setup up process the TV went into this continuous cycle of shutting down and restarting.  The only way to get it to stop was to unplug it.  As soon and I plugged it in it would start again without powering it on with the remote.  Maybe I just got a lemon so I returned it.", "Date": "December 13, 2011"}, {"Title": "Light weight and clear picture", "Author": "C. Frost", "ReviewID": "RFTRT2PJFTUCW", "Overall": "5.0", "Content": "This TV is perfect for that little nook or shelf where you can't put a lot of weight of a bigger TV. The screen and picture is very clear and sound quality is great! It has made my deployment much nicer, now that I'm able to play some video games and watch movies!", "Date": "November 18, 2012"}, {"Title": "Never Got Remote", "Author": "Alex", "ReviewID": "R2QWE9I2PLH9DN", "Overall": "3.0", "Content": "I never recived the remote to my tv i bought i was just wondering why i never recived it please answear back", "Date": "October 14, 2012"}, {"Title": "super picture!", "Author": "Jame P. Mcfarlin \"Jim from Eureka\"", "ReviewID": "R1V6CKLGYJE3NB", "Overall": "5.0", "Content": "This TV has a better picture than my 42\" Samsung. Decent sound but not super loud. Perfect fit for a kitchen or bedroom TV.", "Date": "August 14, 2012"}, {"Title": "Pixelated", "Author": "TomPiantanida", "ReviewID": "RWGQ8493VWXHP", "Overall": "2.0", "Content": "The package containing the TV and accessories arrived promptly.  When I assembled the base, attached the TV to a cable outlet and powered the set up, I discovered that there were clusters of \"dead\" pixels.  The clusters looked like black streaks or large droplets.  When there was no picture on the TV, but the power was on, the \"dead\" pixels were gray while the rest of the screen was black.  After several calls to Samsung, I reached the right person who told me to ship the TV back.  A UPS label was emailed to me to facilitate the return.  I put everything back into the original box and shipped it off to Samsung.  About two weeks later I received a box - not the original box, but one for a different TV - containing only the TV; no stand, power cord, remote, or manual.The first thing I did was to call Amazon, and the person I talked to - Daniel - was very helpful.  He was as bewildered as I was about why I had not received the manual and accessories, but then we both realized that the problem was with Samsung, rather than with Amazon.I immediately called Samsung, and it took more than a week of calling and talking to eight different people - two of them in the \"Executive Customer Service Department\" - before Samsung returned the stand and other accessories to me.", "Date": "July 12, 2012"}, {"Title": "Perfect Little TV", "Author": "HappyCustomer", "ReviewID": "R31GSNV0IR61OP", "Overall": "5.0", "Content": "This was exactly what I was looking for!  A well priced, smaller TV that I could use as my computer monitor (my CPU has a blu ray player that was going unsed) but also hook a TV cable into!  The picture is great!  The sound is right for the size of the TV, but I use external speakers through my PC for a better sound quality.  Overall, I'm very satisfied and I love the quality of Samsung products!  Great buy!", "Date": "December 23, 2011"}, {"Title": "tv stand lacking", "Author": "dlgak", "ReviewID": "R19M4QXRGETUNP", "Overall": "2.0", "Content": "The stand for this television is severly lacking.  Even when screwed in completely the TV wobbles back and forth. Very unstable for such a relatively small screen. Returned it and then I had to pay for my own shipping up front.", "Date": "December 5, 2011"}, {"Title": "Samsung UN22D5003 22-Inch 1080p 60Hz LED HDTV (Black) [2011 MODEL]", "Author": "John Bryant", "ReviewID": "R2VLV6K6HT289S", "Overall": "4.0", "Content": "I thought I had already reviewed this product. nice. . 2 of themI hate when the site updates there sites and can't keep the ratings and notes on the items.", "Date": "December 11, 2012"}, {"Title": "TV", "Author": "Roxy L. Ashline", "ReviewID": "RZ8NTKJ1EH1L6", "Overall": "2.0", "Content": "I liked the TV but it came without an electrical cord.  Too bad. I was able to return - no problems just apain-in-the-neck.", "Date": "March 3, 2012"}, {"Title": "horrible audio", "Author": "Kenneth J. Korshin", "ReviewID": "R119H9HYEZLIQG", "Overall": "2.0", "Content": "The features of this TV are fine as is the picture but the audio is unacceptable.  The the sound is tinny and the volume level is far to low.  This may be a defective unit I will be returning this item.", "Date": "November 26, 2011"}, {"Title": "Stay away!", "Author": "Deverson Boncamper", "ReviewID": "R225G30J0NAK30", "Overall": "2.0", "Content": "I have deep respect for Samsung and its products as a company, especially its cell phone handsets--the only company that stands as a true rivalry to Apple's Iphone and the only company that surpasses it in sales--and excellent TVs. I had a Samsung TV before and I extremely pleased but I had to make piece with it while I was making preparations to move to another states.Residing in a new state and a new apartment I've decided to get this TV as a temporary means and then use it as my monitor while I buy a new PC next year. The Samsung 22inch TV is simply amazing as far as the screen goes but everything else is cheaply made, especially the TV Stand. Even the TV's manual recommends/teaches you how to install a string to the TV to prevent it from tipping over. The stand is that flimsy and cheap...but it somehow holds it place without tipping over, thankfully.As for the size...well...I have myself to blame for that because I was under the impression that it was at least 20inchs in height and not barely 13inchs....In conclusion, this TV does not worth the price advertised...it should have been no more than 150 dollars and I would have send it back but I really do need a monitor for my then PC...and since it is such a hassle to send it back, the best I can do is dissuade others from making the same mistake as I have.", "Date": "December 17, 2012"}, {"Title": "*****DEFECTIVE SAMSUNG PRODUCTS ARE A RIP-OFF & VERY EXPENSIVE REPAIRS*****", "Author": "Just Sayin'", "ReviewID": "R1T96AB1MTTXWV", "Overall": "1.0", "Content": "*****W A R N I N G*****Do not buy SAMSUNG Televisions!!!  Maybe $2,500.00 - $3,000.00 is not a lot of money for some folks to spend on a television, but it is to me.  This is money I'll never get back, nor derive true enjoyment, nor value from due to the DEFECTIVE SAMSUNG product that I purchased.  After the one year warranty period SAMSUNG Television screens tend to show burn-in and ghosting with horizontal lines, along with very heavy distortion of picture on right side of screen.  This problem is systemic in all their LCD's and LED's.  Consumer's have complained all over the internet.  There are even numerous Youtube postings with the exact same problems as in my DEFECTIVE SAMSUNG model, as well as the same DEFECT in many other DEFECTIVE SAMUNG models.  This defect occurs upon start-up, and lasts for the first 15 minutes of trying to view a program. Then the picture gets progressively worse over time and continuously declines.I tried SAMSUNG's Executive Customer Relations Dept. and was told:  \"We will do nothing but refer you to a local Authorized Repair Shop.\"  They were downright blunt and rude to boot!  I feel robbed of $2,900.00!Furthermore, I was informed that the repair will consist of a diagnosis visit, and then another visit to install a replacement \"Panel\" that costs $1,300.00 for the part plus $279.00 to install, plus taxes......all told, another $1,719.16....at which point the technician basically stated, \"just buy another TV.\"SAMSUNG customer service also told me that their Televisions depreciate at a rate of 20% per year, and that they do not repair any of their products after 4 years!  Their own repair people told me to just buy a new set!!!If I save one family the heartache of losing they're hard-earned money on SYSTEMICALLY DEFECTIVE SAMSUNG TELEVISIONS, and a company that offers zero customer service....I'll be happy!  God bless....SAMSUNG CONS:No Customer SupportSystemic Panel DefectGhosting of imagesBurn-in on screenDistorted pictureVery expensive to repair", "Date": "February 18, 2014"}, {"Title": "Samsung... Never again", "Author": "Isbellja", "ReviewID": "RX48LU77RPV21", "Overall": "1.0", "Content": "I decided to purchase this model in September 2012 to use as a tv for gaming. Today is March 30, 2013... The TV shows no signs of life and will not power on... You do the math. TV picture WAS low quality. Turning brightness all the way up or having it all the way down seemed to look identical. TV shuts off after less than 5 minutes of inactivity if an input isnt being used. Sound for gaming is ok. The few times Ive tried to watch tv or a movie the volume had to be turned all the way up to hear from less that 5 feet away.  I would not recommend this product to anyone, and I most certainly will never buy a samsung product again. The brand is hyped to be something special but every Vizio I have in my household is better quality wise and has lasted longer. $200 for 7 months of use, money wasted in my opinion.", "Date": "March 30, 2013"}, {"Title": "Great Samsung TV", "Author": "Larry", "ReviewID": "R75RE6GRVZ9MJ", "Overall": "1.0", "Content": "This Samsung TV is just what I wanted for the bedroom.  Great size, great picture,and most of all an easy to use sleep-timer--", "Date": "March 20, 2013"}, {"Title": "Nila Martinez", "Author": "Nila Martinez", "ReviewID": "R3GOXNZ0ZHPBAE", "Overall": "5.0", "Content": "It implies very ultimate product which I have been searching for other room. I am grateful for the ​very safety quickly and surprise convenient service.", "Date": "March 14, 2013"}, {"Title": "No PC input", "Author": "dalepres \"dalepres\"", "ReviewID": "R1CSNEDESLI1WR", "Overall": "3.0", "Content": "I bought this to use as a computer monitor/TV combination.  I should have paid more attention to the pictures but they don't truly show that it doesn't have a VGA input.  I haven't seen a TV that didn't have VGA inputs (I'm sure they exist) so it just didn't occur to me that it would not.  Why would I buy a 200 dollar 22 inch TV except to use it as a monitor/tv?  I can buy a 22 inch tv for 129 at the local big box and probably on  Amazon, too.  So, as a TV it might be fine.  But it is an under-featured TV for its price so it gets three stars.I may return it or I may not.  I've ordered a VGA to HDMI adapter cable with no idea if it will work or not.  Apparently that requires a video card that outputs digital in the VGA out rather than analog.  I don't know if mine does or not.  If the cable doesn't work, that won't reflect on the cable but it does mean this TV has to go back.", "Date": "March 5, 2013"}, {"Title": "22\" Samsung hdtv", "Author": "cr-618", "ReviewID": "R2U5ZB2HY9D6WF", "Overall": "5.0", "Content": "This is a great hdtv ,we have it in the kitchen we have a 19'' 720p this 22'' 1080p. Great picture...", "Date": "February 16, 2013"}, {"Title": "Samsung UN22D5003 22-inch LED HDTV", "Author": "Willa E Hammond", "ReviewID": "R1J052SZ2BVTEH", "Overall": "5.0", "Content": "The size was perfect for the area where it was to be used. Very good reception. Very pleased with this purchase.", "Date": "February 14, 2013"}, {"Title": "THE BEST TV TO BUY", "Author": "BEVERLY A. CARROLL", "ReviewID": "R2NCMYO2EGYPNO", "Overall": "5.0", "Content": "I have a 46 inch Samsung HDTV-LCD, four years ago. I thought it was time to upgrade my television in my bedroom. Being as the Samsung has been number one for years, and that I have enjoyed my 46 inch, I , of course, had to get the Samsung. After looking for a great deal, I found the deal at Amazon.com. This 22 inch is a perfect size for my bedroom. The LED, I honestly do not see the big difference between that and the LCD. Always make sure you get a TV, with the 1080p. It does make a difference. Also, whenever you do buy a new HDTV, you do need the HD service with whatever you use for the programming. Without it, the picture looks too wide, and you can not change that format. Also, the color is much better and you don't have to change the adjustments each time you change the channel. I had mine for a week without HD service, and did not like what I was watching. Once I did get the service, my TV is a great as my 46 inch is. No matter what brand you choose, make sure you do get the HD service. This is very important, no matter what salesperson tells you that it does not make any difference. The latest is the LED, so stick to that. The LCD is going out, and that is why you can get super deals right now.  Like I did say, my LCD satisfies me 100%. If saving more money is what you want, and do not care if it is the LED, by all means buy it. Now this model is suppose to be 2011. It didn't turn out that way. Mine was made in October, 2012. It is the super slim model. Really light in weight. This is also the Series 5, which also means the best to buy. Really, Samsung is certainly the best choice in the Television entertainment world. You can not go wrong in this choice. You would thank me for giving you this advice. Good luck.", "Date": "January 28, 2013"}, {"Title": "Good but a little disappointing", "Author": "Beachcomber79", "ReviewID": "RSGAY68R3DY05", "Overall": "4.0", "Content": "I just bought this LED HDTV.  I also have an LG LED HDTV which I love so am comparing to that.  The Samsung is super easy to set up, however no matter how much I tightened the screws on the stand, it still wobbles.  I should probably try using some washers and see if that helps.  My LG has no instability at all.This TV has great colour and has a USB input which was one of the criteria for me.  I tried a USB that I have some movies on, but the TV will only recognize and play either Photos or Music - it does not have an option to play movies and it won't.  I don't know if this was mentioned somewhere in the information prior to me purchasing and I assumed it would play movies on my USB stick as my LG will play whatever is on the stick.  This to me was very disappointing which is why I gave it 4 stars.  I recently purchased a new Blu-ray player that has a USB input so I play movies on the memory stick via the Blu-ray player, but I am still upset that the TV won't play them.  I do realize this was the 2011 model, but my LG LED TV is about the same age.Other than that, it's a great TV and I got it for a great price.", "Date": "January 5, 2013"}, {"Title": "Great Value", "Author": "A. Rey", "ReviewID": "R19T9YWI9HAL32", "Overall": "5.0", "Content": "TV is a solid choice and a terrific value. I am using it as a computer monitor and am very happy with my purchase.", "Date": "January 5, 2013"}, {"Title": "Unusable picture", "Author": "George LaMontagne", "ReviewID": "R2BD0JP4I1K39V", "Overall": "1.0", "Content": "Picture has flat colors with no brightness and no contrast with all adjustments set on full. Can only be viewed in a totally dark room without eye strain but the picture is still nearly useless. Save your money and buy a Panasonic or Sony. This is my second Samsung clunker product.", "Date": "December 27, 2012"}, {"Title": "Sold on Samsung video", "Author": "RJ", "ReviewID": "R2I1LPKLG32I1B", "Overall": "5.0", "Content": "TV is great, only complaint is looking up at it (below center line)  Gets very dark.The higher up you go, the brighter it gets.  I have a big Samsung in the living room, and2 wide-screen Monitors for my computers, all Samsung.  One Computer monitor doubles asan HDMI video source from my cable box.  So I have Hi-Def in my man-cave.  The side-to-side viewing brightnessis very consistant.  ONE REAL PLUS for Samsung, is they ALWAYS include REAL BUTTONS on thedevice itself.  Too many TV and monitors, now are button-free, and if you don't havethe remote, you're dead in the water.  I am sold on Samsung video.", "Date": "July 24, 2012"}, {"Title": "I love this TV, but I hate SAMSUNG's customer service.", "Author": "MASA", "ReviewID": "R389Z7BU6A2YXW", "Overall": "5.0", "Content": "This LED TV's picture quality is more than my expectoration, it's beautiful.Problem is I cannot register my TV via SAMSUNG USA web. I created my account, no problem, however SAMSUNG web's drop-down list for product registration doesn't have my TV's model #, UN22D5003BF, therefore the registration hasn't be completed, yet.I called to SAMSUNG's customer service but I couldn't get anybody within 10 minutes. So, I tried to sent e-mail to SAMSUNG's customer service but it's required to select model # from drop-down list.I haven't seen this much stupid web-config.", "Date": "July 14, 2012"}, {"Title": "Super", "Author": "X", "ReviewID": "RUEQ2B7LY9JYS", "Overall": "5.0", "Content": "This was a very good buy.  Shipping was very fast and the set works great.  The price was better than going to a box store.", "Date": "June 30, 2012"}, {"Title": "Rattles!", "Author": "greg pierce", "ReviewID": "R223PP7G1E2CS", "Overall": "2.0", "Content": "It's probably a good t.v. When I got mine something was rattling around inside. I returned it, and was advised I would be getting a gift card for my trouble.Still waiting on that.", "Date": "February 7, 2012"}, {"Title": "TV is good, but the TV -was- falsely advertised.", "Author": "Billyg0at1991", "ReviewID": "R3OQJH35K2Z9TE", "Overall": "4.0", "Content": "I'm completely happy with the TV itself, except for the fact that it is smaller than I expected. There's only one major problem, though. When I bought this, Amazon had it listed as 120hz. Despite reviews saying otherwise, I figured that Amazon would at least be reliable in their product title/description. The fact that it's now listed as 60hz is incredibly frustrating. I could have gotten a bigger 1080p tv for the same price, but purposely went for this one because of the supposed refresh rate. Now TV prices have gone back up because it's after black Friday, and I'm left with a product that's different from the one I was promised. Thanks a lot, Amazon.", "Date": "December 3, 2011"}, {"Title": "Nice TV however it Died after 1 hr of watching it", "Author": "Tony", "ReviewID": "R3SY2E8K05I1F0", "Overall": "1.0", "Content": "TV had a great picture and sound, however after approx, 1 hr of watching it, it died. Not sure why, however I was very disappointed with Samsung customer service, and to me that is the most important part of buying a product. They did not want to listen that i only watched it for 1 Hour, all they cared about is that i get it fixed at Marco's TV and Repair. The TV only cost $200, and now it will cost them at least $100 to fix it, and now have to wait 2-3 weeks for it to get fix. In the Past i only bought Sony becasue they had great customer service, however i wanted a small TV with 120hz refresh rate, and this sounded like a great TV, and it was for 1 hr. i just wish Samsung would have replaced it with another TV, instead of me going across town looking for this place", "Date": "December 1, 2012"}, {"Title": "Pixel problem", "Author": "Mark", "ReviewID": "R17NHBPI9VR919", "Overall": "1.0", "Content": "Great picture for 3 months or so.  Then .... one white pixel appeared on the screen.  No more in next few months, but if you are particular that becomes what you see.  Under warranty, but not worth the hassle as due to its size, you have to ship it to NJ which is the closest center to where I live, 1500 miles away in St. Louis.", "Date": "March 21, 2012"}, {"Title": "No VGA", "Author": "PaulaG", "ReviewID": "R1XM3I0Z60B5CX", "Overall": "3.0", "Content": "I misunderstood the PC input feature when I bought this TV. I wanted a TV and monitor in one as my laptop is VGA only. I bought an HMDI to VGA converter, which worked once then sent my laptop into a tizzy. I am returning it for that reason alone.I bought it on sale, so the price was great. The picture is very good but the sound is tinny. If I were to keep it, I would fiddle with the audio settings to see if I could improve the sound.", "Date": "December 26, 2011"}, {"Title": "Not a 120Hz.", "Author": "octavarium02", "ReviewID": "R37I41E9FOFDRI", "Overall": "3.0", "Content": "This TV does not have a 120Hz refresh rate as advertised! I can tell because I know how a 120Hz rate looks like and also if you play a DVD movie with an HDMI cable, it will tell you (on the TV display) the rate (60Hz). I haven't tried with a BD player, but I don't think it'll make a difference. Everything else about the little TV is GREAT!", "Date": "November 25, 2011"}, {"Title": "Frustrated", "Author": "Busyfella", "ReviewID": "R18OWQ6MPQVC5Z", "Overall": "3.0", "Content": "As for watching TV, the Samsung is great, both in picture quality and control.  My frustration is that I was buying the TV for use by a bedridden resident in a nursing home who needs to watch TV listening to the sound with ear buds.  I was totally unprepared that a TV would not have an audio jack as standard equipment and have wasted time and money trying to resolve the problem (to no avail).  I'm OK that some TV's do not have audio jacks, but when a TV does not, there should be a boldface warning to buyers.  I am real disappointed in Amazon in not making that disclosure.", "Date": "November 2, 2012"}, {"Title": "Disappointed", "Author": "Loie", "ReviewID": "R2IEFHQGOAWJ0D", "Overall": "1.0", "Content": "The sound is terrible. I bought external speakers only to discover there was no audio outlet. The new speakers are now gathering dust and I have to crank the sound up to max to hear it across the room. The picture is not bad. Big mistake!", "Date": "January 6, 2012"}, {"Title": "So nice!.....", "Author": "drummergirl60", "ReviewID": "R22GP10DK9OSVJ", "Overall": "5.0", "Content": "This is so nice and handy. Would definitely recommend! Nice phone protection and a place for cards and money....great to carry to places you don\"t want or have to  carry a bulky purse.", "Date": "February 15, 2013"}, {"Title": "Samsung kitchen TV", "Author": "Terry", "ReviewID": "R1077KN2I8JON2", "Overall": "5.0", "Content": "TV arrived in a very timely manner, good condition. Worked well right out of the box. Easily set up with minimal difficulty.", "Date": "December 13, 2011"}, {"Title": "Poor manufacture", "Author": "Robert Greathouse", "ReviewID": "R31U3J6ABYJTY8", "Overall": "1.0", "Content": "The base does not attach securely to the TV. In order to work my girlfriend has to prop it up with a book. I was going to return it, or make a shim for it, but she doesn't want to fiddle with something when she has a working solution. Go buy another TV that will connect with it's base properly and be able to stand up.", "Date": "February 20, 2013"}, {"Title": "not 120 hz dont be fooled", "Author": "jorge", "ReviewID": "R3KO3RBC4Z0E21", "Overall": "3.0", "Content": "i bought this tv because it sounded too good to be true. so it was. Don't get me wrong this is an awesome little tv good sound good picture is good too but its no 120 hz i have a lg 42 inch lcd tv i bought on amazon there is no comparison lg 120 hz true motion killed this this samsung", "Date": "October 5, 2011"}, {"Title": "Samsung 22\" LED 1080P  HDTV----Short in Height", "Author": "jbroc \"jbroc\"", "ReviewID": "RF9XI8NZSDOWT", "Overall": "3.0", "Content": "TV was well packed and in perfect condition, arrived as scheduled.  An Amazon purchase.The TV fit on the stand fine, was easy to hook up to ATT cable.  Then the instructions became weird.  I followed instructions 1 thru 3 exactly as written which is called ''plug & play''.  BUT, after doing Instruction 3, written below Instr 3 is the statement....\"Important, if your tv is attached to cable, skip step 3\" etc.........duh, I've already done that and it took me out of the Plug&Play; mode.Wouldn't common sense say that if you need to skip Instr 3 that would be written right after Instr 2  ??Well I had to wing it on my own, could not get it to scan and save channels, & other things in the Plug&play; set up. Never have taken time to find out how.The sound on this tv is fine, not sure why all reviews on tv's this size get all upset about the sound so much.The picture is good, it has good tint, color and brightnes.BUT, THE 1st THING I NOTICED WAS THE HEIGHTH OF THE SCREEN....TOO SHORT AT 10.6 INCHES.  I REPLACED AN OLD 19\" TV WITH A SCREEN HEIGHT OF 12 1/2 INCHES.The area of the rectangular screen on the Samsung is 196.8 square inches, and on the 19\" is exactly 196 square inches.  Holy Moly..I would have figured a 22\" tv would have at least 40 sq inches more than a 19\" tv, not less than 1 square inch more.  YOU WILL DEFINITELY NOTICE THE SHORT HEIGHT OF THIS TV.I guess you could sell a 22\" tv with only 3 inches in heighth...never gave it a thought.  I never saw anyone address this problem in reviews.  It's the only reason I gave it 3 stars and not 4.", "Date": "September 9, 2011"}, {"Title": "no on/off switch", "Author": "Glenn Camp", "ReviewID": "REW5YROYYRVA9", "Overall": "2.0", "Content": "This model Samsung does not have an EXTERNAL on/off switch. No way to turn tv on or off except with the remote. My remote quit working and I couldn't get the tv to turn on in order to set-up a universal remote and could not turn the tv on. I took it to BEST BUY for them to rectify the situation and 'they' had no way of turning it on either.I had two remotes and neither would work.", "Date": "August 17, 2012"}, {"Title": "Samsung", "Author": "Tommy", "ReviewID": "R2ZX4ZCOJCQAHY", "Overall": "3.0", "Content": "When I ordered this TV, I expected it to be 32-inch one but it turned out to be the 22-inch. I made a mistake while reading the size of the TV, anyway the TV is not bad. It's fair, especially for computer display!!", "Date": "October 8, 2012"}, {"Title": "color is strange", "Author": "frank", "ReviewID": "R2PVNOX4BU79KA", "Overall": "3.0", "Content": "i connect this tv with my computer via hdmi. the color is really piss me off ,i adjust the setting again and again ,its still not that good! even worth than my original asus LCD! i mean ,dude ,this is samsung, almost the best monitor brand in the world. one word,disappoint !", "Date": "November 22, 2011"}, {"Title": "NOT 1080p Viewable", "Author": "mk", "ReviewID": "R325FYL2C7QRW2", "Overall": "1.0", "Content": "I bought this to use as a computer monitor.  DVI -> HDMI.When running at 1080p with Windows 7, the task bar, title bar, and leftmost desktop icons appear BEHIND the plastic molding!I had to lower the resolution to see the task bar.At lower resolution there is some dead \"black\" space in the margins of the viewable surface.This might not be noticed if used as a TV.", "Date": "December 28, 2011"}, {"Title": "NEVER BUY SAMSUNG!!!!", "Author": "LLN", "ReviewID": "R2G1C8FRD0OGVF", "Overall": "1.0", "Content": "I bought a Samsung tv in 2008 for over $3,000 which has since become a paper weight because Samsung REFUSES to support it product. It has taken a class action law suit to receive any customer service from this company and the lawsuit was so narrow that it missed an additional issue that thousands of the affected tv's were beset with: faulty mainboards. This company is terrible and should be shut out of the US market for selling junk. DO NOT BUY THEIR PRODUCTS!!", "Date": "January 9, 2013"}, {"Title": "TV", "Author": "Jasmelina Pugliese", "ReviewID": "R33PPIDK5DMY7S", "Overall": "1.0", "Content": "Unfortunately I couldn't see if it would've been a good one or not, normally I have no problem with Samsung products because I do own a few of them, but this one I have no idea what had happen that came to us broken and I didn't bought another one so far.", "Date": "January 1, 2012"}, {"Title": "BAD TV", "Author": "A", "ReviewID": "R2OBBF10KWKGV7", "Overall": "1.0", "Content": "I WAS UNDER THE IMPRESSION THAT I WAS GETTING A GREAT DEAL ON A TV THAT WAS IN AN OPENED BOX.BUT WHEN I TRIED TO TURN IT ON THERE WAS NO PICTURE MADE A STRANGE SOUND AND HAD  A BURNING SMELL.THEY SHOULD OF TESTED IT BEFORE ATTEMPTING TO SELL IT.", "Date": "March 31, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "1080p resolution\n1 USB (JPEG/MP3)\nModel number: UN22D5003\nClear Motion Rate 120", "Name": "Samsung UN22D5003 22-Inch 1080p 60Hz LED HDTV (Black) [2011 MODEL]", "ImgURL": "http://ecx.images-amazon.com/images/I/31K2up5aSCL._SX300_.jpg", "ProductID": "B004VRJ3E2"}}