{"Reviews": [{"Title": "Average TV", "Author": "RW", "ReviewID": "RYJ4154M55URZ", "Overall": "3.0", "Content": "I have a 4 year old, 52 inch Sony Z series TV.  The Z series is the quality level just below the top-of-the-line XBR series.  My Z set has a refresh rate of 240 Hz.  I expected the KDL40BX421 to have as good or nearly as good a picture as my old Sony Z.  After all, the technology has improved a lot during the last four years.Boy was I wrong.  The picture on the KDL40BX421 is not as sharp and the colors in the red palette are not nearly as good.  The KDL40BX421 has a slightly washed out appearance.  I have spent time trying to adjust the picture but to no avail.  By comparison, my old Sony Z has an obviously superior picture.Another problem with the KDL40BX421 is that it doesn't take much action to cause blurring.  A moderately fast camera pan is going to cause a little blurring.  Perhaps, a 60 Hz refresh rate should be limited to 32 inch sets.Also, the KDL40BX421 has rear facing speakers.  I know its common but why?  Additionally, the KDL40BX421 has no controls on the set.  The only way to turn it on or change the volume and channel is through the remote.In May 2012, I paid $336 in a Sam's Club auction for this set.  Shipping and tax cost another $105.  Delivery took about 11 days.  However, if I had waited just two weeks, I could have saved some.  For a while Sam's was auctioning one to two of these sets every day.  The winning bids at the start of June 2012 were usually around $250.", "Date": "May 31, 2012"}, {"Title": "My first LCD -- and it was a good purchase!", "Author": "Rambo", "ReviewID": "R3H41M1RDBNWSJ", "Overall": "4.0", "Content": "I purchased this tv right before Christmas 2011 on eBay. It has three HDMI ports that you can use for a better picture and sound quality. The tv is very good in my opinion. I cannot say it displays crystal clear pictures but, for a non-videophile, I believe the pictures are really good both from cable HD channels and from streaming services like Amazon Video on Demand. Reviewer RW says there are no controls on the set and that your only option is the remote. Incorrect. Power button and volume control are on the right side of the unit when facing it. So far, i havent had any problems with this tv though I just bought another bigger model to replace it (while I transfer this one to my bedroom -- it will replace an old CRT). It isnt the best tv on the market -- of course not -- but it is a good purchase from the Sony BX line, which is their lower end Bravia products.", "Date": "March 13, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "Sony 40\" Bravia BX421-Series HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41jjYeP5F7L._SY300_.jpg", "ProductID": "B0053EUH42"}}