{"Reviews": [{"Title": "Perfect for my needs", "Author": "Jason Troxell", "ReviewID": "R2TAU5NJQOQVCT", "Overall": "5.0", "Content": "I just set this TV up yesterday, and paired it with an LG BD570 blu-ray disk player - I couldn't be more pleased.  This is our third LG TV and also our third LG Blu-ray player.  The TV is easy to set up, and to my untrained eye, the picture is great.  The built-in picture wizard easily gets the TV looking the way I like it.  My only complaints are that 1) I wish this was offered with a 120Hz refresh rate (I can't tell the difference right now, but one day we will have video games connected and I suspect it might show up as a problem then; I'm not docking the score because I bought this TV knowing it was 60 Hz), and 2) on our previous LG TVs the TV remote control had basic buttons for controlling the Blu-Ray player - the remote for the 32LV3400 does not.  Fortunately, the remote for the BD570 still has basic controls for the TV so I can use that remote for both.  I'm sure the speakers in the unit could be better, but for my current purpose they are adequate.  Now it just stands to be seen how the long-term durability is...", "Date": "December 4, 2011"}, {"Title": "Great TV, but Had Some Issues with Wall Mounting.", "Author": "David Baltazar", "ReviewID": "RGDEW073PLCZE", "Overall": "3.0", "Content": "This review is for; LG 32LV3400 32\" 720p 60Hz LED HDTVThis is a great 32\" LED set with great picture, sound & features, but it presented me some challenges when I had to mount it on the wall. To begin, the output connections for the HDMI & component cables protrude directly in the back of the set right near where my VESA wall mount brackets are mounted, which didn't give me much room to allow the cables to be connected (especially the large HDMI cable I'm using). It would have been nicer if the output connections were aimed sideways or downwards for wall mounting purposes. Also, for a super thin LED set (which it is) it is actually pretty heavy at almost 28 lbs, when compared to a Vizio brand 32\" LED set which I previously owned that only weighed about 14 lbs or a Samsung 32\" LED set that I saw in the store that only weighed about 18 lbs. The PC inputs & USB connections on the back of the set allowing me to connect my PC are a great bonus. Otherwise, this is an excellent set for the bedroom that I am using it for.", "Date": "August 24, 2011"}, {"Title": "it ok", "Author": "dsan", "ReviewID": "R181V32HUN4KNB", "Overall": "3.0", "Content": "payed a little more than i think should have but very nice small flat seems to work great for a monitor or a vidio game system", "Date": "April 11, 2013"}, {"Title": "Good TV", "Author": "electronicsrule", "ReviewID": "R29MOW1942QWCQ", "Overall": "4.0", "Content": "I had this TV in my room and it was awesome! Sound was acceptable from the unit speakers and the picture is great. The LED definitely creates a more vivid and rich picture. Yes its only 720P but for any of you that know anything about TV's you CAN NOT tell the difference from 720 to 1080 for TV's under 50 inches. Great bang for the buck I would recommend.", "Date": "April 6, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Aspect Ratio: 16:09", "Name": "LG 32LV3400 32\" 720p 60Hz LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51FNKT8VMFL._SY300_.jpg", "ProductID": "B005H73OJK"}}