{"Reviews": [{"Title": "Good value - Good video - Poor audio", "Author": "E. R. Wright \"the sweet rose\"", "ReviewID": "RXB61MIOCIXLW", "Overall": "4.0", "Content": "I needed to upgrade a bedroom TV to receive HDTV w/o an external tuner. Who wants to spend $150 for a tuner with HDMI when this TV is $300? I liked the idea of the lighter weight and possible longer life of the LED backlight. I'm impressed with the tuner and the picture but the audio is a throwback to the tinny speakers of old. No bass or midrange. I think it may even be mono? (gasp!). Fortunately I have a Home theater receiver in the bedroom so disaster averted. If you don't have a home theater even a good PC speaker system with a sub would be far superior. Overall satisfied to get a name brand with a one year warranty and LED backlighting for the price.", "Date": "November 20, 2011"}, {"Title": "Great bedroom television", "Author": "J. Mojica \"JM512\"", "ReviewID": "R135VKOFGQAREJ", "Overall": "5.0", "Content": "I did a lot of research for a 32 inch TV for my bedroom for $300 and I didn't have much choices. Luckily Amazon had one for my price range. It's really is hard to find a TV with these specs for that price.The TV looks great, but the audio is lacking. It sounds like there's no bass, but most people have home theaters now in days. And if anything you can also just hook up some external speakers.I just got it today, but I'm happy with it already. The TV also has an internal tuner so I get all the free local channel.At the end of the day its almost impossible to find a 32 inch LED for less then $400.", "Date": "November 22, 2011"}, {"Title": "Amazing Deal:):):)", "Author": "Udit", "ReviewID": "R1C85BKTKH8T8H", "Overall": "5.0", "Content": "I don know what i should write for such an nice product...LED tv for a cost of 310$ is unimaginable....I am so very happy with this TV...there were no reviews written for this product before when i was planning to buy it...but then i did some R&D; and finally decided to buy it...I got an amazing deal with Amazon...Its a nice standard LED with great picture quality...Truely loved it.", "Date": "November 17, 2011"}, {"Title": "A great price for a good tv.", "Author": "M. Boyer", "ReviewID": "R2IXF0TGYU21UX", "Overall": "4.0", "Content": "For $300, this is a good tv. If you have to pay over $340 for it I would look elsewhere. I was nervous about my purchase because while waiting for it to arrive, numerous reviews had been added that were not very favorable. When I hooked up the television and turned it on for the first time, I was disappointed. The television is very blurry and subpar when not connected to an HD source. When I did connect it to my PS3(HDMI) and computer though, it was much better. It has a very crisp display, and with some adjusting to the picture settings (fyi, there are two different menus on the tv for adjusting these settings, one has a lot more options. Make sure you go to the right menu), it gets even better. I bought it planning to use it for a homemade racing simulator, in which the television would only be less than 3ft away from me. I can easily say that it still appears extremely crisp and clear. I'm confused about other reviews that claim they can see the pixels when viewing from a close distance, when I am viewing the tv from an extremely close distance and don't notice any. It does have a really clear picture in HD. I'd rate the picture - HD = 4.5 out of 5, SD = 2 out of 5.  Something I can easily agree with other reviewers on is how bad the sound is. If you check the LG website you can see the specs for the audio are terrible. The speakers are only 5 watts each, and they are on the back of the tv facing away from you... They can get loud though, that is not the issue. The issue is that they sound completely horrible. There is literally no bass in any way, and the midrange and treble sound distant, and they echo. It really is as bad as you can imagine. Only get this television if you are hooking up some sort of speaker system to it, or you don't care in any way about sound quality. I have a cheap 5.1 surround sound system hooked up to it and it works great. Something to note also, the tv does NOT have any typical RCA Audio outs (red & white) on the back, it only has a Digital Optical Out for audio. Just an FYI. I'd rate the sound quality a 1 out of 5.  Something that didn't matter to me, but is a nice touch, is that the tv is extremely light (14.4 lbs), and extremely thin. If those are features you are looking for, this television definitely has them.  I gave this tv a 4 out of 5, because it does everything I expected it to do. I had already planned on having it hooked up to an HD source at all times, and I had also planned on always having a surround sound system hooked up to it. This 32\" LG LED for $300 is a good deal, if you understand what you're buying it for, and how you will be using it. I hope this review helps your decision in some way. Thanks.", "Date": "December 5, 2011"}, {"Title": "excellent gift", "Author": "quality1", "ReviewID": "RMRP127NG8UGC", "Overall": "5.0", "Content": "My wife and I bought this TV for my mother-in-law. You can probably buy a cheaper TV of this size between $ 200 - $ 250. Though it will be an off brand like Dynex, etc. We made the best decision to trust the name LG. This TV has an amazing picture quality for this size and price. You can't go wrong with it if you are considering to buy. 32 inc is an excellent choice if you don't have a huge room or if you have a den to watch TV. It is very easy to set up and get going. I read some mixed reviews about the sound quality. I don't have any complaints about sound quality either. Maybe I am not as picky, but this TV will get you excellent picture.", "Date": "November 26, 2011"}, {"Title": "Garbage", "Author": "Marka666", "ReviewID": "R3AEYM7PE810B0", "Overall": "1.0", "Content": "Bought two of these TVs for Christmas gifts. Returning both. One of them had a problem where the sound would just go off by itself every 5 mins. The other one, in addition to this problem, would actually just turn off completely by itself every few minutes as well. Should have known better than to buy an LG TV.", "Date": "January 6, 2012"}, {"Title": "Defective", "Author": "Carlos", "ReviewID": "R8801NQZ473LG", "Overall": "1.0", "Content": "This television didn't even last 2 months and it no longer turns on. Good thing amazon has a holiday return policy. Would not recommend.", "Date": "January 1, 2012"}, {"Title": "Audio is horrific...and we weren't expecting anything amazing", "Author": "hlgtn", "ReviewID": "R1DG3KPMURNJ77", "Overall": "1.0", "Content": "We were so excited about the deal we got on this tv, and based on the reviews available at the time, it appeared to be better than the other similarly-priced options we found. After doing A LOT of research on several sites, we decided to go with this model.Once we set the TV up, we were appalled by the quality of the audio. As some others have said, our clock radios (both at least 10 yrs old and bought quite cheaply...$10-$15) honestly have better sound than this TV did. After watching for about 5 minutes, you got used to the sound, but after FF through some commercials and hearing it again after silence, it was awful. Knowing how much it would cost just to make this acceptable, we chose to return it.We were aware that these TVs are made with the expectation that the consumer will likely hook it up to some amazing surround sound speaker system and such, and maybe someday we will. But right now, the sound on a TV we spend any kind of money on needs to meet at least basic TV watching audio needs. We are pretty easy-going and are not \"audio-philes,\" as I've heard them called, but the audio on this model was simply unacceptable to us. And given our low expectations and needs, that's really pretty frightening.We ended up buying another LG, a different model, at a store where we could judge sound prior to purchase for ourselves. We were also please with the Panasonic Vierra's sound when we heard it at the store.", "Date": "December 27, 2011"}, {"Title": "Great Value", "Author": "J. Mccoid \"Coffee Snob2\"", "ReviewID": "R3CTEI2MFT7CSR", "Overall": "4.0", "Content": "This TV was purchased as a replacement for a smaller model.  For $300, you can't get much more.  It has several different options for picture and sound. It also has an auto-off and auto-on settings.  If you are an audiofile, get a surround sound system, but don't complain about an adequate sound quality.  It's a great value!", "Date": "December 3, 2011"}, {"Title": "Not bad for 300$..", "Author": "Unknown", "ReviewID": "R2O6GLZ8DQRX3D", "Overall": "4.0", "Content": "First off i am no TV expert or TV-phile type of person.This review is coming from a College Student on a budget, Found this great deal on a LED TV 32inch.Its not Crazy Thin..But its pretty lightweight.. weighting at 14lbs. (i can pick it up with 1 hand) just kidding about the 1 hand thing.I know you can get this same spec TV at lower price, but i rather go with a more reliable brand than some other brand that i never heard of before.The Screen and picture is really bright and sharp. Not too bright that it will hurt the eye after watching for long period of time.Intelligent Sensor automatically optimizes the picture to the lighting and color conditions in the room for a more enjoyable viewing experience720p & 60Hz is better than i expected or maybe i haven't own a TV for the last 5 years lol, but i am really amazed.The viewing angle is great! The only problem is the Audio is lacking a bit, standing or sitting certain angle the audio won't sound that great.external speaker or home speaker system will be a great way to solve that problem.Energystar qualify!Overall, Its a great TV for people like me College Students.", "Date": "November 28, 2011"}, {"Title": "PC Speakers work with this TV!", "Author": "squidracerX \"squidracerX\"", "ReviewID": "RGFCIP4U3BVQN", "Overall": "4.0", "Content": "A large group of people out there do not know a lot about what connects to certain TVS, like soundbars and speakers etc... (Me included!). I see lots of reviews saying people buy soundbars and then cant hook them up to their TV without buying new cables etc.... And one of the negatives on this TV is the sound quality, its not that it is \"bad\" sound, it is just a flat TV that doesn't have \"great\" sound. Sometimes I find i need to crank the sound waaaaay up and its still not that loud. I went to Best Buy as was told i needed a soundbar and that PC speakers would need an expensive adapter... . My room is small and soundbars are expensive, so i was just going to deal with the less than perfect sound. But i tried my PC speakers on a whim yesterday, and they worked fine! You will want to buy quality PC speakers, but that is way cheaper than a good soundbar. And the volume control on the TV worked on the speakers (if i turned them up on the speakers themselves, and went down to 0 (zero) on the TV the sound was still fairly loud out of the speakers, so it doesn't go to zero unless your speakers are way down (so it may not be PERFECT). But the fact that it does work in the optical out plug, and that the remote defaults to raising and lowering the sound is something i do not think all of these new TVs do? And this was a huge bonus to me!TV has been fine and i am happy with it after a year!", "Date": "December 2, 2012"}, {"Title": "Save your shipping box, you'll need it for return.", "Author": "P. Johnson", "ReviewID": "R2C4JGO679K2WF", "Overall": "1.0", "Content": "I bought this TV in on November 28th, 2011 and am returning it in January 2012, barely used.  While it worked, it was great.  Then, the power light came on but there was no picture.  No, it's not the remote, the buttons on the TV don't work either.  It's defective.  I must say though, Amazon is making it very easy to ship back for a refund.", "Date": "January 20, 2012"}, {"Title": "Fantastic TV!", "Author": "DCNats67", "ReviewID": "R12NNTD3KEPB09", "Overall": "5.0", "Content": "When my Toshiba 37\" LCD starting to die out, I was in desperate need of a TV. Downgrading in size from a 37\" to a 32\" didn't go well with me, but for the price ($308.00), I decided to buy it. I didn't know much about LEDs beside the fact that the TV's are very thin and lightweight. I ended up being very, VERY pleased with this TV. I use my TV mostly for my Xbox 360, and the visuals are just fantastic. The only negative thing I would say about this TV is the audio is pretty crummy, but most people (like me) have a speaker system of some sort and don't use the TV audio very much. It sure isn't enough to NOT give it 5-Stars. If your in the market, this is a GREAT TV!", "Date": "January 3, 2012"}, {"Title": "great lil tv", "Author": "I'm not rick james", "ReviewID": "R25HRNT49MNRJ6", "Overall": "4.0", "Content": "I really like this lil tv.  The sound is ok  at best,  but one shouldn't rely on tv speakers  for  enjoyable tv watching anyways.The picture is really nice,  even standard cable channels look alot better than my old toshiba lcd.The digital channels that this thing picks up  looks really good.  Didn't have to adjust anything  when I hooked it up.  Just let it find the channels  and started watching tv.  So far  xbox 360 games look really good,  and Idon't see any lag.  I'm giving it a 4 star because  the remote  should have a few more functions.If you can get this tv for around 300 give or take,  you will be getting a good deal( :Thats my honest take  on this nice tv", "Date": "January 3, 2012"}, {"Title": "no good experience", "Author": "Rk", "ReviewID": "R1D2SUOD5NZYS6", "Overall": "1.0", "Content": "This product stopped working completely within 1st month of its purchase ! not at all a good experience with this TV. Packing this tv to send to the store for refund. disappointing experience !!!", "Date": "January 1, 2012"}, {"Title": "Awesome", "Author": "Sri", "ReviewID": "R2V8UR60DXEY8B", "Overall": "4.0", "Content": "This is my first flat panel (LED/LCD) TV, and its amazing. I have seen some of the best LED/LCD TVs in the market, but if you need something with no frills and a great picture this is the one. The colors are vibrant and picture is very sharp. Its looks very sophisticated, slim, elegant and also is light on weight. The only thing I am not that satisfied is with the audio, but after reading many of the reviews on this product and others, I have figured out that it's a universal problem, so I can live with this. Had this for almost three weeks now, no problems and regrets. Over all I would say this is a rocking deal.", "Date": "December 18, 2011"}, {"Title": "Great TV", "Author": "Lucy", "ReviewID": "RF3ZTT39OO7UE", "Overall": "5.0", "Content": "Great picture and sound, especially for the price. At first, I hooked-up the sound to an incorrect cable in the back and the sound was poor, however, once I changed the cable to the correct one, the sound was great and in stereo. At first the picture looked kind of dark, however, after a while it either adjusted itself or I adjusted it by changing the angle that I watch it. I turned it so that I am watching it directly in front of me instead of from the side. Since the TV has a swivel option, this was not a problem. Very happy with this TV. Very light to move as well. Thank you LG. Well done.", "Date": "December 8, 2011"}, {"Title": "Great picture; sub-par audio", "Author": "Ronin", "ReviewID": "RF8YFE19PLTIP", "Overall": "5.0", "Content": "As everyone has already pointed out, the picture is pretty good for a 32\". At this size, you cannot tell the difference between 720p and 1080p unless you are viewing it side-by-side and 2 feet away. This TV is great for small bedrooms. Audio lacks, but I don't know anyone who would buy an HDTV base on sound quality. Everyone pretty much plugs in some sort of audio system.Great product for the spec that it has. I really doubt you'll be able to find a cheaper one for the same quality.", "Date": "December 6, 2011"}, {"Title": "so satisfied!!!", "Author": "eun young Lee", "ReviewID": "R2MG81CV9OTLG9", "Overall": "5.0", "Content": "I think it is the best led tv for 300 bucks, clear color, thin shape than I expect, very easy interface. specially good for monitor for computer I love it!", "Date": "December 6, 2011"}, {"Title": "Great tv", "Author": "Robert John Pena", "ReviewID": "R3AKO2WVY9550V", "Overall": "5.0", "Content": "I just got this television and the picture is great! Also, this is really meant to be put in a bedroom as opposed to a bigger living room. The blacks are better than most others in this size that I looked at. The speakers are just about what I would expect from any other flat panel television so I am not sure what all the other bad reviews are about. One thing to keep in mind is that because the speakers point down it needs to be sitting on something to bounce the sound out to the viewers. This isn't meant to be hung on a wall as the speakers don't point backwards. I also decided to buy this one and not a 1080p because for this size you wouldn't be able to tell the difference. Save your money and go with this one and you will not be disappointed, I'm not.", "Date": "December 3, 2011"}, {"Title": "It works great for me!!!", "Author": "Yamile C.", "ReviewID": "R8QEG0JUQTJCU", "Overall": "5.0", "Content": "I'm a single woman that only had 1 Vizio 47\" tv in my living room. I decided that sometimes I want to watch tv in my room so this $300 32\" seemed like a good choice and it is!!I still haven't set up the cable box in the TV but I'm getting over the air HD channels and the picture looks great, maybe I'm not picky, or I haven't had a new TV in over 2 years, but I like how it looks, also my boyfriend said it looked pretty nice.About the sound... it's not the best sound ever, but definitely not the terrible thing that's been reviewed here, for me is enough to make me happy.My brother got the same TV two days after I got mine, he's using it to play games on his Xbox 360 and he seems very pleased too.", "Date": "December 3, 2011"}, {"Title": "Good deal", "Author": "Nick", "ReviewID": "R1TFRAOUYP309C", "Overall": "4.0", "Content": "Brand name 32\" LED TV for $299? Yup. Obviously the sound quality on this TV is lacking, but it's only about as thick as my two thumbs put together. Picture is nice. Hook up a couple of PC speakers with a sub and you will be plenty pleased with this TV for a small to mid-sized room. I wouldn't recommend this for your living room TV unless your living room is on the small-ish side. Overall, a great deal!", "Date": "December 1, 2011"}, {"Title": "Amazin", "Author": "Brian1r", "ReviewID": "R3GTRP46E7JWY0", "Overall": "5.0", "Content": "I been looking for the perfect tv and after having a look at this tv when I went to bestbuy I fell in love with the design, the price and the quality of the picture. The image is so clear it looks better than any LCD in the market plus the price of this led makes it ano brainer. Unlike the other reviewers I think the audio is pretty good it's loud, clear and very sharp.", "Date": "November 30, 2011"}, {"Title": "Legitimately Great with some caveats", "Author": "blek", "ReviewID": "REMR8BVN3KUJ6", "Overall": "4.0", "Content": "Great TV for the price. Outperforms other TVs with similar specs (720p 60Hz LED) at a much lower price point. The sound is definitely not good, but no other competitor has good sound. If you don't have a sound system, I recommend Altec Lansing BXR1220 2.0 Speaker System USB powered speakers. These are available for $11 and can be pored using the USB port on the side of the TV. Very nice solution to the speaker problems all HDTVs suffer from.", "Date": "December 7, 2011"}, {"Title": "'Brilliant Colors'? I don't think so.", "Author": "Buffy", "ReviewID": "R3JI0GMF784Y4Z", "Overall": "3.0", "Content": "Like several others, I purchased this TV on the 2011 Black Friday weekend for $300. I looked all weekend, trying to find a nice TV for a decent price. I had decided between either an LG or a Samsung. Now I'm thinking maybe I should have went with a Samsung. At the time I bought this TV, it had all good reviews. Not one complaint. I checked the reviews for it on Best Buy's website, too, and again, they were all good. It looked to me like a good deal. I had checked out LGs before and have never seen one for this cheap! But ever since the TV was delivered, I've felt nothing but disappointment.First of all, I knew the TV wasn't going to be crystal clear in SD. It's an HDTV, after all. But when I turned the TV on, the picture was grainy and blurry, and the colors were dull and flat. It was hard to even read the writing on my DirecTV menu! My old Sanyo TV, which is a very old and much smaller flat screen, made back when they first started making them, looks better than this brand new LG I just pulled out of the box. Yes, I was completely let down. But I told myself, I'd mess with the settings and adjust the picture, and see if maybe that could fix it. It didn't. I've had the TV for three days now. I've adjusted it several times since then. It's a little more clear (if watching from a distance) but I can't get the colors to look bright or even normal, for that matter. The white on this TV set is an off white. And the yellow looks almost as if it has some green in it sometimes. No amount of adjusting is making a solid difference. What's also frustrating with this set is that if you want the picture to look at least somewhat decent, you have to watch it from a far. I have a computer chair, which is placed in the left corner, below where the TV is sitting, and when I try to watch the TV from this chair, the picture becomes dull and hazy. I know someone mentioned in another review that it can be viewed from any angle, but I don't believe that to be true. Not from my experience with the TV. I do, however, have the TV set up high. Even so, if it can be viewed from any angle, the height shouldn't matter, and it totally does.Now a lot of people have mentioned the speakers. This is one thing that I don't have a problem with. Maybe I'm just not picky with the sound or maybe my old TV didn't have quality speakers. Either way, the sound doesn't bother me. The TV can get pretty loud, in my opinion. It sounds fine to me. It might be a little off when it comes to the bass, but I don't have a problem with that. My main problem is the picture.After I figured out I couldn't adjust the picture to look as bright as it's advertised to be, I decided to hook my PS3 up to the set and see if that made a difference. It did. The picture isn't quite as nice as my big screen Plasma TV in the living room, but it does look much better in HD than it does SD. Granted, I only played my PS3 on it that once. And this doesn't change the angle problem. HD or SD it still looks hazy and dull when viewed from the bottom left corner. And the colors still aren't overly bright. But it is much more crisp in HD.A few more things I think I should mention. The TV is slow to turn on. It doesn't instantly come on. Takes about five seconds, maybe a little more. I'm also not able to program my DirecTV remote to it completely. Volume and input works, but for some reason, my remote won't turn the TV off. Because of this, I have a second remote I have to use. One nice thing about the TV, that I don't think anyone has mentioned, however, is that it has a very easy to move swivel. You can turn the TV to the left or the right, depending on how you want to view it, without a problem. It is also very thin, but that, I believe, has already been mentioned.After all of this, I decided to give the TV 3 stars. I think maybe if you planned to watch the TV completely in HD, that it probably wouldn't be that bad of a TV. There is the angle problem, and a lot of people aren't satisfied with the speakers, but it at least does look clear in HD. But for someone like me, that will be watching it in SD, too, this TV does not perform well. I'm not happy with how it was advertised to have bright, vibrant colors and instead the colors are dull and off. Again, I know this is an HDTV, but it shouldn't look THIS bad in SD. I watch SD on my Plasma television and the two pictures aren't even comparable. It blows this TV out of the water. Because of this, I'm probably going to be returning the TV and maybe looking into a Samsung this time.**- 8 months later...I'm coming back to say, I actually kept the TV. I planned to return it but I didn't get around to doing it in time. I decided to edit my review because I wanted to let people know, the picture did clear up. It was insanely grainy at first but after watching it for over a week, it started to clear. I don't know what the cause for this was but that did make me a little happier about my purchase. The rest of what I said still stands, though. There is the angle problem, and the picture isn't exactly vibrant, nor bright. Someone actually commented on the darkness of it once. But I recently upgraded to HD channels with DirecTV, and my watching experience has greatly improved.- Just came back again to say my DirecTV remote works with the TV now. I dunno if it's because of the new HD box we got or what. The only thing it doesn't control on the TV is the input. It turns it on/off and changes the volume without problems. Not really something big to add, but I thought I'd throw it out there.", "Date": "December 2, 2011"}, {"Title": "Faulty TV", "Author": "Rao", "ReviewID": "R2WQ5N74ROA3E8", "Overall": "1.0", "Content": "The TV works great while it lasts. However, as many people have posted after about a year or two it will stop turning on. Shortest life for any TV I have owned.", "Date": "December 30, 2013"}, {"Title": "Got it a year ago. .. Still works!", "Author": "erictheelephant \"IronBuddha\"", "ReviewID": "R19VMBERIERNRD", "Overall": "5.0", "Content": "Yeah, I got this a while ago, and it still works. LED tvs are like a commodity now. They all look good, it's just the price and size you look at. And don't buy westinghouse... I had one that died after a year.", "Date": "December 19, 2013"}, {"Title": "stopped working", "Author": "eric tello", "ReviewID": "RE3QTOSDQHALF", "Overall": "1.0", "Content": "This product had a life limit of one year and then stopped working, I wonder if I can get a product change, return or warranty what is?.", "Date": "December 1, 2013"}, {"Title": "Happy Black Fridays", "Author": "Lorenzoperiu", "ReviewID": "R2BOYIYE54V0T0", "Overall": "5.0", "Content": "Good brand and good price on line after Christmas sale were people like to buy more and safe a lot of money", "Date": "November 25, 2013"}, {"Title": "Great TV!", "Author": "C. McCain", "ReviewID": "R92KCWX0KD27A", "Overall": "5.0", "Content": "This is a great, simple flat screen TV. Can't go wrong with it. So far so good. Color is good/", "Date": "June 27, 2013"}, {"Title": "Good tv", "Author": "caseyjacie", "ReviewID": "R1ND1FNECLLT2G", "Overall": "4.0", "Content": "This tv has a great picture and has been glitch free.  I do not love the frame around the tv, which is very wide and very glossy, giving it a slightly dated, 80's apprearance.  Aside from this, we are very pleased with the tv.", "Date": "May 26, 2013"}, {"Title": "Great TV for the price.", "Author": "Jack", "ReviewID": "R28XAA7OZ2RC1W", "Overall": "5.0", "Content": "Received the TV in really good condition. All surfaces had protective plastic on them and the TV was packed safely. Picture quality is good, the menu easy to understand overall viewing experience rather nice. :) One downside that has been mentioned before: The audio quality is not the best - but for the average joe on his hunt for a TV, not a home theatre, it is more than enough.", "Date": "May 13, 2013"}, {"Title": "Not worth it.", "Author": "A. Jones \"arj\"", "ReviewID": "R1TQD40MR2W2LR", "Overall": "1.0", "Content": "Count me as yet another consumer whose TV stopped working very well a couple of months after the one year warranty was up. Up until then, it worked fairly well. Over the past couple of months, I have frequently had to unplug it and then plug it back in to get it out of \"standby\" mode until finally it stopped working all together. Looks like the tv is only made to last for a few months and I doubt that it's worth repairing. I wouldn't recommend it.", "Date": "May 1, 2013"}, {"Title": "Save your money", "Author": "sarah brady", "ReviewID": "R2YIRXIC1MC8D8", "Overall": "2.0", "Content": "I would save my money on this one. I was very disappointed, I should have listened to the sound in a store before buying online. It doesn't do much good to have a HD TV when the sound is so bad", "Date": "March 21, 2013"}, {"Title": "Excellent TV", "Author": "Doc Smith", "ReviewID": "R32ZO1RBNB854J", "Overall": "5.0", "Content": "This is a quality TV.  I've had it for awhile now with absolutely no complaints.  The picture quality is very good.", "Date": "March 10, 2013"}, {"Title": "Nice for the price", "Author": "John P \"John P\"", "ReviewID": "R16LNX0XB693L2", "Overall": "4.0", "Content": "I got this TV for 299.00 in Nov of 2011.  For that price I think this TV is very good.  I've had it for a year with no problems.  Picture quality is very good.", "Date": "February 10, 2013"}, {"Title": "Worked great for 14 months then died", "Author": "Eugene M. LaFaille", "ReviewID": "RLOAZ90N50JYD", "Overall": "1.0", "Content": "Ordered this TV Nov 2011 to be used in our exercise room.  It was used for only short periods by my wife and I during exercise sessions several times per week.  The TV worked well and we were very happy with it untill Feb 2 2013 when it died.  No power, no picture, nothing at all.  Of course the warranty is for 12 months and it lasted for 14 months.I'm 56 years old and up till now have experienced only one television failure, an RCA in 1976.  Looks like LG will join RCA on my personal DO NOT BUY list.If you must buy this television I suggest you consider buying the extended warranty.UPDATE!!!  Heard back from the repair shop.  The TV motherboard is bad, parts and labor to fix is $295.00.  Off to the landfill after 14 months.", "Date": "February 4, 2013"}, {"Title": "Price good - TV works great.", "Author": "James Skeeles", "ReviewID": "R1TPK7AYGQDWNA", "Overall": "5.0", "Content": "Price good, TV works great. What more to say except that this dumb web site requires more words, so here are more words.", "Date": "January 30, 2013"}, {"Title": "Love LG.  Works great.", "Author": "Kevin A.", "ReviewID": "R15JZESR5L28QK", "Overall": "5.0", "Content": "I have had this TV for over a year now and it is still working just like the day it came out of the box.  It is very light and thin and looks great mounted on the wall.  We know have 3 LG tv's in ranging in size from 55\" to 32\" and would not hesitate to buy another.  I would definitely recomend this with out hesitation.", "Date": "January 23, 2013"}, {"Title": "Picture good. Sound... bad", "Author": "Geary Epperson", "ReviewID": "R21HHOBG7ZEKZK", "Overall": "3.0", "Content": "Picture looks nice with the LED. SUPER thin too! I mounted with an in-wall mount from Monoprice and it looks awesome right up against the wall, then I can swivel out to watch. If you get an LED TV, get an in-wall mount. Looks like a picture mounted on a wall.Major complaint: speakers are HORRIBLE. I think it's designed to be in front of the wall to reflect sound to make the speakers sound bigger, so it might be my setup, but if you swivel your tv at all you can't hear. At times I have to blast the volume almost all the way. I need to find something that can redirect the sound to the front.", "Date": "January 18, 2013"}, {"Title": "Had problems out of the box, does not last", "Author": "L. Gladney", "ReviewID": "RICW8T77BOOBM", "Overall": "2.0", "Content": "I purchased this TV elsewhere but I use Amazon for reviews so I figured I'd add my own here.  I got it for a great price during a Black Friday sale in 2011 and I was pumped because it was a much better brand than the others offered during those sales.  I should have returned it right when I got it because it had a bright spot in the upper right hand corner.  But since I had no other TV in the house to use, I ignored it since it wasn't noticeable once the screen was turned on.As stated, the sound is completely terrible.  Again, I put up with this since I'm in a small apartment and could deal with it, but I was not happy to need to turn it up to 100 to hear the quiet dialogue in a movie... then as soon as the music/sound effects kicked in, it would blow my eardrums out.The last straw was recently I have been getting a dim spot on the screen after the TV warms up.  It stretches almost all the way down the screen and really interferes with the picture.  I'm fairly certain neither LG or the company I bought it from will do anything for me since more than a year has passed (actually this started DAYS after the 1-year mark), so I have a feeling I need to junk it and start over.Do not recommend this product as it will not last.", "Date": "January 16, 2013"}, {"Title": "EXCELENTE", "Author": "Eduardo Paniagua", "ReviewID": "R3VPOMYDH9TZQG", "Overall": "5.0", "Content": "UNA MUY BUENA PANTALLA, LA DEFINICION ES MUY BUENA, LA RECEPCION A INTERNET TRABAJA MUY BIEN Y ES MUY FACIL DE MANIPULAR.", "Date": "December 27, 2012"}, {"Title": "5 stars", "Author": "alexander", "ReviewID": "RCASKLA03Z025", "Overall": "5.0", "Content": "excellent product and very useful .. 100% recommended for those looking for a good product and the best is the good price", "Date": "December 24, 2012"}, {"Title": "Great TV for a good price, but the older model was better", "Author": "Serdar Soysal", "ReviewID": "R2O00C01VIGADG", "Overall": "4.0", "Content": "I bought this one when I needed a second TV because I had purchased a 32\" LG LED TV before and I had loved it.  This one didn't disappoint, and for the price I paid for it, it was a good deal.  I use this TV as a display unit for my Media Center PC.  Connection over HDMI went without a hitch and everything was running perfectly in minutes.  The image is crisp and clear, and generally no complaints about the TV.The problem I have is that compared to the previous iteration, this one seems a little flimsy.  The base connection is smaller than the previous one and it's mostly plastic with no metal support which the previous one had.  With the relatively moderate size of this TV though I don't think it would be a problem.  It makes the whole unit much lighter which is a plus.The other complaint I have is the remote.  Again, compared to the previous version this one looks very cheap, reminiscent of the cheap remotes you'd get on $29.99 DVD players you get at wal-mart.  The previous one had a more stylish remote that was made of better plastics.Overall, it's a good TV for the price and functionally I recommend it.  The only reason it gets 4 stars instead of 5 is the stylish deficiencies I described above.", "Date": "December 6, 2012"}, {"Title": "Dead TV after 13 months", "Author": "Xbox gamer tag:flashergamer297", "ReviewID": "RAOLZ0155X5MK", "Overall": "1.0", "Content": "Purchased Nov 2011, dead today, Dec 2, 2012.  Won't power on.  Never had a TV that last 13 months.  Ridiculous.  Just past the typical 12 month warranty.  Wish I never brought it, and doubt I will buy anything LG unless manufacturer helps out.  What a pain.", "Date": "December 2, 2012"}, {"Title": "Great quality tv", "Author": "JacketJoe", "ReviewID": "R3A5LHD88A72WB", "Overall": "5.0", "Content": "Good picture and sound, and perfect size.  I've never had any problems with it during my frequent usage.  Would definitely recommend the tv to others, LG is a quality brand.", "Date": "November 23, 2012"}, {"Title": "Where is USB Function?", "Author": "windypoo", "ReviewID": "R26FFBTMA2Y8KD", "Overall": "4.0", "Content": "I have owned this TV for almost one year and it does work nicely although the sound is below par (no bass, very flat) unless connected to external speakers. I only paid around $300 for it so I feel I more than got my $$$ worth. HOWEVER, mine does have a USB connection on the side but NO USB 'Function' option to utilize the USB port. I have searched Amazon reviews, the TV manual, and the LG website. Everything tells me to use the USB 'Function' but I swear that function is not available on my screen. I am hoping someone who owns this TV will respond and help me and future owners understand how to access the USB function. For reference, functions available on my screen are: TV, AV, Component, RGB-PC, HDMI 1, and HDMI 2. None of those options activate the USB function.", "Date": "October 7, 2012"}, {"Title": "TV for bedroom", "Author": "Doris Boone", "ReviewID": "R2IRAE4SVNOX9Z", "Overall": "5.0", "Content": "This LG 32 inch LED LCD HDTV is perfect for my bedroom.It has a beautiful and clear picture.I also plan to mount it on wall.", "Date": "July 28, 2012"}, {"Title": "still in shock", "Author": "Dean Mc Donald \"two man band\"", "ReviewID": "R12TP2ZN13Z3TU", "Overall": "2.0", "Content": "this item was brought online from amazon LLC ON THE 30 NOVEMBER 2011. IT STOP WORKING IN MARCH 2012. UP TO THIS DATE IT HAS NOT SHOW ANY TYPE OF DISPLAY. THE ITEM WAS NOT DROP OR DAMAGE IN ANYWAY. BUT WE ARE STILL IN SHOCK THAT OUR OLD FAITHFUL NOW PICKS UP AFTER AND IS STILL WORKING FROM SINCE 1999. ALL I COULD SAY IS WHAT A PRODUCT.", "Date": "July 25, 2012"}, {"Title": "Doesnt have RCA inputs", "Author": "Cali guy", "ReviewID": "R1NTOQYDJWF1ZD", "Overall": "3.0", "Content": "It is good for the price but it has very limited inputs so you cant really hook-up xbox, TV and  PC. I will not recommend this.", "Date": "July 11, 2012"}, {"Title": "Died at 8 months old.....", "Author": "c. whisenant", "ReviewID": "R1TEFCCABM88VI", "Overall": "2.0", "Content": "This TV just died after 8 months of use. Apparently this is an ongoing problem with LG TVs. Hopefully LG will honor its 1 year warranty. We will soon find out.", "Date": "July 8, 2012"}, {"Title": "Audio is not good", "Author": "Peter", "ReviewID": "RLYG09ISZAD00", "Overall": "3.0", "Content": "We bought the tv for our son's bedroom. The audio is not good at all but the image is nice.", "Date": "May 17, 2012"}, {"Title": "Loved the TV - for the 4 months it worked! UPDATE", "Author": "kma", "ReviewID": "R2JLYYV0II1UUR", "Overall": "1.0", "Content": "Loved this TV for the 4 months it worked!  Then one day, it couldn't be turned on...the \"main board\" was out.  Though the LG experience has been satisfactory regarding the repairs under warranty, this is not a TV I could recommend for others.UPDATE: The main board was replaced.  TV worked for about 2 hours...when it was turned back on - no picture or sound.  Guess what...the replacement board was faulty so we are now waiting for another \"main board\".  LG will not refund or replace - just repair.  The repairs now cost more than the TV - does that make sense?  This is the last LG product we will purchase!", "Date": "March 26, 2012"}, {"Title": "Great picture, somewhat lacking audio.", "Author": "Tim", "ReviewID": "R3T95OSC12OACR", "Overall": "4.0", "Content": "I love this tv. It has a rich and engaging picture, and is priced to sell. The only thing I find lacking is the capable volume level. It just isn't loud enough for everyday use, and requires the use of external speakers (at least in my experience). Other than that, I can't find any fault in this television.", "Date": "March 25, 2012"}, {"Title": "Utilizing the limited warranty", "Author": "homegrown", "ReviewID": "R89KTRPPBKIAF", "Overall": "3.0", "Content": "Loved the tv for the first few months of owning it, no problems and good HD. A few months later the tv would not turn on, and I had to have the circuit board replaced. Apparently, this is a common occurrence. I was watching tv on my computer for two weeks before a repair man came out. Luckily, the limited warranty took care of all costs, but the inconvenience alone is disappointing for a tv only three months old.", "Date": "March 16, 2012"}, {"Title": "Can't Recommend", "Author": "Eric", "ReviewID": "R3QETY24W9602S", "Overall": "2.0", "Content": "For the price (I got it on black Friday for $300), this is a good TV in terms of picture quality and features. When I first got the TV, however, I immediately noticed that the chassis was not fully snapped together at one corner. This wasn't a big deal, but seemed like poor quality control on LG's part. Then, after just three months, the TV refused to turn on. Searching the problem online, it seems LG televisions have been having this issue for years. You would think they would have addressed the problem by now since this TV was just released a few months ago. Getting the warranty work was easy enough, but it was three weeks until it was finally fixed. I have had an LG computer monitor for years which I love, but I would recommend going with something other than LG after this experience, or at least a different model.", "Date": "March 15, 2012"}, {"Title": "Bad Video Card", "Author": "George", "ReviewID": "R246XG8MOGA5IX", "Overall": "2.0", "Content": "I bought this TV last Thanks Giving. Now after 3 months the video card is not working. I don't understand how is it possible if it is a new TV.", "Date": "March 13, 2012"}, {"Title": "great tv amazing picture", "Author": "Environmentally Conscious Bargain Shopper", "ReviewID": "RSNBCZB92TVRZ", "Overall": "5.0", "Content": "this is a great tv very thin and I got it at a great price. it has transformed how I watch tv.  screen is amazing seems like the that cost much more, saves power because it's led. the speakers aren't Lou's or clear enough but passable. that's my only complaint the audio is weak, but if you want great audio just hook it up to your stereo.", "Date": "March 11, 2012"}, {"Title": "Crystal Clear", "Author": "RL", "ReviewID": "R29GTT3K3L8RT7", "Overall": "5.0", "Content": "I really enjoy watching movies on this LED monitor.  I have not upgraded my dish to HD but the picture is still clear while viewing any show.  My main reason to purchase this item was for watching DVD's and then upgrading to Blu-Ray.  So far the monitor is working beyond what I expected.", "Date": "March 6, 2012"}, {"Title": "Very Nice", "Author": "BK", "ReviewID": "R1L78GVB1M0XL0", "Overall": "5.0", "Content": "For the money this was a very good value and we continue to enjoy the purchase.  I read several reviews complaining about the audio, however, for the price I believe the audio is just fine and if you wanted something better you should have spent more money.", "Date": "February 17, 2012"}, {"Title": "Recommend this TV", "Author": "TFM \"Time-Pressed Mom\"", "ReviewID": "R29QLQS63INNBX", "Overall": "4.0", "Content": "Easy to set up, writing as a not terribly techy person. Good to excellent picture quality with HD cable connection.  Poor sound quality as others have mentioned. We have added small computer speakers to address the problem - an inexpensive and quite effective solution.  Note that this is a secondary TV in a bedroom for us, so doesn't get the much more intense family room TV viewing workout.  Nice replacement for the space hogging old clunker CRT TV.", "Date": "February 8, 2012"}, {"Title": "Great TV!!", "Author": "RocketToober", "ReviewID": "R1LMSF1F63Q2U7", "Overall": "5.0", "Content": "I use this TV for occasionally playing games and watching tv/netflix. This tv is just perfect for what I do. Great picture quality for 720p and being 60hz. The only bad side of this, is that the sound sucks. I suggest getting some nice computer speakers or surround sound.All in all, I love this tv and would suggest it to anyone looking to purchase a new tv.", "Date": "February 2, 2012"}, {"Title": "great value", "Author": "kdog30", "ReviewID": "R1LP06Q9B8YGT0", "Overall": "5.0", "Content": "bought this tv on amazon before the holidays and i must so i am extremely happy with the purchase.  i couldn't find an LED tv at this price, let alone an LG. i mainly use it to play my PS3 and the picture is great! like its been mentioned the audio isn't the greatest but its not horrible. most people run audio through an amp receiver anyways. ive had the tv over 2 months and no complaints!", "Date": "January 20, 2012"}, {"Title": "Producto excelente", "Author": "Darby Barrios", "ReviewID": "R1Y9YJASFE12GK", "Overall": "5.0", "Content": "Producto excelente todo en perfecto estado, la calidad de la resolución es muy buena, el sonido es muy bueno y el diseño del televisor es espectacular", "Date": "January 15, 2012"}, {"Title": "32 inch LED-LCD TV does the job", "Author": "Froggy", "ReviewID": "RQDLS4F5E7LD1", "Overall": "5.0", "Content": "This TV meets all of our expectations.  It is light, easy to program and has a crystal clear picture.  If it has a con, it would be the speakers.  But if you hook the TV to an external sound system, which most of us do these days, you will be happy with this purchase.", "Date": "January 12, 2012"}, {"Title": "great deal", "Author": "MAK", "ReviewID": "R10GL82FKQ8V4K", "Overall": "5.0", "Content": "this was a great deal-delivery was in 5 days--set up was easy with no additional cablesTV has a great picture and sound", "Date": "January 12, 2012"}, {"Title": "Great Value", "Author": "jibaro52", "ReviewID": "RGVE3F2OP8DUD", "Overall": "5.0", "Content": "Purchased this TV as a Christmas present. Pleasantly surprised at the build quality for the price, doesn't look cheap. Good backlighting at this price and a fairly nice remote. One note: no analong inputs for legacy equipment.", "Date": "January 3, 2012"}, {"Title": "Great value", "Author": "SoonerSunshine", "ReviewID": "R3S63L54523G02", "Overall": "4.0", "Content": "LG 32LV2400 32-Inch 720p 60Hz LED-LCD HDTVGreat value for product/price.  However the sound quality is not that great.  It kind of sounds like a tin can. I'm sure if you have a surround sound system then this would not be an issue.  I did not give this item five stars due to the sound quality.  Other than the sound, it is a great buy.", "Date": "January 3, 2012"}, {"Title": "Good TV", "Author": "Rob Douglas", "ReviewID": "R1O0ZHSD6WYPSB", "Overall": "4.0", "Content": "Very happy with the TV. It has a good picture and sound and was very easy to set up. You can get a TV cheaper, but I like the quality of this unit.", "Date": "January 3, 2012"}, {"Title": "Great tv for the price", "Author": "marco esquandolas", "ReviewID": "R2VSLEM9DV9QAG", "Overall": "4.0", "Content": "Great tv for the price. We decided it was time to upgrade our old school tube bedroom tv and didnt want anything too big or expensive. This tv seemed to be it per the reviews. Picture quality is good. The only reason I didn't give it 5 stars is b/c the sound is not the best, but totally fine for a bedroom tv. I may hook up some other speakers in the future, but it's really not that bad. Overall we are happy with it for the price.", "Date": "January 2, 2012"}, {"Title": "good product, good price!", "Author": "Mackenzie", "ReviewID": "R2SZTK34Z3MAJU", "Overall": "5.0", "Content": "Such a good price for a great tv! It came in less than 3 days which was perfect. it has a great picture, and great sound. I would definitely reccomend!", "Date": "January 1, 2012"}, {"Title": "Awesome TV!!! Amazon is #1 for purchases!", "Author": "Brenda5155", "ReviewID": "R3JSI46JG54SYJ", "Overall": "5.0", "Content": "This was an incredible deal, so I jumped on it as soon as I saw it! Good quality picture and very easy to set up. My father is very happy with his Christmas gift :)", "Date": "December 30, 2011"}, {"Title": "Great Purchase", "Author": "bebe2212", "ReviewID": "R2CPJKFMIKH0XJ", "Overall": "4.0", "Content": "Great slim light weight t.v. Bought for room and well worth the money. Simple but very good quality picutre. The sound could stand to be a little better.  Nice looking and great quality picture.", "Date": "December 30, 2011"}, {"Title": "LG32LV240032-Inch 720p 60Hz LED-LCD HDTV", "Author": "philkris", "ReviewID": "R2COUTZATSWZP6", "Overall": "5.0", "Content": "the TV is great for the money! The picture is so clear and sharp. It 's very light and thin. I'm happy with it.  The sound is not that great! if you do care, however, I'm satisfied with it.  I love Amazon!  Good price! good service! and Great products.", "Date": "December 30, 2011"}, {"Title": "LG TV", "Author": "OhioRat", "ReviewID": "R2XGPNQQNI4Q0R", "Overall": "4.0", "Content": "I bought this LG 32LV2400 32-Inch 720p 60Hz LED-LCD HDTV through Amazon, which is super convenient in itself. No wasted gas, no haggling, no lines, no sales tax. I admire the LG name, so I bought without hesitation and I am not disappointed. I got a geat TV at a great price. Only negative is the sound (5 watts kind of low) but my next purchase will be a home theater for it, so it's a non-issue for me.", "Date": "December 30, 2011"}, {"Title": "LG 32LV2400 32-Inch LED HDTV", "Author": "QRP", "ReviewID": "R3J7CEUSKOLU5M", "Overall": "5.0", "Content": "I bought this TV to replace an older 24\" unit in the bedroom.My wife likes to zoom through her soap operas before going to sleep and this unit works great.The picture quality is fantastic and it fits perfectly into the entertainment unit.The remote seems to have the the up-down-left-right-enter controls backwards. Most remotes have them towards the top and this one has them on the bottom. Other than that we have no complaints. I purchased this from Amazon at an amazing price, free shipping, no tax, and very fast delivery. I would recommend this unit to a friend.", "Date": "December 30, 2011"}, {"Title": "Decent TV for the price", "Author": "Jessica M. Collins", "ReviewID": "R3125LUFFKGER2", "Overall": "4.0", "Content": "I purchased this TV on Cyber Monday for $299.  I really like the television.  The quality is pretty good as long as you have an HDMI cable plugged in to whatever device you have.  Mine is plugged into my cable box.  The only thing I had to get used to was how the speakers are on the bottom of the TV so the sound is a little different from my old TV, but I'm used to it now and I'm really happy with my purhcase.", "Date": "December 29, 2011"}, {"Title": "ok", "Author": "clyde", "ReviewID": "R3AJF0PIA7Y1EJ", "Overall": "4.0", "Content": "The TV was about like most other reviews are But I think the audio is ok not as bad as some said it would be I put this TV in our Kitchen we have direct TV and with a HD box or a direct over the air signal the picture and tv are a great Buy for the money only paid 299 for this on amazon Came with free shipping and was very EZ to set up works fine WE Like it the picture is great", "Date": "December 29, 2011"}, {"Title": "is very good", "Author": "henry", "ReviewID": "RMOQRIAVO0MNL", "Overall": "5.0", "Content": "tv is the best in sharpness and color and image, with all this I am very pleased to have purchased this product.", "Date": "December 28, 2011"}, {"Title": "Great TV for the price", "Author": "Travis", "ReviewID": "R2OXX8KS79X25R", "Overall": "4.0", "Content": "Reading reviews I heard the sound was bad on this model, but have had no similar experiences whatsoever.  Everything is what I expected, in fact the only thing I can complain about is that I'm not sure if you can adjust certain features like tint, sharpness, etc.  However I think this only matters if you want to manually calibrate it instead of using the preset options.", "Date": "December 27, 2011"}, {"Title": "Good Value", "Author": "Dave", "ReviewID": "R81LII5BX3MU1", "Overall": "4.0", "Content": "I watched the prices on 32 inch TVs for several months before buying this one for our bedroom.  Probably the best price out there for an LED lit model in this panel size.  I've had great luck with my 37 inch LG LCD that I purchased a few years ago and decided to stick with LG.  The only drawback that is easily noticeable is that the speakers on the TV sound very weak and hollow.  I have to believe that LG does this intentionally to bring costs down under the assumption that many users have additional sound systems.  Otherwise the picture is fine and setup is easy.  Shipped direct from Amazon in only a couple days.  I'd recommend it, but keep in mind the audio is less than stellar, although good enough for a bedroom TV.", "Date": "December 27, 2011"}, {"Title": "Meets Expectations", "Author": "John R Ayala", "ReviewID": "RDXX8VPWXR3D", "Overall": "4.0", "Content": "This TV was purchased for our bedroom.  Therefore it is very decidely the \"back-up\" set.  However we have found it to be a very enjoyable viewing experience.  The colors are crisp and the ease of use surprising.  With this set hooked up with a blueray DVD player and Netfilx, HD viewing is excellent.  The only draw back are the speakers.  They are very tinney in sound.  I am sure a sound bar or external sound system is in the future.The purchasing experience at Amazon is so easy and positive, not sure that I would ever make another TV purchase any other way.", "Date": "December 27, 2011"}, {"Title": "Almost too sharp", "Author": "Michael Reed", "ReviewID": "R1D5GANEI4WN32", "Overall": "4.0", "Content": "Great little TV for games. Very thin and light. It's so sharp and bright though it might overwhelm a small room.", "Date": "December 26, 2011"}, {"Title": "LG TV", "Author": "S. Young \"jrsmouse\"", "ReviewID": "R8M9NFFX6CANN", "Overall": "3.0", "Content": "The picture is great, set up was easy, but the sound lacks a lot.  Very tinny.  Bought for the bedroom to watch the news late at night.", "Date": "December 26, 2011"}, {"Title": "great TV", "Author": "J. Kim \"bert\"", "ReviewID": "RHW71CXT3FJ51", "Overall": "5.0", "Content": "This TV was more than I hoped for; clear picture and good sound.  Though the back looks simple there are all input and output plugs, including computer and USB connections.  One caution is that it takes a bit longer in turning on; just wait a few more seconds to have picture comes out.", "Date": "December 26, 2011"}, {"Title": "Very Pleased", "Author": "Mr Merb", "ReviewID": "R1YY0CZN6C555B", "Overall": "5.0", "Content": "After I had ordered this TV and while I was waiting for it to arrive, I read a few negative reviews and started to get concerned.  Well we hooked up the television last last Saturday and were pleasantly surprised. For the price I think this was an excellent choice. Very good picture quality, viewing from various angles seems just fine to me. I also read some negative reviews on the audio but it seems OK while watching broadcast television. We hooked up our audio system so haven't used the speakers when using a DVD or PC outputs. Have streamed Netflix movies via a connected laptop/DVR and that was very good picture quality as well. I would definitely recommend this television.", "Date": "December 23, 2011"}, {"Title": "beautiful items.", "Author": "wanasu", "ReviewID": "R2X8RJ9QIMVYUF", "Overall": "5.0", "Content": "Beautiful HD LED TV! Wonderful Colors and Beautiful Designs. Very slim and light.So eager to use and watch. I like LG.", "Date": "December 19, 2011"}, {"Title": "Nice TV, great image quality", "Author": "Manuel CA", "ReviewID": "R2MJ1RYBZW0ILE", "Overall": "4.0", "Content": "I'm very happy with this TV. The image quality is great and the sound is good as well.Very thin and light weight, Very recommended!", "Date": "December 15, 2011"}, {"Title": "Greatness!", "Author": "Jessica Pola \"Jess\"", "ReviewID": "R2B56MNVLO0QLR", "Overall": "5.0", "Content": "I bought this LED TV a day before black Friday for $279 =D WOW! Up to this day I haven't had any issues.  The TV looks great, the colors are nice and vibrant. The sound is alright =|\"most new LCD LED TVs are coming out with that low thin audio tone. But overall it's been a great purchase.", "Date": "December 14, 2011"}, {"Title": "my first flat screen", "Author": "R", "ReviewID": "R3MC0Z24EIQ7ID", "Overall": "5.0", "Content": "After a slamming deal of $299 on cyber monday, this TV could not be more wonderful.  Granted the sound issue is no problem that cannot be solved even with a simple set of old computer speakers--- no use making mountains out of molehills.  NFL football has never looked better on any TV i've ever owned :) Picture is great quality, and simple user-friendly interface. I'd highly recommend!", "Date": "December 13, 2011"}, {"Title": "Great value LED set", "Author": "Debbie Lee Wesselmann", "ReviewID": "R2WNR3BT0QEEX8", "Overall": "4.0", "Content": "If you are looking for a smaller, affordable LED set, this LG may do the job as long as you don't expect higher-end functions and performance.  The screen is only a little over an inch thick, making it ideal for wall mounting or positioning on a shelf using the included stand.  The picture is sharp and vibrant, even with 720p and 60 Hz, mostly because that the smaller screen (relatively speaking) doesn't need the kind of resolution that a larger one does.  As others have noted, the audio is lousy, but you can improve that by connecting a sound bar such as VIZIO VSB200 Universal HD Sound Bar or Mint SB10-SBA1 1.1-Inch Thick Wall Mountable Soundbar) -- but these obviously add to the base cost.The set has the usual basic functions, although most, including the sleep timer, require you to go through the menu to access.  It has two HDMI jacks, a digital optical output, AV/Composite, USB, RGB connection (for a PC), and an antenna/cable jack.  The remote is no-frills; it does not have a decimal point key for exact subchannels, although, once the TV is tuned automatically, it will display a menu of the subchannels from which you can choose. For instance, if you enter 109, it will display 109, 109.1, 109.2, etc. - whatever your cable or satellite offers.This set looks more expensive than it is with its slim profile and glossy black frame.  The included stand swivels, a nice touch for a budget set.  To me, this is the perfect secondary set for a bedroom, guest room, or game room. If you want to use this as your main set, I highly recommend hooking it up with better speakers, either through a sound bar or a receiver with satellite speakers.-- Debbie Lee Wesselmann", "Date": "December 12, 2011"}, {"Title": "Good for the price - I liked it", "Author": "Kumar", "ReviewID": "R2EEJM4EDS6PE4", "Overall": "4.0", "Content": "i was looking for a good deal in 32\" category.. finally i ended up by taking this on amazon for good price.I am very happy with the performance.Pros: Good Picture clarity, SLIM design, Easy installation, Nice RemoteCons: The USB, AVI Ports slot is in odd position.. its downwards facing, so if the avi cable is loose, it will fall down u need to tighten the scres.Sound is not that much awesome, but ok for the price.Finally i recommend this product.", "Date": "December 7, 2011"}, {"Title": "great all around for LED", "Author": "JOJO", "ReviewID": "RO7O4C6X015GJ", "Overall": "5.0", "Content": "I got this for my wife's computer in the living room, so I can play x box and watch football while she gossip and watch her own show and play her games.  For the price its a great tv with great picture, we install it on a swing arm wall bracket, so to tuck flat against the wall when not in use, its simply perfect for what we wanted, I will recommend this for simple use, but for gamers, remember its only a 60Hz, so don't expect a 120Hz refresh rate. and the price, I've done research all over, and you can not beat the Amazon price, honestly, I've found this almost $100 more elsewhere, the only one I found with almost same price is Tiger direct and BestBuy, but for the same retail price, you would have to pay tax and shipping.", "Date": "December 6, 2011"}, {"Title": "great tv", "Author": "th1316", "ReviewID": "R36XVNIJC8RQUV", "Overall": "5.0", "Content": "I bought this tv after shopping around on black friday.Nothing in the stores compared. I was a little hesitant buying a big ticket item like this on line.But having dealt with Amazon before I know they have outstanding customer service.Best purchase i've made. Clear bright picture,easy to set up & an easy access quick menu.No complaints", "Date": "December 5, 2011"}, {"Title": "Works fine for me", "Author": "ksexay", "ReviewID": "RNWCEVW9UNU9H", "Overall": "4.0", "Content": "Just received the TV and it works and looks pretty good ....the picture is pretty good I have it hooked up to my ps3 and the picture is great...also have it hooked up to my laptop and the picture quality is fine too.  The sound is fine for me even though alot of reviews are saying its terrible. I live by a main road with cars and buses always passing by and I can hear it well so I'm not sure what the complaints are unless you are deaf and have trouble hearing anything or are extremely picky this and must have it SUPER LOUD for some reason. The TV's sound is pretty average for normal listening IMO. I'm happy with my purchase so far.", "Date": "December 2, 2011"}, {"Title": "LG LED 32inch", "Author": "Englishman \"English\"", "ReviewID": "R39L7UMFP8QPM5", "Overall": "5.0", "Content": "I see other reviews and I respect their opinions, perhaps they know better than I.  I replaced a 26\" Dynex with the LG LED 32\" and am very pleased.  I see the comments regards audio, to be honest I have great hearing and the audio is just fine, I play 720p YouTube video's and the audio is fine, I use in my 10 x 12 study and its just fine.  The picture equally is better than the 720p Dynex, better colours and more options to suit your taste preferences.  I use it for my Roku box, which having had a Roku for less than a month is now forcing me to DROP an expensive cable bill, due to the fact that I can get nearly everything I want programming wise from my Roku and it's almost all HD.  Great TV for the $299.99 price", "Date": "November 30, 2011"}, {"Title": "I can get better audio with 2 cups and a string.", "Author": "ohenry", "ReviewID": "RF8BAH1R7EYWX", "Overall": "4.0", "Content": "The television I watched Howdy Doody on in the early 50's had better sound than this set. It's a great buy if you have another audio source, love the picture. If you need a tv with a speaker keep shopping.", "Date": "November 29, 2011"}, {"Title": "Very average display", "Author": "Drayne", "ReviewID": "R1DTRWLITUAM66", "Overall": "3.0", "Content": "The display is not bad display its just the picture is a little worse than the Vizio iwas replacing due to faulty hardware I am going to return this and spend a couple hundred more to get a better picture, but if you needs something to watch tv on as a bedroom display this would be a great choice", "Date": "November 18, 2011"}, {"Title": "Sound is a big disappointment....Picture is average.", "Author": "DISAPPOINTED! \"DISAPPOINTED!\"", "ReviewID": "R3JHN4SI235Q2D", "Overall": "2.0", "Content": "If you can afford to spend an extra hundred dollars go to Sam's and invest in a Samsung which has proven picture and sound quality.  This TV has horrible sound - no bass and absolutely no volume.  Agree with the other reviews that the sound is completely mono tone.  LED in this TV is less than desirable...", "Date": "December 1, 2011"}, {"Title": "GREAT VALUE!!", "Author": "MIGUI26", "ReviewID": "RGN58MP89Q9AB", "Overall": "4.0", "Content": "GOOD 32'' LED TV! THE PICTURE QUALITY IS AVERAGE. THE SPEAKERS ARE REALLY BAD, YOU MUST HAVE A HOME THEATER. GREAT CHOICE IF YOU ARE LOOKING FOR A CHEAP LED TV", "Date": "November 27, 2011"}, {"Title": "LG Color Surprize", "Author": "donV", "ReviewID": "R1Y5XZXMBU930K", "Overall": "2.0", "Content": "Purchased the 32\" LG because I have an LG 26\" HDTV with simply great color. Thought it would be good to upgrade to a 32\", since my 26\" LG's speakers constantly vibrated at a certain audio pitch. Color on the 32\" LG simply stated is terrible! This model does not compare to the 26\" and doesn't offer the color control options of my 26\". In addition it doesn't offer the picture size control of my 26\". My rating represents my disappointment with LG and my probable next choice to go with Panasonic or Vizio.", "Date": "December 2, 2011"}, {"Title": "Agreed: Decent picture but TERRIBLE sound!", "Author": "Simon Eves", "ReviewID": "RX8WN9KJFD1LC", "Overall": "2.0", "Content": "$299 on Black Friday was a decent price for a thin LED TV, but when it arrived today, and I read the reviews which have been posted SINCE I ordered, I completely agree that the thin-ness has a price.The picture was decent, with good contrast and an excellent viewing angle, although there is some fairly unpleasant glowing from the backlight in the upper corners, and the menu does not offer any direct picture adjustments (not that I found, anyway) just a selection of presets (all of which, other than \"standard\" are too bright).It is completely let down, however, by the TERRIBLE sound. The speakers are tiny (maybe 3\"x1\") and honestly I swear I used to have a transistor radio which sounded better. There is no bass AT ALL, and although again there are several sound presets, I couldn't even tell the difference between them. As this TV was intended for a tidy installation on a small cabinet in a bedroom, there is no space for external speakers which are the only possible solution to this. My wife agreed instantly too. She said her iPad has better sound, and I had to agree!So... don't be wowed by the LED-for-$300 thing like I was, unless you have a separate sound system. I was so disappointed I printed a return label then and there, and then went right out to the local Best Buy and ate the sales tax on a Panasonic TC-L32C3 for the same basic price ($319, which the LG has gone back up to since I ordered it). The Panasonic may not be quite so thin and high-tech-looking, and maybe the screen doesn't have quite as good a viewing angle or black level, but in general the picture can be made to look nicer (it has full manual adjustments) and the sound is SO much better it's laughable.", "Date": "November 30, 2011"}, {"Title": "save your stars", "Author": "jermin8er", "ReviewID": "R3KFYZZI0801MN", "Overall": "1.0", "Content": "People really need to save their stars for after at least 2 months before rating this tv. Within 3 months I had 2 of these, both of which worked great for the first 30 days. Don't ignore the bad reviews, it's true, these tvs are installed with bad video cards. (the tv will not turn on or do anything at all) If it makes it past the 3 months mark I would say that it was a rebuild.", "Date": "April 14, 2012"}, {"Title": "LG T.V", "Author": "Gabe. C", "ReviewID": "R1JGSWKPD4E76P", "Overall": "5.0", "Content": "If you are planing to buy this let me say that first of all the tv's video kind of looks bad. So If you are buying this tv you should buy a HDMI with it.", "Date": "December 2, 2011"}, {"Title": "Sr", "Author": "glager", "ReviewID": "R2RBO5TXYL36NM", "Overall": "3.0", "Content": "Not the quality you'd expected on this brand. ! ! ! !You can buy any brand they are all MADE IN CHINA ! ! ! ! (we are feeding them)", "Date": "December 23, 2011"}, {"Title": "more or less", "Author": "gerdison", "ReviewID": "R6YLHH1ON5199", "Overall": "3.0", "Content": "very nice the tv but the only thing i did not like was that the item description its says hd, and the item doesnt funtion on hd...", "Date": "December 18, 2011"}, {"Title": "Big name right so of course it's a great TV. Don't Bother", "Author": "M. Henty", "ReviewID": "RX96BDIB2OIJU", "Overall": "2.0", "Content": "This TV was on sale at out local Bi Mart at $299.99 so we thought \"why not, it's an LG so you cannot go wrong right\"? Wrong! The picture is really not all that great and the sound? what sound? My clock radio has more bass and midrange than this thing. Now we have to go and spend at least another $100 to get a decent sound bar. I hear that a lot of these LCD TV's have poor sound but surely it's not like this one and to a point where it's basically not worth having it on at all. You would think with all the advances in technology that we have nowadays that LG could at least put some kind of half-decent speakers into the TV, I mean isn't it partially the point of actually owning a television? Sound and vision?", "Date": "November 30, 2011"}, {"Title": "Average tv , donot go for cheap price", "Author": "mohsin", "ReviewID": "RYYW320HTTJER", "Overall": "2.0", "Content": "Has to be returned. very average picture quality. Dark colors and no sharp image even on HD as compared to others. I am disappointed.", "Date": "November 30, 2011"}, {"Title": "NO DTV PROGRAMMING!...DEAL BREAKER!...", "Author": "Vincent Rodriguez \"V-Rod\"", "ReviewID": "R3AEEG3QKD5TP9", "Overall": "3.0", "Content": "Review of LG LED TV Model 32LV2400. Made October 2011. FYI, LG has 70 diff models of 13 diff sizes(19in-65in) listed on their website... [...] . Before the USA switched to Digital TV, Summer 2009, I bought a Channel Master CM-7000 converter box for my analog TV. The program scheduler on this box spoiled me rotten. I could see TV programming for each channel for the next 12 hours with a lot of detail per show. Then I bought my first HDTV from Walmart on Black Friday 2009, an Emerson 42\" Plasma with integrated TV programming & scheduling... Sweet! Now, I get the latest LG 32\" and ABSOLUTELY NO TV PROGRAMMING! WHAT IDIOTS! I checked their most expensive TV and it too has NO DTV programming! WHAT ARE THESE KOREANS THINKING? NONE OF LG's TV's HAVE TV PROGRAMMING BUILT IN!!! This model is very dim compared to a plasma. There is motion blur on fast motion sports programs. I wouldn't use it for gaming. If you don't care about tv programming and plan to use the tv in low light areas and don't mind an average display, then this TV is for you. It's slow to turn on. On the plus side, you can use a USB stick to view JPG picture files BUT NOT VIDEO FILES the 2500 model does play video files (check out their PDF manual) OK, there is a silver lining here, lightest & thinnest TV EVER! ... as thin as a paper back book and lighter than 2 gallons of milk... better for hanging on a wall. Also, the viewing angle left to right and up & down is very good. I'm returning mine to MicroCenter which I bought for $299+tax on Black Friday 2011.", "Date": "November 27, 2011"}, {"Title": "Terrible", "Author": "Wolfshead", "ReviewID": "R2WYQ2LAJWNJPB", "Overall": "2.0", "Content": "No idea how some people could give this a 5 star. Of course, if you had nothing to compare it too then perhaps then I could understand. Ordered this on Black Friday. Just under 300 bucks for a 32\" LG LED? You bet! Unfortunately I tried everthing I could think of to get this tv to look as good as my 32\" Insignia sitting right next to it. I have 2 high-end PCs that I hooked these LEDs to, but the LG just could not hold a candle to the Insignia as far as detail goes. This particular LED must not have been built for a closer viewing practice, because you could literally see the pixels even from 3 feet away. The max resolution I could get from it was something like 1360x768, which is well below what I would've liked. I run my Insignia on 1920x1080, and it looks friggen gorgeous! No idea what the tv looks like when hooked up to cable, dvd, or blu-ray, so my review is a bit inconclusive. However, if you're getting a tv to use as a monitor for your pc, then look for one that has a max resolution of 1920x1080.", "Date": "November 30, 2011"}, {"Title": "VOLUME ISSUE", "Author": "Quang", "ReviewID": "R1ORBVHXTICEDK", "Overall": "1.0", "Content": "The sound was bad. Also, my volume keep on going bad itself. Never going to buy this TV every again.", "Date": "December 8, 2011"}, {"Title": "horriable", "Author": "noname", "ReviewID": "RXEO78M9W892X", "Overall": "1.0", "Content": "huge noise and when I got it,the package is open. It is used by someone else? the pictures is worse than our new tv samsung", "Date": "December 9, 2011"}], "ProductInfo": {"Price": "$549.99", "Features": "LG's LED technology provides a slim profile and delivers amazing brightness, clarity and color detail, as well as greater energy efficiency compared to conventional LCD TVs.\nSee and experience more. Pictures are sharper. Colors are more vibrant. Entertainment is more real. Everything looks better on an HDTV.\nLet your TV do the adjustments for you. Intelligent Sensor automatically optimizes the picture to the lighting and color conditions in the room for a more enjoyable viewing experience.\nVESA Compatible (100mm x 100mm) Swivel Stand", "Name": "LG 32LV2400 32-Inch 720p 60Hz LED-LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/31BhmbcYYvL._SY300_.jpg", "ProductID": "B005JK00XS"}}