{"Reviews": [{"Title": "GOOD QUALITY:", "Author": "Jim the giant", "ReviewID": "R3PQEK2QIWYDQW", "Overall": "5.0", "Content": "As I was searching for a replacement TV I wanted several things.  First, I wanted a good quality TV with an outstanding display of details and colors - the 32 inch JVC LCD/DVD Combo set I received really provides me with those features.  I also wanted a combo unit since I have limited space for the TV set and did not have room of a separate DVD player.  This unit has the DVD player built in and it works flawlessly.  I also needed a TV with a speaker set-up that allows me to use headphones with the speakers turned off, and this unit allows me to do that.  It is the perfect TV for my needs.  I would recommend you check out the details of this JVC unit for yourself if you are looking for quality with special options at a reasonable cost.", "Date": "September 9, 2012"}, {"Title": "Better than expected, good  price for value", "Author": "Mark Genin \"joymark1\"", "ReviewID": "R1TKCTRG8UQHQ7", "Overall": "4.0", "Content": "With very easy setup, clear picture, reasonable price and no need in DVD player, this unit is a good solution for not sophisticated movie viewers.  It can serve perfectly to children, and being used as a second TV.  It's 720p format is quite satisfactory for most of viewers.No hesitation to recommend it.", "Date": "July 29, 2012"}, {"Title": "LT32DM22 JVC lCD TV w DVD built in", "Author": "saxman \"jetsax12\"", "ReviewID": "RHE9W98TXWBD2", "Overall": "5.0", "Content": "I was looking for a 32\" LCD w a built in DVD player and HDMI so I can use my Apple TV.I could not find any reviews of this item, saw it at Walmart on sale for 299. I decided to get it shipped a I don't have the time to shop for TV and trust Japanes Victor Corp. JVC.If it has a problem you will see an add on here, you'll also see a review. I am pretty easy to please though, I'm not a fussy bugger. I want a unit that works and offers a clear pic.This unit is for my bedroom.", "Date": "July 26, 2012"}, {"Title": "Problem Free JVC HDTV/DVD", "Author": "Liz", "ReviewID": "R3HLEVK3AY8G9G", "Overall": "5.0", "Content": "I am rather astonished to read all of the negative reviews about this JVC HDTV/DVD Combo. I purchased this wonderful television online August, 2012 from Walmart (which no longer offers it for sale).  It is my only television - which I watch daily - and have had absolutely so problems.I have DIRECTV and this television produces a beautiful and colorful picture.  The DIRECTV installer did inform me that I must \"turn on/off\" the television with the JVC remote and use the DIRECTV remote to navigate due to the \"attached\" DVD player.  Also, I purchased a High-Speed HDMI Cable for this television.The sound quality is good, clear, and crisp.Although I have not used the DVD feature often, when I have it has functioned superbly (and easily) with the JVC remote.In conclusion, I highly recommend the JVC 32\" Class LCD 720p 60Hz HDTV and DVD Combo, LT-32DM22.  It continues to perform perfectly!", "Date": "January 9, 2013"}, {"Title": "I LIKE IT", "Author": "E.J.Pfluger", "ReviewID": "R3VNSXL6EFCUZN", "Overall": "4.0", "Content": "LOVE MY NEW JVC, MY ONLY COMPLAINT IS THE DVD PLAYER MAKES A LOT OF NOISE. THE PICTURE IS GREAT.", "Date": "December 11, 2012"}, {"Title": "Good Service", "Author": "Lori", "ReviewID": "R1SMUJA2IUKFGY", "Overall": "3.0", "Content": "Ordered two of this product.  One worked perfect.  The other worked at first and then never turned on again.  Seller says it worked when they recieved even though I tried multiple times before returning.  The did issue an immediate credit for the returned tv.  The other is still working great!", "Date": "March 25, 2013"}, {"Title": "Worked well....", "Author": "Russell", "ReviewID": "R1WYKW1VYXN368", "Overall": "2.0", "Content": "I have had this TV for less than six months.  I use it only for playing DVDs.  It has ran for maybe 20 hours so far.  I tried to use it recently and it would not power up.  I have found a way to get it to power up online but it still remains a work-around.  I'm unhappy with this TV, more so than I have been with other TV/DVD combos in the past.  I will not go with a combo again.  So much for conserving space and JVC quality.", "Date": "February 5, 2013"}, {"Title": "Worked for two weeks", "Author": "lilyredrose", "ReviewID": "R3LIHQ4T7IA5CO", "Overall": "2.0", "Content": "Nice TV w/ DVD player. Purchased for bedroom. Worked fine for two weeks, turned it off one day and next day it was dead.", "Date": "September 15, 2012"}, {"Title": "junk stay away , buyer beware tv will not turn on trust me DO NOT BUY YOU WILL NOT BE HAPPY", "Author": "John Lumia", "ReviewID": "R20VHVJJ7RKFG9", "Overall": "1.0", "Content": "Junk stay away i give it Zero stars it will not turn on half the time .also if you did buy this junk and it will not turn on try power off ten sec .then power up hold vol- and menu at same time then hit power .this must be done on the TV NOT REMOTE", "Date": "December 27, 2012"}, {"Title": "Dies", "Author": "rreid", "ReviewID": "R17P8XA7GEREIJ", "Overall": "1.0", "Content": "Purchased one JVC tv that just stopped working.Purchased a JVC tv for bedroom a few months later,and it didn't last 3 months.  Will not turn on or reset.Defective brand!!", "Date": "January 6, 2013"}, {"Title": "WORKED FOR 2 DAYS", "Author": "furious", "ReviewID": "R1JKJPP0NT2UYP", "Overall": "1.0", "Content": "Got the tv just Sunday worked great Sunday and Monday. Came home from work today (Tuesday) and it wouldn't come on. After trying to Google a solution I found this seems to happens to a lot of these specific TVs. Loved the tv for the two days it actually worked. Don't recommend it unless this problem is corrected.", "Date": "October 30, 2012"}, {"Title": "Great TV but know how to reset it.", "Author": "Jay", "ReviewID": "R3RHKYZC27FFAT", "Overall": "4.0", "Content": "Excellent t.v. It works really well and does everything the way it's suppose to. If it ever stops working just leave it unplugged for a good while and it should reset. I wish I had known that from the start. the reset thing is the only reason this gets one star off. It's a small detail but if you don't know  about it it can be frustrating.", "Date": "November 20, 2013"}, {"Title": "Buyer", "Author": "Rita L Beutler", "ReviewID": "R3R8GPD4WLVDOT", "Overall": "4.0", "Content": "We have had this TV for about a year and so far are pleased.  We've only used the DVD part once, and it worked.", "Date": "October 5, 2013"}, {"Title": "Don't buy a JVC", "Author": "Debra", "ReviewID": "R1W41Z47QKL8DP", "Overall": "1.0", "Content": "I wanted a combo TV this size and was initially happy to find one.  Less than two months later the DVD part stopped working. I contacted JVC and it took almost two months to get it fixed.  I did complain to the corporate office and they still haven't bothered to get back with me (even though their voicemail says they respond within 48 hrs). That was about 2 weeks ago. Bottom Line:  New TV with minimal usage should not break. AND it should not take dogged effort and lots of time to get the problem resolved. JVC is not a good buy.", "Date": "July 12, 2013"}, {"Title": "Love Love Love", "Author": "jamuny", "ReviewID": "R12WDJDD2IT8EI", "Overall": "5.0", "Content": "I got this TV because I was having trouble with seeing my 19 inch in my bedroom. This is perfect for a bedroom. I am also a big fan of JVC. I think the colors on the picture screen are so vibrant. That color far surpasses any other brand!", "Date": "June 23, 2013"}, {"Title": "great side-viewing", "Author": "peter12345", "ReviewID": "R1EBB0I248X1IS", "Overall": "5.0", "Content": "The functions (including the DVD reader) are great. What I particularly like is the the ability to view from the side, because we sit on separate sides of a short room, so we can't back further away from the TV in order to reduce the angle between our two views.", "Date": "October 27, 2012"}, {"Title": "Worked for only 4 weeks!!", "Author": "Atsirk85", "ReviewID": "R77NFUX5IUXUU", "Overall": "3.0", "Content": "I was in love with this T.V. until we had a storm and the power went out. I woke up and tried turn on the t.v. and to no avail it would not come back on! I'm so disappointed. I have contacted the seller who sold me the t.v. here on amazon. I'm waiting for their response, will give update.", "Date": "October 12, 2012"}, {"Title": "Refuse delivery there is a restock fee charged.", "Author": "Disappointed", "ReviewID": "RZ8OP9H03CBP5", "Overall": "3.0", "Content": "I purchased this for my son, thought it was the right one, was informed by him, it wasn't what he wanted. I refused delivery so never even had it in my hands. When I received the refund Amazon took 15% of the purchase price as a 'restock fee'. There is nothing in the initial 'ad' that tells you you will lose money if you refuse or return it. I'm very disappointed.", "Date": "December 22, 2012"}, {"Title": "32\" JVC LCD/DVD combo 720p HDTV (LT32DM22)", "Author": "pooty", "ReviewID": "R35U296B9MHWCM", "Overall": "3.0", "Content": "I really can't say yet how I like this tv because it is a Christmas present for my daughter. I am excited about it because it already had great reviews on it. Will comment later.", "Date": "December 7, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "TV Type: LCD\nScreen Size Class: 32\"\nVertical Resolution: 720p\nMaximum Resolution: 1366 x 768\nScreen Refresh Rate: 60Hz", "Name": "JVC 32\" LCD 720p 60Hz HDTV/DVD | LT32DM22", "ImgURL": "http://ecx.images-amazon.com/images/I/410fAf0BbrL._SX300_.jpg", "ProductID": "B005Z4XITQ"}}