{"Reviews": [{"Title": "awesome!", "Author": "p liv \"feeyem\"", "ReviewID": "R1XMVUQKGDX0UP", "Overall": "5.0", "Content": "Awesome we had it since 2006 very nice TV. Easy to remember where the buttons are the remote works good connecting with our cable. The other people wrighting one-star reviews don't know what there talking about", "Date": "December 3, 2012"}, {"Title": "no customer support for 1 year old tv", "Author": "jeeper", "ReviewID": "R7I32LAX4YBTW", "Overall": "1.0", "Content": "tv lasted about 14 months.  sanyo customer service will not answer emails or even return calls.  save your money to buy a large trash can so when your year with this set has passed you can throw it away since it is worthless at that time!", "Date": "November 8, 2011"}, {"Title": "Good for the money", "Author": "Tycho", "ReviewID": "RX819M8E6VQ1C", "Overall": "4.0", "Content": "I bought this TV a few years back on sale, still going strong. HD works great, picture quality is good. The only downside to this product is that it has a large black border around the screen and the poor sound quality. The sound can be fixed by hooking up your own surround sound though.", "Date": "December 4, 2012"}, {"Title": "Sanyo's TV's BREAK.  And Quickly.", "Author": "Surfer Girl 27", "ReviewID": "R3MY4V2WF86NH3", "Overall": "1.0", "Content": "Bought a Sanyo LCD TV less than 1 year ago & it kept turning off randomly for no reason.  We just dealt with it for awhile, but tonight my husband & I read TONS of reviews about other Sanyo TV's doing the same thing, & worse - turning off & staying off & not working at all!  I saw this & read it to my husband who said, \"At least we don't have that problem.\"  Minutes later, we did.  Our TV just turned off & won't go on anymore.  NEVER buying anything Sanyo again, and I cannot believe they do not care anything at all for their brand name.  Don't believe me?  Just Google Sanyo TV problems, you'll see thousands of complaints, with NO response or help from Sanyo.", "Date": "January 30, 2012"}, {"Title": "Will break within 2 years after purchase", "Author": "Rob", "ReviewID": "R3NQ2CM43KC792", "Overall": "1.0", "Content": "18 months after getting Sanyo TV, the screen developed a small black line accross the top that came and went. Line kept growing and lasting longer. Now only the half of the screen is visible. Do not buy Sanyo", "Date": "May 9, 2012"}, {"Title": "Read before you purchase", "Author": "missys mom \"joyce\"", "ReviewID": "R1V2AVB0B9VX12", "Overall": "1.0", "Content": "I have had this tv for about two months.  The price was great, got it on sale.  I am not pleased with the picture.  I have hd from my cable company that cost's 10.00 per month.  The only channels that are worth watching are the hd channels.  I have tried adjusting the sharpness/contrast for the channels that are not hd with no success.  If I had it to do over I would spend more for a samsung/sony brand.", "Date": "January 4, 2012"}, {"Title": "worst tv ever", "Author": "JUDAS TREES", "ReviewID": "RZJ96FYFZKKDK", "Overall": "1.0", "Content": "BEWARE of Sanyo dp42840 hdtv.....550.00 down the drain. 1st the sound started going haywire and then I lost half of the picture color on just half of the screen. The t.v. was one year old and no warranty left.......S.O.L......", "Date": "March 7, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0051RC7V2"}}