{"Reviews": [{"Title": "Awesome TV", "Author": "Bittersweet003", "ReviewID": "R1WRIELXYLGH8R", "Overall": "5.0", "Content": "My sister and I love our new tv...it was definitely worth it and then some.  The picture and volume are great, I didn't have to adjust anything. I wonder why I'm the first to review this product...it's awesome!!", "Date": "April 30, 2012"}, {"Title": "simply Great", "Author": "Leo", "ReviewID": "R1QAG4XFNSJMAU", "Overall": "5.0", "Content": "For a great picture, that only needs a little tweaking to one's taste, adjusting the Color, Tint, and Contrast, this model will give you a true Life like picture, the Sports action couldn't be any better, and just watching the pool water splashing during the Olympics was so Real, like being there in person.  Although this is last year's model, and doesn't have any Internet connection, this very slim plasma television will give You a Great picture, and there is no need for a surround sound system, unless you like that bouncing off the wall sounds.  At under $700.00, this plasma TV is a very good Buy, so much better of a true to Life picture, than an LCD TV. Have had this TV, almost a year now, and We, Family, and Friends are still impressed, with whatever we are watching, be it a Movie, or anything in Sports, after researching so many televisions for months, we definitely made the right choice,  5 Stars for this LG model TV.", "Date": "August 23, 2012"}, {"Title": "Excellent TV", "Author": "UTBadger", "ReviewID": "RV6QF0429FE9F", "Overall": "5.0", "Content": "This was my first big scree, flat screen, and first plasma, so I did a lot of shopping around and viewing in stores first. Its hard to view plasma screens in electronics stores because they will never look as good there next to the LCDs. Its because the stores are always brightly lit and plasma screens reflect bright light more than LCD. I considered that my living room has darker paint and only 1 window that could reflect light - other windows are beside the TV and only get morning light. Also, I mostly use the TV at night. So I chose plasma because in dimmer light the picture is better than LCD. I've had the TV over a year now. The set up was very simple for someone non-techy. There are pre-set picture modes that you can use, or if you want, you can manually program picture quality settings (there are about 100). You can find other people's manual settings online to save you time if you want. I used manual settings and it took me about 15 minutes. Picture quality is fantastic. Brilliant colors and dark scenes are contrasted well and very visible. Does everything well from movies to sports. The remote is simple and works fine. I was pleasantly surprised with how good the speakers are, but I like most, added a separate system - sound bar. I would definitely buy again and definitely recommend.", "Date": "February 3, 2013"}, {"Title": "Can't believe it!", "Author": "April", "ReviewID": "RF7Q0L390GN29", "Overall": "5.0", "Content": "My husband and I were debating on getting a newer tv as our outdated 23\" was dying on us.  Current tv prices are outrageous and we were so surprised to find a tv that we could actually afford. It's a great size with great picture quality, plasma is way better then LCD HD anyway.  The only thing is the sound isn't all that great and we have to invest in a surround sound system, but what the hell, why not?", "Date": "August 2, 2012"}, {"Title": "Fantastic TV", "Author": "Briggs", "ReviewID": "RQXZWR3ULOV49", "Overall": "5.0", "Content": "Replaced a 4 year old Mitsubishi junk DLP that had many issues. The picture on this blows that TV away. Great price to. Be careful who you order through, we got ours through an odd shipping company that gave us some trouble. You want UPS or Fedex.", "Date": "December 23, 2012"}, {"Title": "a wonderful purchase", "Author": "S. Glauser \"egofixer\"", "ReviewID": "R2AOJLUA4EPC1Q", "Overall": "5.0", "Content": "An excellent value...the price, features and quality are really surprising...picture quality of this plasma screen is sharp, bold and vivid...the sound is adequate and typical of a flat screen, not great but ok...well worth the price which is greatly reduced from the original as it's a year-old model...isn't internet capable but with a laptop and its usb port this isn't an issue", "Date": "October 4, 2012"}, {"Title": "SORRY, I DON'T KNOW WHAT'S SUPPOSE TO GO HERE.", "Author": "JANICE ROSENTHAL", "ReviewID": "R3PTEFLN7N0RSC", "Overall": "5.0", "Content": "WE ARE VERY HAPPY WITH OUR NEW 50 INC. TV.  IT SOUNDED TO BIG FOR OUR APARTMENT HOWEVER IT FITS PERFECT AND WERE PLEASED. LOOKS LIKE I WILL CHECK OUT MORE ITEMS FROM AMAZON.  THANK YOU FOR SUCH FAST SERVICE.", "Date": "May 20, 2013"}, {"Title": "Sports performer", "Author": "Jerry  Collver", "ReviewID": "RME8581JUT1BL", "Overall": "5.0", "Content": "great value  promptly shipped  arrived in great shapeHD is fantastic  especially golf. Can't wait for the Masters in April", "Date": "April 5, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "LG Electronics\n50-inch Plasma\n3,000,000:1 1080P", "Name": "LG 50PV450C 50-inch Plasma 1080P", "ImgURL": "http://ecx.images-amazon.com/images/I/51XZXd%2Bj%2BCL._SY300_.jpg", "ProductID": "B00576ZBI8"}}