{"Reviews": [{"Title": "good enough", "Author": "M. SMITH", "ReviewID": "R1FDW0D4YJA1OJ", "Overall": "4.0", "Content": "Bought this item 1 week ago. Everything seemed fine until I noticed a small red dot on the screen. According to the led Tv expert its a stuck pixel it might go away or it might not. Nevertheless its a decent well priced led; I still haven't decided if I will exchange this item and hope to get a perfect one. Haier makes good led Tv but lacks quality control on their products.", "Date": "August 11, 2012"}, {"Title": "Returned.", "Author": "Jaxy", "ReviewID": "R19JYVCSOKOID4", "Overall": "1.0", "Content": "I made my decision to return this television approximately ten minutes after I set it up.  The sound is awful (which I knew about from product reviews on different sites -- I'd recommend doing a search for this model number before taking the plunge), but the picture isn't great, either.  There is a very prominent motion blur where there's any kind of action.  Yes, that is indeed a problem with all LCD/LED TVs, I do know that, but on this particular set, it was way too much of a problem. Additionally, anything non-HD looks like GARBAGE. Thankfully, Amazon's return policy made the return super easy.", "Date": "August 22, 2012"}, {"Title": "Great Value", "Author": "rev99", "ReviewID": "R192AY3XFDWZBE", "Overall": "4.0", "Content": "This is a pretty good TV, especially for the price. 46\" and full 1080p, also 120HZ.It doesn't have the bells and whistles like WiFi and 3D capability, but if you want aclear picture and a sleek profile at a bargain price, you can't go wrong with this TV.", "Date": "August 10, 2012"}, {"Title": "Okay LED Television", "Author": "rzrbldmn", "ReviewID": "RIO1GRDP7GOEC", "Overall": "3.0", "Content": "I returned a 46 in. HD TCL TV because it was 60 HZ and not the 240 hz that was originally in the description and had paid $483.  I then decided to buy this TV for $413 s it was 120 HZ.  I could have gotten a 60 HZ for less in this brand, same size, but I wanted the better refresh rate and for another $70 this had more bells and whistles.This TV plays very good.  You will be pleased with the picture and the 3 HDMI ports.  Easy TV to set up as they all are now.  The Audio is only FAIR and I had to adjust for full Bass and NO Treble.  But this is an easy and inexpensive fix for the future.What I am knocking it down for and this is important for anyone buying this TV.  You cannot adjust the Tint, use the Lock or Channel choices if you use an HDMI cable.  The HDMI cable cancels out these features which can only be accessed by using RCA jacks.  I suspected this and Haier tech support confirmed it.  They told me, and I actually believe them, that the TV is manufactured to automatically adjust the TINT, or give the best flesh tones automatically when using the HDMI cable.  The Contrast becomes a very important adjustment as does the Normal, Warm and Cool temperature adjusts.  Once you get it right the TV color is very good and the HD play well for sports events.  My settings were Contrast 47, Bright 54, Color 35, Tint 0 (can NOT change), Sharpness 50, Normal, Blue Background on and 120 HZ strong.I will also advise that most stations transmit in 60 HZ.  I found this out as when you push menu on the remote, 1080 i and 60 hz shows up in the corner.  So far I have NOT seen 120HZ even though DirecTV transmits in 120HZ.  Go figure, I could have saved money and bought the 60 HZ TV.  Also for parental controls, which I don't need, but if you do, that will have to be done in your cable box set up if you use and HDMI cable.TV is worth the $400, but not more.", "Date": "December 24, 2012"}, {"Title": "decent quality for decent price", "Author": "kicker420", "ReviewID": "R2MW41OOZH14GB", "Overall": "4.0", "Content": "It is a nice tv for the price.Picture quality is good and being full 1080p and 120hz full motion, it is the official HDTV of the NBA.The sound is lacking due to the hidden speakers located on the back a sound bar is a must have with this tv.No WiFi and other bells and whistles.Overall just a good HDTV for the size and price also being LED instead of LCD.", "Date": "September 19, 2012"}, {"Title": "worth the price", "Author": "Pamela Peigler", "ReviewID": "R2JXABJZG3GCOO", "Overall": "5.0", "Content": "Works like a charm. assembly was simple got here quickly for a great price. I have had it for a while and still works great.", "Date": "May 7, 2013"}, {"Title": "Good value, just don't buy it for the speakers!", "Author": "Ryan Judy", "ReviewID": "R26Z0SGXU5033D", "Overall": "4.0", "Content": "As many others have said, the speakers on this are worse than that of a $10 portable radio. Voices sound as if they are coming from under water. HOWEVER... most people will be using this with a speaker system, making it a moot point.The picture quality is fantastic for the price, good viewing angle and response time make for a smooth picture. Would buy another Haier TV without question.", "Date": "March 23, 2013"}, {"Title": "Late shipping Product damaged by Shipping", "Author": "Douglas Holt", "ReviewID": "R2F756NG1318J7", "Overall": "3.0", "Content": "I purchased the TV on a sale and was really excited for it to come in, I checked the tracker everyday and was dissapointed when it was a few days late.Pros:Screen quality for games and movies.HD film and shows look amazing on the television, games look good.Cons:Shipping was just a day or 2 outside the estimated timePackaging was damaged when it arrived.There is damage to the top of the television but I didn't feel like going through the entire replacement process for a tiny crack on the top of the TV, however I did feel that the shipping was bad enough to remove a star.Other than that the TV is great, a little on the heavy side but for its size its understandable.", "Date": "March 13, 2013"}, {"Title": "Trouble Turning On.", "Author": "william f. beggs", "ReviewID": "R22REVSEMVDI87", "Overall": "3.0", "Content": "Can't get it to turn on and off. Remote works but TV will not accept signal. No PC connector provided.", "Date": "February 8, 2013"}, {"Title": "Great TV, worst speakers ever", "Author": "Ursus", "ReviewID": "R2P8NCAZXSP0XS", "Overall": "3.0", "Content": "Bought the TV about one month ago. Very Happy with the picture, sharpness and brightness but totally disappointed by the quality of the built-in speakers. Hard to understand the news even in a small room. Added the Bose Solo TV Sound System (which is great by the way) and finally I am very happy with this combination. Would buy the TV again but only with additional speakers. At the end of the day, you get what you pay for...", "Date": "February 8, 2013"}, {"Title": "Awesome product at an INCREDIBLE PRICE  !", "Author": "Briana Cameron", "ReviewID": "R1SE853TSWTFR9", "Overall": "5.0", "Content": "Haeir is  a product put out by \" Sony \" . So it's a win win product . I couldn't believe I could actually get a 46\" tv form such a low price ! Several months ago I purchased  my first  24\" Haeir and was so impressed w it's performance, & screen resolution etc that when it came to buying  a larger screen tv buying another one it was a no brainier - buy one ! !  !", "Date": "February 3, 2013"}, {"Title": "Can't go wrong.", "Author": "Jackson", "ReviewID": "R3HAFXIKD6UL1Z", "Overall": "4.0", "Content": "What a deal.  Got it!  Done!  Picture is fantastic.  No problems with speakers.  It cooks food for me and walks my dog Tuesdays and Fridays when I go skiing.  Epic pick up.", "Date": "December 22, 2012"}], "ProductInfo": {"Price": "$979.99", "Features": "46\" LED 1080p HDTV\n2 10W / channel speakers\nDynamic contrast ratio 15,000:1\n1 PC, 1 Component, 3 HDMI and 1 USB input\nEnergy Star 5.3", "Name": "Haier LE46B1381 46-Inch 1080p 120Hz LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/312Y7jo5gzL._SX300_.jpg", "ProductID": "B0056VMA38"}}