{"Reviews": [{"Title": "high quality", "Author": "matthew914", "ReviewID": "R2OKKW21HVR9E4", "Overall": "5.0", "Content": "this is a great tv for a bedroom, Or even an apartment.  it has a very high quality picture and if you have a hd cable box or sattelite dish then you will be amazed by the quality of the picture.  the remote control is easy to use and i is very light.  i was impressed that this tv had inlink.  it also has a usb thumb drive port.  you can put photos on your thumb drive and plug it into the tv ad then share it as a slide show.  this is a truly amazeing tv.", "Date": "December 31, 2011"}, {"Title": "Works Great! only for 6 months though", "Author": "Joe S", "ReviewID": "R1U2TZAK6AYT2O", "Overall": "1.0", "Content": "I bought this tv a few months ago, and it has a crystal clear picture, great sound, the works. but about one month ago, one part of the creen started to go blurry after the tv was on for a half hour. Now, a month later, that part of the screen goes blurry after 5 minutes of being on, and after 20 minutes, the screen goes white, with only the sound working. DO NOT BUY. You will regret it, or get lucky.", "Date": "May 2, 2012"}, {"Title": "HIGH QUALITY TV.......EXCELLENT!!", "Author": "Neso'", "ReviewID": "R389X13W7HQNCT", "Overall": "5.0", "Content": "We bought the 24 inch. Insignia for my daughter.  It was a gift for her to use while attending College.  Purchased it from Best Buy.  Their price beat Amazon's price!!  High quality TV with an excellent picture and features!!  Great buy and TV.  :-)", "Date": "July 30, 2013"}, {"Title": "DO NOT BUY!", "Author": "Admac", "ReviewID": "R1TF6S0LRC3TEA", "Overall": "1.0", "Content": "Three years ago we purchased an Insignia DVD player. Now it is outdated and will not play new Blu rays . We called Insignia regarding this, and they said tough luck. One manager went as far as you say the customer is always wrong. Please spread the word on this share this with everyone you know. I can't believe a company would be so awful. After 3 years a Blu ray player will not work on new movies anymore . That is ridiculous not to mention it's environmentally harmful to make an electronic that will only last three years ! Please share this with everyone. Do not buy Insignia!", "Date": "November 18, 2013"}], "ProductInfo": {"Price": "$224.88", "Features": "24\" LED Flat-Panel Ultraslim design (1-7/8\" deep) 1080p display 60 HZ\nTabletop stand with screws, Remote with 2 AAA batteries\nComponent video cable, audio cable, Cleaning cloth, Two 3W speakers\nInclude 2 HDMI/DVI (1 rear, 1 side), 1 component video (side), 1 composite (side), 1 PC (rear), 1 PC audio (rear) and 1 RF.", "Name": "NEW InsigniaTM - 24\" Class / LED / 1080p / 60Hz / HDTV MODEL NS-24E730A12", "ImgURL": "http://ecx.images-amazon.com/images/I/51g38eup-RL._SX300_.jpg", "ProductID": "B005TNRM8Q"}}