{"Reviews": [{"Title": "Nice TV but!", "Author": "D. J. Bonventre \"DJ Bonventre\"", "ReviewID": "R126KKZHDRJ0F9", "Overall": "3.0", "Content": "Very impressive picture but I have a few comments concerning the voltage and the setup menu.  The power requirement is 12VDC not 120VAC.  The converter that came with it will have to be replaced at some point and if outside the warranty period, you will be out of pocket a considerable amount of money. The Amazon site was silent on this.  The $6/yr operating cost is a great sales pitch but where was the specification on the DC power and the converter requirements or information on price and availability of the converter. I surmise the reason it is not dual voltage is because LG wanted to cut cost and not include a power supply within the TV.  Ok, fine, but be upfront about it.  In general, the manual is not very detailed. The setup operation asks for either antenna or cable.  However, when you choose cable and run the channel scan it scans all available channels including the off the air channels and imprints them in memory.  Then you have to delete the unwanted channels.  The deleting process is tedious and frustrating because after each deletion it takes you back to live tv and the process starts all over again.  I am on the fence on whether to return the tv primarily for the power requirement feature and the hassle of replacing a major part in the future not to mention the cost.", "Date": "March 30, 2012"}, {"Title": "Wow...", "Author": "The Drowning Man", "ReviewID": "R2GDXRC6XWSU1K", "Overall": "5.0", "Content": "I purchased this to replace a 23\" Samsung LCD TV.  The Samsung was top of the line in 2005 and the LG shines in comparison. The Screen is 3\" bigger at 26\" but actually takes up slightly less real estate on my wall.  I needed a smaller simple set with excellent picture and this one does it for me.  It doesn't have the inputs and outputs that my Samsung has but it is mounted on the wall in my bedroom and is not part of a home theater system so all of those features weren't needed anyhow.  It has 2 HDMI inputs, 1 Component and 1 Composite.... really all one would need however it does not have audio out.The picture is quite impressive.  I have the larger LG 55\" 3D TV in my family room and the picture on the smaller one looks almost as good.  The fact that it is only 720p is meaningless in anything under 40\" unless you are right up close.Best of all for my needs is the fact that it is one of the most energy efficient for its size.  The estimated annual cost is $6.  Yep 6 BUCKS! I have a solar home so every watt I save helps justify the cost of the system.  All in all a great TV.", "Date": "March 28, 2012"}, {"Title": "A couple of irritants", "Author": "EdP", "ReviewID": "R3SR36VAYW1A75", "Overall": "3.0", "Content": "I'm using this LG in my kitchen area. Although I have cable, I do not have the cable box, so I receive just the standard 70-or-so channels available and no HD. I have no complaints about the picture or sound - quite capable and all I need in a kitchen TV.However there are two things about this TV I find irritating.One is the channel selection procedure. Let's say you want to punch in channel 53. Pressing the '5' displays the \"Similar Channel List\", a drop down list of every channel that begins with '5'. Press '3' and a full five seconds later, the channel changes. If the TV was already on channel 53 when it was turned on (and you didn't know it), pressing '53' displays the typical off-channel snow activity with an incredibly loud static hiss.What is this thing thinking about that takes it five seconds to switch channels? My cable box on another TV doesn't take that long and it's slow at most everything.BTW - Using the channel settings, I deleted all the TV channels, all the CADTV channels, and all the CATV channels I do not watch.The other irritant is the remote's physical design - it's about as stable as a canoe. When working in the kitchen, I often want to quickly hit a single button (mute usually), but that flips the remote over. It was an irritant easily remedied by replacing it with a Radio Shack remote I had hanging around the house.", "Date": "July 4, 2012"}, {"Title": "Awesome TV", "Author": "B. McGovern \"Dog Lover\"", "ReviewID": "R35GK7SME1GL4D", "Overall": "5.0", "Content": "I purchased this tv to replace a Samsung which was about two years old that was plagued with an ongoing problem that the manufacturer has encountered with several of their sets.  I am not dissapointed.  It was easy to setup and the picture clarity is awesome.  I am hoping for a longer life than the Samsung and if that is the case it would be the idea tv.  It was also priced right.", "Date": "March 17, 2012"}, {"Title": "Very satisfied", "Author": "Eric", "ReviewID": "RQWXDHGHK01CP", "Overall": "5.0", "Content": "Bought this LED TV for our bedroom and it only took 20 minutes to unpack, connect, and program all channels.  The HD channels are ridiculously clear and look outstanding on this 26\" screen.  The light-sensing technology and automatic brightness adjustment work extremely well, as the TV lowers the brightness during nighttime viewing with the lights off.  Takes up a small amount of space on the dresser, so TV size has not hampered dresser-top use at all.  I've read reviews about the sound being a bit of an issue, but haven't noticed any sound loss or difficulty hearing the audio to this point. Throw in the fact that Amazon had this TV on my doorstep 1.5 days after I purchased it, and the overall experience and quality have been top-notch!  Highly recommend this LED TV!", "Date": "May 16, 2012"}, {"Title": "Overall - NOT a Winner", "Author": "Humshark", "ReviewID": "R3KOARESHJOYRX", "Overall": "2.0", "Content": "I bought this as a replacement set for a 18mo old set that went dark.  This set is the same size as our previous one, mounted in the same manner.MOUNTING:The mount is an approved device with the proper spacing and mounting holes, etc.  This is a mount that allows for a lot of movement and since we are watching this set in a room that is not very deep but wide the mount allows you to angle the TV in the direction you need.I was struck by the FLIMSINESS of the mount point within the set itself.  We often grab the set by the edge to swing it left or right and the whole frame flexes easily.  Now this may last forever, being designed to bend and not break, but it doesn't give me that feeling when I move it.  I have had no other set flex so much once mounted.  Most are VERY rigid.PICTURE:For a low power unit, I am satisfied with the brightness, contrast, and various settings, all arranged in an EASY to use interface.  The sharpness of the picture is great.  At this size, a 720 resolution is perfectly fine and I have no complaints.I had a hard time adjusting the color however because I was standing off to the side while doing so.  My wife kept telling me it looked funny and she was right.THIS IS NOT THE TV IF YOUR SITTING AREA FOR VIEWING IS NOT DIRECTLY IN FRONT, FACING THE SCREEN !!You can easily see LARGE color and contrast shifts in the picture just by moving a small distance left or right from the center of the screen.  Sitting 7 to 10 feet away, a family of four sitting side by side will see different color especially affecting the flesh tones of faces.  ( The last set I bought, I specifically looked for a wide viewing angle ) The NARROW viewing angle of THIS SET, is the biggest disappointment I have.SOUND:The audio quality is decent.  We have our set mounted from a wall, and the speakers point down on this particular set.  That saves room around the frame, but may affect your audio response depending on your particular mounting options.I have a running joke about television speakers, because I enjoy and try to obtain Hi-fidelity from most all devices, and by design, televisions rarely can deliver.  So I'm looking for weather or not I can hear the voices clearly.  Weather or not surround audio programs, result in a strange listening experience due to improper processing, IE very loud background noises when you cant hear the main character in the middle of the screen.  Sports programming and the commercials will often provide good tests for these kinds of problems.  All in all the audio from this set performs well.  There is even a special adjustment to help pull the \"talking\" out in front, called clear voice.Biggest disappoint with the audio- THERE IS NO HEADPHONE or ANY OTHER AUDIO OUTPUT.REMOTE:The remote is easy to use and powerful enough that you do not have to aim precisely at the set.  That's good because you will likely have to hold the remote to use it.  It does not sit well on a flat surface as you push the buttons on top.  It'd be nice to have buttons that glowed or were back-lit, but at this price point you won't find that anywhere.  Overall the remote is perfect for the product.OVERALL:The overall flimsiness does not instill confidence.If you are bothered by what I consider a more NARROW viewing angle than the average LCD set, then keep looking.If you have a longer room then this problem is less of an issue, but you are likely looking for a larger screen anyways.If you are watching from a bed or other type arrangement, this may work for you.I'm hoping that the low power consumption will help this last a good long time.  I expect TV's should last 7+ years.  My previous history with back lights going dark on my devices ( Westinghouse - 24mo, Samsung - 13mo, VIZIO - 18mo ) has troubled me.** UPDATE ** Television Antenna input came off from the back of the set, making it impossible to watch OTA ( Over The Air ) signals.  It appears that good sets at this size and price are hard to come by.  Based on my earlier review I am struggling to simply return it for a direct replacement.  Amazon is Amazing in support for whatever choice I make, taking the fear out of purchasing on-line!", "Date": "September 20, 2012"}, {"Title": "Great LG TV!", "Author": "VaBeachGuy", "ReviewID": "RYOFJZCTHNAJY", "Overall": "5.0", "Content": "Like most, I searched high and low for the best quality(and bang for the buck) TV I could find. The LG did not disappoint! Sharp picture, easy set-up, and LED technology make it a no-brainer for someone looking for a smaller TV for a bedroom, beach-cottage, or dorm room. Highly recommend-enjoy the LG!", "Date": "June 2, 2012"}, {"Title": "not a techie!", "Author": "Jennifer Stewart", "ReviewID": "R3DB6V8W7BZPTF", "Overall": "5.0", "Content": "I am an idiot technically, and I rely on the judgment and opinion of others, especially my son, alex.  I only wanted to spend about $150, but he researched and said to spend the extra $'s on this TV.. So glad I did..It's beautiful and perfect for my bedroom.", "Date": "August 6, 2012"}, {"Title": "Clear TV", "Author": "Ronald F. Plimley", "ReviewID": "R1N5B7YEN2NUVL", "Overall": "5.0", "Content": "Very sharp picture, good sound, easy menu. Only slight negative I can think of is narrow viewing angle. I would buy this item again.", "Date": "April 28, 2012"}, {"Title": "Great picture now that I'm using hdmi cable!!", "Author": "Xpert Shopper", "ReviewID": "RTMT22BSNIHJF", "Overall": "5.0", "Content": "Just received this tv yesterday. It is replacing a 4:3 15\" Sony in the kitchen. The picture looks nice so far, but I'm only able to get letterbox view when I set the screen format to 16:9. As background, I have this tv connected to a FIOS HD box in the great room via coax output of the box. I also drive my 65\" lg tv from this same box via its hdmi output. I have the box set to 16:9 format. HD pictures fill the screen on by big lg tv, but only display in letterbox format on this new 22\" tv. Wondering if hooking to coax is the problem. The FIOS box only has one hdmi output. So far the only way I can fill the screen is to change the tv format to zoom. Update: Problem solved by getting an HD box from Verizon and using HDMI cable. Fantastic picture!!", "Date": "June 12, 2012"}, {"Title": "Good Value", "Author": "CD", "ReviewID": "R3GY0R2A5IM7IE", "Overall": "4.0", "Content": "I got this for my mom to replace here dated CRT.  She loves it.  The picture is crisp and the sound is good.  It took less then a 1/2 hour to get it out of the box, install the base (2 screws), get it all plugged in and program the channels.  I have no complaints.", "Date": "July 19, 2012"}, {"Title": "Just right", "Author": "Roger Schneier", "ReviewID": "R1IA8VV35W16EC", "Overall": "5.0", "Content": "Chipped in with my siblings to get this for my nanogenarian parents.  Set up easily and has a great picture and, importantly at their age, very good sound.  It also gets more over the air channels than the 19 inch Samsung that it replaced, so the tuner must be more sensitive.", "Date": "January 17, 2013"}, {"Title": "NO AUDIO OUTPUT OF ANY KIND!", "Author": "Luminus", "ReviewID": "R2HC6Y88D7MQJ9", "Overall": "4.0", "Content": "I just wanted to make that clear, without anyone having to read through the reviews to get this information.  I bought this television as a replacement to an older model, and they sent me this new, slimmer model.  There's not even a headphone jack.  It's ridiculous.  What kind of person thinks a tv doesn't need audio out?  It's like they never turn the tv on to listen to those cheap speakers.  You can't even turn the volume or bass past 50, or you'll get an annoying vibrating sound anytime something with bass plays and 50 is pushing it.Everything else is fine.In order to solve this problem, you can take the audio end of the cable that plugs into the tv (xbox, cable, dvd, etc.) and plug it into an audio receiver using an audio extender:http://www.amazon.com/Cblwhl-Male-Female-Cable-Extension/dp/B000I1GZ0U/ref=sr_1_8?ie=UTF8&qid;=1353783328&sr;=8-8&keywords;=audio+extender", "Date": "November 24, 2012"}, {"Title": "Superb picture, quality sound", "Author": "Danielle Gross", "ReviewID": "R11ACGU0FP7W3I", "Overall": "5.0", "Content": "Pros: Great picture for 720p.  Though it looked less than promising before I got the settings corrected, I was more than satisfied with this tv.  The blacks are black, the colors are bold.  Perfect size for a bedroom tv. I actually just downgraded from a 32\", but it feels like an upgrade! My eyes are better adjusted with the smaller screen, but it is still big enough to read small text from 4-5 ft. It's very thin! Thinner than other tv's that say they are ultra slim.  The sound was surprising for such a thin television. I actually was tricked into thinking I had surround a few times before remembering that it was coming from my television speakers and not from across the room.Cons: Small stand, yet solid. And the speakers crackle if it's played too loud ( as to be expected with a thinner tv)We use this tv for our computer and our Xbox and it's met our expectations and passed them. Excellent buy.", "Date": "March 30, 2013"}, {"Title": "Good price for great quality TV", "Author": "Dennis M", "ReviewID": "R1HNZXQNN99YTA", "Overall": "5.0", "Content": "Title says it all. Read the reviews and took a gamble for which I'm glad I did it is a great TV.", "Date": "March 7, 2013"}, {"Title": "Nice TV.", "Author": "Alan Curtis", "ReviewID": "R1O33FDMDSS8LT", "Overall": "4.0", "Content": "Sharp picture and it fit inside the cabinet it needed to.Only negative is that the \"channel management\" is kinda clunky.  Takes a LONG time to scan the channels, and it doesn't deal well with the fact that we have a switch to connect to CableTV or over-the-air antenna.I defiantly would by this again if I need another TV of this size and simple no-frills feature content.", "Date": "January 7, 2013"}, {"Title": "Smart TV to buy.", "Author": "Boggy G.", "ReviewID": "R1R0G2S8X0Q1A7", "Overall": "5.0", "Content": "Just like VaBeachGuy, I searched high and low for the best TV @ the best price. I got this at $365.00 back when Amazon had them stocked, but this TV is, honestly, EASILY worth $420, so grab it a for as close to $400 as possible.The viewing angle isn't as good as alot of other sets. Even though the picture quality is always pristine, to get that real HD look, you need to be sitting in just the right spot. You want to be somewhere around 7-9 feet away, and you want to be sitting on something rather high (or, place the TV on something rather low).Once you get in the right spot, you'll be extremely impressed with the exceptional picture quality. I played Heavenly Sword -- an older game -- for PS3 on my set using an HDMI cable and man, did it look great. Game mode seems pointless and too dark, so go ahead and use vivid, standard, sports or custom.Aside from super-sales, this is probably the best $400 HDTV you can buy.Probably not a 5/5, but it's at least a 4.5/5, taking into account the fact that it's so affordable.", "Date": "September 11, 2012"}, {"Title": "Excellent buy", "Author": "Jack Linker", "ReviewID": "R3PSE1I53ZPVFS", "Overall": "5.0", "Content": "Great tv.  Sound while not top notch is better than some others I tried. All flat panels seem to have this problem.  Our 42\" LG is about the same.  Very good picture.  Only complaint is that the power cord transformer is large and hard to conceal behind tv.", "Date": "August 18, 2012"}, {"Title": "Very nice TV", "Author": "John West \"pianodave\"", "ReviewID": "R3JRPJCHDFBCHW", "Overall": "4.0", "Content": "This is a very nice TV.  Easy to set up and the display is very nice.  Also have been pleased with the sound as I am using this in a large room.The one thing that I don't like is the power cable is not just a cord, but is like a 9v box and cord. I am hanging TV on the wall and there is no place to put the cord.", "Date": "August 3, 2012"}, {"Title": "Fantastic display panel", "Author": "mrsteveman1", "ReviewID": "R1OG3KVK2NW16T", "Overall": "5.0", "Content": "Bought this to use with an Apple TV, it replaced an old 20\" computer LCD monitor that was showing signs of backlight burnout, it was never intended to be used this way anyhow it was the wrong aspect ratio but it just happened to support HDCP on the DVI port and was able to correctly display 720p signals.I looked around quite a bit before settling on this model, including some others from Samsung, Panasonic, Sony etc. Some were too expensive, others had bad reviews noting image problems with the panel.26\" is a rare size apparently, lots of 22\" around but too small, found a 24\" Panasonic Viera as well for $20 less, and a handful of 32\" non-LED models for slightly more, but I'm glad I went for 26\" LED instead of 32\".The LEDs were worth it by far, this panel uses less than half the power of the non-led models I looked at, and makes virtually no heat in the panel itself. The power supply is actually separate so the entire panel runs on 24V (no inverter needed for backlight), and it doesn't get hot either. At some point if that power supply dies it can be replaced without shipping the TV itself somewhere for service or moving it around, which is a big advantage.I'm not using the speakers as I have a sound bar (they can be turned off entirely in the menu) but I did try them out and they sound better than the ones on my samsung 32\" LCD in the other room.Inputs can be labeled which is great, I'm only using one of the HDMI's but setting it to a label of \"set top box\" gave it a nice icon in the switcher menu.The picture adjustments are very detailed and useful. The standard contrast, backlight and brightness (they're separate), sharpness, color and tint are there, but you can also individually adjust the brightness, contrast, tint and color settings for red, green and blue, and you can also adjust the color and tint on yellow, magenta and cyan presumably when the panel is in something other than RGB mode. There are also settings for color gamut, white balance, the dynamic contrast setting and noise reduction (both can be disabled), gamma and black level.With some adjustments the picture looks fantastic, black levels aren't pitch black like the bezel of course but the panel isn't glowing like crazy as my old monitor did. It's a LED backed LCD panel, it's going to be dim greyish in the black areas no matter what you watch or how you set it, but it's been fine here.Haven't watched much content with fast motion yet but it doesn't have obvious blurring that I can see. It's a 60hz panel internally which is fine, I don't much like the 120hz+ panels as virtually no content is actually available at that frame rate, so the panels end up doing clever DSP tricks which just look awful and disorienting.Highly recommended panel though, nice and compact (its virtually flat like the lid of a modern laptop), cheap and good image quality.", "Date": "July 31, 2012"}, {"Title": "Excellent TV", "Author": "Bob G.", "ReviewID": "R1RXVZ8M8ZI1IV", "Overall": "5.0", "Content": "Absolutely beautiful picture and very good sound but somewhat short of excellent.  Only two cons, but neither is a deal breaker:1) Using OTA in NYC, this TV reports No Signal for Channels 5 and 9 (neither frequently watched), but my two other TVs are able to lock on to these signals with the same antenna.  (If I need to I can configure a work-around with an external front-end tuner); and2) No audio out capability to connect to external speakers.Chose this as a company gift after X years of service.  I would have considered Sony as my first choice, but will now seriously look at LG instead.", "Date": "July 15, 2012"}, {"Title": "Good all-round", "Author": "Grace E. Mcgann \"Walker gem\"", "ReviewID": "R21IQ461FEA04R", "Overall": "5.0", "Content": "I have been pleased with the quality of this product.  The picture is clear, the size is just right for my kitchen and the color is excellent.", "Date": "July 15, 2012"}, {"Title": "Great for gaming", "Author": "anotherandom", "ReviewID": "R1FJE9YRJFK6MN", "Overall": "5.0", "Content": "I bought this 720p tv to complement the 1080p monitor I use for pc gaming. It's deceptively difficult to find a real 720p led tv; even if they're listed as 720p, most are really a secret 768p. While that's fine for casual users, for anyone with a PS3 or 360 you'll want to make sure that the tv is exactly, really 720p, like this one.The things is, although 768p is technically better than 720p, if you use a 768p tv or a 1080p tv with a PS3 or 360 the image will be \"upscaled\" in most games, meaning the picture is stretched unevenly across extra pixels. It makes the game look terrible unless you're at least five feet away.That's why I made sure to get this real 720p tv for my PS3. It looks great. There's no uneven edge lighting, the led backlight is great for colors, and it's a good price. This is the best choice I could find at real 720p with an led backlight, and I strongly recommend it to console gamers.", "Date": "October 3, 2012"}, {"Title": "It was great for 3 weeks...then???????????", "Author": "Adrienne's Guy", "ReviewID": "R31CRDXX99XLQZ", "Overall": "2.0", "Content": "This TV worked great for 3 weeks then just shut off and would not turn back on.  I tryed everything and nothing.  I have to ship it to Alamaba to have a tech look at it.  This totally sucks.  I will let you know what happens...you have been warned.I received my TV back today.  I sent it to LG in the original box and packing materials.  They send it back to me in a different box and no packing to product my television...result, the black plastic that frames the monitor is all scratched up.  I am not happy!  Why would they do this?!  And the only thing that was wrong was the power cord, which I suspected when I called them and explained the problem.I hope Amazon reads this and responds to me.", "Date": "September 13, 2012"}, {"Title": "DOA", "Author": "Ashley", "ReviewID": "R2Y61Z6WOKGXGY", "Overall": "1.0", "Content": "Received the tv within 2 days.  Very light-weight and easy to assemble HOWEVER I received a defective model.  I couldn't turn the tv on.  I have 2 other LG model LED tv's in my household so I know it wasn't anything I was doing wrong. Returned the tv and bought something locally.", "Date": "September 22, 2012"}, {"Title": "LG screen defect", "Author": "Richard", "ReviewID": "RUBGRJHJW2UAK", "Overall": "3.0", "Content": "The item works ok but has a defective screen when tv screen turns very dark or blackthere are bright flare sections on screen , I looked up this condition on line, its called \" mure\" .but being this is suppose to be a better TV , I am dissapointed in this condition that this product has .", "Date": "June 16, 2012"}, {"Title": "nice little TV", "Author": "C. Dabrowski", "ReviewID": "R3727FDTGODPOP", "Overall": "4.0", "Content": "I wanted a small TV for a tiny bedroom, nothing fancy.  First I tried, and returned, the Toshiba 24L4200U.  (See my review if you want details.)  My fingers were crossed when the LG 22LS3500 arrived, and I have to say I'm delighted with it so far.  The picture is just fine after using Picture Wizard, and I think with a little more tweaking to reflect my personal preferences, it'll rise to great.  The sound is as you'd expect, but compared to the Toshiba, it's fabulous.  I noticed that at low volume (important in a bedroom TV) there was a pronounced, extremely annoying hiss.  Turns out this was caused by Auto Volume, so turning off that function solved the only real audio problem for me.  Overall, I have no problem recommending this TV.", "Date": "August 15, 2012"}, {"Title": "Great picture and sound.", "Author": "krisla", "ReviewID": "RA1YL44Z68D0B", "Overall": "5.0", "Content": "I can't find anything wrong with it.  I would purchase another.  It is across the room from the foot of the bed and we can see it and hear it fine and clearly.", "Date": "January 19, 2014"}, {"Title": "fine picture and sound quality", "Author": "John M. Kelly \"jkellyca\"", "ReviewID": "RNJCAEWPUUMNZ", "Overall": "5.0", "Content": "Bought this for the kids gaming consoles. Has enough inputs to handle Wii and PS3, and is a decent size for the kind of games they play. Would want something bigger for fps or driving games.", "Date": "January 6, 2014"}, {"Title": "Great TV", "Author": "Fidel L. Cuellar", "ReviewID": "R2MAA3NT2U4V54", "Overall": "5.0", "Content": "I really have nothing to complain about.  this is a great TV for the price.  Excellent quality, though with only basic functions.  I love it.", "Date": "November 3, 2013"}, {"Title": "Lasted 10 months", "Author": "Mary Lisa Schmidt \"mom to 4\"", "ReviewID": "R1I9CA0DA1PO55", "Overall": "1.0", "Content": "Suddenly, less than 10 months after I ordered it, it  stopped working.  The screen is black, sometimes the audio works, and sometimes the screen starts working after 20 or 30 minutes. My cable guy said it must have a bad video card. Very disappointed.", "Date": "October 11, 2013"}, {"Title": "Nice HDTV", "Author": "Errol Mascareno", "ReviewID": "RGLHMZKN848FB", "Overall": "5.0", "Content": "This TV was better than I expected. It has a nice picture and excellent sound for the money! You would be hard pressed to find a better deal.E.M. in Albuquerque, N.M.", "Date": "September 24, 2013"}, {"Title": "Works", "Author": "fixitpro \"fixitpro\"", "ReviewID": "R1RMHRPW9Z0192", "Overall": "4.0", "Content": "Bought this to put in the kitchen,  but found a 29 inch with a smaller bezel,  to fit,  so this is back in the box,  used as a spare.  Works okay when we need it.", "Date": "August 9, 2013"}, {"Title": "Disappointed", "Author": "Penny Fuller \"Peg Leg\"", "ReviewID": "R3E1FDAHGTMPGR", "Overall": "3.0", "Content": "The sound quality is very clear and balanced so that I can not only hear the actors, but understand what they say.  However, the picture is so dark (even after adjustments) it is impossible to make out facial features, at times even bodies.", "Date": "August 6, 2013"}, {"Title": "bought for RV use , very sharp picture", "Author": "P. Vanderhoof", "ReviewID": "R2BG20QKL0Z6YL", "Overall": "5.0", "Content": "This is a great TV ,easy to use , easy to reprogram for different locations full features and led for low energy consumption", "Date": "July 18, 2013"}, {"Title": "Great Price 4 a Great TV !", "Author": "BubbaC", "ReviewID": "R34MU25ZCQDGGN", "Overall": "5.0", "Content": "This tv does plenty to improve on my old Analog tv, and then some with plenty of nice features you can't complain at all !", "Date": "May 25, 2013"}, {"Title": "great tv", "Author": "Cliffton", "ReviewID": "R1XZA59041ZGQ7", "Overall": "5.0", "Content": "I bought this as a gift for my wife in her craft room. I have had other LG flat panels before and this one is no different....it is great!", "Date": "May 9, 2013"}, {"Title": "LG 26 inch LED LCD HDTV", "Author": "Charles A. Laabs \"Harris\"", "ReviewID": "R34M7DRG4RBFFP", "Overall": "5.0", "Content": "Checked the product out on consumers report.  The product was exactly as I expected.  It arrived faster than I expected and in very good condition.", "Date": "May 7, 2013"}, {"Title": "Works great", "Author": "JayP", "ReviewID": "R3CSLJXPH3688Y", "Overall": "4.0", "Content": "Tv is very slim except the bottom sticks out a bit more in the back then the rest of the which makes it not really work with low profile wall mounts. I had to put a 1.5\" piece of wood on the wall so that bottom portion wouldn't hit. So it didn't sit as flat as I hopped. The HDMI ports are in a bad spot too for wall mounting. Everything else is great about the tv just not the best for low profile wall mounts.", "Date": "May 1, 2013"}, {"Title": "Won't buy lg again", "Author": "Patrick Rogers", "ReviewID": "R1CAU2PWACWB8S", "Overall": "2.0", "Content": "The tuner is slow and difficult to program.  The written owners guide is very incomplete and I couldn't open the cd so I had to call for assistance.", "Date": "April 24, 2013"}, {"Title": "Perfect fit.", "Author": "runner", "ReviewID": "R181Q4QIU79N6I", "Overall": "5.0", "Content": "Great for the kitchen. LG does it right. It is not as tech advanced as their full size tv's for some reason.", "Date": "April 8, 2013"}, {"Title": "great for my RV", "Author": "R. Beese \"Free to Be\"", "ReviewID": "R2NSLIUWXP9E9B", "Overall": "5.0", "Content": "I needed a tv that had this power cord so I could replace my original th and plug it directly into my battery source....thanks LG!", "Date": "April 5, 2013"}, {"Title": "A beautiful TV", "Author": "lee_hee", "ReviewID": "R2AE7I611JNPJN", "Overall": "5.0", "Content": "I've had this TV for a few months now in my kitchen as merely background noise while I'm working. Unfortunately I catch myself paying more attention to the TV then the cooking in my kitchen! I can't complain the TV is great, the sound is great and picture quality is superb.I'm not a TV guru and I don't look for the best of the best, I just wanted something small and decent and this TV does the trick perfectly.", "Date": "April 2, 2013"}, {"Title": "Great for a small room", "Author": "technogator \"technogator\"", "ReviewID": "R2EYRNSHXOD8XF", "Overall": "5.0", "Content": "Has worked flawlessly for my daughter in her 1 room apartment.  This one is highly rated by Consumer Reports and has a pretty wide viewing angle.", "Date": "April 1, 2013"}, {"Title": "Great product for the money", "Author": "Lisa R \"Lisa\"", "ReviewID": "R2F9RX4O3OZLMK", "Overall": "5.0", "Content": "This is a great TV for my kitchen counter.  Shipped quickly.  Unpacked and set up easily.  For the price and my purpose, this TV is an excellent value!", "Date": "March 20, 2013"}, {"Title": "Excellent modestly priced TV", "Author": "r0k", "ReviewID": "R17IZ00XW9QV7K", "Overall": "5.0", "Content": "I'm using this TV with a cable adapter and an LG \"Smart TV Upgrader\" so I never had to bother with any of the painful OTA channel programming issues.  I was disappointed that this TV has an external power brick but I do like the fact the unit offers very low power consumption.The remote is well laid out. I found that the \"simplink\" feature does not work with the lg smart tv updater.  Turning on the updater does not cause the tv to come on and you can't operate the updater's menus using the tv remote.  This is a minor issue in that I have to juggle one more remote when I'm watching Netflix or other network content which is what I had to do with our previous (non LG) TV.The on-screen menus are well laid out and easy to use.  I did find the \"automatic\" (screen brightness) power saving to be a little too aggressive turning down the brightness in a darkened room.  I switched it to medium and finally to off. I'll keep tinkering with this as I'm sure this feature was enabled for the TV to achieve its energy star rating.", "Date": "March 18, 2013"}, {"Title": "Tv", "Author": "Penney Dunn", "ReviewID": "RH2M8FCSKPDTV", "Overall": "5.0", "Content": "This tv is nice has a sharpe picture. It's very easy to install. Also looks great in the room I have it in.", "Date": "February 25, 2013"}, {"Title": "Bought as a gift", "Author": "Alfred Haner", "ReviewID": "R34AC7EVDB9N3A", "Overall": "5.0", "Content": "A Christmas gift for my live in sister in law.  She uses it every day and really injoys it.  Very nice picture good overall quality", "Date": "February 13, 2013"}, {"Title": "Kitchen TV", "Author": "wins", "ReviewID": "R26UFWGV1QXWJI", "Overall": "5.0", "Content": "This is the best tv we ever had.Took ten minutes to hook it up to the universal wall mount in the kitchen.Works perfect. Easy to adjust. The picture is great. At this size, the 720 resolution is nice. We use a Dish HD receiver, of course.", "Date": "January 31, 2013"}, {"Title": "Nice TV", "Author": "Bob Winchester", "ReviewID": "R3RBAP3T8LMPY9", "Overall": "4.0", "Content": "Nice for a bedroom TV.  It easily mounted to an existing wall mount,  Good, sharp picture with nice quality sound.", "Date": "January 1, 2013"}, {"Title": "LG 22\" - A good TV and reasonably priced", "Author": "Sue K.", "ReviewID": "R2DV2KUDZC36NL", "Overall": "4.0", "Content": "I received the LG 22LSD3500 for Christmas 2012.  I hooked it up to my Roku and am happy with how it works.What some people have looked for in the newer TVs is an on/off/wake timer. This one has it, so I finally got rid of my little 19\" heavy-weight bedroom TV/VCR with a wake timer.  You can set the LG to come on in the morning - once, Mon.-Fri., weekends or just Sundays and can set the TV to go on and off - love that ability - thank you LG for listening and adding that option.With the TV set up on a dresser and then on top of a another stand, it sits well above the bed and viewing it from a lower angle doesn't get you the best image/lighting quality of the TV.I like the automatic room lighting adjustment - don't need the TV so bright in a dark room.  The sound is reasonable and the picture is decent from the right angle.The remote is good and user friendly but could be a little more comfortable in the hand with the volume and channel up/down buttons just a bit higher on the remote, but that's a small thing.Overall I'm happy with the TV and the local digital channels come in better than the old TV with digital converter box.", "Date": "December 31, 2012"}, {"Title": "Purchased several", "Author": "JVincent", "ReviewID": "RXUYW043KYE7O", "Overall": "5.0", "Content": "We recently moved and purchased three of these for use througout our house, all connected to our HD dish system via HDMI. Picture quality is outstanding and there are some nice, smart features that adjust picture brightness with the brightness of the room. We set the one in the befroom to turn off automatically at the same time every night, which is conveint. No more having to remember to set the sleep timer! I know, but its the little things that make the difference. The look of this particular TV is very nice/high end/high quality and doesn't look as cheap as many of the alternatives.", "Date": "December 28, 2012"}, {"Title": "Happy with it.", "Author": "J. Mullet", "ReviewID": "R2QOKO63Q5R214", "Overall": "5.0", "Content": "No issues. It is a great TV for a smaller space. My kid uses it to play games, he said it was the perfect size and was happy with the performace.", "Date": "December 27, 2012"}, {"Title": "Perfect!!!", "Author": "Amazon Customer", "ReviewID": "R11VSD635M7U06", "Overall": "5.0", "Content": "Perfect picture quality, Love this television. Nothing to complain about with this television. Would definitely recommend it to anyone to use in their bedroom.", "Date": "December 25, 2012"}, {"Title": "mom says she love's it", "Author": "david keith", "ReviewID": "R1Z86JMDDDN1ZH", "Overall": "5.0", "Content": "I was out of state when I bought it for her, my sister hooked it up, she has another LG in living room on  Wi-Fi,  my sister said she pushed program and it did everything automatically.. I will have to double check but for now everything is ok..i'm just waiting for the new 55 inch smart TV's to come down in price.LG has proven to be a great brand for quality and dependability so far. I would recommend to anyone", "Date": "December 23, 2012"}, {"Title": "Great medium-sized TV/monitor", "Author": "Alexis Raney", "ReviewID": "R2T7YPX24ZXNL8", "Overall": "4.0", "Content": "I was looking for the largest screen under $200 and this made the cut.  Good picture quality and easy set up.  Only one or two issues:  1) the screen is a little dark when viewing with the lights off and 2) the internal speakers are not capable of much volume.  Overall I am happy with the purchase.", "Date": "December 2, 2012"}, {"Title": "LG 32LS3500 32-Inch 720p 60 Hz LED LCD HDTV", "Author": "Jan Woodall", "ReviewID": "R1YB8CVT49PXZE", "Overall": "5.0", "Content": "Ordered this TV for our 42' Nordic Tug boat because of size considerations.  It was a tight fit, but the dimensions were accurate and fit well.  The picture is very good, but is best when viewed from directly in front of it.  As one moves to side (about 20 degree angle) the color intensity starts to degrade, but is still very watchable. We use DirecTV as our provider and do not use the \"HDMI\" input (use video in - yellow cable)since we do not have an HD receiver and/or antenna on the boat.  We do not have very many hours (20 hrs) on the unit yet due to leaving the boat for the winter.  I will update this review next summer after more hours of operation.  Also I do not know about sound quality since we have the sound routed directly to a Bose sound system and have not even tried the \"in TV\" speakers.  Overall it is a very good unit.  We also have a 22\" LG LED TV in our master cabin which was installed last year and it has performed well.", "Date": "November 5, 2012"}, {"Title": "Incredible", "Author": "m4h3r \"Go Bucks!\"", "ReviewID": "RXABUQCHFWC9P", "Overall": "5.0", "Content": "Without a doubt the best TV I've owned to date.  Bought it to stick on the kitchen counter and wow the picture!  Sound is what you expect from an LCD, but enough to do the job.  Again, can't say enough about the picture.  Color, brightness everything was great right out of the box.  The remote is a little counter-intuitive, but easy to figure out once you have had it awhile.  Initially I was leery about purchasing an LG tv, even though I have an LG washer/dryer, I've always been a Samsung fan.  But this has changed my mind about lower priced LCDs.  I would definitely buy this again in a second.", "Date": "October 20, 2012"}, {"Title": "Perfect for our purpose", "Author": "J. C. Mosher \"JCM\"", "ReviewID": "R3GEVZ3S2Y9NZZ", "Overall": "5.0", "Content": "We got this unit for a work apartment situation but sized it for a bedroom armoire at home.The first one we received had an annoying buzz especially when playing male voices.We did a return which worked out very well and the replacement unit has been perfect..The initial setup was simple.  We use it exclusively with two HDMI inputs.Would be nice if it swiveled on its base but it's light enough that it is easy to rotate.Would also be nice if it would tilt slightly but that's no big deal.We're very happy with this TV.", "Date": "October 19, 2012"}, {"Title": "Great TV for the purpose", "Author": "red mom", "ReviewID": "R3UW05HOKPGBLB", "Overall": "5.0", "Content": "We needed to replace a tv in the house and this is a great tv for the value. Clear picture and easy to use.", "Date": "September 6, 2012"}, {"Title": "Great deal!", "Author": "Richard A.", "ReviewID": "R2QI2NETQKWU8W", "Overall": "4.0", "Content": "Very happy with this purchase. This was my 1st LG. Picture was better than I expected for this price. Set-up was quick and easy. Was surprised by the power pack that came with the TV rather than A/C cord.", "Date": "July 19, 2012"}, {"Title": "Great 26 inch LG  tv", "Author": "Hobbesmom", "ReviewID": "R3HONTOVZZQQKE", "Overall": "5.0", "Content": "Received order in 3 days,took tv out of box,set up in bedroom ,connected to cable,scanned channels,set settings& looked at program all within 20 minutes. The picture is large & crystal clear. Not every company makes a 26 inch,& our bedroom is large so we needed a larger screen. Loved the service,price,& product,", "Date": "July 4, 2012"}, {"Title": "PRETTY GOOD", "Author": "AL 66", "ReviewID": "R2Q41MT4DA610O", "Overall": "4.0", "Content": "FOR WHAT IT COST AND NOT BEING A 1080, IT WAS PRETTY GOOD. GOT IT FOR MY DAD TO WATCH BALL GAMES IN HIS BEDROOM. ITS HIS FIRST FLAT PANEL TV. HE WAS VERY AGGRAVATED AT TRYING TO LEARN THE ASPECT RATIO GAME YOU HAVE TO PLAY TO GET A PROPER PICTURE. JUST WHEN HE GETS IT DOWN FOR ONE CHANNEL, HE SWITCHES CHANNELS AND ITS MESSED UP AGAIN. PEOPLE ARE EITHER TOO TALL AND SKINNY OR TOO SHORT AND FAT MOST THE TIME. ITS NOT REALLY LG'S FAULT, ITS THE WAY TV'S ARE NOW. HE USES BASIC CABLE WITH NOT CABLE BOX. ITS A NIGHTMARE TRYING TO SHOW HIM AND EXPLAIN TO HIM THE HIGH DEF CHANNELS AND THE ANALOG. ITS REALLY TIME FOR THE GOVERNMENT, AND THE TV STATIONS TO GET THEIR CRAP TOGETHER AND FINALLY PUT A REAL DAGGER INTO ALL ANALOG BROADCASTS, PERIOD.", "Date": "February 14, 2013"}, {"Title": "great for the price", "Author": "AceFiles \"AceFiles\"", "ReviewID": "R2JMYD9KOMWWPF", "Overall": "3.0", "Content": "This is a fine TV for the price and the picture is great.  Overall, a good buy.  However, as one of the other reviewers already noted, it's construction does not exude confidence...I believe the reviewer stated that it had a tendency to wobble a little while on the stand.  Instead, I opted for a wall-mount and didn't think it would be an issue.  My wall-mount allows for movement/adjustment of my TV, but each time I move it, there is a little wobble that is slightly unnerving.  Hopefully, it will continue to hold up over time.This may not be a big issue for most, but there is an additional issue I find inexplicable...there is no audio-out-port.  I cannot add speakers or a headset...I've never owned a entertainment device that was missing an audio-out-port.  This may not be a huge issue for many, but it is very limiting...especially for a TV with such small speakers.", "Date": "January 16, 2013"}, {"Title": "Great, but Concerned by Other Review", "Author": "Vivaldi", "ReviewID": "RG69MSB91ODER", "Overall": "5.0", "Content": "[[ASIN:B006ZH0INQ LG 22LS3500 22-Inch 720p 60Hz LED LCD HDTV]We purchased this for a recent widow residing in a very small home they had worked hard for all their marriage. One TV was 'dropped' and another couldn't be viewed easily, much less by senior, so we picked this out and had it delivered. A local antenna installer/repair person went out and set it up for her, kindly! (so we do need another 'rabbit-ears') But, from one reviewer's caution about the voltage, etc. I'm concerned that we may have given her something that won't last as long as LG usually does. It's the 22\" so perhaps that reviewer's TV was electronically different.Please chime in on this so we can do whatever needs to be done. I will call the antenna \"guy\" to see what he thinks - most likely, he would have noticed this, but just in case . . . we don't want her over-burdened with losing this, or high costs which she cannot afford in any way whatsoever.thanks all . . .", "Date": "September 15, 2012"}, {"Title": "great picture", "Author": "lindsey1315", "ReviewID": "RDWUV2MD1R5M8", "Overall": "5.0", "Content": "i think this has a great picture.  there is no extensive paper manual, its on a CD. nice easy touch buttons on the front of the screen.  it took us a few min. to figure out that there are no physical buttons to push, you just tap the front and the power, volume, menu is all right there.", "Date": "August 24, 2012"}, {"Title": "DOA", "Author": "Uncle LeRoy", "ReviewID": "R1J8UUBTRK6PTD", "Overall": "1.0", "Content": "I purchased this TV along with a wall mount and shelf to put in a bathroom remodel so my wife and I could watch the news and commentary in the morning when getting ready for work.  Amazon, as usual did their usual fine job of getting the items here in a few days.  I went to test and configure the TV before we hung it on the wall.  No communcation between the remote and the TV.  No light from the end of the remote, so I changed batteries...three times.  Clearly the remote was not working, so I called LG for service.I got a woman who did not speak the same English that I and most of the people I know speak.  This combined with her lousy microphone made understanding her an agonizing experience.  She led me though an excruciating exercise that required me to get my camera and verify what I already knew...THERE WAS NO SIGNAL FROM THE REMOTE.  JUST SEND ME A FUNCTIONAL REMOTE SO THAT I CAN CONFIGURE THE TV.But noooo, after 30 minutes of this gibberish and BS she tell me she will process...and the line goes dead.  What a bunch of*&%* crap.  I don't know if the TV even works or I am going to get a follow up beyond the automated call I got a half hour later that only allowed me to push buttons to indicate my \"satisfaction.\"You can bet I won't be buying another LG product.", "Date": "August 27, 2012"}, {"Title": "Great TV", "Author": "Frederick Tran", "ReviewID": "RC521GND828FH", "Overall": "5.0", "Content": "Everthing in the box complete  and there was no missing parts in the box. The TV is great and working properly.Thank you!Fred Tran", "Date": "December 29, 2012"}, {"Title": "Esthetics", "Author": "gas", "ReviewID": "REB11QMIVZ12I", "Overall": "3.0", "Content": "The LG 26LS3500 26-Inch 720p 60Hz LED LCD HDTV was not quite as good as I had hoped.  The sound was fine unless you needed to raise the volume due to other noise in the room.  At that point, it lost some clarity.  The biggest disappointment was that my wife didn't like the washed out picture when not viewing the TV straight on.  I do like the picture quality and user friendly remote control.", "Date": "September 30, 2012"}, {"Title": "Excellent picture, unsatisfied with sound and AV input", "Author": "Fabien", "ReviewID": "R3JRA42L92D8U6", "Overall": "3.0", "Content": "On the up side, picture is great, unit looks good and is very light weight and thin.On the down side:- although it seems you can plug in a yellow video cable (AV in), the picture is black and white, so that was it for me -- I returned it.- the sound isn't as good as I expected and since there is no audio out, you can't add a sound bar or plug it to any other kind of speakers.  I was hoping to play music with the TV in addition to it just being a TV so I looked for TVs with at least 10 watts RMS, but this unit doesn't deliver for me.  As a comparison, I bought a  Panasonic SC-HC57 Compact Audio System with Universal iPod Dock and Airplay Wireless Audio Streaming which I think is also 10 watts RMS and sounds incredibly better (but of course the Pany was intended to play music so maybe it's just not comparable).  This said, the sound for watching movies is, in my opinion, good enough.I gave it 3 stars because this TV would have been good enough if I hadn't needed a yellow video in and to use for music.", "Date": "September 16, 2012"}, {"Title": "Most reviews are for a different TV set.", "Author": "J. Mozdzen \"Buffon\"", "ReviewID": "R3JJPHTI3S2SVE", "Overall": "3.0", "Content": "Pay attention to which model is being reviewed. Most of these reviews are for the 26 inch version, which has a different screen. I do not know if the electronics are different, most likely not.", "Date": "March 19, 2013"}, {"Title": "Replacement for unit burned out by power surge.", "Author": "Peter D. Noyes", "ReviewID": "R1MITLBDK0MX7A", "Overall": "3.0", "Content": "Instruction CD only set up for PC and NOT MAC - Why are more words needed?  Grrrrrr, Grrrrrrr, Grrrrrrr. Grrrrrrr", "Date": "December 7, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "LG 22LS3500 22-Inch 720p 60Hz LED LCD HDTV (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/31Ff5xmJVLL._SX300_.jpg", "ProductID": "B006ZH0INQ"}}