{"Reviews": [{"Title": "Great Deal", "Author": "Erica P", "ReviewID": "R398ARGP5LK14I", "Overall": "5.0", "Content": "Very happy with the pricing.  I shopped different places and I couldnt find a price much better that included free freight like this did.", "Date": "December 19, 2012"}, {"Title": "Nice little package, but with limitations", "Author": "digiwealth", "ReviewID": "R2O1Q1BK5LERES", "Overall": "2.0", "Content": "Part of what my company does is digital signage for offices, waiting rooms, hotel lobbies, etc... and I purchased this because of its price tag.The quality of the picture was fine, but the back end and user interface was nothing special. I never did figure out a way to update this remotely. All updates must be done by saving the whole presentation from the desktop software to a memory stick. Then, you need to plug it in to the tv and tell it to update.Also, you have to install the content management software on your computer to be able to edit or change your presentation. This also means that you have to have access to said computer and can not submit updates while sitting on the couch at home.Content design/creation -  Again nothing too special here. The software comes with some pretty nice pre-made templates, but I could not find a way to use my own design. Also, manipulation and moving areas or zones in a template is not possible. You have to go with what is supplied. Text can be changed, however, you really only have the standard options like font, bigger size, italicized, etc.After all that being said, I do feel that this might have some applications where it would be perfect for. Also, not have a recurring monthly fee is a big plus. I guess it would all come do to your needs and what you are looking for you digital sign to do.", "Date": "December 14, 2012"}, {"Title": "Great TV", "Author": "MARY ROGERS", "ReviewID": "R1KOCY8AIHMDKJ", "Overall": "5.0", "Content": "This TV is great I love it. Just right for my bed room. Was like new. I'm so I bought it.", "Date": "January 4, 2014"}, {"Title": "DONT GET IT", "Author": "Sheryl Shane", "ReviewID": "R2EYY7AKJ7GAU9", "Overall": "1.0", "Content": "TV GREAT AT AT BEGINNING.  HAD 3.5 YEARS.  TV GOING BAD WITHIN LAST MONTH OR TWO.  LINES THROUGH IT.  IT IS NOT THE CABLE.DISAPPOINTED.  PAID 1500-1600 FOR IT IN NOVEMBER OF 2008.  DID NOTHING TO CAUSE DAMAGE.  I AM REALLY UNHAPPY.", "Date": "November 4, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Native Display Resolution 1920 x 1080 full HD 1080p\n2 HDMI inputs with HDCP V.1.3 with deep color\nDynamic Contrast Ratio 60,000:1\nResponse Time (G to G) 4ms", "Name": "LG Electronics 37-Inch 1080p 60Hz LCD TV (37LD452B)", "ImgURL": "http://ecx.images-amazon.com/images/I/515Cs8gWFOL._SY300_.jpg", "ProductID": "B00632QTZY"}}