{"Reviews": [{"Title": "Listing of Inputs", "Author": "Joe Odenweller", "ReviewID": "RGF8QZFJALA2T", "Overall": "5.0", "Content": "This is a review of the LG 60PV250 60-Inch 1080p TruSlim Frame Plasma TV. I did not purchase this from Amazon (Black Friday deal elsewhere for $799).  The screen is beautiful, but I've had it out of the box for 1 day and am no expert.  What I can address is the lack of information on inputs.  If you search for this model in google, you will find the Australian version, not the same.  This TV has the following inputs:Back:HDMI/DVI 1 and 2RGB IN (VGA)Component 1 and 2AV IN 1 (Composite plus Audio L&R;)Optical Digital Audio OutAudio IN (RGB/DVI) 3.5mmRemote Control IN  3.5mmSide (points to side, but usable for back):HDMI/DVI 3AV IN 2 (Composite plus Audio L&R;)", "Date": "November 29, 2011"}, {"Title": "High Rating, but there are issues (2012 Dec. update)", "Author": "Martin Murphy \"56westmoor\"", "ReviewID": "RHUA6QREU2S6W", "Overall": "5.0", "Content": "Yes, I'm giving this a five star rating for exceeding all my expectations for a $870 out the door plasma.  Like many people, I caught the holiday fire sale using all the discount gift cards, but that the post 2011 Christmas season.  I have been pleasantly surprised by the television.  I am using a flush mounting kit Peerless SUF661 Ultra Slim Flat Wall Mount for 37\"-65\"  TVs (Black). I've now owned the screen for over three months.  There are a number of problems that I will list for you to consider before buying this screen.  Remember everything comes at a cost.PROBLEMS:* some people will see a flickering of the screen. I think I can sometimes see it  flicker.  One friend of mine finds this LG totally unacceptable to watch.  Luckily, the family and I are not sensitive to this problem.* hooking your high end remote system that drives product though mono-mini 3.5mm cabling, requires a $100 conversion box by Audioplex (RC-LGI).  This is not available through Amazon.  It tends to be used by home theater integrators, and is priced accordingly  I have purchased one because I have a  Universal MRF-350 RF Base Station base unit driving my HT.  The first Audioplex arrived non-functional.  It was sent back to them, but it has not arrived back. If you plug a mono mini 3.5mm cable between any IR distribution box, it will not work.  AND, by inserting a cable in the back, it disables the front IR pickup (nice feature?!).* you will need to purchase 90º turn cabling for the back if you want to keep the screen as flush as possible on the wall, it does look nice that way.  The above Peerless mount will allow enough space against the wall, but just barely enough if using the 90º turn hardware.  Here is a list of some of the products I purchased to achieve the required clearance in the back:Gold Plated, Red Hdmi Male to Hdmi Female Right Angle 90 Degree Angle Adapter RedRight Angle Gold RCA Adapter Female to Male 10 PackSyba SD-HMM-HMF-L 90-degree L-Shape HDMI (19-pin) Male to HDMI (19-pin) Female ConnectorGold F Right Angle Adapter* once you want to see the best bright color, you will be turning off the power saving mode, meaning that you will be burning over 400 watts in bright scenes.POSITIVES:* the color is what is expected, remember to look up in the product discussion boards around the internet for custom screen control settings and you will have a videophile experience if you are not as sensitive to the flashing issues as others are.  Search for both LG 60PV250 AND 60PV450 settings, they are basically the same.*  it is a very thin looking television. For me it is flush enough, since I am not willing to spend $2000 more to get it a few inches closer to the wall.* you can save half the energy by using the power saver modes.  I just choose to see the television at full brightness.  It will be a long time before the power consumption  would have made up for the difference in price that a simular quality image LED screen would have cost, if ever.* no frills, no 3D.  I do not want a handicapped SMART TV on my wall.  I use a computer as a HTPC, Apple Mac Mini MC936LL/A with Lion Server (NEWEST VERSION).  So I have better control of internet streaming and browsing and recording of HD content using SiliconDust HDHomeRun Dual High Definition Digital Television HDHR3-US (Black).  Having three of the these SiliconDust tuners allows me to record six HD streams at the same time, very reliably using EyeTV software that you get by buying one of the tuners with the Mac SW included Elgato HDHomeRun Network Dual Tuner for HDTV for Mac or PC (10023030).  No need to buy three of the Elgato versions at a premium, just need one copy of the software.  I haven't needed more than three tuners ever at the same time.This is one beautiful plasma.  No more crap added into the tv than I wanted, just a quality image.  This may not be a KURO or a gigantic 3D machine, but then again, this will not break the bank either.  And I see it playing nice with my very good quality AV equipment, some of which is very old.  I am expecting to have the screen working well with my remote system soon, but I knew that that would be a project in itself to get it to coordinate.  This is good enough of a screen that I might have considered paying much more for it, even full Amazon price.UPDATE Dec. 16, 2012:  The family is still extremely happy with the LG plasma.  And I mean extremely.  I have also thinned out my collection of A/V inputs a great deal, including controlling multiple room sound. By doing that, I converted to a Logitech Harmony Touch remote control Logitech Harmony Touch Universal Remote with Color Touchscreen - Black (915-000198) using just infrared control.  It's not guaranteed to communicate to the system every time because it needs line of sight, but it is so much more simpler to program.  I may not have the computer and other items behind AV doors (nice and spouse friendly), but the minimal stack of items is much more spouse friendly in ease of quickly making changes to the remote and less complication for everything.  I have a lengthy review of the Touch which includes a note that the LG 60PV450 controls work better than the 60PV250.  As far as what is essential AV components, I include the following; Mac Mini, Squeezebox, turntable and receiver.  I still have to have a headphone amplifier connected to allow listening when others need quiet.  Lucky those who have large enough spaces!", "Date": "April 6, 2012"}, {"Title": "Not a review, just info you might want.", "Author": "G. Fadie", "ReviewID": "R20573VDI89LCO", "Overall": "4.0", "Content": "If you've come across this at a big box store or here on Amazon and are doing research, you may find that information on this TV is pretty hard to find. Even the LG website doesn't acknowledge its existance. So it must be something they make specifically for big box stores and don't want to bother dealing with themselves. That doesn't give me a warm and fuzzy when I think about how their customer service on this unit might be. But then again, who needs customer service on a TV? And if it's deffective, one big box store includes a 2 year warranty. Anywho, the reason I am writing this is to help you find the owner's manual so that you can get a real look at the specs. It turns out that the owner's manual for the 60PV450 covers this model too. So if you go to LG's web site, and either search for or navigate to the 60PV450, you can click on the product support page and find the owner's manual there. I hope this helps.Oh yeah, this model does not support any of the new \"Smart TV\" features like streaming Internet content or surfing the web. There is no wired Ethernet or wireless (WiFi) connectivity. But what do you expect at this price? Besides, most blu-ray players do that anyway.", "Date": "February 1, 2012"}, {"Title": "Really nice TV", "Author": "Steve Jarnigan", "ReviewID": "R12L3LB5V9ATHD", "Overall": "4.0", "Content": "I have had this TV since September '11 and I must say it is a really nice product.  The one thing that kind of concerned me was the lack of information online about it.  It was hard to find any reviews on it and even LG's website doesn't list it so I wondered was this an older model they weren't too interested in promoting or what? Even the owners manual is on a cd that comes with the TV which can viewed as a PDF file when you put the cd in a computer.Overall it's a good product that comes with plenty of ports (HDMI/DVI 1 and 2 RGB IN (VGA) Component 1 and 2AV IN 1 (Composite plus Audio L&R;), Optical Digital Audio Out, Audio IN (RGB/DVI) 3.5mm, Remote Control IN 3.5mmSide (points to side, but usable for back):HDMI/DVI 3, and AV IN 2 (Composite plus Audio L&R;), but I have a couple of issues (not dealbreakers and certainly not enough to cause me to dislike it).  One is the picture quality.  Let me start by saying that I don't mean picture quality as in the images on the screen washing out in light, but I mean that every so often the screen will dim a bit.  I prefer watching the tv at a brighter setting and for me I've found that the brightest setting is \"Cinema.\"  Despite this, every so often the screen will go dim.  Its most noticeable if you happen to pause a program (even for a couple of seconds), but once you restart it, it brightens up a bit.  This happens despite, my having the energy saver setting off at times.  Another issue in that regard is despite the brightest setting, it doesn't seem to get as bright as other brand TVs.  My other issue is the sound.  While it's good, it's not what I expected in a TV this size.  If you're going to use this, ensure that you have a surround sound system of good quality.If you can work around these minor issues, it's a really good tv to consider purchasing.", "Date": "April 20, 2012"}, {"Title": "LG 60INCH PLASMA TV", "Author": "G. Cordova \"Mike Cordova\"", "ReviewID": "RHFJIK6P5AS6L", "Overall": "5.0", "Content": "I bought this TV in December 2011, i have now owned it for about four months now. This is the best TV  i have ever owned, i have Comcast cable hooked up to it, a Play Station 2 & 3, a 1000 watt home theater system, and a blue ray dvd player all hooked up threw HDMI cables or RCA cables. The TV has awesome picture quality, the colors are crisp, bright and clear. The sound on the TV is great and even better with a home theater system hooked up to it, and the TV is also slim. It's has full HD 1080p resolution and with your media device hooked up with HDMI cables it makes for one awesome viewing experience.Pros.1. 3 HDMI Ports to hook up all your devices2. 2 RCA inputs3. VGA port4. Great Sound5. Great picture qualityCons1. No WiFi", "Date": "March 7, 2012"}, {"Title": "Size isn't the only thing that matters", "Author": "Tony L.", "ReviewID": "R2FPR58V1DHQNQ", "Overall": "4.0", "Content": "I purchased this TV a little more than a year ago for $800, which at the time was a steal. Unfortunately, this TV isn't without its drawbacks. While it touts a 3,000,000:1 contrast ratio, it isn't adequate in real-world use. Even with the contrast turned all the way up, you're often stuck between turning up the brightness to the point where colors start to wash out, or turning it so low that you start losing detail. This is the most pronounced in scenes shot at night where you want to see the screen look dark without sacrificing detail.Secondly, the speakers on this set lack any depth. Turn the volume up, and the quality suffers. I ended up purchasing a sound bar to accompany this set, and while I'm happy with it now, it's an additional cost I didn't factor in when making this purchase.And lastly, the color on this set isn't accurate. Fortunately, there are properly calibrated settings available online that take the guesswork out of color correcting. The set I applied brought the colors much more in line with what I would expect with a high-end monitor.The moral here is that even if you find a great deal on a TV set online from a well-known brand, be prepared to deal with sub-par image quality and to shell out a few extra bucks for an external speaker solution. Even if it is a glorious 60 inches.", "Date": "November 26, 2013"}, {"Title": "Good value", "Author": "D. Cheung", "ReviewID": "R35EXELP3R8PH5", "Overall": "4.0", "Content": "I bought this TV on Dec 2011 from another site for .  The picture quality is great.  The only problem is the glare, but I guess that's a problem for most plasma.", "Date": "June 17, 2013"}, {"Title": "Great picture", "Author": "Linda", "ReviewID": "R12NERK8XMK3V0", "Overall": "5.0", "Content": "Purchased this tv from another company. But felt I should write a review. Have  had the tv for three weeks and the picture is awesome. Easy to hook up and the sound is great. Replaced a Samsung 50 inch that only lasted 4 years. This LG way better with sound and picture quality.", "Date": "December 3, 2012"}, {"Title": "LG 60PV250 Plasma", "Author": "Lancaster54", "ReviewID": "R3TWRYQ7HP5NOG", "Overall": "5.0", "Content": "I bought this TV Dec 31st 2011- So I've had it almost a year now. This is an awesome TV, the picture is fabulous and the sound is wonderful. The blacks are truly black. I've not had any problems and no complaints.", "Date": "October 12, 2012"}, {"Title": "LG 60 IN PLASMA REVIEW", "Author": "118079839", "ReviewID": "RQTORPDVE5H2Q", "Overall": "5.0", "Content": "i love this LG plasma tv it has beautiful colors as compared to Sony LCD I bought about 8 months ago  I would highly recomned to any one who is looking ofr great plasma tv to get Lg brand they are much better compared to other brands  and they are better in price  I could have not gotten a better prise as I got on amazoni am very pleased amd 3 of my family members have bought this alsoSam Q", "Date": "April 4, 2012"}, {"Title": "Good tv", "Author": "TRON", "ReviewID": "R1X80K8JXOCNQ0", "Overall": "5.0", "Content": "It was good it has 2 usbs on the back i know alot of people do not know if it has the usbs but it does. It is a beautiful tv and the frame rate is very good. Shipping takes about a week so if you order and are sitting around it takes a while. Its only 98 pounds really light for such a big plasma.", "Date": "March 21, 2012"}, {"Title": "Nice Picture", "Author": "Tom43876", "ReviewID": "R2FKN0Z9G8SHSL", "Overall": "5.0", "Content": "This has a great picture. As always TigerDirect and Amazon deliver! Packaging was good. It included both hard copies and soft copies of the manual.I have cable, Roku, DVD players and PC all connected as well as some components that run through an audio/video mixer. All work fine. Set up was easy (used a great wall mount from CheetahMounts that extends out to allow for easy connections).", "Date": "March 16, 2012"}, {"Title": "great tv", "Author": "ptothemike", "ReviewID": "R2SK46C82OO6ZL", "Overall": "5.0", "Content": "this tv is super great i have had it for over a year and no problems!!! the picture blows away my LED model in my bedroom the colors and contrast are beautiful!!! LG did a great job with this one and the price is the best part!!!", "Date": "March 4, 2012"}, {"Title": "Great quality for what you pay", "Author": "Hotline1622", "ReviewID": "R3KYOHCCBPWZ4", "Overall": "4.0", "Content": "I use to dislike this tv. The picture was blurry but after hooking it up to comcasts HDreceiver with HDMI the picture looks life like! It only looks good when you have it connected to full HD, that's something to keep in mind.I have a problem with the picture sometimes flickering color. What I mean by that is if its zoomed out on a picture and its a blue sky, sometimes the blue sky will go from blue to light blue. Like the brightness is adjusting itself. I returned my first one because I thought it was a defect but obviously all do it. It's not really noticeable but I'm a perfectionist so I notice it.The sound is great. No complaints in that area.It's very light for its size! Extremely slim. The price is extremely decent for what you're getting.Overall I would repurchase due to the quality you're receiving at such an amazing price.", "Date": "December 5, 2012"}, {"Title": "Beautiful Home Theater!", "Author": "RichMalePup", "ReviewID": "R1NKBVKJ94JFOC", "Overall": "5.0", "Content": "Product arrived in perfect condition.  Took less than 20 minutes to have everything set up and operational.  Combined with Verizon FiOS, the picture quality is amazing, and the sound is surprisingly good as well -- with my last TV, I had external speakers hooked up that are now being put to use elsewhere in the house.  I'm especially enjoying the Olympics in HD, and looking forward to the football season.  Everything I expected, at an amazingly affordable price.", "Date": "August 7, 2012"}, {"Title": "LG Plasma Tv", "Author": "Gorgeous25", "ReviewID": "R2SM8C9AXR682J", "Overall": "2.0", "Content": "PURCHASED THIS TV ABOUT TWO WEEKS AGO, I DONT KNOW IF IT'S JUST ME BUT I AM NOT HAPPY AT ALL WITH THE PICTURE. IT IS BLURRY & THE SOUND SUCKS! WELL I GUESS YOU GET WHAT YOU PAY FOR. I WILL BE RETURNING THIS TV BECAUSE I'M VERY DISAPPOINTED!. PLEASE DONT WASTE YOUR MONEY ON THIS STUPID TV BECAUSE IT IS GARBAGE!!", "Date": "March 7, 2012"}], "ProductInfo": {"Price": "$1,599.99", "Features": "TruSlim Frame\n600Hz Max Sub Field Driving\nFull HD 1080p Resolution\nPicture Wizard II\nIntelligent Sensor", "Name": "LG 60PV250 60-Inch 1080p TruSlim Frame Plasma TV (2011 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/51T-7xFAnwL._SY300_.jpg", "ProductID": "B006BFRXS0"}}