{"Reviews": [{"Title": "Great Picture after Calibration", "Author": "Tanveer Chaudry", "ReviewID": "R14PX1033ASBMH", "Overall": "5.0", "Content": "Purchased this TV through amazon because of the price.  I could not afford an LED this size so I went with the Plasma.  The Plasma is not as bright as LED but bright enough for my needs.  I am not disappointed with my choice.  I calibrated using these setting I got from a friend for a different LG Plasma. I tweaked it to satisfy my eyes.  You may need to do the same but I think these settings are a good starting point.  Don't forget to make sure your cable box is properly set for HD viewing.  Enjoy.Settings used:Aspect Ratio: Just ScanEnergy Saving: OffPicture Mode: Expert 1Contrast: 90Brightness:60H. Sharp: 30V. Sharp: 35Color: 48Tint: 0Now select Expert controlDynamic Contrast: OffNoise Reduction: OffGamma: MediumBlack Level: LowFilm Mode: On or off (I didn't see a difference between the two while watching cable TV)Color Gamut: WideEdge Enhancement: OnColor Temp: MediumMethod: 20 Point IREPattern: OuterSelect an IRE value i.e. 0  now move down and change the color settings.  Go back up and select the next IRE value i.e. 5 then move down and change the color settings.  Do this for all the IRE values.  Yeah its a long and painful process but worth it. r=red g=green b=blue.0 ire r=-5 g=0 c=05 ire r=0 g=0 b=010 ire r=-16 g=0 b=-3615 ire r=0 g=0 b=020 ire r=-17 g=-13 b=-3425 ire r=-9 g=0 b=-3730 ire r=-6 g=9 b=-2935 ire r=0 g=0 b=-1340 ire r=9 g=17 b=-2545 ire r=0 g=0 b=050 ire r=-10 g=0 b=-4255 ire r=-18 g=0 b=-1060 ire r=15 g=20 b=-3765 ire r=-18 g=0 b=070 ire r=5 g=30 b=-3175 ire r=-9 g=9 b=-2980 ire r=-6 g=19 b=-5085 ire r=0 g=0 b=090 ire r=-8 g=16 b=-995 ire r=0 g=0 b=0100ire r=-5 g=0 b=-24Now go to the COLOR management:Red Saturation 0Red tint -1Green Saturation -6Green tint 0Blue Saturation -8Blue tint 0Yellow Saturation -5Yellow tint 11Cyan saturation -2Cyan tint -2Magenta Saturation -3Magenta tint -10Now run the Picture wizard and adjust each setting in the picture wizard to your liking.Hope you enjoy your TV with these settings :)", "Date": "April 26, 2012"}, {"Title": "Finally bit the bullet on a HDTV.", "Author": "mjaytee", "ReviewID": "R3CD0TKLKXWSPN", "Overall": "5.0", "Content": "Like others, when it comes to buying electronics, paralysis by analysis sets in.  My living room continued to have the good old dependable 27\" tube, but I have been lusting to replace it with a flat screen for some years now.  For whatever reasons, I never would pull the trigger.  Initially, I was sure that I would get a LCD when the time came, as the plasmas would always look dull and lifeless on display.  Along with the horror stories everywhere about 1st generation plasmas with the burn-in and such.However, over time I couldn't help but notice that plasmas were significantly cheaper than LCDs for the same features set.  So with price being the motivator, I sought to prove or disprove the myths of plasma TVs.  As expected, I found some LCD vs. Plasma flame wars amongst the fanboys.  But digging deeper, I found plenty of what seemed to be fairly non-partisan praises of plasma TVs.  That the problems of early plasmas were long gone.I visited a hhgregg and this model's picture was amongst the best on display.  I took note of the model number and price and set off to do some more \"paralysis/analysis\" research.  I soon found out that it was a 2012 release and there was very little information available.  However, the store's price was lower than the consensus price online even with the sales tax added (The price then, 3-9-12, was 10% lower than the price in hhgregg's 4-1-12 circular).  I checked on previous LG models and did not see any red flags, so I finally bit the bullet and got it.Set it up and was only mildly impressed with the picture, as it was somewhat dull.  Went to the picture set up menu and changed from the default \"energy saving\" mode to standard and voila the nice picture I was expecting.  I do not have HD cable but get HD over-the-air with the [...], again with a great picture.  This model says it has some kind of feature that adjusts the picture depending on the lighting in the room.  Well, I guess it works because the room this TV is in varies from dark to bright and the picture is always wonderful.  So far, everything is set to the factory settings except energy saving and I do not see any reason to change anything.  It might be that I do not have videophile credentials as I might not know \"black levels\" from a black bear, but to my eyes the picture is great.The remote and on screen menu are well laid out and intuitive.  I have yet to go to the manual to figure out anything.*********************************************************************11-6-2012I've just came back from visiting a friend that has a Samsung UN60ES7100 60-Inch 1080p 240Hz 3D Slim LED HDTV (Black).  While having more features and physically prettier, the picture on the LG is definitely better.  However, the source may have made a difference, his Dish vs. my DirecTv.  Also, I went through the long process of calibrating the TV according to the poster here.  I was skeptical of whether it would make a difference, but it actually made a great picture greater.", "Date": "April 2, 2012"}, {"Title": "GREAT TV for the price", "Author": "cliffhokie", "ReviewID": "R2HMDD4DBVD7F5", "Overall": "5.0", "Content": "I won't get into too many technophile level details, but what I will try to do is break it down based on what most normal purchasers would care about shopping in this price range.  First, before going into the review, I will say this, when you first buy this TV, it is very important that you turn off a from the factory preset.  The problem with this TV in store models is usually, the demo model keeps the store setting which is \"Energy Saver\" mode.  The tv has a light sensor on the top that adjusts the TV picture brightness based on the amount of light in the room.  The problem is, even when it is pitch black in the room, the setting makes the TV too dim, not giving you the true rich picture it can achieve.  TURN THIS SETTING OFF AS SOON AS YOU GET THE TV.  It is a garbage novelty setting not worth using.  If you want to tinker, choose one of the \"Expert\" tinker options.  Otherwise, just choose \"Standard\" picture, and 99% of people will enjoy the picture.  Also, bump up the brightness to 60% for most people.  But above and beyond all else, turn off the \"Energy Saver\" mode.Picture Quality / Clarity:  The picture is very nice for this price range.  It is truly 1080p HD quality that pops out with EXCELLENT frame rate (no motion blurs which is common with larger TVs and slow frame rates).  This makes watching sports great.  It is not the best I've seen, but pretty darn close.Color: The colors on this are very nice, extremely rich and vibrant, assuming you followed my directions to turn off the Energy Saver mode from above.  Even at Standard levels, HD movies will pop out to compare with much more expensive TV's.  I find that this tv will give you about 99% of the color/picture ability of a similar sized \"quality\" LED TV, especially on movies like Disney and Pixar films.  It falls short on more real life reproductions.Blacks / Whites: This is in a separate category because this is where LED's often excel.  The blacks can be adjusted on this TV to near pure black. This will get you about 90% of the black of an LED, and about 1000 times better than an LCD.  However, whites fall short vs a good LED.  You notice this on things like T-Mobile Commercials where most of the screen is bright white with a person in the middle in bright colors.  The white just doesn't seem pure. With an LED tv, this would be bright white.  Basically, the colors on this TV are brilliant, far superior to a 1080p LCD, but LEDs have just gotten better at producing these two spectrums.Sound:  The sound isn't great, but decent and about average for a thin flat panel.  If you are an audiophile, you will be disappointed.  Average customers might make due.  It isn't as bad as some TV's though, most thin flat panels have horrible sound.  You have to fit the speakers somewhere.Thinness:  This TV is thin.  Very thin.  Both the depth, and the bezel (front edge around screen).  The front bezel isn't as thin as the Samsung smart TV series, but probably in the top three TV's I saw on display for bezel size.  This is very nice and should be appreciated in a TV this size.  Additionally, the TV is very thin in thickness.  Also, the layered thickness means that when it hangs on the wall, it looks thinner than it is.  While there are thinner LEDs out there, you get 90% of the thinness for 50% of the price.  Honestly, for the price, you won't find thinner.Plasma pros vs cons:  I have had both LCD and Plasmas.  My old Plasma had some burn in issues, although never bad ones, and usually , they disappear.  The problem with this TV is, the picture is so huge, if you were to have burn in, it would be very noticeable (imagine a 10\" ESPN symbol everytime you turned your TV on).  However, so far, I haven't noticed any burn in.  The manual says it is fine with being on a still image for up to 1 hour.  So far, I believe them. Also, this TV has yet to get very hot,  unlike my older Plasma.  Honestly, most people assume the TV is an LED based on how bright the colors are and how thin the TV is.  I haven't noticed any of the cons of old of Plasmas except that LEDs are marginally better in black/white reproductions as mentioned above.  If you are coming from an LCD, however, this TV will blow your mind away.Energy use:  This TV will not get as good power ratings as an LED even though it advertises it will, because in order to get competitive pictures with an LED, you must turn off the \"Energy Saver\" mode.  However, it still does better than older TVs.  LEDs can just make brighter pictures with less power.  But, you will never experience the price savings of energy consumption that you save in overall price of the TV, I promise you.  This TV advertises EPA rating of $21/yr operating costs while most LED's in this price range is about $18/yr.  With the Energy Saver off, I'm guessing $35/yr based on percentage increase the brightness bar went up, but again, this is a pure guestimate. Either way, even if it was $50/yr, it would take you over a decade to make up the difference with a similarly sized LED.Price:  Bottom line, you can't beat the picture quality of this TV and the size, thickness, etc. when compared to what you pay.  I got this TV on sale at BJ's for $600.  Yes, you read that right.  The next closest LED with similar picture, thickness, and screen size was about $1200.  I did find an LED from a lesser brand for only $800, but it was 46\" and MUCH thicker.  If you aren't a technophile, then buy this TV, it is money well spent.*Update 1/7/14:  TV still going strong, LOVE this TV.  I have seen leftover stock at BJ's and Sears for $550.  Buy it, still a great price.  Loved this TV so much, I got the same exact model in 720p for a room that didn't need HD, and it still looks amazing!!!! That went for $450.  Either way, if you can find this TV, get it.  Samsung has a similar one for similar price, but slightly thicker.  Most stores are getting rid of this TV altogether as they move away from Plasma, so good luck if you can find it.  However, this far into the future, $700 is nolonger worth it as Amazon is pricing it since there are affordable namebrand LED's now for that range.  However, if you can find it at $550 like I see occasionally, GET IT!!!", "Date": "May 30, 2012"}, {"Title": "Great picture Nice Price", "Author": "Tony E Davis", "ReviewID": "RLAG95J3RS4ZS", "Overall": "5.0", "Content": "I am very happy with the picture quality. Clean crisp picture, and average sound. Our family watches a lot of the \"Family\" movies, Disney and the like. The Color just pops out at you. It is clear enough, even in high speed video that you feel like you are there. Some of the movies we watched before was a different movie with this TV. \"Tangled\" for instance was a bit more exciting because of the effect of the height of the tower in this screen, as was the roller coaster scene in \"Despicable Me\".I wanted a smart TV, but this one was within my budget. I had planned to purchase a sound bar so I figured I would try to save some money on the features on the TV. I was looking for the sound bars when I found the LG LHB336 1100W 3D Blu-ray Home Theater System with Smart TV. It was on sale at the Military PX for a little over $300. It provided the sound, and the Smart TV function, as well as a Blu-ray player. It it matched with the TV and provides excellent sound. It is so integrated that either remote handles the whole system. Aditional HDMI's allowed me to clean up some of the piles of wires.I have to say that it was a great find. I had planned to purchase from Amazon, but hhGregg had it for about $200 less, and they are local so I just drove home with it.", "Date": "March 12, 2012"}, {"Title": "BEAUTIFUL TV!", "Author": "Joshua Martin", "ReviewID": "R2OTYKN5FVQKKI", "Overall": "5.0", "Content": "Just set this TV up last night. I always get so anxious about buying electronics, especially after reading reviews, most of which are upset customers. I have to say, I couldn't be happier and more relieved at this TV!Setup was super easy, instructions were clear, and everything was included that I needed. Great blacks, color, clarity, and plenty of color customization options. No digital artifacts or motion-blur and no common plasma-myths at all: low glare which I was surprised about, no odd noises, no signs of any burn-in. As with all flat panels, the sound could be richer, but I've heard much worse on other panels. No problems to report and hope it stays that way!", "Date": "March 29, 2012"}, {"Title": "GREAT 60\" PLASMA AT AN UNBELIEVABLY NICE PRICE", "Author": "Marty Wekser", "ReviewID": "R1VV1VZZQRN3S7", "Overall": "5.0", "Content": "I watch TV a lot for business and pleasure and need a very high quality display. After switching from a Sony XBR5 LCD (nice picture, horrible black levels), I decided to go plasma. I wanted the best display possible without 3D or Internet connectivity. These features were not, for me, worth paying extra just to have.I decided to try an LG but felt I needed to see this TV \"in person.\" So I drove over to a local retailer to have a look at one. It really looked great so I decided to purchase the LG 60PA6500 and I am very happy that I did.The LG plasma product line has only one display that is better. It is THX certified, has all the \"bells and whistles\", but sells for considerably more. The LG 60PA6500 has the second best engine of the newer models and is exactly the same as the model one step above that is Smart and 3D. If you need Smart and 3D, there is a 60PM6700 that should suit your needs or the top of the line 60PM6900.This LG is selling this week at $1,099 at Amazon and at most other brick-and-mortar stores and online outlets. Price was not an object for me. I would have paid $2,000 if I felt I needed to. But this plasma really does it for me without any reservations.Out of the box, this set is spectacular. No oversaturation. All colors look very accurate and I am very fussy about video. DirecTV and Blu-Ray all run directly into a Pioneer Elite and then output to the LG with an HDMI cable. Although I don't watch anything in SD, it does up-convert nicely. My home theatre system uses, in addition to the Pioneer Elite receiver, Mirage Omnisats (towers, rear surrounds and sub-woofer) and a Panasonic Blu-Ray player. So I didn't even bother to check the built-in speakers. I'm sure they are better than adequate.In conclusion, this display looks as good as the Samsung plasmas that sell for double the price of this LG and to my eye is better and truer than any of the Panasonic and Sharp displays I've seen locally in stores. I find the brightness level to be fine, excellent black levels, exemplary picture contrast during nighttime and dark scenes and of course a superior refresh rate that makes sports viewing a real treat (go Lakers!) plus a nice on-screen menu and equally friendly remote. There is a tiny bit of glare during the day; not so at night when I do 95% of my viewing. But the slight glare is manageable. A small sacrifice for such a wonderful plasma product.", "Date": "June 1, 2012"}, {"Title": "Enjoying this purchase!", "Author": "Beto \"I do lots of research\"", "ReviewID": "R18X9NVVG0EK8E", "Overall": "5.0", "Content": "After spending long hours researching and previewing HDTV's online and in stores, I decided that I was going to get a 50\" Plasma for my somewhat dark living room. With this purchase, I did something I never do on such a big purchase, I bought this TV without even seeing how it looks like or with out even having tested it. This product was so new when I purchased it, not one store had it in stock. I purchased this item mostly for the glowing reviews of this TV's predecessor I read here on Amazon. I ordered it on Amazon, and even though this item didn't ship for more than a week after I ordered it, and took like 10 days to get here, it didn't bother me though. The item came in the original box, which had a few dings, but the unit itself was untouched. I've had it for a week and a half now, and I am super pleased with the quality of the picture, and the overall look of the unit itself. The thin frame is pretty damn cool. I'm a do-it-yourself-er, so I installed the articulating wall mount unit myself (separate purchase), and all I needed was the help of my wife to lift up the TV and put in place (over a fireplace no less), so this speaks to the weight of the unit. My only concern was when I initially turned on the TV, the picture looked noticeably dark. After playing with the settings, I noticed that the 'green' setting is the default. I turned this off and the picture was bright and sharp! The remote is a bit clunky (no big deal), and the onscreen controls need a little getting used to. Other than that, I am super pleased.", "Date": "April 23, 2012"}, {"Title": "This is a GREAT tv!!!", "Author": "Gerald", "ReviewID": "R2SE3FMK9X7TEO", "Overall": "5.0", "Content": "OK I thought it was only fitting that I should take the time to give my review of this TV since I read the reviews of so many others before I made my purchase.First off let me say a big THANK YOU to all those that posted your review on this TV. They were all very helpful in my decision making process.I went and picked up my LG 60PA6500 Plasma TV from a local store on Thursday 6/7/12. Paid $999.00I set the TV on our new 60\" component stand and getting the TV from the box, to it being ready to set on our new TV stand was as simple as it gets. Three screws to put the stand together and four screws to mount the stand to the TV.TIP: when mounting the stand to the TV simply put the TV on the box that it came in - screen side down with a blanket on the box to prevent scratching the screen - and then just slide the stand into the TV. This way the TV is up off the ground enough to allow the stand to be put into place with out having to lift the TV into an awkward position. Therefore eliminating the possibility of cracking the screen. The stand is very sturdy and I love the swivel motion it has.Once the TV was into place and hooked up, all I can say is WOW!!!!!!! This is truly a beautiful display.The colors were breath taking and the images very sharp. This is all before I turned off the Energy saving modethat everyone has recommended to be done. I did that and yes it makes a big difference.I then went and took the time to input the IRE custom settings that are posted on this site and after doing so I just could not believe my eyes. The image on this TV now is the best that I had ever seen anywhere period.Trust me when I say it has an amazing, Amazing, AMAZING picture!I have read all the black level arguments on how LG is not up to par with the Panasonic's and the Samsung's but let me tell ya. I was able to go and see them all side by side at the local store where I bought mine and there is no way I could ever justify the huge price difference. The PA6500 is a top tier Plasma display in the LG line. It is not a 3D/Smart TV which makes it all the more appealing to me because I do all my internet streaming with my Panasonic blu ray player.The speakers are pretty good for a very thin TV but I do not use them because I have all my sound going into my Bose Surround. The thin bezel really makes this display look sleek and sexy when the TV is not on. It truly is a beautiful TV.Here are the components I have hooked up to my LG 60PA6500 Plasma TV.1) HD cable box via HDMI cable2) Panasonic DMP-BDT320 Blu Ray Player via HDMI cable3) From TV to my Bose Lifestyle 35 surround sound system via Optical cableMy only regret is that I waited so long to upgrade from my 55\" rear projection TV.I highly recommend the PA6500 Plasma TV by LG. I give it 5 stars.....-----------------Update on 6/21/12Here are some SIMPLE settings that I'm pretty happy with so far:Aspect Ratio: Just ScanEnergy Saving: OffPicture Mode: Expert 1 or 2Contrast: 84Brightness:48H. Sharp: 24V. Sharp: 24Color: 50Tint: 0Expert controlDynamic Contrast: OffNoise Reduction: OffGamma: MediumBlack Level: LowColor Gamut: StandardEdge Enhancement: OffColor Temp: MediumMethod: 2 PointPattern: OuterPoints: HighRed: 14Green: -12Blue: -10NO COLOR MANAGEMENTEverything should be \"0\"", "Date": "June 9, 2012"}, {"Title": "Gorgeous Picture, Thin Frame, Right Price", "Author": "kev", "ReviewID": "R23ZX3G1JKVXM2", "Overall": "5.0", "Content": "After spending some time reading reviews and comparing prices, I decided to order the 60\" version of this TV for a few reasons. I went off of the 4 1/2 star average rating for the prior model of this TV, and although this version was just released, I figured it's newly thinned-down frame would be a nice addition to an already clearly well-loved product from LG. Plasma has improved a lot in the last 3 years, and provides a better picture than LCD panels, in my opinion. Also, the price from Amazon was fantastic.I am VERY happy with this TV and I highly recommend it. After a short warm-up period, the color and picture are nearly flawless. In a dark room, the blacks are quite pure. The sound is actually impressive for a set this thin, and I am not rushing to buy external speakers yet (although considering it). I haven't mounted it on the wall yet, but it looks nice on the stand. There is only HDMI and optical audio out, so don't plan on using standard RCA connection for your HDTV, which won't give you the optimal sound you're looking for anyway.Unfortunately, my experience with receiving the SHIPMENT of this TV was less than favorable. Amazon uses Pilot and CEVA Logistics freight services for shipping TVs. They basically give you a 5-hour window of when they will be coming, and supposedly will call 30 minutes before showing up. While Pilot did call me the first time, upon unpacking the box it was obvious that the screen was cracked in 3 places, so I immediately refused shipment and had them pack it up to be returned. I hopped online to file a complaint with Amazon, and they told me within 12 hours that I'd be getting a replacement shipped out. OK, good, I figured this could happen, it's part of buying a TV online. The second TV was shipped via CEVA, and the delivery men claimed they had already come by my house earlier in the day and called me, but I wasn't answering my phone. They were very rude and acted like I was keeping them at work (despite the fact that I did not receive any call, and it was only 4 pm). They moved the TV around 3 times before figuring out how to put it on the stand. I was horrified! Thankfully it was in flawless condition despite the man-handling, and all is good...except that I received an email from Amazon telling me I'd be charged for the first TV if I didn't return it, even though it had already been taken away by the delivery men! Thankfully a quick email cleared this up, but it wasn't exactly comforting knowing that Amazon might decide to charge me again for such an expensive item without checking. I will probably never again buy a TV online to save some money because frankly it's not worth the hassle, but at least I had Amazon's excellent customer service to back me up.", "Date": "April 24, 2012"}, {"Title": "Great TV good price", "Author": "rrickerd", "ReviewID": "R4VSPASZ4EXQQ", "Overall": "5.0", "Content": "The TV works great, auto adjusts for ambient light.  The TV was easy to install, easy to understand.  Hopefully it will be like all my other highly rated Consumer reports TV's and last longer than I need them.Sports is great as there is no blurring and all of the colors are bright.  I checked this TV out before buying and it is great compared to all of the TV's in the stores.", "Date": "April 15, 2012"}, {"Title": "60PA6500 is fantastic!", "Author": "Dean", "ReviewID": "R13G5A69LLML65", "Overall": "5.0", "Content": "I finally got it! The first TV came with a broken front glass :( Amazon sent a new one out immediately. I must say that it is the nicest picture i have seen thus far. I set my picture with the following settings and it looks fantastic!Standard..........userEnergy saving.....offContrast..........75Brightness........52Sharpness.........30Color.............46Tint..............R8Color Temp........C9Dynamic Contrast..LowNoise Reduction...MediumGamma.............MediumBlack Level.......LowFilm..............On..(Did not see any difference in picture from on to off)Color Gamut.......WideEdge Enhancer.....OnThese are not as extensive as other tweaks out there but I did tune according to those and (My Settings) made things like flesh tones and food look much more realistic IMO.I do realize that everybody has their own preference but just thought I would offer up a simple and quick picture setting to start with.I would recommend this TV to anybody looking for an affordable 60\"I have a big living room with 12' ceilings and it fills the space perfectly.I paid $928 for this through Amazon...what a steal of a deal!I do recommend you hook up a nice surround sound system to complement your viewing pleasure and DO NOT forget the HDMI cords... It will make all the difference in the world to your picture quality.", "Date": "October 6, 2012"}, {"Title": "Very Happy", "Author": "Scott Tomkins", "ReviewID": "R132ZCWD81KFNK", "Overall": "4.0", "Content": "I'm happy with this TV for the price.  It replaced a 9 year old Samsung 56\" DLP which had been perfect for me.  I've been messing with the settings on this for a few months now and am really pleased.  Everyone that comes over comments on how clear it is and they call me a liar when I tell them the price.  I've now recommended it to 3 different people that have bought the same TV.I originally saw this in the store next to the Samsung ST and was very pleased with this....thinking about buying the 50\" to place in our bedroom!", "Date": "June 21, 2012"}, {"Title": "Excellent TV", "Author": "BrianP", "ReviewID": "R2JNWJZHWCGGLU", "Overall": "4.0", "Content": "I researched EVERYTHING, Consumer Reports, CNET, etc. and finally decided to buy the LG 60PA6500 Plasma for 998.00.  There was an LG Rep at the store where I bought this TV.  I had already made my decision to buy BEFORE I got to the store, so the rep didn't phase me, although he was not pressuring me to buy.  He even talked about different features that other TV's have as well as LG.  This is my 2nd Plasma, but 1st LG.  I've had the TV about a month and it's terrific.  Perfect?  Of course not.  Since I have a PS3 hooked to this TV, I didn't need the \"smart\" TV features and 3D is NO reason to buy a TV, period.  Since the screen is glass(which all plasma's are) it is very heavy.  I mounted mine on a wall so I have no feedback on the TV stand.  The room lighting(including windows) where this TV will be placed is something to keep in mind.  My windows are on either side of the TV and my overhead light doesn't impact the picture quality at all.  On my TV, I hear no buzzing sound at all, and if my TV buzzed, I would know it.  Plasma's have the best viewing angles and deeper more true black colors.  Watching football is very nice, I get no blurriness for ANY of the action, running, throwing the ball, etc.  The only reason I didn't give 5 stars is it would be nice if my TV had an Ethernet port for software updates.  Hope this review helps.  I read so many reviews about so many TV's, I started to wonder if they were real.", "Date": "November 19, 2012"}, {"Title": "What a steal this TV is, amazing price for what you get!!!!!", "Author": "Rob D'Aquin", "ReviewID": "R1Y2X402R7AFW6", "Overall": "5.0", "Content": "I saw this TV at Best Buy for $999, and thought it looked WAY to dark and dingy, etc. The Samsung that was almost $2,000 looked amazing. I had read reviews on this LG and could not believe it was the same TV. I wanted to play with the setting but the salesman was reluctant, and was pushing the Samsung as the better TV, plus it was a \"smart\" tv, etc. I told him that I have a PS3 and have NO need for a smart TV, as the PS3 does everything I need it to.He reluctantly let me do a new setup on it, first thing I saw was that it was in store mode and energy saving mode. I used some of the settings that are posted here for the picture, and it looked BETTER than the Samsung. He did not look to happy. I then showed him the Amazon price of $800, and told him that I read that BB was matching Amazon prices now, to stay competitive. He said they were only doing this during the holidays, to which I said, \"OK, no problem\", and ordered it through Amazon in front of him on my iPhone. He did not look happy, and when I walked off, I actually saw them changing my settings back!!! Why would they do this to customers?! I ordered it on a Thursday evening and had it delivered into my house on Tuesday.I cannot speak to the sound as I have it hooked to my Denon AVR-2313CI Networking Home Theater Receiver with AirPlay and Powered Zone 2, with Energy EF-500 Floorstanding Loudspeakers - Pair (Black) as my front and the MartinLogan MLT-2 Home Theater System (Black) as my surround, so I have a full 7.1 system for under $1000, and it sounds amazing. I've heard Horror stories about the shipping of TV's from here, how the boxes are destroyed, screens cracked, etc. My box was pristine, and the guys who delivered it were cool. They took it out of the box, and tested it and everything. I immediately took down my 50 LG Plasma from 2 years ago. and put that in the bedroom. I used the bracket from that TV on the new 60 inch to hang it from the wall, and it is perfect. I also ordered the Cheetah Mounts APTMM2B Flat Screen TV Wall Mount Bracket for 32-65-Inch Plasma LED LCD TV which for the price came with a nice HDMI chord, so the bracket was free if you think about it, and it was VERY easy to install. I cannot get over how thin this TV is, and how much bigger the 60 is than the 50, it is almost TO big for my living room!I used 2 of the settings I found here on the first few posts that are listed as most helpful, and the second one is a little better, and takes way less time to program. The picture is amazing, has deep blacks and vibrant colors. I bet on \"black Friday\" they may be even cheaper. What a wonderful time we live in, technology is speeding ahead so fast. Won't be long before we are watching TV on a piece of glass hanging from the wall I bet.This panel has to be under 2 inches thick, it really is THIN. For $800 shipped what are you waiting for????", "Date": "November 15, 2012"}, {"Title": "So far, so good!", "Author": "VipersNest", "ReviewID": "R2KRYVTQOL740J", "Overall": "5.0", "Content": "Had this T.V. for a few days now. I'm actually quite impressed. The picture quality is great, the audio volume goes up to 100, so while people say the audio isn't the best, to be honest, at a higher set level it's as good as I think most people would need it to be without using external speakers. I use external speakers and surround sound, which for a few hundred bucks you can easily get a decent entry level set up. One thing to be cautious of is that there are no RCA \"In\" connects, so I can't use my older surround sound equipment for everything now (Netflix, I-Tunes for Apple T.V. etc.) Going to have to buy some digital sound sticks for that when I feel it's really necessary. Otherwise, I do get surround sound thru the cable box and DVD player, so I'm fine with that for now. This is a fantastic value at $750 all in in my opinion. Very light weight, easy to set up and great picture quality so far.Honestly, couldn't be happier with the cost vs value of this purchase.", "Date": "April 2, 2012"}, {"Title": "New LG 60\" plasma", "Author": "George P", "ReviewID": "R1XW4Z7TIT8X4T", "Overall": "5.0", "Content": "Just bought the LG 60PA6500 at HH Gregg.  I did a lot of research, back and forth between plasma and LED, as well as brands.  Finally narrowed it down to Samsung and LG in both plasma and LED.  Had my eye on the plasma initially due to the significant cost savings vs. LED.  ALMOST 50% less.  So, got to the showroom and the PA6500 happened to be displayed right next to an LED.  The LED was considerably brighter in the store, so I started to worry about my plasma choice.  So that was decision point one.  The rep told me other than the difference in the brightness, one other difference was that the LED was more prone to motion blur, giving the edge to the plasma.  I watch a lot of sports to this seemed to be a big issue.  So do I go for the brighter pic but maybe some motion blur, or settle for a \"darker\" picture?  Hmmmmm?  Then he starts in about the glare off the plasma, and how it can be distracting, throwing another wrench into the decision process.  So I just stood there for the longest time, suffering from a bout of decision paralysis.  Finally, I just told him to give me the plasma, not even sure why, I just took a chance - and it was the cheaper decision.  So, just finished setting it up and here is the deal:I absolutely made the right choice.  Setup was very quick and easy.  As soon as I turned on the TV I was greeted by an amazing picture.  The only changes I made were turning energy savings OFF, this is a must.  Then set the picture to standard.  Left all other settings as is.  I know there have been several post that have given detailed custom settings, and they may work, but quite honestly for me the picture I have with limiterd changes to the default is beautiful and perfect for me.  Now for the glare.  I have an average size family room, rectangular, with two sliding doors to the outside with no drapes.  I have the TV in a corner angled into the room in the same corner as the doors, so the outside light is not reflecting into the TV.  Set it up on a fairly bright but cloudy day and had absolutely no issue with glare or brightness of this picture.  Don't get me wrong, it's there, and you can see it if you really focus on it, but quite frankly I never notice it.  No issue at all.  One thing that will show up is if you have a table lamp on at night facing the TV, this can be noticeable.Now where the plasma kicks every other type's behind is in the evening, in a more darkened room.  Watching an HD movie in this environment  is spectacular.  The colors are unbelievable.  LED cant touch this type of picture.  I watch most of my TV in the evening anyhow, usually with the lights on low, so this is prime time watching for me.The one negative is the built in speakers. They are just average.  I have a Bose system so not an issue for me.  If you don't have a sound system invest in one, it is well worth it.So to sum up, there is no better tv out there you can get for the price (on sale at $890).  No complaints whatsoever about the plasma.  Absolutely love it.  Could not ask for a better picture. I recommend this unit highly.", "Date": "December 27, 2012"}, {"Title": "Great Color and Clarity", "Author": "TechTrekGeek \"TTG\"", "ReviewID": "RMYZCD2ZTPLJQ", "Overall": "4.0", "Content": "Excellent Plasma TV for the price. We have been enjoying it a lot. The only draw back is there is window glare, so we keep the drapes closed during the day.", "Date": "November 16, 2012"}, {"Title": "Beautiful picture", "Author": "Jon", "ReviewID": "R2NK2ADDFD7DMS", "Overall": "4.0", "Content": "An amazing TV. I was concerned about the burn in and glare that so much is talked about with plasma TVs, but neither have been a problem (although the TV is in a room without many windows).  The picture spectacular with colors that LCD just cant match.  Works great with my PS3 for streaming movies in HD.The only issue I had was the mounting brackets in the back had defective threads so the mounting bolts would not screw in.  LG service was very responsive and had the brackets replaced.I was concerned about buying this TV online and having it shipped. However, I was impressed by the service.  Two people arrived, set up the TV, verified it worked and was not damaged.", "Date": "October 22, 2012"}, {"Title": "This gorgeous tv is 60\" and 97 lbs of love!!!", "Author": "sxyrdhd28", "ReviewID": "RT5BGSGLBN0E9", "Overall": "5.0", "Content": "First off, I want to thank Amazon for being the stand up company that they are known for. I had purchased this LG tv for $1099.00 a week ago.  Upon receiving the tv, I noticed the price was now at $999.00 they immediatley did a price check and credited back the difference to my cc. and that's why I do most of my shopping via Amazon! Tada!Now on to the new 60\", 97 lbs of love. My story is much the same as many others, I did my weeks of research, my \"i\" dotting and \"t\" crossing and eventualy it came down to, as much as I LOVE the Samsung brand, the price was just not something I wanted to shell out for right now. I, then went with another brand we all know and love, LG! and I LOVE, LOVE, LOVE this tv! So easy to set up, super thin, and after following the calibration points from another reviewer on Amazon, the color is amazing!! Sound is fine too, but we have a surround sound system, so it's really not an issue.Overall, I'm giving it 5 shiny stars!!!", "Date": "August 6, 2012"}, {"Title": "Awesome TV for the price!", "Author": "CCB", "ReviewID": "R15EL8KPXNRNFU", "Overall": "5.0", "Content": "We purchased this TV as an extra for a guest bedroom in our house. We currently own 3 higher end Samsung's that I love, but I didn't want to spend that much on a television that will only get used occasionally. I read a lot of reviews and I was very pleased with what people had to say about this television. The features are plentyful for a television of this price range and everything works very well. I was so surprised with how clear the HD image is on this television that I am actually considering moving it from the guest room into our bedroom to replace a much higher priced television of the same size and comperable features. I have used many of LG's products in the past and I LOVE them, very high quality for the money! I am now considering buying another of the same LG televisions, swaping it out with one of our other more expensive televisions. Great buy for the money!", "Date": "July 18, 2012"}, {"Title": "Phenomenal Picture, Great Price", "Author": "Josh Sisson", "ReviewID": "R3B9KTMO6VDG5X", "Overall": "5.0", "Content": "Bought this slightly used from a vendor called NewOpenBox. It is in flawless condition. The picture is the best I've ever seen on a TV, especially after calibration. The contrast is superb. No motion blurring or anything of the sort.Has lots of inputs in the back so you can connect your computer and other various devices. I was able to connect my 1 TB hard drive to the USB port on the side and so far it has been able to read all of my movies flawlessly. One other neat feature to note is that the product ads say there are two component inputs, but what I didn't know until i bought it was that one of the component inputs can also be used as a composite input.If I had to complain about anything it would be the lack of an RCA audio output, which yes is older but I need that to get sound out of my older Bose cinemate system. Luckily I was able to find a solution by running a cable from the optical audio output to a $15 digital-analog converter and then on to my Bose system.I also wonder if ghosting (or image persistance) will be a problem with this TV as its a plasma and I use my computer on it, it has a lot of static content. But so far, no problems.", "Date": "June 27, 2012"}, {"Title": "Reflective during the day, awesome otherwise", "Author": "F. Melo \"FM\"", "ReviewID": "R1ERL91ZDA1TGN", "Overall": "5.0", "Content": "I read a lot before getting a new TV. I knew I wanted something +50 inches, not sure about LED or Plasma...I wasn't interested in 3D (I don't really like it) neither Smart TV features because I have a PS3 and a PC attached to my TV.Finally decided for this one, with a very good price for what you get. What people say about the reflectiveness of the screen is true, if you have light in the room, you will be able to see yourself in the dark areas of the screen, however, once you get your room a little darker (it doesn't have to be completely dark) the Picture is amazing. The reflectiveness doesn't get to the point where you can't watch TV if there's light in the room, but you'll definitely notice it.Don't expect anything about the sound. It has decent speakers but nothing outstanding.One last thing, the TV gets significantly hot (something normal in plasmas). Not sure it could warm up a room, but the heat behind the TV after a couple of hours can be higher than expected.In any case, I'd defintely recommend the TV, just be sure you don't have a problem with its characteristics!", "Date": "June 25, 2012"}, {"Title": "Very Happy With This Set", "Author": "wardo", "ReviewID": "R27AMZBZYXDR9K", "Overall": "5.0", "Content": "I upgraded from my 4yr old LG 42 inch LCD 720P TV (still going strong and looks great) to this set and I am very happy with the results. My criteria was set on 60 inch, 1080p, non smart (who needs an internet capable TV when you can connect a wireless Blu Ray player that streams movies to the TV?), non 3D... After doing some research, I decided to go with Plasma since it delivers significantly higher refresh rates... In addition, according to everything that I've read, if you are placing your television in a room where you can control ambient lighting, then plasma is the only way to go.Crisp, clear, picture with vivid colors and excellent contrast, 3 HDMI inputs, VGA, optical audio output, etc...I have mine mounted on the wall and even when it's not turned on, it looks spectacular... Thin textured metal bezel, ultra thin depth.Highly recommend.", "Date": "June 11, 2012"}, {"Title": "Fantastic Value for the Money", "Author": "wevsspot", "ReviewID": "RFZR87KJUERMN", "Overall": "5.0", "Content": "UPDATED INFO: I just wanted to share my post 100 hour calibration settings.  After 200 hours they will change slightly again (primarily contrast and brightness) as I'm still keeping contrast fairly low until I reach the 200 hour mark.  This is after much tweaking using the various tools noted in the LG 60PA6500 thread over at AVS Forums.FINAL UPDATE: 12/12/2012 after 200 hour calibration:Aspect Ratio: Just Scan / 16:9 / or even Set by Program - depends on sourceEnergy Saving: OffPicture Mode: Expert 1 or 2Contrast: 91Brightness: 51H. Sharp: 15V. Sharp: 15Color: 57Tint: 0Dynamic Contrast: OffNoise Reduction: OffGamma: HighBlack Level: LowColor Gamut: StandardEdge Enhancement: OffColor Temp: MediumMethod: 2 PointPattern: OuterPoints: HighRed: 14Green: -12Blue: -10No amount of tweaking using the \"Warm\" color temp setting yielded an overall picture I was happy with.  The warm setting may calibrate perfectly with a colorimeter and calibration tools, but it always looks \"too\" fleshy and tinted to my eyes.  Using the above settings I was able to get great whites (although still a little to the blue side), grayscale performance is awesome and almost zero banding.  These settings were also a nice compromise on getting life like flesh tones.ORIGINAL REVIEW:  Although I didn't buy the 60PA6500 from Amazon, I did purchase the same unit with a BB price match offer.  I spent a week here at Amazon and on other websites reading the reviews and feedback.  The new TV purchase was a necessity after my four year old Samsung Plasma bit the dust when three capacitors on the power board blew out.  As others have mentioned, the LG has possibly the worst picture quality when viewing the display and comparing it to others at your local BB or other TV merchant.  And par for the course, three different sales people tried to up-sell me on a Panasonic or Samsung, but after all my research, I was pretty set on what I intended to buy when I walked into the store.  I didn't need a Smart TV, and while 3D is cool I just didn't see us using the technology to any great extent.  We took the TV home around 9PM and I spent until around midnight calibrating colors and setting the advanced display options.  For the first 100 hours I'm keeping the contrast below 65 and brightness below 55 to allow for a proper burn-in.  But I can already tell that this plasma is going to have a beautiful picture.  Even with the power off, this is a pleasing unit to look at.  It won't win any awards for ground breaking aesthetics, but it should work well with about any decor.  The bezel is nice and thin, and you'll be impressed with the thin depth of the unit overall.  The stand is top notch in design, looks, functionality and it does swivel (kudos to LG for not skimping with the stand on an entry level TV).  The firmware on the unit I purchased from BB was outdated, so I downloaded the latest FW from LG and flashed that the next day.  Then re-entered my picture settings from the previous evening.  After 100 hours I'll re-calibrate again.  Honestly though, the color accuracy out of the box is pretty darned close if you set the TV to Standard mode, turn off most of the post processing options - and MOST IMPORTANTLY - make sure that energy savings is disabled.  I've found that Standard Mode and Expert Mode are both very close to perfect color wise.  Again, the most important thing is to disable the post processing features and energy savings.  After I get my 100 hour burn-in complete I'll come back and post my full settings.My best advice - DO NOT let the poor PQ in the store sway you from purchasing this TV.  I can't believe that LG doesn't insist that the merchants turn off the energy saving feature, at least for customer demo purposes.  This TV can be adjusted to picture quality levels that will rival units costing much, much more.Pros:PriceMenu Options for picture control and calibrationVery good color accuracy using standard or expert modes with little if any color tweaking requiredStand is EXCELLENT and swivelsDesign / Appearance3 HDMI inputsFirmware updates are painless - just download the firmware update, unzip the file to a USB stick, plug the stick into the USB port on the TV.  At that point the TV auto detects the USB stick and the firware update, written prompts are easy to follow.Cons:On my set there is some jitter when watching fast moving content from my HTPC.  This is a high end HTPC running a dual core Intel processor, 8Gb memory and HD5850 using a resolution of 1920x1080 @ 60Hz.  All video connections to players, cable box and HTPC are via HDMI cables.  It's worse on streaming content than if watching DVD or Bluray media.  There isn't an option to enable \"Film Mode\" when viewing @60Hz, and I couldn't find any other tweaks to help eliminate it.  With that being said, it would not affect my purchase decision one bit and I would buy the same set again.", "Date": "November 19, 2012"}, {"Title": "Very impressed!", "Author": "J. Talmadge \"electronic gringo\"", "ReviewID": "RO6AJSFY446Q1", "Overall": "5.0", "Content": "My old samsung 50 inch plasma tv had the power supply burn out twice (pathetic). That's almost $400 a fix. Instead of repairing it a second time I replaced it with a 1080p Epson projector. Blows up to 160 inches on the wall and looks awesome (especially basketball and football). I wanted to have a nice bedroom tv and there's a good distance from wall to wall (about 17 feet). I found that some people recommend a 50-60 inch for that distance. I picked up this 60 inch lg at frys which was my first time inside their store. I am amazed at the picture quality and price. The speakers are much better than the old Samsung. What I didn't know was that the USB on the side will read my 320 gb hard drive. It plays almost every file and the quality it outputs to the screen is amazing. My laptops did not play these files half as nice as the lg tv. I had no idea the quality of the files was so high. Try a Wmv file, its like watching blu ray. Seriously. The remote works great too. At the bottom you have the controls for the USB device you connect and it works flawlessly. Plays mp3s very well.On a side note- as decent as the internal speakers are I picked up a zvox speaker bar with optical in and could not believe how awesome blu ray movies and games sound. Highly recommended. I have only used this for movies and games but not television. I hesitated about getting another plasma as I hear they are repairshop", "Date": "September 7, 2012"}, {"Title": "Enjoying a great picture from this plasma tv", "Author": "Dean Berg \"dean\"", "ReviewID": "RIPRAYGRVMH31", "Overall": "5.0", "Content": "Have been watching this TV since January and must say for the price it afantastic TV.Colors are great,picture is bright and with the lights offthe picture gets even better.I tried adjusting picture with the settingsleft here and after viewing a movie went back to the vivid settings in theTV.My Wife also likes the vivid setting better.Sound is very good also.I am very pleased with this LG 60in Plasma TV.I would highly recomend it.", "Date": "May 26, 2012"}, {"Title": "Most tv for the money!", "Author": "Amazon Customer", "ReviewID": "R3CC2MB1I8UHV1", "Overall": "5.0", "Content": "I didn't realize how great plasma tv's are compared to LCD's until I got this bad boy home.  Here's a quick pro/con list:Pros:-Beautiful colors, deep blacks, and excellent contrast: It's as close to a true cinema display as possible. Don't judge this tv based on the way it looks in the store!-Superior fast motion:  There are no issues with motion on this display and, most importantly, it avoids the \"soap opera/video\" effect that many LCD's have.-Awesomely Huge!: I'm glad that I listened to others advice and got the biggest tv that I could afford.  This is by far the best price for such a great quality 60\" display.  Smart TV and 3D are vastly overrated, in my opinion, so this is a great option if you just want the most immersive tv for the money.-Nice Design Elements: It's very thin with an attractive stand that is quite minimalist.  The screen bezel is one of the smallest I've seen on a sub $2000 tv.  Plus, the remote and menus are simple and intuitive to understand.Con:-Glare: Definitely the one downside to plasma, and required a little rearrangement in my living room.  However, it's very manageable, and if you must watch in a bright room, use the vivid setting and intellegent brightness.To sum up, I couldn't be happier with this television, and have received many compliments from friends on its beautiful picture.  Highly recommended!", "Date": "June 20, 2012"}, {"Title": "Love.", "Author": "Pen Name", "ReviewID": "RDHRWCB86PREF", "Overall": "5.0", "Content": "As in. I'm in love with this tv. Of course I did my tv research before making this choice but, highly recommended! Great picture and sound quality! Light and slim. I've always had good experiences with lg products!", "Date": "April 15, 2012"}, {"Title": "Overall we are happy.", "Author": "Sparky", "ReviewID": "RL43VRXE3OZGU", "Overall": "5.0", "Content": "I got the 60 inch version.  I like the price per square inch that plasma offers over LED/LCD.  Here are my thoughts after the first 3 days:Pros:* Crystal clear picture.  All of the awesomeness that we know plasma has.* Great sound.  I am no audiophile, but I am content with the speakers on the TV.  I will not be getting surround sound.* Very thin display.  Until I saw this TV I did not know plasmas were that thin.* Two (2) HDMI ports and one (1) USB port on the side of the tv.  Perfect for if it's wall mounted.* Base seems quite sturdy, but with enough force I could see it falling over.* Much better black color than the HD LCD it is replacing.Cons:* Any glare in the room will be seen on the screen.  This is a known con for plasmas.  However, nighttime TV with the lights out is almost a cinema experience.  The wife said \"It's like being at the movies\" the first night we watched it.* It gives off heat from the screen.  Not crazy heat, but when I walk by I can tell it's putting out the BTUs.* Comes with the size, but it defianately takes two peeps to safely maneuver the tv from the packaging to it's stand or wall mount.A big Con for me was the shipping.  The thrid party vendor, Some Audio and Video Store in California, had it freight shipped.  The driver said he was \"not allowed\" to do anything more than drop it at my door.  Plan ahead for this if it's shipped this way, as one person may not be able to get it off the front stoop.Another con for me was Amazon not providing price protection on TVs from third party vendors.  So, when I read that Amazon has price protection for 30 days after delivery for TVs, the fine print says it does not extend this to third party TV sales.  So, I bought with confidence, and saw an even deeper price drop before it showed up at my door.  No soup for me.  Boo!", "Date": "August 1, 2012"}, {"Title": "Great Picture After Adjusting Setting", "Author": "B. Hemsath", "ReviewID": "R2FNPCS0OWEYYV", "Overall": "5.0", "Content": "Hello Everyone,I wanted to give this TV a fair shake. For the price, and going through all the settings the picture came out great for a 1000 dollar TV.I will list the settings I used below.So the picture is a great plasma picture for a lower end TV. LG has really stepped up with this PA6500 2012 model. I normally hate LG but  I was rather impressed and got a great deal on the TV. Grant it, this is not a Samsung 7000 series, or a Panasonic ST series.One thing i did do that helped improved the picture was upgrade to the Panasonic DMP-BDT220. Also you need to set in the picture for a bit with a good movie. I tend to like a bit gray-blue tones so I used Avatar to set in colors.Now if I adjust the sharpness and motion blur i used the beginning scene of the dark knight since it is shot in IMAX.Items you should know. It does reflect so have the back facing windows. And for awesome movie experience, you need black out conditions.I love Plasma's and have been using them for about 6 Years now.OverallBy Far, I think the pioneer Elites are thee best in Plasma and but they are about 4k-6k. For medium range that cost between 1500-2500 I think Panasonic and Samsung 8000 series Plasma's are great and for lower end I think the LG PA6500 and Samsung E550's are great.In any case, thanks for read and here are the settings I'd recommend using for the TV.Side note... do the settings in blackout conditions or whenever the time of day you would like to watch the TV the most.Settings used:Aspect Ratio: 16:9Energy Saving: OffPicture Mode: Expert 1Contrast: 90Brightness:60H. Sharp: 30V. Sharp: 35Color: 48Tint: 0Now select Expert controlDynamic Contrast: OffNoise Reduction: OffGamma: MediumBlack Level: LowFilm Mode: On or off (I didn't see a difference between the two while watching cable TV)Color Gamut: WideEdge Enhancement: OnColor Temp: MediumMethod: 20 Point IREPattern: OuterSelect an IRE value i.e. 0 now move down and change the color settings. Go back up and select the next IRE value i.e. 5 then move down and change the color settings. Do this for all the IRE values. Yeah its a long and painful process but worth it.r=red g=green b=blue.0 ire r=-5 g=0 c=05 ire r=0 g=0 b=010 ire r=-16 g=0 b=-3615 ire r=0 g=0 b=020 ire r=-17 g=-13 b=-3425 ire r=-9 g=0 b=-3730 ire r=-6 g=9 b=-2935 ire r=0 g=0 b=-1340 ire r=9 g=17 b=-2545 ire r=0 g=0 b=050 ire r=-10 g=0 b=-4255 ire r=-18 g=0 b=-1060 ire r=15 g=20 b=-3765 ire r=-18 g=0 b=070 ire r=5 g=30 b=-3175 ire r=-9 g=9 b=-2980 ire r=-6 g=19 b=-5085 ire r=0 g=0 b=090 ire r=-8 g=16 b=-995 ire r=0 g=0 b=0100ire r=-5 g=0 b=-24Now go to the COLOR management:Red Saturation 0Red tint -1Green Saturation -6Green tint 0Blue Saturation -8Blue tint 0Yellow Saturation -5Yellow tint 11Cyan saturation -2Cyan tint -2Magenta Saturation -3Magenta tint -10Now run the Picture wizard and adjust each setting in the picture wizard to your liking.Thank YouBen H", "Date": "December 24, 2012"}, {"Title": "We are very pleased with the purchase.", "Author": "Sylvain Bromberger", "ReviewID": "R6RBOJPUQKIVG", "Overall": "4.0", "Content": "This is our first HD TV, so we have no basis of comparison, but it is living up to expectations. We picked plasma because the set had to be viewed from various angles, and it does that well. We were concerned by reports about reflection on the screen, but that is no problem, even when our windows are uncovered. Bright standing lights do reflect but they are easily turned off when we watch. The instruction on how to make adjustments could be clearer, particularly what is done under \"Menu\" and what is done under \"Settings\", but it can all be figure out in the end. The support is excellent.", "Date": "November 2, 2012"}, {"Title": "Awesome TV for awesome price", "Author": "J. Tseng", "ReviewID": "R3OQNW0UTAGPRW", "Overall": "5.0", "Content": "2012 model!  got the last one from fry's during their anniversary sale for 500.  upgraded from a 32\" lcd.ok, PROS:screen is beautiful, colorful, no-blurs (expected for plasma), thin layered.3 hdmi in's among othersusb port (played avi's just fine, i'm anticipating it'll read any format, maybe mkv's too?)idle power consumption 0.2Wpower saver settings.CONS:the stand was a little tricky to figure out.the speakers are the worst part of the tv; if the volume is high enough it distorts sounds and speakers vibrate.2nd worst part:  the glare!  even the slightest light in the room can screw up viewing.the toslink cable has some kind of noise when you hook up to external speakers.web search indicates max power consumption is 320W.", "Date": "July 12, 2012"}, {"Title": "It's more than worth the price", "Author": "SuperGayWizard", "ReviewID": "R35Y5YY39OA6NX", "Overall": "5.0", "Content": "Like many reviewers here, I bought this TV: a) because I don't need 3d or internet connectivity, b) positive reviews and, of course, c) the price. And while my experience with Pilot Freight Services was less than ideal, I am nevertheless happy about my purchase. Here are some observations... The picture is good out of the box (if a little dark), and awesome after some tweaking (Game of Thrones looked amazing). The frame is thinner than the pictures seemed to indicate, which was a nice surprise, and heavier than you'd think given the thinness. It certainly FEELS solid. The set doesn't produce too much heat like I've read others say of plasmas in general, but I have experienced mild, very temporary burn-in (this doesn't affect viewing ever--it's only noticeable when you change the input or go to a dark screen suddenly after a static image has been on-screen for a while). Also, the screen is very reflective. Better have a dark room to use it in. For gamers like me, there doesn't seem to be input-lag out of the box but I have it on \"game\" mode just in case. Gears of War 3 looks sweet. But here are my best settings for TV/movie watching:Aspect Ratio: Just ScanEnergy Saving: OffPicture Mode: Expert 1Contrast: 89Brightness:64H. Sharp: 22V. Sharp: 22Color: 51Tint: 0(Expert control)Dynamic Contrast: OffNoise Reduction: OffGamma: MediumBlack Level: LowFilm Mode: offColor Gamut: StandardEdge Enhancement: OffColor Temp: MediumMethod: 2 PointPattern: OuterBTW, the \"IRE value\" settings suggested by user \"Tanveer\" made skin tones -- especially smooth skin -- all shiny/rainbow-y for me. I would leave those values alone if you don't know what you're doing. Also, with the \"Just Scan\" setting, something weird happens on a few sports/news broadcasting stations like ESPN. You'll get an either yellow or dotted line pattern on the very top of the screen. From what I've read, this is the broadcasters' fault, not any TV. Anyways, that's all I got right now. This TV is awesome.", "Date": "July 9, 2012"}, {"Title": "Great entry level TV", "Author": "A Customer", "ReviewID": "R3766SF61U082I", "Overall": "4.0", "Content": "I never really know how to write these reviews. It's a TV. It does what a TV should, which is show television programs. I bought this TV before it was available and had zero reviews. I was worried, but Amazon was allowing a 30 day return, so I went for it. Later, a few days before it arrived at my door, I saw it at Fry's. Phew! The TV looked nice and the picture was great. I no longer was nervous about the purchase. I got it, turned it on, and I found the picture was just as good as at the store and the sound was quite decent as well, as far as TVs go. Unlike my last plasma, I haven't noticed much burn-in. Any that I do see goes away after a short period of time. I suspect after prolonged use I won't ever see any. OK, that's the good, now for the bad. This is not a smart TV. You will need a Roku or similar device, or a blu-ray player with all those Netflix, etc. features built in to get those features. I have both, so definitely not a problem for me. The worst thing about this TV, which is extremely common on most TVs these days, is a lack of a headphone jack. (This is why I give it 4 stars instead of 5.) I'm hard of hearing and require headphones to watch TV. Due to this, I had to purchase some extra equipment in order to listen to the TV. I would think people who have families or room mates that they don't want to disturb at night would also want to use headphones. I think it strange that so few TVs come with headphone jacks anymore. Some do, so I know it's not an impossible feature to add. On the bright side, the extra equipment makes it sound better even when not using headphones.", "Date": "March 24, 2012"}, {"Title": "LG 50PA6500 calibration settings by tpendlebury @ CNET...", "Author": "Q. Le \"John Q.\"", "ReviewID": "R1QAI8Z20NO36Y", "Overall": "5.0", "Content": "Just want to share the calibration settings of this wonderful TV set found on CNET...LG 50PA6500 picture settingsby tpendlebury  - 9/26/12 3:26 PMReview: http://reviews.cnet.com/flat-panel-tvs/lg-50pa6500/4505-6482_7-35145445.htmlCalibration report using these settings: http://www.scribd.com/doc/107102433/LG-50PA6500Below you'll find the settings I found best for viewing the LG 50PA6500 in a dim room via the HDMI input. Your settings may vary depending on source, room conditions, and personal preference. Check out the Picture settings and calibration FAQ for more information.http://news.cnet.com/8301-17938_105-9996461-1.htmlCalibration notes: Like many budget plasmas the TV peaked at 50 IRE during testing. This affected the graph but not the performance.Picture menu:Energy Saving: OffPicture Mode: Expert [1 or 2]Contrast: 90Brightness: 53H Sharpness: 13V Sharpness: 13Color: 50Tint: 0--Expert control menu--Noise Reduction: OffGamma: 2.2Black level: LowFilm Mode: OnReal Cinema: OnColor Gamut: StandardEdge Enhancer: OffxvYCC: Auto [grayed out]Expert Pattern: Off [grayed out]--White Balance submenu--Color Temperature: WarmMethod: 2-pointsPattern: OuterPoints: [High]Red: 0Green: 2Blue: 0Points: [Low]Red: -5Green: 1Blue: -4Method: 20-point IRE0: [0,0,0]5 [0,-7,0]10 [0,-10,0]15 [0,-5,8]20 [8,0,2]25 [0,0,5]30 [0,-4,11]35 [-4,-2,5]40 [0,0,0]45 [0,0,0]50 [0,0,0]55 [0,0,0]60 [0,4,0]65 [0,0,0]70 [0,0,0]75 [-4,0,0]80 [-11,2,0]85 [-1,0,0]90 [-4,0,2]95 [-7,2,6]100 [-5,0,1]--Color management System submenu--Red: [Saturation -5. Tint -29, Luminance 0]Green: [Saturation -5. Tint 0, Luminance 0]Blue: [Saturation -2. Tint -2, Luminance -9]Cyan: [Saturation -3. Tint 2, Luminance 0]Magenta: [Saturation 0. Tint 0, Luminance -2]Red: [Saturation -10. Tint -27, Luminance 3]Note: This post was edited by its original author Added calibration report on 10/02/2012 at 9:00 AM PT", "Date": "May 17, 2013"}, {"Title": "Great picture", "Author": "LLWAS", "ReviewID": "R12GG2KL24A1QX", "Overall": "5.0", "Content": "Love this TV. Went from a first gen very expensive Samsung 55 LCD. It lasted about six years. This unit has a much better picture. There are a few reviews for \"tweaking\" the picture, look for them. I purchased the Disney \"WOW\" Blu ray TV(Plasma, LCD) and stereo set up disc. Haven't used it yet, I'm sure it will tweak my picture more.The sound from the TV speaker isnt the best. When it's hooked up to my surround sound receiver and speakers it will sound much better.I have three LG TV's, the others are LCD's. I really like the menu's on them.This is my first Plasma, and I love it. If you have a bright room, or lights that shine on the TV at night, you might not like a Plasma. I have room black out shades for day time, and indirect low level lights for night viewing. The refresh rate is perfect for those very fast action movies, like The Bourne Trilogy.I will update this when my sound system is hooked up and I've used that set up disc mentioned above, but for the price, $1049, bought here on Amazon, I can put this in another room in two-to-three years and go bigger(70-80).It's worth the five stars to me.....", "Date": "January 10, 2013"}, {"Title": "Picture is not sharp on PS3 games even after calibration :(", "Author": "Evil \"Fairy\"", "ReviewID": "RJU4WCAVAFB3L", "Overall": "4.0", "Content": "Well i bought this TV primary to have better gaming experience playing my PS3  on it. The problem is that when i play shooter game like MW3 the screen is so foggy/not sharp so i can barely see a target. It all looks like the picture is lacking contrast or sharpness. I dont know how to fix that, i did calibration that guys recommend here, didnt help, i found another settings specifically for this model- also didnt help at all.  My friends led tv (cheaper then this tv) has amazing sharpness even without calibration compared to mines. Can anyone recommend what to do to make the picture become more sharp? I tried switching from cinema to game mode etc and still in every mode picture is not clear (when im talking about playing on PS3)", "Date": "January 7, 2013"}, {"Title": "Love this TV", "Author": "Bryan", "ReviewID": "R1I4C5A7S9M77G", "Overall": "5.0", "Content": "I am upgrading from an old 52\" rear projection Mitsubishi. I have had this TV for a few weeks now and absolutely love it.  It is placed in my living room which gets a lot of light, both direct & indirect, and there is absolutely no problem with the TV being too dark at all.  Beautiful picture, setup was easy, I tweaked the video settings like some other reviewers have suggested with specific settings, and found that I prefer one of the presets to manually customizing the picture. Granted I am not a videophile, but for what I watch (typically sports) it works perfectly.", "Date": "December 12, 2012"}, {"Title": "WOW ------->VALUE STILL EXISTS<-----", "Author": "Michael Tue \"Me\"", "ReviewID": "R3DPQONEB3ARD", "Overall": "5.0", "Content": "I took a chance after reading many reviews all over, and WOW am I pleased. The picture is STUNNING and the price was STUNNING.This is an upgrade from a Panasonic 720 50\" Plasma about 8 years old, and UPGRADE IT IS. I am blown away at the ease of the menu, not to mention the in-depth menu options for color/picture. I followed the setup process described by previous poster  Tanveer Chaudry (Thank you SO much Tanveer!!) and cannot believe the difference it made. The original out of box picture was ok (mediocre) but after the adjustments it is the best picture I have ever seen on a flat panel tv, be it LED/LCD backlit,edgelit or any other plasma. I purchased mine at $880 which makes me feel a bit like a thief at this point. On a side note, I am not sure the weight of this tv or the old Panasonic, but this LG is lighter/thinner (I should know I installed both by myself) and 10\" bigger.", "Date": "November 28, 2012"}, {"Title": "Nice TV", "Author": "Charles H Jarrett", "ReviewID": "R23CYX5KL44K0X", "Overall": "4.0", "Content": "I like most everything about this TV except it does not have a receptical for eathernet line of my wireless bridge to plug into.", "Date": "November 18, 2012"}, {"Title": "Great TV. Buy with confidence.", "Author": "Revit", "ReviewID": "R3LPUKES8PMW7G", "Overall": "5.0", "Content": "I've owned this for over 2 months and I've loved it.  No issues, great color and is still bright in a living room full of windows.", "Date": "November 13, 2012"}, {"Title": "Loyal LG customer for life!!!", "Author": "mdh49", "ReviewID": "R3OJZJBO7STQB4", "Overall": "5.0", "Content": "This is our 2nd LG plasma tv. We bought our other one last year, the 60\" PV450, the same model as this from last year, as far as I can tell. We're still deliriously happy with that TV. We have it in our windowless downstairs family room, and the nice dark environment lends itself very well to that TV.Since I got tired of going down there all the time to enjoy the AWESOME viewing experience, we decided to buy a 50\" for our bedroom. Mounted at the foot of the bed, this TV is simply amazing.The picture is stunning, and all our HD content just POPS. I like a lot of scifi, nature, and history programming, and all these look absolutely amazing on both TVs.Something else really cool about this TV is that the USB input will play VIDEOS, not just view pictures. I checked, and it plays .avi, .wmv, .mp4, and .mkv off a flash drive or USB hard drive (I tried both).At the power rates in our state, and using the TV 3-4 hours per day, the estimated yearly cost less than $10.00 per year!!! AWESOME!!! Our downstairs 60\" uses twice the power, which is still only $20/yr.I am now a loyal LG customer for life, I would never buy another brand of HDTV. I am EXTREMELY HAPPY with both our TVs.", "Date": "October 17, 2012"}, {"Title": "Awesome TV", "Author": "Chris T", "ReviewID": "R20SOIQ3BO14RS", "Overall": "5.0", "Content": "I was really wanting an LCD HDTV, and was thinking about a 42\" to take place of my 3 year old plasma 39\" samsung. I hadn't made any commitments to a new tv yet, but one day while shopping at Sears, I passed by the LG 50\" plasma and couldn't believe the price. It was a labor day sale, and I couldn't pass up the price....$480 after tax. The quality of the picture is amazing, the sound is amazing, and my family loves it. Definitely a great buy.", "Date": "October 15, 2012"}, {"Title": "Great Value...Very Impressed.", "Author": "Thomas R. Ruttan", "ReviewID": "R2LOA3Q056UZV", "Overall": "5.0", "Content": "I actually don't own this but helped a friend set it up.Being the owner of a couple more expensive plasmas I didn't expect much...more of a value TV.But after getting everything set up properly, this thing actually looks better than the expensive Samsung LED it replaced.And being the owner of more expensive plasmas(Panasonic and Samsung), I wouldn't hesitate to buy one of these myself.The only real drawback on this TV is the screen glare.Of course, for a plasma at this price that's probably something I could live with.My friend got this for $799.99. That's an amazing value for a TV who's actual picture quality looks better than a $2000.00 LED.When my Samsung PNB860 eventually kicks the bucket, I'll definitely be taking a serious look at one of these LG value plasmas.Seeing this TV makes me continue to wonder why anybody is buying LCD/LED TV's.I suppose people like orange skin and people juddering around the screen?Plasma's the way to go and this is a great choice if your on a budget.", "Date": "October 10, 2012"}, {"Title": "LG 60\" PLASMA", "Author": "Gary L. Staton \"booktraveler\"", "ReviewID": "R1QWC6SXILXDXB", "Overall": "5.0", "Content": "I recieved the 60\" Plasma LG yesterday.  This is a big and heavy box so Amazon enhanced delivery made it all go well. The packaging assured that the TV arrived in perfect shape and the container was in good shape. I must admit I was a little unsure on the Plasma as I currently own all LCD TVs that are smaller.  This replaces a 7 year old Sony 51\" Projection so Plasma is new ground for me.  I am overjoyed with the beautiful picture and rich colors.  The reflection is not an issue although our room does have windows. Once the TV is on and a picture appears any reflection pretty well disappears.  I am still learning to set various options but so far movies, older TV shows, and live broadcasts look good. I am anxious to see football and hockey plus NASCAR races as the 600hz screen refresh rate would then be appreciated. I have just recieved this set but so far very impressed with this bargain big screen TV. Amazon was great to deal with on all this and I enjoy their service, pricing and customer service.", "Date": "October 4, 2012"}, {"Title": "One weekend in, I would say it's the best TV Value on the market!!", "Author": "Matthew Beehler \"Prime Fanatic\"", "ReviewID": "R39V87JD0X31JO", "Overall": "5.0", "Content": "So I wanted BIG, cheap, and an awesome picture. IF you want those same things, this is your TV. No doubt about it. IF you want apps, 3d, Smart TV, LED and all that other stuff, this is not your TV. I am a big proponent of Plasma as I feel the picture quality is still second to none. This set reaffirms that opinion. The TV is very good looking cosmetically as well. I almost pulled the trigger on the 2011 model and I am glad I waited as this is a noticeably more attractive set. I have viewed cable TV, xbox 360, and blu rays and I must say this picture is just delightful. If anything comes up I will update but my initial review is glowing. I firmly believe this is the best TV deal for $1,000 anywhere.", "Date": "September 24, 2012"}, {"Title": "Amazing TV, Amazing service by Amazon!", "Author": "Shelly A. Braun", "ReviewID": "R1NJDH2O4VCVTK", "Overall": "5.0", "Content": "We are loyal Amazon customers, and at first I was unsure about ordering such a large ticket item online.  I did my research, and chose this LG 60\" Plasma TV for our main family room area.  Amazon sells this TV for $300-$500 less than anywhere else, including BestBuy.Previous reviews said the images were as close to 3D as you could get, without being a 3D, television.  That is EXACTLY as promised - the picture is amazing and makes our 2 year old plasma look shameful.Amazon's 'white glove' service (free shipping as well) includes set-up of the TV in your home.  Sadly, our first TV arrived and the screen was cracked.  One call to Amazon and a new one was ordered - we had it back in our home in 4 business days, with many apologies from both Amazon and the delivery service.  Delivery man was very professional and courteous.I would recommend the product to anyone looking for a nice large Plasma.", "Date": "September 17, 2012"}, {"Title": "Great Plasma!", "Author": "Diego", "ReviewID": "RX45RE58BPSJX", "Overall": "5.0", "Content": "The LG PA6500 is a Great TV. Yes, It is not for a \"3D, Internet, \"Smart\" User\", because it doesnt have Internet and 3D.The TV has a Great Picture, and after calibration the picture is so good, the blacks are nice, they are not the ST50's blacks, but nice enought. I also own a Panasonic ST50 and I am sure the LG PA6500 is very competitive.Pros: Great Picture, Motion Flow, Colors are great, Good Blacks.Cons: Reflective. Its better for a dark room.Its a great tv for watching HD movies and also sports.", "Date": "September 12, 2012"}, {"Title": "Wonderful Choice.", "Author": "John \"nu1ncaa\"", "ReviewID": "RHD4DTKJ7B6BR", "Overall": "5.0", "Content": "I believe I have spent 2 years looking for a new TV. LED, LCD or Plasma???? Back and forth. Don't buy this or don't buy that. You have to have this or you need that. So many decisions. I could care less about 3D or a Smart TV. I want the best picture possible for watching sports and movies. I have had this TV for a week now and don't regret my choice at all. What a great picture. I have mine in the basement, the man cave, so the Plasma is perfect. One of the best if not the best picture I have ever seen. HD is so awesome on here. If you want a TV for picture only, not all the extra fluffy stuff, this is the best choice by far. Couldn't be happier.", "Date": "September 6, 2012"}, {"Title": "LG #1 tv manufacturer in my opinion.", "Author": "Ronald D. Bruner Jr. \"Ronnie Bruner\"", "ReviewID": "RARPW922LJ3BF", "Overall": "5.0", "Content": "Like most of you, I bought this because of price. The picture is crisp and clean. I own another LG, a 42\" LCD for 2 years now with no problems. Bravo to LG! LG makes wonderful televisions for the price! Highly recommended", "Date": "August 28, 2012"}, {"Title": "love it!", "Author": "trici", "ReviewID": "RVZ821X8N52O5", "Overall": "5.0", "Content": "I purchased this set for my 70 year old parents who had an aging TV set.  They were so overwhelmed with all of the options available to them, they asked for my help. I didn't even consider going to a store.  The prices there were so much more expensive.  I had purchased another set from Amazon previously.  It is so easy, especially if you know what you want.  Okay, about the TV.....After some research, and high recommendation from leading consumer magazine, I purchased this LG set.  50\" really is a perfect size.  It doesn't need to be any bigger for viewing in the family room.  This Plasma set works well in in the darker lit area.  The blues and blacks really stand out.  Sporting events are amazing. Won't recommend anything but HD. My parents couldn't believe how much more enjoyable TV viewing is with this new set.  Furthermore, the price was right.", "Date": "August 21, 2012"}, {"Title": "Wow.", "Author": "Starfire406", "ReviewID": "R1BPM7ZNEYSG8E", "Overall": "5.0", "Content": "First off I decided it was time to upgrade when, after 6 years on the same bulb, my last Samsung 50\" 1080p DLP tv started showing white dots all over the screen as the DMD chip began to die and as such this is my second big screen HDTV I have owned.Many people here did a lot of research and read lots of reviews here before buying - I did the exact opposite. Very soon after starting to do my research I went into a local store just to look and see what price they had on this 60PA6500 because it was on a sale and what I found was $1100 with the TV, 3yr warranty, bluray player, and 2 monster cables. I jumped on that.Decided to wait and take it home the next day so I could do some digging and everyone seemed to like it and gave it good reviews, so I went forward with my purchase and brought her home. And boy am I glad I did.Apparently there are hdtvs and HDTVs ... this ones the latter. It makes me honestly wonder if my last tv was HD at all...The picture is Amazingly clear, blacks are Deep-but with great detail, very Bright picture, I was WOWed after watching parts of Tron to test and then Star Trek for the main course my first night. Even with the scenes in Star Trek (2009) with nebulous clouds, a bright enterprise up front, planets/suns/ect in the back ground the 'space' was pitch BLACK and the detail on everything was precise and abundant-in light or dark, and there was a complete lack of motion blur as the 600hz refresh Superbly smooths out all fast movie scenes. I was noticing things in my movies I had never before seen on my last hdTV because the picture in dark areas would get washed out. I was like a kid on Christmas day.Down side? The speakers are clear but I would say they suck as they seem to have a 400hz filter or some such that keeps them from reproducing any lows, even with the bass set all the way up, and of course, as with all plasmas, there can be a glare if you have lots of lighting in your room. The TV speakers should be a non-issue because if you want to own a nice tv, you really should have a nice set of separate speakers for it otherwise you are very much missing out, and the glare is not noticeable once the movie starts or if you set your room up right. So I will take away zero stars for these items as you buy a nice TV for the picture-not for the sound or a room.I would have to say that whatever the price-if you are upgrading from an older DLP (just because of the limitations of the technology) you would be doing a great service to yourself to upgrade to this TV as I have no doubt you will find absolutely NO comparison between the picture quality of the two, this plasma is just flat out amazing.To sum it up in a word? ... WOW.", "Date": "August 21, 2012"}, {"Title": "Great buy!", "Author": "kyle", "ReviewID": "R2QAHL26FUHM0J", "Overall": "5.0", "Content": "This TV was an excellent purchase.  50\" for only $699?  I couldn't find a better deal for a TV that size anywhere.  On top of that was the FREE white glove shipping/delivery where they set the TV up and inspected it on site before the delivery guy left.  I can definitely see myself recommending one of these to a friend.  Great picture quality, and I only had to change a few settings to make the colors even brighter.  A little bit heavy but it is a plasma screen with a glass panel, so what do you expect?  Best bang for your buck out there if you are looking for a nice quality set without all of the fancy 3D technology out there.", "Date": "August 17, 2012"}, {"Title": "Great TV for the money", "Author": "Ron, Virginia Beach", "ReviewID": "R22GIHYRU9B81D", "Overall": "5.0", "Content": "After searching for weeks, we finally decided on the 50inch LG plasma.  The price was competitive compared to other sites.  The TV setup was easy and we had it up and running within minutes.  We haven't spent time fine tuning the picture because honestly it wasn't necessary.  The sound is also very acceptable.  If you are looking for an affordable TV without all the bells and whistles, this is the one. We didn't want 3D and we use the XBOX to access online content. The picture is great when using cable, blu-ray, xbox and regular dvds. One thing that was surprising, was the weight.  We thought it was a little heavy for a TV these days, but thats really minor since we aren't carrying around the TV. There is some glare, as stated in other reviews, so don't place this TV next to big bay windows!  Overall, a great deal.  We are happy with it.We did purchase the 4 year warranty for $99,  just as a piece of mind.After 3 weeks,  i'm still very pleased with the purchase.  Nothing bad to report!", "Date": "July 22, 2012"}, {"Title": "Great for the money", "Author": "j.p. \"slats\"", "ReviewID": "R1K908L34VZPOP", "Overall": "5.0", "Content": "I replaced a rear projection t.v. of the same size.I heard all of the negatives about plazma,and so far the only negative I see is light caused reflection on the screen in a bright sunlit room.The picture quality is better than I expected on a t.v. in this price range,however the price did drop $50 thirty days after I bought mine (my usual luck).No tax,free shipping,delivered when promised,hassle free.How do you beat that??", "Date": "June 2, 2012"}, {"Title": "love this TV!", "Author": "pattiecake01", "ReviewID": "R1VNDTKNFTE6FV", "Overall": "5.0", "Content": "love this TV.  no problems with it ever.  the picture is so crisp and clear. I would recommend this TV to everyone.", "Date": "June 5, 2012"}, {"Title": "Had to send the tv back twice for being defective", "Author": "abeck", "ReviewID": "R3AN0R854ZQV2", "Overall": "2.0", "Content": "I was disappointed with this product.  I received good reviews from consumer reports and was at a great price, but I had to return it twice for being defective and eventually switched to a different brand.  The first TV had a dead pixel on the screen.  The second one overheated to a point where it was extremely hot to the touch.  I may have been unlucky, but it was frustrating spending the money and having a less than great product.", "Date": "July 22, 2012"}, {"Title": "Great Pic but the screen is to reflective", "Author": "Brenda", "ReviewID": "R2NPEL4D1X81Q9", "Overall": "4.0", "Content": "First, I think for 800 bucks the picture and size is great.  The only complaint that i have is that the screen is very reflective. when the TV is off it is like a mirror.  If the TV is near a light source, window or lamp, it will appear on the screen. I had to modify my TV area a little.  I compare it to a Macbook Pro's screen with the brightness turned down.  There are times when you get distracted by the reflection but if you focus on the picture you can overlook it.If you have a very bright room or if you TV area had lamps that will interfere with the pic you might want a LED.I say again great PIC for the money, works great for me.", "Date": "May 11, 2012"}, {"Title": "Broke after 17 months", "Author": "time4badbeat", "ReviewID": "RGZNTDAHOTLPU", "Overall": "1.0", "Content": "Will not buy an LG product again.  TV has sound but no picture after 17 months - coincidentally the warranty only lasts a year.  Still trying to work out how to fix it but I think I've learned my lesson and will either purchase from TV companies that stand behind their product with a longer warranty or purchase from a company that backs the products they sell by extending the warranty.", "Date": "December 17, 2013"}, {"Title": "Buyer beware", "Author": "John H.", "ReviewID": "R23OMRSBPG3YQU", "Overall": "1.0", "Content": "I Bought this TV in July of 2012, (16 months ago) it had great definition and colors, last night it died while I was watching a movie.  It suddenly shut itself off and would not start up again.  I checked to make the power plug was securely plugged in, all were secure.  This TV has been plugged in into a UPS since the day I got it.  What a waste of money!  I will never buy a LG product again.", "Date": "November 24, 2013"}, {"Title": "The perfect TV for our living room.", "Author": "jiloolah", "ReviewID": "R3I5KREVMRO113", "Overall": "5.0", "Content": "We've had this TV for about 9 months now, and are so happy with it. The 50\" size is perfect for our size living room, and the picture quality is fantastic. It doesn't have any background buzzing noise, like some people have complained with plasma TVs. One feature that we especially love are all the HDMI USB ports. It makes it so easy to plug in our external hard drive and workout, watch movies, etc. The TV also has a lot of customizeable features with the display. The only thing I woud improve is the volume, which isn't too great after you reach a certain point. The TV definitely needs speakers to give the sound that extra boom.", "Date": "August 6, 2013"}, {"Title": "Really Good For The Price", "Author": "PrettyPicky", "ReviewID": "R1HKJYAZK8J399", "Overall": "4.0", "Content": "I got spoiled with my 60 inch which had a few more options but this has a fantastic picture and for the price I would buy it again.In fairness my 60 inch was over 3 times the price so this is a great buy !!", "Date": "July 22, 2013"}, {"Title": "VERY GOOD PICTURE", "Author": "M. Jones \"eclectic technologist\"", "ReviewID": "R13NGWPVTZLDTF", "Overall": "5.0", "Content": "This is a **VERY GOOD** plasma if you do not need smart functions and 3D. I have a PS3, and think 3D is currently garbage - therefore I picked one up from BB when it was $799 delivered.This set surprised me. It has the best 'out of box' picture of any television I own (Panasonic Plasma, Samsung LCD, JVC HILDA). The picture is so good, that I may never try to tweak the picture settings.When you startup the TV for the first time, you select 'Home Use' and then I selected the 'Cinema' setting. What a picture! Blacks are detailed, flesh tones accurate.In addition, the TV is thin and minimalist (which I like). The television interface is slick and modern.A heck of a deal!", "Date": "January 28, 2013"}, {"Title": "Updated 1/6/14 - So far so good", "Author": "pat", "ReviewID": "R3N3FPRCMFD9T3", "Overall": "5.0", "Content": "1/6/14 Update - Still works great and have had no issues! I definitely recommend!I purchased this TV on black Friday of 2012.  I have only owned it for about 3 months so take that into consideration when reading this review.  The product came on time and was packaged nicely.  However when it was delivered they tried to get me to pay for a white glove service (basically pay them to prove that it works and they set it up for you).  I was comfortable with it working so I declined this service.  The product looks great and for the price it has worked out really well.  Quality is high and good volume which I heard a few people were complaining about.  I have not tried out the wall mount so I can not comment on that.  The multiple HDMI cables is really nice.I will update this review if I have any issues in the future, but as is its a 5 star product for great price and great quality.", "Date": "January 14, 2013"}, {"Title": "Amazing HDTV for the price!", "Author": "James R. Scott \"jscott3985\"", "ReviewID": "R3IJTQFKV6S3KF", "Overall": "4.0", "Content": "As my 4 year old Samsung HDTV was dying from \"normal wear and tear\" (as Samsung puts it) I decided to try a different brand. I spent over 2 grand on that Sammy tv so this time I decided that I didn't want to spend that much as its not really worth it, from my experience. Saw this tv on sale at tigerdirect for 799.99 and decided to give it a try based on the reviews. So glad I did, it's a great tv with very easy to use features.", "Date": "December 31, 2012"}, {"Title": "Great TV and superb delivery service!", "Author": "Patricia Matlosz", "ReviewID": "RHJ2FVJLXSE4O", "Overall": "5.0", "Content": "I was really impressed with the delivery and setup of this TV.  I have never ordered such a large and delicate piece of electronics online before, but certainly will again.  The TV was ordered for a vacation home, about 100 miles from our house.  I was concerned about having to make a dash to the Lake when I received a delivery call, but the freight company kept me informed throughout, so scheduling delivery was no problem at all.  Delivery people took care, hooked up the TV, and cleaned up all trash.  My only (tiny) complaint is that, since outside light source is behind the TV, I have had to do some fiddling with darkness, color, and contrast controls for maximum viewing pleasure during the day. Love the TV, love Amazon!", "Date": "December 27, 2012"}, {"Title": "Awesome TV!", "Author": "Joaopaulo Pinheiro \"JP\"", "ReviewID": "R2FQN74BZ3CUD0", "Overall": "5.0", "Content": "I purchased this tv through HHGREGG during cyber monday, got a great deal.This TV is of very high quality, looks very sleek.  I changed my color settings with one of the ones posted on this review board, and the color looks wonderful, very realistic.The viewing angle is AMAZING, virtually 180degrees of viewing angle, without loss of quality.This TV indeed does have quite a bit of reflection, so you will be able to see any lights in the background, but this is usually the case with most TVs anyways.Sound quality is pretty decent as well.  One thing I didn't like is the \"resolution\" of the sound volume in the lower numbers.  When you want it to be a quiet night... volume 5 is plenty, you go to 6 and it's loud.  I've never had to go above volume 20 at any time.  I wish it had more resolution in the lower settings.  I'll be hooking up a home theater system anyways, but the TV sound is of great quality nonetheless.Great TV, I recommend.  If you don't need all the hooplahhoorah of internet TV, 3D etc.. this is the choice for you.. if you get a good deal.  I was able to snag it for five hundies on Cyber Monday.", "Date": "December 22, 2012"}, {"Title": "Fantastic Basic Plasma", "Author": "Eugene H McNay II", "ReviewID": "R15X9W6W349CG5", "Overall": "4.0", "Content": "This LG 50\" plasma meets or exceeds my expectations for my living room. Color is good, the color temperature presets \"sports\", \"cinema\", maybe 1-2 others met my needs without a bunch of fiddling, but there is a custom setting available... The speakers on the TV are pretty tinny. I'll eventually hook this up to an audio system...Overall, I'm quite happy with this purchase.", "Date": "December 17, 2012"}, {"Title": "As goo as expected.", "Author": "jay", "ReviewID": "R1SS0POJXXZTPJ", "Overall": "5.0", "Content": "I purchased this TV after reading the rave reviews for the previous models and then talking to a salesman about what they had changed. I use it strictly as a computer monitor for entertainment websites. It is a beautiful unit, and well worth the money spent, probably even more so.  Totally recommended.", "Date": "December 12, 2012"}, {"Title": "Very good Plasma for the $", "Author": "Jonathan N. Balazs \"J\"", "ReviewID": "R19GXJM7YNXGRO", "Overall": "5.0", "Content": "I was searching for a while trying to find a 50\" TV that was not over 1,000. This TV has a very clear picture but I would recommend picking up surround sound since the speakers are a bit weak.", "Date": "November 24, 2012"}, {"Title": "plasma is the way to go", "Author": "Bill M.", "ReviewID": "R1VGETMFWTNN95", "Overall": "5.0", "Content": "I have a 55 inch vizio LCD which is great, especially for the money. But i was disappointed when I bought the new vizio LED 60 inch TV (side lit LED) for another room. Picture was just ok at best. So I returned it and bought the LG 60 inch plasma from Costco (800 bucks). Awesome picture, so much nicer than the Vizio LCD and LED. I already own a 42 inch Panasonic Viera plasma for the bedroom and it also looks great. No question the plasma is the best picture quality. However, it's in my den which is very bright and you do see reflections until it gets darker outside, but still love the set.", "Date": "November 11, 2012"}, {"Title": "Excellent picture and value", "Author": "Colin Buxton", "ReviewID": "R1FNIWC42I8OS", "Overall": "5.0", "Content": "After a fair amount of research I ordered this set and am very happy with the decision.  The picture is excellent, the TV looks good and it is easy to set up and use.What I am particularly happy about is the built-in tuner, being one of the few people left on this planet who relies on over-the-air tv broadcasts.  I get more channels now than I did with my external tuner box and have saved space and wiring accordingly.Some buyers may be looking for more inputs but what was available sufficed for my needs.", "Date": "October 18, 2012"}, {"Title": "Great value for the money", "Author": "David C. Younskevicius", "ReviewID": "R2QBTUEQUA1PBR", "Overall": "5.0", "Content": "I spent a lot of time researching this TV on a bunch of different websites and forums and finally settled on this one.  I was not disappointed.  This is a near top of the line picture for a great price.  The Amazon \"white glove service\" was awesome (I didn't lift a finger) and the whole experience has been good.The picture does have some glare and for some reason, no matter what, the picture seems a little dark.  The TV stand is also a little short.  But the viewing angle and black levels are great as advertised.  And the amount of customization you can do (if you want to) is amazing.  Absolutely worth it.  I spent $1,400 a few years ago for an LCD TV (Sharp Aquos) that was only 42' and had a decidedly worse picture (though it was also 1080p).  This was a big upgrade for a lot less money.", "Date": "September 21, 2012"}, {"Title": "HOW MUCH DO YOU WANT TO SPEND?", "Author": "The Movie Guy \"Movies from A to Z\"", "ReviewID": "R2B7BQZ6NVTL3H", "Overall": "4.0", "Content": "I bought my 60 inch unit at the Augusta, Ga. HH Gregg. It was a $899 come-on item. In the store they had a more expensive, better looking picture, smart TV next to it. I couldn't get a straight answer from the salesman about signals or fixing TV color etc. other than \"It is what it is\" whatever that means.I couldn't cheaply use a smart TV since I live in a rural area without a high speed connection. I decided that since I didn't have another TV next to it for comparison in my home, I opted for the cheaper version, but did get the extended 5 year warranty, which I expect to use .The TV is heavy and I recommend 2 people to handle it. To be honest, I was able to move the TV from my Expedition to the TV room and set it up by myself. I live alone and have learned to move heavy items with mechanical aids and leverage. The stand set up easily and it was ready to go.There are a few disadvantages with a plasma. First is the screen burn in. It advises you not leave the same picture on the screen for more than an hour as permanent burn in can happen. You can see the effects after 10 minutes, although it is temporary. The manufacturer does not warranty against burn in.The second aspect is that it heats up. I have mine located on a stand about 2 feet from the back wall. A third problem is that the set in \"on\" all the time drawing juice.On my TV set I have a whistle coming from my speaker when the TV set is silent as in fast forwarding a film or pausing it. There is no whistle when it is in mute, or there is sound. I haven't figured out if this is the way it is supposed to be or I should take it back. While I am pleased with my purchase, I am too old to get excited about watching Honey-Boo-Boo in 60 inch HD.The major disadvantage of HD over analog is that at times it is too good for CG effects, that now look fake.", "Date": "September 12, 2012"}, {"Title": "Great television", "Author": "Chuck Larsen", "ReviewID": "R23SNT7MJD20JB", "Overall": "5.0", "Content": "I thought an LG was out of our price range but this one is priced right and delivers outstanding performance and picture. We are both music nuts and watch a lot of concerts and the sound quality is also excellent. We looked at a number of other sets in this price range and there was just no comparison. VERY HAPPY with our LG!!", "Date": "September 12, 2012"}, {"Title": "GOOD SIZE TELEVION", "Author": "3D4", "ReviewID": "R3QXK9YP3R8BBP", "Overall": "5.0", "Content": "Very BIG TV! Shipping was one day late. Packaging was well done to protect the box. No damage done to the box. Was very easy to set up, although having two people set it up is probably better than one. Plays video games, movies, and channels in detail. A very good tv for the asking price. Best buy has one at the same price but it is 55\". Was able to buy this TV with Amazon credit!!!!!", "Date": "September 8, 2012"}, {"Title": "Great picture", "Author": "Janet G. Johnson \"Jan Johnson\"", "ReviewID": "R27TCTRQNTPNKG", "Overall": "5.0", "Content": "Great price.  Great picture.  Works perfectly with media center from Direct TV.  Got 2 tvs at this price!  Easy to set up.", "Date": "July 14, 2012"}, {"Title": ":-)", "Author": "tommegunns \"tommegunns\"", "ReviewID": "RB48PPPBIZZ8Q", "Overall": "5.0", "Content": "I have had this tv for 5 days and I find myself smiling while watching it. The picture is superb and I haven't even tried a full 1080p bluray..this is just from watching hd cable in 720p! I spent weeks researching televisions, and when I would go to stores, every single customer service rep would give me the same line about how led was better (for gaming and sports), and plasmas have burn in and more power consumption (how do they even sale plasmas). After a ton of research, I found out the burn in problem has been addressed and plasmas are actually better for gaming and sports...due to the 600hz refresh rates. Power consumption wise on a new plasma is around $15 more a year! Superb Picture quality, and no picture loss regardless of angle....PRICELESS! Only thing I noticed was when the cable guy came he gave me this crap about component cables being better then hdmi (for 720p) (I think he just didn't have a hdmi). I tried the components but the picture looked really grainy and had a greenish tint that I couldn't seem to fix. I started thinking that something was wrong with the tv, but decided to try a hdmi, and waaalaaa...can't stop smiling since :)...So if anyone is using components and aren't happy with the picture...try using hdmi....BIG difference with this tv! You absolutely cant beat this picture for under $1000.00! Period! The surprising thing to me is that, none of the reps that work in the television departments seem to know what they are talking about and people go in and take their word because they work there, and are just being misinformed. However the one thing that does hold true is the glare problem...if you have a bright room you might think about curtains with a plasma. It's not that bad but once you have such a excellent picture it seems like every little thing that takes away from that becomes a bother! Do your own research though...and be warned...it's amazing how many people in forums are misinforming people also...just because they have an led, and over half of them probably never even owned a plasma or took the time to look at the new plasmas! I myself had dismissed plasma before I started shopping and was 100% looking for a led, but I am now a believer!", "Date": "March 21, 2013"}, {"Title": "Slim and Nice design. Hard to calibrate picture.", "Author": "Guitarh3ro", "ReviewID": "R1WWIU4PJZPZL6", "Overall": "4.0", "Content": "I was going to go with a panasonic plasma for 800 which was a lower tier for panasonic plasma's but them apparently being the best in plasma tv's I was skeptical about choosing anything else. But when I saw how fat the tv was, I quickly thought twice and started looking at other slimmer Tv's on amazon. This one is super thin and beautifully designed. That was what made me want to rate it 5 stars at first..The price on this 50PA6500 is what caught my attention. People were saying LG wasn't that great for their plasma's unless you spend a lot and go for the top tier. With more research and looking at various reviews however, it seems a lot more people liked this than didn't and the fact that this is actually one of their better tv's just without all those extra features we all know would be easier with a gaming console or blu ray player.OK. So I'm taking back any negativeness I put on the picture. I guess I was being too picky and indecisive. Last night I put my focus on getting a good picture I knew could happen. I finally got some good settings for my xbox mode, and Blu Ray/Netflix/Movie mode and I really am impressed at how amazing the smooth motioning is and not looking like a soap opera effect, The colors once tweaked a bit, Look very deep and beautiful, as well as the black levels. So if you spend the time to tweak the settings to your liking, this can be a very affordable and beautiful option.", "Date": "July 10, 2012"}, {"Title": "Aspect Ratio", "Author": "David K. \"dave the dude\"", "ReviewID": "R3COZLGSAIDI9O", "Overall": "5.0", "Content": "you can elimanate the bars on shows that are not in 16 to 9 ratio by going to cinema 1 and zooming out , the ratio changes from 1 to 16 by pressing the side arrows left or right. I read on a Best Buy review that you can`t change the ratio but you can.This TV has the best picture i`ve seen for the money.", "Date": "June 7, 2012"}, {"Title": "LG 60\" Plasma", "Author": "BimmerGuy", "ReviewID": "RVK830XCIV1KK", "Overall": "5.0", "Content": "Like most of the reviews of this TV, I highly recommend it.  I intended to buy a Panasonic or Samsung since they were amoung the best rated plasma's but I bought this based on all the favorable reviews.  I purchased mine at Costco for $780, no tax in NH.  The picture is stunning and I really didn't tweak the settings much, it was great right out of the box.  If you are looking for a great 60\" set, do not hesitate, it's the best deal for the money.  And frankly, I believe the deminishing marginal return theory comes into play when you spend more for a 60\": you will spend a great deal more money for minute additional gains.If you're looking at a plasma you know about glare.  This can be addressed easily by getting some decent curtains/blinds (black-out curtains/blinds are best).  The majority of the glare comes from the opposing window of the TV so that is the only window you really need to address assuming you view the TV head on.  Also consider when you watch TV.  We watch it at night 95% of the time so there's no glare issue the majority of the time and when there is, we close the curtain - whalla.Lastly, most reviews don't mention subfield motion speed when comparing LED/LCD to plasma's.  This is motion blur or how quickly the picture adjusts to motion.  Plasma's subfield speed is 600HZ compared to 120HZ for LED/LCD.  Quite a big difference.  Pro's indicate this is why gamers like plasma's so much but I'm not a gamer and I think it improves just about any movie you are watching, particularly action films.We got a blue ray player with web access (Samsung $130) and the blue ray movies (ie: Avatar) look ridiculously good.  The web also opened up a new world of Pandora, Youtube, Netflix, etc on the big screen.  Navigating is a bit clunky with the included remote but not bad.", "Date": "March 2, 2013"}, {"Title": "Perfect size for Bedroom or Living Room", "Author": "Sarahsemilia", "ReviewID": "R2FECY3JTGB9HR", "Overall": "5.0", "Content": "I use mine in my bedroom.  It fits perfectly and looks great on a stand that is only supposed to be for 42\".  I prefer the Plasma over the alternatives as the colors are deeper and the picture looks more true.  I have an LED television in my guest room as the light is much brighter in that room, but I am very happy with the quality of the picture and the sound for this television.", "Date": "May 28, 2014"}, {"Title": "For the money it was a great buy", "Author": "M. C. Stith \"frozintime\"", "ReviewID": "RDKHXPPZ3W4S0", "Overall": "4.0", "Content": "Ive had this t.v. about 1 1/2 years now, and it was a great buy as we paid just under 700.....it doesnt stand up to our sony xbr, but is great overall. The sound is really good on this. So if I could give it 4 1/2 stars I would.....a great value.", "Date": "May 11, 2014"}, {"Title": "15 Months, and the Power Supply Board Failed", "Author": "W. Katzinski", "ReviewID": "R2LTWL9C3PV6Y7", "Overall": "2.0", "Content": "15 months after our purchase, the television stopped working.  It clicked when pressing the power button, but no picture or sound.I researched this (it was 3 months out of warranty) and found that it was common for the power supply board to fail on this -- and other -- LG models.  It's so common that there is a cottage industry to sell fixes for the problem.I chose to buy and replace the full power supply board for about $70 including shipping, but there are guys that sell the individual transistors and capacitors with instructions that are typically the culprits for a lot less.  I don't have time to solder devices onto a circuit board.Other than that, the picture and other features are great.But I'll never buy another LG.", "Date": "April 25, 2014"}, {"Title": "I love Plasma HDTV", "Author": "BSS", "ReviewID": "REIGUJK40Y0XU", "Overall": "5.0", "Content": "The picture is amazing and I would recommend this manufacturer and seller. I upgraded from a 60\" LED and may upgrade again to stay with the technology.", "Date": "February 13, 2014"}, {"Title": "Keep your receipt", "Author": "VABACKWOODS0922", "ReviewID": "R3DDCWIA6EDJNP", "Overall": "3.0", "Content": "I've had this TV for about 8 months and the power supply burned out. Luckily it was still under the 1 year warranty and the customer service was  excellent. Called the company and they ordered the parts and sent a technician out to my house to fix the TV free of charge.", "Date": "February 12, 2014"}, {"Title": "Good, but questionable reliability", "Author": "E. Smith", "ReviewID": "RI0WNXATM6YK9", "Overall": "4.0", "Content": "I loved the price point of it, but when a few months later it stopped working due to a failed power board, I didn't love it so much.It was covered under warranty, so I got it fixed and didn't have to pay - but the whole process was annoying and took a few weeks to resolve.I bought an additional TV and didn't go LG this time. I'm sure all electronics have their issues, and sometimes you just get a bad one - but if you look at the online forums about this model/series of TVs - there are TONS of problems with them, vs just the rare bad bit. They appear to have skimped on a few capacitors on the power board, and something about the main controller board goes bad as well - again, check the forums.Otherwise, when the TV is working, it was a good price, and performs fantastically.", "Date": "January 21, 2014"}, {"Title": "Bad Tv", "Author": "Katie Dunn \"katieii91\"", "ReviewID": "R1NK86L7P1PSG1", "Overall": "2.0", "Content": "Let me start by saying I've owned this tv less than a month and it turned off twice by itself I've also had pixel problems they will be one pixel white out of no where and last night my friends was watching a movie on it and said he could see my Xbox dashboard when he turned it off I haven't returned it out called LG but I wouldn't buy again and it weighs alot to move around if I wanted to send it back", "Date": "December 27, 2013"}, {"Title": "Great price for a decetn TV", "Author": "Steve Fomer", "ReviewID": "R3UEMQ6GDTZ7DT", "Overall": "5.0", "Content": "We bought this plasma TV to hook up to our cable, computer and Apple TV. Since it is a plasma, it will have ghosting issues if you keep the screen on a single picture for a while. We found that simply flipping it to static for 30 seconds wipes away the ghosting. I like the TV, it has great viewing angles and deep blacks. I would probably get an LED TV if I need a computer monitor in the future.I have now had the TV about 1 year and 4 months and still no issues. The price/in^2 of plasma's is unbeatable, even with the ghosting weakness.", "Date": "December 5, 2013"}, {"Title": "Died after 15 months. LG is terrible!", "Author": "F. Kolias \"NJ guy\"", "ReviewID": "R3NP4B4IJV9DLU", "Overall": "1.0", "Content": "Bought this TV from Costco last July. The picture went out last sunday. Costco sent out a repairman. He brought several parts, but could not get the TV to work. What a piece of junk. There is a class action suit against LG TV's, the same problem is happening to everyone around the country. LG will not back their product. Thank goodness Costco doubles the manufacturers warranty, so if it ever gets fixed it will not cost me anything. But I'm sure it will happen again. LG uses cheap Chinese parts that overheat upon use causing early failures. DO NOT BUY LG!!!", "Date": "October 23, 2013"}, {"Title": "well worth the money", "Author": "M. Anderson \"Mark\"", "ReviewID": "R1O9I74EDITWG2", "Overall": "4.0", "Content": "Like many I had scoured the internet, reading review after review for the perfect plasma TV.  I'm not going to lie, I wanted a the biggest T.V. I could afford. I like LG products and coupled with the reviews I bought the LG 60PA6500.  I've had it a year now.  No problems with pixels dying, no color fade, its just as awesome as the day I took it out of the box.  The picture requires a good deal of manipulation to get the perfect picture and it can be frustrating.  The first time I set it up I was very impressed with the picture, I popped in \"Finding Nemo\" for my daughter, and every blue fish looked like a neon sign that drowned out the other fish.  I went back to tweaking the picture, again and again.  It took me months of learning, but I finally nailed it.  The picture is very good. It is very nice with a blue ray player.If I knew then what I know now, I would get a tv with wireless internet services for streaming media. Other than that I have no complaints.", "Date": "October 13, 2013"}, {"Title": "Love my plasma", "Author": "Gary", "ReviewID": "R1KJCFDTPZFEGS", "Overall": "5.0", "Content": "Love my plasma sold my 42 plasma for this one at a lose. Sound is better and love the bigger screen. At 65 this might be my last TV.", "Date": "September 10, 2013"}, {"Title": "Amazing TV!", "Author": "Cory M Donovan", "ReviewID": "R1SJXD22EF0JCO", "Overall": "5.0", "Content": "I was holding off on upgrading from my 30\" Philips tube TV for years because I couldn't get other LCD's to match the color reproduction and response time of my tube. I'm sure there were great LCD's out there that would have done the job, but I think I held off because I was looking for the perfect TV. One day in the store I decided to check out the TV's and they had this running Inception in the theater area and I was amazed. The price was perfect ($599 at the time) and I picked up the unit about a year ago during black Friday and couldn't be happier with the choice.I set my configuration to match that of the review Tanveer Chaudry wrote but with the sharpness turned down to my liking. At first I was paranoid about burn in when black bars from a movie would be left on the screen, but then realized all I was getting was image persistence and it went away after a few hours of normal 16x9 TV watching. The Blacks on this TV are amazing. Shadows and Dark Scenes are reproduced better then any other TV I have seen thus far (although I never had the privilege of seeing a Pioneer Kuro).I know this TV is no longer in production and it seems they have a newer model out. If that TV is anything like this one, buy it and you won't regret it!", "Date": "August 7, 2013"}, {"Title": "FAILED after 1 year & 2 months", "Author": "Ryan", "ReviewID": "R2LUNA6BE9CI59", "Overall": "1.0", "Content": "Screen powers off and wont stay on, just a splash of what you are watching, then powers off.  Out of Warranty by 60 days or so.  Not backed by amazon or LG.  I called LG, since it's out of warranty (over one year) they could care less.  They gave me 3 local \"authorized\" repair people.  All quoted me $300-$500 to fix the issue.  WASTE OF MONEY. Look elsewhere or go with a LCD not plasma.. we love our other LG 37\" LCD too...such a shame.  YOU GET WHAT YOU PAY FOR.  :(", "Date": "July 8, 2013"}, {"Title": "AWESOME!", "Author": "Marc", "ReviewID": "R2KYUZFKM1T4C8", "Overall": "5.0", "Content": "For the price this tv is Perfect. Ive never owned a Plasma before and I have to say, I like it. The resolution is great, wish there were more HDMI inputs though.", "Date": "June 26, 2013"}, {"Title": "Winner", "Author": "Simba", "ReviewID": "R2PRO8V60423KB", "Overall": "5.0", "Content": "I am very happy with both the quality and the price of this TV. I placed on the mantle in the greatroomand it works perfect for viewing and for Wii games", "Date": "June 6, 2013"}, {"Title": "Wow", "Author": "Ruben Pimentel", "ReviewID": "R2JGK6NNZX32FO", "Overall": "5.0", "Content": "This tv is amazing. The picture is beautiful and it is very easy to set up. I have the tv with the least delay out of me and my buddies.", "Date": "April 27, 2013"}, {"Title": "Great Plasma", "Author": "MRxME", "ReviewID": "R1IGQ8X9O6GLAT", "Overall": "5.0", "Content": "Football, Hockey, Movies, Gaming, Cable TV whatever your poison, this plasma performs great. You should use it in a low light room to prevent glare off the glass, but that is with most all plasma's.", "Date": "April 21, 2013"}, {"Title": "Absolutely Fantastic TV", "Author": "Blktiger0", "ReviewID": "R3TY89WBWGVB5D", "Overall": "5.0", "Content": "I bought this TV because I needed an upgrade from the 26-inch 720p Sanyo I had been using for close to 4 years. I wasn't looking for a Smart TV, I didn't need anything bigger than 60 or 70 inches at absolute maximum, I wanted something that was less bulky looking than my Sanyo, I wanted to upgrade to 1080p, I needed something I could use as a computer monitor, and I didn't want to pay more than about $800 or $900.I mostly use my TV for playing Xbox, using as a computer monitor (for gaming, graphic design, and regular computing), and then watching a little bit of Netflix and maybe a Movie here or there.I looked at some LCD Samsung TV's on here that were around 43 inches, and had it narrowed down between two. Two of my friends had TV's from the same model line, only smaller, and they looked fantastic. Two of my family members had LCD LG's of a similar size, which left something to be desired, but are certainly nice enough.However, when I finally decided on one of the Samsung TV's and finally decided to order it, I came on to find it out of stock. Navigating to my second choice, I came across this TV and my immediate thoughts were that there was clearly something wrong or else it was just too good to be true.Nope. This TV is just that much of a deal, mostly because not many people want Plasma anymore.The only complaint I have about this TV is that it has no analogue (Red/White) Audio Out ports on the back, which I miss, since I always hooked up a small PA I have to my other TV. Surprisingly, though, the speakers on this thing are pretty decent as far as HDTV speakers go. They aren't great in the big scheme of speakers, but they are some of the best stock TV speakers I've experienced, which was a pleasant surprise.The frame of the TV is very, very slim. Don't get me wrong, there are more sleek, skinny TV's available, but compared to similar priced sets of a similar size, this thing is amazingly thin. Don't think that equates to lightweight, though. This is definitely something you don't want to lift by yourself, although it's possible (I carried it up to my second floor apartment alone, but it was NOT fun).Now, for the important part. Like I said, I compared pictures with my old Sanyo, a few friends' Samsungs, a friend's 43-inch Sanyo, and the 40-something-inch LG sets that two of my family members have, but nothing can top how sharp, crisp, detailed, and rich the display of this TV is. It has shamed almost every other TV I've watched. It looked impressive out of the box, but after following the calibration advice from another review I read here on Amazon, the picture became close to unbeatable.After getting a 50-inch, slim set for about $700 with free shipping, I fully expected to find a slew of shortcomings when I spent some time with it, ending up with a fierce case of buyer's remorse, but that just didn't happen, and I don't see it happening.This TV is absolutely outstanding, and if you're looking for a big, slim, gorgeous TV and have no need for Smart TV features and are prepared to take the extra care of Plasma (you have to make sure the screen doesn't burn)then stop wasting your time and add this thing to your cart, because this is the TV for you.", "Date": "April 13, 2013"}, {"Title": "Great deal and great product!", "Author": "April J. Warholic", "ReviewID": "R62KXK6BRB2RO", "Overall": "5.0", "Content": "So far so good!! Clear picture. I have this set up in my small apartment so no sound issues either. Sports look great!", "Date": "April 3, 2013"}, {"Title": "Absolutely wonderful...!", "Author": "Amazon Buyer", "ReviewID": "R3J8UNR92PEYF0", "Overall": "5.0", "Content": "I bought this TV for a game room, it was the bottom of the LG 60\" line.  15 minutes after it came out of the box, the games were hooked up, the television was on and DVD player was ready...I didn't have to do a thing except plug cables in.The sound was so good that my sound bar system was never installedNow I must tell you I took all kinds of grief when I told people I bought a television of this size over the Internet.  Amazon gave me a receiving window and the set arrived one day late.  Try that with your next new car.  The freight company people helped me bring the television into the game room, asked me if I was satisfied and had me sign off on the delivery.  The rest is pleasurable history.For my next new television I will do the same thing again and I would advise anybody to do so.", "Date": "March 28, 2013"}, {"Title": "Best TV", "Author": "S. TIERNAN", "ReviewID": "R3JLIS4EI682S0", "Overall": "5.0", "Content": "I absolutely love my TV. I love how thin the bezel (frame around the screen) is, and how crisp and vivid the picture is. I resisted upgrading to an LCD LED because despite their picture quality, I still could notice digitizing of images when there is extremely fast movements and some ghosting with them--even with the 240hz models. Plasma is 600hz and for the price, the picture quality can't be beat.", "Date": "March 18, 2013"}, {"Title": "Love this TV", "Author": "W. Howard", "ReviewID": "R37JB4EGLXR79F", "Overall": "5.0", "Content": "Great picture, descent sound, somewhat reflective.  This was the best TV for the price at the time, and we haven't had any problems with it.", "Date": "March 16, 2013"}, {"Title": "Great when setup properly", "Author": "Jacer", "ReviewID": "R19O9RE43OTHTM", "Overall": "5.0", "Content": "The price was great and I've found that the picture quality is even better then the basic preset options if you take the time to figure out.  This TV works great with my xbox 360, ps3 and apple TV.  Make sure to buy HDMI cables and set all your devices screen savors and you should be enjoying a great picture for movies and awesome gameplay that only a plasma can deliver! The only down side is a weak sound system but really...if you buy a 50' tv you really should have a great sound system. Cheers", "Date": "March 9, 2013"}, {"Title": "Excellent overall value", "Author": "J&G", "ReviewID": "R2JK01FJLUA0NM", "Overall": "5.0", "Content": "I purchased the 60PA6500 last year for around $1000 and have been extremely pleased with it. No dead pixels, solid picture (with expert settings and \"energy saving mode\" off). Sound is only so-so, but I've got sound going through an external system so no problem there. I was so pleased with the 60 inch, I just purchased the 50PA6500 for $599 for the bedroom (not at Amazon, but only because it was $599 free ship). I mounted it using the Cheetah full motion dual arm bracket I found here on Amazon for around $69 and it's just an amazing viewing experience with it mounted about 6' up on the wall around 15' from our eyes while lying in bed (15 degrees tilted downward). I haven't even edited the Expert options yet but plan to soon- it's worth the time to do it. I'll also have to get an external system going for sound for this one. The speakers aren't awful, but not great either. All in all, very happy with the purchase.Here's the link for the Cheetah bracket. I was able to use all six screws to mount it in three studs for extra stability, but I'm pretty confident two studs would have been enough. It's very solid.Cheetah Mounts Plasma LCD Flat Screen TV Articulating Full Motion Dual Arm Wall Mount Bracket For 32-65\" Displays Up To 165LBS With 10' High Speed HDMI Cable With Ethernet Fits Up To 24\" Studs", "Date": "February 13, 2013"}, {"Title": "Best TV I ever owned", "Author": "LeeWilli2000", "ReviewID": "RCTF4MNDNJL6T", "Overall": "5.0", "Content": "Reviews led me to this TV.  After a few second guesses, I pulled the trigger on this purchase.  I'm so glad I did.  Phenominal picture quality after tuning with the settings posted here by Tanveer Chaudry (Thanks!!).  Difference was night and day from the default settings.  My XBOX pops, and blu-ray movies are simply gorgeous.  Any trepidation I had about buying my first plasma has been crushed.  This TV is worth every penny and then some.", "Date": "February 1, 2013"}, {"Title": "Beautiful HDTV", "Author": "Jorsh", "ReviewID": "R3I5XL09NIGH5K", "Overall": "5.0", "Content": "Led backlits are expensive. I could have saved up on this purchase, but I didn't. It's sleek, it's black, and it's 50 inches. Plasma isn't exactly the preferable technology, but the picture it produces is awesome.  I'm a college student. When I get a real job with my degree and I'm making a more substantial amount of money, I'll upgrade. This TV is awesome for movies and video games. Just make sure to pair it with a nice surround sound set", "Date": "December 30, 2012"}, {"Title": "Pleased with set", "Author": "The Good Doctor", "ReviewID": "R3V8FUO9SKHGB", "Overall": "5.0", "Content": "I am pleased with this set. It has met my expections. The HD is wonderful. I bought it at a good price", "Date": "December 27, 2012"}, {"Title": "Love it!!", "Author": "ajg1874", "ReviewID": "R1C7V1JYV6U1KI", "Overall": "5.0", "Content": "At first I thought I'd made a mistake changing this out for my Panasonic that I moved to the bedroom but after going on-line and getting the proper settings it really is a nice TV, especially for only $1000, stunning picture quality for sports.", "Date": "December 10, 2012"}, {"Title": "Ordering TV from Amazon", "Author": "Joan M. Meagher", "ReviewID": "R2N7S7U0HMTKG1", "Overall": "5.0", "Content": "I have to say that I was very apprehensive about purchasing a TV from Amazon ... We were quite impressed with the picture and the sound. The delivery was one day late, but only due to the fact that the holidays are here. Delivery person was very pleasant. Now the only problem is trying to get the TV mounted on the wall! Joan", "Date": "December 10, 2012"}, {"Title": "Excellent", "Author": "FO", "ReviewID": "RISU5MQRXK7N7", "Overall": "5.0", "Content": "Absolutely love the picture quality. Menus and navigation are straightforward. Everything from movies to sports to cartoons look fantastic. Integrates well with LG Blu-Ray player.", "Date": "December 6, 2012"}, {"Title": "blackest black, bright colors, any angle viewing", "Author": "Eric Wymer", "ReviewID": "R22L8AYKUW6N7X", "Overall": "5.0", "Content": "our 55 inch plasma died - love this replacement/upgrade. Quick on, plenty of inputs, and great picture. Oh - and the price wasn't bad, either.", "Date": "December 4, 2012"}, {"Title": "Great TV and great price", "Author": "Dennis Setchfield", "ReviewID": "RV8COHG8VR43Z", "Overall": "5.0", "Content": "Bought this TV a couple weeks ago and I'm very pleased with the output. Great sound and picture quality. You can't beat it for this price and not to mention about half the thickness of my 4 year old plasma. Plenty of HDMI inputs for all your components. We have the bluray, wii, xbox, and cable all hooked up via HDMI.", "Date": "August 24, 2012"}, {"Title": "Wife Approved!", "Author": "jackothedrummer", "ReviewID": "R3VSHUVT4UF9FO", "Overall": "5.0", "Content": "I purchased the LG PA6500 - 50\" TV a couple days ago from HHGregg because of their Independence Day promotions.  The wife gave the go ahead and we picked it up for $645 (open box) out the door.  This TV, when calibrated correctly, looks amazing.  The wife and I watched \"Fellowship of the Ring\" on Blu-Ray and noticed things we had never seen before on our Samsung 1080p LCD screen (model# lnt4071f).  The colors are rich and true and the 600mhz refresh rate makes actions much more fluid than they looked on my 120hz refresh rate LCD!Pros:Picture ClarityPicture QualitySlim FramePrice PointCons:No 3D (never use it)No Internet (use Blu-Ray Player to stream)Reflective Screen (my LCD was reflective, so it was not a big deal for me)", "Date": "July 5, 2012"}, {"Title": "Happy.. Very happy, BUT.....", "Author": "Family of six \"Ninjas told me so.\"", "ReviewID": "R23V5F0F77NGDZ", "Overall": "4.0", "Content": "When I bought this, I had my concerns because it is a plasma and I really wanted an LED or LCD.  I was convinced by all of the reviews to give this one a try and for the price, I could not beat it, really.  So, I recently bought this (LG 50PA6500 50-inch 1080p 600 Hz Plasma HDTV) and this is what I noticed right away:!st) Great picture quality!  I was expecting \"great\" and this did not disappoint! As a dad of four little girls I can honestly say that My Little Pony has never looked so good in our home.. Maybe, one day, I will get to watch a better show or movie than that... Maybe :)2nd) The sound quality was very good.  So many flat screens these days have some really crappy speakers. This forces consumers to buy additional audio systems.  This TV, however, has really good built in speakers.  I was very pleased with that too. My Little Pony never sounded so good.... I am noticing a theme here... ;o)3rd) the HDMI inputs and component inputs are a plenty BUT there is no input for the standard RCA cables which means I cannot hook up our Nintendo Wii to this TV. At least, I have not figured out how to yet. This in one of the reasons that I am giving only four stars. Fortunately, we don't have a My Little Pony game on the Wii otherwise, how would we get our daily dose of Rainbow Dash and her amazing areal feats?!?4th) (This only applies to videos that are not up to 1080P standards) some of the video scenes in older movies you can get a slight blur with fast moving characters.. This is not something I have noticed on any of our blue ray vids or PS3 games but there was this one scene where Flutter Shy was doing something pony related and she blurred slightly when..... You know what, for a dad, I think I know a little too much about this show.. I think it is time to get my daughters into the Die Hard series... Yeah, that's what I will do... DIE HARD!Anyhow, overall, I am very pleased with this TV BUT I will update this review should my opinions or experiences change regarding it.Uh-oh, Spike is up to his crazy antics with his pony crush Rarity and I don't want to miss this so....  DIE HARD!!!!", "Date": "December 2, 2012"}, {"Title": "just the best bedroom tv!", "Author": "MINOOKA, IL", "ReviewID": "R2W10L0N7OGB9F", "Overall": "5.0", "Content": "I love this TV in my bedroom ... auto adjusts to light levels.  Best picture of the three LG tv's i have ... the others are LED.", "Date": "January 23, 2013"}, {"Title": "Great Overall TV", "Author": "begoldn \"Ben\"", "ReviewID": "R3SP5PORL0QXUJ", "Overall": "5.0", "Content": "This TV was a great price, and a large size.  It is an amazing plasma.Pros:It is thin, sleek, and has a thin frame.  Colors are great.  Lots of inputs.Cons:It makes a slight buzzing noise, which can be heard when the volume is real quiet.  It says that in the instructions that it is expected.  Just an observation.  A kinda weird one, this is an only digital tv when it comes to audio.  Only optical or HDMI.  So if you were planning on using anything that has analogue connections, (sound), plan on getting a new system.  or a pricy converter", "Date": "November 15, 2012"}, {"Title": "good item for those who only need a tv", "Author": "Amazon Customer", "ReviewID": "R10YOKAHP00YKA", "Overall": "5.0", "Content": "thanks to the tv low price guarantee this was a great deal for someone who only needed a good looking tv, i already have all the smart apps i need through other devices so i was looking for the best deal on a good looking tv and this was it, i used the calibration listed in a comment above and so far i love everything about it.", "Date": "September 5, 2012"}, {"Title": "Limited Antenna Viewing options", "Author": "northfront", "ReviewID": "R15UXO5PP0QLNA", "Overall": "3.0", "Content": "LG 60PA6500 60-Inch 1080p 600Hz Plasma HDTV:  The second TV delivered arrived intact. (Pilot took the first back with no hesitation after seeing the broken screen, Amazon sent a replacement out the same day that arrived 3 days later)  I hooked the LG up to replace a Samsung 50\" Plasma FP-T5084 that died after 4 and 1/2 years of light use.  I do not have cable TV and receive my programing from and off the air antenna.1)  The first thing I noticed is the LG only received 28 channels vs Samsung received 36 channels of local broadcasting.  (I used the same Antenna and RF cable for the LG that I used for the Samsung )2) The second thing I noticed is when a picture ratio on the LG was set - it was set for ALL the channels (not for just the one channel like the Samsung) so the channels that were broadcast in widescreen 4:3 had to be adjusted every time I went to that channel, and when I went back to the widescreen broadcast I had to readjust the ratio the LG for 16:9 again (about 5 various button pushes for changing the ratio each time - and quite annoying).3) The thing that made me send the LG back to Amazon was the TV would drop the picture ratio and return to 16:9 in the middle of a 4:3 broadcast.  The first time I thought it must have been something I did with the remote - but it continued to do it even when the remote was out of sight of the LG TV. Probably a defect in just this one TV, I can not imagine this being a feature.  Pros:1) Good picture quality at 1080i from local broadcasts and BluRay.2) The AV input (on second Component input) accepted my security camera picture.3) Great looking frame.4) Back inputs on left edge instead of middle of TV - easier to reach (but had to buy longer cables than I was using with the Samsung)  Cons:1) Weak off the air tuner.2) NO picture ratio settings for each channel.3) Multiple various button pushes changing screen ratios from one channel to another.4) Multiple various button pushes to change from one input to another.5) Set got hot on right rear (but not as hot as the Samsung).6) Picture quality at 720i and 480i was not as good as the now dead Samsung (in my opinion).7) Remote must be aimed at the left side of the screen to operate (not just general direction of TV like the Samsung).8) The screen is much more reflective than the Samsung.9) Must play with picture settings to get acceptable picture - not just a preset setting right out of the box.  This review is just for those who use an antenna for programs - cable should be quite different (and it is a shame I am comparing this TV to a prematurely dead TV)  Not Sure what I will get to replace this one, but I hope it will not be as annoying as this TV.", "Date": "August 24, 2012"}, {"Title": "Quality of Picture Less than Expected", "Author": "Dale V.", "ReviewID": "R2NMNJONJ8RW8I", "Overall": "3.0", "Content": "After setting the TV up and attempting many different adjustments, I am disappointed in the overall quality and brightness of the picture.  I have a 60 inch LG and am well satisfied with the quality of its picture, but this 50 inch does not project the same quality.  Depending on the programming, the colors can seem dull and lifeless and the overall picture could be brighter.  I tried numerous adjustments to improve the image, but so far have not been successful.  If anyone has suggestions regarding adjustments to improve the image, your input would be welcomed.", "Date": "May 18, 2012"}, {"Title": "TV is junk", "Author": "Brett Greenough", "ReviewID": "R6WJ5C3WX2VQ", "Overall": "1.0", "Content": "The picture went out in a little under 2 years with only the sound working.  I took the tv to get repaired and it will cost $685 to replace the picture.  Please don't consider purchasing this tv considering the issues with the picture going out.  I'm not going to hassle with LG since others haven't had any luck with them.  The tv will become very useful for target practice in the spring!", "Date": "February 8, 2014"}, {"Title": "Just over 1 yr old and it broke! These TV's have known issues. I would never buy it again.", "Author": "MOnika neri", "ReviewID": "R3Q9LLBSJZHE7Z", "Overall": "1.0", "Content": "This TV is just over 1 yr old and has less than 100 hours on it!I was watching the TV and the TV turned itself off. When I tried to turn it back on the relay clicked and the TV didn't come on.The relay continued to click but the picture never came back. What a waste of money!!!!!!!!!This is a known issue by LGI also had to drive 1.5 hours to pic up the TV from the shipper who was supposed to deliver to my door.\"Tuesday, February 12, 2013Repair Journal | LG 50PA6500LG 50PA6500-UA.AUS | 50\" PlasmaSYMPTOMS: Relay clicks, but the set will not power on.DIAGNOSTICS: This is a power supply issue and is a common problem with this model, as reported by LG. If you are having this issue and your TV is less than a year old, please contact LG's warranty department right away and get this fixed for free.SOLUTION: Either A) Get the board replaced I/W via LG or B) Swap out the PSU yourself.\"08/09/2013: I called LG and talked with a nice guy in Panama. He extended my warranty (it was expired by less than 2 months) and within 4 days I had a working TV again. A TV repairman showed up to my door and fixed the issue at my house with new parts from the manufacturer. I'm glad LG decided to fix this problem. I'm still not sure if I would by this TV again though. I wonder if they would have covered the same issues in say 6 more months.", "Date": "August 5, 2013"}, {"Title": "5th times a charm", "Author": "John B", "ReviewID": "R1B4C36SG9ZPEJ", "Overall": "5.0", "Content": "I bought 4 HDTV's until I found this one and I love it. I was looking for the \"wow\" factor that some better brands have and this one delivers. It looks like you can reach into the TV it's that clear. I never thought I would like a plasma but this is great for sports... well it's great for everything but the 600mhz takes away the annoying blur that I was getting with the LCD's I tried. I was afraid of the heat but it's just as hot as the other TV's I tried. I love how thin the bezel is and how thin the overall TV is. This TV is the best.", "Date": "March 23, 2013"}, {"Title": "GOOD TV", "Author": "bossmansboss", "ReviewID": "R2CLSN6L49563X", "Overall": "5.0", "Content": "VERY GOOD TV FOR THE PRICE----BOUGHT IT ON SALE FOR A LITTLE OVER 800.00 ----IT WOULD BE HARD TO BEAT FOR THIS PRICE", "Date": "February 28, 2013"}, {"Title": "LG tv", "Author": "neva smith", "ReviewID": "R3LIO52UF6RTJG", "Overall": "5.0", "Content": "The tv is excellent!. Excellent color.  Contacted LG about a problem and they are taking care of it.  Good tv", "Date": "January 4, 2013"}, {"Title": "Happy Hubby!", "Author": "Jessica Johnson", "ReviewID": "R35PDMZ5MTKZNT", "Overall": "5.0", "Content": "My husband is very pleased with this awesome t.v. It's his new \"baby\".lol Great picture quality...great for gamers like my hubby!", "Date": "December 26, 2012"}, {"Title": "Great Value", "Author": "Scott", "ReviewID": "R3DMJ5DTYSCCA5", "Overall": "5.0", "Content": "I bought this as a replacement for an original plasma that died. I am very impressed by the picture quality and the overall look of the tv. It is sleek and made of nice materials and looks very good on a wall. The main selling point was an LG tv for a lower price than some of the off brand companies. I am glad I made this choice.", "Date": "December 13, 2012"}, {"Title": "Great TV", "Author": "Martin H. Moore", "ReviewID": "RYJOOGS98GF1Y", "Overall": "4.0", "Content": "Right price, fast service and easy to hook up. No problems since it has arrived. Very easy to set up and use.", "Date": "December 10, 2012"}, {"Title": "Great, Quality TV", "Author": "Eric Smith", "ReviewID": "R3TMF7FZGVJ5WD", "Overall": "4.0", "Content": "Just a fantastic great TV. Nothing special but a great simple tv for the price. Worth buying If your not looking for anything special, but looking for a quality larger TV", "Date": "December 2, 2012"}, {"Title": "Was REALLY worried at first .", "Author": "donchevin", "ReviewID": "R8RCFPHPQ6BCA", "Overall": "4.0", "Content": "The TV arrived in perfect condition.  Once I set it up to look at the picture i could not believe my eyes.  It was dark and cloudy it looked like i was watching the TV with sunglasses on. I went on-line to see if anyone else had the same issues and after reading some similar reviews I came across one that offered some setting advice..  .I followed their calibrations and the picture was great and i was relieved..  Great skin tones, accurate colors.  I could not ask for more for $599.00.  Would have given it 5 stars had the picture been better right out of the box..", "Date": "November 23, 2012"}, {"Title": "Awesome picture", "Author": "Bob S", "ReviewID": "R3OMOV3EGQVEGT", "Overall": "5.0", "Content": "This set replaced a 65 Mitsubishi rear projection. The plasma is really easy to watch. Great features, plenty of hdmi inputs.", "Date": "October 31, 2012"}, {"Title": "Good picture great price but mine broke after two months of use.", "Author": "janelle", "ReviewID": "R3F6ET7VYNAS4O", "Overall": "2.0", "Content": "I really enjoyed the size and picture quality of this TV for games and movies. But after two months of use I had to call LG customer service concerning the picture disappearing and failing to reappear. I have a power indicator light but when the units power button is pushed no picture appears. LG assured me that the repair would be at no cost and be completed in two weeks. We will see.", "Date": "August 13, 2012"}, {"Title": "Sound is great except when I play DVD/BluRay", "Author": "J. Dubose", "ReviewID": "R2GYIM08LV46A5", "Overall": "5.0", "Content": "Ok, this T.V Rocks in Colors, anti glare, 3 , million to 1 ratio, features, etc. I just have one problem. And it may be I'm not doing what the T,V, calls for in SOUND. When listening to from my cable box (sound speakers are located on the back of the T.V.) But not an issue when connected to the cable box. But when I play a DVD/Blu Ray the sound is horrible!!! I don't know if it's because I play my DVD's on my PS3 or what. I bought the best LG sound Bar and it did nothing for DVD movies for the sound??? My wife bought a DVD . Blu-Ray player (Not LG) and it still sounded horrible. Everyone rates this sound bar 5 stars?? So I returned the DVD player and Sound bar. Can someone please help me??? Why is there 99% positive feedback on the T.V. and the sound bar, except for me??? But not using the DVD via PS3 player the sound is AMAZING. Help please... I must be doing something wrong.. Any tech's out there??? Beside that the sound playing a DVD/Blu-Ray stinks, Everything else is the BOMB DIGGITY!!! HELP!!!!", "Date": "February 23, 2013"}, {"Title": "LOVE IT", "Author": "Maricruz", "ReviewID": "R18P974AFGRC3Z", "Overall": "5.0", "Content": "Great deal for the price. Box was in great shape, and securely packaged. No damage and TV has beautiful picture and sound. LOVE IT", "Date": "December 23, 2012"}, {"Title": "Very Nice!", "Author": "Troyus", "ReviewID": "R2UR1AKIUP4FR3", "Overall": "4.0", "Content": "Great TV, nice resolution, good color, great for a Plasma. My only complaint would be.. SOOOOO many settings for configuration... Also first one shipped had a broken screen, apparently these TVs are known for it so be careful! Amazon did right by me though and sent another out. Satisfied.", "Date": "December 17, 2012"}, {"Title": "My big 60 inch...TV", "Author": "breadpitt", "ReviewID": "R2BI98TKGK75W9", "Overall": "4.0", "Content": "This TV is so amazing! The price is unbeatable. I cannot think of any negatives...yet other than the pictures sometimes disappear when I am flipping through HD channels but I think my HDMI cable is just old so I will try to get a new one and see. Also, I read some bad reviews here on their delivery. Mine was CEVA, They were great, the guys unwrapped my TV, installed and hooked the TV to the cable box and mine was read to use.", "Date": "September 8, 2012"}, {"Title": "Heavier than the others", "Author": "Gadget Gizmo Freak \"Gadgetfreak\"", "ReviewID": "R1ODDDLXCWS1QF", "Overall": "4.0", "Content": "The 60\" model is about 80 lbs without the base. The base is 10lbs. The pivot that attaches the TV to the base does not seem very strong. My TV was actually tiliting to one side and had to fudge the play factor a bit to align the TV.The TV is fine. The \"tru-slim\" frame is not really true slim since the picture does not start at the edge.Pros:1. Low price2. Fairly decent picture3. Feels very similar to CRT TVs!4. Built-in speaker is decent unlike the speakers of most new super thin LED tvs.5. Sensor which detects room light and adjusts brightness accordingly.6. Good number of inputs. 3 HDMI, 2 component (1 shared with AV), VGA.Cons:1. Smooth motion is not really smooth. There is no menu setting to turn any smooth motion on and off. So its pretty much always off.2. Heavy. About 10 lbs more than panasonic. About 25 lbs more than a similar sized LED/LCD.3. Reflective screen which would be a problem if windows are directly opposite the screen. I have mine on the side and its not a problem.4. Possible screen burn-in issues? I tried to be safe and got the burn-in DVD off the net and used it for 100 hours in the first week. Its supposed to make burn in less of an issue.", "Date": "February 26, 2013"}, {"Title": "Died in 6 Months", "Author": "J. Lee \"jblee562\"", "ReviewID": "R3AE3QOSGH59PV", "Overall": "1.0", "Content": "Bought it in June and died in January...LG came and tried to fix it but now the whole front panel has to be replaced. I was told by LG to wait for the part and if the part doesn't arrive in 14 business days I can return it back to LG. That means I'm going to miss the Super Bowl. Either I have a bad luck or LG suck big time.", "Date": "January 30, 2013"}, {"Title": "Great Service...Unexpected Product", "Author": "Daddy Sax", "ReviewID": "R1RO59GSWKEESR", "Overall": "4.0", "Content": "I was very pleased with the delivery of my Plasma TV but was not satisfied with the TV itself.  Was unaware that Plasma TV reflected against lighting...my Man Cave faces the West and after the noon day has passed a lot of light comes in and my TV screen reflects all of it.  The only time that I can really enjoy it is at night time.  Very disappointed in that part...otherwise the pic is great!!", "Date": "June 18, 2012"}, {"Title": "Love this TV!", "Author": "Alicia M.", "ReviewID": "R2OVSL4YZS3IDM", "Overall": "5.0", "Content": "We have been redoing our home and decided to upgrade from our 55' projection TV to a wall-mountable 60' plasma flat screen. I did a lot of research online as to the different aspects of plasma vs LED. For our purpose, the plasma was the better choice. This TV is absolutely awesome!! I have always had great luck with LG products and this is no exception!", "Date": "May 12, 2012"}, {"Title": "Flicker-tastic", "Author": "Amazon Customer", "ReviewID": "R30AXB9BM9UAJ2", "Overall": "2.0", "Content": "I just dropped this off to ship back to Amazon.  I bought it to replace a 37\" LCD TV on the wall, attached to my office PC.  I have sharp eyesight- DLP TVs and Projectors drive me nuts.  I have a similar problem with this TV.  I'm driving it at max refresh rate, and I still see a blatant flickering of the screen.  I didn't realize this could be a problem with these Plasmas.  I've gone through tweaking it with the Disney WoW Bluray tweaking disc, and played with all the settings.  I've got the brightness down, but the flicker was still too much.  It's also crazy reflective.  There are windows on the far side of the room, and I've never had a problem with reflection before.  But this TV blasts the window reflection like a mirror.  On the good side, the blacks are really dark, the color production is excellent, and action movie scenes are very good.So, in summary, if you have any sensitivity to flicker, stay away.  If the TV is targeted for a location directly across from any windows, stay away.  For other purposes, meh, give it a try.", "Date": "July 20, 2012"}, {"Title": "Big screen..Big dissapointment", "Author": "kay stevens \"novascotialandry\"", "ReviewID": "R25P3X04C9JZ6P", "Overall": "2.0", "Content": "Everything about this tv is great except the picture quality. We tried everything we could to tweak it and nothing improved the screen vision.So we had to return this LG but I have to say that Amazon made the return extremely easy and no fuss.", "Date": "October 22, 2012"}, {"Title": "great", "Author": "Cynthia Szuch", "ReviewID": "RJ18FYAKE7HL4", "Overall": "5.0", "Content": "Great TV love it!  It's all that I expected! really eleven more words required for a a review of a product?", "Date": "December 27, 2012"}, {"Title": "parts", "Author": "marc dautricourt", "ReviewID": "R3FFJZMJ1TKBDZ", "Overall": "4.0", "Content": "the TV and stand are in perfect shape.  however the TV was missing most of its parts.  important parts like the remote control and screws that attach the TV to the stand.  what's up with that?", "Date": "December 26, 2012"}, {"Title": "Turns off whenever there is a bright flash on the screen", "Author": "Amazon Customer", "ReviewID": "R3FS0STNRATZ0U", "Overall": "1.0", "Content": "I noticed that the TV would turn off occasionally and at first I thought I may have bumped the remote.  It would not turn itself off very often, it could be anywhere from once a week to once a month.  After a couple months I noticed it would turn off while playing a particular Xbox game but other games were fine.  Finally, I played a game that featured a storm with lightning in the background and every time the screen would light up the TV would turn off.  I called LG and they scheduled 3rd party repair service.  Repair service replaced part and I tried the game again and the TV stayed on.  A day later while watching TV the TV turned itself off again. This time I was watching a program from my DVR so I hit rewind and noticed there had been a commercial with lightning (bright flash) that triggered the TV to turn off.  Every time I rewound the commercial and let it play the TV would turn off at the exact same time.  Since then it has turned itself off a couple more times.  I have to call the repair service and have them back out again.***UPDATE***  They have been out 3 times and replaced about everything except power supply and it still turns off by itself.  LG has been good about sending them out to fix it but the techs are stumped (I can replicate the problem and they told me it is very unusual).  Waiting for them to actually get it fixed, maybe the 4th time is the charm.", "Date": "March 22, 2013"}, {"Title": "red line display", "Author": "Albert Pimentel", "ReviewID": "R3QASM73CI6VJ8", "Overall": "1.0", "Content": "so disappointed with the tv because of the red line display. i had it serviced 3 times already and i was told the soldered parts were loose. i got it back the other and so far no problem has been experienced. i will not purchase this tv again.", "Date": "February 18, 2013"}, {"Title": "Not really impressed", "Author": "JP", "ReviewID": "R3B60JVPSC8DQP", "Overall": "3.0", "Content": "I bought the 60PA6500.First thing I noticed, it took a few minutes after powered it on for the first time, then the image improved.I also own a Sony Bravia 46EX500 since 2 years.So first time with plasma and with 60 inches.I'm a bit disappointed by :- I use the TV plugged to my computer via HDMI, and I noticed that the characters (text) is fuzzy so I guess everything is little fuzzy ...- 60 inches is nice but because of it :-- when the content is not in 1080p or lacking in quality, image \"noise\" is more visible-- the center of screen is slightly higher so personally I wish I would have an adjustable stand- reflection/mirror effectI'm thinking about returning it for a 55 inches of superior quality for the same price ...But I might keep it too, it's still a good deal for the price.Finally, this TV has been reviewed by professionals (3/5 stars on digitalversus)", "Date": "December 22, 2012"}, {"Title": "Very good TV at a great price", "Author": "Chris", "ReviewID": "R38Q6Q9EKXST7M", "Overall": "4.0", "Content": "Would recommend this purchase. But do not expect very good sound (this could be said of most of these tv's with a small bezel).", "Date": "May 20, 2012"}, {"Title": "NOT HAPPY WITH LG", "Author": "Dig26", "ReviewID": "RK56EBVO3ER79", "Overall": "1.0", "Content": "What a piece of crap this TV is.  I get motion noise (floating pixels with motion) like crazy and some pixels have turned red. One time I had giant thick black lines going down the display.  I've had to have the TV replaced twice already.  It has broken again (messed up pixels) and LG is busting my chops about replacing the TV again even though the TV is not even 6 months old!! Are you kidding?!  Never again will I buy LG.  The product SUCKS and the customer service is even worse.", "Date": "September 11, 2012"}, {"Title": "60 inch LG", "Author": "steve", "ReviewID": "RJKRANZ5UVI6Y", "Overall": "4.0", "Content": "sound is a little Tinny , even after setting the controls to higher levels in bass and lower levels in treble..picture is great from ALL angles.as for a SMART TV .. well that is not to smart.. YOU HAVE TO GO INTO MENU EVERY TIME YOU WANT TO SWITCH FROM DVD TO SAT / CABLE, I HAVE A cheap TV FROM WALLY WORLD AND DROPPING IN A DVD IT FLIPS RIGHT TO IT .. THIS ONE I HAVE TO GO MENU ARROW OVER DROP DOWN SELECT ARROW OVER TO DVD HIT SELECT AGAIN SELECT OK AND now CAN WATCH THE MOVIE.. smart WELL NOT TO MUCH THERE .. BUT AS AN OVER ALL I DID GOOD PICKING THIS ONE FROM ALL OUT THERE .. HAPPY WITH IT..", "Date": "September 20, 2012"}, {"Title": "Disappointed", "Author": "Janet Vessels", "ReviewID": "R17R3WIFUYZ64L", "Overall": "3.0", "Content": "I was disappointed in the tv. The picture isn't as sharp as I think it should be, especially considering price and manufacturer.", "Date": "November 25, 2012"}, {"Title": "Just average", "Author": "steve sullivan", "ReviewID": "R25ZRVF6H8ODK8", "Overall": "3.0", "Content": "I had my tv for 6 days and it already has a broken pixel it's stuck red But goes on and off so I know something is wrong", "Date": "March 26, 2012"}, {"Title": "Awesome tv all around", "Author": "Mattdr", "ReviewID": "R1T5Z8F2QL3EAY", "Overall": "5.0", "Content": "This tv is amazing for the price! 600 hz and it's amazing, 3d is mind blowing only downside is the sound. I recommend a sound bar. The lg sound bar with wireless subwoofer will complete this package. Also the apps are on par but need more choices. In all it's a really really great tv for the price highly recommend!!", "Date": "August 15, 2012"}, {"Title": "Poor performance", "Author": "MJ", "ReviewID": "R2E6DXBW36OC2U", "Overall": "2.0", "Content": "First time I have tried a plasma tv....and am very disappointed....with the performanceToo much glareCannot see well during the daytv is only meant to be seen straight on....if you see at an angle, you get all kinds of reflection, even at nightwould like to return and get a refund.....and go back to using a LCD or LED TV", "Date": "November 1, 2012"}, {"Title": "great tv", "Author": "A. FUENTES", "ReviewID": "R1T4B8IW4XHJGR", "Overall": "5.0", "Content": "if you looking for a tv cheap and big look no further this is it. i purchase this tv and i just set it up myself it is huge and beautiful i bought it  mainly to play games not first person shooters more like silent hill downpour wich is coming out tuesday i cannot wait for it.", "Date": "March 10, 2012"}, {"Title": "Unreliable - mine broke after 2.1 years", "Author": "Berkies \"Grandson of Sam\"", "ReviewID": "R3NPZZCQ5ZHZHK", "Overall": "1.0", "Content": "Thought I'd share this, because these problems are typically rampant throughout certain companies and their products.  My 50PK750 TV broke after 2.1 years. Called company, talked up the chain all the way to supervisor. They would not budge in any way to help except giving me part numbers should I plan to fix it. I guess their products are not expected to last beyond 1 year. Never again.There are two types of electronics companies.  The one type like Sony, Pioneer and Intel test their products rigorously to ensure extreme reliability over an industry standard of 7 years.  And in the very unlikely case where items break through no fault of the owner, they respond in kind by fixing or replacing at any time beyond warranty under their discretion.  Then there are companies like LG and Onkyo, who treat customers like a bad disease after 1 year.  No thanks.", "Date": "November 25, 2012"}, {"Title": "Promise Broken", "Author": "Gaines E. Bruce", "ReviewID": "R3BB8NDWRUNTPD", "Overall": "1.0", "Content": "bought one of these through Sam's club a couple of years ago. I now have two vertical lines running down the middle of the screen. I will not be replacing it with another LG product.", "Date": "June 5, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "LG 60PA6500 60-Inch 1080p 600Hz Plasma HDTV (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/31VZEXO1NrL._SX300_.jpg", "ProductID": "B006VFS4J2"}}