{"Reviews": [{"Title": "Great TV for $250", "Author": "videotechie", "ReviewID": "R37UE1G802KNTA", "Overall": "5.0", "Content": "Bought this as a second set for our guest bedroom - my Mom often comes to visit and complained the last few times the TV I had in the room was crap.Was a bit skeptical for the price and an unknown brand. Turns out this is great TV - decent picture, easy to set up, plenty of connections , sound is OK.I have it wired to a regular DirecTV box (not HD) and use a mode in the TV to fill the screen - looks OK - not too grainy and plenty bright. Also have an antenna hooked up - off-air HD looks just fine. Finally - hooked a PC up to it so my Mom can check her email etc. Same story - worked OK and looks fine.Amazon free shipping and no sales tax was the deal maker for me. Buying the same set in the local K-Mart would have cost at least $100 more.If you need an inexpensive (I changed my tune from cheap - this does not perform like a cheap TV) TV don't overlook this set, or other Haier products. If it was made in the USA it been an even better deal...but as-is I'd buy it again.", "Date": "July 17, 2011"}, {"Title": "Good TV, Warranty is shorter than described.", "Author": "Barry \"BSaltzman\"", "ReviewID": "R3VIWJA6W1FKYL", "Overall": "5.0", "Content": "The online description says that the warranty is one year parts and labor.  However, the manual that comes with the TV says the warranty is for 1 year parts and 90 days for labor.  I hope it does not become an issue.  The box also has the 1yr/90 days.  The TV is very nice and has enough resolution to make a great computer monitor if I need that in the future.  I maximized the bass and cut the treble down a bit to eliminate the \"tinny\" sound that is the default.", "Date": "September 16, 2011"}, {"Title": "Not recognized by DirectTV", "Author": "Serious", "ReviewID": "R2BMRNG0BVW0PZ", "Overall": "3.0", "Content": "We learned from the technician during installation that Haier is not recognized by DirectTV ( and maybe other services), and this means that the remote for channels cannot be programmed  with the Haier.  The consumer must use two remotes to operate the set.  The Haier remote turns in on and off and volume.  Then the DirectTV remote must be used to select channels.  Both DirectTv and Haier Consumer services said they could do nothing about this.  It is a real inconvenience, and it is most unfortunate that we did not know about it before making the purchase.  So---if any consumer prefers to use only one remote, be sure your service recognizes Haier.", "Date": "July 27, 2012"}, {"Title": "Great TV For A Bedroom", "Author": "Broke Mexican", "ReviewID": "R2ITLWECQ20Q1N", "Overall": "5.0", "Content": "Paid $160 for this TV.I have had it for about a month with no issues. The TV Tuner has Q-CAM which will pick up a lot of digital channels from a regular cable input. XBOX looks great with HDMI at 1080p. Hooking it up to a laptop was easy. Just a great standard TV.The one thing that does suck is the remote. For whatever reason it has a slow response time towards the television.", "Date": "September 24, 2011"}, {"Title": "Haier brand", "Author": "draco", "ReviewID": "R2NOBQQABACOWY", "Overall": "1.0", "Content": "I do not recommend Haier brand -- ever.  I had my Haier LCD TV set up and running after I received my bluray and cable.  1 week and 1 day later, it broke.  At first Haier was very helpful and put me in contact with a local company to figure if it could be fixed or should be exchanged.  That company said the parts would be back ordered and would take a very long time to arrive.  They talked to Haier and they told me Haier had agreed to exchange my TV.  I was instructed to call Haier and would get instructions at that time.  I called Haier and was told \"upper management\" had not yet authorized the exchange.  A request for authorization was submitted andI was told they would call me later that day or the next day.  They didn't call me. So, the day after the \"next day\" I called them and was told \"upper management still had not authorized the exchange.", "Date": "February 7, 2012"}, {"Title": "Did not last, no convenient warranty centers", "Author": "terri", "ReviewID": "R41FWPKEZSO8G", "Overall": "1.0", "Content": "I purchased this TV for a seldom used room, and I purchased it specifically for the low price because it would seldom be used.  It was broken within 9 months, and had most likely only been used 20 times in those 9 months.  Because it is only 32 inches, I had to carry the tv in for warranty repair, to a Haier authorized center.  I live in Tampa, FL, which is a really big city... really really big.  There was not one authorized center in all of TAMPA!  My choices were to drive 30 miles to St. Pete or 50 miles to Zepherhills.  Since I had to go round trip twice, that's 120 miles.  And the \"authorized\" center has now had the TV for over 3 weeks and I don't have it back yet.  My best recommendation is please make sure there is a good authorized repair center closer to your home, because you will most likely need it.  If they don't have them in Tampa, you may have to drive a long way to get it fixed.  Other than that, the picture was good and the sound was fine while it lasted.this is an update to the above.  It has now been almost 6 weeks and I am still waiting. They have decided NOT to fix the TV, it is too expensive, so they are deciding whether or not to replace it.  Since it is under warranty, I am not sure what decision they are trying to make, but whatever.  What is interesting to me, is Haier told me I may need to return the TV, which, if you read the above, is at the repair shop they told me to take it to which is 30 miles away, or 60 miles round trip.  Since they are paying for the return #a good thing#, I am looking forward to  seeing if I actually have to go get it or if they will allow the shop to return it.This is another update to the review - it is now January 14 and I just now received my replacement TV.  Almost 4 months after taking it in for repair.  If this is going to be a main TV in your home, please think about it hard.  Everytime I called Haier about the repair they indicated everything was moving ahead as it should, so this was not an unusual occurance for them. And, by the way, I did have to go back to the shop to get the labels off the TV, the shop could not send them in for me.Another update!  This is now September 29, have had the replacement TV about 9 months - just like the first one - guess what!  It just went out.  It is in the process of turning itself off and on now.  This TV was used just like the one above, very seldom, maybe 10 times, if that, in 9 months.  I took the battery out of the remote just in case it was going bad and sending out off/on signals, but that did no good.  Since this is a replacement, I am almost sure the warranty will not cover it again, and I don't know that I want to go through all that again anyway.  Time to buy a new brand.  To anyone that buys one of these, best wishes to you.  I'm done with them.", "Date": "October 19, 2012"}, {"Title": "Went bad after 4 months, Customer Service is a nightmare", "Author": "Matt", "ReviewID": "RDSIBA3O9IHSJ", "Overall": "1.0", "Content": "Stopped showing a picture upon trying to turn it on one day. TV was lightly used and not around kids/pets.After playing games trying to find a warranty center in range, they sent me a form to fill out and requested a sticker from the TV. I mailed them the only sticker that matched their description... apparently, it wasn't the right sticker, and they \"tried to call me, but didn't leave a voicemail.\" - no missed call on my phone, so that was a bold-faced lie. After sending them another piece of mail with the other sticker, and calling them 2 weeks later, they said everything was fine and to call back in a few days for a tracking number. I called them back a week and a half later, and still no tracking number, but \"sometimes they send them without tracking numbers...\" I'm not holding my breath.TV was an okay budget TV until it went bad - gaming was a bit laggy, and sound is mediocre at best, which is to be expected. Would say 3-4 stars if it hadn't died, but with the record of failures and abysmal customer service, I'd stay FAR FAR away.", "Date": "February 5, 2013"}, {"Title": "Blah", "Author": "Cameron", "ReviewID": "RYLS09F7D88NX", "Overall": "2.0", "Content": "Decent tv picture is good, but once you get into the Hd channels it lags on the blue screen until it decides to pop up the picture, which could take upwards of a min or over. very annoying!!! my only complaint", "Date": "December 27, 2012"}, {"Title": "best tv for the money", "Author": "shockwave", "ReviewID": "R39K3JONGZAWIW", "Overall": "5.0", "Content": "This turned out to be a great tv for college.  The best yet for the money.  Would like to get another for the same cost for other daughter in college", "Date": "October 10, 2011"}, {"Title": "What a great deal", "Author": "Victoria DeMercer", "ReviewID": "RZVSNDU3HF0P8", "Overall": "5.0", "Content": "I did my research & got this as a gift for husband for Christmas 2011. After a year, the picture & sound are still crisp & clear. It's also really hard to find a 1080p TV in this size for such a great price.", "Date": "January 11, 2013"}, {"Title": "The Great Haier", "Author": "rollon43 \"Ernie\"", "ReviewID": "R2Z84R2TGDDWYC", "Overall": "5.0", "Content": "This LCD is as great as my plasma and it has one thing that my plasma does not,I can hook it up to my pc and that`s a big extra.Thanks HAIER!", "Date": "July 28, 2012"}, {"Title": "Great product", "Author": "mblaid", "ReviewID": "R33TCCB21JMB8V", "Overall": "5.0", "Content": "It is really light easy to move around and durable. Bought it for my room in college, well worth the price. It has all the ports on the back of it to hook up things like your video game system and HDMI.", "Date": "February 27, 2012"}, {"Title": "Haier 32\" LCD TV broken after 3 weeks", "Author": "mike", "ReviewID": "R320A16BW5QYQV", "Overall": "2.0", "Content": "After 3 weeks, my TV didn't work. The screen is black but the power button is always on. It didn't response to remote control anymore. It is dead.", "Date": "December 16, 2012"}, {"Title": "Good for the price", "Author": "Deana M. Dubey \"Vampy1976\"", "ReviewID": "RI9VGPKGY85KL", "Overall": "5.0", "Content": "I bought this TV for my son's 14th birthday. He has a spare room at my Mom's house and I thought this was a great size. Super easy to set up and get the Uverse universal remote configured to it. Crystal clear picture, the sound is fine - really NO complaints...especially for the price. Of course this is a \"no name\" brand, but I've had great luck with no-names. Got my Mom a Hanspree from Newegg for Christmas 2 years ago and that too works great! Don't pass it up because it's not a Sony, LG, etc.!", "Date": "November 2, 2011"}, {"Title": "Dead on arrival (no stars should be a choice)", "Author": "Ken", "ReviewID": "R10JWG7JTI36YQ", "Overall": "1.0", "Content": "I bought one from a local retailer tonight, hauled it home, opened it up, plugged it in, and found the only thing that works is the power/standby LED when toggled by the button. No picture, not even for source or menu; no sound. Even the remote doesn't work to cycle the power; one cell is at 1.5V, the other provided with the unit measures -0.02V with a digital multimeter. Back into the box and back to the store tomorrow. Buyer beware.", "Date": "October 3, 2013"}, {"Title": "It works, but it's the worst TV I own", "Author": "R. Trejo", "ReviewID": "R1AZVNXQ0X855O", "Overall": "3.0", "Content": "Complaint 1 is it's not listed in DirecTV to program my DirecTV remote, so I have to have two remotes out to change the volume and turn it on and off.  I did not take a star off for this because that is a joint problem with DirecTV and myself for buying an off brand TV - one of the problems with buying an off-brand TV.Problem 2 is the grainy picture.  I've tried it with multiple boxes in multiple locations and it's always the same grainy picture - pretty crummy.  Yes, I played with all the settings.  It's the \"kids TV\" so it doesn't bother me, but definitely worth pointing out.Problem 3 is the tinny sound from the speakers - it was a cheap TV so you get what you pay for.If not for the cheap price, this would have been a 2 star review.", "Date": "February 22, 2013"}, {"Title": "Haier L24B 1180 23.6 inch 1080p 60Hz LCD HD TV(Black)", "Author": "Roisin Seatle", "ReviewID": "R1NW5SW4WGZI3K", "Overall": "5.0", "Content": "I bought this TV for my 95 year old Mom, whose third convertor box failed. So Mom has joined the 21st century, with a TV that works well. It's a great size for her small apartment too.", "Date": "November 29, 2012"}, {"Title": "Good price good picture", "Author": "Patrick Kennedy", "ReviewID": "R1TFXAD1LTUSVP", "Overall": "4.0", "Content": "Plug and play this is quite a deal considering in 1983 I bought a 27 inch television for $1100.  It fit right on my existing wall mount and had it going as soon as I hooked up the cable and put the batteries in the remote.  4 screws, one 7/16 wrench for the cable.  One drawback is that the High Def channels seem to filter slowly through the tuner.  Even regular Def looks good and hooking a computer 2.1 sound system for $40, I have a mini-theater in my Kitchen.", "Date": "December 31, 2011"}, {"Title": "Haier is Chinese for bad customer service!", "Author": "Michael Mcdonald", "ReviewID": "R2XA2WQTBPQC8O", "Overall": "1.0", "Content": "Bought a HAIER TV in 2011- and the the component input never worked. Lived with that for a while then decided to use the \"Warranty\" (Warranty is Chinese for \"Yeah right-- sucker!!!\") Sept. 2012.The repair center (repair center is Chinese for \"fake storefront that is never open\") was closed when I tried to take the TV in during business hours. They told me they would come pick up the tv twice and neglected to at all over 5 weeks (We haven't had anyone in that neighbourhood they said...). I had to re-register my repair twice and still no show. So I called Haier again who arranged for a replacement. 3 weeks later I'm told that they are out of that TV and I can wait till they make some new ones or, just get a full refund. I opted for the refund because in the meantime, this TV completely quit working.It is now January 16th and no sign of a cheque. I've been told 3 times that it will be there soon- they only cut checks once / month so it can take up to 35 days to receive it. They have had to re-order the check to be cut twice because of \"oversight\".This product is Garbage and their warranty is useless.It is not worth it to try it out- Google HAIER WARRANTY issues and see that it is their company policy to lie, deceive and attempt to wear down their customers legitimate warranty claims in order to avoid the responsibility (a word which has no equivalent modern chinese translation, apparantly...)", "Date": "January 16, 2013"}, {"Title": "It works", "Author": "Walter S Muszynski \"Scurvy\"", "ReviewID": "R12DEPJCCTKXXN", "Overall": "3.0", "Content": "It has 3 dead pixels and is a little bit lopsided with the stand but it at least works compared to our old Vizio that gave us nothing but problems. I will update the review if it dies in a month or not.", "Date": "September 23, 2011"}, {"Title": "Good TV for bedroom or kids room", "Author": "Beagles01", "ReviewID": "R1NSM9YCCT134H", "Overall": "4.0", "Content": "We bought this model last year at Christmas for our daughters room.  She's under 10 and uses it mainly to watch dvds and some tv.  We got it for around 175 I believe so it was an awesome deal.  I will say my expectations were low due to the price point and a brand I wasnt unaware of...but its performed well and we've had zero issues with it.  The speakers aren't great but my daughter really doesn't notice and overall we've have been pleased.  During the holidays you see a lot of off brands selling low cost tv's and I know many people like myself depend on the reviews.  Overall, I'd buy this brand again and would recommend it - just take note of others comments just in case something like awesome sound quality is important...I knew before I got it the speakers weren't going to be fantastic so I wasn't shocked.", "Date": "November 5, 2012"}, {"Title": "Nice TV", "Author": "Kenneth T", "ReviewID": "R1WVGPR6Y86B7N", "Overall": "5.0", "Content": "Got it when it was on sale and it shipped fast.  I've had it for over a year and it is a very good TV", "Date": "January 11, 2014"}, {"Title": "Worth the money", "Author": "Marc Brown", "ReviewID": "R1Z2T2Y5W5OP17", "Overall": "4.0", "Content": "Bought this TV for $99 for the kids to play video games on and we are very happy with it.  Have had it for a year now and still works as expected.", "Date": "January 3, 2014"}, {"Title": "good TV, sound is a bit bleh", "Author": "Ally", "ReviewID": "RUM2M2X9ZFOJG", "Overall": "4.0", "Content": "Got the TV 4 days after delivery, Plugged it in today.Excellent picture quality for this price and off brand.Also easy menu to control the audio/visual frame/widescreen/computer.I am happy with my purchase. Just have to find a good sound bar.", "Date": "December 18, 2013"}, {"Title": "I love the tv.", "Author": "rose livingston", "ReviewID": "R3H0IG7XO12OA1", "Overall": "4.0", "Content": "The picture is quite clear and volume good. The look of the tv is expensive. I would recommend it to friends.", "Date": "July 15, 2013"}, {"Title": "A great TV for the price", "Author": "Eugene Focarelli \"Gene Focarelli\"", "ReviewID": "RS39BVZWZBAYB", "Overall": "4.0", "Content": "I just received the TV and it works great. Beautiful picture but the audio could be a little better. But since I got it at a great price from Amazon I bought a great pair of speakers with a sub woofer.It's was still cheaper then a top name brand. I never heard of Haier but I will tell all my friends that this is a great TV and it's cheaper then any name brand. Easy set up and the delivery was quick.I paid $199.00 on Amazon!!!!!oh yeah ,It shipped for free---->SWEET<-----", "Date": "November 29, 2011"}, {"Title": "Doesn't last - No Warranty", "Author": "David Barron", "ReviewID": "R1PSOL5UW1DURE", "Overall": "1.0", "Content": "I had used this TV only 4 long weekends over the course of a year at our vacation home.  Maybe 3 hours per day for 12 days.  It then failed to turn on after a year.  There is no warranty for it -- what a piece of junk.", "Date": "September 2, 2013"}, {"Title": "Great TV, great value!", "Author": "Alicia Evans", "ReviewID": "R38O6OFNX73Y9I", "Overall": "5.0", "Content": "I bought this TV for my living room. I don't need to have some huge big TV and this 32\" was perfect. My mom had actually bought this same one a few months before me and loved it. I have absolutely NO complaints!! The sound is fantastic as well as the color and picture. I did customize the settings to my liking but I do that with any new TV. This TV has been a great addition to my house and at a complete steal too!", "Date": "August 14, 2012"}, {"Title": "Worst T.V bought", "Author": "Spc. Johnson", "ReviewID": "R6GVQJX3LZHJ1", "Overall": "1.0", "Content": "I bought this for my mother as a gift. When she got it she plugged it in and it shocked and burnt my brother, burnt the dvd/vcr player, all the cables and the cable box. [...] even writes the reviews as one of the worst T.V.'s to buy. Noone will work on them in the states and the Power boards go bad quick!!!! I would not recommend this to anyone. Trying to get my money back now is also a pain!!!", "Date": "February 26, 2012"}, {"Title": "Bang for the buck", "Author": "DEALSMANIA7", "ReviewID": "R2SMOO79RTDFOC", "Overall": "5.0", "Content": "You cannot beat a Haier tv. I absolutely love it . Awesome performance. Great Picture and unique style.One of best around in this segment", "Date": "January 3, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "39-inch LCD HDTV\n1080p HD resolution\n7-Watt/2 channel speakers\nAuto volume leveler, Direct USB input\nDimensions (WxDxH) 37.05 in x 4.72 in x 23.27 in - Without stand, Dimensions (WxDxH) 37.05 in x 9.84 in x 25.79 in - With stand", "Name": "Haier L39B2180 39-Inch 1080p 60Hz LCD HDTV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51iQPD1fz3L._SY300_.jpg", "ProductID": "B00683VQWE"}}