{"Reviews": [{"Title": "Love It Great Features Great Picture by Anastasios Pappas MD", "Author": "tasso pappas \"Anastasios Pappas\"", "ReviewID": "R3KIWQIW34BUSX", "Overall": "5.0", "Content": "We just picked up this unit and I love it. It replaced a nice Pioneer 60 Inch Plasma. Overall the 70 inches is nice but not markedly bigger then the 60 inch.  I love TVs and have 6 in the house including Sony , Samsung ( amazing colors and brightness) Philips, Pioneer, and a smaller Samsung.  The Samsun 7050 has the best image, but the Sharp is next. I have the Dish Hopper and Joey setup and it offers great image quality.Advantages.More efficient on electrcity.Nicer more modern narrow bezelGreat but limited apps. Noticed the software update removed the Blockbuster app and a couple others.Like the ScreamDreamer App.Easy internet accessCons.Remote not my favorite, not super intuitive, but it works", "Date": "August 5, 2012"}, {"Title": "Sharp LC70LE733U 70\" LED LCD HDTV", "Author": "Doris B", "ReviewID": "RNP0VKS3JS8YD", "Overall": "5.0", "Content": "I PURCHASED MY SHARP LAST MONTH. i HAD BEEN RESEARCHING IT FOR A COUPLE MONTHS. i HAD BEEN TRYING TO FIGURE OUT THE DIFFERENCE BETWEEN THE 733U AND THE 734U. TURNS OUT THEY ARE THE SAME TV BUT 1 SELLS TO WAREHOUSES LIKE SAM'S CLUB WHILE THE 734U SELlS AT STORES LIKE BEST BUY.AS ALWAYS AMAZON WAS TERRIFIC. TV ARRIVED IN PERFECT CONDITION & SEVERAL DAYS AHEAD OF SCHEDULE.THE SET IS AWESOME-- I CAN'T GET ENOUGH OF IT, ALSO, I HAD ALWAYS WANTED NETFLIX SO I PURCHASED A ROUTER-- ALREADY HAD HISPEED INTERNET, & WITH A LITTLE HELP FROM SHARP I AM NOW WATCHING TONS OF MOVIES.PREVIOUSLY HAD A 61\" SAMSUNG DLP WHICH HAD A GREAT PICTURE BUT THIS ONE IS EVEN BETTER. CANNOT SAY ENOUGH GOOD THINGS ABOUT IT. BUY ONE YOU WON'T BE SORRY.", "Date": "May 19, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "70\" screen size offers 62% more viewing area than 55\" size TV\nVivid Quattron picture quality enables more colors than ever before\nBuilt-in WiFi for convenient Internet connection\nStreaming video from Vudu, Netflix, CinemaNow, Blockbuster, Alphaline\nReal-time online customer support with AQUOS Advantage Live", "Name": "Sharp 70in. LED 1080P 240HZ w/ WiFi", "ImgURL": "http://ecx.images-amazon.com/images/I/51wOwCFlKoL._SY300_.jpg", "ProductID": "B007AM1406"}}