{"Reviews": [{"Title": "Best picture ever", "Author": "Mary Ann Kircus", "ReviewID": "R15J4IPNPI35E", "Overall": "5.0", "Content": "Easy to set up.  The pixel technology provides an improvement over the others.  I wouldn't trade it for the more expensive sets. It can be viewed with a quality image at nearly 180 degrees.  It was much heavier to lift than expected with the thin profile.", "Date": "October 10, 2012"}, {"Title": "Philips 55\" TV", "Author": "Steve Trimble", "ReviewID": "R2TO86NHAIW45U", "Overall": "5.0", "Content": "This product met the needs I was looking for.  In particular the Media connect feature.  I should have bought two!", "Date": "January 4, 2013"}, {"Title": "Good product.", "Author": "geo2011", "ReviewID": "R47HDFFC63VU6", "Overall": "5.0", "Content": "I just bought a refurbished and have it delivered some days ago. The bezel was falling apart when it arrived, but was able to snap it back into its slot. The manual control on the side was completely out of the unit but I was able to put it together and installed it on the unit. Other than that, the unit has no scratch as expected. Very heavy. Set up was a breeze. Connection to the Home Audio System was a breeze too. The WiFi works. I saved over $400 on this unit. The Seller insisted I purchase an extended warranty, which I planned to do ASAP.This unit exceeded my expectation.Date: 03/09/13:I'll still give this TV 5 star rating.  I hope Philips is working on upgrading the WiFi functions on this TV.  I don't use the WiFi because I already have sony blu ray with WiFi.  The wifi in my blu ray is far more superior to other blu rays I tested.  This TV works just as described. If Philips can do themselves favor by upgrading the wifi firmware I will buy this brand again during my next upgrade.  I love this TV......... so farDate:6/2/13 Update:This HDTV updated the firmware a couple of weeks ago and messed up the connection to the audio system. The HDTV stopped outputting sound through the Audio Receiver. I had to replace the HDMI cable (after research) from the cheap one that was used to a more expensive (certified) HDMI cable. Now my system (HDTV/Audio System) are in sync again, like before.  Hey Guys, you need a good HDMI cable (and expensive) to connect these stuff.", "Date": "February 28, 2013"}, {"Title": "Very Happy", "Author": "Dizzy2LXR", "ReviewID": "REN8ZCQNNS3PE", "Overall": "5.0", "Content": "Free delivery, No tax, saved over $100 from the Sams club price.  Haven't had any problems with it so far.  Media connect has a little lag to it, but acceptable.  Conveniently placed inputs.  Great picture quality and good sound.", "Date": "December 1, 2012"}, {"Title": "Excellent TV!", "Author": "A. Edward \"The Big A\"", "ReviewID": "RS51ZAUX3VFHA", "Overall": "5.0", "Content": "I love this TV!  Extremely easy set up.  Absolutely beautiful picture.  Probably the best I've seen yet!  I would buy this again!", "Date": "January 14, 2013"}, {"Title": "No problems!", "Author": "AnjelB", "ReviewID": "RS8DEWMQBUNUQ", "Overall": "5.0", "Content": "Set up was extremely easy.  Wi-fi connection was a breeze and once I hooked it up to my HD-DVR the picture was even better.  You don't need a Samsung in order to have the best picture, this TV was worth every bit I paid for it.  I haven't had any problems with lag time when using my apps.", "Date": "January 2, 2013"}, {"Title": "AWFUL BRAND", "Author": "Grace Mendenhall", "ReviewID": "R2BHQ4971XZ9Y0", "Overall": "1.0", "Content": "Just bought this television from Sam's Club 7/10/13 and had it for 2 weeks before it completely stop working. The power doesn't turn on at all anymore. I was weary about this purchase because of all the reviews I have seen were similar to what just happened to me. While the TV was in use, it was great, really loved the streaming feature to use with our MAC/PC laptops. That was pretty much the only positive for this purchase. I won't be buying any other Phillips products.", "Date": "July 21, 2013"}, {"Title": "It does what it's supposed to do", "Author": "E. Powell", "ReviewID": "R2BO2IXBB1NQIU", "Overall": "3.0", "Content": "It doesn't have the greatest picture I've ever seen, but it's pretty good. The biggest con with this television is its weight. It's extremely heavy for this day and age. The operations of the web tv are little slow too. Nonetheless, I think it was a good purchase for the price.", "Date": "October 11, 2013"}, {"Title": "My Treat !", "Author": "Janice Norwood", "ReviewID": "R3W1NYOSA4F9W5", "Overall": "5.0", "Content": "This was my Black Friday conquest.I couldn't go out to catch the sale's because I didn't have a sitter for my Father.  I found this fantastic Tv at a unbelievable price, delivery included !!!My 84 year old Dad loved it until he passed in April.  The picture is Soooooo Crisp and Clear !", "Date": "July 27, 2013"}, {"Title": "Philips....I don't think so..", "Author": "Doug", "ReviewID": "R3GV37CH16BCEX", "Overall": "1.0", "Content": "I have the same model Philips 55\" LCD Smart TV that I bought at Sam's Club 12/31/12 for my downstairs man cave. The screen goes blank intermittently, totally blank with sound. So far I've had two technicians out for repair at my home, once on April 19 and again on May 16. There is a TSB (technical service bulletin issued for this model.) A bad FRC board, whatever that is, so technically it was sold to me being a defective product, brand new in the box. The first time it happened it took a few days but Philips had a repairman come out. The second time it happened I called Philips and the customer service rep stated it would be easier if I called since the repair authorization number should still be valid. Well, here we go again, 3rd time, today, May 27 the TV goes out again, same problem. I called Philips, guess what, the want me to call the repair guy again. Excellent Non-customer service. I've lost all confidence in Philips and their repair person. They'll end up spending more on repairs than the $800 I spent for this piece of junk. As for now I'll have to wait and see what happens. Josh, Philips Customer Service Rep couldn't understand why the repairman would replace the same part twice. I don't understand why I have to do his job and call the repair guy for the second time. The TV has a good picture and sound. I really like it when it's working. I will avoid any Philips TV in the future. Thankfully I have a Vizio or Toshiba TV to choose from upstairs, guess I'll go watch one of them.", "Date": "May 27, 2013"}, {"Title": "Terrible", "Author": "Michelle M. Goodman", "ReviewID": "RPG3OTZSUH038", "Overall": "1.0", "Content": "This TV is horrible.  Don't get me wrong, the picture and sound are both fantastic.  However, the smart TV features are in no way worth the extra money.  Menus are laggy and the TV often freezes.  I'm returning this on Saturday for something else.  Don't waste your money.", "Date": "November 1, 2012"}], "ProductInfo": {"Price": "$999.99", "Features": "55\" LCD iPTV\nWiFi Built-In\nMediaConnect\nNetApps\nDLNA", "Name": "Philips 55PFL3907/F7 55-Inch 120Hz LCD iPTV with Built-In Wi-Fi, Pixel Precise HD Engine, Net TV Apps, MediaConnect, HDMI, USB, VGA, DLNA, and SRS TruSurround (Black) (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/517ie2revkL._SX300_.jpg", "ProductID": "B007B5WORY"}}