{"Reviews": [{"Title": "One of the best HDTVs I've ever watched/purchased", "Author": "ViBu \"Striderhayasa\"", "ReviewID": "R33NPS7SMIN9M7", "Overall": "5.0", "Content": "Let me start by saying that I'm running this HDTV with a PS3 Slim (for BluRay, gaming and HD video content) and a Sony STR-DG 820 7.1 surround sound setup.Pros:Rich BlacksFantastic color reproduction on many films I tested*wealth of options in the menu system600hz as opposed to 60/120/240 with LCD or LED setsgreat price for the size and quality.Easy setupCons:Some content didn't display quite as brightly as our 42inch Samsung LCD set until the display was adjusted.Composite and Component can't be used at the same time. It's one or the other, not both.I've owned and viewed some really good HDTV sets over the years and this set is among the best. There are three display settings, Standard (which sucks), Movie and Dynamic. I'm running the set using the Dynamic setting, although I also enjoyed the Movie settings too. Dynamic gives better brightness and a bump up in color saturation, but the Movie setting gave very warm color representation if not so bright. I've increased the brightness to about 60 to compensate for the default dull look of the screen on default settings and I increased the sharpness by 10. *These changes in combination with the Dynamic display setting gave much better results. But it's when I changed some of the HDMI output settings on the PS3 in combination with these changes when the quality of the display reached among the best in class that I've ever viewed.Video games also look great on the set as I've tested quite a few. Dragons Dogma, Super Stardust, Killzone3, Dark Souls...all looked and ran great. You should have no problems there.I didn't mention the speakers on this set mainly because I never use the default speakers on any HDTV I purchase. I've always run sound through HDMI using my 5.1 or 7.1 surround sound setup depending on which room the HDTV is going into. High fidelity displays with mediocre sound is not a great way to enjoy HD content. Better to just invest in a decent surround sound setup.Overall, this is a great HDTV set that I highly recommend especially for the price and size. I've seen some really good LED HDTVs at similar sizes and great quality but if you're funds aren't that extensive and you want a large HDTV with a fantastic screen for a great price...Look no further.", "Date": "May 23, 2012"}, {"Title": "A good buy", "Author": "Peter S \"Peter S\"", "ReviewID": "R1AF8MRSWVTTLK", "Overall": "5.0", "Content": "Set-up is easy. The picture quality is excellent. For built in speakers the sound is reasonably good. Overall I am extremely pleased with this TV. I do however have one minor issue. It is advertised as having \"2 USB inputs, 1 component input, 1 composite input\". I needed the component input for a DVD player and the composite input for an old VCR. The composite input uses a subset of the component input jacks. So it has 1 component input OR 1 composite input, not both at the same time.", "Date": "April 10, 2012"}, {"Title": "My First Large Screen TV - Love it!", "Author": "R. Empson \"rempson\"", "ReviewID": "R1MEMLKR8QOMLJ", "Overall": "5.0", "Content": "I purchased this TV from Best Buy after MUCH agony on which TV - Plasma? LED? LCD? Smart? 3-D? After four trips to Best Buy (and changing my mind about 5 times), I went with this one.  Less than $1,000 and 4 out of 5 sales people at BB recommended Plasma over LED for true, rich colors and less motion blur.  It seemed way too big when we first got it home, but soon adjusted to the size.  Absolutely gorgeous color and sharp picture once we got an HD box and I played with TV settings.  It is so easy on the eyes, which my husband and I both LOVE.  You can clearly see so much on the screen and some scenes literally take your breath away, they are so stunning.  I did purchase a 4 year warranty, so I am ready to kick back and enjoy this TV.  There is glare from lighting, so I prefer to pull the drapes when viewing in day time; other than that, no complaints at all.  I purchased a 'smart blu-ray player' and decided we didn't need a sound bar, as the sound is clear and more than acceptable.  No regrets at all with my first HD large screen TV.Sony BDP-S390 Blu-ray Disc Player with Wi-Fi (Black)", "Date": "September 24, 2012"}, {"Title": "Not the best TV but maybe the best value.", "Author": "Amazon Customer \"Photo Pro\"", "ReviewID": "R1TJF230AIPH", "Overall": "4.0", "Content": "Rather than listing the many pros, I'll just list the cons as I see them...Sharpness on the low side for a plasma, and boosting the sharpness produces artifacts.Color Tone presets favor the cool side.  Warm 2 (the warmest choice) is actually neutral on better sets.When black levels are set to get deep blacks, shadow detail is nearly completely lost.Highlight detail is not as good as other plasmas and very blown out compared to good LCD/LED sets.Significant trailing and some ghosting despite the claimed 600hz refresh rate.Color booming at times, especially reds.  And this is a strange one and my biggest gripe...  Whenever there is a picture that is predominately bright or white, the entire picture goes to a dim, flat gray.  This is really annoying and I've never seen this before in any set.  Does anyone else notice this?UPDATE:Just wanted to mention that I bought this TV from amazon when it was $850.  It's currently $630 and at this price it's a steal!  I have changed my rating to 4 stars due to this price reduction.", "Date": "June 8, 2012"}, {"Title": "A great TV for the minimalist's out there!", "Author": "Aces and 8s", "ReviewID": "RASE21SMS6QSK", "Overall": "5.0", "Content": "Let me get this out of the way first, this TV does not have all the bells and whistles, so if that is what you're looking for, go elsewhere. No 3D, not internet, and only 2 HDMI ports, 1 component hookup, and one USB port. That being said, none of this bothers me, and here's why: I only have my cable box (HD components), XBOX (HDMI), and DVD player (HDMI) hooked up to it. I have nothing else, nor will I probably need anything else. If I do, I could always purchase a HDMI switch box. I don't have a need or use for 3D, in my humble opinion it is a useless technology in it's current state. I also do not need a \"Smart\" TV. My XBOX does everything I would need or want a smart TV to do. Again, if you were looking for a set that was all your hopes and dreams in one, this is not it. However, if you're a minimalist like myself, this is a great set for the money. Sure, there are others out there in the size and feature range for a bit cheaper, but I prefer Samsungs, *shrugs*. The picture quality on this TV is great, dark colors are very nice (upside of plasma) and everything else vibrant. Personally, for larger size screens plasma is the way to go, for now. LED/LCD will catch up soon, but it's not there... YET. That's another discussion and debate however. Like I have said, for the money this TV is great for what it is. The negatives are nit picky items, I wish the stand was glass rather than sheet metal and plastic, my 50inch Sammy that this one is replacing had a nice stand, but the one it comes with does the job, but it doesn't swivel like the other one did, no biggy. Also, like all the Samsungs I have owned, the speakers leave much to be desired. It seems the thinner TV's get now a days, the worse the speakers get. It makes sense, but at the same time I miss the blaring sound that would come out of the old school CRT set top TV's a quarter of the size of these new ones. Oh well, a good sound bar or theater system solves that. All together, I would rate the TV a solid 4.5 stars for the speakers and stand quality, we will round it to 5 stars because I feel for what is is, the TV is a bargain for the price.", "Date": "December 4, 2012"}, {"Title": "Great picture but unforgivable white noise", "Author": "D. Petersen", "ReviewID": "R38QJZCEI0PHN6", "Overall": "2.0", "Content": "I purchased this TV at best buy for 699 which is a great price for a TV that looks this good. There are two things that made me return it in the end though that you should consider. First, I had it in a room with lots of windows and white walls which you can't do. This TV reflects all ambient light and dark blacks are worthless if you can see your reflection in them. I avoided watching it during the day and all lights had to be out to watch it at night. The second problem with the TV was a horrible buzzing noise that it made constantly. It was a white noise emanating from the screen itself that felt like it was in my head. Two people I told about it could hear it clearly and two couldn't so just keep that in mind if you are sensitive to high frequency noises. I realize that most plasmas buzz but it should not be this audible and could not be covered up by the sound of the movie. It just buzzed over the audio no matter what volume. These are the compromises that you must make buying what is probably the cheapest flatscreen hdtv above 50 inches plasma or otherwise. In the end I returned it and my ln46d630 is on the way. I'll give up a few inches of screen and the plasma contrast/refresh rate to not have to deal with these annoyances.", "Date": "September 3, 2012"}, {"Title": "My Very First HDTV with Both Good and Bad News", "Author": "Big C", "ReviewID": "R1JKSVD2RWZXAR", "Overall": "4.0", "Content": "I ordered the Samsung Plasma TV on November 18 and received it on the afternoon of November 26. Thanks to my friend who happens to also own a Samsung Plasma HDTV, I was able to purchase this guy for $847.99. Otherwise, I would have missed the deal. I invited him over to help with assembling a credenza (Techcraft TCL6228 - also ordered from Amazon)and placement of the TV. Once all was said and done, everything looked beautiful. The credenza and TV are a perfect match in my opinion. I fired up the TV along with my Playstation 3 and Xbox using HDMI. I enjoyed gorgeous HDTV, Blu-ray, HDDVD, Netflix, Amazon Prime Instant Video, and pretty much any content I could throw at it. The color saturation, contrast, rich blacks, and sharpness were fantastic even for this nearsighted guy. Shoot, even the static, before I had any content on the screen, looked good on this TV. :-) I use only antenna for TV and was very pleased with the video quality. So, this went on for about 3.5 days until my TV gave out on me. It was a hard week at work and I just wanted to come home to some sweet HDTV, but was greeted with a blank screen. The TV flickers on and off like it's trying to come on, but nothing is displayed on the screen. I attempted to do some basic troubleshooting (changed power strips, power cords, outlets, and even let the TV sit for a while, disconnected from any power source) to no avail. I called Samsung technical support and spoke to a tech for about an hour. We didn't get anywhere of course and she referred me to a local TV tech. He's going to place an order for a power supply. Once it arrives, he'll schedule an appointment to come out and perform the repairs. To my dismay, the shiny, new HDTV sits atop my credenza collecting dust during the peak of college football season. I hope that everyone who owns this set takes heed. Don't get me wrong, I love my new Samsung Plasma, but didn't expect it to fail in only a few days. All I can do now is just wait and dream of being able to watch HDTV again. Tune in for an update once my power supply is replaced. Thanks for taking the time to read my review. Would have given a rating of 5 stars, but needed to take one away because of a malfunction. :-(Update 12/12/12 -Work order to have the TV repaired was placed on November 30. Two Samsung Techs in a white van showed up on December 5. Didn't have to take any leave from work since they were flexible enough to come out around 5 PM. They promptly laid the TV on its face over a blanket to prevent any damage to the screen. The back panel was removed and after running some diagnostics, it was determined that the main board had malfunctioned due to some unknown reason (could have been a factory defect). They replaced the main board (this is where all the inputs are located - HDMI, USB, etc) and closed everything back up, plugged the TV to the power source, and voila! The TV came back to life. Just hope nobody else experiences this SNAFU. Enjoy your new HDTVs.My settings if anybody is interested -PictureMode - StandardCell Light - 0Contrast - 95Brightness - 45Sharpness - 50Color - 40Tint (G/R) - G50/R50Advanced SettingsBlack Tone - OffDynamic Contrast - OffGamma - 0Color Space - NativeWhite Balance - (all set to 25)Flesh Tone - 0Edge Enhancement - OnPicture OptionsColor Tone - NormalSize - 16:9Digital Noise Filte - AutoHDMI Black Level - NormalFilm Mode - AutoScreen Burn ProtectionPixel Shift - OnHorizontal - 2Vertical - 2Time - 2 minScrollingSide Gray - LightSetupGame Mode - Off", "Date": "November 30, 2012"}, {"Title": "Very nice picture!", "Author": "rcman", "ReviewID": "R8QNL0KRLF15X", "Overall": "5.0", "Content": "I will say that this product is well worth the small bucks spent.  If you want a great picture without all the smart stuff, buy this TV.  You want the smart stuff, buy a blu ray with smart stuff and viola you got it.  Speakers are okay, but like someone else stated earlier, you need to have a seperate sound system to watch hdtv.  Just got this hooked up and will be watching a blu ray disk tonight.  Further reviews to follow, but so far, so great!!!!!", "Date": "September 14, 2012"}, {"Title": "Great TV- Great picture for Xbox- What a steal on Black Friday", "Author": "Rob Harrington", "ReviewID": "RRAA22DLV5R27", "Overall": "5.0", "Content": "Picture and functionality: This tv is beautiful. Looks great with the Xbox 360, with Game Mode on. Extremely convenient that it saves the settings for each picture mode, so you can set it and forget it. The speakers actually sound really good, but it's in a bedroom that is about 15'x15', so I can't comment about how they sound in a larger family room. But what I do know is that most hdtv's don't have great sound to begin with, considering they're so slim these days. But who doesn't know/expect that? We all use surround sound or sound bars.This tv also has a digital optical sound output, so it's simple to hook it up to surround sound, if you want to use the 2 hdmi inputs for other devices. The setup was very easy. When you know what you're getting, this tv is perfect. It's clearly listed as having 2 hdmi inputs and no pc input. As with most plasmas you get a very noticeable reflection in a room with lighting, so a darker environment is best for this screen. The Media Player Connectshare is an awesome feature! I can hook my 1TB External HDD to it and play blu-rays right from there- Plug and Play.Couldn't be happier with this tv so far, now hopefully it lasts. You can extend the warranty by 3 months by registering it with Samsung. Overall, the picture is stunning when playing Call of Duty: Blacks Ops 2. I can't test this for HDTV quality because I don't have the service right now.Blu-Ray movies look great. Great color, no motion blur, seems like a perfect image.Physically: The tv looks great, it's very sleek, and slim. I may decide to mount it, considering it's thin build.Purchase: There was no way I was waiting in any lines on Black Friday. I went to Best Buy and Walmart Thursday night, just to check out the frenzy, and I am happy I decided to get a way better deal for this huge tv, online. The scheduled delivery made it very convenient as well. The delivery man was respectful and prompt. As a student, the Amazon Prime Student Membership really hooked me up with the free 2-day shipping.  Thanks Amazon!", "Date": "November 27, 2012"}, {"Title": "Great purchase", "Author": "Amber M Ryan", "ReviewID": "R1Z3B2BS2HB0JW", "Overall": "5.0", "Content": "I was skeptical of ordering something this large online, however the experience was wonderful. They delivery guys were total professionals, had it up and running in less than 10 minutes. The picture is A W E S O M E. Take the advice of former reviewers and adjust the settings a little bit. Great purchase.", "Date": "May 24, 2013"}, {"Title": "Great plasma for the price", "Author": "walstib11 \"walstib11\"", "ReviewID": "RS1NASNYHHAWN", "Overall": "5.0", "Content": "Arrived with only one pixel not emitting color.  I ran a full calibration blu ray disc and it did very well on the tests and once dialed in has a great picture. I have a Panasonic Viera Plasma and this unit handled the grayscaling and other various tests a little better.  Definetly needs adjusted out of the box.  Only has two hdmi inputs but picked a Kinivo 501BN switch, so not a problem.  Sound is OK, like most flat panels nothing to get excited over.  Like most set ups, it will be hooked to a suround sound system so sound is  a non issue.  For the budget price this is a good plasma.", "Date": "March 30, 2013"}, {"Title": "Very happy with purchase", "Author": "LBGyrl", "ReviewID": "R1KG1UX5RMA3QS", "Overall": "5.0", "Content": "This tv is replaced our projection screen tv. After extensive research we are glad we purchased this model. It doesn't have as many audio or output jacks that we would like but I was able to reroute them through my DVD player. The picture clarity is amazing, shipping and delivery was right on time.", "Date": "June 19, 2012"}, {"Title": "great viewing", "Author": "jackie", "ReviewID": "R77M421OV2V0W", "Overall": "5.0", "Content": "I thought long and hard about getting a Plasma big screen or a LCD.  The picturequality is exceptional on the Samsung Plasma we decided on.  It is very clear andthe colors are vivid. There was some \"talk\" about it running hot but I do not seethat as a problem.  The big question is always would you buy the same product againif you knew then what you know now, my answer is YES.", "Date": "July 13, 2012"}, {"Title": "This TV is.....", "Author": "Dirka", "ReviewID": "RMPJOLHI803M9", "Overall": "5.0", "Content": "Amazing. The colors this thing puts out, i cannot put in words. Head over to one of the remaining brick and mortar stores to see for yourself. I was on the fence getting a plasma, i compared specs to comparable led lcds and watched video reviews relentlessly. Getting the absolute most of my money is a personal hobby of mine and let me just say at below 1000 i feel like I'm stealing from Samsung. Burn in is no longer an issue, there is no opera affect, while not as bright as led tvs the color quality is unmatched. This TV is a great addition to the living room. You will not be disappointed.", "Date": "March 2, 2013"}, {"Title": "It's great!!", "Author": "R. Dorr \"Dx3\"", "ReviewID": "R2CUJNS5IX6RHT", "Overall": "5.0", "Content": "I got mine on the gold box price about a month ago for only $807. Wasn't ready for the purchase, but at the price I got it and kept in the hotel till going to closing for our house. It was worth it. I don't know the techno speak, but if you have a doubt about plasma picture quality, or the thickness of the screen, you will be happily surprised in both regards. Also, the input is varied, can be USB, HDMI, RCA jacks, not sure if anything else. My last TV was a 37\" Samsung LED. I am equally satisfied with this picture, and the blacks are indeed black, so that's a bonus.", "Date": "February 24, 2013"}, {"Title": "Gorgeous image for the price", "Author": "Earnest F. Cavalli \"Professional Gaming Journ...", "ReviewID": "R2JC02JAY0OMWY", "Overall": "5.0", "Content": "I purchased this TV at $700 and it's utterly stunning. After an hour of calibrations the picture this TV outputs is as close to perfect as any average person could possibly require. The only people who might find issues with this TV are super hardcore A/V geeks, but those sorts would likely be willing to spend the extra $1000 to pick up a TV that is objectively superior. For anyone else, the Samsung PN51E530 is a fantastic television.Also, if you're a gamer, this is the only plasma I'd recommend, thanks to its screen burn protection features and how great its HDMI output looks. Double points if you're a fan of fighters or shooters, as this TV has almost instantaneous response times.", "Date": "February 20, 2013"}, {"Title": "Great Deal", "Author": "Ccoles", "ReviewID": "R1E98WEDIPXCL", "Overall": "5.0", "Content": "When I purchased this TV, i went back and forth between, LED, LCD and Plasma.  They all have their pros and cons, and the viewing angle of the plasma won out for me.  I already had a plasma and just wanted something a little bigger.  This TV is an amazing deal.  I could have got a better TV, but would have had to pay a lot more.  The quality of this tv for the price most likely cannot be beat.", "Date": "November 19, 2012"}, {"Title": "Awesome Samsung Plasma!", "Author": "jessiemaysd", "ReviewID": "RARXVN1PVV69S", "Overall": "5.0", "Content": "We absolutely love our new purchase! Shipped quickly and the picture quality is very clear. This is our first plasma! Great buy!", "Date": "September 26, 2012"}, {"Title": "Nice TV but...motion blur on every set", "Author": "The Gitel \"The Gitel\"", "ReviewID": "R1830LRR7NT9UD", "Overall": "2.0", "Content": "Pros: 60inch is nice, easy set up, decent price at $1,000, zoom features to fill the screen from 16:9 ratios, outside edges is thin, the TV itself is thin and light too, it's a nice looking TV, very quiet TV, speakers are decentCons: Motion Blur (on sports, action movies and video games), scenes can be too dark, some people may not like that it isn't a smart TV or 3D(but I couldn't care less)I was happy with my purchase at first. The size is really nice! I don't want a TV in the living room smaller than these 60 inches anymore. The price was right too, $1,000. I don't care that its NOT 3D or Smart with apps or an internet browser. I just wanted a big TV with a decent screen so I can watch TV and play games. I thought that's what I got.But it didn't take long for me to catch the motion blur. Its not too dramatic but enough for me to feel like this may not have been the best purchase. You can't read the names or numbers on a players jersey if he is running too fast. On video games you can't read the words on the screen if your moving the icon or player around. It takes like a full second to clear up and once it starts moving again it blurs again. For a $1,000 I didn't think I should have motion blur. Also some scenes in movies can be too dark during dark scenes, you have a hard time seeing what's going on.I contacted Samsung and they said I have the latest firmware and they told me to reset the TV. But problem persisted. It turns out this model is like this after further researchWord is the E550 from Samsung gets rid of the motion blur problem. But its $300 more. I'm calling up and returning this TV and I'm upgrading to the E550. Now its going to be 3D and Smart but I just care about the picture being clear, even during fast motion, and at a decent price.This says it all I think, regarding the E550 screen performance. I hope its true.(I don't think Amazon let's me post links here. Go to TelevisionInfo dot com and find the TV model for the E550, performance, screen performance and see what they say)This was my first HDTV purchase. Iv'e had the TV for 2 weeks now. I hope the return is a smooth process. Should I call Amazon or the seller? I think I will contact Amazon and try to buy from the same seller again through Amazon. Since they did a good job on getting the TV to me (Abt Electronics). Wish me luck!", "Date": "September 22, 2012"}, {"Title": "51\" Samsung Plasma TV is very satisfactory but has no RCA audio jacks", "Author": "Bruce G. Taylor", "ReviewID": "R1ZW58QQPR61B7", "Overall": "4.0", "Content": "This Samsung 51\" plasma has replaced a five year old Samsung 46\" LCD which has been moved for use in another room.  I was unprepared for the improvement in image clarity over the LCD set, but it is undeniable.  It required some tinkering with the settings to get the ideal picture for me.  The screen is very reflective, as I expected, but the light in this room is controlled and I watch movies in total darkness at night.The audio quality of this model is a great improvement over the older LCD unit which sounds like a 1940 radio.  But I never use the TV sound anyway as the TV is actually a component in my audio system and sits between two B&W; DM6 monitor speakers that have great sound imaging.  When a sound source is supposed to be coming from the center, people swear that the sound is coming from the TV screen but, of course it isn't.Very happy with the TV except for one important thing.  It has no RCA type L & R audio outputs.  Fortunately the Blu-ray player and my cable box do have them and I had to use these to get the TV audio into my audio system.  My older Samsung LCD TV does have these audio outputs and I was sorry to see that Samsung has decided to eliminate them.", "Date": "May 17, 2013"}, {"Title": "Amazing Television", "Author": "Gordon", "ReviewID": "ROHBGQ76RKJUE", "Overall": "5.0", "Content": "I am so glad that I picked this television over any LED.  The picture is amazing, the black levels stunning, the sound superb, and the overall appearance is simplistic and chic.  Save tonnes of money by buying this and hooking up your Roku and/or AppleTV, it will be just like having a top of the line smart-tv.  This television is gorgeous and performs fantastically.  Anything better is impossible.", "Date": "April 19, 2013"}, {"Title": "Excellent TV", "Author": "Steve99", "ReviewID": "R30D9RXBZY172F", "Overall": "5.0", "Content": "This is the second Samsung plasma TV I've owned and I couldn't be happier with the picture quality.  I wasn't look for a \"smart\" TV or anything in 3D, so this one fits the bill perfectly.  In any event, I have a Blu-Ray that streams Netflix, Amazon, Pandora, etc., so a smart TV would have been overkill.  Very happy with the purchase.", "Date": "April 13, 2013"}, {"Title": "Rockin picture...", "Author": "J. Glotzer", "ReviewID": "RYH45EP9K73EH", "Overall": "5.0", "Content": "But I really don't dig the menu control, nor the flow.  CNET review on similar is spot on.Cell Light intensity increases color as well as the monochrome range of contrast, brightness, gamma.On lower settings, the color can range from flat and under-saturated (8), and over-saturated with reds (18).Tweaking endlessly with the multitude of settings does help, and many different combinations are within: color tone, color space, black tone, flesh tone, white balance (color offset and gain), dynamic contrast and HDMI black level.  There are more, and they also affect the basic color and mono settings.Overall, for what almost the price of a 37\" LG LCD entry level TV that replaced it, the detail level on all media looks exponentially improved.There is so much more to say about this TV, but the value of omitting Smart technology should not be overlooked, if that is important to you.  The price is well supported, but I have no idea of what Samsung has up their sleeve for this model year.  Worth spending another $200-300?  Not for me, and only you can make your own decision.", "Date": "April 10, 2013"}, {"Title": "Great TV!", "Author": "Kalara", "ReviewID": "R2PQ8K4RAZTXTE", "Overall": "5.0", "Content": "This is our second big screen TV but the first plasma.  We love it!Great picture and good sound.  Second Samsung TV as well.  Itamazes me how much they've improved in just a few years.  Thankyou!", "Date": "March 29, 2013"}, {"Title": "Does what it says, fantastic picture", "Author": "Kozzer", "ReviewID": "R3LUMFTPAB74C2", "Overall": "5.0", "Content": "Got this TV a week ago, and it's worked flawlessly.  After setup, the picture is fantastic.  Don't let the old problems with Plasma sets worry you (burn-in, etc).  The screen is supposed to be at it's most sensitive to burn-in right for the first few dozen hours of operation, but I haven't noticed anything at all.  Upon turning it on for the first time, it'll search through all the channels before you can do anything, but that only takes a few minutes.  Once you see the picture, it'll look a bit dull out of the box, but spend 10 minutes tweaking it the picture settings to fit your specific room and lighting and it looks AMAZING.  Sports are super crisp, the motion lacks any sort of blur.  Nature programs appear almost as if you're looking out your window.  If I have one complaint, it's how glossy and reflective the screen is.  But since I knew about that going in, it wasn't a surprise, and after moving 1 lamp a few feet, I have no problems with reflections.Also, the USB port plays AVI video files, probably MP4 as well.  So you can use it to show photos and videos.I highly recommend this TV, and any large format (51\"+) Samsung plasma!Pros: Amazing picture, smooth motion, thin profile, does what it saysCons: Reflective screen, lack of component audio out (SPDIF out only)", "Date": "March 13, 2013"}, {"Title": "Blows away Panasonic LED", "Author": "ph", "ReviewID": "R1487Z6REA72ND", "Overall": "5.0", "Content": "After two attempts with a Panasonic VIERA TC-L47DT50, I switched gears and went with this Samsung plasma and so far I can't believe the difference. I gave up 3D which I didn't plan on using, a clunky smart TV interface and the worst back light bleeding problems I've ever seen. The Samsung picture is amazing. Can't compare it too top of the line models or other brands but compared to what I was seeing on the DT50 I am blown away. Even my wife and kids are impressed and think the image is much better then the previous TVs. I'll be following the common online guidelines for breaking in a plasma. It doesn't seem to be to difficult. Using a Roku as my main streaming interface which works great, and with a purchased screensaver that basically emulates what a lot of people use to break in their plasma I think I'm good. A bit heavier and thicker but still a world of difference from my 13 year-old CRT. It also has larger screen at 51\" vs 47\" on the DT50. Yes, a third HDMI input would be nice but I already have a HDMI switcher for additional needs. Audio is just fine for the room the set is located. Do wish I could label my inputs more clearly such as Xbox vs game and Roku vs AV but not a big deal.The packing was the first clue that this was going to be a different experience. Substantially better packaging in a sturdy box. At least twice as think as the Panny box and much more secure. Probably the reason why I sent two of the other TVs back.Amazon service was great.", "Date": "March 9, 2013"}, {"Title": "Fantastic Simple Enclosure for a Great Plasma Pannel", "Author": "Calvin K. Cox \"Calvin K. Cox\"", "ReviewID": "R3UY2PNL8SY3Y1", "Overall": "5.0", "Content": "PROs:Great pannel. True to life colors, super bright, and yet maintains great darks.CONs:Very basic inputs and not a lot of \"fancy\" featuresI bought this TV because I wanted a simple enclosure for a high quality pannel. It delivers in a big way! This TV will blow you away with quality for price. Just don't be expecting to plug 20 things into it.Setup:Wall Mounted - full articulating arm5.1 THX Surround Sound attached", "Date": "February 1, 2013"}, {"Title": "Great Plasma TV", "Author": "thomas c \"tom\"", "ReviewID": "RB6H11XSLK7MK", "Overall": "5.0", "Content": "This is the 1st hd tv we bought & what a great decision to get this tv.  The picture is absolutely beautiful. We did not know if the plasma tv was the way to go, but after seeing this picture, we know it was the right decision. Great products and great service, as always, from Amazon.", "Date": "January 7, 2013"}, {"Title": "Would recommend", "Author": "Anon", "ReviewID": "R19HUDOUUXBY72", "Overall": "4.0", "Content": "I was looking for a replacement to my old Samsung 50\" plasma for a good price and this fit exactly what I was looking for. It's not the highest end model, but Samsung makes great TVs and this one is no different. Very satisfied!", "Date": "January 7, 2013"}, {"Title": "Love this TV", "Author": "W. Johnson", "ReviewID": "R3V9NZ4943L4GJ", "Overall": "5.0", "Content": "This is a great TV for the price. I was able to get it for under 600 bucks.  The picture is great, especially compared to my old Sony 720p/1080i LCD TV that was dying slowly on me. I will never trust Sony again.The only criticism that I agree with is that it does not have very many input ports.  I had lots of extras on my old TV.  This one I used them all immediately.  Other than that this is a great tv that is well worth the money.  You can get all the extra app crap anytime through a DVD player or Roku or something like that. And who really needs 3D at home?", "Date": "November 30, 2012"}, {"Title": "WOW!!!  AMAZING Picture and Decent Sound AND INCREDIBLY LOW PRICE!", "Author": "SurreallyReal", "ReviewID": "R9QEC6Q7TB8JE", "Overall": "5.0", "Content": "This TV is only $649 w/Free Shipping ON THE SAMSUNG WEBSITE!  Don't waste money.  I bought this ON AMAZON for $649 so that my aging Mom could read her closed captions easier and have a bigger, better picture and this 51-Inch Samsung PN51E530 1080p 600Hz Plasma HDTV IS INCREDIBLE!!  The delivery company brought it in, took the box out of an outer box that they use on the truck, and carefully removed it from the Samsung box and attached the stand, plugged it in and made sure it worked before leaving.  One said, \"You got an amazing TV here!\"  I said, \"Yeah at $650 I couldn't refuse!\"  They said that was a great price (which it is) and will get one themselves.  Yes, Costco has the same model at the same price, BUT at Amazon you can get 12-months 0% financing AND the great Amazon TV return policy, and I just like amazon so much more!  True, the reviews about the sound stating that it is not great are true, so get a soundbar or a surround sound system.  The PICTURE IS PHENOMENAL.  I have 3 other smaller LCD HDTVs and THIS PLASMA IS AMAZING!  For $650 you get a $1K TV and it's like a movie theatre in your home.  Am VERY HAPPY with this TV and so far HIGHLY RECOMMEND it!", "Date": "April 4, 2013"}, {"Title": "Good quality no issues so far", "Author": "Corey Witherspoon", "ReviewID": "R1B09CRFAXNLPV", "Overall": "4.0", "Content": "First let me start by saying, the TV I replaced was a 100+ pound monster with no bells or whistles.  So my needs were good quality and low price.  So at Best Buy which has the same pricing as Amazon, I strolled past the TVs with 3D or voice operated and went to the price range that suited my needs.  Based on my price range, the Sales Rep recommended it over other brands.I brought it home, it worked out of the box with no issues.  Setup was easy.  Connecting to cable was fine...didn't read the instructions as most men do not.  I don't buy TVs every three years so if it last ten years at the current level, I will be very happy with my purchase.Does it have enough HDMI connections and other gadgets...for the price I was willing to pay, yes.  If you want more than what Samsung offers for this model, bring more cash to the table.", "Date": "September 6, 2012"}, {"Title": "Only lasted two years....", "Author": "Amalfimom", "ReviewID": "RH3WEAYQC1H87", "Overall": "1.0", "Content": "We bought this tv in dec 2011 and loved it...until last week when tv stopped working and made strange clicking noises. When i googled the problem, i was very unhappy to find that samsung had a recall (after a class action suit) for their 2008 and earlier models for the same issue but are denying responsibility for tvs bought after 2008.  A quick internet search turned up a lot of very upset and unhappy customers with the same problem in the post 2008 plasma tvs.  I spoke to Samsung and they will not cover the repairs..told me i should have bought the extended warranty.  This is apparently a capacitor issue and occurrs during the manufacturing process.  I am, perhaps naively, stunned that Samsung thinks a tv in this price range should only work for two years and that they deny there is any systemic problem despite the same symptoms appearing in these later models.  Shame on Sansung.  We all make mistakes but true integrity is acknowledging and fixing them...that is how you retain lifelong customers.  I am as sad as i am angry.  I had a better opinion of Samsung than they deserved.  And needless to say, there will be no more Samsung products purchased in our household.  The loss of one customer won't matter to them but it will matter to me that i do not allow myself to be treated so shabbily.UPDATE on 9/19/13:  After further negotiations with Samsung, and my placing this negative review as well as an email to the marketing dept (do not know if those made a difference) Samsung has agreed to pay for all repairs.  They apparently will make exceptions on a case by case basis and I was nine month out from my warranty which is why I was told the exception was made.  Thank you Samsung for displaying good corporate behavior and listening to your customer.", "Date": "September 18, 2013"}, {"Title": "Best TV I have owned, so far.", "Author": "Yankee Goodfella", "ReviewID": "RR966CM3E3K9", "Overall": "5.0", "Content": "I really can't say enough great things about this TV. Samsung has done it again. Incredible picture and sound. No need for useless bells and whistles, just use an Apple TV and Roku box like me. My only complaint is that it only has 2 HDMI inputs. But I bought the HDMI switch box on Amazon for super cheap and now I couldn't be happier.", "Date": "April 28, 2013"}, {"Title": "Great-looking TV with excellent Smart features", "Author": "Rhinestone", "ReviewID": "RLJB9YMDFNFPB", "Overall": "4.0", "Content": "TV took about 20 minutes to set up (by myself) from the time I opened the box to the time I got Netflix up and watched the first movie. The wireless setup was super simple -- automatically found my wifi network, I put in the passkey, and boom. Done. Downloaded Netflix and HBOGO (awesome exclusive Samsung built-in app that pretty much sealed the deal for me vs. competitors like Panasonic) and have been enjoying it since. Remember: this TV is Wifi ENABLED, not \"Wifi capable\" or \"Wifi ready\" -- no need for any extra adapters. Everything is built-in.I do not have a super light room, nor do I do a lot of daytime TV viewing, so the supposed reflectiveness of the TV screen is not an issue for me. Plus, the base looks awesome (glass and metal, no plastic) and easily turns the TV away from windows if needs be.Picture quality is great. I have not tried 3D and probably won't; in fact I wish it didn't even have that. Me no likey 3D.TV itself looks very sharp. Shiny, black, high-tech. The stem of the base is even made of clear glass, to promote the \"floating TV\" effect. Nice touch.I agree with another review: you have to get a little used to the remote working best when pointed at a specific area of the TV (not a wide angle). Not a big deal, but there it is.I find the app selection to be fantastic (it now DOES include Amazon Instant, as well as Redbox), and come April I will be watching my beloved Red Sox on MLB TV Premium! Again, the ability to run HBOGO was a deal-maker for me; otherwise I'd have to buy a Roku box for another $75, so that expense and hassle is saved.The built-in web browser is slow and basically unusable without the (optional) keyboard. I don't see myself using it, which is too bad. My next TV years from now will probably be an Apple product, so I'll just use my iPad til then ;)I went with Plasma over LED/LCD and I am glad. Brightness is not an issue, and mainly I am a movie watcher (I don't use it for gaming at all) so the choice was pretty clear after doing research. Power consumption should not be too much of an issue, according to the sticker which says under $30/year to run. One other note is that I do not have cable; I will use this exclusively for apps (some paid, some free) and DVDs. I have cut the cord and I love it!Side note: this TV is the EXACT width (around 47\" -- remember the 51\" TV screen size is diagonal, so the width is a bit less) of the 2-section \"Besta\" TV stand from Ikea. Looks so good up there! I really debated going with a wall mount, but I'm glad I didn't have to hassle with putting holes in the apartment walls; plus, my wall studs are not located where I wanted the TV.Overall I am a very happy consumer. When I was little, Samsung was kind of the \"off-brand,\" the way Toyota and Honda were when they first came on the US market. Now Samsung is top-rated for TVs and I couldn't be (much) happier with this plasma -- especially after Amazon dropped the price by $100 the second day I looked at it! I have a Citi Price Rewind alert set, so if it drops again within 30 days I'll get a refund for that difference too :)", "Date": "January 29, 2013"}, {"Title": "Great Picture, great price, cheap stand, little connectivity", "Author": "Patrick Smith", "ReviewID": "R1BRWGSYF5C6J7", "Overall": "4.0", "Content": "Got this for $577 on cyber monday, was a steal.  The picture on this thing is remarkable, just make sure when you get it to change the picture setting from standard (energy star) to Dynamic.  The difference is night and day.The only cons I have for this is the stand and the connectivity.Stand: It's cheap.  The screws it came with were very soft and stripped easily.  I actually went to the hardware store with one of the screws (they are phillips head) and picked out 8 flat heads that were much stronger.  I used those instead and the stand is as sturdy as anything now.  The issue seemed to stem from the crappy screws it came with.  When I had the factory screws in, the stand was wobbly and you could tell the TV was leaning ever-so-slightly to one side.  Needless to say, it worried me so I went and got better screws, and boom, problem solved.Connectivity: Only has 2 HDMI (I solved that by buying this http://www.amazon.com/Kinivo-501BN-Premium-wireless-adapter/dp/B0049SCB2Y - I highly recommend it even if you have enough ports.  Check out the video review on the bottom, the guy nails it.) Also, only has one component input, not 1 component AND 1 composite.  They are combined into 1, which sucks.Other than those two cons, the TV is great.  Highly recommend it if you are trying to burst into the plasma TV world without breaking your bank.  Also, there's not too much to complain about a 51 inch screen.  Like my dad says, when it comes to TV's you can never go too big.  Would have given 5 stars if it had more connectivity options and the stand construction was a bit better.", "Date": "January 16, 2013"}, {"Title": "Nice for the money", "Author": "Steve Ciaravino", "ReviewID": "R1I49ILN7WVMRC", "Overall": "5.0", "Content": "Although, I purchased this TV from Best Buy for basically the same price ($999), I am truly pleased with it. The picture quality is great and the detail when viewing HD programs or movies is exceptional. As others stated the sound is what you would expect from any flat TV and is better if ran thru an entertainment system. Also, since I purchased this from Best Buy, I opted for the 2yr Geek Squad protection in case of issues such as those stated in other posts. All in all, I am pleased with this HDTV. If you are looking for a 60\" TV that is decently priced, I would consider this television and possibly buy it at Best Buy, if you are concerned about it ever needing to be returned.", "Date": "September 19, 2012"}, {"Title": "Awesome TV for the Money!", "Author": "R. Petty", "ReviewID": "R3K05UWNCJFPZZ", "Overall": "5.0", "Content": "I love everything about it, great pic, great price, great remote, lightweight.  It has pretty good sound, too.  I chose to get a sound bar to pair with the TV to add a little bass, but that is really to supplement, not a knock on the TV as it's sound is better than expected out of the box.", "Date": "January 9, 2014"}, {"Title": "Perfect", "Author": "juicernut", "ReviewID": "RNN87UKKYBCJT", "Overall": "5.0", "Content": "Love this TV.  The picture is bright and clear and the functions are easy to follow.  Expect it to last for years.", "Date": "December 30, 2013"}, {"Title": "sweet TV", "Author": "Ben Tover \"Quality only\"", "ReviewID": "R3W49FZL4CZVPO", "Overall": "5.0", "Content": "Got this for my father and it is very nice.  Guests just commented last week of the picture quality and I must agree, as good as I have seen.  We got the home delivery and set up and that made it nice for my disabled father.", "Date": "December 29, 2013"}, {"Title": "Great deal on this tv", "Author": "Angela A. Gutek \"Angie Gutek\"", "ReviewID": "R35U5JD4D3PXF6", "Overall": "5.0", "Content": "Haven't had the tv very long, but so far it is great. Good color and sharpness. I am using a sound bar and that is only because I love the extra sound it provides. Got the tv at a good price, well worth it.", "Date": "December 15, 2013"}, {"Title": "Overall a good value and good picture", "Author": "JustAGuy", "ReviewID": "R3KK0BZUF52RA2", "Overall": "4.0", "Content": "I've had the TV for about a year. Picture quality is good, has all the features I need. It has a good low profile look. Overall I'm pleased and would buy again. Only two drawbacks are it only has 2 HDMI ports, so I end up having to connect and disconnect things a lot. The other is it takes a seconds or two to turn on, it's a little thing but I sometimes push power a few times and end up turning it on then off then on. No big deal.", "Date": "November 30, 2013"}, {"Title": "Great product. Great price.", "Author": "Jay Dmello", "ReviewID": "R1S61YTWELJBLY", "Overall": "5.0", "Content": "Wife said we should have bought 2 !!  Great picture, good sound and very good price. Even though it does not have any apps,  I would highly recommend this plasma model from Samsung.", "Date": "October 29, 2013"}, {"Title": "Beautiful Display", "Author": "Raykre \"Trev\"", "ReviewID": "RCLPXWZ44786L", "Overall": "4.0", "Content": "You wanna go samsung or lg. I went samsung plasma cause i game and cant afford the led with this size and refresh rate. This tv has only two hdmi ports. Glare is an issue during the day but its not that bad with the blinds down.Getting a tv this good for this price is worth the minor downfalls", "Date": "October 12, 2013"}, {"Title": "A Very Good TV", "Author": "Carlos Dennard", "ReviewID": "RKD9F9UWCSI2M", "Overall": "5.0", "Content": "Very Good quality TV is located in my bedroom which is very large, had maybe 4 or 5 months. I have truley enjoyed thus far, needed a lot of changes as far as color contrast etc.", "Date": "October 9, 2013"}, {"Title": "Going strong", "Author": "NG", "ReviewID": "R3JI6ABI79Q9U1", "Overall": "5.0", "Content": "We've had this TV for over a year and have used it daily.  The picture is crisp, though, as you might expect with a plasma display, it's not great with ambient sunlight.  There aren't a lot of connections, most notably the single audio output (optical), if that's something you need.  The sound output from the TV speakers is pretty good.", "Date": "October 5, 2013"}, {"Title": "Great", "Author": "Benjamin Geanetta", "ReviewID": "R3TCFWI89MYWXZ", "Overall": "5.0", "Content": "Fast shipping and just as advertised. Works great and was able to set up in no time. Wished it had an additional HDMI output but it is nota deal breaker", "Date": "August 16, 2013"}, {"Title": "Very nice HDTV", "Author": "Catherine", "ReviewID": "R27PC6DRSI1FN4", "Overall": "4.0", "Content": "I got a 60\" from Amazon about a month ago for $813.81, and I bought a 4 year warranty for $116.53.The picture and color look absolutely stunning for standard settings. The reason I didn't give it 5 stars is because of the sound, no matter how much I adjust it, it still sounds like voice, even when I set it on music.", "Date": "July 23, 2013"}, {"Title": "It is perfect....", "Author": "Patrick Madigan", "ReviewID": "R3E0WWJH1A6962", "Overall": "5.0", "Content": "=8-DVery Happy....I works like I expect it.The TV is light enough to move around.I am very pleased...", "Date": "July 10, 2013"}, {"Title": "Great Picture/Sound", "Author": "Leon Trotsky \"NoodleKugel\"", "ReviewID": "R21TBV7Q721756", "Overall": "5.0", "Content": "I liked this Samsung so much that I bought a 2nd one the next week. We put it in the guest bedroom and mounted it on the wall. The 2nd one is going in the master bedroom replacing a 10 year old SONY 42\" plasma.", "Date": "June 25, 2013"}, {"Title": "Excellent", "Author": "Taiyang", "ReviewID": "R3ESV61RSYB6DH", "Overall": "5.0", "Content": "For a 60\" flat TV with this price is an excellent purchase. This is a simple model to meet my and most average person's need. The picture is sharp and clear with very bright vivid color. It replace my older 60\" Mitstubishi projection TV and worked perfectly.", "Date": "June 25, 2013"}, {"Title": "Samsung 5 Star Review", "Author": "Rodney Thompson", "ReviewID": "R28QNWMUGYEQOK", "Overall": "5.0", "Content": "I Believe Samsung is one of the best TV providers and I try to choose everything through them. I love my 60\" TV and would recommend this product to everyone!", "Date": "May 8, 2013"}, {"Title": "Good picture quality.", "Author": "Glenn J. Verhagen", "ReviewID": "R18FXJY89BPJ1A", "Overall": "4.0", "Content": "The large 51\" screen is easy to view, follows motion very well. The picture can be a little dark on some programs when the room lighting is bright. I have already recommended this HDTV to a friend.", "Date": "May 7, 2013"}, {"Title": "Samsung PN51E530", "Author": "stuart challoner", "ReviewID": "RX8QNJLAYEUG8", "Overall": "5.0", "Content": "I have no complaints.  The picture is great, sound is better than I expected.  Easy to set up and use.", "Date": "May 6, 2013"}, {"Title": "Love this TV", "Author": "John Ciempa", "ReviewID": "RFMVWGAZ33J7Y", "Overall": "5.0", "Content": "Love this TV. Very pleased with my purchase and would recommend this to friends and family. Great Christmas gift to myself.", "Date": "April 5, 2013"}, {"Title": "Love it!", "Author": "Sue", "ReviewID": "RUJVTKNTX22PT", "Overall": "5.0", "Content": "We loved this plasma screen!  We were worried that the whites would be not white enough, but we have had no issues with that.  We love the crispness and brightness of colors.  Would highly recommend.", "Date": "March 25, 2013"}, {"Title": "Great TV for the price", "Author": "Sunny Morning", "ReviewID": "R1QA8W8ADELCSN", "Overall": "5.0", "Content": "Everything about it is Samsun and it is doing exactly what I expected a TV to do.  Would recommend it.", "Date": "March 23, 2013"}, {"Title": "I'll never buy an LCD!", "Author": "sk;gjp'fjskgjskljg", "ReviewID": "R3NTCR5Z22BE3N", "Overall": "5.0", "Content": "We bought this model of tv a few years back. Not only was the picture the best (compared to the wall of LCD tvs) but the price was even better. We got luck and got this tv for more than 1/2 off because it was a \"return\". After having this tv a few years with no problems or issues, my daughter cracked the screen with a plastic stick. I was devastated. Literally. There was a huge black bar across the middle of the tv, and every tv repair shop I called said since it was a plasma tv, it'd be cheaper to buy a new one. So we did! We hunted down this same model again. And got ANOTHER steal. We got the display for only $400.We are 'movie buffs' and i LOOOOVE the picture with our bluray. Better than IMAX....especially the kids' cartoons! If you don't mind how UN-energy efficient this tv is, it's a great tv. I was sad to find out they will no longer be making Plasmas. So this better not brake!", "Date": "March 23, 2013"}, {"Title": "FORTH SAMSUNG TV", "Author": "Al", "ReviewID": "R1ZMMZEZ6TA4WQ", "Overall": "5.0", "Content": "This may have the best picture yet.............one of my Samsungs is 15 years old and still works perfectly.  I woluld never by another brand.", "Date": "March 15, 2013"}, {"Title": "Excellent purchase", "Author": "Wayne W. Allen", "ReviewID": "RL544LQLSWFV0", "Overall": "5.0", "Content": "The unit is working well. I had some trouble setting it up. The instructions were not clear or precise for a novice. My son-in-law is a videographer so he had no trouble setting it up, but the instructions in the package were inadequate to complete the task.Color is great. Performance is excellent. Controls are functional. I would buy it again.", "Date": "March 14, 2013"}, {"Title": "Wow factor very high", "Author": "ILLICEMAN", "ReviewID": "R1MC5LFNJQFOL4", "Overall": "5.0", "Content": "Ourstanding right out of the box.For the couch potatoe that wants the best at a outstanding price this is the one.As usual Samsung delivers/", "Date": "March 9, 2013"}, {"Title": "Beautiful pictures!", "Author": "JK", "ReviewID": "R3BP4XUVM6I0JB", "Overall": "4.0", "Content": "I was considering this and the Panasonic plasma 60\". I didn't mind either but wife wanted Samsung for the brand and design.I don;t really care much about the brand but do care about the performance.Picture quality will beat any LED/LCD within 2~3 times its price.The only complaint is that the TV tints when the full screen becomes white.Doesn't bother me too much but i will drop a star becoz of it.Otherwise, I love this TV.", "Date": "February 10, 2013"}, {"Title": "It's my first big screen", "Author": "Walt Szymanowski", "ReviewID": "R20A84AXQ0HIM9", "Overall": "4.0", "Content": "It's my first big screen. I bought it because it fit the shelf to ceiling height limitation I had. Secondly, it was rated as a 'best buy' by Consumer Reports.So far I've been happy with its' performance. Controls are easy to use and intuitive.", "Date": "February 9, 2013"}, {"Title": "Great!", "Author": "Katie Barch", "ReviewID": "R11VVP5X4UHM30", "Overall": "5.0", "Content": "Needed a no frills tv for workout room, and waiting for this to go on sale. Tough to beat at $780!  It was cheaper during black Friday, but still worth the cash", "Date": "February 7, 2013"}, {"Title": "Samsung 51\" plasma TV", "Author": "LB", "ReviewID": "RDED5VXHX1GL9", "Overall": "4.0", "Content": "TV was delivered and unpacked by the delivery agent.  The picture quality is excellent.  The only problem I have is that occasionally the sound goes off for about a second or second and a half during a show or movie.  That can be quite irritating if it is during a critical point in the show. Otherwise, the TV is a great deal for the price I paid.", "Date": "January 28, 2013"}, {"Title": "Great TV, but then...", "Author": "Benito Sanduchi \"mealworm\"", "ReviewID": "R2L8V0PZ31U343", "Overall": "3.0", "Content": "I loved this TV, the picture is amazing, it was relatively cheap.  Nothing to not like.  Until.Watching a DVD tonight and all of a sudden the picture goes all wonky.  Tons of brightly colored pixels on the screen either not refreshing at all or refreshing incorrectly.  Turned off and on with no effect, tried other inputs, same deal.  Then we noticed the melting plastic smell.  Nothing on the outside felt unusually warm, but something in there definitely melted and stunk up our living room.We've had this thing less than a month with maybe a three hour average of on-time per day.  Obviously just a lemon, but still, buyer beware.Luckily we're still within Cstco's return window so I can return with the only hassel being packing it up and getting it back to the store.  I guess I'll get the same model and see what happens?", "Date": "January 27, 2013"}, {"Title": "My first flat-screen tv", "Author": "Jason Poss \"Ganobgab\"", "ReviewID": "R179LMO271F7UD", "Overall": "5.0", "Content": "Bought it at Best Buy in Little Rock for $602 (it was a 'floor model' - returned by original purchaser for unknown reasons, otherwise this model was going for $699.99) in early January 2013. 2 HDMI inputs as well as a cable jack, white and red audio out ports, digital audio out and some other ports I don't recognize. It's a plasma tv, 1080p resolution, dvds, blu-rays, and x-box look great on it...I don't know about the sound, I have home theater speakers for that.  The stand comes with it and it's not too heavy, 1 person could move it if needed.  You need to buy an extra accessory to get wifi on it, but our blu-ray player already does that, still that would be a cool function.  Consumer Reports lists this model in their 2013 buyer's guide as a 'Recommended' model, and Samsung has a great reliability record for this type of tv.", "Date": "January 7, 2013"}, {"Title": "Great TV", "Author": "LJ", "ReviewID": "R1AJ7ZXNA1AWUK", "Overall": "5.0", "Content": "After researching, I chose a plasma TV and it looks to me that Samsung was a great manufacturer. I am not dissapointed. The purchase price included special delivery where the guy brought it in the house, attached the base, turned it on, and hauled away the box and packing material.", "Date": "December 28, 2012"}, {"Title": "Great tv for the price", "Author": "Sandouble", "ReviewID": "R3CEFOCDWQJ8X3", "Overall": "5.0", "Content": "Great picture.  No light leaking like what you see with a LED or LCD tv in the same price range.  The sound quality is average, even after trying to adjust audio levels.  I wasn't thinking about purchasing a soundbar until after listening to the sound.  That being said, it's certainly not a deal breaker.  The HDMI connections in the back are stacked on top of each other, which makes it a bit difficult if mounting with a low profile wall mount, you may want to purchase some swivel HDMI connectors if you are going to use both.  The tv has been used for about a month and so far, no problems.  I was going to purchase a LED tv when I was hunting for a tv, but was surprised how thin this tv was for being a plasma.  I was able to play with it and look at the screen quality at my local Sears before purchasing, whiched helped with the decision.  Overall, if you're looking for a great tv for around $550, this is it.Update* August 2013:  TV is still performing well, with no problems.", "Date": "December 24, 2012"}, {"Title": "Works great for the price", "Author": "Hung", "ReviewID": "R3AATTDI67LR1J", "Overall": "4.0", "Content": "Great product for the price. I don't have any complaints with the sound, as others have noted. Please be aware that this is a bare bones HDTV device with no SmartTV features and only 2 HMDI ports and a component input, so you can only connect 3 devices to it. We only needed to hook up our set-top box and DVD player, so it worked fine for us.", "Date": "December 23, 2012"}, {"Title": "Love This TV", "Author": "P. Godbey", "ReviewID": "R2JM7QL1CZRVMP", "Overall": "5.0", "Content": "Based on on my budget and usage habits this set is perfect for me. I bought this TV to replace a 20 year old Mitsubishi rear projection set. Picture is great and setup was easy, I am usually happy with Samsung products and this one is no different. I have a HTPC running XBMC hooked up to it and it works flawlessly.The only complaint I have is the internal speakers are not the best, but then again they are not great on any Flat Screen.", "Date": "December 21, 2012"}, {"Title": "Samsung PN51E530 Plasma HDTV", "Author": "Behrooz R. Kermani", "ReviewID": "R2D0QGBV8R9P5S", "Overall": "4.0", "Content": "This i a very nice Plasma HDTV with excellent features, picture quality, 24P playback and color. overall a very nice TV and great in my living room also we have a huge bay window and its still bright.the only thing that made this a 4 star in my opinion is the sound quality of the speaker bar, you need to invest in a nice home theater sound system with this TV and your set.", "Date": "December 15, 2012"}, {"Title": "Beautiful tv!", "Author": "Nic", "ReviewID": "R2AFEYA2OWO2CQ", "Overall": "5.0", "Content": "I had the 42\" Samsung Plasma and replaced it with this 60\" inch. So far I have no complaints about this tv. It does only have two HDMI inputs, but since I am running everything thru my Onkyo receiver, I only need one HDMI input. The tv is so light for its size, weights the same as the 42\". I found the best price was at Best Buy (surprising), and delivery was free.", "Date": "November 24, 2012"}, {"Title": "Basic TV for a Great Price", "Author": "Luke the 4th \"May the 4th be With You\"", "ReviewID": "R1HQ6H6FA5XSP6", "Overall": "5.0", "Content": "This TV does not have a lot of the do-dads and watt-whose seen in more expensive models.  No 3-D, Netflix, etc.  What it does have is excellent picture quality and a great price.  The one doo-dad it comes with is a feature that allows you to plug in a USB drive and play media from it.  Sounds promising...sounds like it may not work too easily.  I am pleased to say that it does work very well (and is simple).  If you can plug a flash drive into a computer and play a video from it, you can work this feature.  No setup required. Plug it in, change the input, and locate the file.  The finding the file part is not particularly pretty, but does work well.The only difficulty I have with this TV is the inputs are all on the back.  Mine is wall mounted so it is difficult to access these.  This is not a big deal since it's not necessary to access them too often after setup.  There is 2 HDMI, 1 component, 1 coaxial, and 1 USB (for that awesome feature from above).  Along with optical audio out. Also, there is Ex-Link (I don't know what that is).As far as I can tell this TV works just as good as more expensive one's without all the extra stuff (which most Blu-ray players have anyway).  A great buy.", "Date": "November 28, 2012"}, {"Title": "Glass screen VERY reflective, No Swivel stand", "Author": "professor", "ReviewID": "R14QU72OYQCDXN", "Overall": "2.0", "Content": "I bought this to replace my three year-old 50-inch Samsung plasma that I loved, but that TV developed a line across the screen one week out of warranty. I just watch TV and didn't need any bells and whistles so for $599 I thought this was an excellent choice. Great size, amazing picture, small bevel around around the screen, and low price. Although the picture on this model is fantastic once you spend a few days playing with the settings, I was shocked by how much room reflection the screen showed. I have a Northern facing room with 2 small windows and the TV does not face them. However, even with that small amount lighting you could see every piece of furniture and every picture on the wall. Even at night with only one lamp on you could still see everything reflected on the screen. I hoped I would get used to it, but I found I was getting headaches trying to ignore the outline of everything in the room. Unless you plan to sit in a compltely dark room all day, this is completely offputting. There is absolutely no reason to have such a reflective surface on a TV - it is more reflective than even glass. One reviewer said this is a perfect TV for a couch potato and I agree, for a couch potato that wants to watch himself on the couch watching TV. The older versions of this TV were matte and this was not an issue at all.Also, this model does NOT come with a swivel stand despite the Amazon description saying that it does have a swivel stand. So yes amazing price and amazing picture in a basic model, but the design makes this unusable for a TV watcher who doesn't like to sit in the dark.", "Date": "April 11, 2013"}, {"Title": "Great!", "Author": "Ada Brothers \"Mila\"", "ReviewID": "R3SP673752796T", "Overall": "4.0", "Content": "So far I'm having no problems at all.  Great picture - I recommend you set the picture to Dynamic it's really amazing.  The only thing I would say is the stand is very flimsy but otherwise a GREAT buy for the price.  There is no buzzing noise like I read in some other reviews.  I'm very happy with it so far.", "Date": "December 26, 2012"}, {"Title": "It drove me so crazy that I had to return it and buy a different TV.", "Author": "Thomas Ella", "ReviewID": "R12F1JOKBQY25N", "Overall": "1.0", "Content": "Okay. So I saw this TV for about $510 from BlinQ, and obviously I couldn't pass on that price for a TV this size and quality, but in my excitement, I didn't read all the negative reviews before ordering it. Then I read one that said there was a ringing. I didn't think anything of it at the time. Then the TV came and I was so excited. I unboxed it and set it up and plugged in my PlayStation 3 and turned it on and... What's that noise?It was a ringing, just like the guy had described. It was awful. A really high-pitched tone that was driving me absolutely crazy. It wasn't as noticeable when I was playing a game or something, but it was definitely still there.My first test upon loading my PS3 was playing Tron: Legacy, which looked absolutely gorgeous on the plasma screen. Seriously, that movie is just perfect for that kind of screen. It's glossy and black and crisp and clear and futuristic. It's enough to make a man believe again. But that ringing, man. That RINGING. It was like my own telltale heart, just pounding away during every scene of the movie, every game, every song I played.Not only that, but that glossy screen looked TERRIBLE in the light. It doesn't matter how deep or true those black levels are if you have to put that TV in a room with a window and sunlight because you won't be able to see any of it thanks to the glare.And not only that, but it made games look headache-inducingly bad. I tried loading Guacamelee!, a colorful Mexican-themed platformer, and every time I opened the map screen, full of thin lines, and moved it around, the lines dragged or something and had that weird red-blue effect on the edges and it actually hurt to look at. Then I loaded up BioShock Infinite and just tried looking around but the same kind of effect happened. It looked unbelievably awful, even in \"game\" mode. When nothing was moving it looked really good, but c'mon.The worst part though, is that none of my friends could hear the ringing. I'd turn the TV on and immediately hear it and they couldn't hear it at all. Eventually, we did a frequency test online and found out that they just can't hear as high of frequencies as I can, so I guess this problem will only affect people like me with really good hearing, but then again, why would you want a TV where there's a chance you'll bring somebody over and they'll hear an awful ringing? They could totally see how awful the picture quality got with motion though.After maybe a week, I just couldn't take it anymore. I called the company and got a full refund. They were nice about it, but it was a pretty big waste of time regardless. I ended up getting the Panasonic VIERA TC-L55E50 and I love it. No, the blacks aren't quite as black, but it doesn't make an awful ringing noise, the glare isn't quite as terrible, and the picture doesn't give me a headache when things, you know, MOVE.", "Date": "September 11, 2013"}, {"Title": "It's perfect", "Author": "C. Dunn", "ReviewID": "R12M2N7EFIYX3A", "Overall": "5.0", "Content": "Wonderful TV. Great sound quality, beautiful picture, it's like my own personal movie theater! Very happy with my purchase! =)", "Date": "April 27, 2013"}, {"Title": "Love this TV...", "Author": "tampablu", "ReviewID": "R1O9TBCZPDNZ8T", "Overall": "5.0", "Content": "Initially wasn't going with a plasma, but I'm glad I did now.  Have two of them now...a Panasonic and Samsung and both have a superb picture and set-up a breeze.", "Date": "April 21, 2013"}, {"Title": "Amazing!!!", "Author": "Cassidy", "ReviewID": "R6X5EIJM3CZUU", "Overall": "5.0", "Content": "This TV is amazing my husband really wanted it!! Price was affordable I recommend this TV for any family because when you watch movies in the hd or with the blue ray you feel like you are their! We use to have my 36 inch TV in the living room so going from that to the 60inch was the best choice!!", "Date": "February 28, 2013"}, {"Title": "Fantastic TV for a Fantastic Price", "Author": "Andy in TN", "ReviewID": "R39XZZBAAIB36U", "Overall": "5.0", "Content": "I got an outstanding Black Friday price on this television, making it much less expensive than usual.  In addition, this is already a relatively inexpensive TV (compared to competition).  I did my due diligence and went to the obvious consumer product review sources to confirm that this was a highly rated product at a good price, then made the purchase.  Excellent picture clarity, good sound quality, and a great price--what more do you want from a television?  It has a limited number of inputs and outputs, so check that out before you buy if you want to connect quite a few things to it, but it was perfect for me.  I connected my Blu-ray player through the HDMI input, and my surround sound system through the digital audio output (even before the surround sound, the quality and volume is pretty good).It's not 3D and doesn't have a bunch of other bells and whistles with WiFi, etc., but I didn't need them.  For me, this TV was perfect.", "Date": "January 3, 2013"}, {"Title": "tv and picture were great customer service not so good", "Author": "cooter#1", "ReviewID": "R1ZVVGLGCCGKAY", "Overall": "4.0", "Content": "let me start by saying the tv and picture were great until we went over the warranty by 2 months thats right 2 months who would have thought we would have problems that soon well we called customer service to see if we could get any help at all we went through a series of people before we got somewhere. finally the cust service rep gave  in and said we will good will parts and labor  so i thanked them for the help as they made an appointment to have it looked at  well they sent a circuit board out that was not the problem  the said we needed a new screen so the tech ordered the screen they said they would call when it came in about a week they said.well when called the  tech he said to call samsung again so again up the ladder with customer service rep got back to the top again and was  told they were on back order because the screens were on production line  making new tvs  .after a long debate he said they were filling orders for new customers  so i than said  i am also a customer and without  me their might not be a repeat customer well that didnt get me any where either so i said i will go back to panasonic because  i have gotten 3-5 years out of them with no problems so why should you purchase a warranty ??? it is pure profit  well the have got my last dime  thanks for reading  samsung  51 inch  plasma hdtv", "Date": "November 24, 2012"}, {"Title": "Perfection in a TV", "Author": "Rich \"rls\"", "ReviewID": "RQENLBLWXT713", "Overall": "5.0", "Content": "I love this TV.  As it happens it perfectly fits the space I have for a TV ; I am presently using the stand but have remodeling plans so also bought the wall mount which looks like a great piece of equipment as well.  The picture is sharp, no fade out towards the edges which was vital for me as my mother has limited vision and must look at the set from the corner and at an angle to see any of the picture.  It is a beautiful set in and of itself.  It is so good I can't understand why I put off upgrading as long as I did. The colors are sharp, the blacks are  dark and do not fade to grey as with some models. It is not a fault of the set but I wish I had invested in an audio package as well.", "Date": "May 5, 2013"}, {"Title": "Great Bargain", "Author": "Brooks G Hartmann", "ReviewID": "RR4UVKPJVFP7B", "Overall": "4.0", "Content": "Outstanding picture and sound. The only downside is glare in a bright room.  I'v only had it a few weeks but so far, I would certainly recommend it.", "Date": "May 4, 2013"}, {"Title": "Great picture from any angle!", "Author": "Stanley R. Mahaffey \"Stan the man\"", "ReviewID": "R1RVH7HIXC1LF2", "Overall": "5.0", "Content": "Thanks Amazon for the best price and free delivery!  I researched this thru consumers reports, customer reviews and it is perfection good sound,  great clarity, non blur and realistic color when viewed from any angle!", "Date": "May 1, 2013"}, {"Title": "bad speaker quality, consider getting a speaker system along with this tv.  picture is great though.", "Author": "mm", "ReviewID": "R3LZCC2UF5302U", "Overall": "3.0", "Content": "speakers distort with low tones right out of the box.  surround sound system needed for this tv. the picture is good though.", "Date": "March 19, 2013"}, {"Title": "Exactly What I needed", "Author": "Matt", "ReviewID": "R37DCYZ28ECCL2", "Overall": "4.0", "Content": "This is exactly what we wanted when we ordered, however I do wish the base was a littly sturdier and there was another component input.", "Date": "December 31, 2012"}, {"Title": "Great TV!", "Author": "J. Corcoran", "ReviewID": "R3OE05E76DGJPF", "Overall": "5.0", "Content": "This tv is replacing my previous 42\" LCD Vizio. Though there are many battles about which type of tv is better between plasma and LCD, I am not going to get in to that discussion. The coloration in the tv is great, although it does require some tweaking when first taking it out of the box. It comes set up in energy saver mode which leaves everything kind of dull looking. Taking it off that setting and switching to \"Movie\" or \"Dynamic\" will make a world of difference. Additional changes to other various options will have the picture looking great. I would recommend anyone interested in purchasing this or any HDTV for that matter to read the specs before purchasing. There is not a \"One tv fits all\" so know what you want and find one suitable for you. For example, those who love having many HDMI ports this may not like this tv. It only has 2 HDMI spots. For me this was not a big deal. I have my 2 HDMI spots reserved for my PS3 and Xbox 360, and run my sound bar though the digital optical port. The speakers are not bad compared to the speakers on my Vizio but I would still recommend using a sound bar or external audio system.Great television for the price in comparison to other similar models. My only gripe (and it is minor) is that I cannot name my Inputs (such as HDMI inputs) what ever I want. On my Vizio I could name the ports PS3, Xbox 360, etc. This tv has pre selected input names (Bluray, Game, etc). Not enough to lose a star over. This HDTV is great for what it is. It will not be for everyone, but it was perfect for me.", "Date": "December 30, 2012"}, {"Title": "Great picture", "Author": "K. Phillips", "ReviewID": "R1JGRZL94XFNYN", "Overall": "4.0", "Content": "I bought this TV for my son and his family...the picture is great but my son was disappointed with the speakers on it..he wished the sound was better but other than that he loves the TV", "Date": "November 27, 2012"}, {"Title": "Samsung Plasma television (PN51D550C1FXZC)", "Author": "disgruntled consumer", "ReviewID": "R1FCOPKIYVO425", "Overall": "1.0", "Content": "If I could give this product less than one star, I would! Completely dissatisfied with the product. I bought the Samsung Plasma HDTV (PN51D550C1FXZC)on boxing day 2011. As of last week, it no longer works. Just before it died, it made a strange clicking noise that repeated for about a minute, then the TV would not start again. I contacted Samsung who told me they would escalate the situation and get me results promptly. If it was not for me calling them back, I would still be waiting for a response. When the customer relations people were contacted, they were rude and lacked knowledge. I was repeatedly, after only one phone call, never to call them again. This, after I was respectful and polite on the telephone. I kept calling, despite them telling me not to. At one point, I was clearly told by at least two customer service people that Samsung would pay the cost of the repairs and parts, then when I was transferred to another person, that agreement was retracted and changed all at once -- only the parts would be honored.Shame on Samsung for this kind of behavior! They do not stand by their word OR their product. I would NOT recommend buying any type of Samsung product -- EVER.Saskatchewan, Canada", "Date": "November 7, 2013"}, {"Title": "Rápida entrega  y Excelente producto", "Author": "Blanca Cortez", "ReviewID": "ROR5H3XFRJQ34", "Overall": "5.0", "Content": "Entrega en el tiempo estimado, producto en excelente estado, estamos muy satisfechos con la compra y con la rapidez en q entregaron el articulo comprado", "Date": "February 7, 2013"}, {"Title": "Awesome Tv- a must buy!", "Author": "s23", "ReviewID": "R2H5IAQ3BQDIE9", "Overall": "5.0", "Content": "I've had this tv for 2 months now & can say that this is my fav tv so far.  I just sold my 58 3d samsung plasma tv for this one & I'm glad I did.  It is has great picture, excellent sound if your not a big surround sound person.  I recommend this to anyone that is wanting a big brand tv @ a small price.  You wont be dissappointed!!", "Date": "February 20, 2013"}, {"Title": "Great plasma", "Author": "Steven Brown", "ReviewID": "R1K1RETQ1FQBRI", "Overall": "5.0", "Content": "I was very pleased with this TV. Unfortunately, I only had it for a month before someone broke into our house and stole it. There's a good chance I will buy another just like it, which is pretty high praise. You won't find anything better under $1,000.", "Date": "February 2, 2013"}, {"Title": "Good for the price", "Author": "217Tbone", "ReviewID": "R1PGN1DTAZPMOH", "Overall": "4.0", "Content": "I've been using for about 3 weeks.  Picture is decent, sound could be better though. Good, easy to navigate menus.", "Date": "December 2, 2012"}, {"Title": "Picture?", "Author": "mblankford", "ReviewID": "RUSHADS0NEIEL", "Overall": "4.0", "Content": "I dig the TV, it is big enough to be awesome but not overwhelming.  We have it in a den that doesn't get a ton of extra light, so the plasma is perfect.  I do wonder about calibration?  I didn't opt to pay an arm and a leg to have someone deliver/setup because it seems ridiculous.  That said, the picture is ehhhh....sometimes, and I have monster cables going to it.  Any ideas?", "Date": "April 26, 2012"}, {"Title": "I hate this TV almost as much as I hate SAMSUNG Support", "Author": "vatechtom", "ReviewID": "R3GUGMFU3TGWXF", "Overall": "1.0", "Content": "I bought this tv about 2 months ago, and mounted it, it looked great mounted and the picture was nice.But after a while i noticed this incessant buzzing. I tried unplugging everything except the TV, still buzzing.Samsung sent one of their repairs guys to check it out, he said he couldn't do anything, some samsungs buzz.I called samsung, they wont budge, they offered to send another repair guy.I dont even turn this thing on anymore, its a 60\" eye sore.", "Date": "July 23, 2012"}, {"Title": "Great return!", "Author": "Kathy", "ReviewID": "R2VEEADFPRFOCU", "Overall": "5.0", "Content": "The television I purchased was a very good price and arrived promptly. I had originally wanted a different brand but was unable to find it. After ordering the Samsung from Tigerdirect I was able to find the one I wanted locally. It was too late to stop the order so I was a little worried. I returned it on the truck that delivered it. It took 2 or 3 weeks but they credited it fully. They were a good company to deal with & I would not hesitate to do business with them in the future.", "Date": "April 4, 2013"}, {"Title": "I wish I bought this at a store so I could return this trash", "Author": "Kyle Altman", "ReviewID": "R8064VOLHVAQP", "Overall": "2.0", "Content": "I received the TV on August 31st, a day after the stated delivery dates. I handled the TV very carefully... having two people lift it into place, using the provided ferrite cores, not placing it in a overly hot or cold room or in direct sunlight or near anything magnetic, etc... I set it up on the provided stand and hooked it up to my cable box with a (brand new) HDMI cord and my Nintendo Wii with RCA cables. It was working perfectly with light-to-moderate use up until September 3rd. My wife turned on the TV and watched the morning news and then turned off the TV to go run some errands... everything was working normally. When she returned a few hours later and turned on the TV, the entire left half of the screen was solid white with a bit of black flickering boxes... completely obstructing the left half of the picture. I switched the TV picture between the cable box and the Nintendo Wii to make sure the problem wasn't with the cords, but the picture was still obstructed no matter which input I was viewing. The sound is still working normally. There is no visible damage to the TV. I attempted to do the self-diagnosis, but since the menu pops up on the left side of the screen, I couldn't see the menu options. I paid a good deal of money for this brand new TV and I specifically did not buy a refurbished floor model for the fear of issues just like this. I've had it for less than a week... not even enough time for it to collect any dust! Now I can't even use it and when I called the Samsung Tech Support number, (after being on hold for a half hour, the customer service agent was very rude and insulting) they said they can't even send someone to come inspect what's wrong with it for another 2 or 3 weeks?!?!?!  I would very much rather have a new TV sent to me at no additional cost rather than wait for a tech to attempt to repair this BRAND NEW model. Is that too much to ask? But tech support said they \"had to make several attempts to repair the product before even considering to offer an exchange\". So for the next month, I get to stare at a broken TV that I can't turn on, wait for a stranger to come into my home to try to fix it, and think about how else I could have spent my hard-earned $700 dollars. I am obviously very discouraged about buying any Samsung products or using this seller (Abt Electronics) ever again.", "Date": "September 4, 2012"}, {"Title": "I never got it", "Author": "S. Wenhold IV", "ReviewID": "R2KF4U6FTRI5HK", "Overall": "2.0", "Content": "I honestly can't say I like this tv or not, because when I finally got it the screen was busted like a windshield after Rosie odonnel sits on it. That and when it would power on there was no picture of course, and the audio was just a harsh buzz. I know this should be a shipping review, but there was nothing wrong with the packaging, and I hope the shipping company wouldn't be the kind who drop TVs out of 3rd story windows, but...", "Date": "July 1, 2013"}, {"Title": "DOA - With No Exchange in Sight from Amazon!", "Author": "RDWIowa", "ReviewID": "R2AKRZRSCCQ7F6", "Overall": "1.0", "Content": "Purchased during Freaky (aka Black) Friday - sale price. Unit arrived and was delivered by CEVA inside home (Amazon White Glove Service) - driver opened box and did cursory exam of screen (did not remove from box) then left. Removed from box and hung on wall next day, turned on and...no picture and loud audio buzzing. Called Samsung Customer Care Center - representative had me inspect screen carefully for cracks. I had not removed the plastic protective covering on the screen so the crack was not easy to detect until prompted to look for one. Found one approx 12\" from top on right side up against black margin - about 3/8\" long. Samsung immediately stated crack was to blame and unit must be returned to seller (Amazon) for replacement. FYI - have now found AV forums with several complaints against Samsung for cracked Plasma screens following purchase.Called Amazon Large Item Return Department and was told there were no inventory left for this model. There was no way to immediately exchange my defective plasma screen because Amazon had no stock. The rep could not tell me if any more were on order or when any would be in stock. I could understand that this rep may have limited info available so I asked for a method to contact another department in Amazon to determine these 2 questions: 1) do you have more of this model on order from Samsung (yes or no) and if yes, 2) when is an approximate date you will see that inventory. These two questions would allow me to determine if I had any chance for an exchange in a timely manner.I was still told there was no one or department within Amazon that would be able to address my 2 questions.So - I'm repacking the unit in it's box and having CEVA come pick it up and return it to Amazon. I'll get a credit but no replacement TV. If, I am told, Amazon does get more of this model in from Samsung, then I can re-order and get the sale price rather than a regular price. I'm not sure how patient I want to be at this point.The experience has been less than satisfying. Was the sale price a deal? Sure! Was Prime Free Shipping a deal? Sure! was it worth the disappointment and hassle now? I'm not so sure.", "Date": "December 2, 2012"}, {"Title": "Good TV but no swivel stand.", "Author": "Marco67", "ReviewID": "R1H3P6HTOR4UFV", "Overall": "2.0", "Content": "This TV has a good definition but even if in the Amazon product description it says that it comes with a swivel stand, it is not the case.Too bad because I really wanted a swivel stand.", "Date": "April 4, 2013"}, {"Title": "Be careful, buying a TV at the moment is like buying a PC and there are serious gotchas...", "Author": "Cannon", "ReviewID": "R1990X9LH27CO", "Overall": "2.0", "Content": "Be careful, buying a TV at the moment is like buying a PC and there are serious gotchas...I wanted the 1080P PN51E530 for gaming, but was forced into buying the lesser brother- the 720P PN51E450...For comparison between the two models, here some details...---------------------------------------------------------------SUMMARY:I gave this Samsung 2 Stars instead of the 4 it deserves! Why? Because Samsung are refusing to make the FULL-HD 1080P model (PN51E530) available in my region. Instead the Samsung reps are steering customers to more pricey LED TV's with 3D or SMART TV! For reasons stated below, this isn't a good thing. Its similar to how PC manufacturers are pushing customers into buying overpriced Windows 8 Ultrabooks, when cheaper Windows 7 / XP Netbooks will suffice.My advice is hold out for the 1080P model. I wanted Full-HD for Xbox gaming, so its disappointing! If like me, you can't get the 1080P then overall the 720P is a solid entry-level large-screen TV as many pro-reviewers are saying. BTW: I also looked at the LG 50PA4500 and the Panasonic P50X5 for purely economic reasons, but both earned sub-par reviews versus the Samsung, especially the Panasonic. I even looked at the 46 inch Sony range i.e. Sony Bravia BX453 / BX427 / BX427  purely for the 1080P, but decided against due to the comparably high prices in my area and the lacklustre pro-reviews. Also at home, we have a 720P Samsung from 2006 and its still going well with no screen burn-in even for such an old model!---------------------------------------------------------------GOTCHAS:Overall the Samsung is a capable entry-level large-screen TV. Its one of the better Plasmas too for the price according to online pro-reviewers. But its not 1080P though and I couldn't find a 1080P TV that wasn't LED. LED commands a costly premium for a 3D or Smart badge, both of which are 'questionable features'!Its a horrible time to be buying a TV as over-hyped 3D and overrated SMART LED TV's dominate the retail landscape where I live. It means few economic special offers. The PN51E450 is about the best bet if budget is of primary concern, and like me you've given up on buying a future-proofed TV and are instead accepting an 'OK' TV for now, in the hope that in the future 100 inch flexible screen mega-monster TV's will be here!Its also a horrible time to buy, as 3D and SMART TV gimmicks are unnecessarily increasing prices without corresponding large leaps in picture quality. For instance a laptop connected to the TV via HDMI operated using a wireless USB keyboard will far surpass any SMART TV's onboard software. This is especially so if the laptop has a modern web browser, and a free media player like VLC, that can play every format and rotate photos and videos from landscape to portrait. Moreover, support for 3D is patchy with manufacturers and content providers strategically retrenching from it. BTW: I have a 17\" gaming laptop that uses active shutter 3D glasses. I hardly ever use the 3D feature anymore, as you have to turn up the lighting within the game or power options and it reduces clarity. Its better to run the game at full 1080P resolution without 3D! However, 3D TV is great for animations and animated films but little else IMHO!---------------------------------------------------------------PROS1. PRICE - PRICE - PRICE!2. The USB player is better than I've encountered in the past. Before, I found TV's needed CODEC updates before being able to play a host of different video files. It has a Time Search feature too to skip to a section of the movie. And unlike my previous experience with Philips the Audio doesn't fall out of Sync with the video when you skip forward or back.3. No Smart TV or 3D. I see this as a Pro as it means I'm not over-paying for something that I don't need and which is functionally lacking! Smart TV...'even its name is a dime store joke' to quote Mickey Rourke in Angel Heart. Please no one buy a smart TV thinking its a panacea and a laptop substitute. It is no substitute for a laptop connected to the TV that has VLC or some other Open Source video player that can play any format and rotate video from landscape to portrait, never mind a web-browser substitute. Even a cheap netbook connected to the TV using a wireless USB keyboard will do better. In addition, leading experts say 3D is no longer being invested in by the industry and so is a waste.---------------------------------------------------------------CONS1. The glossy screen makes for difficult viewing during the day as reported in other reviews. This is not a problem for me as I mostly game or watch TV at night, but other reviews on CNET have commented it is off-putting.2. I've had to downgrade in-game graphics to 720P (1280 x 720) otherwise some games run slow even on cutting-edge gaming laptops. Why is that? Games should run in 1080i just fine! Not sure what the cause is yet...3. TV has some HDMI sound issues between games, requiring reset of the TV or computer. further investigation is needed. Had similar problems with a Philips. HDMI is not as reliable as VGA and a sound system!4. SD cable TV signals look bad. i.e. ESPN and Fox Sports. But this isn't the fault of the TV, rather it's the crappy Cable SD signal looking awful on such a large Plasma. SD Dramas look ok. My net + cable provider is cheap but stuck on old SD tech.5. The PIN feature doesn't lock the set. I like to have the LOCK feature in the event of theft, it makes the TV harder for criminals to fence.6. Only two HDMI ports, but I plan to use a $20 remote control HDMI switcher which is fine for a camera etc. But its not what you want for a laptop and a game console.7. No VGA. VGA is handy for troubleshooting quirks with HDMI which are frequent, or if a friend visits with a legacy laptop and wants to show you their holiday photos etc.", "Date": "April 8, 2013"}, {"Title": "my experience", "Author": "caedora gardiner", "ReviewID": "R3ETDKTAFHBFRJ", "Overall": "1.0", "Content": "I got my product from blinq for 510 dollars and it was \"like new\"-i must say i was really disappointed. They have never let me down before but i guess there is a first for everything. First let me just say, my product got to me about six days after the expected date. I was waiting everyday for this product and it arrived so late to me that i was able to take a trip to new york and come back and still hadn't received it. Then when i finally did receive it, the front screen was shattered. And i do not mean like a break or crack, it was completely shattered. I was so upset. I tried to call and got the automated system literally 27 times. Then finally someone picked up and sounded like they could care less about my problem. I asked for this tv to be replaced, only to hear that they did not have anymore. BY the way, this was my graduation present to myself from graduating college- what a present right?Anyways the tv finally got send back and i am now waiting for my refund, in the mean time, i went on another companies website and ordered a \"like new\" smart tv for less then 700 bucks. so its all good.........now!", "Date": "May 24, 2013"}], "ProductInfo": {"Price": "$999.99", "Features": "Real Black Pro Panel\nConnect Share Movie\n600Hz Subfield Motion\n1080p Full HD\nTV with stand (Width x Height x Depth): 46.8-Inch x 30.8-Inch x 9.9-Inch, TV without stand (Width x Height x Depth): 46.8-Inch x 27.8-Inch x 2.2-Inch", "Name": "Samsung PN51E530 51-Inch 1080p 600Hz Plasma HDTV (Black) (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/31aibqOinZL._SX300_.jpg", "ProductID": "B007BG47BE"}}