{"Reviews": [{"Title": "Not bad(then I found a tip, and I rate it very good)UPDATED", "Author": "Mark Fellows \"Gadget Guy\"", "ReviewID": "RI4IY9PHAME41", "Overall": "4.0", "Content": "Updated this review on April 18th, 2012 Look Below >>>>>>>>>>I have had this tv for a few weeks.  The choice was between this one and a cheaper Panasonic that had lots of good reviews. When I went to the store, I expected to buy the Panasonic, but this one seemed to have a better picture.  The clincher was the sound quality.  This one was much better.  I could actually hear this one, but the other one sounded muddled. Maybe the speakers were blown on the Panasonic, but I couldn't hear it.  Since I have a wood pellet stove, there is a lot of background noise in my living room, so I needed good sound.  This one has some equalizing scheme that allows it to sound better at lower volume. Perhaps Toshiba pumps up the gain on the highs which makes it easier to hear.As for the picture, it is fine.  Not near as bright as my friends TV of the same size that cost over twice as much, but okay for what I want it for, which was primarily to watch netflix at 480P.When you first hook up the tv, it asks you if you want to take it out of \"store mode\"  Which is why it looked so great to start with... I guess it pumps up the brightness, and contrast so it looks great in the store, and makes people want to buy it.It isn't quite as bright as it looked in the store, but it is fine.I don't regret my purchase, and as long as it turns out to be reliable for years to come, I will be satisfied with my purchase.I could use some separate composite inputs.Overall, it is fine.I increased the rating of this TV to 4 stars after I found the following EXTREMELY HELPFUL TIP ON A BEST BUY REVIEW posted by USofANDY.\"The picture looks excellent, however, I did need to make a lot of changes to the menu settings to achieve this - the picture is too dark at default settings but the two key settings to remedy this are the energy saver settings and backlight intensity.Turn off energy saving and crank up the backlight and you have a very bright picture, the remaining settings can be easily calibrated to your preference.Make no mistake, I love the picture quality and the screen itself has low reflection.\"The picture was always nice, but the first thing I noticed was that it was a little dark.  I didn't like it, but could tolerate it.  Turning that energy saving mode off, made a HUGE difference!  Now I have a nice bright picture, which looks much better.I am really glad I found that tip by chance, and I hope you find the tip either on Best Buy, or here on Amazon.That one little tip made me give it another star.  Now I am completely satisfied...James Ruffin Says:\"1. Hit the menu button,2.go to \"preferences\" in the menu3. press the down arrow key to scroll down (the energy settings are sort of hidden at the bottom),3. hit the enter button to select energy savings4. Set auto brightness sensor to \"off\"Picture should be much brighter. \"", "Date": "March 28, 2012"}, {"Title": "Exceeded expectations!", "Author": "Tom O.", "ReviewID": "R3QAGUWR2KISWY", "Overall": "5.0", "Content": "I purchased this 32\" LCD TV as a \"slick deal\" recently, which means I found it at an uncommonly low price, and purchased it on a whim.Out of the box, I was pleased to learn that the picture quality was going to FAR exceed my expectations. I have discerning taste, and I can say with a clear conscience that the picture quality of this set is on par with what I've seen from Sony & Samsung. The black is black, the contrast is great, and the colors really pop. It is truly a stunning picture! And completely unexpected from a set of this price range (and brand name).I read reviews that disparaged the sound quality before I received the TV - but I was pleased to learn upon setting it up that the sound quality was fine. It's average, mind you, but not terrible. I have it currently set up in a 14 x 23' carpeted & fully furnished family room and it sounds fine. I just wish it had an \"analog audio-out\" port so I could hook up one of my subwoofers to it.Besides the picture quality, the HDTV antenna reception was an unexpected surprise. It's outstanding! I don't have an antenna connected to the TV, yet it pulls in every local channel that I get on my other LCD TV (that has a highly rated Leaf antenna connected to it)! In fact, this Toshiba TV provides BETTER reception than my other TV. None of the channels \"come in and out.\" They just work, all the time, clear as day, in high def.  Pretty impressive stuff! [In the spirit of full disclosure, my other LCD TV is a few years old and might not have a great tuner. So maybe all LCD TVs have great in-the-box reception these days. Take my feedback for what it's worth.]All in all, I'm very impressed with this set from Toshiba. I never would have purchased one of their sets if I hadn't gotten such a good deal on it, but now I've opened my mind to their TVs. They certainly did a good job with this one! Particularly around the picture quality and over-the-air HDTV reception.Quite impressive for this price range.", "Date": "March 11, 2012"}, {"Title": "I am mostly happy with this TV", "Author": "L. K. Sterling \"voice of gabriel\"", "ReviewID": "R2VA0XCFK9GGZ6", "Overall": "3.0", "Content": "The picture is very sharp and it is much better than I expected for the price.But I have one big complaint and one smaller one.The small complaint is that the remote is oddly designed.  Some frequently used buttons are very tiny and poorly labeled.  The mute only goes to half mute when first pressed.  If I wanted to turn the TV down, I'd turn it down.  I expect the mute button to mute the TV.The large complaint is that the audio is not very bright.  The maximum sound level is barely enough for me to hear over my fan or when I am cooking.  If you like to watch TV loud or if you are putting it in a large room with background noise, you will be disappointed. I am going to have to buy some external speakers.  I am not a gamer and don't care about extra bass--I want a crisper sound in the midrange/human voice levels.  I keep rewinding to hear what is said during movies and dramas when conversations are soft.  News shows and game shows are OK.That said, the picture is very sharp.  It is my first HDTV so I have nothing to compare it to but the picture is very nice, and I was expecting to pay a lot more.", "Date": "August 8, 2012"}, {"Title": "Great for a bedroom tv", "Author": "reviewer88 \"reviewer88\"", "ReviewID": "R3UCYB9YPNHTW0", "Overall": "5.0", "Content": "Got this television for my bedroom because my old television broke. I was tossed up between this television, and the Panasonic VIERA TC-L32C3, and picked this. At the time there was a negligible difference in price, under five dollars difference. This was a great deal for a tv that is barely used. The main reason I picked it was the screen the panasonic had was an IPS screen, after looking online, although I had trouble understanding the specs, the info led me to believe this is brighter as it has a different style of screen.(Wikipedia IPS and CCFL) The picture is crisp and sharp and the sound is fine for a bedroom, it is currently more than loud enough On half volume at 10 feet away. The only cons I had was I had to screw the stand on to the television, and the remote feels cheap, although it works well. The USB function does not play video for me so it was essentially useless, and the screen defaulted at 4:3 and I had to set it to 16:9 so the image would fill out the screen. I know I am nitpicking because all the cons with the exception of the remote were easily solved. In the end there are televisions better than this one, but not at this price.", "Date": "March 30, 2012"}, {"Title": "Good TV for Kids or Bedroom", "Author": "James Ruffin \"jrstriker12\"", "ReviewID": "RPI4W8R62U0YM", "Overall": "4.0", "Content": "After my old CRT TV died in my bedroom, I was looking for a decent TV with a good match of features and value. I didn't need anything fancy since I use it to watch news/weather/traffic in the morning or as a TV for my daughter to watch cartoons. I am very happy with this Toshiba as it has a good set of inputs, a decent picture, and a reasonable price ($250).Anyone buying this TV should read the review by Mark Fellows. You have to turn off the auto brightness sensor to get a sufficiently bright picture (see instructions below) or keep it in \"retail\" mode. I took off one star for the frustration of trying to find the energy saving options.  Turn off the auto brightness sensor and you'll be more than pleased with the picture quality.How to turn off the auto brightness sensor:1. Hit the menu button,2.go to \"preferences\" in the menu3. press the down arrow key to scroll down past the REGZA-LINK options (the energy settings are sort of hidden at the very bottom, off-screen),3. hit the enter button to select energy savings4. Set auto brightness sensor to \"off\"Picture should be much brighter.", "Date": "June 16, 2012"}, {"Title": "Great value so far", "Author": "Dino Saur", "ReviewID": "R2OP3GSO6X8VOV", "Overall": "4.0", "Content": "We bought this TV to replace a 27-inch tube that blew. We've had it a week and we're pretty happy so far. We bought it in June 2011 at HH Gregg in Myrtle Beach after reading online reviews. Paid $270 inclusive. We'll be using it as our main set in the living room, primarily to watch cable tv. It is comparable to the 27\" tube we had; just wider. If money was no object we might get a slightly larger one but it is adequate for our needs. I have a larger, older projection model I'll be setting up in another room for football.  Picture and sound are both very good for this price point. Sound is not overwhelming but this type tv doesn't have much room for speakers. We live in an older house with a good-sized living room and it's plenty loud. Movies might be a problem since the jacks (\"ports\"?) don't match my old dvd player. There's no yellow jack and hooking yellow to other jacks yields a black&white; picture. Guess we'll have to buy an \"S video\" or \"HDMI\" cable. That's all Greek to me; I'm a Triceratops. But I'm sure something can be worked out. It would be nice if Toshiba had included a manual to explain this sort of thing. As noted elsewhere, it takes its own sweet time changing channels, so if you're a channel-surfer you might want to look elsewhere.I was concerned over reports that models like this one with fluorescent backlighting/edgelighting (as opposed to LED) might be difficult to view from extreme angles off to the sides. I checked this out in the showroom and at home and I don't find this to be a problem at all. Unless I'm standing next to the tv, I can see just fine from any angle or distance.  Setup was pretty easy. The stand screwed right on and I only had to make about four or five choices on the setup menu and the scanning began. About ten minutes later we were watching tv. Five minutes later we had our two universal remotes synched to it. Speaking of remotes, for some reason you have to press the button twice to mute the sound. First push just yields half-mute(?)  We can't speak to durability but I was reassured to find that Toshiba recently merged its LCD screen production with Sony and Hitachi in some sort of Japanese gov't.-sponsored deal. This model comes with a one-year parts & labor manufacturer's warranty.", "Date": "June 20, 2012"}, {"Title": "Great balance of economy and quality", "Author": "Lee M. Roller", "ReviewID": "R150LO4JVNZ3Y5", "Overall": "5.0", "Content": "I am extremetly happy with this set.  I have had its' 40\" companion model 40E220U in my living room for several months so I already had a pretty good idea what I was getting.  I actually purchaed two of these.  One for the master bedroom and one for a guest room.  I have found this line of Toshiba sets to be affordable with a very good picture once set up properly.For those who have complained about the picture I think it is only fair to point out that the proper settings on ANY television make all the difference.First, as has been mentioned in other reviews, turn off the auto brightness sensor.  Under the preferences menu scroll all the way to the bottom, past the Regza-Link control option to the Energy Savings Settings (this item is scrolled off the bottom of the screen initially  below the Regza-Link option).  Select that item and turn the auto brightness sensor off.  You will immediately see the picture brighten.Next make sure the basic adjustments in the Picture menu are set well.  Go into the Picture menu and try the following range of settings.Set the Picture Mode to 'PREFERENCE' (you probably set it to STANDARD in the initial quick setup)Go into the picture settings and try the following range of values play around with them since there are small varaiances beetween sets and between environments...CONTRAST  90 to 96BACKLIGHT  90 to 96BRIGHTNESS 55 to 58COLOR  45 to 50SHARPNESS  5 to 8As I said, play around with it a bit to suit your room and your taste but I find these settings to be very satisfying and the calibration disk I use bears out that they are as they should be.One other note, you will need to repeat the picture settings for each input.  Antenna, HDMI1, HDMI2, PC...they all have their own settings that the set \"remembers\".  This is good if your cable or satellite box gives a \"hotter\" picture than your DVD, unless of course you are running all your switching through an AVR (which I do in the living room, however  my DirecTV and my BluRay look equally good on the same setting on HDMI1)", "Date": "September 15, 2012"}, {"Title": "Great Value/Great Television!", "Author": "A. Hansen \"AH Booklover\"", "ReviewID": "R1Y8PA28ZV38Y1", "Overall": "5.0", "Content": "My son wanted a bigger television for his bedroom but we refused to spend too much on a kids television.  This was a \"cheaper\" television but it turns out we were actually really pleased!  The set up was easy, it was an easy set up with the xBox, and the picture is super!  The speaker sound is as good as to be expected when you don't have a home theatre system set up.  But, this is in a bedroom so the sound is perfect.  I cannot find a thing wrong with this or any reason to be unhappy.  This is the first Toshiba we have owned, and I would consider this brand in the future!", "Date": "July 21, 2012"}, {"Title": "Better than good, But not great.", "Author": "CaliNative", "ReviewID": "R2PDMDR33HYNWH", "Overall": "4.0", "Content": "I am in college now(as a freshman) so i had to buy a new tv, which is a must-have for any dorm room. For $220 and free shipping, the TV got to my dorm the same day i arrived, and it was not damaged in anyway, (it was fulfillment by Amazon). I read a few reviews previously about this tv and how it has sound problems and doesnt always turn on. All i have to say is that i disagree with everything that read.In my opinion the sound could be better, but it really doesnt matter, i mean if you need it at 87 to hear it perfectly then thats what you leave it at, there is a reason why it can go up to 100. Although i dont even need it to be that high, i actually keep it around 15-18 when going to sleep, so i dont keep anyone up at 3am, and i can hear everything fine. but during the day i usually have it at around 30-40 just because i like my stuff loud. I will say that i actually like the mute button because the first time you press it it only halves your volume. But everyone that is complaining about it needs to chill out, i mean all you have to do is press it two times, i mean your finger is allready on the button, HOW LAZY CAN SOME PEOPLE BE!!!Also, you definetly need to change the brightness settings by taking the energy saver off. it makes an incredible difference to the picture quality. I used to have a vizio which is a great tv and Always has great reviews, and i think that this tv has pretty much the same quality as my other hdtv. so the two things that actually matter about the tv are actually great for the price.The only thing i dont like about this tv is that the remote is retarded, it only has two hdmi ports, and it does not have picture in picture mode. My vizio had it, so i was really bummed that it did not have it on the toshiba. However The tv does have a favorites button which i have never seen before. (in college there is no cable box, so it is cool to have a favorites button on the actual tv itself).I would definetly choose to buy this tv again if i could go back in time.", "Date": "August 22, 2012"}, {"Title": "Great Picture; Easy Setup; Perfect First HDTV", "Author": "Vishmandu \"Born To Shop\"", "ReviewID": "R127BG0A8PAORA", "Overall": "5.0", "Content": "This is our first HDTV and replaces a Toshiba 19\" color CRT TV that's about 15 years old (and still worked as good as new).  We watch TV only for the occasional DVD or national emergency, etc., so our requirements are very low, maybe 1 or 2 DVD's a week, tops.  We just leaned how to stream movies from Youtube and Hulu so we might increase our viewing, but seriously, who has the time?  Anyway this Toshiba HDTV was a super buy from our perspective.  It allows direct hookup of a laptop, and has a USB input, so we can view digital camera photos right off the SD Card; really convenient and absolutely the best way to show photos to friends. The picture looks amazing to us, which you might expect coming from a much older analog CRT display, but we compared this to a Panasonic and a Samsung, which were much more expensive and no better picture.  Another advantage to this relatively smaller screen is the unit can be lifted with one hand.  We store the TV behind an antique Victor crank victrola that sits in front of a picture window, looking out on the Appalachian mountains.  We did not want the TV to spoil the view, so it sits on the floor behind the victrola till needed, then I just lift it off the floor onto the victrola cabinet and we're ready to view.  When done I just put in back on the floor and cover it with the foam dust cover it shipped with.  The poor man's hidden HDTV setup.  I had to rig a strap using two of the wall bracket mounting bolt holes on the back of the unit; no problem.  It's almost too easyWe have a DVD player and a VHS player piggy backed onto the composite video inputs, which seems to work fine.  I used \"Y\" connector RCA plugs, two female in to one male out.  There does not seem to be any loss in picture quality, but we don't have an HDTV DVD player.  It just puts out 480dpi so there's not a lot of HD to be lost.  There really is some advantage to not being spoiled with super high def expectations.  I find the control easy to understand and use, with the most frequent adjustment being for picture size.  This is a button on the control you just keep pushing and it rotates the picture through the various sizing options till you stop at the one you like.  This feature is also nice when displaying digital camera photos.  The sound quality and volume is good.  You may get some buzz with high volume of really dynamic sound, but you can use the audio capability through the RCA connectors and run it to a stereo system.  We haven't found the need.  We sit about 12 feet from the screen in a fairly large room and are delighted with the viewing.  Remember we are coming from a 19-inch CRT, so it doesn't take much to beat that.I'm sure we are using this unit at the lower end of its capabilities, so I am not describing all its more sophisticated features.  HDMI will be used for displaying streaming through a Macbook, but I haven't gotten around to get that implemented.  The signal from my PC laptop through a 20-foot VGA cable is just great, using the VGA input port on the unit and a separate stereo sound patch cord from the headphone output of the laptop to the same connector input on the Toshiba.  You have to tell the TV to use the PC input and analog sound but that is an fairly easy menu access and adjustment.Overall a good TV and a great price.", "Date": "August 1, 2012"}, {"Title": "Fantastic no-frills HDTV", "Author": "KaneRobot \"kanerobot\"", "ReviewID": "R3DM2TPX2OPQHU", "Overall": "5.0", "Content": "This is right near the top of HDTV's I've seen as far as bang for the buck. While they don't throw in a lot of the bells and whistles (ie built in apps, tons of connection options), I wasn't looking for any of that. I just wanted a bedroom TV that looked good and was affordable. This is about as good as it gets in that regard.While it is only 720p, it is highly unlikely anyone really needs 1080p at a size of 32\". Unless you're sitting with your nose on the screen, there isn't really going to be a difference. Blacks are excellent, very close to LED quality. It even includes a VGA input, which is becoming more and more rare for the less expensive sets. Between 2 HDMIs, one component, one VGA, and the antenna, I'm more than satisfied at this price.TV cosmetically looks fine, no annoying lights while the TV is operating and no ridiculous \"touch of color\" style stuff like you see on Samsungs (nothing against Samsung TVs, but I hate how the ToC style looks).Admittedly the built-in sound is kind of \"meh,\" but again, at this price I'm not expecting theater quality out of my speakers. The built-in speaker is fine for your run of the mill TV watching if you're just watching Simpsons reruns or whatever, but if you're settling in for Game of Thrones or Band of Brothers reruns you're probably going to left wanting if you're just going through the TV speaker.Also, off angles are not the best compared to other recent HDTVs I've seen. They are not awful, but this is something you're going to want to be sitting pretty straight on in front of. Pic begins to look a tad washed out as you move to the left and right.Despite those minor qualms, highest possible recommendation. I'd advise getting the warranty, as due to the low cost of the TV itself, the warranty is very cheap as well (around 30 bucks).Couldn't be happier with this purchase so far (about 2 weeks in)....just be sure to turn off that auto brightness thing (sort of hidden under the energy saver settings in the preferences menu) as soon as you set it up. Yuck.", "Date": "July 8, 2012"}, {"Title": "worked great... for an hour", "Author": "Kevin O'Brien", "ReviewID": "R1LW2RB5SVAFHS", "Overall": "1.0", "Content": "This was one of the few TV's in its price range that had VGA/PC audio input jacks, and i used it accordingly for a bedroom setup with a media center PC.  Worked great for about an hour, but then the top 40% of the screen started bleeding white colors upwards into the bezel, and the very bottom had a bright blue line going across the screen.  The box was undamaged, and the tv itself had no visible issues, so I might have had a dud (manufacture date was july 2012, so no help there either).  To be certain, I disconnected the VGA/PC inputs and used an HDMI input instead for a different device (xbox360), and same results.  After reading through the reviews I also noticed one other issue that a few people were having: the remote would only work intermittently despite having a new set of batteries in it.  Back it goes, very disappointed but props to Amazon's great return policy.", "Date": "September 4, 2012"}, {"Title": "Toshiba LCD TV 32C120U - less than a year old and already dead", "Author": "horsegirl2013", "ReviewID": "R20T4AUOP7EXZ6", "Overall": "1.0", "Content": "I did not get this TV from Amazon, but from Best Buy, and I just want to put my review up for people thinking about purchasing one. I bought this less than a year ago and was happy with it until a couple of weeks ago. I got home from work, turned it on, and there was sound but no picture - the screen was black. After about 5 minutes, the picture finally came on, so I went through the manual and reset everything, to try to keep it from happening again. The next day, and for about a week and a half, it was working fine. Yesterday, it was doing the same thing - turn it on, and there is sound but no picture. The picture eventually came on last night, but this morning, I turned it on, and again there was sound and no picture. The picture has not come on at all today. Go figure, I am not sure where I put the receipt for this, so I am probably out of luck. I guess I will be hooking my old tube TV back up in the living room - about 15 years old and still works, unlike the les than year old Toshiba. Bottom line - don't buy this TV!", "Date": "February 10, 2013"}, {"Title": "Decent Value", "Author": "Nutterbutter \"Sam\"", "ReviewID": "RZ63GCKHIALBN", "Overall": "3.0", "Content": "Positives: price ($237); quality; picture, and the assumption that the Toshiba name means it will hold up longer than a Coby at same price.Negatives: reaction speed (changing channels, turning on); DVD inputs; remote (button placement, size, illumination)Basically, I have similar comments to other reviewers (see above) - I would have rated this TV a 5 based on price, but gave it a 3 because I cannot believe that any engineer/designer would design a TV that most people will use in bedroom with a remote that does not light up and has small buttons.", "Date": "September 5, 2012"}, {"Title": "Great name brand TV for the price", "Author": "Prime Customer", "ReviewID": "RIJR5I7Q4OJXL", "Overall": "5.0", "Content": "Just received it from Amazon and received it quickly.Plugged it in and turned it on and it worked perfectly. The TV is very light which is also a great feature as this is for the kids room and am not worried about it getting bumped and falling.I did a lot of research on 32\" TV's for under $250 and this is one of the few major name brand units I found that had decent reviews.You will not be sorry with this TV.", "Date": "August 9, 2012"}, {"Title": "Love this TV", "Author": "Margaret Giardini", "ReviewID": "R1BD6S2L0A6DQC", "Overall": "5.0", "Content": "Received from Amazon a day early.  Set up was easy.  Setting up my DVD player was a challenge at first.  There is no yellow plug for the video.  What I did was plug it into one of the blue plugs above the audio until I had a picture with sound.  Also for INPUT, you have to make sure you change to Video or else you will have black and white, no color.  Once I put it on Video, it works great. Thanks to those who explained how to brighten the picture which by the way is excellent.", "Date": "July 21, 2012"}, {"Title": "Grat TV for kids movie room", "Author": "Hugo A. Gardea Rodriguez \"HG\"", "ReviewID": "R1PQAVEV7YL0Y2", "Overall": "4.0", "Content": "We bought this TV for our kid's TV room, we'll be hooked up to a regular slim DVD player and used for cartoons and such, so for the price and build quality, this is perfect, just be warned, it's and LCD, so it's bulky, don't expect LED thin, we knew that since the beggining so we can't complaint about that, image is good and since it's bulky, I guess that had room for decent speakers, not home theater speakers but way better than our other 55\" LEDfor the main room, my phone has better speakers than that!! But for budget minded shoppers this is a great deal, I got for $270 and are very happy. If this is going to hang from your wall,  make sure to get a slim profile mount, otherwise it will stivk out too much from the wall...", "Date": "May 25, 2012"}, {"Title": "Amazing TV...with a few minor flaws...", "Author": "J. Hogan", "ReviewID": "R2T3OZ5KY192R", "Overall": "5.0", "Content": "My parents' old TV bit the dust, and they were looking for a 26\" HDTV to replace it.  At the same time, there was a sale on this 32\" Toshiba, and it was cheaper than the 26\" TVs they were looking at, so they took my 26\" Vizio, and bought this one in replacement.When it came a couple days later, I thought I had finally had my first mess up on Amazon, because the entire box and everything weighed less than the Vizio by itself.  Once I took it out of the box, I noticed that it had roughly the same depth as a typical LCD HDTV, but it was definitely much lighter.  It was a breeze to setup, and I had everything going in about 10 minutes.Pros:-Great picture.  The picture on this Toshiba is much better than I expected for an LCD.  Colors aren't over-saturated like on the Vizio, but yet aren't undersaturated either.  The blacks are very black as well, which surprised me considering it can't reach true black...more on that in a minute.-Like I mentioned before, it is considerably lighter than you would expect.  It's weight makes it a breeze to move around if you need to swap cables, or swap a room around.-REGZA-LINK!  This is an amazing feature that I absolutely love.  Sony and Samsung have technology built into their TVs and Blu-ray players that allows you to control your player with your TV remote.  Toshiba has the same tech in their TVs, but it works with ANY DVD/Blu-ray player connected over HDMI.  That way you only need one remote to change the volume and control your player.  It also recognizes when you turn on your Blu-ray player and switches inputs automatically.-Double Mute.  When you press the mute button, the volume doesn't completely mute, but instead, gets cut in half.Cons:-Only two HDMI ports.  It's understandable on a smaller HDTV, but I did expect for it to have three HDMI ports, so I'll be buying a switcher soon.-The blacks.  The TV is a little dark even with the backlight maxed out, but that's my opinion.  Not too dark where it's like the backlight is dead, but more like \"cinematic\" dark, so the good comes with the bad.-Double Mute.  Though it's a nice feature to have, you have to press the mute button twice to completely mute the TV, and once more to return it back to the previous volume.  I'm sure they could have programmed some sort of time delay so that you could press the mute button again and it return to normal volume.Hogan's Wrap-Up:I have throughly enjoyed this TV.  It is awesome to watch Blu-Rays on (I'm on a HUGE Big Bang Theory kick and I just bought Band of Brothers on Blu-ray to watch again), and my Xbox looks super sharp and crisp.  While I hate the lack of an extra HDMI, and the amazing blacks have a downside, they don't keep me from giving this TV a 5/5 at all!  I love it and highly recommend it!", "Date": "August 7, 2012"}, {"Title": "I like Toshiba BUT", "Author": "Robert Wolter", "ReviewID": "RIEJEZUZC7TW6", "Overall": "2.0", "Content": "I have had Toshiba tvs for years and have recommended them to friends who are very happy with theirs.  Onething I like about Toshibas is they do not have a reflective screen which makes them good for brightly lit roomssuch as my family room.This unit however had a faint picture no matter how I adjusted the settings.  Had to send it back and havenot looked for another unit yet.  I will still consider Toshiba", "Date": "January 8, 2013"}, {"Title": "Thank you Amazon", "Author": "Maggie B", "ReviewID": "R273LVPL673GT0", "Overall": "5.0", "Content": "I had a 22 inch LCD in the room over the garage, and it works fine, but I found it hard to watch. Just too small for the room and my eyes. I searched for a replacement, starting with a low-priced ($199) Apex 32\". This was decent for the money, but I had my doubts about longevity and service with an off-brand. The final straw was that I could not get it to work with a universal remote. That's a necessary convenience for me.Next up was an Insignia 40\". It was too big for the space.I tried the Panasonic VIERA TC-L32C5 32-Inch. It was the right size and worked with the universal remote I have, but the picture was only mediocre, and the design very simple. The owners manual consists of 8 pages. For its size, this Panasonic is costly. You pay for the name.That brings me to the Toshiba. The picture is clear and crisp. The manual is 130 pages, showing plenty of features and adjustments. (Get it at [...]%2040E220U%20LCD%20HDTV%20Manual.pdf) The speakers are higher wattage than the Panasonic--10 watts vs 14 watts. The Rezga Link feature of this TV works with my internet enabled Sony Blue-Ray player that I got to watch Amazon Prime. That means the TV remote can control the Blu-ray player.I have had good service with Toshiba products I have purchased in the past, so I'm hoping if I have problems Toshiba will be there.The price here on Amazon beat the sale price for the Panasonic by $40+.So far this looks like a great choice!", "Date": "August 9, 2012"}, {"Title": "Details.... I love the sleep timer!", "Author": "eMac", "ReviewID": "R3R9OTLA2R28Q4", "Overall": "5.0", "Content": "I won't rehash what others have said- it's a great TV!I am writing this review just to add one detail that I look for, so perhaps it might matter to someone else:The remote does have a sleep timer button (my Vizio did not. It forced me to go through several menu steps to get to it- most annoying.)And, this TV's sleep timer has 10-minute increments! I love that. And it goes all the way up to, I think, 6 hours.I typically like to use the sleep timer both at night, for obvious reasons; and in the morning when I am getting ready for work. I like to set it to turn off a few minutes before I need to leave- a helpful reminder to get me out the door on time.Also, I'll add, as another reviewer mentioned- this TV does seem to pick up more OTA broadcast stations than others. My last 2 bedroom TVs did not pick up our local PBS station- despite my trying multiple antennas. This one does. Makes me happy!", "Date": "July 26, 2012"}, {"Title": "Inexpensive But Still Lacking", "Author": "B Hector", "ReviewID": "R3A8DZKRV50YYI", "Overall": "2.0", "Content": "My major complaint with this TV is how long it take to turn on. It's a good 5 seconds before the screen comes on.", "Date": "July 17, 2013"}, {"Title": "Great Value Brand Name HDTV", "Author": "David L. Vasser", "ReviewID": "R8Z4808MUSVQW", "Overall": "4.0", "Content": "This Toshiba model is a \"5 Star Value\" but I'm giving it a 4 star rating because it isn't the very best of the best 32-inch HDTV's out there, but good enough for my needs. Honestly for the money you can not beat this model.I also have the Toshiba 40 inch 1080p version of this same set which is about 9 months old and the great performance I've enjoyed with it is at least part of the reason I decided to go with this 32 inch 720p version for the bedroom.  I already had a ROKU HD box in the bedroom which is also 720p so the two are now working perfectly together.  If I bought a 1080p HDTV I'd feel like I needed to upgrade the ROKU also and thought I'd try this 720p TV instead figuring that really I'm not a big watch TV in bed guy.Before deciding I looked in person at this one and at 1080p 32 inch sets by two other good name brands that cost substantially more.  Really on the 32 inch sets at five feet away the difference between 720p and 1080p didn't make all that much difference and I just didn't see spending so much more money for so little benefit.  This set was to replace a non-HD CRT that was over a decade old so about anything would be an improvement.  If you must have the very best of everything you probably aren't reading reviews for this model anyway because it is not 1080p.Cons:720p not 1080p.  This is a big deal for some people, I found that to me it isn't such a big deal.Large frame around screen so it isn't as compact as other good brands with thin frames that cost a lot more.Remote sort of clunky but functional.Takes about 12 seconds to boot up.Channel changes are not instantaneous but lag about 2 seconds behind pushing the button.2 stage mute.  Push Mute button 1x and volume goes to 50%, push again and it mutes 100%.No WI-FI, SMART TV or built-in DVD/Blu-Ray, just a basic HDTV.Pros:Great picture for 720p with really good colors, no dead or stuck pixels.  Sharper than I expected.Surprisingly robust full range sound with no external sound accessories required.  A real strong point!Audio leveling tames blaring commercials but can be defeated in the setup menu if you want commercials to blare.Cheap!Good brand name.Easy to set up.Really sturdy fixed stand that also is stylish.Versatile compliment of inputs including 2 HDMI, 1 Coax, 1 Component, 1 Computer, 1 USB.Various format sound outputs, more of them than some other budget sets, including Dolby digital.Good build appearance that doesn't look like a cheapie.Low key green pilot light on front isn't overly distracting.No freaky or unpleasant odors.Fairly energy efficient with a $13 sticker on it.200x200 mounting pattern for wall mounts.All programmable & universal remotes (cable/satellite/etc) have TOSHIBA codes.Simple to set variable SLEEP timer.I shopped around quite a bit making lots of comparisons by \"showrooming\" several stores.  I decided on this one and waited for a sale.  Amazon and a local Big Box had the same sale price for President's Day but I went with Amazon because of no sales tax.  That way I could get the extended warranty for about the same cost as the TV alone at the local Big Box.  My only concern then was having to return it if damaged or malfunctioning but I know from experience Amazon is great to worth with on returns.The set arrived on time with my free 2-day Prime Member shipping.  The box had a huge gouge in one side but the TV itself was fine so the box did what it should.  Stand assembly on these takes about 3 minutes or less and requires only a Phillips head screw driver and a smooth flat surface like a bed or sofa where you can lay the display face down with the bottom hanging over the edge in order to attach the stand and secure the 4 included screws.When you first power it up it will boot to a screen that asks you to choose between HOME or RETAIL mode.  I chose HOME and then it did a channel scan which took at least 5 minutes and then was ready to go.I found the tip about turning off the automatic brightness function last summer on these Toshibas.  Turning the auto brightness off does perk up the picture and make the colors vivid.  Turning this feature off makes it look like it does in the store in \"retail\" mode.  Turning off the auto brightness does make the display run at 100% all the time so it uses slightly more energy and I suspect it also may shorten backlight life, but still if you find the picture too dark or colors too dim this is a tip worth trying so I'm repeating it here:1. Press MENU.2. Scroll Right to PREFERENCES.3. Scroll down BEYOND the bottom of the visible menu to find ENERGY SAVING SETTINGS and press enter.4. Press RIGHT control once to turn Auto Brightness Sensor to OFF.5. Press MENU and press Menu a second time to exit menu.  Done.Under PICTURE category in menu settings I suggest you leave the DYNALIGHT function \"ON\" as this is completely different from the Auto Brightness function.  Dynalight improves contrast and it looks slightly better to me with it turned on, which is the default setting.  This is especially true on night scenes or any scene with lots of dark colors such as an old black & white film.Also under the PICTURE category on the main menu I set this one to DYNAMIC mode and it looks great with no other video adjustments at all.  All the video settings were left at the default except I turned the Automatic Brightness off and set the mode to DYNAMIC.Next I adjusted the sound EQ and set the bass to +8 and the treble to +2.  It sounds amazingly good for watching movies or normal TV shows. Dialog is crystal clear and music sounds ok.  Some 32 and even 40 inch TV's have weak sound and leave you wanting more, but both my Toshibas have great sound and don't need any external sound augmentation for normal movies or TV shows.  I think Toshiba's sound is way above average because bad sounding or weak audio is a frequent complaint, even with some other good brand names.I really like this 32 inch HDTV in my bedroom.  I'd buy this exact model again, especially when it is on sale.  I really shopped around and I don't think you can do better with a top name HDTV for the money.  I looked at some cheaper ones too.  I liked this one better than the cheaper ones and better than some of the more expensive ones.  Again my previous good experience with my 40 inch Toshiba weighed heavily in my decision.", "Date": "February 21, 2013"}, {"Title": "Good Solid Television", "Author": "Thomas Marks", "ReviewID": "R13LAQ9KU13180", "Overall": "5.0", "Content": "I bought this television for my Wife's craftroom for Christmas.  She didn't want a 1080 HD so I looked through the discounted 720p 32\" LCD televisions.  I had it narrowed down to this Toshiba model and a Samsung.  The Toshiba had several good reviews not only about the picture quality but the sound as well - so I bought it.Other reviewers have commented on the picture quality and what settings to use to get the best picture.  Apparently, it you leave it on an eco power saving setting, the picture looks washed out.  I followed their advice and did get a good picture.  Eventhough this TV is a 720, it does have good color and picture clarity.What I like about this TV is:- It's light weight.  I mounted it on a wall mount that swivels.  I was able to lift it onto the mount very easily.- It has 2 HDMI connections plus several others; I've since plugged my wife's computer into the television and will also connect it to a Directv receiver.- The genaric wall mount fit the TV with no problems.- Amazon discounted this TV to a good price.I really can't think of any negatives so I will recommend this television as a good solid purchase at the discounted price.", "Date": "December 22, 2012"}, {"Title": "Quality of Picture Poor", "Author": "Orin W. Holland \"Wayne\"", "ReviewID": "R2G4NPSZRTSMUW", "Overall": "2.0", "Content": "I've owned a number of different flat-screen TV's including Samsung and Vizio.  All of these met my expectations as far as video quality.  The Toshiba did not.  I spent a lot of time trying to adjust the color, contrast, etc. but the picture always looked a bit fuzzy and dim.  I would not buy Toshiba again.", "Date": "October 3, 2012"}, {"Title": "Get Your Game On.Hardcore Gamer.Input lag (-)Color(+)", "Author": "PrimitivePrime", "ReviewID": "R2K2IHCXP9T2JJ", "Overall": "5.0", "Content": "OK people.At first thought when this tv is first turned on the colors are dark and ok at best.However I already knew this by reviewing this TV.You must turn the energy saver settings to off!After the engery settings is off,this TV POPS with beautiful color.I use this TV for hardcore Gaming and streaming movies with the PS3.First off the most important desire was for this TV to have little to no input lag.This TV shows it has a gaming setting that will reduce input lag so that got my attention.After reading up on this TV,I still didn't see really any information on how to put this tv in game mode for the quick,clean,crisp screen action a hardcore gamer desires.I will tell you I am more than pleased with this TV capabilities to display that much wanted clear picture speed with little to NO input lag.Understand I'm not a retailer ,seller of this brand name Nor do I care what brand it is.results is what I was after.This TV fits the bill!!I'm a hardcore gamer that likes to watch movies with the wife and be inside the game when Its my turn to burn!I also like the quick screen display size action to blow up the(+) aim site cross hair while gaming.This setting gives me a bigger target to shoot..lol..Best picture with The ps3 was to use HDMI and go into output settings for TV in the PS3 and manually turn on 1080p.Only check the 1080p box.For me this gave me the crisp clean bright look for gaming I have been searching for!!Hope this helps for you gamers searching for a TV that will give you the clear advantage of that wide screen 1080p HDTV with little input lag..If your wandering which games I play mostly with the PS3 and this TV its Socom Confrontation PSN Primitiveprime text me via PSN for more info if wanted.Cheers", "Date": "July 27, 2012"}, {"Title": "Toshiba 32-inch LCD HDTV", "Author": "Dawn N. Johnson", "ReviewID": "R13PQQ1FKOOS7J", "Overall": "1.0", "Content": "I purchased this TV even after looking at the other reviews. Our son has a Toshiba Laptop that he has had for 5 years and no problems, so I decided to give the Toshiba TV a try. What a mistake! The TV looked nice but once it was set-up and turned on the problem started. I could never get the picture to ever become bright enough on all of my television channels. What a disappointment! After watching for 1 hour and trying to make some adjustments (which never helped) I boxed the TV back up, printed up a return label and took it to UPS to be returned. I immediately went to a local store and purchased the Samsung TV that I had originally planned on. I took the Samsung home set it up and am loving it. I hope Toshiba will read this review and the other ones that have been left and fix the problem.", "Date": "December 7, 2012"}, {"Title": "Power went out 1 1/2 years after purchase", "Author": "djc", "ReviewID": "R3BGPJUBZSTDWM", "Overall": "1.0", "Content": "I purchased this TV for Christmas of 2010.  this summer it simply would not come on.  no storms in the area. no power surges.  took the back off and replaced the fuse that was blown. plugged it in fuse blew immediately.  $379 for a tv that lasted a year.  Never will I buy a Toshiba again.  I googled it and this is not an uncommon problem.", "Date": "November 13, 2012"}, {"Title": "Good buy but instruction manual is poor", "Author": "Linda Thompson", "ReviewID": "R2EX45XWTZSSCB", "Overall": "4.0", "Content": "I purchased this tv on March 1, 2013.  The tv works great but the print on the instructions is so small we had to use a magnifying glass to read some of it.  Also, there are no instructions for customizing your tv settings.  We finally figured out how to hook up our DVD player to the tv, but we could not get color.  Nothing in the instructions addressed this.  We finally had to call customer support, and they walked us through several steps to customize the tv so that we could get the DVD in color and set the screen settings.  None of these things are addressed in the instruction manual.  Needs more detail and larger print in the instruction manual.", "Date": "March 6, 2013"}, {"Title": "no one talks about channel tuning speed", "Author": "J. Scott Scaggs", "ReviewID": "R3TVUS4SUYJSPA", "Overall": "3.0", "Content": "Sure the picture is good, and the price was more than reasonable.But the thing that disappoints me about this TV is how long it takes to tune cable channels, taking all the fun out of channel surfing. I've timed it as taking 3.2 seconds to go from one channel to the next. (For reference sake, it's connected directly to a coaxial cable with the signal coming from Time Warner Cable,) The other TVs in the house tune channels almost instantly.This Toshiba also takes 15.7 seconds to turn on, from the time I hit the power button to the time it takes to tune the first channel. The other thing to be aware of is how small the onscreen data is. So if you're sitting farther than about 7-8 feet away, it may be a challenge to read the channel number, favorites list, etc.But in all fairness, the picture and sound are just fine.", "Date": "March 5, 2013"}, {"Title": "Spot on for the Price.", "Author": "Sounds", "ReviewID": "R3397T7UKDZ0DO", "Overall": "4.0", "Content": "Remeber when HDTV were thousands upon thousands of dollars. Well those days are gone as this technology becomes the norm in  the common household. I purchased the Toshiba confidently due to my past experiences with their products and with the sale price of 219.00 I could not pass up the offer. This unit will be used mostly by the inlaws in the spare bedroom but I had to give it a test run.The Pros:1) Great 720 picture.2) Surpisingly good sound3) 2HDMI ports4) Optional HD CPU portThe Cons:1) Small remote; like if this remote was a guy he would never use a community shower kinda small. Like if...well I guess you got the point.2) Lack luster menu but it is functional.So all in all a great purchase for the price.See Ya, Sounds", "Date": "March 3, 2013"}, {"Title": "Hooked it up... no picture.", "Author": "Caleb Ward", "ReviewID": "R3TZCVGWY0NYX", "Overall": "1.0", "Content": "Got my Toshiba television. Took it out of the box and it looked great. Nice style and design. Plugged it in and powered it on. I see the Toshiba logo as its powering on, then I see a black screen. Took a little closer look and I could see the shadow of the menu box. Tinkered with it for a while and finally got fed up. Called Toshiba. Great customer service. Pretty much told me this happens often and its a hardware problem with the screen. Yet to get my replacement from amazon. Maybe that will change my mind.", "Date": "February 6, 2013"}, {"Title": "problems", "Author": "Jim Foyer", "ReviewID": "R1RSL1IRBX31MX", "Overall": "2.0", "Content": "I sent the first unit back because the remote had trouble talking to the television set. We received a replacement and have installed that, however the problem still exists. I believe it's an inherent fault in all their TV sets and there's no sense in going further with it. We'll just live with what we have but we're not happy.I would never recommend this product to anyone under any circumstances.", "Date": "February 5, 2013"}, {"Title": "Great TV!!!", "Author": "curtis abbe \"happy camper\"", "ReviewID": "R1YQ6ORR3ID9TF", "Overall": "5.0", "Content": "I have had this TV since July 9th & I got to say that at first I did have a problem with the sound like other reviewers stated up till about 2 weeks ago that is,I knew that there were sound problems going into this.So I was messing with the cable connection on the back of the TV went to change the channel,it scared the crap out of me when I got on the station it was like SO LOUD it blew my ears off (it was on 100 by the way). I do not know what I did to get the sound to sound like it should but I do  not have any qualms with the sound anymore.Now that the sound has been \"solved\" I  never have it higher than 10-15 on most days.The PC connection works as good as it should as well as everything esle even though I do not have a BLU RAY yet the rca's work well on this set.The HD cable box really increases the boldness & the vibrancy of the colors.The picture is just as good as any high end Tv in my opinionOverall,I am very pleased with my purchase from AmazonI would recommend this TV to anyone!!!", "Date": "November 4, 2012"}, {"Title": "Great TV, Dead Pixel!", "Author": "PMcOuntry \"PMcOuntry\"", "ReviewID": "R1A9JMYXQBR095", "Overall": "5.0", "Content": "I love Toshiba TV's. My father has had a similar model (older) for years and has never had any problems. I took this out of the box and it was spectacular viewing from the start. However, I didn't use the the TV right away or very often and when I finally got my new Blu-Ray player I noticed a small issue. A red dot. A dead/stuck pixel. I went online and searched for ways to fix it. Since it's red, it's simply a stuck pixel, and not dead. Nothing worked. I was very upset and contacted customer service. They said my 30 days were up?! I was devastated. I had to save up my money to buy this TV to replace an old CTR that was on the verge of death. However, good news! They finally agreed to refund my money, I assured them I did not want a refund, but a replacement. I love the TV, I just don't want a defective one. They immediately processed my return for 1 day shipping and I will receive my new TV on Tuesday. I couldn't be happier with Amazon Customer Service right now. Once I receive the new TV I will be sure to update this review. I appear to be the only one who has had this problem with this set (that is my luck though!). My only advice to buyers looking at this TV right now is, it's a great TV, but be sure to check it as soon as you take it out of the box! Lesson learned!I got the new TV and set it up. No dead pixels on this set, but I'm keeping a close eye on it for the next 30 days!", "Date": "October 13, 2012"}, {"Title": "Good basic TV", "Author": "Only Brian", "ReviewID": "RVBYC358YF8O7", "Overall": "4.0", "Content": "I've had this TV for about 6 weeks so far, and I am very satisfied with this purchase, especially for the price (I got it for $229, its price as of writing is $249).  The picture quality seems great, and the speakers are decent as well; no distorted sound at normal volume, though I can't say I'm as picky as some about sound.  One odd thing about the sound is that the mute button has to be pressed twice to completely mute it.  The first time it's pressed it turns the volume down halfway, then mutes it completely on the second button press.  This isn't necessarily a con, just out of the ordinary and something to be aware of.A few reviews voiced complaints about the difficulty of assembling the stand, but I personally had no problems there.  I was able to use a small screwdriver on a swiss army knife, although a regular screwdriver with a longer shaft admittedly would have made it easier.  It's possible that they have changed the stand since those reviews were written.This is a pretty basic TV, so there isn't much else I can say about amazing features or anything, other than just about everything works fine and it seems like a good quality device.  Which is exactly why I bought this TV, rather than a cheaper off-brand one.  I personally don't need anything beyond the basics right now, just something that looks good and does the job.  As long as it continues to work well for a long time, I'm happy.  There are just a couple things that could be better.The settings are intuitive and easy to navigate, as are the buttons on the remote.  However, when turning the TV on, it seems to be extremely particular about the vertical and horizontal angle the remote is held at.  I often have to hit the power button several times from different angles before the power light comes on.  I don't have this problem with any other buttons on the remote, even the power button works fine when turning it off, so I'm not entirely sure whether it is just a defect with mine or not.The last issue I had was that the picture was pretty dark out of the box, and it was almost impossible to see images in darker scenes.  Fortunately, this is easily remedied by upping the backlight and turning off the energy savings mode.  A helpful review by Mark Fellows cited another reviewer's explanation of how to do this, so if you are wondering how to change those settings, check that out.  After changing this, I had no complaints about the picture.I would definitely recommend this TV to anyone looking for a good quality device that looks and sounds good, but has few extra features.  Works great for my needs.", "Date": "October 7, 2012"}, {"Title": "perfect for dormrooms", "Author": "Collegestudent", "ReviewID": "RXAM3BDNIXKKB", "Overall": "5.0", "Content": "I'm a college student looking for a screen for my xbox and laptop. This fit the bill perfectly. It is light, efficient, easy to set up and cheap. Perfect for dorm rooms.", "Date": "October 4, 2012"}, {"Title": "Great Value - No longer too dark", "Author": "G", "ReviewID": "R9WYMX4CQRWZ8", "Overall": "5.0", "Content": "Great value for a 32 inch TV.  Initially thought it was too dark, the picture wasn't bright enough even with back lighting turned all the way up. Solution: Menu > Preferences > Energy Savings Settings (keep pressing down, it's not initially shown on the menu) > Auto Brightness Sensor > Off", "Date": "August 12, 2012"}, {"Title": "Very nice picture.  Well worth the price.", "Author": "Carabele \"C LaH\"", "ReviewID": "RSJVARBDTO81V", "Overall": "5.0", "Content": "Love this TV!  The pic is wonderfully clear and setup is fairly easy.  The sound is really pretty good for an HD television, though at some point I imagine I will get a sound bar to augment it.I did turn off the Energy Saving picture thing, as many other people commented about.  And yes, channel-changing is a bit slow, but it's not a problem from my viewpoint as I don't have \"itchy clicky fingers\".", "Date": "August 9, 2012"}, {"Title": "Great Deal", "Author": "gharley", "ReviewID": "R384SRSWLFS46L", "Overall": "5.0", "Content": "Have had the TV for a couple of weeks now and I have absolutely nothing negative to report about it. Great picture, all picture & audio adjustments are easy to adjust through the menu's. Other reviews mentioned the sound quality being poor. I guess if your trying to get super hi fi I could agree with those points of view BUT the sound quality is great as long as your not trying to blast the windows out. Doh! I run the picture setting on 1080i through DirectTV satellite service. Works perfect.", "Date": "July 2, 2012"}, {"Title": "Very Nice", "Author": "Beverly J. Rusling", "ReviewID": "R1SVC8WU3MTRB6", "Overall": "4.0", "Content": "Bought this TV for my granddaughter's room and it's very good. Good picture quality on satellite and works perfectly in her 12X12 bedroom. If you want to setup a media center though, keep on looking. This set is short on needed connections to operate everything from your remote...", "Date": "May 29, 2012"}, {"Title": "Works Well for Small Rooms", "Author": "John Jesensky", "ReviewID": "RBE8H9DKY6R5Y", "Overall": "4.0", "Content": "My wife and I were in need of a slim TV for the bedroom of our new apartment.  We just didn't have the space for the chunky late 90's projection TV that we used to use.We opted for this TV mainly because it was small enough to not hurt our eyes in a small room, and the price was good.  We mainly use it to relax for 30 minutes or so before bed, and then it goes off.  Would I suggest this TV for a giant living room meant to entertain a hoard of movie-loving friends?  No way.  You can do much better than that for only a little more money.  But it suited our needs just fine.", "Date": "February 21, 2014"}, {"Title": "buy the Samsung instead, works awesome", "Author": "JLakin", "ReviewID": "R45GC0I2L29VG", "Overall": "2.0", "Content": "Worked good for about 4 months. Then nothing... It wouldn't do a thing. No power, picture, sound.. Nothing.Trouble returning it too.", "Date": "January 5, 2014"}, {"Title": "The speakers suck", "Author": "Sharon", "ReviewID": "R2PDMEK4Y51WQU", "Overall": "2.0", "Content": "You can hear the TV great if you are behind it, but the speakers have no volume.. it sound on it sucks", "Date": "December 29, 2013"}, {"Title": "DISAPPOINTED WITH THIS BRAND", "Author": "PL", "ReviewID": "R3GPLXUWZHN96A", "Overall": "2.0", "Content": "DISAPPOINTED BOUGHT THIS ON RECOMMENDATIONS BUT WAS EXTREMELY DISAPPPOINTED WITH THE PRODUCT ESPECIALLY THE POOR SOUND QUALITY AND REMOTE FOR THIS TV.  RETURNED.", "Date": "December 14, 2013"}, {"Title": "TV goes black with noise", "Author": "Dongmyun M. Lee", "ReviewID": "R3LVJIEQUCX0PA", "Overall": "1.0", "Content": "Bought this about a year ago.  A nice thing about this TV is bulit-in HD digital antenna.  It was hooked up with Charter cable without HD settop. The broadcasting channels are showing clear crisp images of HD quality.  The problem is the TV goes black with some noise by itself, then later power came back on.  I do not keep track of how often it happens but the frequency seems to be increasing. I think it is a power control circuit reliability issue, perhaps faulty or leaky capacitor, like the case of samsung TC class action.  Am afraid it might breakdown soon.", "Date": "December 6, 2013"}, {"Title": "Died One Day Past Warranty", "Author": "T Walker", "ReviewID": "R1PH51G7VQHWF4", "Overall": "2.0", "Content": "Actually it made it 11 months (12 month parts and labor warranty) and then went black.  It is most likely not worth the time and energy to return it.  Sad.", "Date": "December 2, 2013"}, {"Title": "piece of JUNK", "Author": "Alison Berry", "ReviewID": "R1XDFCZ5QSFJYW", "Overall": "1.0", "Content": "Bought for guest room 1 year ago, only used about 3 times, will not power on, absolute piece of JUNK!", "Date": "November 9, 2013"}, {"Title": "Horrible, a real lemon", "Author": "D. C.", "ReviewID": "R3I1UHDED30VUO", "Overall": "1.0", "Content": "I purchased this item months ahead of time as a Mother's Day Gift for my mother. Unfortunately, we didn't hook it up until Mother's Day and it's too late to return it.  The picture is dull and faded.  No matter how you change the settings, you can't get the picture to appear sharp or bright.  Horrible TV.  Also, the sound goes out approx. once every hour for a few seconds.  It's not the cable company, we checked.  It's the TV.  I called Toshiba and they said it sounded like a hardware problem and we can take it to be repaired.  The problem is that my mother is unable to do this on her own and I don't live near her (I also don't drive).  I guess at some point we'll try to follow up with the repairs, but I don't know how much is covered by the warranty.  I doubt they will be able to fix it to appear any better anyway.  I have a Sony Bravia which I purchased around the same time.  It's worth spending the extra money.  As they say, you get what you pay for......", "Date": "June 13, 2013"}, {"Title": "Great picture( with a few tweaks) great price", "Author": "big lar \"creative thinker\"", "ReviewID": "R33LJ7PY79PEUN", "Overall": "5.0", "Content": "Like I said great picture and price. Needs a few tweaks to give you an even better than factorysettings, as indicated in several fine comments from others. In case you missed that. Turn off the auto bright sensor. I found the following EXTREMELY HELPFUL TIP ON A BEST BUY REVIEW posted by USofANDY.\"The picture looks excellent, however, I did need to make a lot of changes to the menu settings to achieve this - the picture is too dark at default settings but the two key settings to remedy this are the energy saver settings and backlight intensity.Turn off energy saving and crank up the backlight and you have a very bright picture, the remaining settings can be easily calibrated to your preference.Make no mistake, I love the picture quality and the screen itself has low reflection.\"I am really glad I found that tip by chance, and I hope you find the tip either on Best Buy, or here on Amazon.James Ruffin Says:\"1. Hit the menu button,2.go to \"preferences\" in the menu3. press the down arrow key to scroll down (the energy settings are sort of hidden at the bottom),3. hit the enter button to select energy savings4. Set auto brightness sensor to \"off\"Picture should be much brighter. \"Hope you like your set as much as I do mine. Thanks guys for the great tips I have quoted here, I could'thave done it without you. Just another reason I am a confirmed Amazon customer.", "Date": "March 20, 2013"}, {"Title": "Not a good TV", "Author": "larry", "ReviewID": "R2YV8PMF7NA44I", "Overall": "1.0", "Content": "Don't buy this product,the first one did not work and Amazon replaced it.The new one worked for about 2 months now it went out.Save your money and buy a different brand.Will never buy a Toshiba TV again.", "Date": "March 15, 2013"}, {"Title": "Great TV for the price", "Author": "Rick Blaine \"Ten 252\"", "ReviewID": "R1E0TFYBDH6F9Y", "Overall": "4.0", "Content": "I've only had the TV for a couple of weeks but so far everything looks great. Just keep in mind that this is a 720P resolution set and as such the picture will not be quite as sharp as you're used to on a large 1080P or 1080I TV. Most of the 4/5 star reviews on here give all of the best reasons for getting this set but I'd just like to add that you have to watch the price on here very carefully. I paid $239, the next day it was $229 and a week later the price jumped to $339 for a day!! Less than $250 is a great price, over $300 is not. At $339 add a few bucks and get a Samsung 1080p.", "Date": "March 11, 2013"}, {"Title": "So far; LOVE THIS!!", "Author": "A big Fan", "ReviewID": "R1CL3PILZ6CA2P", "Overall": "5.0", "Content": "It was very inexpensive. The shipping was fast! The screen is clear. The sound is fine. It can get pretty loud. The size is a tade bit larger then others but it doesn't matter much. Stand is stable. Has a super easy set up. No problems so far. Get deal for the money.", "Date": "March 2, 2013"}, {"Title": "Great Pick", "Author": "Tracey Murillo", "ReviewID": "R3EOLYP9DOWUFL", "Overall": "5.0", "Content": "I shipped this item to my son whom is in the AF, he did not have a TV in his dorm. This was the first TV he has seen since Oct 2012. He was not allowed to watch TV while in basic military training, then after he completed tech school he was transferred to spokane, WA and had no TV in his dorm. So as a surprise to him I purchased this item and it was a wonderful gift. The shipping was on time, they informed me every step of the way until it arrived to the base. He received it PERFECT shipping condition, and he has enjoyed it very much. So I would like to thank Amazon for such great service. Thank- you once again!", "Date": "March 1, 2013"}, {"Title": "Great tv", "Author": "Stephanie D. Robert", "ReviewID": "RCWWIJKXRHSDN", "Overall": "5.0", "Content": "This was purchased as a replacement tv for a fairly large room that is not used daily.  I questioned the purchase based on some peoples concerns on volume.  this is a great TV.  I see no issue with volume or picture.  The quality is better than some of the other LED tvs we have in the house.  Picture is fantastic, very true to life.", "Date": "February 27, 2013"}, {"Title": "Crystal Clarity", "Author": "William T. Burke", "ReviewID": "RULZ3LH1LH3V7", "Overall": "5.0", "Content": "Blu-Ray and Video Games are awesome.Regular TV is amazing I have no complaints just praises.I highly recommend this TV to anyone.", "Date": "February 26, 2013"}, {"Title": "My daughter loved it, but....", "Author": "Permit Clerk", "ReviewID": "R3MP2QCFC3QGUI", "Overall": "4.0", "Content": "I bought this for my daughter for Christmas. She loved it, but after a month the screen got a black line down the middle. We called Amazon and they immediately sent out a new one! She said the picture is clear and is very happy with it. So far all is well with the new one. I did buy an extended warranty and glad I did.", "Date": "February 25, 2013"}, {"Title": "Great Tv", "Author": "Andrew Summers", "ReviewID": "R26505DFSBU38J", "Overall": "5.0", "Content": "When we first recieved it their were some yellow pixels but that could have been just a bad panel not Amazons fault Toshiba took responsibility and fixed it works great has some nice features and good clean picture and received it for a great price first Toshiba Tv we ever owned but would highly recommend if you are looking for something mid range basic with a good picture and easy features. One more thing use Mark Fellows review in the Amazon review section to improve experience very good and helpful.", "Date": "February 24, 2013"}, {"Title": "Great TV, excellent price,", "Author": "R. L. Johnson", "ReviewID": "R1K0X6D1WQ4TQV", "Overall": "5.0", "Content": "I received the set one day early by FedEx, excellent condition. easy assembly. The picture is what I expected, clear and bright. The only negative I can think of, and maybe its just me, the volume doesnt seem that loud, compared to the RCA 32in; I purchased in January. Love that set too! I hooked a DVD player to the Toshiba and had little lines in the picture, didnt like that, so I plugged the video wire into a different port, then cleared the lines, but now its in black and white. Its not the TV's fault. The TV in antenna mode has great color and picture, so it has to be in the DVD player. I would buy againUpdate: I have had this TV a couple of weeks. worked fine, then started to act up, wouldnt change to other channels, just toggle between 2 channels. so I called Toshiba hotline for advice, He walked me thru the channel setup and it was fine. very good tech support. I should have just tried on my own, but now at least its recorded at Toshiba in case any other issue comes up. still havent got the Black and White DVD player issue, going to try different cables.", "Date": "February 23, 2013"}, {"Title": "Great deal for a 32inch TV", "Author": "erin", "ReviewID": "R2YJ5DKOI9MAK1", "Overall": "5.0", "Content": "We bought this TV on amazon for $199 and it has been a great TV.  The color is great and sounds is great too.  For under $200 I dont think you can beat this one.", "Date": "February 19, 2013"}, {"Title": "broken right out of the box", "Author": "Mort", "ReviewID": "RZAVIKDEFAJ09", "Overall": "1.0", "Content": "hooked it up and the screen was messed up and had lines running up and down the left side of the TV. but the great part was the ease of returning the item .the whole process was pain less. thank you amazon.I still buy from you fro that reason and the great buys. thanks Mort", "Date": "February 8, 2013"}, {"Title": "Fair Value - Decent Picture", "Author": "Antoosh", "ReviewID": "R10TW8FRW0A34O", "Overall": "3.0", "Content": "There's nothing strictly speaking wrong with the tv and it hasn't broken since it was purchased a little over a month ago.  The picture quality is mediocre and the frame itself is pretty thick.  The remote is ugly and the tivo remote can't figure out the codes.  Again, there's nothing wrong with this thing, but be forewarned.. cheap for a reason.  That being said, it might be perfect for your kid's room or setting up in the garage or something along those lines.", "Date": "January 30, 2013"}, {"Title": "The price was good.", "Author": "Gretchen", "ReviewID": "RCRM3IOBVXQ8V", "Overall": "3.0", "Content": "I bought this Toshiba for $200 and saw a bunch of really good reviews so I bought it. I got it and for the life of me I can not get the whites on this TV to be bright, it's almost like watching it through a tinted window. It's not terrible but it's not great either.1-23-13I called Toshiba and I qualified for in home service which was really cool. The technician got here looked at it for a few minutes and said that unfortunately the brightness on this TV does not get any brighter. He even took the TV apart and put the new part in it just to show me that the TV is not a bright TV. He informed me that if I want a TV that has bright whites then I should get an LED TV.", "Date": "January 7, 2013"}, {"Title": "Great product, suits gamers and casual TV watchers", "Author": "Matt", "ReviewID": "R38ZPF2VZNLMH7", "Overall": "5.0", "Content": "I purchased this 32\" model on 1/2/13 at $225, having paid for two-day shipping.Initially, I was debating between this Toshiba model and a Panasonic, because I was reading conflicting reviews on both brands and couldn't decide. After researching both options, I went with the Toshiba that I believed was only 720p capable.It arrived (as always with amazon) right on time at my door on Friday the 4th. Setup was simple - had to attach the stand to the tv itself with a philips head screwdriver. However, the picture out of the box was horrid. I had to go into picture settings and turn Dynalight on, which brightened the picture right up. I also adjusted the tv to the following, to give it more clarity:Contrast 75; Backlight 95; DynaLight On; Brightness 60; Color 70; Tint 0 and Sharpness 15.People looking to buy this for console gaming: When I setup my 360 with the HDMI cord, you have the option to play up to 1080p, which was a complete surprise to me. I had thought this was only a 720p max resolution tv.Audio: Not tinny at all. In my room at night, I had the volume down to 1 and it was still very audible. Between 10-15 volume, I could hear voices and sfx effects about 40' away as clearly as if I was sitting in my bedroom with the TV. I don't believe you can hook up external speakers, but they aren't necessary in a small/medium size bedroom.Viewing: I sit 5' away from the screen when gaming/watching TV in HD (have to pay for high definition channels)and honestly see no difference between the two resolutions. The viewing angles: from the left side, the picture loses it's contrast and is very bright. I suggest staying in front of the TV at least 4' away to see the best results.Overall: TV is an all-around suitor for gamers, people looking to watch sports/casual TV in standard OR high definition, and finally, makes for the perfect PC monitor.", "Date": "January 6, 2013"}, {"Title": "Good deal at a great price.", "Author": "cosmo", "ReviewID": "ROSOY64I9UQQ0", "Overall": "5.0", "Content": "Installed it in my daughters bedroom, didn't send it through a HD comcast box and it works very good. Free shiping at Christmas week was 2 days!", "Date": "January 6, 2013"}, {"Title": "Great Product at an Excellent Price Point", "Author": "J. Estill \"---\"", "ReviewID": "RMQ53GJBUOHVD", "Overall": "5.0", "Content": "I was able to pick this up for $199 and it was definitely a bargain at that price point. No dead or stuck pixels, excellent HD quality reception with local over the air channels, and I was able to hook up my son's Wii with no problems. You are able to hook up a non-component video input like the Wii, you just need to set the input options from component video. I found the following online ...Open the main menu and select the preferences section. This is the third section. Find the setting called \"AV Input,\" and change it from \"ColorStream HD\" to \"Video.\" Note that I'm not suggesting you change what input you have the TV using currently (by hitting the INPUT button); I'm asking you to let the TV know what it should look for through those ports (a composite device, not a component device).", "Date": "January 4, 2013"}, {"Title": "Great buy!", "Author": "Neil", "ReviewID": "RSNKY3ZLW9A71", "Overall": "5.0", "Content": "Great television, good purchase. The television has a nice picture and sound. You can't find a better deal out there for this size and this price. I would recommend everyone to purchase this TV, you can't go wrong with toshiba.", "Date": "January 3, 2013"}, {"Title": "Great Deal", "Author": "Steve", "ReviewID": "R2NVT1RPF6UFKH", "Overall": "4.0", "Content": "If you are looking for an extra tv this is a good deal. This would be good for a bedroom or small living room or office. Serves its purpose and is a great buy for the money.", "Date": "January 3, 2013"}, {"Title": "tv", "Author": "sugarplum", "ReviewID": "R1ZQZY6W5HHWVZ", "Overall": "5.0", "Content": "Great tv and am really enjoing ithas great color andworks really good and would arecomend it to anyone./easy to use", "Date": "January 3, 2013"}, {"Title": "nice for the price", "Author": "joseph white", "ReviewID": "R275XD0KMWA45O", "Overall": "5.0", "Content": "great picture, great sound, fast shipment, nice amount of hook-ups. far from the best out there but for the price you cant beat it", "Date": "January 2, 2013"}, {"Title": "Toshiba 32 inch HDTV", "Author": "TJ", "ReviewID": "R74143SUGFTZU", "Overall": "5.0", "Content": "This is not your top of the line set but it performs beautifully. Picture is sharp ,sound is very good and set up was somewhat painless, Called tech service for help and they were very considerate and patient.As always Amazon comes through with a great purchase.", "Date": "January 1, 2013"}, {"Title": "Great price.", "Author": "Michael J. Meehan \"Petetheaxe\"", "ReviewID": "R22YFMR6KMC1K6", "Overall": "5.0", "Content": "Good picture and sound.Plenty of inputs and very responsive remote control.720p is fine for a 32 inch tv.Would buy this again.", "Date": "December 31, 2012"}, {"Title": "Toshiba 32 in TV", "Author": "George R.", "ReviewID": "R2WZ4O7FEU7C3B", "Overall": "5.0", "Content": "Great TV for the price.  Crisp picture, no distortion.  I have 3 other Toshiba TVs and I have been very pleased with the quality and reliability of this manufacturer.", "Date": "December 13, 2012"}, {"Title": "Great starter TV", "Author": "Samuel J. Duffy", "ReviewID": "RLGDZ1AH1CD4E", "Overall": "4.0", "Content": "This TV has none of the bells and whistles of other TV's, which made it a perfect gift for my father, who has never had anything other than a CRT and who watches the channels he can pick up for free with an antenna. Since most antenna channels don't exceed 720p (a couple go up to 1080i), he didn't need a full HD television. Also, he views his television at least 15-feet away, which makes the finer detail of a 1080p television irrelevant on a 32-inch screen. He seems very happy with it.", "Date": "November 23, 2012"}, {"Title": "Good TV, and good value", "Author": "paulers88", "ReviewID": "R31QEMYU5QTBUZ", "Overall": "5.0", "Content": "I was looking for a high def TV to put in my room and this was perfect...Toshiba may not have the best name for TV's but the picture is nice", "Date": "October 30, 2012"}, {"Title": "Very Good TV at a Great Price", "Author": "Anita L. Russell \"tater-red\"", "ReviewID": "R1PPRA38QXSGK", "Overall": "4.0", "Content": "Been without a TV for a month. Got this in yesterday. My Genius Son had it up and running in less than 30 minutes. Perfectly Programmed, etc. We have DISH and it all works great. Personally I like a simpler remote so this is good for me. The Dish Remote is plenty complicated. The head on view is excellent, the sound is good, easy to work with. Of course as you angle out the picture is not as good but it's not a home movie theater either. Good product at great price. I'm a happy camper!", "Date": "October 10, 2012"}, {"Title": "Good TV for the garage", "Author": "Andy Harper Jr.", "ReviewID": "R1U0Y6S68DG12X", "Overall": "5.0", "Content": "It is the perfect TV for our garage. It has the ports we need and has a good picture for the price. We use it primarily for workout videos and the kids Xbox 360.", "Date": "October 8, 2012"}, {"Title": "Fair", "Author": "Jared T. Mortensen", "ReviewID": "R28AGF47TNN8BZ", "Overall": "3.0", "Content": "I purchased this item to use as a computer monitor but the resolution was not good enough and it gave me a headache. I ended up using it as a TV in the family room and it works OK for this task.", "Date": "October 2, 2012"}, {"Title": "Happy Returns!", "Author": "Starfishin \"Starfishin\"", "ReviewID": "R22D7GQWSADKS8", "Overall": "5.0", "Content": "Bought this because of the price, and the strong reviews. Hooked it up with an HDMI cable, and followed the advice posted here regarding changing the color settings. Still, the colors were kind of muted -- disappointing, but not a deal breaker. After a week or so, though,  a solid black box started popping up in the middle of the screen.  It would disappear if I turned the tv off and back on, but since it was still under full warranty w/free return shipping I decided to exchange it.What a difference in the replacement tv! Right out of the box the colors were bright and crisp -- didn't even need to change the settings. I think there must be some sort of quality control problem with these tvs that accounts for those purchasers who report color problems.  I would advise anyone who buys this set and has color problems to not settle for muted colors, and exchange it right away. This set should have a bright, crisp picture.I agree with those who complain that the top volume is not very loud.  Over the past few weeks I've been traveling for work, and have encountered about a dozen new tvs of various makes and sizes. The max volume on all of them was not what I would consider loud (not loud enough for everyone in a good-sized conference room to easily hear, for example.) A colleague suggested that they're now being made that way in order to encourage people to buy external speakers.  Maybe so -- but I wonder if it's really because they are using cheaper internal speakers that can't handle what used to be considered a normal loud volume. Either way, the volume issue seems to cut across brands, and is not particular to this tv.", "Date": "September 12, 2012"}, {"Title": "Great TV for the price", "Author": "B. Clifford", "ReviewID": "RTA3C420KG33B", "Overall": "5.0", "Content": "This TV has a terrific picture and good audio quality. I agree with others that the audio is not very rich and does not compete well with background noise, but is more than adequate in quieter settings like the bedroom.", "Date": "August 17, 2012"}, {"Title": "One small problem", "Author": "Janie Head \"jpslm271\"", "ReviewID": "R1KWBW8Q3FY9EW", "Overall": "4.0", "Content": "The tv is great. Easy set up, took about 5 minutes. Getting the tv going only took a few minutes as well. The screen can be bright or dim depending on the settings you want. The sound, to many reviewers said it was horrible. I had the sound so loud that I could hear it all over my house. I have a standard home. The one and only sort of problem is that I have is that there is a delay when turning the tv on. Once it is turn on, no problems. When hitting the mute button, you have to hit the button twice to mute all the way. GREAT tv for the best deal. For $230 it was worth the price!", "Date": "August 14, 2012"}, {"Title": "A good deal", "Author": "N. Buchanan", "ReviewID": "R2W01C0Y8G5M22", "Overall": "4.0", "Content": "This set is definitely a good deal. I was a little worried about getting a 720p screen that was bigger than my 1080p computer monitor, but for television from a distance (as opposed to text up close) you can't tell the difference. Sound is fine, picture is crisp. I only watch DVDs and streams anyway, so the media resolution is way less than the set--having 1080p resolution wouldn't really help me much.A light leak has developed in the upper right corner. This wasn't there in the beginning, so I'm watching it carefully to see if it increases. But it isn't visible when there is an image on screen, and the existence of the leak doesn't bother me as long as it doesn't affect the picture.The build quality is good, it feels solid, not like some of the other really cheapo sets out there. I feel like it was worth paying a bit more and getting a Toshiba.", "Date": "August 12, 2012"}, {"Title": "toshiba tv 32 \"", "Author": "Rafiq K", "ReviewID": "R2ZGQ40386CIC3", "Overall": "5.0", "Content": "Excellent Product at very reasonable price, beats expesive ones hands down any time.I am happy to have chosen this product and also free shipping was like icing on the cake.", "Date": "August 8, 2012"}, {"Title": "Great TV", "Author": "macpacjax", "ReviewID": "RF7VTSHSW2QI6", "Overall": "5.0", "Content": "Transferred to Okinawa Japan, we needed a larger TV for the bedroom and the cheapest over here was over 300 dollars, bought this one through Amazon for 250 and it is awesome. The cable here is not the best,but I have been able to adjust the settings to make up for the poor quality Mediati cable (satellite feed from mainland Japan from another base there). The sound is very loud, the picture is very clear, so far I am very pleased with this TV. Great price for a great medium size TV.", "Date": "July 30, 2012"}, {"Title": "Best product ever purchased", "Author": "Law", "ReviewID": "R3HHYCATC5TGKG", "Overall": "5.0", "Content": "The TV is very easy to set up, very clear picture, good resolution, no dead pixel and good sound quality.", "Date": "May 25, 2012"}, {"Title": "Non working on arrival. Returned and replaced.", "Author": "Angela", "ReviewID": "R2BK5J8NK052Y1", "Overall": "4.0", "Content": "The television was dead straight out of the box. (Manufacture date of June 2012) When turned on, power light comes on followed by the Toshiba logo appearing then tv goes black as if it was turned off. Immediately called Toshiba customer support and was asked to 'troubleshoot' by leaving unplugged for 10 seconds and retrying. After a few attempts at this and still nothing, I was told someone would contact me in the next 48hrs to schedule a repair within 7-10 days. Nope! I asked for my ticket/complaint # and then opted for the better option of Amazon's return/replacement policy which is much simpler and faster. Will update this review once my replacement arrives.---UpdateReplacement received (also a manufacture date of June 2012). Excellent picture and very good sound. Easy setup. The remote control has a cheap feel to it, but it is very functional and the buttons are easy to find and use. The downside of the tv is there are not enough connections in the back for connecting game systems or a dvd player. It is on the other hand light enough to move around when you need to switch connections. I would have easily given this TV 5 stars had I not needed a replacement.", "Date": "July 11, 2012"}, {"Title": "Horrible TV Don't get this model", "Author": "Fuchia Sky", "ReviewID": "R3CXVPW13G4GIJ", "Overall": "1.0", "Content": "I got this TV a week ago and was so disappointed. The colours were horrible and I tried to adjust them and didn't use retail mode. There is quite a delay between channels when you click up or down to the next channel. Also there was scattered noise reception across the picture when viewing TV. Adjusted the TV cable in the back which was secure but the scattered pixel noise drove me nuts. Also the sound is not clear and hard to decipher.  Also I could not find a clock on the TV when clicking between channels.Just returned this and got the 32\" Panasonic Viera which I'm setting up right now.Save your money and get another model. According to the store I shopped at any model with an S is a great model ie. Samsung, Sony.  The only reason I didn't get a Samsung at the store where I purchased my new TV is because the customer service guy helping me said that the Panasonic was a better model then the Samsung they had in stock and it was on sale. It has a media centre, USB slot, HDMI etc.", "Date": "October 2, 2012"}, {"Title": "cheap power board", "Author": "SAILOR", "ReviewID": "RKKGJ4EE1ZL5H", "Overall": "2.0", "Content": "TV has a cheap power board that died after the warranty was up. I was able to find a little shop that repaired it for $149", "Date": "August 15, 2012"}, {"Title": "very poor ticker on all espn and css chanels", "Author": "michael capps", "ReviewID": "R1FNO0FGGA1HCS", "Overall": "2.0", "Content": "the small ticker band that shows scores, teams, etc. is clear when the ticker is not moving, but the second motion starts, the line becomes so blurred it cannot be read----called Toshiba, they blamed Comcast----ordered 2nd tv--same problem---tried every screen setting--results same----Comcast says they have complaints from others about same model---nothing corrects---32c120u 32 hdtv--picture otherwise clear and bright", "Date": "February 19, 2013"}, {"Title": "Toshiba does not stand behind their product", "Author": "Susan Koo \"Susan\"", "ReviewID": "RG7I4WNIK6LQJ", "Overall": "1.0", "Content": "My Toshiba TV broke down after 1 year and a half.  I spoke to 3 agents at Toshiba, including Robin Morales at Corporate Escalations.  They all told me the same thing, that it is out of warranty, although product was defective.  Who expects for a TV to last only 1 1/2 years?  I also have two Toshiba laptops which overheats all the time!!!  Never buying Toshiba again.", "Date": "February 6, 2013"}, {"Title": "The price was right", "Author": "John Hundt", "ReviewID": "R2GZD0GTEHLRAU", "Overall": "2.0", "Content": "The picture is not very bright but you get what you pay for.  For less than $200 it was a good buy.", "Date": "February 2, 2013"}, {"Title": "issues w/ volume on the TV", "Author": "misty runyon", "ReviewID": "R3VZMSVDIIGR0C", "Overall": "2.0", "Content": "This purchase was a Christmas gift & the volume on this TV goes in & out all the time. I have never experienced this type of issue with any TV let alone a new one.", "Date": "January 22, 2013"}, {"Title": "THERE'S BETTER OUT THERE", "Author": "Thomas J. Coughlin", "ReviewID": "R26VDIEYTO0DP2", "Overall": "1.0", "Content": "I purchased this TV set for two reasons: the Toshiba name and the size of the screen.  Unfortunately, the television set is slow to turn on, the picture is grainy, and the remote control is slow to respond.  Very disappointed with this Toshiba product when today's technology offers so much more.", "Date": "January 22, 2013"}, {"Title": "Great TV", "Author": "Charlie The Pug", "ReviewID": "R2R5C7NZ2E3Q2O", "Overall": "5.0", "Content": "For the price I paid for this TV my son really enjoys it.  The TV is located in a college apartment, hooked up to an Xbox 360.  It runs continuously.There has been no problems with this set and the sound is good and the picture is clear.I bought a Square Trade  warranty  just in case something goes wrong with it.", "Date": "November 4, 2012"}, {"Title": "Toshiba quality never dissapoints", "Author": "A. Dicenzo", "ReviewID": "R2DLEHJ3SNJPON", "Overall": "4.0", "Content": "Looking for a 32\" flat screen tv for a bedroom I turned once again to Toshiba and I am not dissapointed that I did. The video and audio are outstanding. Ordering was easy. Price was excellent. And delivery was fast. A great experience.The one small nit I have is that it takes about 10 seconds from power on before the Toshiba logo come on. But from there performance is excellent.Highly recommend it.", "Date": "August 13, 2012"}, {"Title": "Toshiba", "Author": "BRET", "ReviewID": "RLDHJU4O1BHTX", "Overall": "5.0", "Content": "Many great features such as history, half mute, etc. The sound and picture are good for a bedroom tv. Also works well as a computer monitor if needed.", "Date": "June 27, 2012"}, {"Title": "Marvelous!", "Author": "neneng", "ReviewID": "R10PQJSMQYKJXM", "Overall": "5.0", "Content": "This product is absolutely the best for the price! I played the digital possibilities on the remote for further Top Viewing and Fun!  It is what it says it is! And, Amazon.com is also Tops in Customer Service and Delivery is on the Money!  Thanks a million.", "Date": "June 24, 2012"}, {"Title": "Clear but A Dark Picture", "Author": "Matt", "ReviewID": "R3MHCEK1S89529", "Overall": "2.0", "Content": "The picture was really dark even with max brightness settings.  The picture was clear, but sometimes it was hard to follow what was happening since it was so dark.", "Date": "May 4, 2014"}, {"Title": "I like it I don't love it.", "Author": "Carlos Burgo", "ReviewID": "R2641SHPYKIUP2", "Overall": "4.0", "Content": "This could easily be a 5 but:When I got it the screen was a bit dark and you have to find the energy saving mode which is pretty easy but I could see how some people would find major difficulty and probably just assume the screen was always dark.If your house is really quiet and you have the volume on the lowest setting which is a 1 it still seems pretty loud. And the volume seems to come out of the back of the TV which is the weirdest thing ever.The stand doesn't swivel which is a huge disappointment.Fix those things and it'll be a 5.", "Date": "April 16, 2014"}, {"Title": "Buyer Beware!", "Author": "J9 Meloni", "ReviewID": "R2A7N1AOMT1FTA", "Overall": "3.0", "Content": "I purchased this as a gift for my family summer of 2012. It started out okay, but I never could get the tv bright enough. It has a very dark display, no matter what you do with the settings. I'm no expert, but fairly versed in the AV world. The purpose of buying this was to have a bigger screen for household members who have visual difficulty. A dark display is not helpful in this scenario. Here we are less than two years after purchase and it is inoperable. This week, thee display has been \"hijacked\" by scrolling Toshiba logos. Nothing seems to make it stop. Naturally, it is out of warranty, so I will have to pay to have it diagnosed and then decide if it's worth repairing. I may have to replace it. Who knows, but buyer beware.", "Date": "March 29, 2014"}, {"Title": "screen is fine but the remote", "Author": "Sls", "ReviewID": "RZJOREEHK0UE5", "Overall": "3.0", "Content": "went crazy within the first week we had it.  it was stuck on volume up, I didn't know what was going on  and now the remote doesn't work at all.  we use the cable remote so it's not that big of a deal, but i can't access any of the tv's options or menus.", "Date": "March 22, 2014"}, {"Title": "Got this for my brother.....", "Author": "Allyson M. Trionfo", "ReviewID": "R19QMHOBZ1JYYQ", "Overall": "5.0", "Content": "It is a very nice t.v. and picture is crystal clear....I would recommend this t.v., the sound and picture are both nice!!!", "Date": "March 13, 2014"}, {"Title": "Quality", "Author": "d", "ReviewID": "RUF0ZOKU2AH6N", "Overall": "5.0", "Content": "This was a real deal. It was better than most televisions costing much more. The picture was true quality and it got to me fast.", "Date": "February 21, 2014"}, {"Title": "Bought for the basement", "Author": "Jeff B", "ReviewID": "RVO4Z30OA24W9", "Overall": "4.0", "Content": "This is a great TV and a great price.I needed something to replace the old tube TV that was in the basement.This TV is great for the kids to play their video games on.", "Date": "January 10, 2014"}, {"Title": "it's cool", "Author": "nile", "ReviewID": "R3OSJPG011D31B", "Overall": "4.0", "Content": "got this tv a year now , works lovely, shows pretty clean but i aint no techy ... problems are the remote's power button, and it's input button stop working  after a year :( ...", "Date": "January 4, 2014"}, {"Title": "power button", "Author": "billy", "ReviewID": "R2BAVRXDV7SGTD", "Overall": "4.0", "Content": "one fault I have with this tv, the power button on the remote rarely turns the tv on but always turns it off. How annoying is it getting up every time to push the button on the tv itself.", "Date": "December 11, 2013"}, {"Title": "Great Tv for the price!!!!", "Author": "Henry Smith", "ReviewID": "RBPJNOPWZZOVU", "Overall": "5.0", "Content": "A great Tv for the price,I had it hooked up in no time at all.A really good Tv for anyone!!!!", "Date": "December 6, 2013"}, {"Title": "Toshiba 32 inch TV", "Author": "cuccia", "ReviewID": "R2RYHU87FBNVYN", "Overall": "5.0", "Content": "The TV is great a great buy.  It fits on our stand great and enjoy it all the time. Didn't have to go anywhere to purchase it.", "Date": "November 15, 2013"}, {"Title": "good deal", "Author": "Nicholas Miller", "ReviewID": "R3IFPUSIYL6URX", "Overall": "4.0", "Content": "this was a good price for the tv. I am happy with the sound and the color and it is easy to set up", "Date": "October 30, 2013"}, {"Title": "Pretty Good", "Author": "janinasgot", "ReviewID": "RCNVU5OU1QS51", "Overall": "4.0", "Content": "This was a good purchase for a great price. I was pleased with it. it wouold have been better if it was compatible with my home theatre.", "Date": "October 25, 2013"}, {"Title": "Great for the Price", "Author": "LeeLee", "ReviewID": "RJ71M2M2AGTNU", "Overall": "4.0", "Content": "I ordered this TV to put in my bedroom.  I was spoiled by my Mitsubishi because it has 16 Yamaha speakers built in and I got the added subwoofer, so it sounded awesome. This TV's sound was kind of lame in comparison,  but the picture was really nice, and the price was fantastic.  And the set was easy to set up, and not too heavy for me to move.  Anyway, I figured out how to run a cable from this TV to my Bose Sound Dock Two, and now I have really nice sound coming out of the set.  I suppose if you bought a separate sound bar you could accomplish the same or similar effects.  Overall I really like the set now.", "Date": "October 21, 2013"}, {"Title": "love it for the price i got it for", "Author": "Ramirez94", "ReviewID": "R3LFCQJSFNM2F7", "Overall": "5.0", "Content": "i was amazed as it was a steal at the price i got it amazing tv for its price i how ever didnt like the slow channel surfing and dont know if my remote control was defective as the power button didnt function properly either way ill just get a universal remote control anyways", "Date": "October 19, 2013"}, {"Title": "TV", "Author": "A. L. T.", "ReviewID": "R1AJWR8GP6I8YJ", "Overall": "4.0", "Content": "Nice tv and a great purchase. I like the option to pay over 24 mo with no interest. Thumbs up!", "Date": "October 2, 2013"}, {"Title": "Great TV", "Author": "Audie", "ReviewID": "RPANHVRKD7X9M", "Overall": "5.0", "Content": "Using it for our Master Bedroom, wouldn't have anything else, we tried a Vizio brand & it didn't hold up. I have a theater 42\" Toshiba in our living room for 12 yrs. now & it's the only brand I will ever buy!!", "Date": "September 24, 2013"}, {"Title": "One year in and still looking good.", "Author": "Michael Garde", "ReviewID": "R1QEQ9YGMWZJIB", "Overall": "5.0", "Content": "I purchased 2 of these just over 1 year ago for a bar. They are on 12+ hours a day 6 days a week, so far that is at least 3750 hours and they still look good. Once I set them up I haven't used the remote other then changing the channel so I'll leave it up to the other reviewers to give you the ups and downs, all I can attest to is how long they have lasted.", "Date": "September 16, 2013"}, {"Title": "great tv", "Author": "Dee", "ReviewID": "R18MDYN7U4Z22E", "Overall": "5.0", "Content": "Purchased for my twin boys and they love it great sound color. So far it haven't let them down as much as they use it for playing games and watching tveasy to set up and controlPlus the price was great for the brandHighly recommend this product", "Date": "August 31, 2013"}, {"Title": "PERFECT COLLEGE TV", "Author": "Dipchit", "ReviewID": "R1R9IPE212A09K", "Overall": "5.0", "Content": "On a college budget this tv works perfectly, and it's quality is better than more expensive brands depending on the compared tv", "Date": "August 25, 2013"}, {"Title": "Toshiba 32C120U 32-Inch 720p 60Hz LCD HDTV", "Author": "Kris Harris", "ReviewID": "R6F7UZD2ZEU9Z", "Overall": "5.0", "Content": "Nice TV for the price. Wanted a second TV for when the Grand kids come to visit. Needed it mostly for them to play video games. So didn't  want to spend too much on a TV we would not hardly ever watch. I was pleasantly pleased with the picture quality. The screen is non glare so it isn't reflecting from the windows and has a good sound. Plus it was easy to setup.", "Date": "August 20, 2013"}, {"Title": "GOOD PRODUCT", "Author": "Larry R. Grass \"New on Block\"", "ReviewID": "R20FHFI1JD2F2C", "Overall": "5.0", "Content": "This is well worth the money and all went smoothly.  Arrived on time and works great.  As a second it is better and less expensive than others.  Good seller.!", "Date": "August 15, 2013"}, {"Title": "great product", "Author": "veronica woodley", "ReviewID": "R392DBLXKCDR3O", "Overall": "5.0", "Content": "Just as expected product looked same as on line.  Great product.  Will purchase more items.  Love it.  Great Great  great", "Date": "August 12, 2013"}, {"Title": "Love my newish TV.", "Author": "Alex82", "ReviewID": "R259HY38DRP1J6", "Overall": "5.0", "Content": "Been over a month: like the other reviewers, I agree that the sound is great, picture quality works for me. Great size, in my bedroom. The remote is a little demanding, has to be pointing directly at the tiny receiver circle. Not real complaints.", "Date": "August 6, 2013"}, {"Title": "Very good tv for the price", "Author": "Jason Collins", "ReviewID": "R3DRULW7P6W2M7", "Overall": "4.0", "Content": "Picture in HD is very good.  Picture in SD is also very good.  I would recommend this television.  Sound quality is good.", "Date": "August 6, 2013"}, {"Title": "great", "Author": "roger hewell", "ReviewID": "RR9ODT89TAO6D", "Overall": "5.0", "Content": "first one didn't work but the second has a real good picture. one two three four five six more words.", "Date": "August 4, 2013"}, {"Title": "Perfect for us", "Author": "Nancy Lemons", "ReviewID": "R19Y2R3F0AGZJF", "Overall": "4.0", "Content": "We FINALLY gave up our old tv (you know the big one with the tubes). This new tv was exactly the right size for our small place and we are able to pick up three Public Broadcasting channels now. We don't have cable and we like PBS, so this is great for us. We use our computer to stream other content from Netflix and other sites with a long cord going from the computer to the new tv monitor. Works great. I don't know why we hung onto the old tv for so long. Nostalgia?", "Date": "July 31, 2013"}, {"Title": "32 inch TV", "Author": "Pokesalad1952", "ReviewID": "R3QO0FBHDZESK9", "Overall": "5.0", "Content": "Great!!!Works like a charm. Comes in handy for my sons bedroom, when there is something else on that I want to watch.", "Date": "July 22, 2013"}, {"Title": "It's great!", "Author": "cedarhurst", "ReviewID": "R2UISHM1QE2A88", "Overall": "5.0", "Content": "Could not be more pleased with this purchase. The only change to the product that I would make concerns the layout/structure of the features involved in the setup; a diagram would be helpful.I used the \"tip\" from another reviewer and turned off one of the energy saver options to achieve a more brilliant picture. I would recommend this product to a friend", "Date": "July 15, 2013"}, {"Title": "Toshiba 32'", "Author": "Anitra Scott", "ReviewID": "R33CB9I4H8J9E7", "Overall": "3.0", "Content": "No idea why I am unable to view the movies via DVD in color. Without cable connection the movies are not in color. Why is this occurring? Is there a connection error??", "Date": "July 7, 2013"}, {"Title": "Decent for the price", "Author": "Trish DeGroot", "ReviewID": "RBIDHO50A6XB8", "Overall": "3.0", "Content": "I like this tv well enough, but the remote is really awful - extremely temperamental and non-responsive (gives my boyfriend fits, actually). I agree that the sound quality is not great (why would the sound come out of the back of the tv?), but I bought a sound bar at the same time which is incredible, so it hasn't been a problem. Bottom line, if you generally want the best product you can get within a certain realm this probably isn't it. But if you can handle 'good enough' and compensate for a couple of shortcomings, this tv will work fine.", "Date": "June 30, 2013"}, {"Title": "nice pic,audio--not so much", "Author": "Alicia B. Katz", "ReviewID": "RH6YO0W5BHMLX", "Overall": "4.0", "Content": "Overall I am happy with this set, although I have only had it a couple months.  The audio is horrible, but I always intended to hook up my Bose speakers so it really doesn't matter. Good value.", "Date": "June 30, 2013"}, {"Title": "great item for the price", "Author": "Hilary Snyder", "ReviewID": "R3G5YJ3FLBEMRT", "Overall": "4.0", "Content": "great picture, easy set up, the only downfall was the screws that camefor mounting did not work. But all and all great item", "Date": "June 21, 2013"}, {"Title": "Very, very nice tv for the price.", "Author": "jeremy grueninger", "ReviewID": "R118LK4YGMZQX6", "Overall": "5.0", "Content": "For the price, it's a very nice tv.  I don't watch tv, i watch movies and play my PS3 on it, and it is very nice, also allows me to watch movies in HD and blue rays (which is nice).  I'd say it is almost, if not as good as some of the more expensive brands, like LG and Sony.  Also, the onboard speakers work very well.  You can't adjust the height or angle on the tv, but then, just put some books or something under it until its the right height.", "Date": "June 17, 2013"}, {"Title": "great deal", "Author": "Lolly", "ReviewID": "R1WWHP0PFT0TOM", "Overall": "5.0", "Content": "I purchased this as a gift, through warehouse deals.  Open box, used, like new for 218.00.  There were several available, so I wondered what the deal was.  After reading reviews, I saw several people returned them because the picture was too dim.  You need to turn off the energy saving mode.  Simple fix which I also learned from reading the reviews.  It came in original packing with all the protective film intact.  Perfect condition. The picture is excellent and the sound is good too.  I was originally looking for a smaller size (budget constraints) but was concerned because the sound is never good on those.  I took a chance on this and am glad I did.  Recipient was thrilled and most grateful.", "Date": "June 15, 2013"}, {"Title": "Great TV for Price", "Author": "Marilyn B. Schanck \"Sun worshiper\"", "ReviewID": "RR78MX3QEMEJN", "Overall": "5.0", "Content": "TV is great. Price fantastic.Remote very good. Great for playing games etc.The connections are very convenient.The setup was easy and understandable.", "Date": "June 3, 2013"}, {"Title": "A Good TV at a Decent Price", "Author": "gracecat", "ReviewID": "RZLA5S3EJCMFF", "Overall": "5.0", "Content": "A very good buy for the money. We followed some of the other reviewer's advice, and turned the settings off of energy saver. I now have a beautiful picture and good sound. This is quite a step up for me.... flat screen. So I am very happy with my purchase.", "Date": "May 29, 2013"}, {"Title": "Fabulous picture, the sound needs to be improved.", "Author": "Georgia", "ReviewID": "R454CC6LFPXFO", "Overall": "4.0", "Content": "Really like my Toshiba with one exception...the sound.  (I have perfect hearing, by the way...)On most channels you have to have the sound UP .....ALL the way in order to hear clearly!!!I need to get some sort of speaker or booster to have better sound.  I am researching that now.", "Date": "May 26, 2013"}, {"Title": "BOSS", "Author": "Kesron Valere", "ReviewID": "RG3UANKJ9NQ28", "Overall": "5.0", "Content": "SO FAR NOT A COMPLAIN IT PLAY CLEAR NICE FOR A BEDROOM ENTERTAINMENT I WUD  BUY ANOTHER ONE FOR ALL THE ROOMS IN MY HOUSE", "Date": "May 25, 2013"}, {"Title": "Great Light-Weight TV with Good Screen", "Author": "P. Stucki \"RichardakaDick&Pam;\"", "ReviewID": "R3DXBXGJ0IQHCL", "Overall": "5.0", "Content": "We were replacing an old TV that weighed a ton. It was so nice to get a great TV that was the size we needed and easy to install. One person could do, where we had to have 2 people put in the last one.", "Date": "May 22, 2013"}, {"Title": "Perfect for the guest room - Not crazy about the remote", "Author": "Legal&Sane;", "ReviewID": "R2IJ6T01NWS4ZU", "Overall": "3.0", "Content": "Though this tv works well for the guest room, I really don't like the remote.  It isn't intuitive, and they didn't call things what you would expect them to be called.  I find it difficult to use, especially if its dark.  The tv itself is very good quality for the price.  As a back up for the guest room, you can't ask for more.", "Date": "May 21, 2013"}, {"Title": "Retirement Gift", "Author": "Cheryl Gillette", "ReviewID": "R1EWWNQZ61VHTD", "Overall": "5.0", "Content": "The recipient loved it. What better way to remember people than to look a a gift that was given in love daily.", "Date": "May 21, 2013"}, {"Title": "Not a bad TV", "Author": "Darren Beebe", "ReviewID": "R2IVX4LH23QTQS", "Overall": "5.0", "Content": "Bought this for a replacement for the bedroom, so the bedroom tv could be put in the RV.  Pretty good tv, hooked up to an HD Satellite Receiver.  Does the job.  Not as clear as our 65\", but that goes without saying.  Good price.  Pretty satisfied.", "Date": "May 19, 2013"}, {"Title": "Long-time Toshiba owner", "Author": "Robert Shrader", "ReviewID": "R2VDIIINW2HKAY", "Overall": "5.0", "Content": "TV has been excellent.  Cannot beat the price either.  Perfect for my teenager's room.  I have the 40\" version in my room.", "Date": "May 19, 2013"}, {"Title": "Great picture", "Author": "doree miles", "ReviewID": "R1T45X3BJ6VVIU", "Overall": "4.0", "Content": "I am very happy with this purchase, with one complaint.  When I turn the TV on, it takes a long time to turn on and for anything to even appear on the screen.  After pushing the \"ON\" button, I have counted to about 16 seconds with a blank screen until the word Toshiba appears.  This seems too long.  Other 32\" TV that are LDC flat panels but different brand start up much quicker.Changing stations is a bit slow as well.", "Date": "May 17, 2013"}, {"Title": "I love my magic window...", "Author": "Herman Feliz", "ReviewID": "R2I88K2QR663RO", "Overall": "5.0", "Content": "Works great. started watching it as soon as it came in the mail for me. I found it for a fairly good price. Toshiba is a brand I like & trust.", "Date": "May 14, 2013"}, {"Title": "HDTV", "Author": "Cee28", "ReviewID": "R18R5H7UNLL46U", "Overall": "4.0", "Content": "I am quite satisfied with my purchase.  The size was perfect and the picture very good, it was also easy to hook up to my set top box", "Date": "May 14, 2013"}, {"Title": "Gift for my daughter", "Author": "Jerome l. Bauder", "ReviewID": "R2IG38M2DHXGLB", "Overall": "4.0", "Content": "My daughter loves this TV. I never saw it operate so I can not give you any more information than that.", "Date": "May 13, 2013"}, {"Title": "Good TV", "Author": "Phillip Butler", "ReviewID": "RQJUMX9TBXC2S", "Overall": "5.0", "Content": "This was a gift and my friend loves it. She hasn't had any problems or issues with the television. The picture is crisp and clear.", "Date": "May 12, 2013"}, {"Title": "Great Gift", "Author": "NC Grandma", "ReviewID": "R20CMWXRH39CKF", "Overall": "5.0", "Content": "I ordered this as a gift for my son and daughter-in-law. They are just loving the TV and the purchase was easy on Mom's pocketbook! Thanks Amazon! It is so nice to purchase something and have Amazon ship it for me. Makes gift giving a lot easier!", "Date": "May 11, 2013"}, {"Title": "Picture Not as good as I expected", "Author": "Amazon Customer", "ReviewID": "R53EZS84ABZZL", "Overall": "3.0", "Content": "We are using this as a monitor for our PC and were a bit disappointed with the picture quality of this set.  We also purchased a less expensive Element TV around the same time, and the picture quality of the Element is considerably better than the more expensive more popular Toshiba brand.  If we could return it and purchase a second Element we would.  In addition, the base stand is a lot wider than that of the Element, which reduces usable desk space.", "Date": "May 10, 2013"}, {"Title": "NICE TV AND GREAT PRICE!", "Author": "PAUL HERMAN", "ReviewID": "R1HWN3T4XZR90V", "Overall": "4.0", "Content": "CAN'T BEAT THIS FOR THE PRICE.....PICTURE AND SOUND QUALITY GOOD...DO THE SUGGESTED TWEEKING AND YOU'LL BE VERY PLEASED WITH THE RESULTS!", "Date": "May 9, 2013"}, {"Title": "Awesome", "Author": "Karl Evers", "ReviewID": "R22JWZSSLWHWUF", "Overall": "5.0", "Content": "Great TV, great Price, no problems hereIm not sure if it is 1080p, as it only says 720 on amazon, but it does seem to play 1080p with PS3", "Date": "May 9, 2013"}, {"Title": "Great picture and good sound", "Author": "Tina", "ReviewID": "R1UD3SL2B68OKX", "Overall": "5.0", "Content": "The picture on this screen is really good and the sound is terrific.  Granted we are using it in a 14x12 sized room, but it only needs to be turned up to 1 or 2 bars for night time watching, otherwise it's too loud.  We are very happy with this TV.", "Date": "May 6, 2013"}, {"Title": "Good HDTV", "Author": "Arthur G. Broadhurst", "ReviewID": "R3S8JLVRSNBP7S", "Overall": "4.0", "Content": "I have all LG TVs and like them.  However I needed a replacement TV for one that had a problem and would cost too much to repair so I bought this based on reviews and price.  After a couple of months it seems to work, good quality picture....  Used in bedroom, so it does not get a lot of use.", "Date": "May 6, 2013"}, {"Title": "Loved it.", "Author": "Monkey D. Luffy \"X\"", "ReviewID": "R1OKH6Z3GVOS4M", "Overall": "5.0", "Content": "We enjoyed it enough that after we bought our first one we came back and bought a second one for our other bedroom.", "Date": "May 6, 2013"}, {"Title": "Nice", "Author": "Walter Sr", "ReviewID": "R16FGUGRPSR1V6", "Overall": "4.0", "Content": "It's a solid buy. The picture quality is noticeably inferior to the 1080p Screptre, but I am betting this one will last more than 6 months.", "Date": "May 2, 2013"}, {"Title": "Nice", "Author": "D. Lopez", "ReviewID": "R18FSIWXV1PZ72", "Overall": "4.0", "Content": "Really good image and sound; for the price is not bad at all. We got within 2-3 days, easy to set up.", "Date": "May 1, 2013"}, {"Title": "Good Bedroom TV", "Author": "fatcatdeals \"fatcatdeals\"", "ReviewID": "R2M1CEQ5ROP9HO", "Overall": "4.0", "Content": "This is the second one of these I've bought.  The first went in my bedroom and bought a second for the guest bedroom because the first worked out so good.  They both are used almost exclusively with a Roku hookup for Amazon Prime and Netflix and have had no problems - both have very good pictures.  The volume could be a little better but since they're used mainly at night that doesn't matter too much.", "Date": "May 1, 2013"}, {"Title": "Excellent TV for the money...", "Author": "Pats01776", "ReviewID": "R16OPY7ZZT47FK", "Overall": "5.0", "Content": "We love the new TV.  Delivered quickly, set up should have been easy, but my husband decided he could do it without reading the directions.  We ended up calling Amazon tech support and they were fantastic!  They stayed on the phone and walked him through each step and when an error message appeared, they figured out what code to use and within 45 minutes all was working as it should.Great customer support!", "Date": "April 26, 2013"}, {"Title": "Tv.", "Author": "Florence", "ReviewID": "R11KJR4YK5PO8F", "Overall": "4.0", "Content": "I like it very much, colour not too sharp, but very good for the bedroom where I ordered it for.", "Date": "April 24, 2013"}, {"Title": "Very nice television, but there are some hitches", "Author": "Eric Whitehead \"ewleonardspock\"", "ReviewID": "RDRIUUFHWTJPH", "Overall": "5.0", "Content": "This is a very nice television, but it does have some hitches.Pros:It's nice and big.It has great picture quality.It wasn't very expensive.It supports 1080p in that it converts it down to 720p.Cons:It's not 1080p (although I knew that going in).It doesn't have a lot of inputs (One shared Composite video and component video input).There were issues with the color at certain resolutions (I'll explain that more below).You have to fumble with a lot of the settings to get it working just right.As for the color issues.  The problem can be almost exclusively attributed to Microsoft Windows.  When I connect my Mac to the television over HDMI, the color is just fine.  Windows on the other hand, had a lot of issues with this tv.  When I connected the PC up to it originally (it's a Dell Studio Hybrid running Windows 7 by the way), I had to fumble around with a bunch of settings in Windows just to find a resolution that worked with the TV.  When I finally found one that fit properly and started a movie, I noticed that portions of the picture that were really bright yellow (almost white) actually came out lime green.  After spending an unreasonable amount of time messing with Windows trying to get into advanced video settings I just gave up and used a 3rd party program that let me manually manipulate values in the registry.  Even this didn't work though.  I could make the green go away, but as a result the image was overly dark and difficult to see.  I eventually decided to try it with my old Windows 7 laptop.  Running at the same resolution, I saw the green spots, so I went into the advanced video controls on the laptop (the laptop has a fancy-ish Nvidia video card so I there was a nice Nvidia control panel that gave me options Windows didn't seem to) and found the color panel (I forget exactly what it's called now), one of the settings was to change the color from RGB to YPrPb (or something like that) which fixed the problem with the green spots, but back on the Dell, there was no such option because it has a generic Intel integrated graphics chipset thing.  I finally managed to convince Windows to listen to reason and show me all of the available resolutions (one of which was normal 720p).  Once I changed it to that, the problem went away.  So moral of the story, make sure you have any computer running Windows set to either 720p or 1080p because Windows won't give you any of the options necessary in order to make the color problem go away on other resolutions.Also, for the settings on the TV, I recommend turning the automatic brightness and dynalight settings off, because they're useless.  I don't actually know which one was causing the problem, but whenever I had the fluorescent lights in my dorm room turned on, it looked like the image was flickering.As a final opinion, if you know what you're doing, you have a Mac or Linux machine or are not afraid to show Windows who's boss, and you don't need a whole lot of inputs other than HDMI, this is a great TV.  Once I got past the coloring problem it was smooth sailing, I haven't had to mess with much else since.", "Date": "April 19, 2013"}, {"Title": "Nice to see all the action with a great picture as well", "Author": "B. Nelson", "ReviewID": "R195PLE7HFN3TM", "Overall": "4.0", "Content": "This is our first LCD flat screen TV, so keeping that in mind here's our review. We've had this TV for approx 6 months and it works wonderfully. In researching these types of TVs I considered the size of our living room and how close we'd be to the device. We have a small living room so a large LCD was not what we wanted, this 32\" size  works well for our needs. We enjoy movies and some broadcast shows, but we didn't want a large TV to dominate the room and thought it'd be like sitting in a front row at the movies, bigger is not always better. Also we are not video addicted to a point that we must have a 1080p over a 720p, in looking at LCD's of each didn't seem to be that much different to me. Also, technology these days upgrades every few months (right now LED's are all the rage) and you never catch up unless you have a bottomless bank account. Toshiba has had consistent good ratings for quality and it was so nice to when Toshiba 32C120U went on sale.The picture is very clear and there is a night and day difference between the old 100 lbs TV's and these, it seems though only a 32\" model the picture is larger than that which is nice. Also, it is great to see all the action as well and especially all the characters with the HD letter box format without that squished down, shrunken picture feeling when watching on a square TV. The audio is average though, as this is not a larger TV and as thin and light as it is there doesn't seem to be much effort by most of these companies put in even above average sound. So if that is important to you or it will be the only sound you'll use for TV viewing, then maybe a bigger model would be better or start saving to add a sound bar or system to it. You of course get a remote and lots of menus to figure in setting up your viewing which is fairly self explanatory. OH, and make sure you know where it is at all time as this model does not have buttons on the actual device, without the remote you don't operate the TV unless you've programed it into another remote, say for Sat dish or cable. We found though that even programmed with the DirectTV remote we still need the Toshiba TV remote to switch to the DVD player and back. We are pleased with the quality and the price of this Toshiba and if you're looking for a smaller size in LCD I would recommend this.", "Date": "April 18, 2013"}, {"Title": "Clear quality of picture and videos", "Author": "Satyanarayan Thakur", "ReviewID": "R2PLKN9QO31JU2", "Overall": "4.0", "Content": "This TV is really good with good. its cool and looks nice. wider viewing experience and good quality of display", "Date": "April 18, 2013"}, {"Title": "nice TV for the price", "Author": "The Saint", "ReviewID": "RUOG8XG50HGDJ", "Overall": "4.0", "Content": "Good TV for a bedroom or someplace small.  I do notice the difference in picture quality over a better 1080 HDTV, but it's about what I expected.  I saw some comments complaining about channel changing speed.  It does seem a little slow on response time, but it's not something I would pay more for, just to have faster channel switching.  It's a good bargain dorm/bedroom/extra TV, not something you want as your primary home theater.", "Date": "April 17, 2013"}, {"Title": "Perfect tv", "Author": "Merida Grant", "ReviewID": "R19C9KCYUETBNV", "Overall": "5.0", "Content": "Recently purchased this tv and love it. This was not the television I intended to purchase but the price was right and I liked the design (very attractive). It was very easy to set up right out of the box--just attach the stand. Then I turned it on and was blown away. I turned on the men's NCAA tournament and was amazed by the detailed picture with basic cable input. But the final clincher was that my cable company offered me a great price on digital, so I switched to HD just in time for The Master's. I don't even like golf but was blown away by the clarity and crispness of the images on the Toshiba. I felt like I was on the course at Augusta. They will have a loyal customer in me--but I do agree with a commenter who said they should redesign the remote. The weight feels upside down and the menu button is very tiny.", "Date": "April 17, 2013"}, {"Title": "GOOD TV FOR THE MONEY", "Author": "Sheila Anerson", "ReviewID": "R29XZDCM9YWIA5", "Overall": "4.0", "Content": "I HAVE THIS TV ON MY PORCH. EVERYONE LOVES IT.MY ONLY COMENT IS THE SOUND IS NOT TOO DEFINED.", "Date": "April 14, 2013"}, {"Title": "Colors are Vibrant; picture is clear.", "Author": "LEON CASTILLO \"JOVEN\"", "ReviewID": "R2CFXSUTYF51LU", "Overall": "5.0", "Content": "I purchased this television in September 2012, it is now April 13, 2013 and I'm still impressed with the picture.  Watching local television station without cable and the picture is crisp.  Play Station Games are awesome full of high definition and color, Blue rays come out nice.  What I love the most is that My new laptop has HDMI and so does this television and watching whatever I play on my computer comes out Beautiful on this television.  I took it off the stand and hung it up on the wall and no matter where I have it facing I get no glare from daylight.", "Date": "April 13, 2013"}, {"Title": "great tv", "Author": "fm buyer", "ReviewID": "R2H1YWF4BGYGSI", "Overall": "4.0", "Content": "Hi, This tv has a great picture its much better than my white westinghouse tv .Ok may have spelled that wrong but I replaced that tv for this one in the living room and we love it. The tv may be thinker in the back that my last tv so this may make it a little heaver, but no complaints on our end it was worth the buy. Female Buyer says Enjoy!~", "Date": "April 12, 2013"}, {"Title": "Wow!! I am really happy with my TV. Great Product...", "Author": "Monica", "ReviewID": "RA2QBPOMQ4XEG", "Overall": "5.0", "Content": "Wow!! I am really happy with my TV. Great Product. Nice Pic and easy to set upThats all I have to say.", "Date": "April 12, 2013"}, {"Title": "Great TV", "Author": "Christy A Eaton", "ReviewID": "R1RGYYZEG5J9RF", "Overall": "5.0", "Content": "I'm very satisfied with this purchase. Easy to set-up and works well. It does take a few seconds for it to \"boot up\" so that can be annoying when you want the TV to turn on immediately when pressing the on button but it's just something to get used to.", "Date": "April 12, 2013"}, {"Title": "Good picture, poor sound", "Author": "Patrick M. Smith Sr.", "ReviewID": "R3MJ74W9BUR7C1", "Overall": "3.0", "Content": "This TV has a very good picture but it sounds like your listening to a telephone.  Not very good for watching broadcast TV with an antenna", "Date": "April 10, 2013"}, {"Title": "Almost 2 months and everything as expected from Toshiba", "Author": "Keith L \"Keith L.\"", "ReviewID": "R2NVQ8M6N8IV1L", "Overall": "5.0", "Content": "I'm basing my review on the fact that this TV was only $220 at the time of purchase. An excellent value. It is 720p/60Hz. If you are looking for the perfect hardcore gaming TV, keep looking. This is being used as a bedroom set and is perfect. The colors are crisp, good backlighting and contrast. It is limited to 2 HDMI ports, and a shared Component/Composite video. But also has a PC and USB port.If you are looking for a quality TV for a bedroom or den, or an affordable entry level TV of high quality, I would recommend this purchase.", "Date": "April 10, 2013"}, {"Title": "Sometimes the screen dims...", "Author": "Denise Robbins", "ReviewID": "R14U1L6CI58KOQ", "Overall": "3.0", "Content": "I was really enjoying this hdtv the first 2 months then last month the screen has started to dim, at first i thought it was my eyes, lol.I will be watching TV and its like a light bulb is going out then decides not to.  I hope that makes sense.", "Date": "April 9, 2013"}, {"Title": "Don't Worry Be Happy", "Author": "LNDN", "ReviewID": "R1G2Y229O86AL4", "Overall": "5.0", "Content": "Despite the nick picking, the TV is a great performer and I would not hesitate to buy it again, yes it operates a little different than a Sony (which it replaced-gave it to my son), and even the smaller Samsung 26 \" which I returned to BJ's once I compared the two side by side at home. Hey it's a TV, good picture, decent sound with realistic expectations, east to set up and operate. Gosh even the double tap to get max mute-a minor detail. If your one not to get stuck in the thick of thin things, you won't be disappointed with the Toshiba.Enjoy!!!", "Date": "April 7, 2013"}, {"Title": "Nice bedroom TV", "Author": "Chris Campbell", "ReviewID": "R2CNZZ67QIECPL", "Overall": "4.0", "Content": "This 32 inch Toshiba is a very good bedroom or office TV.  Not too big, not too little.  Good quality picture for 720p.", "Date": "April 6, 2013"}, {"Title": "Very good quality and value", "Author": "Michael", "ReviewID": "RKVE4SL859FI4", "Overall": "4.0", "Content": "Really a great TV and multi-media monitor for the money. I actually purchased it to connect to my laptop for an Advanced Photo-Shop class that I was taking and I have really enjoyed it to stream movies via Amazon Prime and Hulu Plus. Takes up very little space and it extremely easy to set up and use... Pic and sound quality are good for the $$$ if you wanted better, you will need to spend a little more...", "Date": "April 5, 2013"}, {"Title": "Good TV for the Price.", "Author": "Dwight", "ReviewID": "RJXIIBV900CU2", "Overall": "5.0", "Content": "Arrived in good condition.  It was easy to set-up.  Although it is a low-tech HD TV, it meets my requirements for a second room TV.  The color and sound are good.  I don't need alot of gadgets just something that gives good cable viewing.  The price was right for my purpose.", "Date": "April 5, 2013"}, {"Title": "its was good", "Author": "Kareem Pinder", "ReviewID": "R2RNQPO0HF5TVC", "Overall": "5.0", "Content": "its really good i am enjoying it i wouldnt trade it for the world i would tell this is the best one to get", "Date": "April 4, 2013"}, {"Title": "Looks great!", "Author": "Luke Lilly", "ReviewID": "R365E1S4PASCUL", "Overall": "4.0", "Content": "It looks perfect when connected to an HD receiver. Not so good when used with standard definition though, but that was expected.", "Date": "April 2, 2013"}, {"Title": "Functional, Works well for the price", "Author": "Barry", "ReviewID": "R3FCYNUQAHZD2I", "Overall": "4.0", "Content": "I've had this TV for a few months now and I would say that it does a decent job.  There are a few hitches that are a little frustrating, such as the sound not working through the PC-input.  I've also had the screen go black while watching Netflix through my Boxee, but I'm not sure whether that's my TV's fault or my Boxee's.  It was easy to set up and the picture quality is good, at least for a TV layman like myself.  It fits right in to my small post-grad apartment and my small post-grad budget.  I'd recommend it to anyone in the same situation.", "Date": "April 2, 2013"}, {"Title": "Great TV", "Author": "Ronnette", "ReviewID": "R2EY1KM5UB55SW", "Overall": "5.0", "Content": "There is no problem with this TV. I only wish that I purchased a larger TV, for my living room.", "Date": "April 1, 2013"}, {"Title": "Great Value", "Author": "Gigi", "ReviewID": "R2HUSM1FY47TR3", "Overall": "5.0", "Content": "This tv was a God-send especially for the price. I have a Toshiba jyst like this one that i have had for 4 years. I had no problems out of the old one so I decided to go with the same brand again. Delivery was fast and I'm proud to have gotten another one at a much lower price.", "Date": "April 1, 2013"}, {"Title": "A great little TV", "Author": "K. Simms", "ReviewID": "R1C2AFD3G3WZ31", "Overall": "5.0", "Content": "This is the second of this model we have purchased through Amazon.  It is an excellent TV for bedroom or office and has a beautiful, bright picture.  The sound can be a little tinny, so maxing out the bass and minimizing the treble will improve the sound.  I have it connected to my analog stereo set via a digital-to-analog switch (also available on Amazon).We have a Roku, Apple TV, and DVD player connected (the latter two via a three-way switch since the TV has only two HDMI ports) and all work perfectly.  It's not an LED, so the lifetime of the bulb is unknown.  But it is a great little set and I recommend it without reservation.", "Date": "March 31, 2013"}, {"Title": "gret television", "Author": "Stephanie Infante", "ReviewID": "R1WXL5190EONKY", "Overall": "5.0", "Content": "We have had Toshiba before and once again it lives up to it's name.  Great picture and nice size.  Would buy again.", "Date": "March 29, 2013"}, {"Title": "Great TV", "Author": "Thomas J. May", "ReviewID": "R3DF9USKYUPGMQ", "Overall": "5.0", "Content": "Great TV at a great price.  Shipment was timely and packaging superb.  I replaced a Samsung and like the Toshiba more.", "Date": "March 29, 2013"}, {"Title": "32 in Tv is great so far", "Author": "Bobby K", "ReviewID": "R2A4VDULO05WZ9", "Overall": "5.0", "Content": "Have had no trouble with this 32in Tv. Easy to get started and set up. would recommend to anyone who needs a new Tv", "Date": "March 28, 2013"}, {"Title": "Great tv for the money", "Author": "n2tib", "ReviewID": "R16PF6V1DT2IPA", "Overall": "5.0", "Content": "Great tv for the moneyI like everything about it again great tv !--------- ---------- ----------- --------- ------- ------", "Date": "March 26, 2013"}, {"Title": "Great HDTV for the price!", "Author": "Hung Pham", "ReviewID": "RRPSD810FTI6D", "Overall": "4.0", "Content": "Pros: Very cheap for an excellent HDTV. Looks great in my bedroom. Sharp clear picture and decent sound. Good number of ports for HDMI connections. Picks up free digital channels. Plays PS3 in 1080p HD!Cons: Channels a little slow to change. Lowest volume is still a little loud.Summary: Great HDTV for good price. Works great as a bedroom or video gaming set. Also nice to hook up desktop/laptop to play movies via HDMI cable. Highly recommended.", "Date": "March 25, 2013"}, {"Title": "Nice tv", "Author": "lskayaker", "ReviewID": "R3UM1WXAQK8DLC", "Overall": "4.0", "Content": "This is a very good tv and my first HD tv. Works well. I followed prior reviews for brightness settings.", "Date": "March 25, 2013"}, {"Title": "Great TV for the price", "Author": "Mobile Guy", "ReviewID": "R3IN1JMMPVEH5", "Overall": "4.0", "Content": "You can't beat the value for this price.  Colors are rich, sharp and accurate.  The audio is very deep without having to turn up the volume too high.  Makes for a perfect bedroom tv set.  I rate it a 4 instead of 5 only because the set has Eco settings on by default and mutes the picture greatly.  It takes some investigation to find the right settings to turn this off and normalize the picture quality.  Other than that, a great set for a low price.", "Date": "March 24, 2013"}, {"Title": "I had to go 5 star given the great price", "Author": "R. Cried", "ReviewID": "RAFMCDMQQ66M4", "Overall": "5.0", "Content": "If the price had been average, I would have put this as a 4 star TV.  The picture quality is good (when you take the advice to take it off of the energy star mode) but not great.  The sound is fine and I have no compaints there.  The main complaint is that it is fairly slow in booting up and responding and the buttons on the remote are not placed well.  However, given that I paid around $200 for the set, it seemed to be a 5 star set based on the good quality and overall value.  I would recommend this to anyone if the price stays in the right range.", "Date": "March 24, 2013"}, {"Title": "Wow! User friendly", "Author": "Andrew G. Davis \"Andy Davis\"", "ReviewID": "RO3WXO45X9ULD", "Overall": "5.0", "Content": "All there is, is a power cord and the plug-in for the cable.  That's it.  Plug and play.  This was the first TV with all sorts of button and colored line.  At 73yrs, all I want is to watch and not semicreate.  This my first letter box type TV and I am getting used to it and don't have to squint as I did with my old set(12yrs+). Sound is good. Clarity is great and color handling is also great.  I recommend it to everyone.  My I say that this is my 2nd Toshiba, which is in my study with the other in the great room.", "Date": "March 23, 2013"}, {"Title": "Good price, not a bad deal", "Author": "Leonard D. Gavin", "ReviewID": "R1MKHTUHCF57GV", "Overall": "4.0", "Content": "The only complaint I have is. I would like the picture to be a little brighter Other then that I give it four stars :)", "Date": "March 23, 2013"}, {"Title": "Love It - Love Toshiba", "Author": "Cheryl J. Hance", "ReviewID": "RPHMG5MIG501V", "Overall": "5.0", "Content": "This is our second Toshiba TV purchased in the last two years. We bought a 40\" for the rec room, and now this 32\" for our bedroom. We still have an old 13\" Toshiba that was given to us after 10 years of use, and was our bedroom tv for 20 years. It still has a perfect picture.", "Date": "March 23, 2013"}, {"Title": "Great buy for the dollar", "Author": "Ken Macklin", "ReviewID": "R16YNA1YUTVSJ3", "Overall": "4.0", "Content": "Bought this mainly for game play with a PS3.  Had to tweek the settings, but once they are set it looks and sounds great", "Date": "March 22, 2013"}, {"Title": "great tv", "Author": "Bessie Dyer", "ReviewID": "R227PP92VDUSPR", "Overall": "5.0", "Content": "We love our new Toshiba. We worried a little after reading reviews but the picture and sound quality is excellent. We only found some difficulty with the programing as we had never had an updated tv. Our old one was about 18 years old before we replaced it. For the price we'll buy Toshiba again.", "Date": "March 22, 2013"}, {"Title": "A perfect fit", "Author": "Leon Wahlbrink", "ReviewID": "RHNGUYXKRDIBB", "Overall": "4.0", "Content": "We needed a flat screen TV that would fit in a cabinet.  We had an eighth of inch clearance.  The picture is great and the settings were easy to work with.  An excellent value.", "Date": "March 21, 2013"}, {"Title": "Great sound for a flat screen", "Author": "Christopher den Breejen", "ReviewID": "R3FPWUMA6PCTMJ", "Overall": "5.0", "Content": "It was easy to set up and sound is much better than otherflat screen tvs we looked at.Good product for the money.14 watts is much better than 10 watts for tv speakers", "Date": "March 21, 2013"}, {"Title": "Great deal", "Author": "GI Steve", "ReviewID": "R8FDTDLIUJXV1", "Overall": "5.0", "Content": "Really good price on a quality item. I love getting a good deal. My son says the picture with his X box is fantastic.", "Date": "March 21, 2013"}, {"Title": "thank you", "Author": "mare88", "ReviewID": "R18RV5D4SC5OOL", "Overall": "5.0", "Content": "thank you but missing remote. lovely television, just whatI wanted. picture very clear. it would be much easier to use with a remote controll", "Date": "March 21, 2013"}, {"Title": "Love this TV", "Author": "B. Messmer \"CowGal\"", "ReviewID": "RFOH51YKQ6QFB", "Overall": "5.0", "Content": "Wasn't sure due to the amazing price, but this TV is great. Beautiful picture and fine sound quality. Will probably get a sound bar eventually, but no rush. Perfect for my need as an extra TV in the library.", "Date": "March 20, 2013"}, {"Title": "32\" TV", "Author": "Benny A. Greene", "ReviewID": "R2DSD23XC19RHM", "Overall": "4.0", "Content": "What I expected.  So far it has worked great, and I have realized that it was a really good value.", "Date": "March 20, 2013"}, {"Title": "Good TV", "Author": "Tracy Toccalino", "ReviewID": "R3SIMID2669702", "Overall": "4.0", "Content": "I did a lot of shopping around looking for an affordable tv for a spare room.  This seemed to fit what I wanted to spend and have....works great, looks good, no issues.", "Date": "March 20, 2013"}, {"Title": "Beautiful TV/Great price", "Author": "Irene", "ReviewID": "R1GX4S3FMFZL9O", "Overall": "5.0", "Content": "I wanted to wait until my daughter had the TV a few weeks before reviewing it.  It is beautiful. Sharp picture, great sound, easy to set up.  I will not go into a huge technical review with tips on how to get the most out of features and settings, I will leave that to techno geeks who give techno dummies like me great info.  But I can tell you  that for the price, for a Toshiba TV, this TV is worth every single cent and they are loving it here in my daughter's bedroom.  !  LOVE THIS TV!", "Date": "March 20, 2013"}, {"Title": "Good Stuff :)", "Author": "Louis Leonard", "ReviewID": "R3CUJ9ZY8P23HP", "Overall": "4.0", "Content": "Good Picture quality.....8.5/10 for the sound... The glossy black is really niceit's a great Deal with this Toshiba 32\"Satisfaction 9/10 :D", "Date": "March 19, 2013"}, {"Title": "Very nice", "Author": "G. Logsdon", "ReviewID": "R3DNS2JM2F8DLE", "Overall": "4.0", "Content": "We stayed in Fort Myers Beach @ a house with only wifi. We were there for a month and missed the regular shows, news etc.. We decided to order this tv because it had connections to our laptop. It was so nice to login to our regular tv stations. We also subscribed to Hulu and Net Flix. Good picture and sound, lightweight, and best of all? It didn't take up much room when we packed up to come home! We will be taking it with us again next year.", "Date": "March 19, 2013"}, {"Title": "Perfect bedroom tv!", "Author": "J. Vaughn \"Johny Vaughn\"", "ReviewID": "R2UCUXUM5LCG6L", "Overall": "5.0", "Content": "Got a great deal on this TV and it is perfect for my use.  It's a great buy for anyone looking for a great picture in a sleek frame for a bargain price.  I use it everyday in our bedroom and I find myself often saying \"WoW\".  It has great picture and unbelievable surround sound!", "Date": "March 18, 2013"}, {"Title": "My first Flat Screen", "Author": "LSullivan \"Lori\"", "ReviewID": "R2744I63XOXS6X", "Overall": "5.0", "Content": "This was my first purchase of a flat screen TV and I have to say I am extremely happy. This picture is great and the 32 inch size is just right for my bedroom. I feel I made an excellent choice with this purchase!", "Date": "March 18, 2013"}, {"Title": "Not Bad, Not Great", "Author": "Preston S. Page \"Preston Page\"", "ReviewID": "R181VMV2IPI98V", "Overall": "3.0", "Content": "The image quality is fair, but blacks seem a little weak. One more HDMI input would be welcome.  Sound is a little tinny.  The setup menus could be more logical.  Overall, this is a mediocre, budget screen.", "Date": "March 17, 2013"}, {"Title": "Love it", "Author": "cherlita thomas", "ReviewID": "R214E6P5AR4RL8", "Overall": "5.0", "Content": "The picture is awesome and I like how the sound is clear and how it automatically turns off even when not programed to.  This television is great!", "Date": "March 17, 2013"}, {"Title": "Good TV", "Author": "TheSnowman", "ReviewID": "RQ1R3WJGTSBS4", "Overall": "4.0", "Content": "For the price and specs, this is a good, solid TV. At 720p and 32\" it will never be the centerpiece of any serious home theater, so please don't think about it that way when considering it.This is in my home office so I can watch the news and maybe an occasional DVD. The picture is actually really good considering the limitations of size and resolution. The picture is bright, colors are vibrant, and there are no dead pixels, ghosting, or other artifacts that show up on cheap panels.I took a star off for two things that annoy me, both of which are minor and would not have stopped me from buying it.First, there is lag between changing the channel and the TV responding. I understand digital tuning has lag. I have a bigger, better Toshiba TV in the living room that does not have this issue. Yeah there's a little lag because it is digital, but the big boy TV switches channels twice as fast as this one.Second, like I said, I have a bigger 1080p Toshiba I bought about six years ago before prices came crashing down (if only I had waited four months...). Anyway, in that time, Toshiba STILL can't seem to put a \"dash\" button on the remote. I don't want to enter channel 8, then press the up button to get to 8-1. The cheap Dynex in the bedroom even has this basic feature. I would think that with digital being a requirement in the U.S. now that this would be a standard feature on TVs, but I guess not.Other than that it is a good TV. It has a few HDMI inputs, component, etc. Not a ton, but then again, this is not a home theater TV so I am not going to expect that.", "Date": "March 16, 2013"}, {"Title": "Very good -- cool volume feature", "Author": "Layla J.", "ReviewID": "REMQUATWRBKMJ", "Overall": "4.0", "Content": "I've had this TV for a couple of weeks now and only today I found out there is a \"half mute\" option that sets the volume to half of what it was if you click it once and down to 0 if you click it twice. This is perfect for muting during the commercial breaks but not completely so you can hear when the show comes back on. I love it.", "Date": "March 15, 2013"}, {"Title": "good item", "Author": "William A Seiter", "ReviewID": "R37MFDITQLEKJR", "Overall": "4.0", "Content": "works fine i am glad we purchased it and would recommend this item to any one needing a small tv", "Date": "March 14, 2013"}, {"Title": "Toshiba", "Author": "Don Stemple", "ReviewID": "R2J28SKZ5N0QSU", "Overall": "3.0", "Content": "Shipping was great! Picture quality is blury not what I expected with the Toshiba name on it. Guess I will have to live with it.", "Date": "March 13, 2013"}, {"Title": "Great!", "Author": "Erik", "ReviewID": "R23I75LYC8WYV9", "Overall": "5.0", "Content": "Cheap and great!  Works exactly like it's supposed to.  It can also go higher than 720p, but not sure if that's a \"hidden feature\" or not.", "Date": "March 12, 2013"}, {"Title": "EXCELLENT TV NICE PICTURE AND NICE SOUND", "Author": "Clyde Crow", "ReviewID": "R2ISLIAB0AN0KC", "Overall": "5.0", "Content": "this tv has a great picture and a pretty good sound.but like others have said to get the picture brighter turn off the energy savings that all i had to do, after i did that the pricture looks nice and bright and very nice picture.the sound is very low when you first turn it on but i found a way to make it louder to acceptable nice loud sound. first turn off the audyessey abx.then turn the treble and the bass to up to 10+ you can do this in the sound settings.the only thing i dont like about this tv but most are like this anyway is that not very many a/v inputs and no s-video but it has enough a/v inputs.the hdmi is very nice to hook up a dvd/bluray player. a ps3 and xbox 360.i would highly recomend this tv its great for the price and toshiba is a very reliable brand.", "Date": "March 11, 2013"}, {"Title": "My Son", "Author": "Corinne Derenburger", "ReviewID": "R106WACAGO3J57", "Overall": "5.0", "Content": "My son LOVES this tv! It's the second TV he has had in his bedroom over the past 19 years!", "Date": "March 11, 2013"}, {"Title": "Good quality TV for the money", "Author": "Steve", "ReviewID": "R1VFULJJXOF8F", "Overall": "4.0", "Content": "I did a bit of research before choosing this Toshiba set. I chose it because of solid reviews on Consumer Reports and the cost. Don't expect this TV to blow you away but a quality option for the price and works great as a bedroom tv. Picture quality is good, sound is ok, and the design is pretty standard. The stand is bulky and takes up too much room. I would recommend this set for someone who is looking for a good value.", "Date": "March 11, 2013"}, {"Title": "bought mine at substantial savings! excellent value...", "Author": "Wesley Sowers", "ReviewID": "R3PH5O8R8ESKRR", "Overall": "4.0", "Content": "pros: easy to setup and watching in minutes. decent picture quality (i would say one step down from a good samsung), lightweight, no frills no gimmicks easy to tweak, USB media (photos and music only)almost cons: no rca style inputs (component a/v only), it seems they intentionally left out video codecs to their built-in USB media player. but HEY, 2 out of 3 aint so bad. also since this isnt a 'big screen' it isnt likely to be hooked up to large sound systems thus i feel a standard headphone output would have been helpful for those who just want smaller media speaker systems, as the onboard speakers leave something to be desired, i think they kind of over exaggerated the \"fullness\" sound as described in the product details \"richer lows\"... as compared to what? drive-through speaker? ehh, $5 adapter fixes that, in addition to better sounding speakers.in a nut-shell... im glad i got 3 of them at the price i paid. SCORE! after factoring the picture quality, and the price i paid.... i would highly recommend this set if your looking to add on to your collection of (quality) screens for different rooms of your place without going broke.... this is definitely one of the better deals at this point in time.", "Date": "March 11, 2013"}, {"Title": "Nice Picture", "Author": "Cosmos", "ReviewID": "R2RE6JZ4D37ONY", "Overall": "4.0", "Content": "The picture is good.  It is a pretty basic lcd tv  and works well in the bedroom.  Even with adjustment we have found it to be a bit dark and not as vibrant as our other tvs, but given the price point it is well worth the money.  The stand seems sturdy and well made.", "Date": "March 10, 2013"}, {"Title": "Good Value for the price", "Author": "Old Fisherman", "ReviewID": "RZ2LPUDC0TJ4N", "Overall": "4.0", "Content": "Sound seems better than many flat screens.  It seems that the margins on the side of the unit are wider than on some flat screens which might affect your choice if you have a tight space to fit withing.  The only real negative is that it seems to take a long time for the TV to  begin operating after you press the on switch.  I have been using it for abouit six weeks now and I do not regret the decision to purchase this model.", "Date": "March 10, 2013"}, {"Title": "Definite buy", "Author": "Timothy", "ReviewID": "R2R8LZOF4VJJOC", "Overall": "4.0", "Content": "Good picture, good sound quality, good price.I have two issues with this TV.The first may not be the TV's fault, but my console's system volume is absolutely ludicrous. I keep the TV at a 1 and it's still almost too loud. This does not effect using console functions like Netflix or the DVD player, and my HDMI from PC is also not affected and uses a more reasonable volume scale. This may be a cable issue, or something else entirely, I don't know.The second is that the mute button on the remote only halves the volume on first press, and mutes on second press, instead of doing the logical function of muting on first press.", "Date": "March 9, 2013"}, {"Title": "Good basic 32-inch low-res HDTV", "Author": "SoCalEnthu \"chipdesigner\"", "ReviewID": "R2E5HZZU6RH4VZ", "Overall": "5.0", "Content": "720p is good enough for most uses. Not quite as nice a picture as our LG HDTV, but certainly good enough.", "Date": "March 9, 2013"}, {"Title": "Great TV for my bedroom", "Author": "Marsha", "ReviewID": "R67K9LH8AZTVQ", "Overall": "5.0", "Content": "The picture is great! no complaints, except it take about 30 seconds from when you hit the power button on your remote for the tv to show the picture. But that's not really a big deal.", "Date": "March 8, 2013"}, {"Title": "Great", "Author": "Michael J. Romeo", "ReviewID": "R204F4XQKIKLWZ", "Overall": "5.0", "Content": "I have two of these sets in my house. great picture quality and just the right size for small rooms.", "Date": "March 7, 2013"}, {"Title": "Good tv for the price", "Author": "SAMIRAN DE", "ReviewID": "R3882X8IYWGRKZ", "Overall": "4.0", "Content": "If you are looking for a basic tv without the bells and whistles of internet tv, installed apps, etc., this is the tv to go for. Picture is great and sound is ok. But you can always enhance the sound with an external speaker system.", "Date": "March 7, 2013"}, {"Title": "great tv", "Author": "Bob A. Weikl", "ReviewID": "R3DLLEE6TQYLWK", "Overall": "4.0", "Content": "this tv is the perfect size for a bed room or den ,at a great price, lightweight and easy to use.", "Date": "March 7, 2013"}, {"Title": "Great TV with a few adjustments", "Author": "Ben C. Ives \"miladog\"", "ReviewID": "R3QKR9KYYZ4K48", "Overall": "4.0", "Content": "TV comes set up with the energy saver on.  As much as I would love to use less energy, the picture was not so great.  After making this adjustment it looked great!  Also the audio is not so good.  I have it hooked through my stereo and it sounds awesome.", "Date": "March 6, 2013"}, {"Title": "Excellent for the price", "Author": "Jun-Bo Yin", "ReviewID": "RCL8JAY029VT4", "Overall": "5.0", "Content": "Excellent HD TV for the price. Super light, can carry with 1 hand for such a big TV. I got my on special at $239.", "Date": "March 6, 2013"}, {"Title": "Excellant Value", "Author": "George", "ReviewID": "R36VCXLCI69R02", "Overall": "5.0", "Content": "Ordered on Sat and it arrived on Monday works great.  We mounted it in spare room and our guest loveit.", "Date": "March 6, 2013"}, {"Title": "Great Value for 32in", "Author": "D.Led", "ReviewID": "R2U1DRNQOGWK4A", "Overall": "5.0", "Content": "Was nervous about online buying of a TV, I've always been a BestBuy guy. But this was easy and convenient and not to mention cheaper! Thanks", "Date": "March 4, 2013"}, {"Title": "Nice Pic and Good Sound", "Author": "julie", "ReviewID": "R29JK8A0F38FGV", "Overall": "5.0", "Content": "Nice Pic and Good Sound for the money..  I wont hesitate to buy another TV for a small room and on a budget.", "Date": "March 3, 2013"}, {"Title": "VG Pictiure when light sensor is modified", "Author": "Jon   Farmington,  MO", "ReviewID": "R2B9VQ7M0OKQ3X", "Overall": "4.0", "Content": "I bought this  Toshiba 32C120U 32-Inch 720p 60Hz LCD HDTV (Black)used Amazon site as VG condition. At first, I was very upset about the brightness in my living room where the lights above are usually off day and night. No further adjustments on the brightness contrast, backlight , would give much help. That day was cloudy and little light was coming through the near window. I was going to send it back and even got a return RMA shipment tag.  Then the next day I turned on the above lights with a Lumens of 2400. Low and behold..the picture slowly got brighter and brighter where I had to actually turn down the brightness on the TV. I tend to be creative, and I thought if I could get more light into the sensor, (next to the on-off light) it should get even brighter. so I got a little flexible mirror that would re-direct the above lights directly into the sensor. After a few adjustments, again it got even brighter.  So, I wish that a company that installs the light sensor to conserve energy, allow the owner to decide about energy consumption instead of literally forcing it on the consumer. Now instead of giving it one star, it gets 4 stars. it would get 5 if the sensor was deleted. Also VG sound with 4 stars.", "Date": "March 3, 2013"}, {"Title": "works fine", "Author": "Nicholas G. Rupp", "ReviewID": "R7TDN7VW00QNL", "Overall": "5.0", "Content": "nice picture quality. i only use it for my gaming unit, but it works perfectly well for that. so far so good", "Date": "March 1, 2013"}, {"Title": "Awesome TV for the Price (no problems so far)", "Author": "TheTwoPinto", "ReviewID": "RI2I3SGDAPHR5", "Overall": "5.0", "Content": "So, I got this TV yesterday and hooked it up weary of the bad reviews, as it turns out it worked fine. I've had for a day and no problems(if there are any i will update). From some reviews it says that the brightness and sound are to low, there is a trick for the brightness to help but for me the sound was just fine and at 30 i could hear it from across my room (which is a BIG room) I would highly recommend this TV to anyone!", "Date": "March 1, 2013"}, {"Title": "Great HD picture, easy setup, perfect for bedroom at low $200s", "Author": "V", "ReviewID": "RY3VAYCRB64I0", "Overall": "5.0", "Content": "This replaced a bulky old TV in our bedroom.  One aspect of this TV I didn't know when I purchased was that it must have a built in HD antenna.  I say this because I am using a basic comcast analog box (you know those tiny 5 inch black ones) and I receive the normal channels I would expect.  However, I also have some of the network stations in an HD version and I'm not using an HD box.  I'll freely admit this is my first HDTV and I wasn't looking for HD, I just liked the price, but wow, what a difference in color and clarity on the HD channels.  As other reviewers mentioned the picture is dim out of the box, so look to those other reviews on which setting to adjust to easily fix.", "Date": "February 27, 2013"}, {"Title": "Love it!", "Author": "pam holman", "ReviewID": "R2JWSH2R7RVNLW", "Overall": "5.0", "Content": "We purchased this item for out boys' bedroom for video games and it is just awesome! Great TV, GREAT price!", "Date": "February 27, 2013"}, {"Title": "It's just ok.", "Author": "Amazon Customer \"Shells\"", "ReviewID": "R3GHNFZRNM9UKB", "Overall": "3.0", "Content": "the sound quality is pretty mediocre.  i'll end up getting a 47in or larger and mounting this in my bedroom.", "Date": "February 27, 2013"}, {"Title": "It is as expected", "Author": "Rick Eilman", "ReviewID": "R33CHZENM0LYIY", "Overall": "4.0", "Content": "I read the reviews before purchasing this TV.  I swear the way some folks got so worked up over a 32 inch TV for $230 they were expecting the Rolls Royce of TVs.  It is a great second or third TV and for your only one it provides a good HD viewing experience.  Don't expect superior sound from ANY TV without a connected sound system.  Other complaints are petty.  With any purchase of any electronic product, there is always a chance of getting a lemon off the assembly line.", "Date": "February 27, 2013"}, {"Title": "Great Value", "Author": "Bubby \"mdceg1\"", "ReviewID": "R1V465KSWL3HND", "Overall": "4.0", "Content": "Beautiful picture. Easy setup. Great TV for the money. In fact, I was somewhat skeptical of Toshiba products, but no longer.", "Date": "February 26, 2013"}, {"Title": "Better than expected", "Author": "Bluestar", "ReviewID": "R30RL4D1Y6HQBX", "Overall": "5.0", "Content": "I mounted this tv on my bedroom wall. The picture is very clear with good colors. The volume is good also.", "Date": "February 26, 2013"}, {"Title": "Great Pix!!!!!", "Author": "Linda S. Bull", "ReviewID": "R2GEMKV63VJRRX", "Overall": "5.0", "Content": "Love the pix, $$$$$$ was awesome, shipped right away and very easy to set up....could not ask for more than that!!!!!", "Date": "February 25, 2013"}, {"Title": "Toshiba 32\" TV", "Author": "Idris Cole", "ReviewID": "R2Q3I3ROPLDN27", "Overall": "4.0", "Content": "A good choice for a bedroom  Easy to set for sleep settings.  Easy to set up, arrived on time as ordered..", "Date": "February 25, 2013"}, {"Title": "Great Value", "Author": "Jack Milburn \"Satking\"", "ReviewID": "R2F8T28HUQ54EB", "Overall": "5.0", "Content": "This TV is more than I expected....its only a 720 but the cable companies only send 720 so a 1080 would be a waste.....great pix and sound", "Date": "February 24, 2013"}, {"Title": "Great Picture & Quality", "Author": "RyanMiller", "ReviewID": "R34TQKK4M15B50", "Overall": "5.0", "Content": "We bought this TV as an Christmas gift for our parents.  CNET editor reviews said its picture quality was excellent.  They were right.  Very bright and clear picture.  This is not a smart TV with all of the bells and whistles you pay for but never use really.  This is exactly why we bough the TV for our parents: Great picture, no frills, right price.  They don't want, need, or will will ever know/learn how to use the smart TV functions.  It has a simple but not a great designed remote. The TV paired easily with Directv.  I set it up in 2 minutes.  If i had a need for a basic LCD HDTV in my own home I would buy this one for myself (even though I'm a bells and whistles kinda guy).", "Date": "February 23, 2013"}, {"Title": "Great TV", "Author": "Hf", "ReviewID": "R15LMDEDV3RUDT", "Overall": "5.0", "Content": "This is my first flat-screen. The price was phenomonal. The Tv is beautiful and well made. Easy to set up.", "Date": "February 23, 2013"}, {"Title": "HDTV Awesome", "Author": "GeoP", "ReviewID": "R131D67B4TERZ1", "Overall": "5.0", "Content": "Great deal, great delivery, would recommend to my friends.What more can I say, the mfg. specs stated figures and the Picture and sound show that they are true.", "Date": "February 22, 2013"}, {"Title": "Look so nice..... brilliant colors", "Author": "Maria Cubero", "ReviewID": "R1X9J4LM9TKV20", "Overall": "5.0", "Content": "I like the Toshiba TV.  The colors are brilliant and I like the image definition.  If I have to buy a Toshiba again I do.", "Date": "February 22, 2013"}, {"Title": "hdtv", "Author": "sebastian joseph", "ReviewID": "R2SGNN2S0TFFH7", "Overall": "5.0", "Content": "i received my Toshiba HDTV an it works just fine I've been experiencing  TV in a magnificent way thank you", "Date": "February 21, 2013"}, {"Title": "Toshiba 32\" LCD  720", "Author": "dboy", "ReviewID": "R5IHKFCJ06P5C", "Overall": "4.0", "Content": "Great picture after finally figured out how to change the 480 p setting to 720 p.  This was done with the help of my satellite provider who walked me patiently through the procedure.Only negative is the sound quality.  Seems to need more bass in the sound but since it is in a bedroom not a problem.", "Date": "February 20, 2013"}, {"Title": "Amazing value", "Author": "Jeff Miller", "ReviewID": "R1SVRI1XVOZZL5", "Overall": "5.0", "Content": "Great TV for the price. Arrived in good condition and works great - clear picture and sound. Great 2nd TV for the bedroom but would work for our main TV as well", "Date": "February 19, 2013"}, {"Title": "Excellent price performance buy", "Author": "tech rater1", "ReviewID": "R17873UAK4YXOY", "Overall": "5.0", "Content": "Toshiba 720p 32C120U LCD great picture vibrant color,good black level,contrast,one of the best 32\"sets I found after comparing /viewing quite a few , some costing quite a bit more. $219 at Amazon/or best buy right now list is $349 it is a 2012 model so it's selling at good price . Excellent HD picture good contrast,black levels brightness ,detail and vibrant color.I bought this Toshiba for a second set very good picture for $228.00 at BB . The thing is good enough for a first set .I was looking for a 32\" figuring about $300+ I would recommend this to a friend it's a no brainer good buy!Other thing is Toshiba is a first tier brand not some unknown or clone brand or mutant store brand.made up of generic spare parts .I made  previously the mistake of buying a  store brand TV  it only lasted 2 1/2 yrs I won't do that again . previously I Had two Sony's and one Toshiba all of them lasted over 10 yrs.****** Most important thing with this set is to turn off energy saver setting ********** Otherwise picture will be dark no matter what.Go to preference menu/scroll down all the way to energy saver it's hidden way down below rezzsa link turn OFF auto brightness sensor set the backlight about 80~ or so in the picture menu you will have good picture !cnet gave this set a very favorable review after comparison, labratory calibration and evaluation they also published their reccomended calibration settings .head over to cnet go look Google cnet Toshiba 32C120U review also look at their recomended settings .[...]Toshiba 32C120U 32-Inch 720p 60Hz LCD HDTV (Black)", "Date": "February 17, 2013"}, {"Title": "Excellent TV for the price", "Author": "Maseca", "ReviewID": "R373ZR4QMN1F66", "Overall": "5.0", "Content": "We got this TV for our teenaged daughter's birthday, and we couldn't be more happy.  It's got great color, rich blacks, and is just the perfect size for her room.", "Date": "February 17, 2013"}, {"Title": "Toshiba HDTV", "Author": "Justin Steverson", "ReviewID": "RUWJ7R9GTOSMK", "Overall": "5.0", "Content": "I bought this TV for my girlfriend. It was the right price and she needed one for her bedroom. It didn't have to be 1080P because she just needed it to hook up the HD cable box to. Since regular broadcast HD content is only in 720P, this TV was perfect for what it was intended to be used for. Also, she watches Netflix and Hulu on it through a WiFi DVD player. It's not the top of the line HDTV, but it serves it's purpose and has a clean, crisp picture.", "Date": "February 16, 2013"}, {"Title": "great basic TV", "Author": "Pinkish", "ReviewID": "R1E15NDB715LOC", "Overall": "5.0", "Content": "I've had the 32\" TV for about 40 days and it's still working great.I needed a basic TV and that's exactly what I got.  I did, however, need to connect to 2 different cable boxes and had to figure out the connections.the 1st cable was simple and obvious.the 2nd box used an RCA, red, white, and yellow connection.the TV has a red, blue, and green component connection which I didn't want to use.instead, I had to use the RCA cable and connect the yellow RCA to the green component for the video.  I connected the red and white to the leftmost red and white outlets.one other adjustment I made was on the brightness.  I followed the suggestions posted by others.it works great.good value for the price - $220.", "Date": "February 15, 2013"}, {"Title": "Out with the old, in with the new!", "Author": "David Cleaver", "ReviewID": "R3I7SNK5VG0Z57", "Overall": "4.0", "Content": "I purchased the 32C120U for my girl friends father whose 25 inch RCA CRT gave up the ghost. Connection to AT&TUverse; was fairly easy but I couldn't figure out why only the standard definition worked but no HD.  Then it struck me, the service needed to be upgraded to HD ($10.00) per month.  When I returned a few weeks later, he had not upgraded to the HD service because  he felt that standard definition was ok!  I have to say, the colors are vibrant even in SD.  I would recommend this TV but without seeing it in HD, I could not give it a five star rating.", "Date": "February 13, 2013"}, {"Title": "Great TV for bedroom and easy to install", "Author": "Judy Knoebel \"Aunt Judy\"", "ReviewID": "R258NBDFI52H01", "Overall": "4.0", "Content": "Installed by myself in less than 30 minutesGreat picture and sound is ok for bedroom.Definite would recommend to all", "Date": "February 13, 2013"}, {"Title": "Review of Toshiba 32 inch TV", "Author": "Jinx", "ReviewID": "R33XGC0DDYEFOZ", "Overall": "3.0", "Content": "The picture needs a brightness adjustment and I can't find the right knob or button.If I could get directions to make the adjustments I would give it a 4 star rating. I have used the product several weeks and enjoy the size(in my bedroom).", "Date": "February 12, 2013"}, {"Title": "Very Impressive", "Author": "Litto", "ReviewID": "RQ8ZM0QWMXGXY", "Overall": "5.0", "Content": "My wife and I install this T.V.in our bedroom, and we were  very amaze with the outcome.Bright colors,High Definiton,excellent contrast and great sound.Perfect for that small knook we have in the wall. We mounted in the wall because the base is poorly made.I went to Lowe's ang got me a piece of aluminum bar 3x12x1/4,punch 3 1/4 holes in it and a carved 2 small groves with my grinder. Work like a charm,the T.V. rack was $45.00 I spend $12.00 in mine hardware and all.The audio output is incredible.We connected to this 100 watts speaker system and man sounds great.Arrive early in perfect conditions.We use a toshiba lit universal remote control.The one included the buttons are too small.Wife is happy and I save money.Good Karma..;)", "Date": "February 11, 2013"}, {"Title": "excellente", "Author": "Jesus Guevara", "ReviewID": "R3JPWJW72JQQS5", "Overall": "5.0", "Content": "lo recomiendo super excelente lo mejor de lo mejor! mas de 100estrellas Supeeeeeeerrrrr tv toshiba muy confiable y seguro mejor imposible", "Date": "February 11, 2013"}, {"Title": "ILOVE IT...", "Author": "nataly gomez", "ReviewID": "R30X8KVGRWB6OQ", "Overall": "5.0", "Content": "This tv is sooo beautiful, its not that heavy i am a short female and i was able to carry it by myself. It has great picture. I purchased it for my daughters bedroom and they love it. they are soo happy. Super fast shipping..", "Date": "February 7, 2013"}, {"Title": "Excellent", "Author": "Elias Livingston", "ReviewID": "R26C95VIG36XX0", "Overall": "5.0", "Content": "Wonderful tv for the price. I was honestly shocked at the quality of the tv when it arrived. I use it to play a lot of xbox 360 games and watch netflix and it does an astounding job.", "Date": "February 7, 2013"}, {"Title": "Great Basic TV/PC monitor", "Author": "D. D. Margoni \"DDM Retired 2007\"", "ReviewID": "RII415QNJYO7O", "Overall": "4.0", "Content": "I use this television primarily as a monitor for my PC.  In that capacity it works great.  I like the 32\" screen.  I occasionally watch a television show.  I usually switch back and forth which allows me to get some work done and still watch most of a sporting event.  I chose this TV in part because of CNET's high recommendation as a basic television and low price.", "Date": "February 6, 2013"}, {"Title": "More than expected", "Author": "gdimple", "ReviewID": "RP3DU8ZJZTHIK", "Overall": "5.0", "Content": "I is cheaper than a lot of TV brands, but its quality is still very good! I am very satisfied with the colors, sounds, etc.", "Date": "February 5, 2013"}, {"Title": "Speedy Delivery", "Author": "Keira", "ReviewID": "R3D3CJ8ITA6JMI", "Overall": "5.0", "Content": "Love the TV loved how fast it was delivered.  Haven't seen a special like it since!!! The only issue I'm having with it is that I have AT&T; Uverse and when my UVerse settings are on 720 or 1080 then I cannot see the guide completely.  I still haven't figured out how to rectify this issue.  Other than that, it is a great TV.  Very clear picture and the sound is decent.", "Date": "February 5, 2013"}, {"Title": "Quality TV!", "Author": "Thomas E", "ReviewID": "R30SJZJJGYFRYT", "Overall": "5.0", "Content": "Got this for our daughter in college, great picture, easy set-up and sound is also good quality! Price was best that we found.", "Date": "February 4, 2013"}, {"Title": "Not bad and reasonably priced", "Author": "Laurencia \"Eva\"", "ReviewID": "R3NR01JT7C47YW", "Overall": "4.0", "Content": "This is a nice enough TV; I had to make adjustments to the color as it was far too dark; the only thing I don't like about it that it takes forever for it to start. You turn it on and you have the feeling that it is dead, it doesn't give out any noises; after some time the name Toshiba appears and after that you still have to wait for a while for the channel to appear. Not a big thing, just unusual, that is why I gave it 4 stars.", "Date": "February 4, 2013"}, {"Title": "Toshiba TV and Wall Mount", "Author": "Jan Contreras", "ReviewID": "R3CARY9KNIO17G", "Overall": "5.0", "Content": "The Toshiba television arrived within 48 hours; it was packed securely.  Upon opening, all parts and directions were within.  I did not personally mount it on my wall, but the person who did, said the mount and television were correct and easy to install.  The television has worked well with no problems.", "Date": "February 4, 2013"}, {"Title": "Very Good Buy", "Author": "Don", "ReviewID": "R113PG1Q0KTTF6", "Overall": "5.0", "Content": "It was packed very well and was easy to assemble the stand. It also arrived within the \"Delivery Estimate\" window and has a very good picture. We really like the way you can set the screen for different formats via the \"Theatre Settings\" in the menu so that the picture covers the whole screen.", "Date": "February 3, 2013"}, {"Title": "Great Product.", "Author": "Topello", "ReviewID": "R18PBY7NNOGD1B", "Overall": "5.0", "Content": "The picture quality great and the size of the screen is just what I wanted. No glitches so far. I have enjoyed watching music videos and movies on it.", "Date": "February 3, 2013"}, {"Title": "Phenomenal", "Author": "Cody W", "ReviewID": "RHYKCK5T3WKM8", "Overall": "5.0", "Content": "Brightness was just right. Picture is crisp and does not vary when high speed action scenes are taking place. Output says 720p, but it will display up to 1080p with no issues. Completely satisfied! :D", "Date": "February 3, 2013"}, {"Title": "Great TV", "Author": "Betmatrho", "ReviewID": "R21WLH7IAV8PKE", "Overall": "5.0", "Content": "This is a wonderful TV and about the right size for a bedroom or smaller room. Great picture and audio.", "Date": "February 3, 2013"}, {"Title": "Great", "Author": "Carl L. Brasuell", "ReviewID": "R1P0QQ5RJ33QZ5", "Overall": "5.0", "Content": "The ratings were good.  The tips inthe ratings were great.  The Tv FITS JUST RIGHT. The delivery was on time.  set up was easy.  A great product for the price.", "Date": "February 3, 2013"}, {"Title": "Great TV.", "Author": "ThatOneDude", "ReviewID": "R3QR59GSURWW8R", "Overall": "5.0", "Content": "This LCD TV performs better than expected. I adjusted the power settings like other people said so the screen wouldn't be so dark. Has a lot options for a budget TV. It can get VERY bright, which is good. Picture wise its good. Not the best but way more than expected. So far it hasn't been a let down. Speaker wise its not that bad. I have my TV against a wall so that really helps by bouncing the noise off. When volume is set to 30 its more then enough loud. Again this is a great budget TV and I'm a happy customer. Now Let's see if this LCD lasts.", "Date": "February 1, 2013"}, {"Title": "Top Rate TV for the Money!", "Author": "Jerry R", "ReviewID": "R3N0KVCYVMWJA0", "Overall": "5.0", "Content": "Worked as advertised right out of the box.  Excellent picture, easy to set up and connect to my DISH satellite system.  A real bargain for what I paid for it!", "Date": "January 31, 2013"}, {"Title": "solid tv", "Author": "J. Dawson", "ReviewID": "R3OGS7CTCF2H3J", "Overall": "4.0", "Content": "picture is great.  audio is weak, but i kind of knew that going into it.  if you have it hooked up to an external audio system of some kind then it ends up all working out perfectly.", "Date": "January 31, 2013"}, {"Title": "Wonderful", "Author": "nathan", "ReviewID": "RKAY979KSOMT1", "Overall": "5.0", "Content": "An exceptional buy for the price!We have wanted a television like this for some time to use as a montior for the PC for gaming, movies, etc.For the price we paid it can't be beat. Terrific picture quality and an excellent variety of features to play around with.I would highly recomend this television to a friend or family member who was looking for the best deal possible. I searched several websites to compare price and size for our range and found that anywhere else would have charged me the same for something considerably smaller. I am very pleased to have scored this when I did.", "Date": "January 30, 2013"}, {"Title": "Love It", "Author": "David", "ReviewID": "R2I72ZIEWVUA4M", "Overall": "5.0", "Content": "No complaints great tv for the price.Use it for the bedroom and its awesome. Great picture and I have no complaints", "Date": "January 30, 2013"}, {"Title": "This TV seems to provide all the features that are required.", "Author": "MARVIN BERKOWITZ", "ReviewID": "R1N9QR5RI41QQP", "Overall": "4.0", "Content": "It does not seem to use to make a set that is smaller than this size. The smaller sizes are almost the same price.", "Date": "January 28, 2013"}, {"Title": "GREAT VALUE, TOSHIBA QUALITY", "Author": "Frank P.", "ReviewID": "R3LWH95YOP6IYT", "Overall": "5.0", "Content": "This is an excellent value it its size and class. I prefer it overall to the three Vizio flatscreens I have. I like the Toshiba company history and reputation compared to all of these newbie companies that have sprouted in recent years. I like proven companies with established track records. And for $230 from Amazon including shipping, it's a no brainer for a secondary TV.", "Date": "January 28, 2013"}, {"Title": "WOW!!!", "Author": "ljobrien", "ReviewID": "R1RYF2E4BAXLZ3", "Overall": "5.0", "Content": "What a bargain!  I am really pleased with this model Toshiba, especially with the price. This model is a 1080p not 720p as listed above.", "Date": "January 27, 2013"}, {"Title": "Perfect", "Author": "Maureen Jennings", "ReviewID": "R2FFGEALCG8ZB5", "Overall": "5.0", "Content": "works great.  Just what I ordered for our extra room.  Highly recommend  this product to others.  You will be satisfied.", "Date": "January 27, 2013"}, {"Title": "Excellent Deal", "Author": "Satinrichu", "ReviewID": "R3AT0JMT6KLJEC", "Overall": "5.0", "Content": "This is a deal of the year i woud say.. I was in need of a tv and had a budget of 230 dollars.. I went to Sony outlet for price and walmart for good deals.. I found a good deal online on amazon and ordered it immediately.. TV is working good.. One of my other friend also ordered tv same day and one more is going to order soon.. TV is loved by all....", "Date": "January 26, 2013"}, {"Title": "Made my housemate envious", "Author": "M. Carey \"word wonk\"", "ReviewID": "R2L6FGDDKSBRV3", "Overall": "5.0", "Content": "I've been using this set since 9/12 and couldn't be more pleased! My housemate has a 32\" Samsung that doesn't hold a candle to this Toshiba. Hint: when you first do the set-up, put it on \"Showroom\" mode and the picture will be vibrant and alive compared to standard mode. If mine is typical, my advice would be to buy this one! Highly recommended...", "Date": "January 24, 2013"}, {"Title": "Great deal!", "Author": "S. Clarke", "ReviewID": "R1TO6V3B2U0FJV", "Overall": "5.0", "Content": "I purchased this at $200, and it was probably one of the best deals I have found on Amazon.  I'm using it as a spare TV for my office.  I don't have it hooked up to an HD box - just the regular non-HD box, plus a Roku box.  Of course, with this box, I don't get HD channels, but with the Roku, I can see how nice this TV really is.  It doesn't have all the bells and whistles, no internet connectivity, only a couple of connections, but for $200, the picture is great.  The sound is actually quite decent for a flat screen TV, and I haven't felt the need for any type of speaker system.  Do yourself a favor, when you receive it, leave it in store mode, or at least turn off the energy saver, and your picture will be 100 times better.  The only few slight negatives are the lack of a swivel stand, so you have to turn the whole TV (no biggie), and the fact that it probably takes a good 20 seconds to turn on, which is also no big deal (as I said this is a spare TV).  Very good, budget TV, highly recommended!", "Date": "January 23, 2013"}, {"Title": "excellent value", "Author": "Joe", "ReviewID": "R26J2Z04Q0XNF9", "Overall": "5.0", "Content": "Turning off the \"energy saver\" seting resulted in a 100% better picture. Toshiba dropped the ball in not explaining the difference seen in the picture when this setting is changed. Plus they make it almost impossible to even access the setting by graying out the highlite tab for it.Seems as if Toshiba doesn't want people to make their own choices in this area but would prefer to decide for us.", "Date": "January 23, 2013"}, {"Title": "Excellent Value", "Author": "D. Watland", "ReviewID": "R2VNN8LBQKRLFL", "Overall": "5.0", "Content": "I am current using this as a monitor for my Mac Mini.  But I also attached an antenna and was delighted to have over 30 digital channels available over the air- what a bonus.  There is a need to adjust the settings as others have mentioned, but that is a small compromise for such a nice TV.", "Date": "January 23, 2013"}, {"Title": "Nice Television for the Money", "Author": "Phyllis Geinzer", "ReviewID": "RZX61B825UWZP", "Overall": "4.0", "Content": "The set up was quick and easy.  We got the picture right where we like the brightness.  It is a bit slow to come on, but that is not consequential.  This is our second TV and smaller (32\"), but is used just as much.The price was right and delivery was ahead of schedule over the holidays.  We are very pleased with this set.", "Date": "January 21, 2013"}, {"Title": "HD TV", "Author": "Don Pope", "ReviewID": "R8FINMBBYZFNS", "Overall": "5.0", "Content": "The price was 1/3rd of a local buy and it was delivered to the door in 2 days! I can now start to learn the game of football because I can actually SEE the BALL, due to 32\" screen and high definition.", "Date": "January 19, 2013"}, {"Title": "Fav Shows look 32\" Bigger!", "Author": "Bernice M. Hall", "ReviewID": "R1XCKCP6Y3263Y", "Overall": "5.0", "Content": "I was having a hard time seeing my favorite shows...especially if there were subtitles or written commentary. Perfect size for the size of the room, I can see my shows so much better and the price was amazing. Great clarity and many options for viewing.", "Date": "January 19, 2013"}, {"Title": "Excellent. A real bargain.", "Author": "philo_vance", "ReviewID": "R205KWL45IC28", "Overall": "5.0", "Content": "CNET has a very good review of this TV, as well as suggested Picture Settings based on their own calibration. I think both are right on target. Just Google: \"cnet Toshiba 32C120U\" (no quotes, of course) and you'll find it immediately. The Picture Settings are linked at the top of the second page of their review. See also the tip in the top review here on Amazon (by Mark Fellows) about turning off Auto Brightness in Preferences->Energy Saving Settings. It makes a *huge* difference. If you don't perform this step, you're likely to find the picture too dark.I just love mine. It replaced an old Olevia 27\" in my bedroom and I can't believe the difference. Bright, sharp, saturated image with great contrast and black levels, it's a pleasure to watch.The sound is OK but not great. It's good enough for me. If you're an audiophile, you may be disappointed, but it has both Digital and Analog Audio Out jacks, so you can hook it up to a sound system if you like.It has 2 HDMI inputs, so you can connect your Roku or Blu-Ray in addition to the cable box.The stand is a simple pedestal. It does not tilt, turn or pivot.If a product has more than 100 reviews and the other reviewers have mostly gotten it right, I won't usually bother to write another one. I'm so pleased with this set, that I had to add my 2 cents. For 200 bucks, I think it's an amazing bargain.", "Date": "January 18, 2013"}, {"Title": "Satisfied", "Author": "ristak2", "ReviewID": "R31C7C448450KR", "Overall": "3.0", "Content": "It's not a bad TV, especially for the price and decent brand name. But some issues are that sound isn't all that great, and it's very slow to power up and change channels. As this is my first HDTV, I thought the slow speed may be due to switching to an HDTV but recently bought a Panasonic and that TV is much faster than this Toshiba.", "Date": "January 17, 2013"}, {"Title": "Toshiba 32-inch HDTV", "Author": "wakkedup", "ReviewID": "R22P0V0JQ0QI9L", "Overall": "5.0", "Content": "So far, I haven't had any issues with my new TV.  Connects easily, works good connected to my media center PC as well as for my basic cable TV, my Apple TV, my XBox360, and anything else I've connected to it.  I like the mute function that this TV has, as it mutes the volume 50% of what I have it on the first 'mute' button press for when I just want to quiet the TV down for a time, or the second press will completely mute it for when I don't want to listen to commercials or what-have-you.", "Date": "January 16, 2013"}, {"Title": "Toshiba", "Author": "Donna Jackson", "ReviewID": "R1R66TPJ9L3B2G", "Overall": "5.0", "Content": "It is a great product.  Some of the screen can be lighter than you want.  I haven't learned how to adjust.  All in all, for the price, a great pick", "Date": "January 16, 2013"}, {"Title": "Good tv for the price", "Author": "Abeames1", "ReviewID": "R2E05UE47GFIBX", "Overall": "4.0", "Content": "I was pleasantly surprised when I purchased this tv.  It has very good picture and sound quality for the price.  The remote has oddly positioned buttons, but that's not an overly big deal.  The quality isn't as good when compared to my sony tv, but you get what you pay for and in this case you get a quality tv for a very good price.", "Date": "January 14, 2013"}, {"Title": "Far Exceeded Expectations", "Author": "Richard A. Galen \"Rich Galen\"", "ReviewID": "R1S8KUPEEMUX70", "Overall": "5.0", "Content": "I have been on the prowl for a 32\" HDTV for about a month for my office.  I checked the local Best Buy disposal aisle every weekend as well as Amazon & eBay listings.  I finally decided on this Toshiba based upon the combination of price and customer satisfaction.It arrived on time and in excellent shape.  Set up was not more than 10 minutes, including attaching the base.  The picture quality is excellent especially the anti-glare screen that means I don't have to tinker with the blinds behind my desk all day.", "Date": "January 14, 2013"}, {"Title": "Nice for the $$", "Author": "Joseph K. Velosa", "ReviewID": "RLX8H8IL2A7NB", "Overall": "4.0", "Content": "Great picture and the sound is ok.  Using an exterior sound system so not that important to me.  I wish the back lighting could be a bit brighter and I've got all the settings up pretty high but all in all, for the monies, it's nice set!", "Date": "January 14, 2013"}, {"Title": "Toshiba 32C120U 32-Inch 720p 60Hz LCD HDTV (Black)", "Author": "Counselor in the Midwest", "ReviewID": "R1V42WCE9UQS9Z", "Overall": "5.0", "Content": "I am very pleased with the picture clarity, overall quality and sound!  I would definitely purchase this model Toshiba again!", "Date": "January 14, 2013"}, {"Title": "Good value as your extra TV", "Author": "David E. Dusenbury", "ReviewID": "R2YJYLMADZ5S68", "Overall": "5.0", "Content": "Not as feature-packed or picture-perfect as some higher priced brands/models but parked in front of our basement exercise machine it's a huge winner. Shipping was prompt and set-up was super-simple though we did have to run out and buy the HDMI cable which our old basement TV didn't require. It has performed perfectly for weeks now with no glitches or adjustments of any kind.", "Date": "January 12, 2013"}, {"Title": "Finally get to love this thing", "Author": "Amazon Customer", "ReviewID": "R1DAM5B9ZOHTSV", "Overall": "4.0", "Content": "Got this particular tv because of the size screen and quality of picture especially at the price I couldn't resist. Originally thought my mother would finally be able to watch movies again and be able to see the picture. Unfortunately I had a hard time getting the picture to show up in color. Mom never got to watch it... she died before the color part was working. However, now that its working properly I can't complain a bit.", "Date": "January 12, 2013"}, {"Title": "Great TV for the money", "Author": "S. Appleton", "ReviewID": "R2V2Y4HG1I62LV", "Overall": "5.0", "Content": "This is the 2nd of this model we've purchased. We have them in ours and the spare bedroom. Once you turn off Auto brightness you can adjust the picture settings and this TV has a great picture. Not as good as the plasma in our living room but a great picture for a $199 32\" LCD.Sound is excellent for a flatscreen TV, and we have mini-HTPC's connected to each TV and they display HD and BluRay content w/o any issues.", "Date": "January 11, 2013"}, {"Title": "NICE", "Author": "dude", "ReviewID": "R2XQOP06H9LXV1", "Overall": "5.0", "Content": "I bought this to replace my computer monitor,it is great with a little tweeking crystal clear picture ,use the HDMI input and not a problem well worth the $spent", "Date": "January 11, 2013"}, {"Title": "Great Price", "Author": "Brenda McCafferty", "ReviewID": "R39D6EYG9LVAPC", "Overall": "4.0", "Content": "The t.v. was just mounted on the wall two days ago but so far everything is grea!!! The photo, sound, and quality all seem really goodl.  My only concern is the long term quality but time will tell.", "Date": "January 10, 2013"}, {"Title": "Had to get an andapter", "Author": "Cleutus Purcell \"Don Irwin\"", "ReviewID": "R1E6N0JIT6N9MD", "Overall": "3.0", "Content": "A product as new as this one should have a built in adapter which would avoid my having to use two remote controls to operate.", "Date": "January 9, 2013"}, {"Title": "Awesome picture", "Author": "Charlie", "ReviewID": "RVGQXON6F20P7", "Overall": "5.0", "Content": "I have a 40\" Samsung that I purchased two years, the picture on the Toshiba is every bit as good as the Samsung.  I had to make a few adjustments to the brightness etc, but I do that with every TV.  It has all the input and outputs that anyone can need.  Setup took about 15 minutes, including connecting our Wii, surround sound and satellite. We like it so well, that we purchased another for our son for Christmas.", "Date": "December 26, 2012"}, {"Title": "Toshiba 32\"", "Author": "debby holguin", "ReviewID": "R20GBLDXLW764J", "Overall": "5.0", "Content": "my husband christmas present.it got here in fourty eight hours and was easy to hook up to Direct TV and as they they say the rest is history . This was for our bedroom and he is happy remote and all", "Date": "December 25, 2012"}, {"Title": "Good TV", "Author": "Richard Brooks", "ReviewID": "RZSW0FB7WES2E", "Overall": "4.0", "Content": "TV is great.  For some reason my WII is only black and white and not in color and leads from WII is connected correcyly.", "Date": "December 24, 2012"}, {"Title": "Lovely PC monitor :)", "Author": "Vasil", "ReviewID": "R1EKC92Y8XO2PI", "Overall": "5.0", "Content": "So far so good. I wanted that tv for a monitor on my pc, and i love it, picture is great, and can't beat the price :)", "Date": "December 23, 2012"}, {"Title": "Just got this TV. Everything is in good order.", "Author": "uj", "ReviewID": "R9DQBA2EOHS3W", "Overall": "5.0", "Content": "I just got this TV today, two days after I had placed my order. Set up was easy and intuitive. Picture quality is satisfactory, bright, sharp, excellent contrast and image is in focus. Color is vivid, just fine. Sound is crisp and clear. So my first impression on this TV is very positive. I hope it will maintain this level of performance for several years at least.", "Date": "December 21, 2012"}, {"Title": "This TV honestly displays the transmitted images!", "Author": "C. Hintz \"Om Gate\"", "ReviewID": "R2EZLACW1OVBAT", "Overall": "4.0", "Content": "I would give it 5 stars if the TV \"lied\" by expanding and enhancing lower definition picture transmissions to make them look like what they are not - HDTV of sorts.  But then I love the honesty in this TV.  And, it picked up ALL the over-the-air Digital TV Stations in the San Francisco Metro Market - like a choice of 89 selections.  All of the real HDTV stations look GREAT.If the TV station is \"stuffing ZEROs\" into the stream to make a 960/540 picture look bigger then this TV displays the smaller \"boxed\" 960x540 (and boxes the 1024x576 EDTV that I advocated at SMPTE in Pasadena back in 1998).  and the diced up 720x408 pictures (6 different programs on one channel) look just awful expanded to full screen!  I LOVE it!  Honesty in a display!For sports, 1280x720 displays as an \"honest\" full screen picture.  This set is PERFECT for sports TV. 5 stars. But then I do NOT watch sports of any kind.  Since we only watch TV a couple of times a month for off-the-air news, this is great!All flat screens require external bookshelf speakers and a stereo or Dolby 5.1 amp so there is no disappointment with the typical flat screen internal make-do speakers.For the price, it can't be beat!", "Date": "December 17, 2012"}, {"Title": "Toshiba 32C120U 32-inch 720p LCD HDTV", "Author": "Ralph Burgess", "ReviewID": "R25C3QW3X9ZTQ6", "Overall": "4.0", "Content": "Toshiba 32C120U 32-inch 720p LCD HDTV:The right price and delivery was on time. Setup one of the LCD screen, plug it in, works great!", "Date": "December 17, 2012"}, {"Title": "Perfect Picture Quality", "Author": "shaney", "ReviewID": "RQQO3VBSHOLUK", "Overall": "5.0", "Content": "Thank you for the fast shipping and the great product. I purchased this for my son's bedroom and he uses it to watch TV and play his video games and thoroughly enjoys it.", "Date": "December 16, 2012"}, {"Title": "TV was great. Just didn't ship my remote", "Author": "Christopher", "ReviewID": "R30JEZOU8U7EKW", "Overall": "4.0", "Content": "This TV is a pretty good deal, but the TV wasn't shipped with an remote. They gave me batteries but seemed to forget the rest. The TV itself has pretty good display, and the two HDMI ports are pretty useful.", "Date": "December 14, 2012"}, {"Title": "Good product so far.", "Author": "shop for thing", "ReviewID": "R3JA9YIU26ZKNN", "Overall": "5.0", "Content": "Works good, follow the user reviews on how to make it look better.  I use hdmi pc, hdmi xbox, and colorstream component for tv since i don't get hd anyway.  All audio comes from whatever input so i got to do away with my analog audio switch.  I'm a big gamer and would prefer a 40 inch 1080p screen but that is 180 bucks more.  This is a good buy for a  mid size room, or anyone wanting to upgrade for cheap.  I'd get a samsung or toshiba 40 inch 1080p if i was willing to spend the money.  250 bucks this is a great deal.  I also praise toshiba for the color output, it's like eyecandy.  I barely see any other brands this vivid.", "Date": "December 12, 2012"}, {"Title": "no complaints", "Author": "Amanda Spillman", "ReviewID": "RB8EZN8CD9974", "Overall": "4.0", "Content": "It is a good TV for the price. It arrived promptly and was easy to set up and I do not have any complaints. I would recommend this TV.", "Date": "December 8, 2012"}, {"Title": "Great TV", "Author": "Angela Fulton", "ReviewID": "R3GMSDS2KF1KFN", "Overall": "5.0", "Content": "Great, clear picture. The sound quality is nice and overall this is a huge improvement over my last tv. It was also easy to assemble out of the box", "Date": "December 6, 2012"}, {"Title": "Great HDTV", "Author": "K. Phelps \"Desert Rat\"", "ReviewID": "R3K17C2X17YTER", "Overall": "5.0", "Content": "The people that are griping about the picture on this TV are nuts!!!  Take 10 or 15 minutes to play around with thesettings and you will get a great picture! I find the sound to be better then average too.  This is my 3rd Toshibatelevision. The other two are about 5 years old and cost much more. The picture on this TV is just as good, if not better.In fact the sound is better on this TV then the others.", "Date": "December 3, 2012"}, {"Title": "Love it", "Author": "Rebecca Lindner", "ReviewID": "R16Z2R57H0AKPT", "Overall": "5.0", "Content": "It works great. it was easy to set up . Best wedding gift my first time on amazon and not my last", "Date": "December 3, 2012"}, {"Title": "Great TV for the price", "Author": "Jim Lampariello", "ReviewID": "R12JC4IU322ST8", "Overall": "5.0", "Content": "I'm extremely happy with this TV.  The picture quality is bright and clear, comparable to more expensive TVs.  Five stars all the way.", "Date": "December 2, 2012"}, {"Title": "Good Bedroom TV", "Author": "vmcferrin", "ReviewID": "R2MYE65WQPCUM3", "Overall": "4.0", "Content": "Good clear pic.  Prior reviews informed me how to get that dynamic picture by turning off the brightness.  Sound good. Side view makes color look blurred, but overall this is a good TV.", "Date": "December 1, 2012"}, {"Title": "Good Value", "Author": "JM", "ReviewID": "R3TDD0AQKGAZZL", "Overall": "5.0", "Content": "I've been using this TV for several months now and am quite happy with it. The picture quality is good for the price. The speakers/volume are pretty good for the price also. It works well as a second tv.", "Date": "November 29, 2012"}, {"Title": "Very pleased so far, great picture, great price", "Author": "J. Copeland \"JCinLV\"", "ReviewID": "R3E16OI2B5GNBH", "Overall": "5.0", "Content": "I have only had this TV a short time so I cannot comment on it's reliability however I like most everything else about it. The price at $249 was a major selling point. We have it in the kitchen/dining and I wanted something nice that was reasonably priced at around 32\". It is hooked up to basic cable and picked up all the local HD channels without any problem. I can also use it when I have clients in and I want to show them projects that are on my computer or on the Internet. I just plug into the HDMI port on the TV and on my laptop and i get an exact duplicate of my computer screen, with sound, on the large tv screen. Also makes watching videos on your computer more enjoyable.  You can adjust the picture color and quality for each of the different inputs which is really nice.  I can also load up a flash drive with hundreds of photos and it will play through them in a slide show format with a music track if I want.Only negative I can see is that you need to be viewing pretty much straight on for a really great picture quality. I guess the sound could be better but it doesn't bother me.I recommend this TV.", "Date": "November 20, 2012"}, {"Title": "bang for the buck", "Author": "Donald V. Beckwith \"DONGOLF101\"", "ReviewID": "R3UUT828ADRBFE", "Overall": "5.0", "Content": "GREAT TV BEST BANG FOR THE BUCK, YES TURN THE AUTO BRIGHTNESS OFF MUCH BETTER PIC. I HAVE ALWAYS HAD GOOD LUCK WITH TOSHIBA, BOTH IN TV'S AND COMPUTERS. DON'T HESITATE TO BUY THEM. YOU CAN HARDLY BEAT THIS PRICE AND GET THIS QUALITY....DON", "Date": "November 13, 2012"}, {"Title": "Great HDTV", "Author": "Rez 56", "ReviewID": "R2NZYNMD3ILXO4", "Overall": "4.0", "Content": "I needed a 32\" HDTV for our workout room that didn't have to have all the bells and whistles.  The Toshiba 32C120U fits the application perfectly.  Great set for a great price and Toshiba has good quality.  Usually buy either LG or Samsung, but this set was $60-80 less than the others with great picture and sound. All in all, I am very happy.", "Date": "November 10, 2012"}, {"Title": "GREAT PRODUCT", "Author": "Reebill", "ReviewID": "R309BX6R6O7QI0", "Overall": "5.0", "Content": "great tv for kids room works well and has good sound and picture quality is sharp the only thing it does not come with a book on how to change the setting", "Date": "October 22, 2012"}, {"Title": "Great TV", "Author": "mcf343", "ReviewID": "R2M5CWLYPA3TOL", "Overall": "5.0", "Content": "Got a great deal on this TV compared to local stores.  This is a TV for my den/office and its perfect.  Good picture quality and really easy to set up for cable.  Inputs for just about everything.", "Date": "October 18, 2012"}, {"Title": "wonderful friend...e", "Author": "dave", "ReviewID": "RH7P3L7KP58B0", "Overall": "5.0", "Content": "I am in love with my new Toshiba ... i didn't even need to buy a sound bar for the volume it isso lovely. dp", "Date": "October 16, 2012"}, {"Title": "For the price, a good TV", "Author": "ann", "ReviewID": "R1TYU9IE8J0PJL", "Overall": "3.0", "Content": "I had the same problem initially as others regarding the dark picture.  Once I followed the directions to make it brighter I was pleased.", "Date": "October 12, 2012"}, {"Title": "Good inexpensive T.V.", "Author": "Dan", "ReviewID": "R1YABKZ8XIZ6BE", "Overall": "4.0", "Content": "Purchased this T.V. as in inexpensive bedroom T.V. Had it for a couple weeks now and have been very happy with it. Very impressed with how quickly Amazon delivered this T.V. Ordered it on friday and it was on my door step monday afternoon.", "Date": "October 9, 2012"}, {"Title": "Good deal", "Author": "C. E. Phillips \"Reader\"", "ReviewID": "R3NP27B6CYF4TD", "Overall": "5.0", "Content": "An excellent tv for the price. It fits wonderfully into our bedroom. Subprisingly good picture and light in weight.  Remote works well.", "Date": "October 5, 2012"}, {"Title": "WOW.. Great LCD TV", "Author": "James White", "ReviewID": "R2YF6OP0RFJ38K", "Overall": "4.0", "Content": "This is a really descent LCD TV at a fair price.Things I  like about this TV include:-  it has two HDMI inputs;-  it has a stable, easy-to-connect stand;-  easy access to A/V in and out ports;-  crisp, bright video colors.Things that could be better include:-  a higher HDMI resolution;-  a more impact-resistance cabinet.", "Date": "September 28, 2012"}, {"Title": "Good Value.  Not great sound", "Author": "Mark J. Meckler", "ReviewID": "R252EJPYT9T1VZ", "Overall": "4.0", "Content": "Installed in my home gym for workout videos.  Great picture.  Only downside is that it didn't come with an HDMI cable for connection to my video player.  Also, the sound quality is pretty low.  I use it in a small room and don't need a lot of volume, so no big deal, but if this were in a living room of decent size, I'd be worried about the sound quality.", "Date": "September 27, 2012"}, {"Title": "Great blacks!", "Author": "William G. Haver \"Lawnman\"", "ReviewID": "R2B4N794XE98N8", "Overall": "4.0", "Content": "I think the overriding complaint most have with an LCD TV is the backlight problem in blacks. This TV is great for deep blacks. And, when there is a dark part of a movie it doesn't make EVERYTHING have to go dark to keep the blacks - black!The only problem I had was an Amazon problem. I ordered the unit and within the hour of my having it in my Shopping cart the price got lower on the site BUT NOT in my cart! So, watch your item to see if the price drops BEFORE you hit Order!", "Date": "September 24, 2012"}, {"Title": "Really good but not the best", "Author": "mmmmmatt", "ReviewID": "R1NSLHGIKF05PJ", "Overall": "4.0", "Content": "It is really good for a bedroom. Great quality and size for the price that I paid for it. The only thing that I wish was better is the sound. I suggest looking into a surround sound system to go along with this tv if you are planning to buy it. Other than that I give it a 4 out of 5.", "Date": "September 23, 2012"}, {"Title": "Toshiba 32-inch 720p HDTV", "Author": "Michael D. Perdue", "ReviewID": "RS5D2D2OHOYYW", "Overall": "4.0", "Content": "I've always been well satisfied with the value of Toshiba electronics. For the price conscious,this HDTV is a good value.Great picture,intuative setup,and unbeatable price with Amazon's free shipping.Remote has a little cheap feeling,but does the job.Set takes a couple of seconds longer than my higher end TV's for \"warm up\". (picture does not immediately display on power activation.)But for under $250,for a bedroom TV,I'm more than satisfied.I'm very happy with this choice.", "Date": "September 22, 2012"}, {"Title": "Just what I wanted", "Author": "yankee", "ReviewID": "R1PTACPOIVRZO7", "Overall": "5.0", "Content": "After shopping around for a good quality television at the right price to get me through four years of college, I half-heartedly decided on the Toshiba because one of my floormates already had an identical model in good condition.  The T.V. is perfect, exactly as advertised and I have experienced no problems to date.", "Date": "September 20, 2012"}, {"Title": "Works great!", "Author": "ou lil \"DirtMonkey\"", "ReviewID": "R10GADQL0QSSN9", "Overall": "4.0", "Content": "has adjustable picture size and color, brightness, contrast, etc. also preset modes to select from. Sound is adequate, placing it near wall and or corner to reflect sound improves it.", "Date": "September 20, 2012"}, {"Title": "toshiba 32c120u", "Author": "Cassie", "ReviewID": "R3HBW5UWGU27BX", "Overall": "4.0", "Content": "Was skeptical about buying a television online but for the price I really couldn't have gotten a better product. The picture is clear and the sound is good. Hdmi works great on it and all in all is a good television.", "Date": "September 18, 2012"}, {"Title": "This is a great buy.", "Author": "grandma of 3", "ReviewID": "R2YBA1GIQTXU1X", "Overall": "5.0", "Content": "Funny how life is but one tv after another starting going out.  My husband bought a tv from Amazon 1080 LED larger than my 32-Inch Toshiba.  Honestly, my Toshiba shows better my husband also admitted it.", "Date": "September 17, 2012"}, {"Title": "Toshiba 32\"", "Author": "Pamela J. King \"PamK\"", "ReviewID": "R28VAUCEO7OBJX", "Overall": "5.0", "Content": "This Toshiba 32\" TV was a gift for my Mom.  She loves it.  The price for this TV was  the BEST part of buying it.", "Date": "September 15, 2012"}, {"Title": "Bedroom TV", "Author": "Margarette McGathey", "ReviewID": "R3W3USNMBGZB", "Overall": "5.0", "Content": "The TV arrived quickly and was well packaged. The sound and picture are both very good. If I needed another TV I would buy this Toshiba.", "Date": "September 15, 2012"}, {"Title": "Toshiba 32\" TV", "Author": "Mike1sc \"Michael D. Smith\"", "ReviewID": "R1H32OT0RYJJJU", "Overall": "5.0", "Content": "This tv was purchased due to the previous reviews that had been written and that the cost was more reasonable than any other 32\" tvs I could find at the time.  This tv is used at a football tailgating site and works exactly like it is supposed to.  Great picture and adequate volume.  No negative issues.", "Date": "September 13, 2012"}, {"Title": "Boyfriend loves it", "Author": "sara", "ReviewID": "R3D2GX7PNM81X6", "Overall": "5.0", "Content": "I got the for my boyfriend as a birthday gift. He's using it as a monitor for his computer. It seems to work perfectly and has all the right plug-ins for his tech stuff.", "Date": "September 12, 2012"}, {"Title": "Great product for the price", "Author": "Jesse K", "ReviewID": "R1ETV07GREGZ0O", "Overall": "5.0", "Content": "This is a great LCD 720p TV for price and size range.  It has an easy setup and works well in bright light conditions.  The installation on a Vesa 200 wall mount was simple and buttons are easy to access on let side.", "Date": "September 11, 2012"}, {"Title": "GREAT LCD", "Author": "ROBERT R GRAY JR", "ReviewID": "R7FKAW2AQ40GS", "Overall": "5.0", "Content": "EXCELLENT TV FOR ANY ROOM. PICTURE IS GREAT ONCE YOU ADJUST THE POWER SAVING AND AUTO BRIGHTNESS TO THR OFF POSITION. FOR THE PRICE, I DONT THINK YOU CAN FIND A BETTER DEAL. I PURCHASED THIS TV FOR MY MOTHER AND SHE LOVES IT. SHE COMMENTS ON HOW CLEAR THE PIC. IS.", "Date": "September 9, 2012"}, {"Title": "Good Tv to buy", "Author": "kami electronics", "ReviewID": "R2F948WQJP3T5S", "Overall": "5.0", "Content": "Name brand, Good product and Good looking, It has nice picture, and it works long time,and not too many defective, we love it at kamielectronics.com", "Date": "September 9, 2012"}, {"Title": "I love it", "Author": "rosie rockingchair", "ReviewID": "RLDR3SBZ8C5Y8", "Overall": "5.0", "Content": "ordered a tv on thursdat evening and it was delivered on friday love the size of my toshiba hdtv only problem was there was no screws to atach the base to the screen a trip to the hardware solved this problem", "Date": "September 7, 2012"}, {"Title": "EXACTLY as ordered!", "Author": "Gary", "ReviewID": "R3RLK5EO4XC1BZ", "Overall": "4.0", "Content": "I purchased this TV for a third bedroom my vacation  home.  It has an excellent picture for a 720 DPI TV.  Easy to navigate.  The primary use for this Toshiba is to view local TV and watch movies via ROKU. It'll be used, at most, a 10 to 15 hours a month, maybe less.  EXACTLY what I wanted.  Excellent value!While I know it didn't arrive the day I ordered it, it sure seemed like it!  Thanks for great service.", "Date": "September 7, 2012"}, {"Title": "Good 32\" TV for the price.", "Author": "Smart Suzie \"Frugal Shopper\"", "ReviewID": "R19M757RLCMRCR", "Overall": "4.0", "Content": "First TV received with broken screen.  Was replaced within a couple of days.  Good experience overall.  TV is just fine with only one annoying issue.  It is so slow going between channels. You wouldn't think it would be a big issue but it is annoying.  Color, sound, etc. are all just great.", "Date": "September 7, 2012"}, {"Title": "Great TV, especially for the price.", "Author": "Amanda H.", "ReviewID": "R35QA682O217J8", "Overall": "5.0", "Content": "When Father's Day came around this year I knew that I wanted a TV for my husband. He always gets the short straw when it comes to the TV (with three kids it's just the way it goes!) I saw this model at Sears and loved the picture. I checked it out here on Amazon and was thrilled to see that it had wonderful reviews and was MUCH less expensive. I ordered it right away and my husband loves it!", "Date": "September 4, 2012"}, {"Title": "Good picture, no written help", "Author": "behags", "ReviewID": "R278IH6FVK5T69", "Overall": "4.0", "Content": "Had the television up and running in less than 15 minutes. Found the screen adjustments easy enough and made a few changes to create a better picture. Problems hooking up the WII -- the set comes with no printed manual, so we had to go online and search for help from user forums. Had a hard time even finding a pdf of an owner's manual online. Being used in a bedroom -- should be fine for this purpose.", "Date": "September 2, 2012"}, {"Title": "Great purchase!", "Author": "Deborah Tucker", "ReviewID": "R2MLYOGSYHNYPG", "Overall": "5.0", "Content": "I purchased this Toshiba 32\" for my downstairs apartment, my tenant is very happy with it.  The picture is clear, the price was right, and Amazon service is the best.", "Date": "August 26, 2012"}, {"Title": "Excellent Purchase", "Author": "RobertVM", "ReviewID": "R3VIKYU8FE8WRL", "Overall": "5.0", "Content": "Purchased this flat screen for a bedroom.  Nice picture, nice sound.Had already seen the TV at a box store, and it had beautiful clarity and great sound.I received it quickly from Amazon, and only have positive comments to share.  My other two flat panels are Samsung (which I also highly rate).  This particular TV is upstairs, so I have it connected to a RCA Antenna (no cable set top box in this room) - and that set up works great in my area (north Jersey) receiving about 20 clear, English channels.Bottom line:  It's a TV that works perfectly.", "Date": "August 24, 2012"}, {"Title": "Toshiba TV", "Author": "B. Webb", "ReviewID": "R39DG8H0QKQI3K", "Overall": "5.0", "Content": "I purchased the Toshiba to replace my old TV. I really love this TV it is like almost being in a movie theater with the big screen. I am very happy with this purchase.", "Date": "August 6, 2012"}, {"Title": "Excellent TV ecspecially for the price!", "Author": "W. Shaw \"WS\"", "ReviewID": "R1FQQFAX2NJCMO", "Overall": "5.0", "Content": "I wasn't sure what to expect for the price of this unit. I was more than pleasantly surprised by the picture quality and sound. Very good TV!", "Date": "August 1, 2012"}, {"Title": "Nice TV for a bedroom!", "Author": "apsucheme09", "ReviewID": "R2X6LSMJSES7E", "Overall": "5.0", "Content": "Bought this TV as a gift for my mom who needed a new TV in her bedroom.  I did fix the sound based on the previous reviews and now it works perfectly! Definitely worth the money.", "Date": "July 27, 2012"}, {"Title": "Fits the need in my garage", "Author": "John Bender", "ReviewID": "R2GRFD1Y0TJBLZ", "Overall": "5.0", "Content": "Very happy with this model.  Its hardy enough to be set up im my garage workshop and I really like the sound and high definition display.  It seems to pick up 1080i, but not 1080p, when it is classed as a 720p.  All good with ease of use and for the price as good as you can expect.", "Date": "July 23, 2012"}, {"Title": "Great TV for the Price", "Author": "Angela", "ReviewID": "R2GDE97NIFGILN", "Overall": "5.0", "Content": "Bought this for my son's bedroom and we are very pleased with the picture and sound quality.  I followed the directions posted by another reviewer on how to turn off the energy saver and that made a big difference.  Even games look great, though extreme gamers may want to go with an 1080p.  Would highly recommend this for the amazing price.", "Date": "July 22, 2012"}, {"Title": "We bought this TV as a gift and they lve it.", "Author": "Pablo242", "ReviewID": "R27NFQYP48BXYC", "Overall": "5.0", "Content": "We bought this TV as a gift and they love it. Great price, great product. This is our second LCD from Amazon and I know I will be getting another one from them soon.", "Date": "July 2, 2012"}, {"Title": "Great TV!! Looks and sounds better than others at it's size!", "Author": "mick", "ReviewID": "R34C2KQS8X7I4V", "Overall": "5.0", "Content": "Great for a bedroom TV.  DVDs look and sound great.  Would recommend to anyone looking for a great tv for a great price!!!", "Date": "July 1, 2012"}, {"Title": "Poor picture compared to Samsung", "Author": "I. Novick", "ReviewID": "R1QGJXS1CNGKV0", "Overall": "1.0", "Content": "Ordered this TV because of the low price and favorable reviews of its picture quality.  The picture was in fact washed out, dim, with poor colors.  No adjustment I could make made any difference.  The viewing angle is extremely narrow and the picture deteriorated even further with the slightest off center angle.  Would suggest the Samsung UN32EH5000 which is $120 more, but has a great picture right out of the box.", "Date": "December 5, 2012"}, {"Title": "Nice TV, speakers died in weeks", "Author": "John Thomas", "ReviewID": "R2UZ3T782K4W9T", "Overall": "2.0", "Content": "I did a lot of Amazon research on a smaller tv for my weight room.  This had really good reviews so I bought it.  Hardly used it, and a few weeks in the speakers just stopped working.  Not the kind of hassle I need.  The picture is good, but my concerns about overall quality would make me not recommend this.", "Date": "September 25, 2013"}, {"Title": "Got this for my sister to replace her old 32\", 4:3, CRT Sony", "Author": "Coi Laman", "ReviewID": "RZ2PO8X1SQNFY", "Overall": "5.0", "Content": "A great TV, a great value for the money and has some unexpectedly powerful sound out of its tiny speakers. However, my sister will be using her Philips CSS2123B/F7 'soundbar with the subwoofer' system to take care of the audio duties for this TV. Philips is a killer system and a way better audio device than any built-in TV speaker by a far margin and for so little money to boot. I got the Philips soundbar system for $89 on sale last Christmas, but not here on Amazon.Now, let's talk about this Toshiba. The Toshiba really shines in the picture quality department, but you must turn off that dreadful 'Energy Saving' thing in the 'Preferences' because it dims the picture way too much. Picture tweaking over several days with different program material will further improve the picture quality and you can really tune the picture of this TV to your personal taste. The only caveat is that you only have one custom preset on this TV so you will be a bit challenged to find a happy medium for all your devices connected to it, but it is doable and my sister loves the picture from all sources.Also, if you are not buying any external speakers, make sure you are getting the best possible sound out of its built-in speakers because that is definitely possible. Go into the TV's AUDIO settings and change the default setting from 'Dolby Digital to 'PCM'. The 'PCM' setting will give you the clear, dynamic and uncompressed stereo audio from your TV's speakers and the sound will be much improved over the default 'Dolby Digital' setting. Just remember that Dolby Digital is always compressed and that's why PCM mode sounds better with those tiny TV speakers. Enjoy your TV everybody!", "Date": "June 3, 2013"}, {"Title": "Great bang for buck", "Author": "Kevin", "ReviewID": "RBRBQ82XXJT65", "Overall": "4.0", "Content": "Got this TV as a gift, it works better than i expect it. There is some color blurring when images with lots of contrast is shown- however , the picture is clear in most situations. I was impressed with the viewing angle and the sound isn't as bad as some have stated. We watched this TV in a small studio apartment- so that may be the reason why we don't have a complaint with the speakers. This is a great TV for the price.Only problem was with shipping with amazon. They sent the gift to two different INCORRECT places before it finally arrived at my friend's apartment. I probably wouldn't use them time sensitive purchases.", "Date": "February 25, 2013"}, {"Title": "nope", "Author": "Susan Herring", "ReviewID": "R1J84LQVSINOKW", "Overall": "1.0", "Content": "I needed tv for bedroom. Toshiba usually pretty good. This tv is awful!!!! U have to set right in front so there is no distortion in picture and color. Sound sucks. First Negative review i have written. I usually take my time checking out history on itemsbefore I order and this was screwup!", "Date": "January 16, 2013"}, {"Title": "Warning for Rabbit Air owners", "Author": "dan r", "ReviewID": "R90T7VP75D5HN", "Overall": "3.0", "Content": "The TV was OK.  It seems comparable to any other budget 32\" flatscreen TV.  The biggest flaw, for me, was that the remote would operate my Rabbit Air MinusA2 (model SPA-700A covers 700 sq. ft.) Ultra-Quiet Air Purifier - Stylish, Efficient and Energy Star® Certified, Wall-Mountable!, White, Pet Allegy whenever I used the number buttons or the up/down navigation buttons.  It would turn on/off, change the speed, change the mood light, make it make sounds, etc.  It was meant to be a bedroom TV and that's where the air purifier lives.  I tried covering the IR sensor with a piece of tape, but it turns out the IR sensor was used as an ambient light sensor, which means that if the purifier was in \"automatic\" mode, which is where I keep it most of the time, it would shut off within 5 minutes of covering the sensor, which is what you want if you're trying to sleep.The second major flaw (for me) was that after putting it up my wife reallllly wanted it to be as close to the wall as possible, but the cable connections are on the back, oriented towards the wall, so right angle adapters would need to be bought (not available locally), and it would still be very awkward.Instead I bought a VIZIO E321VT 32-Inch 720p 60Hz LED-Lit TV for the same price ($250) locally, which doesn't have a remote that makes my air purifier go crazy and has the connections facing downwards and to the side, which makes it easier to mount flush to the wall.  I've been happy with it so far.", "Date": "January 5, 2013"}, {"Title": "This is a 3 to 3.5 stars TV", "Author": "compiler", "ReviewID": "R21NWEUFDXDFVO", "Overall": "3.0", "Content": "I got this TV with $50 rebate at $229.99 on black Friday.  The TV has sensor to automatically adjust the bright. You need to turn off the Energy Saving to adjust the picture. It can help you to adjust the picture better. After that you can turn on the Energy Saving again; otherwise, the TV will probably be too bright. Here is the possible picture setting. If you still do not like the TV picture, you may go for the different TV. The Contrast 80; Backlight 100; DynaLight On; Brightness 60; Color 70; Tint 0 and Sharpness 15. I give this TV rating 3 or 3.5. There is a different one, JVC JLC32BC3002 32 inch TV at $199.00 on sale or $228.00 at regular price from the Wal-Mart that is much better than this one.", "Date": "December 13, 2012"}, {"Title": "This tv is okay.", "Author": "F. Archie", "ReviewID": "R34XEZ02YY9KXO", "Overall": "3.0", "Content": "This is not the best tv I ever saw.  The picture is okay the sound is okay and the look is okay.  This tv attracts a lot of dust.  The tv does not have enough plugs in the back and I had read a review to learn how to hook up my dvd player to this tv.  I wish this tv had a red, white, and yellow cord pack in the back but it does not.  I was a little disappointed.", "Date": "September 3, 2012"}, {"Title": "Toshiba 32-Inch 720p LCD HDTV (Black)", "Author": "Hockey puck Display", "ReviewID": "RAT795239CRMH", "Overall": "4.0", "Content": "Excellent Product.  If you are looking for great plug and use TV for bedroom or kids room this is it. Not to mention that the price is unbeatable.", "Date": "August 9, 2012"}, {"Title": "TV Review", "Author": "Smart-Shopper", "ReviewID": "R2WNGXOUYETYHY", "Overall": "4.0", "Content": "This is an excellent product. Nice picture with good features. I prefer more than two HDMI port.However, having a USB port componsates for few HDMI ports.", "Date": "August 6, 2012"}, {"Title": "Awesome TV", "Author": "Jeanette", "ReviewID": "RW8P3LJTVQ8WV", "Overall": "5.0", "Content": "First let me say that I only had the TV for one day. The Setup as so easy.I quickly attached my Dish network receiver with a HDMI cable and it looks fantastic. Sound is great. I actually thought it be a bit smaller but its bigger than I thought. Its bright because I put it on Retail instead of home which uses more energy.", "Date": "June 14, 2012"}, {"Title": "nothing special here", "Author": "bill moss \"bill moss\"", "ReviewID": "RXN7IW0YC3DBI", "Overall": "3.0", "Content": "i paid $279 for this in march 2012 at a national tv electronics store.  i wanted hdmi and a pc input and i got what i paid for.  i will let others comment about audio and picture quality because i want you to know two things about this tv that are unexpected..  first, it is slow to turn on, slow to change channels, i mean sloooow, a long delay, especially changing between channels..  second, i hate the remote control.. its the shape of a thin candy bar and not ergonomic..  its flat, square ends do not distinguish the front or back, so i typically grab it backwards in the dark and press the wrong buttons... also, pressing the mute button does not mute the tv.  the first press renders half volume and the second press finally mutes the tv.  the pic size change button is within a hair of the on-off button so i turn on the tv each time to a reduced picture size.  i will eventually buy a different brand remote and throw this idiot stick of a remote away.  if i had known about these two things i would have bought a different brand.", "Date": "March 30, 2012"}, {"Title": "awesome lcd", "Author": "miguel urdaneta \"serviexpress,c.a\"", "ReviewID": "R2RRIO0DTQ8878", "Overall": "5.0", "Content": "great price, exced my expectetion *vergatario%, fron all the main brands these is the best deal,nice picture and great performance as a pc monitor", "Date": "June 1, 2012"}, {"Title": "Very poor picture quality", "Author": "graceful", "ReviewID": "R2TSEBOZP6GU80", "Overall": "1.0", "Content": "I am very dissapointed in the picture quality.Go with a different model, probably 1080p.Not worth the money.First unit arrived with three dead pixels and had to return.", "Date": "August 20, 2012"}, {"Title": "Television failed after (2) Months", "Author": "Wentworth", "ReviewID": "R2LVL8XPZAA6C5", "Overall": "1.0", "Content": "The reason i am rating this TV so low is that, from the time i bought it to this date April -13-13, the unit has completely failed, does not switch on at all, Is there some way i can get a reinbursment, Hope to get a reply ASAP, Thank", "Date": "April 13, 2013"}, {"Title": "terrible", "Author": "Hakeem Sylver", "ReviewID": "R1N3P8BKN10LU2", "Overall": "1.0", "Content": "picture was cloudy must have been a refurbished model  but i was not informed of such at time of purchase  i have since returned the tv", "Date": "March 14, 2013"}, {"Title": "Video Okay - Audio is \"tinny\"  Need to augment with surround sound system.", "Author": "Michael Spindler", "ReviewID": "R3054KWR2IA944", "Overall": "3.0", "Content": "Video Okay - Audio is \"tinny\"  Need to augment with surround sound system to get a better range of audio.  In short, the internal speakers are lacking.But a great buy for the money.", "Date": "February 23, 2013"}, {"Title": "It's Okay.", "Author": "David Wirch", "ReviewID": "R3MFABKPZI695D", "Overall": "3.0", "Content": "This television does not produce a vivid picture, and things seem distorted at the bottom of the screen.  Probablywould not another Toshiba product.", "Date": "February 1, 2013"}, {"Title": "A little disappointed", "Author": "Leroy P. Davis", "ReviewID": "R21B769C5IF0HD", "Overall": "3.0", "Content": "Tunner is very slow. Have not been able to edit channels from selection,tried the tech line and waiting. For the price I guess it's ok", "Date": "December 29, 2012"}, {"Title": "Toshiba TV", "Author": "Jimmie L. Vetor", "ReviewID": "R3F0HKNIPGS4BP", "Overall": "5.0", "Content": "I really like this little TV. For the price it is well equipped with the needed connectors. The picture is good but like most TV's the Audio isn't what I would like. Oh, I'm hard of hearing so maybe it isn't the TV:) All kidding aside it is worth the money and an easy purchase and fast delivery.", "Date": "October 27, 2012"}, {"Title": "Good Bargain", "Author": "Hunter Bob", "ReviewID": "R17CTOXR2QPRC4", "Overall": "4.0", "Content": "Good TV for the money.  The only thing I can see that might be a con is how long it takes to start up and that's not a big thing.  Good bedroom TV.", "Date": "October 7, 2012"}, {"Title": "Great tv", "Author": "C. Palmer", "ReviewID": "R3IA19AMP3AXZ7", "Overall": "5.0", "Content": "I purchased this tv for my spare bedroom which my grandchildren use for a playroom when they visit.  This tv is perfect, great picture and sound is good.  Works perfectly and now my husband or son go in there to watch something if they don't like what is on the big tv in the family room.  Excellent purchase for a great tv for the price.", "Date": "August 6, 2012"}, {"Title": "great Tv", "Author": "reana", "ReviewID": "R2EWW51N48FH1W", "Overall": "5.0", "Content": "perfect pcture and great sound , very much worth the money, easy set up as well,,will buy again when the den is finished", "Date": "July 31, 2012"}, {"Title": "remote does not work", "Author": "nancy orman", "ReviewID": "R2SZMDSZJRJP99", "Overall": "1.0", "Content": "TV is great and picture is good, but the remote does not work most of the time! Weird! Works off and on and we cannot figure out the problem. Batteries are fine!", "Date": "August 28, 2012"}, {"Title": "Good tv for the money", "Author": "Armand", "ReviewID": "R1CH3ZRE0OOU2K", "Overall": "4.0", "Content": "We have the moniter hooked up to a computer to track our drivers and it looks great it was a easy hook up andgood color. Well worth the money.", "Date": "June 18, 2012"}, {"Title": "Good price but miss some features", "Author": "Mary \"Mary\"", "ReviewID": "R2UVT9QHB6HJYH", "Overall": "3.0", "Content": "Item was as described, good price and delivered on time.  Unfortunately, I assumed you could connect a DVD player to this television...WRONG!  Very disappointing so I gave it a three star.  Everything else as expected.", "Date": "October 4, 2012"}, {"Title": "Had expected something better....", "Author": "Don J. Norwood", "ReviewID": "R19IKFC2KSEVH9", "Overall": "2.0", "Content": "What otherwise looked like a good 32\" LCD set was disappointing.  The picture brightness and contrast was very sub par and would work only in a completely darkened room.  This unit was to replace an old 27\" Hitachi CRT in a reading room but the picture quality was not adequate; in fact the Hitachi was still better.  Several months ago I purchased a 32\" Haier LCD from Amazon for a bedroom that has been a stellar performer.  I returned the Toshiba and the Haier has since replaced the Hitachi.  I had expected a better experience with Toshiba, especially after reading positive reviews.  Maybe the problem was my individual copy, but I didn't want to go to the effort to find out.", "Date": "August 16, 2012"}, {"Title": "just a tv", "Author": "jersey girl", "ReviewID": "R3PKJM7HI8KZ47", "Overall": "1.0", "Content": "this is really bad quality tv. had to return it.screen was too dark even after adjusting, and speakers are not good.", "Date": "November 10, 2012"}, {"Title": "Great TV  With New  Indoor Antenna", "Author": "T. Bardsley", "ReviewID": "R1IM8E9AFLXT1Y", "Overall": "4.0", "Content": "Now that I have installed  and  rescanned  channels with new indoor antenna from AmazonIndoor Amplified Uhf/vhf/fm/hd the picture and channel pick up is great!  Now waiting  for  HDMI cable to see I can hook up  my DVD player.  I can't with the  color coded  cord.", "Date": "March 21, 2012"}, {"Title": "Good for the bedroom", "Author": "schmrob", "ReviewID": "R1KVIORDTSGQZF", "Overall": "4.0", "Content": "The product is the right size for the bedroom T.V. I am sure it is good in other rooms but I like it in the bedroom.", "Date": "August 22, 2012"}, {"Title": "The shade Black is brighter then this Screen!!", "Author": "Marlock", "ReviewID": "R3D9QI4Z4435CD", "Overall": "1.0", "Content": "Some comments have said the T.V is good, but a little dark when it is on. This is a LIE! It is a bad T.V. with a black screen with a little light when it is on. Who would create such a T.V.!? Some comment have said turn up the back-light and the brightness. This is like having a pocket flash light in a dark room and then upgrading to a normal flashlight. Sure you will see something when the pocket flashlight is on and even more then you have a normal flashlight, but in the end it is not the proper light for the room. This is not the proper T.V. for a House, Home, Apartment, or anything else under the sun.", "Date": "January 22, 2013"}, {"Title": "Will choose another brand next", "Author": "pd", "ReviewID": "RMNHJMDAO08PK", "Overall": "3.0", "Content": "A little dissapointed in this TV. Doesn't even have a good basic manual.  Have to go online.  Limited features i.e programming favorite channels. Brightness is just not what I expected.", "Date": "October 17, 2012"}, {"Title": "Toshiba 32C120U 32-Inch 720p 60Hz LCD HDTV", "Author": "Caropanther", "ReviewID": "R3LSOZDTN44TEQ", "Overall": "2.0", "Content": "I purchased this with the hopes that at a lower price, I would find a bedroom TV that matched the Panasonic TC-L32X2 32-Inch 720p LCD HDTV with iPod Dock I bought 2 years.  Wrong.  It does not have near the picture quality of the Panny.  It came with the settings too bright and I have yet to find a good match of settings adjustments to give me the picture of the Panny.  I should have spent a little more and gone with the sure thing.", "Date": "August 17, 2012"}, {"Title": "Toshiba 32 Inch", "Author": "Jay", "ReviewID": "R34DTE9H5NE5K8", "Overall": "4.0", "Content": "Good Picture quality. Enough sound for bedroom. Very lightweight and easy to set up. Great deal for the price. I would defy recommend this product.", "Date": "June 19, 2012"}, {"Title": "Nice picture", "Author": "David Elizondo", "ReviewID": "R11248ZHD6GBJN", "Overall": "1.0", "Content": "I am in Afghanistan right now. Wow, this is like an IMAX for the field. TV is hard to come by so this TV is the \"bomb\" without the kaboom!!!", "Date": "January 28, 2013"}, {"Title": "Never buy big ticket item on-line", "Author": "georgeoka", "ReviewID": "RMIO2XOZVWG80", "Overall": "1.0", "Content": "need to be fixed.  Pixels, the picture quality is no good.  I will never buy big items on-line.Repair is taking to long.", "Date": "December 21, 2012"}, {"Title": "A disappointing experience", "Author": "Peter Pompey", "ReviewID": "R2GJ2387P5ERJG", "Overall": "1.0", "Content": "Very disappointed with the picture quality. If it were possible in any way to make an adjustment It was not ready right out of the box! Thumbs down!!", "Date": "December 16, 2012"}, {"Title": "Dead on Arrival", "Author": "G. Ng", "ReviewID": "R87PG0AJ0URUY", "Overall": "1.0", "Content": "The television was pretty much a brick right out of the box. I turned it on and got to see a glimpse of the initial setup screen before the picture died and never came back. I called tech support and after wading through the awful automated system and being put on hold, I was told that a critical component of the television was \"having issues.\"I expect DoA items from lesser brands, but am a bit shocked one came out of Toshiba.Such a disappointment.", "Date": "May 2, 2012"}, {"Title": "Screen was cracked and busted through the entire Television", "Author": "RayneNB", "ReviewID": "R1MCT8QAMUV5AI", "Overall": "1.0", "Content": "Television was busted througout the entire screen no picture or sound- The TV arrive in which appeared to be suitable packaging so I dont know how the monitor was so cracked and distorted.", "Date": "September 22, 2012"}, {"Title": "NO idea WTF happen", "Author": "WC", "ReviewID": "R3RQH6VPMMZA2Q", "Overall": "1.0", "Content": "The pictures just sucks,  I adjusted and adjusted and compared to the Samsung I bought also 720P  it just a horrible TV.  I tried everything it just bad.  No more TOshiba for me.  But I saw great reviews.  what happen is beyond me.Also I hated the EXTRA large border.  its 32 but the border makes it seem like a 28", "Date": "January 21, 2013"}, {"Title": "It's still wrapped up.", "Author": "Tracey", "ReviewID": "R1RL573EFXOOMV", "Overall": "4.0", "Content": "I just wanted to say thank you for the very timely delivery of my product. It was still on my porch when I got home too. I can not wait for it to be open on Christmas. It took me awhile to decide on what type of LCD to buy and I hope it's a winner.", "Date": "December 23, 2012"}, {"Title": "Run or Run Faster!!!", "Author": "Rick in Atlanta", "ReviewID": "R330RE6Y71WWPN", "Overall": "1.0", "Content": "Run or run faster, FROM this TV. I ordered this TV and had this unrealistic expectation that it would operate when I took it out of the box. It did NOT. The remote initially could not turn on the TV, and when it did, it would sporadically bring up the screens to set up the TV. When set up screens did come up, some times it would time 3 or 5 minutes for the TV to respond. After about an hour of the TV not responding to set up efforts, I contacted Toshiba Custormer Service. After 30 minutes on the phone with the Customer Service Rep, he wasn't sure it was the remote or TV. After trying the batteries that came with the remote and my own new batteries, the problems did not go away. He suggested ME not him, going online to order a new remote that would take about 5 days to get, and if that didn't work, a tech would come to my home. When I talked with the Customer Service Supervisor in Asia, he suggested I go online to order a new remote that would take 4 or 5 days to get. I asked why I couldn't go to a local dealer to get a remote and that wasn't an option. When I asked why Customer Service could not go online and order the remote for me. According to him, that wasn't an option. I told him his options were NOT an option for me. Toshiba in the future is NOT a selection for me. Now you know why I say run or run faster from this TV.The best part about this experience is how well Amazon handled the process of me returning the TV. I ended up buying a Philips 32\" TV that was a breeze to set up and operate.", "Date": "July 18, 2012"}, {"Title": "Value TV", "Author": "LSR \"Don\" \"DPM\"", "ReviewID": "R33T46WCWO42Q6", "Overall": "3.0", "Content": "Pros:Good pictureGreat Sound (best out of every tv I have ever owned)Cons:Could the channels change any slower?!?  I did not think it was possible for a tv to change channels this slow.  The only thing that makes up for it is that when you hold down the up or down for channel it stays on your channel until you let go.  This way to can watch something while moving up or down.  Only use this at night when lights are off and I cannot see the numbers so this is how I flip between stations.", "Date": "June 30, 2012"}, {"Title": "A TV without a yellow video input", "Author": "Akile", "ReviewID": "R1ZWCNYAX2CS4V", "Overall": "3.0", "Content": "I saw this TV at a price that I thought was a steal of a deal, but low and behold, when my TV arrived and i tried connecting it to my directv box i realized that there was no input jack for video (i.e the yellow jack that are on most video equipment). How could a manufacturer like Toshiba omit such an essential jack?I then purchased a component video cable as per the installation guide and to my surprise still no picture. With an onscreen caption which read, \" NO VIDEO SIGNAL \".I then had to use the much dreaded antenna input to view directv. Also my DVD player which was purchased in 2006 is unable to work with this TV as there are no HDMI, DVI output on said player. So i now have to purchase a Blu ray player to view my many DVD movies.Don,t buy this TV!!!!!!!!!!!I will cost more in the long run.--------------------------------------------------------------------------------------------------UPDATE:I have since found the video input jack and upgraded to blu ray and it shows pretty well. the sound is loud enough(you wont need additional speakers to enjoy your movies. unless you want to hear that cinema quality sound)The remote looks and feels cheap. i don't use it at allThe picture quality is 720 p and to me it shows pretty well given that fact...All in all i now give it 3 stars... up from 2 I hope that i helped in some way", "Date": "July 19, 2012"}, {"Title": "Broken Screen LCD", "Author": "Sas", "ReviewID": "R2083ZAN4NEGCV", "Overall": "3.0", "Content": "my revieuw is that please when shipped a things so FRAGILE please put manny thanks to protect it especialy the face (LCD) because the one i bought on you site finaly arrive to me Screen Brokenand am verry despointed by this the LCD wasn't Protect by nothing", "Date": "July 23, 2012"}, {"Title": "Never Again", "Author": "firesign \"stones\"", "ReviewID": "R2BW7MIQ1K2BRH", "Overall": "1.0", "Content": "I have my new 32\" Toshiba boxed up and ready to send back to Amazon.  I spent the entire afternoon on the phone with Dish Network and Toshiba trying to find a way to hook up to my Dish satellite.  Neither Dish nor Tosh could help me.  We went through every process the reps could think of with no results.  My head hurts from talking on the phone for so long.  What a huge disappointment.  I would advice that if you have Dish call them before you buy this tv and ask if you can hook up to Dish with your tv.  I was able to.APaceFlorida", "Date": "August 8, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "TV without stand (Width x Height x Depth): 31.2'' x 19.8'' x 3.5'', TV with stand (Width x Height x Depth): 31.2'' x 21.8'' x 9.6''\nTOSHIBA 32\" 720P/60HZ LCD\n1-Year Parts & Labor Warranty\n14W Speakers", "Name": "Toshiba 32C120U 32-Inch 720p 60Hz LCD HDTV (Black) (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/41q9kKNWVFL._SY300_.jpg", "ProductID": "B0073K645A"}}