{"Reviews": [{"Title": "Great Picture, but...", "Author": "VanDoos", "ReviewID": "R2JT33FVG501C1", "Overall": "3.0", "Content": "I've had the TV for a month now and I can't get over how great the picture quality is, both in 3D and 2D. Gesture control and Voice Control takes some time to get used to...it's not as sensitive as the Wii or like-devices. Other than the bells and whistles that you're basically paying for, there is one major drawback that I'm having a heck of a time fixing/figuring out (because Samsung customer support is convinced it's user-error; which it could very well be...but as a warning to others please read on): major networking issues.I have it hooked up to my home network and all seems great in terms of playing vides/music/pictures via router, however, the TV's firmware wants to constantly update and stay connected, thus it automatically shuts off randomly and turns back on; no matter what input you have the TV on. A major annoyance. I unhooked it from my home network and all is fine now, just sucks that I can't enjoy one of the major reasons why I bought the TV. So be warned if you're buying this TV for not just the great picture but for the versatility of using it as an extension to your home network.", "Date": "April 30, 2012"}, {"Title": "This TV has it all and looks stunning", "Author": "J. Wilson", "ReviewID": "R27LGQ18XXMRSB", "Overall": "5.0", "Content": "I love this product!!!  Samsung has slammed it totally out of the park with the ES7500.... I think the picture quality is stellar, I don't see any of the bleeding/cloudyness etc that I hear people complain about.  I did need to tweak the judder and blur reduction settings so movies didn't lose their depth of field, but overall this TV is amazing... I would highly recommend this to anyone!  When I was at the store I looked at the ES8000 also, but honestly I couldn't see a difference in PQ... I guess the 8000 has micro uber dimming or something, but to me the 7500 has it all anyways, so I'm stoked....Voice control is awesome, touch remote takes some getting used to, but is very cool, and the TV is sooo sexy...  I'll try to take a picture or two and upload them for others to see...Only bad note, the gesture control doesn't really work (but I didn't care about that feature)....oh that the whole thing with Amazon VOD still stinks, but hey I think this is the best TV you can buy for under $3000....3/23 Update.... I've added a photo for you to see... Its not the best, but I can you that unless you have the brightness blown out on the screen, there is no bleeding from the corners, which is the complaint I read about all the time.... maybe other folks like it brighter than me, but whatever, its an awesome screen!3/25 Update.... Watched Tron 3d (or part of it).... WOW!!! The 3D on the Tv is as good or better than cinema 3d....  I only watched 20 minutes or so, but I did not feel eye strain setting in... in fact over time it felt like I was just watching my tv normally, like the 3d was supposed to be there all the time.  On a sad note, I had to turn off the voice control, because the tv was taking commands from its own programming... :)  it almost turned itself off while I was watching Amazing Race for some reason.... got all the way to the final \"OK\" before I scrambled for the remote and canceled.... maybe that needs some work still...but the picture quality is shockingly good.", "Date": "March 21, 2012"}, {"Title": "TRULY AWSOME TV!!", "Author": "S. Teal \"tech addict\"", "ReviewID": "R172YJWMVTVU17", "Overall": "5.0", "Content": "i have owned this tv for 1 and 1/2 weeks now and i have to say i love it. the picture quality is unbelievable. i replaced a toshiba 52 inch 4 thousand dollar tv, which 4 years ago when bought was top of the line. i thought i was watching a great picture,which i was, but this tv puts it to shame. i agree with some of the reviews i have seen that say, the picture is so sharp that it almost looks like it was shot on video instead of film. looks awsome. i have had no problem with light bleeding in from the edges or any other picture problems at all. i have watched the tv in a totally dark room with a very dark image on the screen to test for light bleeding and none seen at all. the 3d looks amazing on movies and my ps3 video games,even the 2d to 3d conversion looks pretty good. blu-ray movies look unbelievable. even older tv shows shot in th 4:3 aspect ratio look very good on hi def channel and non hi-def channels. the tv seems to process these programs very well. the gesture control does need improvement. my room is fairly well lit and during set up it says it still does not have enough light, yet when i use the skype app, the camera looks very good and bright in the same lighting, so they need to work on this. the voice control works well with the smart remote but just to talk to tv without the remote it seems to struggle to hear me. not a big problem because i use the remote any way. to me it is just a feature to show off tech to your friends any way. also if you have your tv on and they say something on tv that sounds like a command it brings up the voice control menu. it has happened 4 times to me, so at this time i just have the voice control off. i was also surprised that the sound from the tv speakers sound as good as they do, being that the tv is so slim. but they actually sound very good. so based on picture quality and the 3d quality and tv styling (it looks so cool and slim) and the ability to upgrade with the evolution kit(in the future) i have to give 5 stars. hopefully in future updates they will be able to improve the voice and gesture controls. and if not, its still a great tv that i would highly recommend.", "Date": "April 7, 2012"}, {"Title": "Awesome TV", "Author": "Aaron", "ReviewID": "R111P5GE5MSJQY", "Overall": "4.0", "Content": "I Love this TV, Great picture quality and when paired with a 3D Blue ray player the results are nothing short of amazing. better than at a movie theater. However, the interactive functions aren't that great. voice recognition works randomly and the motion interactive function only activates at random as well. the facial recognition works instantly and is a nice touch to by pass a bunch of log in stuff. Picture quality has vivid and brilliant colors and the screen has deep blacks too thanks to the film on the screen. the smart functionsapps are useful and I use the netflicks app with a cable modem to stream movies effortlessly via WIFI. The sound seems really diminished when you are watching movies from netflicks so I got an optical audio cable and hooked the TV up to the surround sound which solved the problem. The Netflicks picture quality is superb probably because I spent some good money to buy the top of the line Netgear WIFI Router that delivers a ton of Bandwidth. If you are planning on using the TV'S WIFI internet access I highly recommend getting a good router if you plan on streaming movies. The shipping service that Amazon uses Home Direct is great. they were courteous and the TV arrived undamaged and exactly the way you would want it. I purchased the protection plan with it which I recommend as well because this TV is so expensive. all and all its a really awesome TV.", "Date": "April 25, 2012"}, {"Title": "Greatest Impulse Buy Ever!", "Author": "Xavier", "ReviewID": "R3SMD4WY4NYEX9", "Overall": "5.0", "Content": "One day, I was surfing Amazon looking to buy a nice 32-inch Samsung TV for sister for Christmas. Somehow, I stumbled upon this beauty. I didn't need a new TV. My 3 year old 46-inch Samsung LCD was still producing wonderful images. BUT...THIS...was just so pretty AND came with a free 32-inch. So, I decided at that point that my mother could use a new TV as well. I gifted her my old unit, hooked my sister up with the smaller box, and set this bad boy up in my bedroom.PROs:Simply put, it is amazing. Everything that can be said about this set has absolutely been said, but I'll add a tad more: the range at which you can customize the image detail is exhausting -- in a good way. Each source has its own image settings, which is great for me because the settings for my satellite programs greatly differ from my blu-ray and video game settings.Before I saw with my own eyes, I wasn't completely convinced that at-home 3D would be immersing at all. Boy was I wrong. This display does 3D very well and I have stocked up heavily on 3D blu-rays as a result. The Smart TV Center is also a pretty cool feature, allowing you to access Hulu, Amazon, YouTube and Netflix, among a host of other applications. The set also features Voice Navigation, which I absolutely love using while I amble about the room doing crap.CONs:The worst thing about this set is the Gesture Control. It works, but it feels like a job, so I never use it. Kinect it is not. Also, the sound could use a little boost, but mostly it is fine.This TV is almost perfect. Without the gimmicky Gesture Controls, it would be perfect, but turn them off and BOOM: 5 Stars.", "Date": "December 27, 2012"}, {"Title": "Not Bad, but has noticable backlight bleedthrough when viewing dark scenes.", "Author": "James", "ReviewID": "RFOXTK8A25NOR", "Overall": "3.0", "Content": "Well, I really wanted to love this TV.  It looks great in normal daylight viewing conditions, the colors are very bright and vibrant and the picture is crisp and clear.  If I only wanted to use this TV for daylight viewing, I would give it 5 stars.  But, like other edge-lit TVs (or so I have read), this TV has noticeable back-light bleed through when viewing a dark scene in a darkened viewing environment.  It looks like light grey clouds in certain parts of the screen, and can be seen whenever the scene is very dark (ie night scenes in movies etc).  Adjusting the backlight makes the problem slightly less noticeable, but does not fix it completely.  It is more noticeable with some movies than others.  For example, if you are watching Finding Nemo, the colors are so bright that you probably won't notice the bleed through a single time in the entire movie.  But, if you are watching V for Vendetta, it will be noticeable in many of the dark scenes, every 2 or three minutes you will notice the gray splotches.  I really like the TV, but I have to return it because if I spend over $2k on a TV it needs to be PERFECT, and sadly this back light issue is just something I don't want to have to deal with when watching dark movies.  On a side note, the 3D on this TV is INCREDIBLE - the best 3D I have ever seen EVER (WAY better than the movie theatre).  There is almost no 'ghosting' like you see in a movie theatre, it's really impressive.  Note that in order to get the real 3D experience, you will need to watch a 3D blu-ray.  Samsung has some example 3d videos in the smart hub that will stream over your network, but they truly look like crap compared to a 3D blu-ray (I suggest watching Tron 3D - absolutely stunning).  Plus when you are watching a 3D movie the glasses act like sunglasses and dim the picture slightly which resolves the backlight uniformity issue to some extent.Pros:Fantastic picture when viewed in a bright roomShockingly good 3D (when viewing 3D blu-rays)Sleek, sexy design (very thin bezel, beautiful TV overall)Voice controls work decently wellCons:Terrible backlight bleedthrough when viewing dark content in a dark room. (a dealbreaker for me - the other cons are just slight inconveniences)Motion control is activated sometimes by accident - usually once per movie which can be annoying, but you can turn motion control off if you want to fix this.I have noticed an occasional jutter in the picture when motion-smoothing is turned on.  They are pretty infrequent (once every 20 minutes?), and only occur for a fraction of a second, but they are noticeable if you are paying attention.Edit: posted pictures that show backlight bleedthrough", "Date": "November 19, 2012"}, {"Title": "Great TV!!", "Author": "Alex", "ReviewID": "R3A1KOR0H4Y5DR", "Overall": "5.0", "Content": "I bought this TV after reading reviews - happy I did! Amazing picture clarity and Smart TV apps.  After reading some reviews about the gesture/voice controls, I was a little weary, but they work fine and I really like having them. Overall, a great purchase and it looks beautiful!!", "Date": "January 18, 2013"}, {"Title": "Happy So Far", "Author": "C. Smith", "ReviewID": "R3URTAZHKZ9ZVP", "Overall": "5.0", "Content": "Great TV and I got it on discount from BestBuy (don't usually shop there but they actaully had the best price with the discount they gave me).I first want to point out that my previous television was a 7-year old 27\" CRT TV.I was able to complete set up (from unboxing to finish) by myself.  Great picture quality right off the bat.  Have not tweaked any of the picture settings.  3D works amazingly well even when converting 2D to 3D.Smart Remote took some time getting used to using but getting the hang of it now (need to press harder than you think in the touch (black) area of the remote).I have it connected to my wireless home network and have used it for Skype, NetFlix, Wii, and even web browsing (tedious without a wireless keyboard).I've updated to the latest firmware and so far, so good.  No issues encountered yet.", "Date": "June 20, 2012"}, {"Title": "Buggy software, poorly designed UI", "Author": "Charles Dickens", "ReviewID": "R319DNNT05MZK1", "Overall": "2.0", "Content": "My initial excitement with my new TV soon descended into frustration, disappointment and regret at having spent the amount I did.  Here are my issues with it:1. Smart Remote - the touch pad on this thing was very fickle.  Half the time it wouldn't respond properly to my touch and I soon gave up using it, returning to use the regular remote.2. Regular Remote - sometimes the TV stopped responding to the remote control, even volume up/down, and I had to turn the TV off and back on again to get it to work.  (I did check that it was not a battery issue).3. Gesture control - what a gimmick!  You have to wave your hand in the air for about a minute before you can get the TV to see it, and then it keeps losing track of it.  Sure, controlling Angry Birds with hand gestures is fun, until the novelty wears off or your hand gets tired (which happens very quickly when you are holding your arm in the air), but as a way of operating the TV it's useless.4. Voice control - again, another useless gimmick, because most of the time it didn't work.5. Media streaming from my PC - the TV would lose connection with my Windows 7 PC after a few minutes of watching a video and the only way to get it working again was to turn the TV off and on, then repeatedly hit 'refresh' in the source list until it saw the PC again.  And then, it stopped working again a few minutes later.  It happened both wired and wireless.  I then tried sharing via Samsung's Allshare app for the PC.  This would, like clockwork, disconnect after 15 minutes - I timed it and it happened 4 times in a row.  I contacted Samsung support and - after the usual nonsense of resetting the TV settings and uninstalling and reinstalling Allshare on my PC (like that would help!) - I was told that the software was \"not compatible\" with 64 bit Windows and the solution was to use a PC with 32 bit Windows.  Note there is NO mention on the Samsung allshare download page about this incompatibility - it lists \"Windows 7\" with no mention of 32 or 64 bit.  (For the record, I have no other issues with streaming to other devices in my home network).6. The user interface in general is poorly designed, both on the remote control itself and in the SMART TV screen.  It's difficult to put this into words, it just feels clunky and poorly laid out.  The internet browser is just awful and unusable.  I didn't like the way that once you are in an app you can't have a PIP of what you were watching before - you only get the PIP on the main SMART TV menu page.7. Using any app which required typing was such a drag that I could not be bothered to use it, and I wasn't prepared to pay another $100 for a keyboard.8. Skype - admittedly, this was quite cool, talking to a life-sized version of someone (but rather pixelated) as though they were sitting on the couch opposite you.  However, the people on the other end kept reporting that my camera was zooming in and out by itself.  It seems like it was attempting to do some sort of face tracking, but badly.9. [This was the final straw] The sound from the speakers caused the plastic panel on the back of the TV to reverberate extremely noisily making the sound seem distorted - you could put your hand on it and feel the vibrations.  I was watching the movie Crash, and virtually the whole way through, the background music was causing it to happen.  Sure, I could get a sound bar, but I'm not spending another $100-300 on top of this.Bottom line is, I spent a lot of money on this TV thinking it would cover all my needs perfectly.  It certainly looks nice, but I decided to return it and get the VIZIO E601-A3 60-inch instead (which for 5\" more is half the price) and so far I'm not regretting it.  The fancy features of this Samsung just weren't worth the extra $1000 or so.Kudos to Amazon though for the return service and very quick refund.", "Date": "November 2, 2012"}, {"Title": "Best Led out there, Buy this tv for picture quality not the apps", "Author": "Jkem", "ReviewID": "R38ZJAL9CVF2MY", "Overall": "5.0", "Content": "I bought this tv for its incredible picture quality , apps dont really matter to me. im coming from a LG 120hz and i must say the picture is by far better than that and or any other led i have seen, 3d is awesome , 2d to 3d isnt as deep as i thought it would be but i was execpting alot , the motion control is awful, the voice commands work alot better than i thought, almost perfect, and GREAT APPS, I bought this tv because i wanted a led tv with the best picture quality and i feel i made the right decison , this is as close as you can get to a plasma, with out having to worry about burn outs and such, this is a great tv and i would recommend it to any oneBUY THIS TV BECAUSE YOU WANT AMAZING PICTURE QUALITY , NOT BECAUSE YOU LIKE THE APPS OR MOTION CONTROL.", "Date": "August 17, 2012"}, {"Title": "4.5 out of 5", "Author": "mnav8tr", "ReviewID": "RA7N1637FEXTQ", "Overall": "4.0", "Content": "No manual or CD included in the box to guide setup and operation, which made the setup frustrating and time consuming. Other than that gripe, we are very happy with this TV. The display is so clean and clear that the picture is almost surreal. The sound seems pretty good for a thin body TV with downfiring speakers. The WiFi and wireless keyboard works well, but the keyboard is a little too small in size for my liking, but it is weighted well and imparts a solid feel. Haven't had time to play with the 3D yet, so can't comment on the 3D operation or quality. Research your purchase thoroughly, we found a huge $1,135 difference in cost savings by shopping around.Product Update: We purchased this set in November 2012 and this is May 20, 2013. We've been very satisfied with this set and it has worked flawlessly. The picture is so good, that it is very easy to distinguish the broadcast quality between 1080i and 720i, as well as 1080i to 1080i channel variances and the various quality of satellite channels. The wireless Internet works great, and we have not encountered any buffering issues. After accessing the Internet, we downloaded the product manual, so this is no longer an issue.We finally bought a couple of 3D movies and are very happy with the 3D viewing. The TV 3D seems to be nearly as good as 3D movie at a theater. My only gripe, which of course is not a reflection on the TV, is the minimal selection (and higher cost) of 3D movies.", "Date": "November 14, 2012"}, {"Title": "Had doubts but this TV blew me away", "Author": "Jeeper", "ReviewID": "R1VRFN2WNT78RV", "Overall": "5.0", "Content": "After reading several reviews on many different sites I had serious doubts about this TV.  However when I went into Best Buy to look at another TV I had researched for weeks and was positive that was the one I wanted (Panasonic 55VT Plasma), it looked terrible in store.  The samsung was the only TV to really catch my eye and I was disappointed when I went home and saw several bad reviews online.  After a week of debate I decided to give this TV a try and it has truly blown me away. I've seen no issues with \"flash-lighting\" or \"uniformity\"  or anything at all! The 3D really blew me and my girlfriend away.EDIT 1: After a few months of use this TV is still amazing! We have had several family and friends come visit and while here everyone has commented on how good the picture quality of the TV is.  The TV has been perfect so far and when watching other peoples TVs you realize how good the tv is (and how bad theirs is).", "Date": "September 29, 2012"}, {"Title": "Great TV!  Forget using the voice command or motion controls", "Author": "Josh B.", "ReviewID": "R283G8UP14SMQT", "Overall": "5.0", "Content": "This is the best TV I have ever owned.  I scouted TV's for over 3 months prior to purchasing my new home for the mancave.  I read many reviews, shopped at stores and this is hands down the best television for the money out there.  The main features are the 240Hz and the ability to have 3D if wanted.  The apps are very slow and shouldn't be relied on.  The voice and motion controls work about 10% of the time, so just plan on using your remote to control things, also it's a little weird to find yourself yelling at the tv to volume up/down.", "Date": "August 16, 2012"}, {"Title": "Super TV for Super Sunday", "Author": "G. Ware Cornell Jr. \"anotherlawyer\"", "ReviewID": "R1VZ5VT3S3NMIZ", "Overall": "5.0", "Content": "Like every red-blooded American male, two weeks before the Superbowl means one thing-is this the year I get a new widescreen? Fortunately, the answer to that question was yes and before my wife could object, I had a new Samsung. I couldn't be happier and she, to my surprise, has latched onto the feature I thought would be least appealing-3D.First things first.Why Samsung? Consumers Reports highly recommends that any major widescreen television be actually manufactured by the company whose brand is on the set. Lots of cheaper sets are made by assemblers-marketers who create a brand and then order product (assembled or otherwise) from obscure factories in China or India. They look great at first blush, but they are able to sell them cheaply because they are made on the cheap.The two best manufacturers who sell under their own names are LG and Samsung. Not far behind are Toshiba, Panasonic and Sony. But let's face it, when was the last time you got really enthusiastic about any television from Sony? 1985? The quality and image has slipped. Samsung by contrast is spiraling upward like a Hail Mary pass from RGIII to the end zone. Even my beloved Apple has upped its own game to compete with the Korean juggernaut. Had Apple come out with its much anticipated Apple TV, I would be reviewing it, damn the cost.But Apple didn't make the big announcement and so for my money, this Samsung smart tv.So for features-Display is terrific. The active 3D display is even more terrific, a quality that has forced the acquisition of a whole lot of Blu-Ray 3D titles. four pair of active 3D glasses are included and I recently ordered at very prices a whole bunch of Maxell Lithium 3V Batteries Size CR2025 (Pack of 5). I am not planning on late night trips to CVS, but they do sell them there.Sound output has been an issue, but not for lack of component quality. The 55 inch screen just barely squeezes into our cabinet. the speakers are mounted on the back for aesthetic reasons. This means it is projected to the back of the cabinet and is muffled by the shear dimensions of unit within the cabinet. We solved this by acquiring a Yamaha YAS-101BL Front Surround System, Piano Black and connecting it by two BlueRigger Digital Optical Audio Toslink Cable(10 feet) to the optical audio outputs on the Directv box and our new LG BP325W WiFi 3D Ready Blu-ray Player. No amp is necessary and the sound quality suddenly became amazing.This is a smart tv which means it is basically an integrated computer rather than just a dumb monitor. Samsung has lots of apps as well as a web browser. We just use Netflix and Amazon Prime Instant video. Facebook at 55 inches seems a bit much. Hulu is also an option.Now if only the Superbowl was in 3D it would be as amazing as this smart tv.", "Date": "January 28, 2013"}, {"Title": "Good TV, BUT", "Author": "Robert Batey", "ReviewID": "R1NRZLEYO457WE", "Overall": "3.0", "Content": "The TV performs well and picture quality is great. But I've switched back to the \"old fashionrd\" remote because the new \"touch\" input is harder for me to use; It may not be for those more familiar with this type input. I actually received a 2013 model vs the 2012 ordered. I thought the shipping was slow, as it took about 12 days for the order to arrive in TN from TX. When setting the TV up I found the 3D glasses and another component were missing from the box. I contacted the shipper and they failed to respond after three attempts at trying to get replacements so I tried direct contact with Samsung Customer Service and made absolutely no headway with them. Finally, I contacted Amazon and they took charge and got the shipper's attention. So far they have told me Samsung has no spare parts for their new model so it will take several weeks for them to obtain replacements. Smasung has made a good quality product but they and the Company supplying Amazon with this product  seem to be indifferent about Customer Service.", "Date": "August 7, 2013"}, {"Title": "UN55ES7500 Defective", "Author": "George A. Tarver \"Shark\"", "ReviewID": "R1B4EH9AI5FEH5", "Overall": "2.0", "Content": "I've had this set for 9 months and this will be the second repair. The unit remote controls menu button will be depressed and all of a sudden multi-colored vertical lines will appear. Then the TV will go through a shutdown and restart only to do the same in a continuous loop. The TV has to be unplugged to get it to operate normally until it begins to do it on its own without the remote control interaction. The tech was sent out and almost replaced the ENTIRE TV (screen and inner components)except for a couple of components. I think it would have been cheaper to give me a new unit. Well it operated for two additional months with no problem and wow this week it stated again. Another issue with the set is the hand gesture recognition- totally not worth it, just reach for the remote. The TV will pick up minor things and the interaction screen will come on. You may be sitting still and it will activate. I would not spend money for this feature, but the only good thing about it is the skype feature that uses the camera-that's why I got it. Without the installed camera you will have to buy a SAMSUNG only camera. Not a good deal for me, they do not warranty their repair, so one day after the warranty I'm on my own, even if they repair the TV one day before the warranty expires.  That's my 2 cents.", "Date": "August 5, 2013"}, {"Title": "Present for Dad", "Author": "Luke Eades", "ReviewID": "R1DK6AYE46VK5P", "Overall": "5.0", "Content": "This was a Christmas present for my father and mother.  They say they are very happy with it and enjoy the large screen.", "Date": "January 20, 2013"}, {"Title": "Great TV compared to my older Sony", "Author": "Gary Reagon \"TNMan\"", "ReviewID": "R1YCM2LYWGLCBR", "Overall": "5.0", "Content": "I replaced my older Sony which had a cracked screen. This tv was a good replacement for my Sony, So far it is the best replacement move I could have made. I will keep you updated on the picture quality. So far so good though.", "Date": "January 14, 2013"}, {"Title": "Modern Art Piece", "Author": "Moophious", "ReviewID": "R2O0PIA1DQSQ3Q", "Overall": "5.0", "Content": "Since voice and facial items are irrelevant to me I don't even consider these in my evaluation. I turned these off mainly because I use this TV as my computer monitor. The TV itself is hands down the best looking I've ever seen - this of course without the TV itself being turned on. It's really strikingly beautiful and you can't appreciate the thinness of this TV until you see it up close. The almost lack of a screen bezel makes the screen appear even bigger.I didn't see any back-light bleed through and was a little concerned after reading one review here. The screen itself looks like glass - unlike traditional screens that I'm accustomed to. Again no bleed-through whatsoever even in a dark room.I popped in Tangled 3D and I'll just say W O W. You'll never watch TV the same again. Honestly I can't describe how utterly amazing coming from a 42\" to this monster. I liken it to having a Lamborghini sitting in your room.The menus/remote are easy enough to fumble your way through and setting up to my computer through HDMI 1 was a breeze.The stand was also very simple with 8 screws. The only issue seemed to be wondering which way the base sits when attaching the part that connects to the set itself. But that was figured out quickly.For $ 2,000,00 with 24 month no interest through the Amazon store card it's a deal I just couldn't say no to and I certainly aren't concerned with buyer's remorse with this purchase!UPDATE: 12/31/12  I'm still in love. Had a little issue with getting 3D on after connecting to my video card. I have a GTX 670 Nvidia with DVI out. I had to go into Nvidia's control panel in windows to setup stereoscopic 3D before being able to play 3D on this TV. I wasn't seeing anything so run this Nvida setup and make sure your glasses are connected to your TV (Push the little button on top until you see a flash of green). I was then also able to set resolution of the TV to '1080p 3D' in windows.It's also important to set black levels through the menu (HDMI blackness level)For some reason anything other that set to 'movie' makes my computer desktop look bad.This also goes for playing World of Warcraft.The 3D on this TV is really something to behold. I'm not getting 'use to' it in the sense of it getting old. I can't watch TV any other way without feeling underwhelmed.Also make sure to rename HDMI1 to PC or PC DVI in tools.I wish there was some manual for 3D+Glasses setup because you have to figure it all out on your own. For the glasses you simply push the little button on the top and they should flash green. If you're already in the movie you should see a popup. But either way you'll KNOW when it's 3D. Depending on your Blu-ray software (mine's power DVD 10) you'll also need to enable 3D through that.UPDATE#2: Purchased Samsung's 7.1 surround sound home theater. So easy to setup. I simply connected the HDMI cord and I had a real theater in my living room!", "Date": "December 28, 2012"}, {"Title": "Connectivity issues????????", "Author": "Pen Name", "ReviewID": "R1TB8PAJLJY5LR", "Overall": "5.0", "Content": "First off, this is one if the best H.D. pictures on the market today. Truly amazing black and white contrast as well as fine line definitions. Supreme quality standard defintion picture as well. The 3d is second to none in every aspect. As for the voice and hand gesture features; dont buy the t.v. for those alone. They are cool to play with but not not practical at all for everyday use. The smarthub is fast and user friendly. Overall if you are looking for a smart t.v. who's picture quality will continue to blow you away use after use than this is the t.v. for you. Buy it you wont regret it.As for compatability issues. I bought this along with the samsung hw450 soundbar and samsung 3d blueray player thinking they would all sync up seemlessly. The blueray player has no issues and can be cotrolled easily from one one remote. As for the soundbar; there are a couple of ways to get it work with the t.v. Many users have a hard time getting it to turn on/off and control volume from the t.v. remote. The easiest way to do this is as follows.1) Connect soundbar to t.v. via hdmi from (hdmi out) on soundbar to (hdmi 2) on t.v. ( also known as A.R.C. (audio return channel)2) turn Anynet+ (On) on soundbar using provided remote3) in t.v. settings turn anynet+ (On)  Receiver (On)  Auto off= (No)If you are connecting the two devices using an HDMI cord than this is the only setup that I have found that works. You can also use an optical cable along with your HDMI cord or alone as your sole connection between the two devices. I have opted to use both just for sake of not pulling the optical cord back out of the wall. I recently purchased a Logitech 650 wireless remote to simplify all devices even more.  This thing is almost as cool as the t.v. Itself. It is around $60 and well worth the money. It is very easy to set up and even easier to use. This thing is a godsend and a must have for anyone having connectivity issues.", "Date": "November 18, 2012"}, {"Title": "A Great TV for 3D", "Author": "James Orzech", "ReviewID": "R1BF2SEJ6BOPGD", "Overall": "5.0", "Content": "This is a great TV with a fantastic picture. The 3D is the best I've seen. The controller is easy to use. There are many apps. The only thing that doesn't work well is the waving hand control. The voice control does work, but needs to be repeated most of the time and done when the audio low or quite on what you are watching on the screen. I did not purchase this TV for the hand and voice controls, but for the brilliant picture definition.", "Date": "July 29, 2012"}, {"Title": "The TV keeps turning off and on while watching", "Author": "joseph katongole", "ReviewID": "R3IPWBP6LPHNHV", "Overall": "2.0", "Content": "Am wondering how a TV this expensive develops technical difficulties just after 3 months. The TV keeps turning off and on repeatedly while watching.The TV keeps gestures as if  a hand signal has been presented.Get ready for interrupted viewing if you buy this TV", "Date": "November 25, 2012"}, {"Title": "BEWARE...The tv keeps turning off and on intermittently within 6 months of purchase.", "Author": "Charumati Akella", "ReviewID": "R3IDMCVOEGH2MM", "Overall": "1.0", "Content": "I WAS a big fan of samsung, but now starting to seriously doubt the quality of their products. This is the second samsung TV that I own is having the trouble of powering off and on... This TV has been bought 6 months back, connected to power via a surge protector, and not very frequently used. Noticing since last week that the tv powers off and on on its own.I had a UN55B8500 before this TV, which was the top of the line at that time. Around 3 years after purchase, it started turning off and on and then it shutdown completely. I had to pay for the repair which costed around 500$.Samsung has had lots of problems with their TVs turning on and off. Please research before you buy and watch out!!!!UPDATE:Samsung technician came and fixed the TV. When the TV was opened by technician it was found that the Wifi module was tampered with and bound together by tape. Technician is of the opinion that this *NEW* TV was tampered with before sale. Now this really blows me away as I bought this item as NEW but the part installed in the tv has been tampered with. How can it be NEW if it has already been tampered with???Contacted Amazon to get this TV replaced and they are not agreeing to replace this free of charge as it is out of the 90 days window. How can that apply to this case? Its not my fault that Amazon gave me a TV that was used/tampered with, when I ordered a NEW TV. This is ridiculous!!!!!!! Now a customer is expected to bear the cost for returning an item that was not as stated during sale????Do I go to a consumer court??? It seems we cant trust Amazon on big ticket items.", "Date": "June 3, 2013"}, {"Title": "Worst Tech Support and Defective WIFI Module", "Author": "zafor ahmed", "ReviewID": "R3SLENF5KK1G11", "Overall": "2.0", "Content": "I have purchased this TV on December 2013 and after three months the WIFI started malfunctioning.Every 5 to 10 minutes the connection will re-set and I will have to re-connect to my wifi by going to network setting.I have called Samsung Technical Support for at least 12 times by now and it was probably the worst customer service I have ever experienced.  After 5th or 6th call they told me the problem is my router is not next to the TV. When I told them the WIFI signal is showing at the full strength on the TV they told me to Connect my TV directly to the router using a cable!!! Why on earth some would buy a smart TV if you need run 10 cables behind it ??  Didn’t make any sense to me. They would not send anyone to fix the issue.Bottom line is – The WIFI module probably defective on this TV and Samsung would do anything to avoid providing any helpful technical support as part of the warranty, so the Samsung warranty is just as good as a piece of a paper.I have submitted this review on the Samsung website and they rejected this review, So don’t TRUST ANY REVIEW  posted on Samsung website as They ONLY Post Positive Reviews !!!  I have the Review Rejection email from Samsung if anyone like to see it !", "Date": "May 5, 2014"}, {"Title": "Power cycling issue $$$", "Author": "Shawn", "ReviewID": "R15MG02X3Z3B4C", "Overall": "3.0", "Content": "I gave this a 3 star and I will explain why. (Purchase date 8/2012)First off I LOVE this TV, the picture quality is out of this world, but and this is why i gave it a 3 star. 1yr and 7 months into ownership my TV starts cycling on and off and will not respond to any remote control functions i had to unplug the TV to get it to stop. I call Samsung and they say my SMART TV needs an update so I update the tv and behold it did not fix the issue so I contact Best buy (lucky me I purchased the 4 yr warranty), they send a tech to my house and find out this is a known issue ([...]) and not cheap.Get the warranty you will need it.", "Date": "May 5, 2014"}, {"Title": "Pioneer technology always lacks of consistency", "Author": "A. Koci", "ReviewID": "RXSRHJ5IVEBVW", "Overall": "1.0", "Content": "Problems and problems since the update. This is ridiculous .Firstly did not connect to Smart hub, and now crashes continuously , like 100 times within the day as soon as the warranty expired. Samsung says that its best that i protect my investment with a 450$ extension a year….ughhh boy! This getting from bad to worse. Ask around before you buy something like this. I did not pay 2200$ for a 1 year tv.", "Date": "April 29, 2014"}, {"Title": "Great Picture! home theather experience!", "Author": "Mickey Mouse \"Mickey Mouse\"", "ReviewID": "RHXG5D3OI0FMA", "Overall": "5.0", "Content": "I have owned this TV for over a year.  I did not buy it on amazonI haven't had the issues described by others and had.  This isn't perfect; but for streaming videos directly to TV via home wired network its great.  Browser isn't something I would recommend using as you would your PC/laptop/phone browser...but for quick glance at a few things it does the job, as long as you use a wireless keyboard.I don't use any of the gesture feature since I don't think its value added (remote is perfect for my use).I am very techy person with a wired home network and NAS for my theater experience. This definitely the screen for a family that doesn't want to take out a 2nd mortgage to build out a state of the art theater.  For average home movie experience this with a netflix/redbox source will pay for itself in a year!", "Date": "January 31, 2014"}, {"Title": "The best smart TV for me.", "Author": "Romualdo", "ReviewID": "R2GYA5E79SNT6L", "Overall": "5.0", "Content": "This is a great TV. The best I've ever had.I recommend this TV to everyone looking for a smart TV.", "Date": "July 11, 2013"}, {"Title": "Remarkable picture, great right out-of-the-box!", "Author": "Terry Clark \"cigarcamel\"", "ReviewID": "RBWV3MV2VVLOA", "Overall": "5.0", "Content": "When I saw the picture in stores, I knew I had to have the Samsung 240Hz Smart TV.  I hemmed and hawed, trying to find a better price for about a year, finally splurged when the price came down below $2000.  I was a little leery of having it shipped, but couldn't find what I wanted in stores (e.g. Sam's Club).The picture is remarkable, nothing else like it IMHO. Easy to set up and get going, no issues.  Only issue I have is I had to get a optical audio cable to hook up my home theater, my Sony receiver doesn't have HDMI connections.  I could find no audio out RCA plugs on the TV. The quick set-up photos are not accurate of what is really on the back, must be it has been changed from when they were made.Not sure I have much use for the Smart TV functions, I bought it for the PICTURE!  It is nice to know I have that, and 3D, but probably won't use that for awhile. It fits right in where my old Sony 46\" rear projection TV sat on our cabinet.I have had it a week now and it is spectacular!Added: Oh yeah, the TV connected with my home network without glitch, even with the WEP security on.", "Date": "June 28, 2013"}, {"Title": "IT is a nice TV", "Author": "Archil Avaliani", "ReviewID": "R3DNNN6XR01ZIR", "Overall": "3.0", "Content": "The TV is definitely nice. But It was not mentioned in the specifications that it is for US only. This TV is not a multisystem TV. So if your DVD/Bluray player or Satelite decoder doesn't support NTSC, the TV will not work.", "Date": "June 26, 2013"}, {"Title": "Great TV!", "Author": "Padaddy", "ReviewID": "RJV7C403OTHZS", "Overall": "5.0", "Content": "Love this TV. Easy to set up. Superior picture quality. Straight forward adjustments. As noted by many others, the sound quality could be better, but is tolerable. After a few days of play, added a sound bar which made great improvement and enjoyment to the audio. If you are considering a new TV, you can not go wrong with a Samsung!", "Date": "June 22, 2013"}, {"Title": "I Love this TV.", "Author": "jemakim", "ReviewID": "R352A9JNNJJZYF", "Overall": "5.0", "Content": "I Love this TV, Great picture quality and when paired with a 3D Blue ray player the results are nothing short of amazing. better than at a movie theater.Samsung, you really need to get your act together on this one.", "Date": "June 17, 2013"}, {"Title": "Great Picture.  Good sound.", "Author": "JCC", "ReviewID": "R1AOVBYLEJQ471", "Overall": "5.0", "Content": "I was not looking for a smart TV but was not able to get performance features I wanted without the added features.  I haven't use voice activation, smart remote, 3D or Bluray.  What I wanted, I got which was the great picture in a lightweight, space saving cabinet.", "Date": "May 1, 2013"}, {"Title": "Great Buy!!!", "Author": "Rolando Mancilla", "ReviewID": "R1O5EFZ0DGOVEH", "Overall": "5.0", "Content": "Great seller AAA+++!!!  The unit arrive as described with all accessories intact and unit itself functions great. Would recommend seller to every buyer. Samsung always is my first priority when purchasing electronic items. This my 3rd Samsung HDTV and my first 2 still works with no flaws for 10 years and counting.", "Date": "April 26, 2013"}, {"Title": "Good", "Author": "Amazon Customer", "ReviewID": "R1TD07CSRR8DN", "Overall": "5.0", "Content": "I like the TV and have found no issues. It is a great size for the apartment that I am staying in and at a good price also.", "Date": "April 19, 2013"}, {"Title": "Great TV!", "Author": "Richard Anderson", "ReviewID": "R1ZBTXN6KMKSNF", "Overall": "5.0", "Content": "This has outstanding color and great features.  Sometimes the sound/hand feature kicks in for no apparent reason tho, but overall a great TV.", "Date": "April 11, 2013"}, {"Title": "Great tv", "Author": "Marvin", "ReviewID": "R14G0QZFQJINN0", "Overall": "5.0", "Content": "An absolutely smart buy. Aside from the glitchy and unreliable facial recognition software everything about this tv works and runs flawlessly. It even syncs well with my sony soundbar and bluray systems. I highly recommend this tv for those who want to jam all of their favorite television and internet viewing programs into one, easy to use device.", "Date": "March 10, 2013"}, {"Title": "Samsung UN55ES7500 55-Inch TV", "Author": "Herman Lauterbach", "ReviewID": "R2A98Y4W16OOVF", "Overall": "5.0", "Content": "What a great smart TV.  I have connected it to my Wifi and am making new discoveries each and every day.  I highly recommend this unit.  Oh, and the picture is terrific.", "Date": "January 19, 2013"}, {"Title": "Love this TV", "Author": "DQ", "ReviewID": "RBKP7SF44AM1L", "Overall": "5.0", "Content": "Love this TV and I get so many compliments on it! Its was a bit expensive but I definitely think it has great quality. Maybe equal quality to some cheaper TVs out there but great quality nontheless. The motion activation feature is not awesome. Lighting always causes issues and it will pick up sometimes when you're not even trying to signal it. The voice command is better. Not super useful but it's a nice to have. The only downside is when the program you're watching says one of the commands. Doesn't happen often but has happened to me 3 times in 2 months. The apps are great and the TV was easy to set up and customize.", "Date": "December 26, 2012"}, {"Title": "upgradable", "Author": "jdelle", "ReviewID": "R2NLYUCQJUHT71", "Overall": "5.0", "Content": "Actually, I had no plan to upgrade my tv yet..It's Sharp 46 inc and 1080p, and never had an issue, the sound....well, my tv is connected to my pioneer elite sc37 with klipsch reference tower speakers ...so I really don't care about it's sound..Till I visited bestbuy, looking, window shopping on latest tech., I went to tv section.,, Lg8600 model..\"wow\"!Pq is bright and clear..and 10.1 dynamic ratio..It sets standard immediately if ever I would upgrade my tv...Then, I laid my eyes on Samsung 55es7500. This blows me away. I compared this to lg8600 ,es7500 pq is still evidently better., why? it's 25 mil..dynamic ratio..And,It's the most techno pack tv I've ever seen.So, a no plan turned into a must have this year..I read all the reviews and took me almost a month till I called samsung, of how to solve the most evident weaknesses of es7500, and told me,upgrade thru firmware and, it will come out next year, an evolution kit, a quad core chip, then graphics upgrade card to make this es7500 and es8000 series smart hub, dramatically faster...voice control more responsive etc. And so, I finally got the tv...And so far I'm enjoying it, no problem with pq...I considered the evolution kit upgrade for a better performance, so I gave this tv 5 stars.", "Date": "December 18, 2012"}, {"Title": "work of art", "Author": "Pen Name", "ReviewID": "RDTQ3QJKN61MQ", "Overall": "5.0", "Content": "I had my doubts on this set for awhile but let me reassure you that its a beautiful thing . The picture quality is great .The 3d is spectacular . When me and my daughter watch happy feet two, she tries to grab the shrimp in the living room . Lol. Two thumps up !!!!.", "Date": "December 17, 2012"}, {"Title": "Amazing picture!", "Author": "gman11", "ReviewID": "R2BRGF1ZDJQ3TX", "Overall": "5.0", "Content": "Best picture I have ever seen in a tv. The colors are so bright and the picture is so clear as well. People and objects almost seem like they are coming off the tv, almost like its a built in 3D tv without the necessary glasses. The sound is a lot better than what I expected it to be since its not really to have good sound, but its pretty decent. The apps are cool but I never really use them since I have most on my ps3 and xbox, but everything else on this tv is perfect.The only problem I have with this tv is that it gets pretty hot in one part of the tv, which worries me even though Samsung told me not to worry, but thats about it.I highly recommend this tv, it is definitely worth the money.", "Date": "November 29, 2012"}, {"Title": "Fully satisfied", "Author": "NDP", "ReviewID": "RY9HP7KCHB6AJ", "Overall": "5.0", "Content": "Bought this TV (55es7500) on 26th September.I read many negative reviews about these panels and was bit nervous when I made up my mind about this model. Image quality is outstanding. Blacks are true blacks and colors are rich and vivid. Motion and gesture control suck but 3D is awesome. Overall, I got what I was expecting from my TV. I am happy with the purchase, and so far havent had any issues with the TV", "Date": "November 16, 2012"}, {"Title": "Warranty Service in 90 Days", "Author": "artslave", "ReviewID": "R3SE6M7V7HMNWN", "Overall": "3.0", "Content": "The picture quality is outstanding. The voice control features are pretty lame. I purchased this unit about two months ago and I've already had to request warranty service because it power cycles off and on at random intervals. This is not related to voice control because I have disabled it. This unit was a replacement for a 36\" Sony CRT that I had for 14 years. Never had a single problem with it. I currently own one Sony and one Sharp LCD. My feeling is I should have purchased a Sony instead.", "Date": "October 25, 2012"}, {"Title": "Great Picture When it Works!", "Author": "Kathleen Davenport", "ReviewID": "R1S3KSUY7Y2YOA", "Overall": "2.0", "Content": "The TV has the most amazing picture I have ever seen!! I compared a lot of TV's before purchasing this one. I no sooner hooked it up and sat down then the TV shut itself off then turned back on. I thought it was some come kind of fluke. The next day my husband told me it was doing the same thing. Samsung support said it just needed an update because this was a known problem. After numerous attempts to update and numerous calls to support they were unable to get the TV to update. The tech said they needed to send out someone to repair it. Since I just got the TV I didn't want to lose my 30 day window waiting for them I decided to return it. I am so glad I bought the TV from Amazon!! 5 minutes on the phone explaining the problem and I am set up to swap the TV for a new one. They even said if I'm not happy I can return the new one!! I'll update when I get the new TV but so far I am not happy I bought Samsung. I usually get Sony but I love the picture on this set!!", "Date": "July 22, 2012"}, {"Title": "Fantastic TV!", "Author": "Michael Harbour", "ReviewID": "REYK1S2NRN33Z", "Overall": "5.0", "Content": "Picture Quality is Amazing. My one thing about TV's is the motion quality. I had a LG 55LS4600, rated at 120hz with Trumotion and it was horrible. This Samsung UN55ES7500 is 240hz with 840 CMR. It looks just as great as my in laws' UN55ES8000 rated at 960 CMR. If you're looki g for a great TV with the best picture go with Samsung. I prefer active 3D over passive any day. Just another reason to go with Samsung.", "Date": "July 11, 2013"}, {"Title": "Excellent Picture, Horrible DLNA Client.", "Author": "alias2012", "ReviewID": "R1MDTHUM7ZIRLT", "Overall": "4.0", "Content": "The reason I selected this TV was not only for the promotion and other reviews, but for the DLNA App (Plex) you can download from the Samsung App Store. The picture quality is great when watching HD content. The image almost looks real, sorta like computer graphics. Hard to explain unless you physically see it. The motion feature I really dont use, however it requires your room to be well lit to see gestures and I dont intend to watch a movie with bright lights in the room. The gestures did not work with a medium lit room. The motion/speech remote that comes with this seems buggy and clumsy. When speaking to the TV, it seems like you have to yell at your TV to get it to cooperate. I stopped that. My neighboor kept asking why I was yelling so much. I started to sound like my mother.  Now, the DLNA Client (Plex). I am a big XBMC fan, but I was trying to get away from a set top box and just use the TV. I download the plex client to the TV and my Macbook Pro. My house is all CAT 6, Router is Giga LAN, and all my movies sit on a NAS with Giga LAN as well. Plex on the TV took forever to get movie posters. Not all my movies had posters. Then there was no Metadata Scrapping. So no movie info would show when you highlight the movie. Streaming was horrible with 1080/3D content. 720p was fine. So I went back to the set top box for DLNA content. I built an XBMC HTPC on an Intel NUC. Other than that, it has a great image. Also, Samsung has introduced what they call Evolution Kits. These are upgrade attachements that are attached to the back of the TV and upgrade your TV processor and RAM and other features, so your TV does not get old after a few years. This feature will keep your TV up to date with the most current TVs on the market. However, it does not seem like these kits are for sale yet.", "Date": "March 15, 2013"}, {"Title": "Almost a perfect TV", "Author": "H. Wallace", "ReviewID": "R6I5WE53GCDPX", "Overall": "4.0", "Content": "As per normal, Samsung has not disappointed. I do not normally review stuff, but I moved from a 5 year old LCD 40 to this TV. The Sony worked fine and I was happy, but wanted something bigger.The clarity is amazing. I did not think it would make such a big difference but its night and day. I got this for my bedroom, and had no plans on upgrading the tv in my media room. but now I need to find a way to convince the wife. Its like night and day. Really really impressive.The one thing that was a let down was the remote, but then again almost every electronic device today comes with a junk remote. So now I need to find a Logitech for my bedroom. Oh one note. Its not an absolute must to get a sound bar, the volume on the TV is pretty decent. But it does improve it somewhat.. I was told by the tv sales person that the TV speakers were horrible because of the slim depth.If you buy the wall kit from Samsung, the bigger 2000C works...", "Date": "March 8, 2013"}, {"Title": "Awesome TV with an array of technological features!", "Author": "True Knowledge \"Amen Kosmos\"", "ReviewID": "R3N6LSW0GWMOHI", "Overall": "4.0", "Content": "I was skeptical about purchasing this TV because of the few negative ratings, most of which center around the voice and gesture controls. Often, I will let a few negative reviews sway my decision over a majority of positive reviews. Although each individuals experience may differ. With that stated, I decided to pull the trigger on this samsung un55es7500.  Shipping was quick - but that is expected as I'm a prime member. The TV is light, with respect to weight and it is very thin. It didn't take long at all to set up and the process was very user friendly. The only problems I had during initial set up was with the voice control test and the universal remote set up (more on these later). Installing the stand on this unit was \"idiot proof\" and could be done without reading the instructions but following the illustrations.  I had the TV up and running in about 30-35 minutes including set up but that included the seemingly impossible to complete voice control test. I purchased this tv for my wife so I had her do the voice test; however, neither of us could complete the test as the TV was unable to register either of our voices. As such, we skipped that part to return to it later. Well, as it turns out, we didn't need to complete that part because the TV responds to both of our voices. It is so cool to say to your tv; \"hi tv, power on - and the antithesis, \"goodbye tv, power off\", and have the unit power on and off respectively. The gesture control camera worked fine for my wife as well. I haven't tried it myself though.  I also like the smart remote and its \"universal\" functionality. It was a little tricky to set up after pairing with the TV, but once I set it up, the true awesomeness of this TV and smart remote were on full display. It does take some time to get use to though, but I suspect that one could reach 80% acclimation with this remote in a day or so. The GUI that appears on the screen when using this remote is crazy (slang for good).  The picture quality is very good on this set, but that's to be expected. I have a sony bravia with xreality feature that may be slightly better or slightly inferior depending on the observer. There is one thing I don't like about the TV and that is, on the right side of the tv screen there appears to be a four circular spots that form a square on that can be seen in a high light setting such as when the sun is shinning on it however, reducing the sunlight removes this issue.  If you're considering this tv you should go for it. I gave it five stars for the pros and removed a star for the cons which are as followed:Pros: good picture quality (haven't watched 3d as of this review)  Built in wireless which connected with ease to my network without wires or an adapter.  Smart functions which are awesome and the GUI is phenomenal. the wall paper is even changeable and may even be customizable .  The smart remote and its universal capabilities are neat also.  There are a few other pros to this TV but I won't list them all.Cons:The rainbow spots that appear in direct sunlight  The voice control test  and another con that I didn't mention above, amazon offered a $200 gift card with the purchase of this tv; however, it made getting the gift card very difficult. In fact, I lost out on the gift card because I didn't know that I was supposed to add the gift card to the card then put in a promo code. I saw the promo code for the gift card and I used it at check out at which time my cart reflected a $200 discount. However as it were, the discount didn't apply. I called amazon about this and a representative told me \"my hands are tied, we don't/can't applied discounts retroactively.\" Had the discount not been reflected in my cart, I wouldn't have purchased the TV until I was certain as to how to acquire the $200 gift card.", "Date": "December 10, 2012"}, {"Title": "So far so good w/ the second unit.", "Author": "A. Mousa", "ReviewID": "R1SXIRDHPO9QX4", "Overall": "4.0", "Content": "The first review had horrible backlight bleed in the corner and strange horizontal banding.  The new unit looks good but last time it took two days for the problem to occur.", "Date": "July 25, 2012"}, {"Title": "Very nice TV with excellent picture quality", "Author": "Cedeno Johanna \"Leonardo Villarroel\"", "ReviewID": "R1B2OQEG8ZL2W2", "Overall": "5.0", "Content": "Very nice TV with excellent picture quality, but the sound is poor! Placing the sound to the fullest, this does not sound as expected. This TV has multiple functions and multiple audio and video inputs. The films, series and cartoons in HD and 3D are in excellent quality. I love watching movies with this Samsung TV UN55ES7500 55-Inch 1080p 240Hz 3D LED HDTV Slim.", "Date": "December 11, 2013"}, {"Title": "I love it", "Author": "alberto regalado", "ReviewID": "R1S1ROQH5DSUEB", "Overall": "4.0", "Content": "I do, its awesome.  The picture is awesome and amazingly clear. But in all fairness there are a few cons that made me choose four starts.  The picture sometimes looks so clear that it seems a little fake.  You know like there is a green screen or something in the background.  Also the motion sensor is not as precise as I would like it to be.Overall I am very happy.  The price was great and it does everything that I want it to do.", "Date": "April 1, 2013"}, {"Title": "Amazing TV!", "Author": "Russell", "ReviewID": "R5FQ98L63HLOP", "Overall": "5.0", "Content": "I have been doing a lot of research on TV's LED and Plasma. Samsung and Panasonic have been my favorite brands. I owned a 40\" Panasonic Plasma and upgraded to this TV set recently. All I can say is WOW it is absolutely worth every penny. The picture quality is amazing but I am still looking for customized setups. The TV is great right out of the box, the 3D has been really fun although I have only used it with my xbox 360. The TV came with a 7\" galaxy tablet to use as a controller. It works pretty well but I don't find its a suitable replacement for normal remote. The voice activation feature is pretty good and I find it useful sometimes although I have not tried the motion activation which I don't really need. The WIFI seemed decent for the TV. The TV stand is pretty sturdy although I hope to wall mount it eventually. To sum it up the TV is very nice, and I would strongly suggest it!", "Date": "March 31, 2013"}, {"Title": "Great picture, clunkly browser and controls", "Author": "Stephen Considine", "ReviewID": "R194OKZQRBJPA", "Overall": "3.0", "Content": "2D and 3D picture is stunning.  Browser is very limited.  RC pad for moving the curser is very clunky and difficult to operate.  Does not support Flash (except YouTube app) so HBO-GO and Comcast logins are not supported.  Picture shuts down occasional and resets. On-line chat help did not understand my concerns. Also, audible 60 cycle hum when plugged in and powered off.", "Date": "March 30, 2013"}, {"Title": "Great buy!", "Author": "Charles Eisenbach", "ReviewID": "RVO2RWOB3GM5I", "Overall": "5.0", "Content": "I'm just a regular 'Joe' when it comes to all the bells and whistles on todays' TV's, cell phones, pads, pods and everything else that runs on elecrical power, BUT this TV is a stand out in my experience!  Easy to set up (the basics), terrific picture and very decent 3-D.  The 2-D picture is so good that you won't feel the need to spend much time watching 3-D.  Viewing angle has not been a problem and the sound is first rate.  This just might be our last TV!", "Date": "December 20, 2012"}, {"Title": "Premium cost for premium", "Author": "Martin Dareff \"Canon Shooter\"", "ReviewID": "R32GU6IP9SDLHK", "Overall": "5.0", "Content": "performance.  If you want the very best it is the 7500 or 8000 series Samsung.  Once you calibrate colors, brightness, etc., for at home instead of in a showroom the picture is past awesome.  Best there is, if you can write the check.", "Date": "December 11, 2012"}, {"Title": "STAY AWAY FROM SAMSUNG!!!", "Author": "Just Sayin'", "ReviewID": "R3FJ0E1DOPPKEF", "Overall": "1.0", "Content": "*****W A R N I N G*****Do not buy SAMSUNG Televisions!!!  After the one year warranty period SAMSUNG Television screens tend to show burn-in and ghosting with horizontal lines, along with very heavy distortion of picture on right side of screen.  This problem is systemic in all their LCD's and LED's.  Consumer's have complained all over the internet.  There are even numerous Youtube postings with the exact same problems as in my DEFECTIVE SAMSUNG model, as well as the same DEFECT in other models.  This defect occurs upon start-up, and lasts for the first 15 minutes of trying to view a program. Then the picture gets progressively worse over time and continuously declines.I tried SAMSUNG's Executive Customer Relations Dept. and was told:  \"We will do nothing but refer you to a local Authorized Repair Shop.\"  They were downright blunt and rude to boot!  I feel robbed of $2,900.00The repair will consist of a diagnosis visit, and then another visit to install a replacement \"Panel\" that costs $1,300.00 for the part plus $279.00 to install, plus taxes......all told, another $1,719.16....basically, buy another TV.SAMSUNG customer service also told me that their Televisions depreciate at 20% per year, and they do not repair any of their products after 4 years!  Their own repair people told me to just buy a new set!!!If I save one family the heartache of losing they're hard-earned money, I'll be happy!SAMSUNG CONS:No Customer SupportSystemic Panel DefectGhosting of imagesBurn-in on screenDistorted pictureVery expensive to repair", "Date": "November 29, 2013"}, {"Title": "exelente", "Author": "gabriel", "ReviewID": "R298M8I44ZE71S", "Overall": "5.0", "Content": "I love my led is the best and even more since I arrived on time and in perfect condition is excellent, my parents also loved this samsung led and are waiting for a good deal in the same company to buy it from the 7500 or 8000 ledare the best and likewise the seller", "Date": "April 21, 2013"}, {"Title": "OK, But", "Author": "DBrown", "ReviewID": "RKKGDOXCXVAGO", "Overall": "3.0", "Content": "The TV arrived and was unpacked by the shipper.  He plugged it in and confirmed that it worked with the remote.  I asked him to mount it on the included stand, but he said he was not allowed to do that.  He left, taking the packaging with him, as I requested.  When I went to mount the TV on the included stand, I found I was missing the mounting bracket.  I called the shipper right away.  They contacted the driver who searched the packaging thoroughly and found no mounting bracket.  I contacted Amazon who put me in touch with Samsung.  Samsung will ship me the missing bracket at no cost to me.  Problem is, I wont receive it for at least a week.  I contacted Amazon again to get a replacement and was told that they would ship me a replacement, but I wouldn't get it for at least a week.  When I asked about the 2-day shipping promise, I was told that it didn't apply to replacements.Here I am with my brand new TV, arrived two days after I ordered it, and I can't use it for at least another week - probably longer.", "Date": "August 24, 2012"}, {"Title": "Junk", "Author": "Mike", "ReviewID": "R24T1KAXWH9JCS", "Overall": "1.0", "Content": "Not worth the price, fancy features that do not work. Can not even buy key board that should have been included in $2,600 price tag. Terrible service on many many many problems . Voice feature that comes on from tv noise, junk.Wish that I could return., would have done if purchased local.", "Date": "April 29, 2012"}, {"Title": "Broken on arrival", "Author": "PBusselle", "ReviewID": "RYCP1HBQGVLS1", "Overall": "1.0", "Content": "received unit.  put mount on, put on wall turned on,  picture screen is broken internally, no picture,,,, that was a waste of time", "Date": "June 25, 2013"}, {"Title": "disapointed badly", "Author": "great game", "ReviewID": "R2BZ8AXLOXVD4W", "Overall": "4.0", "Content": "this is a wounderful samsung led-lcd 3d tv.i love it , but one thing that i am dispointed about. is my gift card .i didnt know you have to add the card and the tv both to your cart for you to get the deal my tv was shipped .so i called amazon and was told that the only way i could get the gift card is to return the tv and re-order both. that i find that ridiculous.the gift card should be  automatically added to your cart.so this means i wont be getting the gift card.i hope amazon look into this and mail me my card.", "Date": "October 1, 2012"}, {"Title": "Pending Official Review/Evaluation", "Author": "LRStyle", "ReviewID": "R3AZ0OP7EPXO9I", "Overall": "5.0", "Content": "I've done much research on this product in comparison to many similar models and brands.  Initially I was going to go with the 6500, 120hz model, but a few additional things caught my eye mainly the smart touch remote, 4 (opposed to 2) 3d glasses, built in camera, and smart interaction feature.Though I see a mixed bag of ratings and comments about this product, I'm hopeful that I'm one of the lucky ones.  With that said, Today I've placed my order and requested a future deliver of June 30th.  That means that I will be posting a review a day or two after receiving the product (if it arrives on time), and a month after putting it through the test to see what its really made of.", "Date": "June 14, 2012"}, {"Title": "poor product by samsung", "Author": "prakash patel", "ReviewID": "RGWWSQPJA4P5I", "Overall": "1.0", "Content": "very very poor product, i called samsung for problem then after one week they came to fix itthey fix it but next day it gives me the same problem, again i called samsung for repair they can not come for one weekfinally i called amazon for return and they took it back for partial refundplease note within 45 days time i am returning this product", "Date": "February 27, 2013"}, {"Title": "Interested to buy this TV", "Author": "Amazon Customer", "ReviewID": "R287ZFIO3ZDDNC", "Overall": "4.0", "Content": "Can any buyer please confirm if this TV can support 110-240V. I'm interested to buy this TV and at some point would like to take it to Europe.", "Date": "May 10, 2012"}], "ProductInfo": {"Price": "$1,598.99", "Features": "Smart TV with Smart Interaction\nSmart Content with Signature Services\nBuilt-in Wi-Fi and Camera\nFull HD 2D and 3D\nThin LED Design: TV with stand (Width x Height x Depth): 48.8-Inch x 31.1-Inch x 10.9-Inch, TV without stand (Width x Height x Depth): 48.8-Inch x 28.7-Inch x 1.2-Inch", "Name": "Samsung UN55ES7500 55-Inch 1080p 240Hz 3D Slim LED HDTV (Black) (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/51enmZOFYoL._SX300_.jpg", "ProductID": "B0077QVOV4"}}