{"Reviews": [{"Title": "Remember what you're paying for it.", "Author": "Josh", "ReviewID": "RUSQ4J1N1DPLM", "Overall": "4.0", "Content": "After 15 years of our big-box rear-projection TV, we made the jump to HD and bought this at a big box store for $399.Good:-Picture, during day hours-Price-ConnectionsBad-Backlight bleed - there's a lot. It's not a huge deal to me, but be aware of it - some people can't stand any of it. Other Coby TVs have had the issue as well.-Horrible built in sound quality, but that's expected. I hooked up my system.Overall, it's not a bad deal. I'm not sure I'd pay what Amazon is asking, but if you can find it on sale somewhere, it could be decent deal on a TV.", "Date": "December 27, 2012"}, {"Title": "Great price but some backlight edge bleed", "Author": "Powerzzzz \"Powerzzzz\"", "ReviewID": "RCP7AMQK38S4", "Overall": "3.0", "Content": "I got a great deal on this tv at $400 at a local store. But right from the begining I noticed the backlight was bleeding on the top right and lower right corners of the screen. While watch full screen tv its not very noticable unless it's a very dark scene. But watching a dvd with the black bars on the top and bottom you can see it all the time. Which has bothered me from day one.I emailed Coby customer service the day after I bought it, AND Coby technical service a couple days later, and have yet to hear back from them. Its been almost a full week now with no returned emails, guess I'll have to call Coby. Which I hate, because I have to set aside time in my day to wait on hold.The speakers do suck but I have surround sound and try not to use the tv speakers anyways.I've got the picture set up pretty nice and if it wasn't for the backlight bleed, I'd give it 5 stars.I'll update my review as I hear back from Coby.", "Date": "February 23, 2013"}, {"Title": "Great value for money; missing some refinements", "Author": "Andy", "ReviewID": "R1AC9TBM3W53WC", "Overall": "4.0", "Content": "Picked up one of these at a Black Friday sale for $400, which I figured was worth the risk. I've had a few Coby products before (DVD players) that were also a great value and lasted forever. In the few days I've had this, it's definitely a great value.The picture is great, although the color had to be adjusted a bit (standard settings seemed to produce a reddish hue) and any complaints would be mitigated by the price. These include poor speakers (as noted previously), slow reacting remote (which you'll probably change anyhow), very cheap plastics (you can see internal clip and screw locations), and missing electronic niceties like sound suppression when turning off TV (loud pop through audio) and limited component connections (3 HDMI inputs, one composite, one 3.5mm audio and one SPDIF coax (not optical)).So, we'll see how long it lasts, but right now, it's a great picture for a great price. If you can get it for $200 less than a name brand, it's worth it.", "Date": "November 27, 2012"}, {"Title": "Shocking Value", "Author": "P. E. Raney", "ReviewID": "R3VDEQEM8TTVRC", "Overall": "4.0", "Content": "great TV. It doesn't have as many inputs and outputs as our old one but with 3 HDMI inputs, it is perfect for us.", "Date": "December 24, 2012"}, {"Title": "GREAT TV at a great price", "Author": "Jorge Garibay", "ReviewID": "RZPCM0HWIUN24", "Overall": "4.0", "Content": "I bought this TV locally for half the price I see online. FIRST, it's by no means a match for top of the line brands, but it's a darn good tv for the money. colors are vibrant and blacks are not bluish as in other cheap panels, some uneven edge lighting but no worse than some more expensive brands, blacks are actually pretty good, SD channels look worse than my LG LED tv, but I can't see any major flaws with this tv. it's your basic very slim (less than 2\" deep) makes a heck of a nice PC monitor and gaming display with by the way, accepts 1920x1080 thru VGA input, a big plus for me. MAJOR PLUS...it uses a very nice IPS or MVA panel, NOT the cheap TN panel, viewing angles are 178 Horizontal and 178 Vertical, it doesn't mention it in the specs but I have it in front of me and image doesn't get washed out at any angle. if you live near a FRYS go check it out in person before buying. you won't believe the price.....NOW, I don't know how long it will last, didn't get extended warranty, so we'll see I guess", "Date": "December 4, 2012"}, {"Title": "Good Picture but buy some external speakers", "Author": "Thomas Waldrop", "ReviewID": "RJOYQOMTEMNGN", "Overall": "4.0", "Content": "I have had this tv for 2 weeks and have been impressed with the picture and quality so far.  Feel like the price was right for less than $600, which is less than I paid for my 37\" LCD 5 years ago.  This is my first LED tv purchase so I don't have much of a comparison against other LED screens.  The tv menu and functionality is pretty basic.  The speakers are pretty much worthless so you better invest in some sort of soundbar or surround system to go with.  Vizio has an amazing soundbar on the market with a wireless subwoofer that I'm loving so far.Overall, it's a really good LED picture for the money, not quite a Samsung, but not quite the expensive price tag either.", "Date": "November 21, 2012"}, {"Title": "Coby LEDTV5028", "Author": "Teacher Mom", "ReviewID": "R2NORAY29PTCA8", "Overall": "4.0", "Content": "Overall pleased with the Coby LEDTV5028. Comes out of the box with overscan enabled, also contrast and color saturation are set way too high. Once I adjusted the picture, the video quality was good. Sound is sub-par as others have mentioned. Great value.", "Date": "February 2, 2013"}, {"Title": "A silent killer", "Author": "Sam", "ReviewID": "R1LFN7QXSAB45Z", "Overall": "4.0", "Content": "Got this tv on a black Friday sale from Fry's at a screaming deal of $397.00. I knew Coby make very reliable products in affordable price ranges but not sure about this 60Hz TV until I watched it. With a marvelous native contrast ratio, pixel-to-pixel scan option, and 6.5ms response rate it can easily beat any brand name in terms of picture qualities. A very decent operational menu without cumbersome  options provide easy-to-use user experience.", "Date": "December 6, 2012"}, {"Title": "Very good television for the price", "Author": "pcayers", "ReviewID": "R20EN8NE7RYHGY", "Overall": "4.0", "Content": "We have had this television for several months and are very pleased with it. It has 3 HDMI inputs, but only one AV input. There is one very small area in a corner that is missing some pixels, but otherwise it is a fantastic picture.", "Date": "December 6, 2012"}, {"Title": "Good TV with good price", "Author": "Yan Gao", "ReviewID": "RU0OHP2LD2VFV", "Overall": "5.0", "Content": "Got it on Black Friday. So far, love it. Pictures are good, especially watch 1080i or 1080p programs. Dual TV tuner which I definitely need for my satellite provides analog signals while cable provides digital. Having given 5 stars, I'll focus on what are not so perfect,Plain design - it's a 1080p LED, nothing more. That is, if you are looking for fancy looking or trim, you'd be disappointed. However, I'd like to add that ultra slim design is really a plus.Sound is not so perfect - for non-professional no difference, but definitely not for orchestra music - LED TV a high end product, but sound of this TV is not. I accept it because it's so thin - it'd be very difficult to make high quality built-in speakers.I also concur other minor complains - such as slow remote.", "Date": "December 8, 2012"}, {"Title": "perfect!!!!", "Author": "stephanie", "ReviewID": "R3DCJYE3QEU7XH", "Overall": "5.0", "Content": "i can't vouch for others but this was the best purchase ever... Perfect!  everything is great i recommend to anyone", "Date": "May 1, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "50 inch -widescreen-LED-HDTV\nEnjoy video in stunning high resolution-1080p\nAttractive super slim profile fits anywhere\nBuilt-in digital TV tuner (ATSC/NTSC/QAM)\nConnect up to three HDMI devices simultaneously", "Name": "Coby LEDTV5028 50-Inch 1080p 60Hz LED HDTV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/513Ax9ECAYL._SY300_.jpg", "ProductID": "B007BGELWY"}}