{"Reviews": [{"Title": "Great tv", "Author": "Kerry White", "ReviewID": "REYTJ5ACD9R65", "Overall": "5.0", "Content": "This is a great tv -- lightweight, nice picture, tons of features, has surprisingly nice sound, and is exactly what I was looking for.  I checked it out at Best Buy first, but you can't beat Amazon because delivery was free and faster.  We have a 42\" LCD smart tv in another room and its amazing how much more natural and crisp the picture is with the LED.  It took 5 minutes to set it up, and it has a great swivel stand.  Overall, I am really happy with this purchase.", "Date": "April 7, 2012"}, {"Title": "Good TV with some flaw", "Author": "L2012", "ReviewID": "R24EVWX53190ZT", "Overall": "3.0", "Content": "The model I have is the UN46ES6100, this TV itself is great; the picture quality and smart feature is very nice.The big downside is with its web browsing or anything that involve typing.  Since it came with only a regular remote and every time you want to type something like say your 10letter password you have use the up/down/right/left and select key for each of the letter. As well as trying to move the mouse pointer with the remote is so ridiculous  the amount of time you have to press for it to move barely.  Along with this there wasn't any postcard for a better remote like other people have mention, since we bought two and either of them have it.The good new is that it is compatible with some wireless mouse and keyboard.  The bad part is that none of its documentation list what it is compatible with, and nothing can be found on its website.They offer a App for apple and android, BUT right now the apple version doesn't really work (so many people are having issue of it keep saying \"Disconnected...Network Connection Failure\" they haven't update it since fall of 2011.  As for the Android version of it is actually working but trying to move the cursor on a web page is a real pain and effort to even move it a little as well as a full keyboard is not accessible anywhere.  It is supposedly pop up when you need to type but haven't had work yet.Overall the picture quality and sound of this for the price is awesome.  Not to mention some of their app like Netflix, Allshare and other that you could download.  The setup of it to the internet through lan or wifi was really really easy.The Main downfall of this device is that for a smart tv, it just really suck that you can't make full use of it due to the lacking of a proper input tool (like a keyboard or a better remote with a full keyboard)", "Date": "April 3, 2012"}, {"Title": "Picture is great, software and network sucks", "Author": "K. Williams", "ReviewID": "RTNM9NH2CZ86K", "Overall": "3.0", "Content": "The picture is awesome. The TV is nice and thin. The Samsung Smart Hub software pretty much sucks. It's slow. Buggy. Loses the DLNA connection frequently. Even when it is still connected, it pretends it's not connected -- it will tell you there is no device connected, but if you pull up the previously viewed items on the network you can browse and watch those. Just can't browse the network. Doesn't play all video filetypes, even though it recognizes them. When you try to play one, it will disconnect itself from the DLNA connection. I'm thoroughly annoyed with all these devices that they build extra features on and then don't clearly put any bug testing into them. Way to go Samsung. Next up on the pet peeve list is the Smart Hub is filled with spam. Yes, permanent spam that you can't remove. Don't subscribe to Netflix? Too bad, their icon is always front and center and among the biggest. Don't subscribe to Hulu, Pandora, etc. etc.? Same thing...It's like having a PC where the desktop comes with all those bloatware shortcuts, except in this case the \"PC\" (the TV) won't let you delete them. You just get to have your menu cluttered up with crap you'll never use. That's the absolute -worst- kind of design and UI interface philosophy ever. Now, I'm pretty down on this aspect of the TV because I'm really annoyed by half-baked software that isn't designed at all with a user perspective in mind. I'm sure if you subscribe to all these services, you're fine with it. But it's pretty poor that you can't even move or delete the icons out of the way if you don't want them. There are a few nice features in the Smart Hub, but overall even when you stream videos it seems pretty laggy. Getting a dedicated piece of equipment (roku) to handle the network/streaming is the way to go.Ok, after bashing the TV software, I'm going to praise the picture. Very crisp and smooth movements. The TV is very thin and pretty light weight. The power cord placement in the back proved to be a pretty big pain since it's a thin TV. I did cut a hole in my wall and install a cable gang box, but the right angle on the cord wouldn't fit. So word to the wise... if you are cutting holes in the wall and installing gang boxes, for the TV, make sure you get a double gang box so it will be wide enough. A single gang box will bind the cord up on the wall and stick the TV far off the wall (if you're using the Samsung slim mount).If you don't care about the TV software get this. If you're buying this so you can have the great picture and the software don't get this unless you plan on buying a Roku box as well (it's what I did). Annoying that I'm paying extra for the software/network features and not using them because they pretty much suck.", "Date": "May 2, 2012"}, {"Title": "Samsung light years ahead of the competion!", "Author": "D. Neal", "ReviewID": "RUFU9M4D3D2PG", "Overall": "5.0", "Content": "I just brought this tv yesterday after 4+ hours in Bestbuy comparing it agaisnt LG's, Sony's and Panasonics. I found that the picture clarity surpassed tv's that costed hundreds of dollars more. But when I got it home is when this baby began to really shine! Set up was easy and once the tv updated it was ready to go. I logged on to Youtube and watched a few videos as though I owned the DVD of them! I knew if this thing looked that good watching Youtube videos I was going to be in for a pleasant surprise when I hooked up my Xbox and began gaming! Well let me tell you....I SAW THINGS IN GAMES I OWNED FOR A YEAR THAT I NEVER SAW BEFORE! The picture was sharp with deep vivid colors like I never saw before. I played my Xbox for about 30 mins and couldnt take it any longer. I had to see what Blu-ray would look like! So I went downstairs to my basement (man cave) and took my Blu-ray player from my 61 inch Samsung 1080p DLP tv. Well let me tell you, I put on Clash of the Titans and I almost had an orgasam!!!!!!!!! The damn movie was so clear it looked like a LIVE PLAY! The parts where water was involved I had to check my screen to make sure it wasnt wet....thats how life like it looked!Bottom line is if you want a tv that looks awesome yet doubles as a computer then this is what you are looking for!", "Date": "May 26, 2012"}, {"Title": "Great TV", "Author": "M. Elterman", "ReviewID": "R1IBXAWR6FHMG4", "Overall": "5.0", "Content": "NOTE: This is the review for the 40\" model.This is a great tv. Superb picture quality, great blacks and color after calibrating. Supports a bunch of important settings including xvyCC (full color range mode), and 1:1 Pixel Resolution (called \"Screen Fit\" in the settings.Unlike some other reviews complaining about spacing between the mount holes and power connector, I had no problems mounting the TV on my wall with my Sanus wall mount.I do not use the Smart TV features as I already have an Xbox 360 for all that, so I cannot comment on those much. I tested netflix as well as playing movies from my PC, both worked perfectly.The sound coming from the TV is just ok, not as good as fat LCD TVs for obvious reasons. However the sound is not bad at all and for most people it is fine. You can adjust sound settings including equalizer if you wish.A note on input lag: I measure the input lag on this TV to ~30ms with Game Mode enabled. A very good result for an LED TV. With input lag at 30ms game play feels very responsive and fluid.All in all this TV is well worth the money. This TV uses the exact same panel (the screen itself) as the ES6500 and even the ES8000 series - the TS01 panel. The differences lie in the software and video processor hardware between these series. This means that while you do not have access to the features available in the more expensive models, the picture quality should be very similar across the board. A very good value.", "Date": "June 8, 2012"}, {"Title": "Not ready for prime time.", "Author": "Brother Ray", "ReviewID": "R3R65XP4SUKADM", "Overall": "1.0", "Content": "Well, the picture is beautiful. The design: thin and sleek. Black is black.BUT the wireless connection failed to launch. Samsung was unable to help. I spent at least three hours on the phone and online over two weeks. I got nowhere. I'm not a geek, but I am technologically literate.  Samsung says it is Comcast's fault and I should contact them! My IPad, IPhone and Mac had no trouble connecting to this Netgear 802.11N router. Then Samsungs call center told me I have too many wireless devices! I turned them off. Same result. Sending this TV back. Goodbye great picture!UPDATE: I bought and connected Apple TV to another Samsung TV. No problem. So, since the picture was soooo good on the 6100 I returned, I bought another one. The second one had no trouble connecting and streaming. Perhaps the first TV's software was buggy. The second is working fine.", "Date": "April 17, 2012"}, {"Title": "Versatile Entertainment/Media Center with all codecs. Avoid Allshare.", "Author": "TGav", "ReviewID": "R2A0H8JGGFTST1", "Overall": "5.0", "Content": "Review is from the perspective as an entertainment center for streaming standard and HD content.Bought the 40\" model for an upstairs bedroom. As a basic TV this set is superb. Perhaps not the top of what's out there, but for a secondary TV it does its job elegantly.Used for:  cable TV, streaming audio, streaming video on-line and from media server. No other input device/player used.First, the wi-fi on this set is built in. I have another Samsung 32\" older model that needed the separate proprietary USB wifi adaptor which fit in perpendicular to the back making a tight on wall mount impossible without an extender.I stream from a downstairs room ( Apple AirPort router). Signal remains strong without dropouts streaming smoothly 720p AND most 1080p content - it can't do 16:9 1080p wireless stream, same as with all devices, but it does 2.35:1.I advise against using Allshare as a media server due to many limitations although it is free. For me, the deal breaker was that it doesn't accept content from a CD or DVD to place in its library, so archived photos or videos will not be available to stream. After trying many free and demo alternatives, the one that runs perfectly is Mezzmo ($30), very highly recommended.That Samsung has decided to include Amazon Prime Video is welcome. The older generation of their TVs do not.Needless to say, streaming on line content (Hulu, Pandora etc) is flawless.Next, this set is able to handle most standard CODECS out there including flac and vorbis! I cannot overemphasize the advantage of this versatility if you want the TV to function as a multimedia center. Sure it has limitations, such as the lack of .wav support and won't allow flac audio from an .mkv container. However, it's the only TV brand I found that does DTS(!!!!) audio from . mkv which is a big plus.SUBTITLE handling in mkv containers has improved greatly over previous models. It automatically decodes .srt, .ass, and vobsub formats. Before, one needed to extract the subtitles from mvk in order for the TV to see them. Worse, it only read .srt so any other format needed to be converted. This is a huge advantage for people like myself who are unable to obtain esoteric and US unavailable anime except in mkv.The bottom mounted built in speakers do a good job. Option for digital audio out is a plus, but haven't tested that yet. The available apps are mostly junk except for a few. Your taste may vary.I really wish it could zoom on HD signals like my Oppo BR player. As such, 2.35:1 aspect cannot be zoomed to 16:9 without that annoying stretch artifact.In conclusion, this TV is versatile enough with fantastic picture and sound qualities, loaded with codecs, excellent wifi connectivity to make it a perfect multimedia center for the serious geek without the need to buy some external box. I cannot think of a better set at this price level to include all these technical features without the need for some separate device.", "Date": "December 4, 2012"}, {"Title": "Samsung UN40ES6100 Has Quality Control Problem", "Author": "Zhizheng Chen", "ReviewID": "R1ZO5GIQO7DW23", "Overall": "3.0", "Content": "1.  I like its design. The picture quality is good. Internet connection is easy. Another reason I bought this model is its size fits my place perfectly. However, after one week of enjoyment watching my new TV, a group of quite serious Bright/Dark strips start to flash around the left upper part of the screen. Then everytime after the TV warmed up (about 15-20 minutes of playing) the Bright/Dark strips showed up. I asked amazon for an exchange. I got the second brand new set very quickly. This time, the new set immediately showed a one-inch wide, not-so-obvious brighter (or lighter) vertical edge on the very right of the screen. It will not bother the whole picture but it makes me very uncomfortable. I do not want to make more exchange and decide to keep this one. As a customer, if you go to a store to see the TV demo models and you find one that showes a brighter border (inconsistent with the whole screen), are you willing to buy?2.  Samsung Service. After I found the 'flashing strips', I immediately called Samsung Customer Service (SCS). After I described the syndrom, SCS asked me to contact a service center in Denver (about 1 - 1.5 hour driving). After I contact with the Service Center (SC), they asked me to wait for their call in 24 hours and make an appointment (in order for me to drive to the SC to deliver the set for their service). However, they never called.", "Date": "August 28, 2012"}, {"Title": "Excellent TV w/ Options", "Author": "FrustratedCatOwner", "ReviewID": "R2ORJJQJ5OEZ5J", "Overall": "4.0", "Content": "This television offers a great combination of features and quality, but there are a couple of things that most certainly could be better.- Picture Quality: 5 stars. Feed a high quality signal to the set and the picture is bright, crisp, colorful, and smooth.- Sound Quality: 3 stars. The super slim design requires that the speakers be exceptionally small and positioned so that they don't fire forward. This detracts from the sound quality and makes it \"just ok\" for use in larger rooms (mine is in a large kitchen). The sound reflects heavily off of the wall behind the set, so wall mounting is the best, and I would not recommend using a full-motion mount (use a fixed or tilt mount only to keep the reflective qualities for the sound consistent).- Network connectivity: 4 stars. The wireless setup works well, but the wired connection is definitely better. Either way gets you connected in a reasonable amount of time, but entering WEP keys using the on-screen keyboard is cumbersome.- Available Applications: 2 stars. There are a few applications that many would find very useful, but the list is quite short. I appreciate having items like Pandora, but why not iHeartRadio too? It's also very misleading that you are able to access applications that say \"free\", but they are paid services. Hulu Plus is a perfect example - the app is free, but the service costs money.- DLNA / UPnP Support: 1 star. This is the absolute biggest disappointment for me in this set. They specifically call out DLNA support, but fail to tell you that you MUST use *THEIR* software on a PC. I have a very large media server setup using a standard UPnP software package, but I can not access ANY of that content with this television. This means that all of my family photos and videos can not be played back on this set. DLNA is an industry standard. If a company supports the standard, there is no requirement to use specific software (thus, the definition of a standard). I will be looking for ways to circumvent this.All things considered, it's a very good set. The primary use is watching broadcast shows, so that gets the most \"weight\" of the different ratings I used. So, graded on the curve, it gets a four star rating from me.", "Date": "May 31, 2012"}, {"Title": "Great UI but the LED lighting was not right", "Author": "Aurora", "ReviewID": "R2QQCGGKW88I8I", "Overall": "2.0", "Content": "The user interface on the TV was great and it was easy to setup. The available apps to download were also plentiful and contained some of the most popular (Pandora, Netflix, etc.). However, the set itself the LED lighting was not consistent and uniform across the screen. The edges were much brighter leading to colors being washed out on the sides. Television shows and movies that were shot at night - the edges of the screen were much brighter which took away from what was being watched in these darker scenes. Also, some of the lighting in the center of the screen was off leading to blotchy patterns on the screen when it would scenes fade to black - it was too noticeable to ignore for the price of the set so it was returned.", "Date": "April 13, 2012"}, {"Title": "Amazing TV", "Author": "Jessie M", "ReviewID": "R2BKKO7UJRPP58", "Overall": "5.0", "Content": "This is a fantastic LED TV.  The HD picture is stunning.  The tv was so easy to set up and is so slim it works great hanging on a wall or on a stand.  I am really liking the smart tv capabilities.  This is the best TV I have ever owned.  I would recommend it to anyone.", "Date": "May 23, 2012"}, {"Title": "Excellent Performer", "Author": "Electronica", "ReviewID": "R2AQV7HMN4FR5Y", "Overall": "5.0", "Content": "Bought this for my parents to replace an old CRT.  They're impressed because it's new to them, but when I went home to visit I was impressed.  I have a Samsung 50\" plasma at home and this LED picture quality is comparable.  I played around with Netflix streaming with the built in Wi-Fi and seemed to work well.  Good price for a high-quality picture.", "Date": "December 16, 2012"}, {"Title": "Two minor defects in a row", "Author": "beema", "ReviewID": "R2FSYAQV12ISTQ", "Overall": "3.0", "Content": "I'm not sure if Amazon and UPS are at fault here or not, but I have received two of these now and they both have had irritating minor defects.The first one I ordered had a noticeable crack in the frame around the TV on the bottom-left corner. I contacted Amazon and had it replaced. Now the replacement also has something off with it: the TV is slightly tilted to one side. There's about a 1/4\" difference in height from the right side to the left side. I'm thinking the TV stand or stand mounting bracket on the back is off. I know it's a minor issue, but when you buy a brand new expensive TV, you want everything to be right! Now this is annoying me to no end and I'm wondering if I should send this one back as well... urghhhhhhhhhh >:(Other than that, the TV itself is gorgeous and works fine. I would love it if not for these little issues. Do I just have terrible luck?", "Date": "June 8, 2012"}, {"Title": "Great TV", "Author": "Davey", "ReviewID": "R247HJZNJXXW9B", "Overall": "4.0", "Content": "This LED TV is GREAT! for the price. It is super thin and very elegant in design. The picture quality is outstanding, I have been watching sports on it and it's unbelievable. The reason I gave it a 4 out of 5 stars is the remote. It is pretty much useless when it comes to navigating the web or typing anything at all. It takes for ever to direct four arrows to guide the cursor either up and down or side to side. I am ordering the Logitech K400 wirless USB keyboard to take full advantage of this Smart TV.", "Date": "June 23, 2012"}, {"Title": "Excellent TV", "Author": "Bankie", "ReviewID": "R35DDERPWK7O5K", "Overall": "4.0", "Content": "...that said, it sucks as a computer which is what blows my mind about many of the reviews here.This is a tv... not a computer.I can appreciate the fact that Samsung did build a browser into it but I can't think of any real reason to use it.  I tried viewing Korean TV at viki and, because of the site's coding, the tv locked up once and needed a reboot.  In all, the browser user experience was pretty poor.I used a logitech solar wireless keyboard and another logitech wireless gaming mouse and I had no compatibility problems.  Obviously, special function keys don't work but you need to install drivers for them to work on your PC, too.  In other words, they worked perfectly.The site I was visiting for TV streaming has an app so I downloaded the app and I've been watching flawlessly since.  Every site I'd watch TV on has an app either pre-installed or available in the app section.  Too simple.This was a great buy!", "Date": "June 9, 2012"}, {"Title": "It is simply the best TV I have ever seen for under $1000", "Author": "John Perlingiero", "ReviewID": "R34Y886PVI6M8P", "Overall": "5.0", "Content": "I will start by saying that I did not buy this TV for the \"smart\" features. I have an iPhone and a laptop.. I don't need my TV to play youtube for me.That aside, this TV is absolutely amazing. I just moved into a dorm (I'm in the AirForce) and so the 40\" suited me perfectly. I bought the TV purely based on the recommendations for how it looked. Honestly, that should be the only factor in buying a TV - its looks.. & this TV delivers.I use the TV with Blu-Ray and the movies are amazing. I was tired of the grainy appearance with my other TV and the Samsung is perfect for showing both bright and dark colors.As a hockey fan, I also love the 240hz refresh rate coupled with the fact-action sports setting on the TV. It shows the puck flawlessly.Sound is about average on this TV but these days most people use surround sound anyways,Honestly, I can't recommend this TV enough. It will be the only TV I ever buy (I'll need a bigger one when I get my own house) and my friends love it. Every time I have new friends over for a movie someone makes a comment like \"this movie doesn't look like this on my tv.. how much was this?\"I don't typically write reviews but I felt strongly enough about this TV that if it can sway even one person to buy it then I know it was worth it. Summary: don't buy it for the \"smart\" features, that's what your phone is for; don't buy it for the sound, that's why you have surround sound; buy it for the looks, that's really all it comes down to.", "Date": "May 19, 2013"}, {"Title": "Review by a techo dummy", "Author": "Linda Moscarella", "ReviewID": "R2UI7ZVNX1GYYR", "Overall": "5.0", "Content": "I don't watch a lot of TV, and bought this mostly to better enjoy tennis grand slams.  I'm waiting for the French!  But it is such an improvement over my small, non-HD flat screen, that I am thrilled.  Everything looks twice as good, at least.  One of these days I'll figure out how to do all the great stuff I can do with this terrific toy.", "Date": "May 15, 2013"}, {"Title": "Great TV", "Author": "tm", "ReviewID": "R3FSBIFGM6GGUM", "Overall": "5.0", "Content": "I bought this as a gift for my son.  He loves all the features on this samsung, as he can use his phone as a remote", "Date": "May 15, 2013"}, {"Title": "Good TV for the price", "Author": "vc431", "ReviewID": "R1DSI8J9G08K21", "Overall": "5.0", "Content": "I bought this TV on sale, Amazon got the best price. First one I received was damaged, has a shadow on the upper left corner 10\"x10\" big. I return it right away, second one I received is good. Pictures are so clear and vivid. I bought this more expensive TV for the internet feature, very useful.", "Date": "April 28, 2013"}, {"Title": "Great picture and love the apps available with the web tv.", "Author": "Gator Mark \"Gator\"", "ReviewID": "RILTE4ESMX2YD", "Overall": "4.0", "Content": "I purchased the TV for my bedroom and have been pleasantly surprised with it.  The tv picture is great and the screen makes it look clear and better than real life.  I'm glad I went with the smart tv option as the samsung store has some great apps like Pandora, Netflix, Amazon Cloud, and many others.  I definitely prefer this over the apple tv, which seems very restrictive on the apps you can use.  After downloading and playing with apps, I only wish it had a little larger memory as I can see this being something restrictive in the future.", "Date": "April 21, 2013"}, {"Title": "I love it", "Author": "Guillermo Roman", "ReviewID": "R3SQVONZMBEHGR", "Overall": "4.0", "Content": "I love this TV. It comes with the latest standards for wireles network and I can connect with NetFlix without a hard work. Also I like the easy way to pass my Samsung Galaxy SIII stuff to my TV.I simply love this stuff :)", "Date": "April 20, 2013"}, {"Title": "Picture Perfect", "Author": "monty3441", "ReviewID": "RSUMHS6JXQ6PG", "Overall": "5.0", "Content": "This TV delivers everything that you'd expect from a great Samsung TV.Its extremely lightweight, has a crystal clear picture, and the smart TV features eliminate the need for a Roku Box or other outside source.It also works great as a second computer monitor.Highly recommended.", "Date": "April 20, 2013"}, {"Title": "Exceeded expectations by a mile!", "Author": "Richard Brown", "ReviewID": "R1JVP0OB5P0HKU", "Overall": "5.0", "Content": "I had a 7 year old Samsung LCD TV, in my bedroom, that did not have a good picture. My main TV is plasma because of superior picture (color and motion). If you are in the same camp, read on. When my bedroom TV gave up the ghost recently, I started to research other TVs.  I knew there are only 3 major LCD panel makers, and really don't know whose panel you're getting in the brand TV you are buying. The real difference is in processing, features, and quality. For LCD TVs, Samsung, Sharp, and Sony are the best (IMHO). Looking at features and price, I decided to go with this Samsung ES6100 40\" LED TV.Let's cut to the chase. The HD picture is extremely crisp, sharp and clean. The color rendition is very good. Flesh tones are excellent. Reds are true (which is a problem with many LCDs). The only minor complaint about color is that some pinks (especially on comercials) pop out really bright. Samsung has really hit a homerun with this TV. My plasma TV is no longer my favorite.", "Date": "April 19, 2013"}, {"Title": "Great tv, beware Amazon Warehouse Deals", "Author": "MissyM", "ReviewID": "R3PI07K7VF164V", "Overall": "5.0", "Content": "This tv is beautiful, and I'm very happy with the picture quality and extremely slim design, and ease to setup.HOWEVER - beware purchasing from Amazon Warehouse Deals, even \"like new\". Mine was supposedly in like new condition, it arrived with no protection on one side of the tv, and significant damage to the plastic casing at the front and large scratches on the back, which will affect it's resale value if I ever move (and annoy me every time I look at the broken plastic on the front). It's probably worth shelling out the extra couple of hundred bucks to get a new TV. I'm pretty sure at least the damage to the plastic casing was a result of poor packaging. I have been emailing and on the phone with Amazon trying to get a discount (update: they gave me a 20% discount, which was nice!), but it's still disappointing to have to see the broken plastic every day. That plus the amount of time wrangling a refund basically means I should have bought a new tv in the first place :(", "Date": "April 19, 2013"}, {"Title": "Save yoyr money. Don't buy Smart TV", "Author": "DD \"DD\"", "ReviewID": "RM7YUU3206EH0", "Overall": "2.0", "Content": "I have owned this TV for about a month now. The TV is great! The Smart HUB is awful! The web browser is poor beyond description. Links within a site won't load, the entire Smart Hub decided to crash one day and then came back 2 days later! Netflix crashes and makes me sign on again with the remote which really sucks.I no longer use the Smart Hub for anything. I use my Roku player for Netflix.Save your money and buy a Samsung TV w/o the Smart Hub.Nice picture.", "Date": "December 22, 2012"}, {"Title": "Samsung LED TV", "Author": "Ron", "ReviewID": "RNVL479OQS66Z", "Overall": "5.0", "Content": "This is an incredible TV and I got it at a really good price. The Samsung UN40ES6100 40-Inch 1080p 120Hz Slim LED HDTV (Black) has proven to be worth the money.", "Date": "August 6, 2012"}, {"Title": "very satisfied", "Author": "spunky", "ReviewID": "RJ8C24H64QA5W", "Overall": "5.0", "Content": "When my 4 year old 37\" HD TV picture went blank I decided to review all TVs needing one that would fit inside my entertainment center. This 40\" Samsung had great reviews and would fit. The TV arrived quickly and was easy to setup. I am very happy with the picture quality and the Smart TV features including WiFi.", "Date": "June 11, 2012"}, {"Title": "Default Samsung 6100-series picture quality settings are pretty awful.", "Author": "Elvis", "ReviewID": "R5T08AGL800V1", "Overall": "4.0", "Content": "I have a lot of experience doing color correction of digital images, so FWIW, I know what bad color looks like when I see it.I just set up a Samsung UN40ES6100, and I immediately saw plenty of that.The default Samsung UN40ES6100 picture quality settings are pretty awful.The basic problem is that the default settings have too much contrast, brightness and color saturation.They produce a picture that seems  intended to \"pop\" in the store, but is actually very unrealistic, un-natural, almost cartoonish.There are many examples of this, but perhaps the best is that grass (e.g.: football field) is far too unrealistically bright glowing (almost fluorescent) green than it should be.Samsung could easily have done better.The default Picture Mode setting on the UN40ES6100 I just set up was \"Standard\" (the other three choices are  \"Dynamic,\" \"Natural\" and \"Movie\"). There are also a looooot of additional settings (especially in the Advanced Settings) that allow changes to be made to many different attributes that affect the picture color and quality. Most of which are available only if the Picture Mode is set to one of the other choices besides \"Dynamic\" or \"Natural.\"Unless you want to spend hours tweaking all those settings, I suggest changing Picture Mode to \"Dynamic\" or \"Natural\" even though that will cause the Advanced Settings to be unavailable, because it will also make fine tuning a lot simpler. One reason for this is that changes to many of the advanced settings are inter-related; changing one causes changes to other aspects of picture quality.  This can turn the process of dialing in the correct image quality using the advanced settings into a time consuming struggle. You can still to get excellent image quality with Picture Mode set to \"Dynamic\" or \"Natural.\"The \"Dynamic\" Picture Mode appears to have artificial dynamic contrast expansion on the quarter-tone to three quarter-tone range (the middle part of the contrast range, e.g.: maybe the 30%-to-70% range is expanded out to maybe 20%-to-80%), at the expense of shadow and highlight detail (e.g.: the 0%-to-30% brightness range is compressed to 0%-to-20% and the 70%-to-100% brightness range is compressed to 80%-to-100%), to make the image have a more \"punchy\" look. This dynamic aspect of this range expansion is that it appears to vary somewhat depending on the image on screen at any given time. Sometimes this causes very slight, but noticeable shifts in the image brightness. In comparison, the \"Natural\" Picture Mode doesn't appear to have this contrast adjustment, so compared to \"Dynamic\" it looks more natural, less punchy, with slightly better highlight detail and noticeably better shadow detail.In all four \"Picture Modes\" the default Picture options: \"Color Tone\" setting is \"Cool\" and I am pretty sure that is wrong for just about every situation.  Color Tone: \"Cool\" makes whites a little too blue and also introduces a greenish/bluish color cast to highlight & shadow areas that should be close to neutral (e.g.: causes a greenish color cast in men's beard stubble). Color Tone: \"Cool\" also causes grass (e.g.: football field) to be even more unrealistically bright glowing green than it should be. It should be changed to \"Standard.\" The other two choices (Warm 1 and Warm 2) are not available with Picture Mode set to \"Dynamic\" and are probably undesirable anyway, because Warm 1 and Warm 2 introduce a noticeable color cast into what should be neutral highlights (unless compensated for in white balance; an example of how changing one advanced setting affects something else).- - - - - - - - - -So the easiest way to make the Samsung UN40ES6100 look a lot better and more realistic is use either of the following settings as a starting point:Picture Mode: DynamicBacklight: 15 or less (Reduces backlight bleed-thru \"clouds.\" Lower backlight setting may require slightly higher brightness)Contrast: 70 to 80 (default is 100. Helps compensate for \"Dynamic\" Picture Mode's artificially expanded mid-tone contrast)Brightness: 35 to 40Sharpness: 35 to 45  (default is 55. Depends on personal preference; sharper picture = more noticeable sharpening artifacts)Color: 35 to 45 (closer to 35 is more natural, but some people like over-saturated colors)Tint: should be within 2 of the default 50-50 setting; e.g.: 48-52 or 52-48Picture options-> Color Tone: StandardPicture Mode: NaturalBacklight: 15 or lessContrast: 95 to 100 (definitely requires a higher setting than the \"Dynamic\" Picture Mode)Brightness: 45Sharpness: 35 to 45Color: 40 to 45Tint: should be within 2 of the default 50-50 setting; e.g.: 48-52 or 52-48Picture options-> Color Tone: StandardIn summary, either of these two setups should give a pretty good result:Set Picture Mode to Dynamic; significantly reduce backlight, contrast, brightness, sharpness & color saturation; set Color Tone to StandardorSet Picture Mode to Natural; significantly reduce backlight, brightness, sharpness & color saturation; set Color Tone to StandardAlso, the \"ECO\" settings (System->\"Eco Solution\") should be turned off, because they cause the screen routinely change brightness when it should not, with the net result being that it looks like flickering.- - - - - - - - - -These settings should get you pretty close to having an excellent - but realistic looking - picture quality, especially for Over The Air HDTV signals. I had to use slightly different settings for the HDMI signal coming from my HTPC DVR (which itself has an even more extensive set of image adjustments available in the video card software). When you throw in the adjustments that are possible on each other device that sends a signal to the TV set (which itself has independent settings for each input and signal type), it's easy to see why the overall complexity increases very quickly.If possible, I'd start with the most consistent possible source - an OTA HDTV signal, and I'd use the live local HDTV news broadcast as the guide, because they seem to have the best control over lighting in their studios and the signal is live.It is also important to note that these video quality settings are tied EACH video input and/or signal type.  This means that not only will settings made for HDMI1  *NOT* automatically apply to any the other input (i.e.: you have to repeat the adjustment process for EACH and every input), but also if you are using the antenna connection, the settings can be different for each different signal type as well (HDTV, SDTV, analog, etc.), and this also applies to aspect ratio control - which is a good thing, because it allows different picture quality and aspect ratio settings for each different signal type coming in via the same antenna connection. The settings for SmartHub/Netflix/HuluPlus, etc. are also different too, so you need to check the values for each app you use.- - - - - - - - - -After setting up the new Samsung 6100 TV set, I had to re-configure my home theater audio system. Normally, I would have used an external powered woofer/subwoofer, and let the TV's internal speakers take care of the mid-range and treble, but there's a problem in this case:The Samsung 6100 external audio output is fixed volume, which means the internal volume control does not affect the volume of the external audio output.Not only that, none of the other audio adjustments (including the 6100's equalizer, sound effects, and \"Automatic Volume\" volume leveler) are applied to the external audio output either. Since the internal speakers are wimpy, and even worse, down-firing (which makes them muffled), I had to disable them entirely and use only an external speaker system.I can't believe that Samsung did not provide a setting to make the external audio output variable with the TV's volume setting, especially considering that would be a fairly standard way for some people who don't have elaborate sound systems to improve upon the dinky internal speakers, and also considering that competing products like the Vizio M420SL provide a setting to make the external audio volume change with the TV's volume setting.", "Date": "December 25, 2012"}, {"Title": "Love it!", "Author": "M. E. Peng", "ReviewID": "R3CLDBXD9T5EW9", "Overall": "5.0", "Content": "Just want to say thanks to the other reviewers - I made my buying decision based on the strong reviews of this tv and I was a little worried.  :-)This model has all the features I consider important - Netflix, Amazon Instant Video, Pandora, and a great picture.  I doubt we'll use the web browser so its clunkiness won't bother me.I don't have anything else to add but wanted to cast my 5-star vote.", "Date": "December 4, 2012"}, {"Title": "What you should know before you buy....", "Author": "Diana", "ReviewID": "R15M48H9IHW5EN", "Overall": "2.0", "Content": "As others say: This TV gets Five stars ***** for Great picture quality and definately slim.But I could have saved $170.00 and purchased same TV with out \"Smart TV/Aps\" and just put my laptop into the TV with a HDMI.What I wish I had known:Hulu (free) can not be viewed because you can not download Adobe flashplayer.Hulo Plus does work BUT it will cost you a monthly subscription of aprox 7.00 a monthCan not watch your Amazon Prime Videos on this TV - in otherwords can not buy movies from Amazon.Blockbuster is an app but after you download this it states:  \"not available now check back in a few days\"Can not listen to SiriusXM on the TV / internet as there is not an app.Skype only works if you purchase a camera for aprox $150.00.So lesson is: only the apps available in the Samung App folder will work.....this is not like a computer and you can go to any site and view/listen.If you have more questions you can go to Samsung Support and \"live chat\" and I found them helpful when I wanted answers but they did say Hulo would work but after a few more questions they appologized for \"misinformation\" because this TV only allows Hulu plus.....so be specific in questions.Browsing the internet takes way TOO long / TOO cumbersome with the remote.  So, I plugged in a cheap USB mouse and it was MUCH more tolerable but still takes time to learn (took a long time to find the / (forward slash). I see I can buy a bluetooth keyboard or mouse so I would be \"wireless\" which I may do.  I see many complained that a wireless keyboard won't work and I wonder if that is because they didn't get the bluetooth keyboard/mouse?  I should clarify that mouse works in most apps....some don't allow.Also, it has taken several attempts to connect to wireless modem (unlike all our family smart phones and laptops)- maybe the modem I have doesn't support Samsung????? I do have high speed internet and You tube played reasonably well.So, it appears to return the TV to amazon will only cost $6.00 but we will keep because this is our 'upstairs/kitchen TV' and we don't watch a lot of Movies there plus my husband hopes Samsung will add / improve all their apps in the future.  Certanily we have learned a lot about smart Tv's from the experience.Positive:  I can buy movies from vudu and other apps for 3.99 (non HD). The HD move are 4.99 which I could just purchase from Direct TV for same price.  I may get subscription from Netflix over winter as it would be handy vs. plugging in laptop.You Tube works great but need mouse or keyboard to do search videos timely.My existing wall mount works if I buy a adaptor and metric screws...........M6 15 mm deepI would rate this \"smart tv\" as a 1 star because samsung has a long way to go before it is as smart as our laptops/phones.....but the same TV without \"smart\" is five stars because picture is WONDERFUL = average of 2.", "Date": "September 2, 2012"}, {"Title": "Network error loop", "Author": "Lyssa", "ReviewID": "R3UIX522XKGTHJ", "Overall": "1.0", "Content": "This TV worked well for about a month and then it no longer recognized the internet network connection.  I don't know if it's an error in their latest software update, or what the issue is.  When trying to start up Pandora or Netflix, I received an error message saying the TV was not connected to the internet and to log into settings to resolve the issue. When logging into the network settings on the TV, the TV verified that the network connection was in fact enabled and live, however when I continue to try to log into Netflix, I receive the network error directing back to settings.I have tried to contact Samsung's \"24 hours a day, 7 days a week\" live online chat to get some assistance and have been placed on hold there without hearing from a customer service representative.Unless you have a lot of time on your hands to wade through these issues, I suggest you purchase a different TV.  I am wishing I would have gone with the LG Smart TV instead.", "Date": "September 26, 2012"}, {"Title": "Smart TV Internet connection stopped working after 6 months.", "Author": "pras", "ReviewID": "R3UCWL5FVKGLH6", "Overall": "1.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2GI0OU4FT2WJWembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2GI0OU4FT2WJWrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo2GI0OU4FT2WJWchiDiv\").innerHTML = document.getElementById(\"cv_mo2GI0OU4FT2WJWhiddenPre\").innerHTML;\n};\ncv_mo2GI0OU4FT2WJWrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2GI0OU4FT2WJWso;\t   \n\n\nfunction cv_mo2GI0OU4FT2WJWloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2GI0OU4FT2WJWso = new SWFObject(swfLocation, \"cv_mo2GI0OU4FT2WJWAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2GI0OU4FT2WJWso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2GI0OU4FT2WJWso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2GI0OU4FT2WJWso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2GI0OU4FT2WJWso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2GI0OU4FT2WJWso.setAttribute(\"height\", swfHeight);\n          cv_mo2GI0OU4FT2WJWso.setAttribute(\"width\", swfWidth);\n          cv_mo2GI0OU4FT2WJWso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2GI0OU4FT2WJWso.write(\"cv_mo2GI0OU4FT2WJWflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2GI0OU4FT2WJW', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2GI0OU4FT2WJW';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2GI0OU4FT2WJW', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2GI0OU4FT2WJWloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2GI0OU4FT2WJW\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1CO1A94M6KXXE\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1CO1A94M6KXXE\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3UCWL5FVKGLH6\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1CO1A94M6KXXE/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2GI0OU4FT2WJWduration')) {\n      document.getElementById('cv_mo2GI0OU4FT2WJWduration').style.display='none';\n    }\n    cv_mo2GI0OU4FT2WJWloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2GI0OU4FT2WJWloadSwf(movieID, playerVersion) {\n   return _cv_mo2GI0OU4FT2WJWloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2GI0OU4FT2WJWnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2GI0OU4FT2WJW', 0, h);\n}\n\nfunction cv_mo2GI0OU4FT2WJWresetPlayer(w,h,bw,cc) {\n  cv_mo2GI0OU4FT2WJWnewHeight(h);\n\n  cv_mo2GI0OU4FT2WJWso.addVariable(\"resetBandwidth\", bw);\n  cv_mo2GI0OU4FT2WJWso.addVariable(\"cacheCode\", cc);\n  cv_mo2GI0OU4FT2WJWso.setAttribute(\"height\", h);\n  cv_mo2GI0OU4FT2WJWso.setAttribute(\"width\", w);\n  cv_mo2GI0OU4FT2WJWso.write(\"cv_mo2GI0OU4FT2WJWflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2GI0OU4FT2WJWRollOverImg = new Image();\ncv_mo2GI0OU4FT2WJWRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81bfUovMNtS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2GI0OU4FT2WJWpreplay = document.getElementById('cv_mo2GI0OU4FT2WJWpreplayImageId');\nif (cv_mo2GI0OU4FT2WJWpreplay) {\n  cv_mo2GI0OU4FT2WJWpreplay.onmouseover = function() {\n    cv_mo2GI0OU4FT2WJWpreplay.src = \"http://ecx.images-amazon.com/images/I/81bfUovMNtS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2GI0OU4FT2WJWpreplay.onmouseout = function() {\n    cv_mo2GI0OU4FT2WJWpreplay.src = \"http://ecx.images-amazon.com/images/I/81bfUovMNtS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2GI0OU4FT2WJWpreplay.parentNode;\n\n  var cv_mo2GI0OU4FT2WJWcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2GI0OU4FT2WJWcurrentClick) {\n      return cv_mo2GI0OU4FT2WJWcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:52 MinsThe apps like NETFLIX, YOUTUBE stopped working after 6 months.I think it is mainly because of auto sw upgrade, which happens on its own without use permission.Do not recommend this product to any one.Go for Sony which is gold standard.Samsung TVs are junk standard, Samsung makes substandard TVs without good quality.Called samsung support about this issue after several attempts and a long wait on the phone, the cusotmer support told me that there is an issue on the samsung smarthub server and your Smart TV will not work.When asked how long it takes to fix the issue, the customer support told me there no fixed time, it is indefinite and you have to wait.Even after several calls to customer support the issue is not fixed and TV is useless.Latest issue update:Please see the uploaded video, after 9 months the app started behaving differently.When I launch netflix app youtube app is getting launched, I really don't know how to fix it.They don't take the TV back since they say return period is expired. Don't know what to do with it.", "Date": "October 19, 2013"}, {"Title": "Very sad", "Author": "Alex", "ReviewID": "RWM0M4RGRXUQQ", "Overall": "2.0", "Content": "Item was shipped in poor condition box with holes no new box just the one it had all Twarn and mangled and was told TV was in good condition with all major components,  but to my surprise it had a huge dent on the back was missing a power cord. UPS had a note on it stating it was shipped that way in poor condition it stated suspicious package.  I sent a email about the mess I received and the missing power cord,  they replied back stating they would send one but it's been a month now and nothing. I really be very cautious about what you buy. Moral trust went out the door and you get what you pay for.", "Date": "August 31, 2013"}, {"Title": "This TV is not smart at all", "Author": "Kata", "ReviewID": "R3IOARR6LE1C3M", "Overall": "1.0", "Content": "I don't understand why others have rated this TV so highly. It has been a big disappointment to us. So often we cannot get access to our apps; it's constantly updating and unusable during updates. The internet aspect of this TV doesn't function well at all. I often have to input all my info again for apps, putting in codes, passwords, user names over and over again for apps I already own. I really have come to hate this TV and will try to get a refund since it's still within warranty, though my expectation of Samsung meeting its warranty obligation is low", "Date": "August 3, 2013"}, {"Title": "Like it very much!", "Author": "Gricelidis Nunez", "ReviewID": "R3D8JULK3C5L8M", "Overall": "4.0", "Content": "Very good HD quality! Sounds is ok; but loud enough. I loose connection from time to time between the TV & the router; which is kind of annoying. I guess Smart TVs are not that smart. But I still enjoy it. :-)", "Date": "June 17, 2013"}, {"Title": "Very good internet television.", "Author": "Harold Herre", "ReviewID": "RRRMA2XBZDR9Z", "Overall": "5.0", "Content": "A well designed and executed television with WiFi access. Was relatively simple to set up. Remote control is simple to use although, as expected, the lack of a keyboard makes entering text data such as a URL slightly more difficult. Altogether, I am very satisfied with this product and would purchase it again.", "Date": "June 6, 2013"}, {"Title": "TV", "Author": "Linda Kelly", "ReviewID": "R3E3DE4G92HXZN", "Overall": "5.0", "Content": "Cant be Samsung for a smart TV.The price was good and as a prime member shipping was free.  I dont have this hook-up to cable at this time. I just watch Amazon ,Hulu and Netflix  no commercials", "Date": "May 26, 2013"}, {"Title": "Exactly what I wanted!", "Author": "Scot", "ReviewID": "R29MXQD59942VO", "Overall": "5.0", "Content": "Amazing picture! Simple set-up with lots of features. Definitely a good choice and so far very pleased with this tv.", "Date": "May 15, 2013"}, {"Title": "Great TV!!", "Author": "Rob-NYC", "ReviewID": "R396A1F2WL4SSX", "Overall": "5.0", "Content": "I purchased this Smart TV several months ago and couldn't be happier. It was simple to set up and the Smart TV functions are reliable and easy to use. The picture quality and sound are very good as well. I recommend this product.", "Date": "May 5, 2013"}, {"Title": "5 out of 5 Couldn't Have Picked a Better TV", "Author": "juan", "ReviewID": "RLNJLILFES8KB", "Overall": "5.0", "Content": "What a great TV, I just love it. I am using it in my bedroom and the set-up was so easy. The picture quality is great and my sound is fantastic. Love this TV.", "Date": "May 5, 2013"}, {"Title": "I really like this TV", "Author": "Patricia Blodgett \"loudmouthfrog\"", "ReviewID": "R10P9ER56VXJYQ", "Overall": "5.0", "Content": "This unit is great considering the technology available. It can't be evaluated based on a cable signal considering cable refreshes at 60mHz & this unit is faster at 240mHz. You will be able to see the differences in quality of the input on the other end, ie. digital vs analog, high def vs older tech. Blueray is a dream come true. In short, the rest of the industry needs to catch up to the quality of this unit. As for \"Smart TV\", I can live without it. It's slow, requires me to get a wireless keyboard & mouse to use it & I have to agree with others who've said...\"my lap top is a lot quicker.\" To  be fair, this is the same complaint all of these \"smart tv's\" have in common. Time & tech will speed things up. I got this to have a wireless monitor for my laptop. Should have done more research. A hard wire is still the best way to stream from a laptop from more than 10 feet away. I guess if all I needed was social media & online services I'd be much happier. But all I wanted was a monitor to stream to.", "Date": "April 30, 2013"}, {"Title": "GREAT TV SMART", "Author": "Nephera Grobman", "ReviewID": "R1SXYBTQG5EK4V", "Overall": "5.0", "Content": "VERY NICE  TV !HIGHLY RECOMEND WORKS GREAT NIVE VISUAL EFFECTS !I THINK IT IS BETTER THAN LG. WEB FRIENDLY.", "Date": "April 12, 2013"}, {"Title": "Great viewing experience", "Author": "Richard Haines", "ReviewID": "R16DJUXWV3IITI", "Overall": "4.0", "Content": "Easy set-up and the picture quality is fantastic. The only issue I have is with the universal remote. Channel list feature does not seem to function, so I have to use the remote that is provided by my cable provider to get the channel listing up.  Other than that, I feel I made a good purchase.", "Date": "April 11, 2013"}, {"Title": "Happy with \"SMART\" capacity", "Author": "BB in GA", "ReviewID": "RP71BAE3QJ5HN", "Overall": "4.0", "Content": "TV picture is great and the SMARTHub works as anticipated.  I don't use it to search the Web.  I use it only for Netflix, Hulu Plus, and Amazon streaming.  It works perfectly for me.", "Date": "April 8, 2013"}, {"Title": "I love this TV", "Author": "bkr", "ReviewID": "RZ6BN73VOOZZ0", "Overall": "5.0", "Content": "You must use the setting by brice S., totally made a difference of our viewing pleasure.I got the 40\", very thin, very light weight, was easy to program and get started, but the review by brice is right on the money.I took the reviewers advice from internet research about the refresh rates of TV's  that that anything over 240, is not worth the money, and I would have to agree, plus I saved a lot of money.The only real CON: so far  is that it has a hard time connecting to internet if you are using your amazon prime account feature, it is a hit and miss if you connect and definitely a software issue.", "Date": "April 6, 2013"}, {"Title": "Fine Product", "Author": "Raymond E. Arntson", "ReviewID": "R26TIZQ4ZX8US1", "Overall": "5.0", "Content": "Worked as expected!  Set up was easy and running in less that one half hour.  Great!  Samsung products meet expectations.", "Date": "March 17, 2013"}, {"Title": "Very Good TV", "Author": "falconguy", "ReviewID": "RAWU1OEBCU13N", "Overall": "4.0", "Content": "Very Good but not Excellent.  The picture is fine, but the \"smart\" features leave something to be desired.  The memory is very limited when using the Web Browser.  Seems to have problems when switching between apps/and or live TV......this to, is an integration problem with the on-board computer.I did not want a 3D set as there are going to be major changes coming TV  3D in the near future.....so this was a compromise purchase.The price is reasonable, and it is a big step above having just a plain TV set.  For now I am happy, and look forward to future Smart TV improvements by Samsung.", "Date": "March 12, 2013"}, {"Title": "Samsung UN40ES6100", "Author": "A computer tech for a school", "ReviewID": "RV7TL05147MQN", "Overall": "4.0", "Content": "Samsung UN40ES6100 40-Inch 1080p 120Hz Slim LED HDTV (Black)I bought the UN40ES6100 last week, after flipping back and forth between it and the UN40EH6000, based on the reviews I read here and elsewhere about the picture quality. To be honest, it was hard to tell the difference when you're comparing both on display at a big box outlet, but it was on sale so it was only $50 more than the UN40EH6000. Granted I've only had it for a few days but I find the picture to be very impressive and vibrant, and I *still* have to calibrate the settings to get optimal results!Based on the reviews, I didn't expect to use the Smart Hub features that much, but I tried a couple of them. The wireless connection went smooth and worked like a charm. Several updates came up for both the Smart hub and firmware. That took a couple of minutes but nothing particularly onerous. I watched a number of YouTube videos just fine, although I noticed the selection returned isn't the same as what I'd see on my PC. Most of the bundled apps don't look terribly appealing, although Netflix support will be nice. Haven't tried web browsing yet as all I have is the bundled remote and I'm not a masochist. I've read that the Logitech K400 wireless keyboard/mouse combo works fine with this TV, so might give that a go.Really, my biggest gripe so far is the so-called DLNA feature that lets the TV show content from your computer network functionality. I had an older Samsung BluRay player that could just connect to my network and access media from my NAS box. It was clunky (sometimes forget passwords & other settings, etc) but could work in a pinch. Not so with the TV. You can get it to work, but you do need to download the Samsung AllShare application, which sits and runs in the background on your Windows PC. You're out of luck if you've got a Mac. Now, I have thousands of photos and several videos, etc. The program took a good day scanning my PC's shared folders and adding content to its library. Why, why, why is this even necessary? Come on Samsung, it's 2013! One of the reasons I have a NAS box is so that my PC doesn't need to be on just to access media. DLNA devices should just work, but for whatever reason Samsung makes you run some app on your PC...That being said, it's been able to play back all the videos I had on my PC, except for videos from my old Firewire-based camcorder and premium content from iTunes. Interestingly, video playback was smooth for non-HD files, but playing back an HD video from my PC resulted in the occasional pause while it was buffering. I was trying this all with a wireless connection and I still have to see if a wired connection would give better results here.Ultimately, I bought the TV for what seemed to me the best picture quality for the price. I read about plasmas but it was hard to find a decently spec'd one in the 40\" range that I was looking for, and the TV is in a room that gets quite a bit of ambient light. The Samsung UN40EH6000 was also very tempting; I would've just connected it to a WD HD TV Live Player or perhaps an Apple TV if I was going that route. But there were more differences than just the Smart functionality as others have already noted here. Nitpicks aside, I've been very happy with it so far!", "Date": "February 20, 2013"}, {"Title": "Mostly very happy", "Author": "LOUISE M. POLLIE", "ReviewID": "R1WIB5KFYHAUFH", "Overall": "4.0", "Content": "I would give this TV five stars except for the fact that it only has a single receptor for sound input from my Sony Bravia sound system. I was able to get a 2 to 1 adapter which works, but my husband is hard of hearing and there is no where to plug in his wireless earphones. Everything works fine for cable TV, but when we go to the hub we can only get the sound through the Sony. The TV continues to play sound from the cable. The picture is great and the set up could not have been easier. Wish I could figure out some way to get the wireless earphones to work when we're streaming Netflix or Amazon Prime.", "Date": "January 6, 2013"}, {"Title": "Easy setup, great picture", "Author": "Jared Carson", "ReviewID": "R24KULNF5303IH", "Overall": "4.0", "Content": "Easy to set up, easy to use! The wifi is easy and has been reliable, making watching Internet TV & movies a snap. Can't say enough about the versatility that having Internet without the wires gives to this TV. Display is amazing, also.", "Date": "December 28, 2012"}, {"Title": "Better than I Expected!", "Author": "Digital Junkie", "ReviewID": "R2UHZLMEKOD2T0", "Overall": "5.0", "Content": "I found this TV at another store and purchased it on Christmas layaway on impulse because of the great sale price. After spending the next month reading reviews, I wondered if I had made a mistake considering some of the comments about connectivity issues and ease of use.I have to say this is one impulse I don't regret! The image resolution is beautiful! And, despite the mess that my cable tech made when switching my service from one company to another, I was connected to my cable service AND my home wireless network in under 15 minutes. I would place myself at maybe 6 or 7 on the techie scale of 1-10, yet set up was a snap.I mainly purchased this to watch Netflix movies without having to connect a separate computer. The Netflix app works beautifully! I was able to sign into my account and watch a movie within a matter of minutes. The You Tube app also works great. And the Fitness app is a bonus for both fitness buffs and beginners alike. Although the TV was not purchased for that reason, I consider the fitness app a lovely surprise extra!Right now, the TV is on a stand. I plan to do a wall mount later. I've read that some people have issues with the position and size of the power plug, but I am sure I will be able to find the appropriate mount that can accommodate the cord.Overall, I am very, very pleased with this product!", "Date": "December 26, 2012"}, {"Title": "Great product", "Author": "tartroe", "ReviewID": "RRQZFTJ4RDT97", "Overall": "5.0", "Content": "It is a great tv and the smart features a awesome.  The refresh rate is not the best, and it is noticeable but it unless you want a large jump in price, this is the right tv to go for that still looks great.", "Date": "December 16, 2012"}, {"Title": "Great TV, crap remote, no qwerty input.", "Author": "Daniel M", "ReviewID": "R13QB9KYJVH7ST", "Overall": "4.0", "Content": "Great looking TV with great features. The remote is junk as it is only capable of controlling the TV and not any other devices. The TV has no qwerty capability of any kind in apps even if you spend the extra $100 for the keyboard (which I don't recommend.) And to top it off Samsung has discontinued their sub-par iOS app which is understandable since they want you to buy their phones. It makes browsing the App databases (like Netflix, Amazon and Hulu) basically impossible. So for a TV it works great. For the \"Smart\" stuff I am going stick with my PS3. I returned this TV in favor of a much cheaper, \"dumb\" Vizio. I probably wouldn't recommend this or any other \"smart\" TV to anyone with any other \"smart\" devices such as PS3, XBox, roku, TiVo or whatever. And if you have a separate cable box, be prepared to buy a universal remote if you don't want the hassle of 2+ remotes.", "Date": "December 13, 2012"}, {"Title": "Love this TV & our internet works great AND fast - like a 3rd computer/TV in our home", "Author": "C. Gibson", "ReviewID": "R3QECGHID0DM87", "Overall": "5.0", "Content": "First of all let me say that we aren't using anything wireless yet but maybe that's why it's working so well for us? (see update below - we did go wireless a couple of days after I wrote this.)We bought this tv a couple of days ago and set it up just to watch basic tv and thought then that we needed a wireless router so we could see just how smart this tv was & get on the internet. We drug out the old Linksys wireless-G 2.5 GHz router out of storage and a friend told me I needed the newer wireless-N router so we didn't hook the old router up figuring that we had to go buy a newer one. My husband had picked out this TV and after we brought it home I read many of the reviews and comments here and became discouraged thinking that this TV was going to be totally dumb, not do what it advertises to do and that we would have to return it and get something else. We were totally 1/2 way expecting to have to return it.We downloaded the e-manual from the Samsung site since we couldn't at first figure out how to read the e-manual on the tv. It took us a while to figure out the on-screen keyboard which was VERY cumbersome pointing and clicking with the remote control. Since we didn't have a newer wireless router we decided to hook up an ethernet cord to our modem to see what would happen. Wah Lah! we clicked on the internet icon and in three seconds were on the msnbc homepage. I guess it's the default but we changed the homepage to our liking. Then we decided Hey let's hookup a keyboard & mouse and see what happens. We were very surprised - it's just like a computer plug & play - the tv detected new hardware. I have a mac pro and husband has PC - this is easier than a PC!Our set up is that we have 2 home computers/ 2 other tv's & now this TV connected. We have Comcast cable. The internet function is working just absolutely great for us. We've been playing for at least 5 hours this evening with the TV and it's past our bedtime we can't stop.  We signed up for the trial Netflix and expected to have problems but NO problem, no skipping, nothing -we sampled movies, tv shows, etc. Everything is streaming fine, internet pops right up as does email and all our favorite sites. Youtube, Live U-Stream and plugging in the keyboard makes it SO much easier to get around. It's JUST LIKE having another computer - browser and all.We were expecting to have one of our kids come over this weekend and show us how to work everything (like I used to have to do when MY parents had a VCR lol) but when they come over this weekend WE will be showing them how this smart tv works! Did I mention we are in our 60's? Now they won't be standing over my shoulder telling me to click on this, click on that Mom, I want to show you this or that MoM. I'll just tell them to use the TV and click it on themselves!We will probably try the wireless later and see if it then becomes \"dumb\". We don't mind the ethernet, keyboard or mouse cords for now. So far, we're really happy with this smart tv!PS - I almost forgot to mention that we followed Brice S.'s calibrations which for us perfectly tuned the picture color, sharpness, etc. We love the picture quality and today took our old 50 lb. clunker TV and dropped it off at a Seattle Goodwill. No more heavy TV to move yay.UPDATE 12/6/12: We went to Comcast and got a newer modem with wireless built-in. Configured our devices including new wireless mouse & keyboard. Everything is working great on the TV. Fast speed internet browsing on the TV. Even our computers seem faster now.", "Date": "December 4, 2012"}, {"Title": "Good TV but not much superior than UN40D6000", "Author": "Jean John \"Jean\"", "ReviewID": "R2XRGKP7ECM2SY", "Overall": "4.0", "Content": "I also have a UN40D6000(An older version of this TV).So my review is primarily a comparative w.r.t that model.+++ Pluses +++1.Sleek design with thinner frame(Stand is not sturdy though)2.Built in wireless(I am not using this)3.Web browser(It is not very stable.Crashes sometimes for no particular reason)4.SMART TV menu is more responsive.5.Support for wireless keyboard.(I personally use a Logitech K400)6.New AllShare software.--- Minuses ---1.Video codec is inferior compared to UN40D6000.I can discern the lower picture quality compared to my old TV while  playing content from USB hard drive.Also UN40D6000 was able to play raw ~38Mbps X264 Full-HD video shot by my camera.  This model can't(Spec says it can playback videos with a maximum bit-rate of 30Mbps.  So this might be according to spec.)2.No VGA connector(Hence I am unable my plug in my pc which doesn't have an HDMI out).3.SMART TV menu is cluttered with stuff which you might not ever use. SMART TV menu is not fully customizable.4.Sound power is reduced to 20W RMS(Older version had 30W RMS)", "Date": "April 17, 2012"}, {"Title": "Samsung Customer Service", "Author": "Poopy Pants", "ReviewID": "R2D8W9VXTTWTB6", "Overall": "4.0", "Content": "Before buying this TV I needed to determine the VESA pattern it had. This was very difficult to find online (or by multiple calls to Samsung) what it was???EVERYONE had conflicting data!!! I was hoping it was 200 x 200 (which is what was listed here on Amazon) as my old mount was that pattern.After taking a chance & buying it on Amazon (as they have free returns) the TV was delivered very quickly.I was happy to find out it was 200 x 200 even though Samsung and 2 trips to Best Buy & Fry's all told me it was 400 x 400 hahaMy next problem? I discovered the screw size had been changed! That information was also not listed anywhere, nor could anyone at Samsung tell me what the screw size was!They were NOT included with the TV... I think this is ridiculous! They should include at least two lengths.The screws needed are M8 at least 15mm in length... M6 we're what my old Samsung TV used, so I had to make the holes in my mount bigger.After that was done it mounted up fine.The TV picture took a little time to get the settings right. I went between live TV, Blu-Ray discs, concerts and movies (I have Verizon FIOS digital HD) to find the best balance in the settings. I settled on the MOVIE picture setting as I thought it looked the best to me.One plus is that it saves the picture settings for each HDMI input. However, it DOES NOT save the sound settings for each input. I think the latter would be useful.The picture and sound are decent for the $$$ but if you have the space (and the money) I would go for the higher end Samsung LED's.Using the remote on my iPhone is neat but not super practical as it needs to connect to the TV via Wifi everytime. If the TV is off, or your iPhone locks it has to \"search\" for the devices before you can use the remote haha kind of silly.4 Stars for these reasons.", "Date": "April 6, 2012"}, {"Title": "Do not buy this TV", "Author": "Alexander Mesmer", "ReviewID": "RMNPBTTC7WX6B", "Overall": "1.0", "Content": "I bought this TV in December 2012 and the Smart Hub worked fine for the first month or so and it went downhill after that. Can't use Amazon or Netflix. Wasted tons of time with Samsung customer service who kept promising that a fix is on the way but nothing has been done to this date. Did all updates and resettings but nothing will work, so I am very disappointed by this lemon of a product. Called Netflix and Amazon and they blamed the problem squarely on Samsung. I have other devices in the house that stream Amazon and Netflix without any problem so it makes sense that Netflix and Amazon are saying this is not their problem. Anyway, only reason I bought this model in the first place was for the Smart TV feature but since that has now failed to work, I feel like this has been a complete waste of serious money. If Smart TV is important to you, please do your investigation first before buying this product. Otherwise, this product is a total junk as far as I am concerned.", "Date": "April 11, 2013"}, {"Title": "Awesome", "Author": "meowmeow", "ReviewID": "R34Y1HAG3OE3R5", "Overall": "5.0", "Content": "This TV is pretty nice..sharp picture..thin..hooked up with computer and quality is nice.  Hooked up to XBOX 360 and game quailty is sharp.", "Date": "December 13, 2012"}, {"Title": "Almost Perfect!", "Author": "William Patterson \"Bill P.\"", "ReviewID": "R1L0ML878AA8RK", "Overall": "4.0", "Content": "Almost Perfect, needs tech work on the Smart Hub (big time) But the TV is great. On the problom of Audio Out really lacking I solved it for $84.68 shopping Amazon. Below are the Three Links you will need to fix your Audio Out nightmare. I would like to say with the addition of these three parts I have eliminated all the cracking wireless speakers and Fading Out Wireless headset problems I have had for years. That Amplifier really made all the difference in my Entertainment System.Hope this helps,Bill in Las VegasUN40ES6100  -  Digital Audio Video OutAmazonBasics Digital Optical Audio Toslink Cable, 6 Feet$5.49http://www.amazon.com/AmazonBasics-Digital-Optical-Audio-Toslink/dp/B001TH7GSW/ref=sr_1_1?s=electronics&ie;=UTF8&qid;=1352149619&sr;=1-1&keywords;=AmazonBasics+Digital+Optical+Audio+Toslink+Cable%2C+6+Feet--------------------------------------------------------------------------------------------------------StarTech.com SPDIF Digital Coaxial or Toslink to Stereo RCA Audio Converter - Digital Audio Adapter$44.24http://www.amazon.com/StarTech-com-Digital-Coaxial-Toslink-Converter/dp/B006PHXMQQ/ref=sr_1_1?s=electronics&ie;=UTF8&qid;=1352149745&sr;=1-1&keywords;=StarTech.com+SPDIF+Digital+Coaxial+or+Toslink+to+Stereo+RCA+Audio+Converter+-+Digital+Audio+Adapter-------------------------------------------------------------------------------------------------------------Composite RCA S-Video Stereo Audio Distribution Amplifier Splitter Amp$34.95http://www.amazon.com/Composite-S-Video-Distribution-Amplifier-Splitter/dp/B003CMDGJK----------------------------------------------------------------------------------Total Cost: $84.68Now if I could figure out why in the world Samsung didn't make a sweet little keyboard for this model, I hate using the \"clicker\" to type. :-)", "Date": "November 5, 2012"}, {"Title": "Awesome Picture", "Author": "Jeff F", "ReviewID": "RGBKU30WRJ4AP", "Overall": "4.0", "Content": "I bought this tv as a replacement for a Samsung LCD i bought from Amazon about 4 yrs ago. SO far i have no complaints, the picture quality is excellent and i havent had any problems with the smart hub connecting or disconnecting. When i first hooked it up went right to the setup of the for wireless and that was pretty much a breeze. My one compaint is with the remote, holding the directional keys down to move from letter to letter is kinda  pain in the butt. For me i cant seem to get the touch down right, i either stop short or run long and then you have to feather it(which is next to impossible). I have missed the enter button and hit the exit and then you have to start all over, well after doing that twice you pretty much want to give up the smart hub. If you go to the samsung website you can d/l the complete ownersmanual which is over 600 pages. I havent done the netflix or hulu or any of that, we dont watch alot of movies. I wish i would have done a little more reserch on it though, cause you cant watch amazon prime stuff on this model of tv either. On the help page for watching movies it shows there is a list of compatible tvs and i wish i would have look there, but didnt now there was such a page. no biggie but kind of a bummer. I gave it a 4 star and that is a strong 4 star. Not sure if you can hook a key board up to make the remote less annoying but, all in all i am very happy with this tv. The picture quality is excellent and with HD channels it is really spectacular. Ok update i d/l the app for prime movies and registered the tv so now i can watch prime movies. I wish the guy from tech support would have told me that i could do that. no biggie watching Gilligans Island as i type this. eason 1 is my fav.", "Date": "October 20, 2012"}, {"Title": "Best 40 inch TV for the price", "Author": "RogueJayhawk", "ReviewID": "RDU547RGMAXPP", "Overall": "5.0", "Content": "We purchased the 40-Inch version because we wanted a nice TV in our kitchen area.  We have had it now for about two weeks and love it.  The picture on it is amazing and the speakers fill the room with no issue....we do have a large kitchen and we have no issues hearing it.  We don't have it wall mounted but as other reviewers have said, it could be an issue hanging on a wall because of where the power is.  I haven't used the online features on it too much yet but I was more interested in the picture quality and look of the TV instead.It may be a little more pricey than other models in this size but I was not able to find one with as nice of picture as this Samsung.", "Date": "May 29, 2012"}, {"Title": "Nice TV", "Author": "Kallen", "ReviewID": "R1193MCNV69NPV", "Overall": "4.0", "Content": "Loudspeaker could Bea. Bit better but I guess this is what you sacrifice with always thinner TVs. It is not a problem but sometimes I feel like I have to turn up the volume a lot. This was my first Smart TV and I love it. As soon as comcast comes out with an app I probably will get upgrade my living TV as well and get rid of my cable box.", "Date": "January 1, 2014"}, {"Title": "Really nice TV", "Author": "Asquil Ferlance", "ReviewID": "R1VOCTFVU7RSM2", "Overall": "4.0", "Content": "This has been serving me well for just about a year now. Looks amazing, slim architecture adds to the fancy look and feel, and has saved me many many trips to the theater.", "Date": "December 31, 2013"}, {"Title": "Great", "Author": "Keith Stephens", "ReviewID": "R15ORSH2BS4HDN", "Overall": "5.0", "Content": "Great tv. Connects to my wireless and now I have all the apps to play with and can stream Netflix.", "Date": "August 11, 2013"}, {"Title": "Very good TV for the price", "Author": "A BOWLING", "ReviewID": "R17XM5HTY09UGH", "Overall": "5.0", "Content": "I have a number of Samsung TVs and this one is as good as any. Used it at a trade show showing medical images and after a bit if tuning they were as good as you get. Now use it as an additional monitor in our board room.", "Date": "March 21, 2013"}, {"Title": "Much smarter with Logitech K400 keyboard", "Author": "Blessed John \"phototiger\"", "ReviewID": "R293B0OQP6OB8J", "Overall": "5.0", "Content": "This 6100 appears to be a great looking TV, especially for the price. The main drawback of the Samsung smart TV has been finding a compatible keyboard since the remote that comes with the samsung UN40ES6100 would have you to enter information very slowly using a few motions to even add a character which is very frustrating. Writing an email could take hours! Well, after looking into what Samsung did NOT have to offer for the 6100 models I did some praying and research and actually found a combination Logitech K400 keyboard that has a very smooth and large mouse pad (page up and down work also :) ... at about 1/3 of the price that Samsung offers on their more expensive models that they do make compatible keyboards for. If you have a smart TV with a USB and are frustrated then check the Logitech K400 out, chances are you may be able to use this wireless keyboard also. I was able to pick it up at Wall Mart for under 40.00. Just turn on your TV, then pull the 2 tabs out to activate batteries on back of keyboard, plug in the small USB into the USB receiver (is a range extender) and plug the USB range extender into the USB port in back of your TV and you should be off and running. Enjoy!  John 3:16", "Date": "March 18, 2013"}, {"Title": "No complaints", "Author": "Rachel B.", "ReviewID": "R4795L6FW9M8X", "Overall": "4.0", "Content": "I've had this TV for a while now. I like that it has all the smart, internet features, but truth be told, I rarely use them. Decent picture, sound quality, etc. Pretty much what I expected from a Samsung.", "Date": "March 5, 2013"}, {"Title": "Love my Samsung SmartTV", "Author": "Carlos Emil Rodriguez", "ReviewID": "R47015R1NKTAT", "Overall": "4.0", "Content": "Pros:Nice and crisp display, incredible image, and sound is not bad, but if you're going to buy a flatscreen better get the home theater system.DLNA and AllShare connectivity works perfect. I have an S3 and an iPad and both can function as a remote control. I can instantly play and movies on the computer to the screen wirelessly. I have not yet had the need to use cables for anything, which to me is a big plus.Cons:Software and SmartHub are still lightyears away from acceptable. They should incorporate some type of Android platform on it, in the meantime, the apps are a little slow at times, but they work nontheless.", "Date": "February 25, 2013"}, {"Title": "Nice TV, but not much of a Smart TV", "Author": "Joel M. Pollack \"Weekend Warrior\"", "ReviewID": "RIKJIJCV3Q3I6", "Overall": "4.0", "Content": "This is a very nice small bezel TV with outstanding color, and high contrast.  I paid the incremental amount for the Smart TV features, but after using it I regret paying extra for the Smart TV and not just buying the less expensive version without the Smart features and putting that money toward another TiVo.  There is little that is of use to me in the Smart UI.", "Date": "February 22, 2013"}, {"Title": "Fantastic", "Author": "T in San Fran", "ReviewID": "R29MF88KWBOJY", "Overall": "5.0", "Content": "Great quality. Easy set up. Good apps. Nice design. My second Samsung smart tv and I'm still a fan. Recommended", "Date": "February 19, 2013"}, {"Title": "40\" samsung", "Author": "EGR", "ReviewID": "R2ZV16KCA7EUA0", "Overall": "4.0", "Content": "the TV meets my expectations, however, Samsung customer support failed to follow up returning a call (2x's) concerning an inquiry I have yet to have answered...", "Date": "February 9, 2013"}, {"Title": "Love it", "Author": "Inxsible \"Inxsible\"", "ReviewID": "R3BQ3ZCMBYPU2T", "Overall": "5.0", "Content": "great quality. The price went down a month after we bought it -- just a week after Amazon's price match guarantee but that happens with  electronics most times.The wireless in the TV is amazing. I use it all the time to stream movies and music from my DLNA server to the TV wirelessly. Works quite well.", "Date": "January 15, 2013"}, {"Title": "Great TV, smart features not so much", "Author": "A. Kaufman", "ReviewID": "R37ADKLA3FM6JX", "Overall": "4.0", "Content": "This TV is amazing and size makes this a must buy. However, they offer a non-smart tv version that I would rather buy. The smart features aren't that great and don't work as you would want them too. Entering text is also a pain in the butt. They should update the remote with a style like Boxee with a keyboard.Other than the smart features, the TV is amazing and I am very happy with it.", "Date": "January 14, 2013"}, {"Title": "Samsung UN40ES6100 40-Inch 1080p 120Hz Slim LED HDTV (Black)", "Author": "bigM", "ReviewID": "R3OTOGYBOF6UQ7", "Overall": "5.0", "Content": "the picture is clear and crisp.  it is easy to navigate the different features.so far found nothing to dislike about it.", "Date": "January 13, 2013"}, {"Title": "Good TV,  Room for Improvement.", "Author": "Coffeelovr", "ReviewID": "R1YO8P5LLZPKDS", "Overall": "4.0", "Content": "ProsExcellent display. Thin, lightweight, elegant case with slim bezel. Average to above average remote control.The sound is OK. Wifi works and is pretty easy to setup. It doesn't make any sounds when you turn it on or off.ConsSmart TV feature works, but is slow and clumsy, sometimes annoying. I'd give it 5 stars were it not for this shortcoming.The manual states that the wall mount requires a 200mm x 200mm VESA pattern with M6 screws, but my unit required M8 screws. Of course, they did not come with either the TV or the mount.I read some of the earlier reviews where the TV has developed problems after an hour or even a week.Most of the reviews were positive however, so I decided to give it a shot. The price was right. I've had mine for about a month now and I can happily say that I've had no problems with wierd or changing colors, network problems, or login issues.So what are my complaints? Short answer - it can be downright annoying.Samsung missed the mark where so many other companies miss the mark these days, in the software.The Smart Hub on my TV works just okay. Getting around is a little slow, but it works. I wouldn't call it a total failure like I read someone else say. Maybe my unit is newer. That doesn't mean it's not annoying.I got this TV for the bedroom. I like to watch movies streamed from Netflix, and catch the local news and weather once in a while. As a result, I haven't had a need to connect this TV to a cable box. I just watch whatever channels the cable company sends in the clear (all the locals, plus a few cable-only channels). If you plan to use a cable box and ignore the built-in tuner, you'll save yourself one of the headaches that I went through. Programming favorite channels is not at all intuitive, and waaay more complex than it needs to be.I had to access the built-in manual to figure out how to do it. (The built-in manual is one of those things that you're glad you found, but know you really shouldn't need in the first place.)The channel programming is divided into two separate functions. Initial channel scanning is under the setup menu (pretty straightforward), and programming favorites is under the Smart Hub menu. I suppose the logic is that the lines between TV and internet are getting blurred, so it makes sense to put channel programming with internet functions. Right.  You can't rename channels. You can reorder them, but it's rediculously painful to do. This part isn't very smart. Oh, and if the so-called \"Smart Hub\" was really smart, it would remember your last selection, and not default to \"Family Story\" every time you enter. Quite painful if you use the Smart Hub alot. Clearly they have some work to do. The good news is that all hope is not lost. Since the hardware is pretty good and it's the software that's flawed, all we have to do is wait for them to fix it, right?Well - what's the first thing this \"TV\" did when I turned it on and connected it to the internet? It downloaded the latest software and rebooted itself!  After using this device (or any Smart TV) for a while, one thing will become clear. It's really not a TV. Think of it as a viewing appliance.  A computer-controlled cable tuner connected to a display. It boots when you turn it on.It's pretty quick, but you can tell it's booting.  Manufacturers love software based devices because they figure that they can fix it with an update. It doesn't have to be perfect when it ships. That could explain some of the problems people had early on, as well as why problems for some developed later.", "Date": "January 13, 2013"}, {"Title": "BEAUTIFUL PIC!  EASY TO USE!", "Author": "Tamster1108", "ReviewID": "R2YLOVR0JTHW31", "Overall": "5.0", "Content": "Using another reviewer's input, I had this TV up and running with a stunning and beautiful picture in no time at all!  It's controls are easy enough that my nine-year old picked up on it very quickly and we have consistently marveled at how amazing the picture, itself, is.  HIGHLY RECOMMEND to all!", "Date": "January 6, 2013"}, {"Title": "awesome quality", "Author": "Fire Star", "ReviewID": "R2JJRJYA7IECUH", "Overall": "4.0", "Content": "Picture quality is amazing n sharp. Size is a little disappointing because I thought it'd be bigger. Love the smart tv function. Amazon also gave me a refund because the price went down two days after I purchased it. That's awesome! Worth buying if you don't mind it not being theatre size.", "Date": "January 2, 2013"}, {"Title": "Great buy", "Author": "Kevin Alleyne", "ReviewID": "R2NZSY8E3E69TJ", "Overall": "4.0", "Content": "Pros: Built in wifi and it can take advantage of 5G routerCons: Auto dimming feature cannot be disabled, can be a bit annoying sometimes", "Date": "December 28, 2012"}, {"Title": "I find it very impressive,", "Author": "Garth", "ReviewID": "R2ZGD7LILFB2P2", "Overall": "4.0", "Content": "very impressive with all features surpassing my expectation with picture quality and sound amazingthe other techno aspects of it I am still learning but for hdmi I tried that worked out well", "Date": "December 26, 2012"}, {"Title": "Samsung 40 inch", "Author": "Michael E Bee", "ReviewID": "R1IZW7A46VAXM8", "Overall": "5.0", "Content": "Very good picture and easy to set up. The apps are also easy to navigate. It pays to by good brands", "Date": "December 22, 2012"}, {"Title": "I am proud of my choice", "Author": "Shiny Titus", "ReviewID": "R4EMV10AI9OZL", "Overall": "5.0", "Content": "love it for everything...enjoying to the full the awesome picture quality and some of the apps...and it definitely looks awesome...", "Date": "December 21, 2012"}, {"Title": "Great picture and sound, silly functions", "Author": "Blair M. Camp", "ReviewID": "R108GSMFBO4IJ7", "Overall": "4.0", "Content": "Picture is great, Sound is great. Well worth the money. Internet functions like photo album, calendar etc is kind of stupid. Functions one already has on their laptop or phone. Some of the desireable functions do not work with cable, so that is a real let down. Cannot give it 5stars.", "Date": "December 17, 2012"}, {"Title": "Great Purchase!", "Author": "Hyekyung Diana Park", "ReviewID": "RQ217LJVLVJTL", "Overall": "5.0", "Content": "I love this TV - great pictures, good sound system and lightweight.The delivery was quick, and it was quite easy to install the TV by myself. I haven't used all the features yet, but a few ones I tried so far, seem to be working fine and efficient.", "Date": "June 25, 2012"}, {"Title": "Great TV. Smart? Well, in some ways...", "Author": "Adam", "ReviewID": "RSPYD7ZDT9SEP", "Overall": "4.0", "Content": "I just purchased this TV and wanted to share some of my experiences so far, both good and bad. First, as a LED TV this thing rocks. The picture is bright, the sound is good, and the scanning rate on this thing makes HD content \"pop\" off the screen sometimes. Lots of adjustment choices in the menu for getting the display settings just right for you. It is slim, light weight, and comes with a decent stand if you decide not to wall mount it.The \"smart\" features are definitely a mixed bag of tricks. The main reason I bought this model was for the AllShare features...streaming content from my PC or my NAS to the nice 40 inch screen. Yes, it does have apps, but there are not that many and most are not that great. The only one that has been useful to me is the Fandango app - you can check movie times and watch trailers on the TV. So first I tried the built in wireless for streaming. This worked for Netflix and the music apps, but it could not handle the 1080p Blu-ray rips that I wanted to stream across my network to the TV. I had some long Ethernet cable, so I tried wired connection next. Much better! No skips or drops in the video at all....I am running a Gigabit network at home so that might be helping. My main issue with Samsung's AllShare streaming solution is the fact that YOU CAN'T STREAM FROM A NAS. You have all this great content that you want to stream, it take up gobs of space, and you put it on a network drive for safe keeping. Sorry, you should have put that in your computer! Ah well. I do have multiple drives on my main computer, but it would be nice to stream from a network location. Otherwise the AllShare client works well...it can even stream MKV files IF they are on your C: drive or E: or F: or G: =D. There are other DLNA servers out there like Serviio that will stream but most have the same problem with network storage.So, a great television that can be used for network watching, but you do have to make some adjustments to make it \"smart\".", "Date": "June 26, 2012"}, {"Title": "Youtube not streaming", "Author": "VA", "ReviewID": "R1ZG91B3IDCB9E", "Overall": "3.0", "Content": "I got this led a week back and have problem in streaming youtube videos , i initially thought problem could be because of built in wifi, so i tried hard wiring it but the problem still exists and even i reloaded the app but no avail, so will be returning this tv and would rather buy a different one.On the good side the Netflix and hulu are streaming well.It does not have the amazon video app, also some apps are missing from 2011 model...", "Date": "April 13, 2012"}, {"Title": "Good TV", "Author": "Saji", "ReviewID": "R1Z9XPBXWF8RSX", "Overall": "3.0", "Content": "As a TV it's an amazing product but the smart TV part sucks !!!! If you can buy roku/chrome then you should go for this one.", "Date": "July 26, 2013"}, {"Title": "BE VERY AWARE..THIS IS A 120HZ not a 240 HZ LED HDTV", "Author": "M. egan \"megan\"", "ReviewID": "R759G88WQZW4", "Overall": "2.0", "Content": "UPDATE.....This is NOT A 240HZ (refresh rate) television.....I have been asking Amazon and Samsung ( asked Samsung to contact Amazon regarding improper advertising)  to change their advertising...THIS IS A 120hz  not a 240hz set....this can be confirmed by Samsung...I First let me start by saying I gave this HDTV 2 stars simply because it does indeed have a very nice picture...HOWEVER with that said I wanted a GREAT picture...I purchased this TV because Amazon is marketing it as being 240hz and one would assume that it follows that the refresh rate would be 240...WRONG....Samsung I believe has purposely come out with this new BS format CMR ( clear motion rate)  Many consumers, and I believe Amazon  themselves, were taken in with the \" new rating\"....Amazon employee told me that they indeed were confused as they believed the TV was 240hz but after I called Samsung upon receiving the TV and it was not what I expected found out it was not 240hz but 240CMR....it is actually only 120hz....it is being improperly marketed by Amazon.  All of us out there really need to do our homework....they are charging you more money because you think you are getting something that you are not...in this case a 240hz LED HDTV vs. 120 hz LED HDTV...would not have paid this money for a 40\" 120hz HDTV....very deceptive and I expect Amazon to pay a bit more attention to detail before marketing their products moving forward. I believe ( or I really want to believe) that Amazon made an honest mistake with there marketing....so just to be clear this is a 120hz LED HDTV not a 240hz LED HDTV", "Date": "April 10, 2013"}, {"Title": "Worth it", "Author": "Amazon Customer", "ReviewID": "R25WQ3YVY8QMEF", "Overall": "5.0", "Content": "Don' have any use for the smart apps. Use this tv exclusively as a computer monitor with my Mac Mini.  Originally bought a MAC 27 inch monitor for 1k but didn like it because its so tiny and not worth 1k. for half of that i got a great 40 inch LED tv with gorgeous pictures and decent built-in sound and at 230 Hertz, can't beat it. This 40 inch version is PERFECT for a bed room. Get it for the picture quality. For smart apps, better off getting a smart dvd player from Samsung or a Roku or Apple TV. The built-in app is a hit or miss so don' expect a good experience.", "Date": "April 1, 2013"}, {"Title": "I have internet service only. First, did not like the smart TV...but eventually love it.", "Author": "Glenda", "ReviewID": "R24L2KP3IEREVT", "Overall": "5.0", "Content": "Bought this TV, this is my first HD TV and could not decide between the one without the smart TV but ended up buying this one, I am happy I got the smart TV one. The TV itself is gorgeous, even without the smart TV. For an added 99 bucks from the 6000 model you get the smart TV feature. The smart TV apps works well and runs on HD examples are NetFlix, Hulu, and amazon, runs good at 12mb/s internet speed at home. If you don't have TV service like me but have internet at home this TV works well with the smart TV feature. Don't expect the smart TV software to be as smooth as any android or ios, but it works though. When displaying app content on 1080p it is gorgeous.IF you download movies a lot or play movies from your PC to your TV using wired setup, this TV will benefit you more. With media player installed inside the TV, I can stream my downloaded AVI's and MP4's form my windows 7 laptop and stream it wirelessly to my TV up to 1080p resolution depending on the movie file resolution. That alone is a nice feature, no more cables to play your movies, just leave the movie files in your PC and access it from your TV wirelessly using media player installed in your windows 7. Another cool feauture is the added usb ports for you to plug in a usb with media files inside and play the avi's and mp4's in your TV. the CMR motion smoothing effect of the TV works well only on animated movies and watching sports, you get clear motion like 60-fps like effect. This feature also works very good on console games hooked up to your TV, it may add extra smoothness in games if you can notice the difference. Overall the product build is nice and slim, the TV display itself is excellent enough to deliver you HD TV that you need.", "Date": "November 29, 2012"}, {"Title": "Good tv once calibrated.", "Author": "matt kramer", "ReviewID": "R1YUWHZ0PVW22W", "Overall": "4.0", "Content": "Out of the box the TV is just decent; however, once you calibrate it the picture looks really nice and is on par with a plasma. The biggest draw for me to this TV was amazon instant video built in. I have apple TVs and that is the one features they are missing...this TV bridges the gap. It is the perfect bedroom TV IMO. Finding a 120hz 1080p TV at this size is near impossible. I calibrated the TV using the settings posted by another reviewer (filter by most helpful and it's the first review). Personally, I found his settings were good just don't use the \"white balance\" settings b.c it makes it look washed out.", "Date": "November 10, 2012"}, {"Title": "One of the best TV's on the market", "Author": "TEXAS ROCKS!", "ReviewID": "R2JJXU33IZYSB9", "Overall": "5.0", "Content": "This TV is by far one of the best on the market. Here are just a few things I like about the TV.1. Light: It is easy to pick up and move around. While this is a plus it coudl be a negative for some people. Because of its light weight it is easy to knock over. it is  worth the extra money to attach it to the wall.2. Picture quality. This is an LED [light emitting diode]. This allows the TV to produce an amazing picture. I have used this with a DVD player, Blu-Ray player, laptop, cable, and over the air HD TV. All of them look crystal clear.3. Movie option: This is probably the best part about this TV. You can hook up your laptop to it via HDMI or just use a USB thumb drive. It does not matter how the USB is formatted [FAT 32 or NTFS] it will read it. It does not matter what file type you have .avi, .mp4, .wmv, .mkv, .mp3 it plays them all. I have tried to find a format that it does not play and I have not found one yet.This particular option on this TV is amazing. Most TV's will play music or photos but not videos. While some, Sony, will only play certain types of files.This is an amazing TV for the money.", "Date": "September 27, 2012"}, {"Title": "Smart TV", "Author": "alan k cohn", "ReviewID": "R2OXPCTNNL1QKU", "Overall": "5.0", "Content": "Great Picture, good apps on the internet smart hub plus full web browsing. Love the youtube app. for movies and music.", "Date": "September 7, 2012"}, {"Title": "We like it", "Author": "Kev", "ReviewID": "R1ZKMS2U0PWVNL", "Overall": "4.0", "Content": "The Samsung UN40ES6100 was very easy to put together and hookup to my home theater system. My family likes it!", "Date": "September 6, 2012"}, {"Title": "Great TV, not so smart", "Author": "David.et.Sara Pritchard", "ReviewID": "RRH8Z8PNLD5U5", "Overall": "4.0", "Content": "We got this TV instead of the 6000 since it was only $100 where we bought it for a better form factor and the smart features. I have to say that the smart tv software has potential, but too many drawbacks to be useful. For example, the youtube app is painful to use since you have to use arrow keys on a SLOW virtual keyboard. Plugging in a keyboard to the tv can be done, but it's not compatible with the youtube app. Maybe that ecosystem will improve, but for now it's a lot better to plug in a computer or other peripheral. We're quite happy with the purchase nonetheless!", "Date": "August 31, 2012"}, {"Title": "Good picture quality; the smart TV could do with a keyboard", "Author": "Chirurgien", "ReviewID": "R1C6VTBP5BK3OB", "Overall": "4.0", "Content": "The picture quality is excellent. Accessing the internet via the remote is tedious and would be better if the company provided a keyboard.", "Date": "August 6, 2012"}, {"Title": "Amazing", "Author": "Princess", "ReviewID": "R1HTTTAOJOTKVH", "Overall": "5.0", "Content": "Samsung Smart TV is simply amazing! I can't wait to get another one. You will not regret buying this TV. Get one today, you have NO idea what your missing.", "Date": "June 2, 2012"}, {"Title": "Run Like the Wind", "Author": "Putnam", "ReviewID": "R18VDVN8TJ81IR", "Overall": "1.0", "Content": "Away from this product.  This is, dollar for dollar, the worst purchase of my adult life.  Maybe entire life.  Yes, that's probably right; worst purchase ever.  From the time it arrived four months ago until this very day it has had some malfunction.  As of today, it has no audio.  For the first 72 hours we had it, it connected to our Wifi.  After that it refused.  Weeks of jumping thru Samsung's Customer service hoops (where every rep tried to blame the victim, where one rep would schedule a service call under warranty and a supervisor would cancel it without telling us -- which happened 3x!) finally yielded a service tech who replaced a $400 motherboard.  Worked briefly, but even with the help of the cable company's service visits and the geek peeps the TV has only the most basic functionality, none of the smart apps, cannot connect to the wireless which every other device in the house uses.  Samsung has jerked us around on the phone and on line more times than we can count and this is a lemon.  Spare yourself the time, money and aggravation by shopping in brick and mortar stores where you have some recourse when the merchandise is defective.", "Date": "September 11, 2012"}, {"Title": "Picture quality good and easy setup", "Author": "KJS", "ReviewID": "R3BFXW5LR3N36H", "Overall": "4.0", "Content": "I purchased this unit as a side room back up TV.  I don't have the hi DEF receiver, the Picture is still very good.", "Date": "April 21, 2013"}, {"Title": "Great TV", "Author": "Gary Swanson", "ReviewID": "R2SS96A1KQX0NK", "Overall": "5.0", "Content": "What a great TV.  Picture is outstanding and it has very good sound quality.  Haven't played too much with the web based tools, but some of them look handy.", "Date": "October 9, 2012"}, {"Title": "Great LED", "Author": "Earl Wilson", "ReviewID": "R10OHE5E3TNWYO", "Overall": "5.0", "Content": "Highly recommend buying the Samsung best picture for the money and sets now weigh much less and they are flat on the back so they can rest flat against the wall; make sure you have your power and other connections such as coax and HDMI coming out flat so the set will look like a picture frame. ES6300 is what was sent this is the current model.", "Date": "July 14, 2013"}, {"Title": "Live it", "Author": "Mahasa Moshtaghipoor", "ReviewID": "R3JVT0GQJWLN2R", "Overall": "5.0", "Content": "Great tv, very thin! Looks like a painting on the wall, I have a very small room so u do not even feel u have a tv in ur room! Cannot get it in stores! Get it here!", "Date": "May 15, 2013"}, {"Title": "Excelent Tv", "Author": "A User", "ReviewID": "R1CPGXCDA395YD", "Overall": "5.0", "Content": "A new experience of tv and internet all together in just one device... Very good the resolution HD and the design is very beautiful...", "Date": "May 14, 2013"}, {"Title": "Great quality at an affordable price.", "Author": "Ted Wads", "ReviewID": "R1J4T4IZRLP64M", "Overall": "5.0", "Content": "Great Value!!! Had this TV for 3 full months and it is simply great. Great picture quality, good price,.......if you want a smart tv, hook up your computer to this TV.", "Date": "March 22, 2013"}, {"Title": "Samsung UN40ES6100 40-Inch 1080p 120Hz Slim LED HDTV (Black)", "Author": "Miguel Pittol", "ReviewID": "R3AZPXXMOML82G", "Overall": "5.0", "Content": "El producto lo recibí en muy buenas condiciones y me parece muy bueno.se recominda el articulo Samsung UN40ES6100 40-Inch 1080p 120Hz Slim LED HDTV (Black)", "Date": "February 26, 2013"}, {"Title": "Recommended to those looking for a 40\" SMART LED TV", "Author": "rob", "ReviewID": "R1RXKZL7NE02Y2", "Overall": "5.0", "Content": "This beautifully clear, life like, brilliant colors, thin, efficient, Smart TV will guarantee to please you.Only issue is Samsung Software need to provide an updated download that allows wireless keyboard and mice to connect to this model.Otherwise I am very happy with my choice.", "Date": "February 21, 2013"}, {"Title": "LED better than Just LCD?", "Author": "Gary R. Oltrogge", "ReviewID": "R35MSFJ1899JRC", "Overall": "3.0", "Content": "The LED backlighting on the 6100 Samsung compared to my older Samsung 650 series has an inferior picture. I'm not sure what the benefit of LED is. Cheaper to build? More energy efficient? Definitely notan improvement. Should have bought another Panasonic plasma.", "Date": "February 16, 2013"}, {"Title": "great tv", "Author": "MISTY", "ReviewID": "R1YM60KD7S9UOQ", "Overall": "5.0", "Content": "LOOK AT CHEAPER T.V S BUT THIS WAS THE BEST .IAM NOT INTO THE INTERNET TO MUCH SO CANT SAY ANYTHING ABOUT SMART  SIDE.I DO STREAM AND THATS GREAT.PICTURE AND SOUND ARE SUPER.", "Date": "December 28, 2012"}, {"Title": "THIS A GREAT TV", "Author": "AUNTIE L", "ReviewID": "R2HSZSXKI6KVVL", "Overall": "5.0", "Content": "GREAT TV - VERY USER FRIENDLY - YOU WILL NEED A ROUTER - MANY AVAILABLE OPTIONS - YOU WILL NOT BE DISAPPOINTED", "Date": "December 27, 2012"}, {"Title": "UN46ES6100  TV  is great; the picture quality and smart feature is very nice", "Author": "SIVARAJAN", "ReviewID": "R2KON0XK3Z5MZQ", "Overall": "5.0", "Content": "Picture quality and the smart features are good.  Setup is pretty straightforward and easy to use.  The interface is slow  and any kind of mouse/text input is absolutely awful.", "Date": "December 27, 2012"}, {"Title": "christmas for me", "Author": "jessi", "ReviewID": "R5IRZIOW5ZPEX", "Overall": "5.0", "Content": "After i had everyone's presents, i settled on a TV for me. Love having all of this technology from my television. Wow....merry Christmas to me!", "Date": "December 25, 2012"}, {"Title": "Classy, gorgeous TV", "Author": "Scarlet", "ReviewID": "R111AO3AKEV544", "Overall": "5.0", "Content": "I am thrilled with this TV. It arrived in 3 days by UPS. Extremely well packaged. It's a very light TV (I carried myself from the lobby to my 8th floor apartment). I set it up in 20 minutes following the manual. First you put the legs, then you plug the TV an all the hardware (PS3, dvd player, etc...) then...rock and roll!! THe TV tells you everything you got to do. Firstly, you set up your internet connection, then the channels (I have around 58 public channels, including chinese channels!)...adn voila! You have your new TV to play with. Absolutely amazing PS3 graphics, they are unbelievable. I can't wait until the weekend to spend it literally with my new Samsung!", "Date": "November 30, 2012"}, {"Title": "Amazing!", "Author": "Twiz718", "ReviewID": "RZ5JXUKAJWZVB", "Overall": "5.0", "Content": "I love this TV! My first flat screen TV, Great Tv sounds good, looks good, no complains. Get the tv you wont regret it! I wirelessly connect my phone to it to watch my files on it, looks great!", "Date": "November 29, 2012"}, {"Title": "Samsung 40\" LED TV", "Author": "Downsized", "ReviewID": "R2JBCOE5YMXOEP", "Overall": "4.0", "Content": "Setup and use of the controls were very good. Still getting use to some of the features and we're glad we bought this TV.  Have and older Samsung LCD, of the same size, and it has been relegated to the bedroom!!!  The SMART TV idea is a step forward.  Works great with router and PC!!  The next step is to \"break down\" and go for HD broadcasting!!!  The Blu-Ray player shows me what I am missing!!!!", "Date": "October 29, 2012"}, {"Title": "Samsung Un40ES6100", "Author": "Bill Peragine", "ReviewID": "R38TT26HT27DAF", "Overall": "5.0", "Content": "This is a great TV...Picture is very nice. I still need to set-up the wifi but will when I have time. Again Amazon got is here quick and safe. Thats why I use them.", "Date": "September 21, 2012"}, {"Title": "Great Purchase!", "Author": "Living the Dream", "ReviewID": "R3UYJOO5XCA9ZK", "Overall": "5.0", "Content": "I have really enjoyed the Samsung 40\" 6100. Great TV, love the color and clarity, also enjoy the Smart Hub. On VUDU you have a crazy amount HD movies and TV series on demand. Also really enjoyed Pandora. This TV was really easy to set up, and fits perfectly in my family room. I think that this TV is a great buy for the money.", "Date": "October 11, 2012"}, {"Title": "I enjoy the Smart TV", "Author": "Michelle Myton", "ReviewID": "R3IBTHZTXG7YEQ", "Overall": "5.0", "Content": "The picture is amazing, I recommend guys who love to watch sports, cartoon and movies to definitely purchase the smart TV. I just need the remote with the key board when I'm on the intranet but overall this was a smart purchase and I have no regrets.", "Date": "April 29, 2013"}, {"Title": "Thank goodness for Amazon Tech Support", "Author": "bagleyandzooey@hotmail.com", "ReviewID": "R3IETIZ7YTKF3N", "Overall": "4.0", "Content": "Update:  After exchanging two emails with Samsung and getting nowhere - I noticed that Amazon (maybe because this is a Prime purchase?) offers 30 day free tech support.  Not having much in the way of expectations that this would help, I called.  I got a wonderful techy that walked me through the process. I had been trying to stream Netflix directly from the website, rather than going through the smart hub (I didn't even know there was a smart hub).  It worked like a charm.  The user manual with this tv is pretty useless, but with the tech support all things are possible.  So now, streaming Netflix, great picture quality, good color and tone.  Glad I bought it.***I started setting this tv up at 5pm.  It is now 8:22pm and I've got as far as getting it on the stand and setting up the channels.  For the past ninety minutes I've been trying to get it to stream Netflix (which is primarily what I bought the tv for).  I tried another brand (Visio) that had a button for Nexflix and set itself up almost instantly.  This tv doesn't have a Netflix button and you have to go searching for where to find it.  Once you do, you enter your email and password.  Then you get a nice screen that says \"watch movies & tv instantly\".  The screen tells you all about instant watching (like anyone who already has Netflix needs to read?).  And then nothing - no \"continue\" button or anything.  So I'll have to call tomorrow to figure out what the next step is.  If I was judging this tv on picture quality alone, it would get a high rating.  But the set up is not intuitive and so it is time consuming to figure out how to set it up.  I always am slow at setting up electronics.  But my last 40\" smart tv (that I returned because I couldn't get wireless headphones to work with it) was about 100 times easier.  It took me less than an hour to set up the Visio and I was watching a Netflix movie.  I'm really frustrated with this set.  Picture quality isn't everything!  This one was $200 more than the Visio.  So very frustrating.", "Date": "March 29, 2013"}, {"Title": "Netflix not working", "Author": "John & Annie", "ReviewID": "R174PJYS22AN87", "Overall": "4.0", "Content": "Just bought one of these last weekend and Netflix dosn't work. Talked to customer support for over an hour and they were no help. They had me reset the TV a couple times and Netflix still will not work. When the screen turns black I can see some lighter circles. I bought this TV so that I could eliminate my Roku box which wastes a lot of electricity and now I cant even get the content that the Roku gave me. I will be looking at other TV options.UPDATE: Exchanged it for a new one and Netflix is now working. Still can't believe that they don't have Amazon Instant Video yet. I did see on a website that they don't have it for the 2011 models yet either.", "Date": "March 31, 2012"}, {"Title": "Could the picture be too good?", "Author": "Amyface", "ReviewID": "RFQTGDNQSWBG9", "Overall": "3.0", "Content": "The picture looks strange. It looks like I'm watching a documentary. I don't know how else to describe it. Even hd movies look like an episode of Lost. They are very detailed, but it makes most things look like they are b movies. It's bizarre. Any ideas before I return it?", "Date": "May 20, 2012"}, {"Title": "Was a Samsung fan, but this TV made me lose faith", "Author": "sshg", "ReviewID": "R1NKGDQFQSCD82", "Overall": "3.0", "Content": "I owned a Samsung a few years ago. It was a simple 40 inch LCD (LA40C530), with a 60Hz refresh rate. Nothing to brag about. But the picture was great, everything worked great - the TV was responsive, I could tune it the way I wanted to. And even with a 20 feet viewing distance, I could really enjoy the picture and sound quality. I would have rated it 5 stars.So, it was obvious, that when I had to move on to an LED TV, I didn't really consider anything but a Samsung. I did spend time reading a few reviews about Panasonic and LG but didn't give them much thought. My previous experience with LG had been that it just looks like a cheaper version of Samsung. The only reason I was considering them was the IPS panels.Yesterday, I brought home the (46 inch) UN46ES6150. I got a great deal at Costco where I got the Samsung Smart TV and the Samsung Smart Blue Ray player for $950 + taxes. The disappointment started right after I plugged the TV in.The first thing I noticed is how unresponsive the TV was to my button pushes on the remote. I ignored it, thinking I just need get used to it and then I made the mistake of going to the Smart Hub. Smart Hub, as most reviews put it, is terrible. It is such a poorly designed, completely unresponsive, completely unintuitive piece of junk (The Smart Hub on the Blue Ray player was actually slightly more responsive !).I don't have a cable connection yet, so I knew I was going to live off Netflix and Youtube for a few days. I got to Youtube and played a few good HD videos. The picture quality looked excellent, but only a for a while. As I moved around the house, I realized I should have got myself an IPS paneled TV. The colors and brightness just drop when you're not right in front of the TV. I had tried this out in a store before and I couldn't tell the difference a lot, but it was very obvious in my home, probably because of the softer lighting. With a much shorter viewing distance in this place (10 feet), the viewing angles are going to be more acute and this is something I can't live with.The real disappointment came when I started a few HD movie trailers on Youtube and witnessed the dreaded Soap Opera Effect ! I spent the next couple of hours trying to get rid of it. \"Switch of auto motion plus\" is what the Internet recommends - guess what, that option is disabled in Smart Hub mode. \"Switch to game mode\" is the other recommendation - guess what, the ES6000 series doesn't have a game mode !! Then I tried out a few suggested hacks where I started the Vudu application, played a 2 min demo and tried to turn off Auto Motion Plus - again, the option was disabled.It doesn't really matter by now, but the sound on the TV is pretty bad as well.This is terrible. Nothing about the TV has caught my attention so far. I'll be returning the TV this week and getting myself a Panasonic (either an LED or a Plasma). I no longer want a smart TV if this is how terrible Smart TVs are.Edit: After playing a lot with settings I've managed to get a much better picture and to get rid of the Soap Opera Effect. I've raised the rating from 1 star to 3 stars now. What still sucks is the small viewing angle and the software (the browser is unusable - I primarily use YouTube and NetFlix, which are barely bearable). Also, I've given up plans of switching to a plasma because of their power consumption and phosphor trailing effects.", "Date": "September 1, 2012"}, {"Title": "Most of the Samsung apps like ChannelLive.TV, YuppTV are not available for this model.", "Author": "Suresh", "ReviewID": "R3VW14PTFE9YTI", "Overall": "2.0", "Content": "The TV picture, sound are good. Very slim and light weight. But it doesn't support most of the needed apps. I need the app like \"ChannelLive.TV\", \"YuppTV\".... those are all not available for UN40ES6100 model. The most reason to buy the smartTV is to get utilize these apps but it is not available. Now I have to return this TV.", "Date": "June 4, 2012"}, {"Title": "HDTV not HD", "Author": "Doobs", "ReviewID": "R1OTD4HBAQTXRV", "Overall": "2.0", "Content": "I've tried adjusting my tv to have it display in HD while watching Netflix through the SmartHub (which is amazing!!!). Problem is, the HD Netflix movies and shows aren't coming through the TV as HD. They are pixely and look like a standard definition movie. The Clear Motion also doesn't seem smooth like what I was shown in the store. Will be taking the tv back, as it very well may be a defect.", "Date": "January 31, 2013"}, {"Title": "Wall Mounting Error", "Author": "sddave", "ReviewID": "R1KSQXQVK2YGCW", "Overall": "4.0", "Content": "The documentation says for wall mounting use M6 Screws.  Live Chat with Samsung says that all 40\" TV's use M6.  However this model definitely uses M8\".", "Date": "December 15, 2012"}, {"Title": "Beautiful picture!", "Author": "Aaron Trask", "ReviewID": "R20XQ50LP5FDS4", "Overall": "5.0", "Content": "I saw this TV on display at a local retailer, and it was the first time I really thought that upgrading to an HDTV was worth it - the picture was great.  I ordered it with Amazon on sale and have been really happy with the TV.  The picture is the best - bar none.  The online resources work well.  Overall a really great purchase from a reputable company.", "Date": "November 24, 2012"}, {"Title": "kind of..sort of..not really", "Author": "m mann", "ReviewID": "R2AO2P5SGVY2J3", "Overall": "2.0", "Content": "So 2 calls to samsung later and they finally say that it really works better with a hard wired LAN...really...and the picture looked like the bonus dvd feature \"the making of..behind the scenes\"..it took virtually every movie and made it look like really high end video instead of the film look of cinema...yes, I went on avs forum to recalibrate... just got the panasonic viera ..problems solved", "Date": "August 15, 2012"}, {"Title": "Samsung SmartTV maintenance causes \"ERROR_MODEL_BIND\" modal that blocks gaming", "Author": "Anthony Wu", "ReviewID": "R36PCUCUXH6SP0", "Overall": "1.0", "Content": "So, today, Monday April 1, 2013, Samsung is apparently doing server maintenance on their service, which apparently isn't the first time they've had to take down the service. So while this is happening, this frakkin' annoying dialog that says \"Network is not connected. Check Network Settings to use Internet services. (ERROR_MODEL_BIND)\" keeps popping up every other minute, c0ckbl0cking my play on the XBox. Of course I verify my internet connection via WiFi and it's just fine, working as usual as confirmed by the TV. This annoying dialog makes watching TV unbearable, and games unplayable, and the TV just as useful as a frakkin' brick. I'm giving them a one-star for this s***ty \"SmartTV\" service that's ruining the rest of the TV's capabilities.", "Date": "April 2, 2013"}, {"Title": "samsung", "Author": "cbtomlins", "ReviewID": "R2EZ20V3GMYN67", "Overall": "5.0", "Content": "So far this product has done everything that was advertised for it to do. Very enjoyable...I only wish that I had gotten the larger version...oh well. Having to write 17 words is ridiculous.", "Date": "January 28, 2013"}, {"Title": "COLOR CONTROL IS A JOKE!", "Author": "Amazon Customer \"Owen C Jones\"", "ReviewID": "R5LWVQ7UV3YXE", "Overall": "1.0", "Content": "Why can't Samsung make a TV with decent color control? Computers do it, other TVs do it, even my 15-year-old Sony HDTV had perfect color for the entire time I had it to the time it died and never had to be adjusted. But from the time I turned on this piece of c..p, I was continually trying to get a decent picture but usually everything looked surreal. Lime green sky one minute and mustard yellow the next. Adjust it to the mode you that looks best and the next minute it wanders off into a dull neverland. Get fine tuned adjustment the way you like it and five minutes later it's horrible. So why can't Samsung produce a TV where the color is not a joke? I took it back after two days of minute-by-minute adjustment frustration. Even with auto control turned off, the color was still unstable. Lucky I didn't hit it with a ball bat.Also, the motion in this TV is jittery, jumping from one scene to the next with visible discreteness...very disconcerting. 125 Hz framing? Yes, I know the source is only 16 or 24 Hz but the interpolation is terrible. On the other hand the picture was sharp when not jumping...give it one star.Another frustration was the use of the on-screen \"keyboard.\" This made using the browser unbearable. Cursor movement was excruciatingly slow so any internet function requiring feedback from my end was beyond the pale. I guess there must be a way to hook up a wireless keyboard but I didn't keep the unit long enough to find out.Don't go near this one. I guess the Koreans haven't figured out that they have to produce something that works before they try to sell it.", "Date": "November 27, 2012"}, {"Title": "lack of support", "Author": "David Allen", "ReviewID": "R1EE66232KFW08", "Overall": "1.0", "Content": "After five days and  several hours of phone, chat, email, several unfulfilled promises of return calls, I have yet to speak to anyone in tech. support at Samsung regarding Netflix not working in their SmartHub feature. Rather than a review of the features of this tv all I will say is that there is no support, so if you make this purchase be aware that you are counting on it being 100% bug free. My policy and my advice to anyone going forward would be to not purchase any Samsung manufactured item if you value your time and money.", "Date": "December 1, 2012"}, {"Title": "Looking To Purchase But With A Question Or Two?", "Author": "Brian", "ReviewID": "R22B26X7JJX2Z4", "Overall": "4.0", "Content": "I can't decide between this and the UN40ES6500, the 3D version. I believe both of these 2012 frames are based on last years UN40D6400/6420 frame, with the utlra thin bezel, used on each of this years models, 6100 and the 6500? I'm almost never going to use the 3D but I'm wondering if the 43 of you who purchased, used, and rated this HDTV and had a choice to purchase again? What model would you get? Is the clear plastic divider on the bottom of the set removable? It seems to stick out over the Samsung logo in all of the pictures I see.", "Date": "June 4, 2012"}, {"Title": "USER MANUAL NOT INCLUDED", "Author": "Laura \"wasserkill\"", "ReviewID": "R61CENH2MG6OY", "Overall": "1.0", "Content": "You need a manual to properly set up the TV otherwise you just have a piece of plastic junk.  According to a Samsung rep, they expect you to download the manual from the web (675 pages, most having only a few lines per page which is nonsense). This was a gift for my 90 year old mother who doesn't have a computer.  With effort I found that the manual is available in paper form for $13 plus shipping and handling.  Such a deal... Buy from some other company.  There are plenty out there that offer paper manuals detailing how to set up and use their product.", "Date": "November 26, 2012"}, {"Title": "Poor Compatability With File Shares", "Author": "Anthony DiGiovanni", "ReviewID": "R2QXCT44OVUT2U", "Overall": "1.0", "Content": "Unless you have a Windows machine running Samsung's proprietary media sharing application, good luck getting content on here.  There is no way to stream media to this TV from your Mac or linux box.  LG has a plex client built into their TVs.  I returned this and got an LG SmartTV.", "Date": "November 5, 2012"}, {"Title": "I like it but still have to get used to some things", "Author": "morchen", "ReviewID": "R97QOS2SMJFOV", "Overall": "2.0", "Content": "The clearity when watching a show on TV is great. I am still trying to get used to watching movies, everything looks so fake, you can tell when the background is just put in there and there are actually two different scenes. I watched warhorse on this TV, the background for the most part looked awefully clear. Didnt like that. Changed some settings but I still can tell things are cut together.", "Date": "July 10, 2012"}, {"Title": "Tv features are great pic quality is not", "Author": "Shay80", "ReviewID": "R3JFNQRO579QZH", "Overall": "3.0", "Content": "This is the 4th tv I purchased in the last 2weeks. My 1st tv was the New Samsung 1080 60hz I thought it was 120hz on the box it say 120 resolution which is different (  so beware).  Took it back cause the pic quality wasn't as clear as I thought it could be. The next tv purchase was a Toshiba 46inch 1080 120 hz this pic was terrible everything looked soap opera ish only had it for 4hours took it back and got the Samsung 1080 120hz model# UN40EH6000 love this tv pic quality was amazing had it for 2 weeks but I wanted a smartv took the UN40EH6000 and purchased this UN40ES6100F love the smartv not happy with the picture quality not as clear as the UN40EH6000 I matched it up so I can have the same picture just a smartv.  Very disappointed that the pic is not as crystal clear as the 6000 it also doesn't have the Samsung signature power on and off tune.", "Date": "April 23, 2012"}, {"Title": "haven't been able to even use it!", "Author": "Ricardo Rivera \"R.Rivera\"", "ReviewID": "R22U8EAD17N5J3", "Overall": "1.0", "Content": "I received this TV a couple of days ago and I haven't been able to use it because I'm missing TWO screws required to assemble the TV Stand! I tried getting the replacement screws myself somewhere else (at a big Construction/Hardware Store) but I couldn't find the exact size (and obviously not in Black, like the original ones).It's been very disappointing because I was eager to use my new TV right just when I got it delivered (I even paid for faster shipping to get it asap) And now I have it... inside the box without being able to use it for such a simple missing piece.", "Date": "August 11, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Smart Content with Signature Services\nBuilt-in Wi-Fi\nSmart Hub\nWeb Browser\nTV with stand (Width x Height x Depth): 36.5-Inch x 24.4-Inch x 9.5-Inch, TV without stand (Width x Height x Depth): 36.5-Inch x 21.8-Inch x 1.8-Inch", "Name": "Samsung UN40ES6100 40-Inch 1080p 120 CMR Slim LED HDTV (Black) (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/51QF-uUg0bL._SX300_.jpg", "ProductID": "B0076M04QU"}}