{"Reviews": [{"Title": "Very pleased", "Author": "D. Stanhope", "ReviewID": "R1VM9DUVAAUBBC", "Overall": "5.0", "Content": "I ordered a model 633U from MODIA via Amazon, because it supported 240hz and a matte screen and didn't have 3D which I really didn't care about. MODIA upgraded me to the 7450 with 240 hz and 3D at no cost. To me, the most important aspect was the matte screen. We have a very bright room with 2 walls of glass which in FL results in very high light levels. Even with this brightness and contrast levels exceed what we need. I understand the new 835U has gone to a glossy screen in an effort to match plasma contrast ratios. This wouldn't work for us. Delivery was very fast, and the package arrived (via Pilot) in excellent shape. I've had the set for 3 weeks, and I am quite happy with it although I am still dialing it in. There is a great deal of adjustability in the picture and audio which is a good thing since all rooms are different. I find we need to work on two settings - a User setting for our bright days and a modified Standard setting for night time watching. No problem with this set. When dialed in, the picture is awesome. As I saw another commenter note, the picture is so revealing that some movie scenes look like plays, and some bad acting/directing/editing/special effects really look bad!I have had one problem that keeps me from giving it a 5 star rating, although it may have nothing to do with the set per se. I have had several instances of audio being out of synch with video, sometimes as bad as a dubbed Japanese Kung Fu movie. At times when changing channels we lost audio completely. It has happened when using an HDMI input, but never when using a component input. I have used 3 different HDMI cables (5 yrs old, new but cheap, new as supplied by Verizon on my bedroom HD Sony) and all had the problem. I chatted with helpful reps at AquosAdvantage (register there and get a 3 month warranty extension) who worked with me at length to turn off video processing functions to see if problem cleared. Then I worked to turn on functions (like motion control, auto contrast, etc.) one at a time. I went 5 days with no problem, then had 3 episodes yesterday, generally as a news network was coming out of a local commercial to the national news feed. Never had this problem with the same STB and my older Toshiba 720p set (which I hated.) No resolution yet. Easy to clear but annoying.The wi-fi apps work well. We have watched Netflix and VUDU 1080p movies with no problems (despite Verizon's 8.11G system) and have discovered VUDU Apps like Divefilm HD - awesome underwater shots! I have played video and reviewed pictures from USB easily, and have pulled videos, picture and music from shared folders on my PC with ease. I haven't watched 3D (no glasses included)but will probably spring for a pair since I got the set for under $1500.Sound is good, not great. But the output jack to my old 5.1 receiver and my old KEF speakers made Pro-Logic movie soundtracks impressive. The stand is stable and swivels. It's very hard to find anything here to complain about but you do have to spend some time tweaking settings to get it just right for you and your room (This is a good thing!) If I ever find anything definitive about the audio sync I'll update this.  In the mean time, I'm just enjoying this every day.UPDATE: Nothing seemed to clear this audio problem so I called the AquosAdvantage support line. The rep (Brian?) was very knowledgeable and said they had seen this before. It is an issue with the HDMI setup on our Verizon STB. The audio needs to be set to LPCM. I called Verizon and spent three futile hours with tech help who had no idea how to access the hidden setup menu in our Motorola QIP7232 (supplied by them!) I Googled the problem and found you just need to press three keys in sequence - power (on the STB), Select/OK, then Menu (both on the remote.) The setup screen popped up, I changed audio to LPCM, and now everything seems to work fine. 60 seconds to fix, after hours on the phone. I changed my review from 4 stars to 5 since there was never anything wrong with the set. Other HDTV brands, and other cable providers, have this same issue.", "Date": "July 19, 2012"}, {"Title": "What a deal! What a picture!", "Author": "Sigkill(9)", "ReviewID": "R3G9DAQB5GC4GS", "Overall": "5.0", "Content": "This TV has it all... It has all the smart features,  It's super thin and the picture is amazing. I would definitely by another one of these.", "Date": "January 3, 2014"}], "ProductInfo": {"Price": "$2,399.99", "Features": "Video-Enhanced Refresh Rate-120 Hz;\nSharp Aquos 60-Inch 1080P 240 Hz 3 Color LED 3DA Smart Wi-Fi\nSharp AQUOS LC-60C7450U 60-Inch 3D 1080p LED-LCD TV - 16:9 - HDTV 1080p - 120 Hz", "Name": "Sharp Aquos LC60C7450U 60-Inch 1080p 240Hz 3D 1080p LED-LCD TV", "ImgURL": "http://ecx.images-amazon.com/images/I/31iSw0naacL._SY300_.jpg", "ProductID": "B007GF61AK"}}