{"Reviews": [{"Title": "Sound functionality misleading", "Author": "Annmarie", "ReviewID": "ROSHXTN9FW8SF", "Overall": "3.0", "Content": "Just purchased from Costco at a great price.  Picture quality is great, set-up was easy.  Paired it with a Sony Streaming box and I have a smart TV for under $350!  Only complaint is the audio.  The sound is not bad but the functionality of the XinemaSound 3D is not as advertised on the box, in the manual, or on the website.  The manual shows the ability to turn it off and on, along with a leveler.  This menu function is not available on the 32 and 37 Class, according to JVC tech support.  They claim the sound functionality is \"built in\", but it sounds like straight stereo sound to me - no additional depth you would expect to hear from a simulated surround sound experience.", "Date": "August 31, 2012"}, {"Title": "Awesome TV", "Author": "Kilroy", "ReviewID": "R3E85KSN844RIK", "Overall": "5.0", "Content": "Received this set 2 weeks ago. For first week only had normal non HD input from Dish satellite receiver. 480i res is what the set claimed it was getting.  Even at that the picture was great! After first week got my Dish upgrade to full HD (1080i) the picture is fantastic!!  This is the 3rd JVC I have owned. The first 2 were CRT sets and ran for over 20yrs. I am very happy I spent the extra to buy another JVC product.  The sound from this set is vastly superior to other flat screens Ive heard. You'll have no trouble hearing, the sound is comparable to my old JVCs both of which had stereo sound. Its not however a substitute for even a mediocre surround system. You'll never rattle the room with the sound coming from it. Dont let that scare you tho the sound is more than adequate for normal viewing.Only possible negative point is the stand. Easy to see how so many of these sets are knocked over. My sister has the same size Samsung and I have to admit its slightly more stable. There is a whole in the back of the base that could be used to screw it down to your entertainment center. If you have small children its something you should consider. I plan to wall mount it asap.Bottom line my family an I are VERY happy with this purchase and I highly recommend it!!!!", "Date": "September 27, 2012"}, {"Title": "So far so good", "Author": "miamidan", "ReviewID": "R34V5U1KIHSCCS", "Overall": "5.0", "Content": "I just got this TV today from Costco for 300 bones, and it looks great so far, especially with the backlight at 100%...hopefully it doesn't have the freeze issues that people have reported on the 3000 model. I searched around, but once Costco knocked 50 off with a coupon, it was hard to pass up...I'll let ya know more if it breaks down or anything.", "Date": "August 20, 2012"}, {"Title": "JVC hit a Homerun with this baby", "Author": "AG", "ReviewID": "R1XL40NGW802YG", "Overall": "5.0", "Content": "Just bought it at Costco for my Mom. Paid additional $30 for a full 5 year warranty. With the additional warranty and sales tax - $367.10. For the price it's a no brainer. Really love the picture, it was the best among all TVs at Costco. Seriously. I hope my Mom will enjoy it for the next 5 years. I know I will when I visit her.", "Date": "September 4, 2012"}, {"Title": "Good picture & great price", "Author": "Nahed Eltantawy", "ReviewID": "R39KWTX7GUCCSP", "Overall": "5.0", "Content": "We also got this TV from Costco for $300. Everything Looks good so far. The picture is great as well as the sound. We are just worried because we read reviews on the 3000 model and many people say the TV stops working after four months.But we are good for now and will update my review if anything new develops.", "Date": "August 25, 2012"}, {"Title": "great tv code for direct tv is 10069", "Author": "rgmitch", "ReviewID": "R1CHZ8APB71Q2F", "Overall": "5.0", "Content": "this is a great tv the picture is perfect and so is the sound its easy to set up and it has so many features i cant name them all .i used a coax cable and use it with direct tv i know thats not hd but  i dont have a hd receiver the code for  direct tv for this tv is 10069 i wouldnt hesitate to buy it again", "Date": "November 27, 2012"}, {"Title": "good value HDTV", "Author": "Mark Schafnit \"JAZNBLUEZ\"", "ReviewID": "R3D3BUFB5OZUXO", "Overall": "4.0", "Content": "pretty good picture and sound for $290, delivered. kinda small, ok for the bedroom insomniacs out there.would recommend in the less than 300 price range", "Date": "November 22, 2012"}, {"Title": "Surprisingly good picture and sound quality.", "Author": "J. Schaffer", "ReviewID": "R3NEFUDAV5SH10", "Overall": "4.0", "Content": "I don't write too many reviews, but knowing how much I make buying decisions based on reviews of others, and considering how few reviews there are about this TV, I decided to add my opinion...We purchased this TV on sale during Black Friday at a price just above what basic 32\" LCDs from other manufactures were selling for.Overall, we're very happy with this TV. It was a nice upgrade to our bedroom tube TV. HD broadcasts looks stunning, DVDs look great, and even SD cable looks surprisingly clean with the Noise reduction setting on just level 1 of 3.  (Higher values make the image look too blocky).Sound is very clear as well.  Certainly not like from my 5.1 system downstairs, but perfectly fine for general TV viewing.  Also, a benefit of this TV is it has audio output jacks, so connecting to even a CD stereo is possible if you want fuller sound and you don't have an HDMI receiver.What I found during research of JVC TV's: JVC licenses the name to a 3rd party panel manufacturer. This manufacturer makes other brand TVs too, but puts their \"premium\" PQ and Sound Quality features into this JVC line.Pros:Great 1080p pictureSD looks really goodLots of image control optionsgood soundaudio outputsUSB input37\" TV's can be hung with a wall mount using only a Single Wall Stud! (generally 40\" + requires two studs). Makes hanging much simpler.Cons:Takes about 20 seconds for bulb to warm up and illuminate on start-up;No web/internet connectivity;limited information about these JVC-Branded TV's online", "Date": "December 10, 2012"}, {"Title": "great tv", "Author": "Miranda", "ReviewID": "R1BEIDSINFOF4", "Overall": "5.0", "Content": "I bought this for the office and its great I just love it, great picture and sound, its all in all a great purchase", "Date": "March 24, 2013"}, {"Title": "Great TV! Great Price!!", "Author": "Swim Mom", "ReviewID": "RYXACZUCAEBI9", "Overall": "5.0", "Content": "Bought this for our bedroom and we love it.  I have noticed it a little slower powering on, but I don't mind. Price was great so I'm not complaining.", "Date": "February 4, 2013"}, {"Title": "disappointed", "Author": "Julie Johnson \"jujo\"", "ReviewID": "R1MG9UQ1KL1F2P", "Overall": "2.0", "Content": "After much research, and being swayed by the reviews, I ordered this tv.  Very happy with picture quality, but sound quality is hugely disappointing.  Have to set it at 70 before a comfortable listening level in a 14x12 bedroom.  My friend just today set up an Insignia brand 39\" led.  I think the picture of the JVC is fAR superior, but the audio on her tv is LOUD at only 20---clearly, the speakers on the JVC are inferior.", "Date": "December 29, 2012"}, {"Title": "37\" TV FOR UNDER 300? GET IT!", "Author": "R. Pace", "ReviewID": "RKFUV1O94BN6G", "Overall": "4.0", "Content": "I bought this tv right away after reading the reviews on this site and wallmart.com in which all were on the money.I only have a couple of nit-picks about the set.One:The mount is very thin if you are planning to mount it on a flat surface, they should have made on with a higher impact plastic one. Don't let it dicourage you, it will be fine as long asit's kept secure away from traffic.Two:The arrows near the ok button on the remote are very close so when you try to hit the arrow for up, down, left or right, you'll hit the ok button and it's annoying.Three:The input selection doesn't dispay for too long like the menu so you have to make your selection fast.Other than those three minor things, this is a good tv so I'll give it four stars. There are plenty of bells and whistles for adjustments and I'm very pleased with it.I paid 279. at wallmart.com which is unheard of for a 37\" and it's holding up great. I called customer service to walk me through the set-up and they were so helpful and patient. Get this tv but keep in mind that it has only one HDMI input. If that's not a problem you'll hit a homerun with this purchase.I'll update as time goes by. If you see nothing, all is well. Go for it!Note: A thing I learned from customer service is if you hit the okay button and then press in 2589, you have the option of refreshing the tv. Go with the first choice, not the second.", "Date": "December 15, 2012"}, {"Title": "JVC/A very good company", "Author": "The Captain", "ReviewID": "R7U42KHJPV676", "Overall": "4.0", "Content": "I received this tv a short time ago and working just fine. The picture quality and sound are good.I will review this again in three months for an update.", "Date": "November 26, 2012"}, {"Title": "great picture, good price!", "Author": "Verlie", "ReviewID": "R219VXMQPVLR7X", "Overall": "5.0", "Content": "It took a week to arrive, and when it did the box had been opened and retaped.  We were very worried that it was damaged.  After taking it out and removing the packaging it appeared to be okay.  My husband connected it without the HD box and the picture was alright, but when connected to HD the picture was great.  So far everything looks great!  Great picture and sound....", "Date": "July 29, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Full HD 1080p Resolution\nXinemaSound System\nDolby Digital 5.1 Decode\nUSB Port\nCrystal Color Enhancement", "Name": "JVC JLC37BC3002 37-Inch 1080p 60Hz LCD TV with Ambient Light Sensor", "ImgURL": "http://ecx.images-amazon.com/images/I/41v1Gk2RX8L._SX300_.jpg", "ProductID": "B007YWM08C"}}