{"Reviews": [{"Title": "Great \"Basic\" TV", "Author": "Zanderdog", "ReviewID": "R33MHQQ83DKUNW", "Overall": "5.0", "Content": "I've had this TV for a few weeks. The choice was between this one and a Philips that had some good reviews. When I went to the store, I expected to buy the Philips, but this one seemed to have a better picture.As with all flat tv's the sound leaves something to be desired.  But I have a Samsung in the other room that has the same issues.  Quite simply you need to connect a sound bar or external stereo to any flat tv to get great sound.As for the picture, at first it was fine, then I played with the settings and put the picture in Dynamic mode and now the picture really POPS!  I guess the energy saver mode that it starts out in really brings things down.  It also performs really well with PS3 HD games, the 120Hz refresh rate really keeps \"tracing\" to a minimum during action scenes or while watching sports.Overall, it's a great value TV, nothing fancy, it does what it's supposed to.I'm very satisfied!", "Date": "August 10, 2012"}, {"Title": "Strictly a Video Monitor, No Audio Out", "Author": "D. COSTA", "ReviewID": "R27K7IVSS7W3DE", "Overall": "3.0", "Content": "The picture quality of this unit is terrific when using the HDMI inputs available. The sound is terrible as others have stated and I would add, worst than most flat screens. In purchasing this unit I overlooked the fact that this Coby does not have any digital or analogue audio outputs to enable a work-around for this major \"sound\" drawback. I have purchased a \"vizio\" sound-bar to make up for the audio, but am forced to use my \"audio out\" from my cable box to push the audio through. This requires the cable box to be locate near the sound-bar which I have wall mounted under the TV. This also means that any other \"video\" device must have its out put directly to an alternative sound device if audio is important to you. For Music, Gaming, and Movies this is a must.For now I use this unit in a bedroom so the logistics work for me. I will most likely use it as a computer monitor when one fails in my office. In the end You get a good quality \"Monitor\" for the money, but it has little versatility as anything else. I would recommend this unit for a bedroom or office for use with a PC or game station with separate audio capabilities. Do not think that the sound quality is something that you will be able to live with. You will be disappointed.", "Date": "October 7, 2012"}, {"Title": "Great Value!", "Author": "S. Ghaemi", "ReviewID": "R1D6F0TDMK00ER", "Overall": "5.0", "Content": "The TV in my office just died a few days ago.  After searching on line and stores, I came across this TV.  It is a great value.  The pictures is clear, sharp and the colors are vibrant.  You definitely can't beat the price!  I highly recommend this TV.", "Date": "August 22, 2012"}, {"Title": "Like the TV", "Author": "SM \"DealFinder\"", "ReviewID": "R265TVTPM96I7A", "Overall": "5.0", "Content": "I like the picture quality.  I use it in my bedroom and it is perfect for that.  The speakers are adequate, not hugely robustbut work well.  The number of controls is good.  It looks like Coby has gotten better with their whole product line.  Overall,a good buy", "Date": "August 21, 2012"}, {"Title": "Coby TFTV3247", "Author": "L. A.", "ReviewID": "RZGHZAFDWFK2K", "Overall": "4.0", "Content": "Decent TV for the price. Picture is clear. There are enough inputs to hook up numerous devices with ease. The TV is pretty durable. While attaching the base, I dropped the TV. No problems after that. Everything was still working fine. I use this TV for my exercise DVDs. It would be nice for a computer monitor. Pretty good TV.", "Date": "August 15, 2012"}, {"Title": "Excellent Monitor", "Author": "LA", "ReviewID": "R1E7ZOC67NEYX2", "Overall": "4.0", "Content": "The first TV I received was defective. Although the picture was good, there were so many stuck pixels they became a distraction.With this replacement monitor, I decided to set it up as a PC monitor since my Dell was getting old and was much smaller.I'm really enjoying this unit. It was very easy to set up to the PC, and I was pleased with the bright, clear color. The best thing about it is the size. I do not see well, and I am thrilled with how easy it is to see things on this monitor. I do lots of editing, and this is definitely going to make my life easier. Fortunately, it just fit on my desk and perfectly matches my black PC and printer.I highly recommend it to those of you who have decreased eyesight. You will love it and will never want to work with a small monitor again.", "Date": "April 27, 2012"}, {"Title": "Satisfied", "Author": "David Porter", "ReviewID": "R3BXIPIJXAXRXE", "Overall": "3.0", "Content": "The picture is great. You can't go wrong with LCD. The 32\" screen is very suitable for your average living room or a bedroom. This can also be swapped out for your computer monitor.Most people will (I expect) use external sound. The built-in speakers really don't sound very good--I think that's par for the course though, so it's not a complaint.A couple things to note: start up takes about 10 seconds and channel changes take about 4 seconds. This unit also puts out some heat in back.This unit is quite easy to use and to set up. This is very affordable for a HDTV.We enjoy having this TV.", "Date": "April 29, 2012"}, {"Title": "Sucks!!!!", "Author": "Robyn Glisson", "ReviewID": "R2LZAAWDLPYK3B", "Overall": "2.0", "Content": "It quit turning on and I had to send it in for repair. The repair process is expensive even though its still under warranty. Now I'm out what I paid for the television, shipping to get it repaired and I have nothing to show for it. Not a good t.v. And to add to that coby customer service sucks, too! I mailed the tv in for repair in April and it is now the middle of July and still no tv! Unbelievable!!! Amazon has been great though. I contacted them and there on the case now. Maybe they can get Coby to actually ship a tv to me for crying out loud!!!!", "Date": "April 30, 2013"}, {"Title": "was good at first then just broke...", "Author": "Stephen Joseph Joens", "ReviewID": "R1HRKPKSM50Y0B", "Overall": "1.0", "Content": "this tv was alright it was functioning good, then out of the blue it stopped working (turned off and wouldn't turn back on). it was nice enough to work until the return window on amazon expired, (literally three months) so i have it in a box in my basement now, waiting to get enough to fix the tv i bought less than four months ago...", "Date": "March 16, 2013"}, {"Title": "Can't get it to work right", "Author": "Natalie Dawn", "ReviewID": "R2HL809251OHAZ", "Overall": "1.0", "Content": "I have tried using this TV as a monitor and all I got was lines and mismatched images. I adjusted EVERYTHING there was to adjust, used it through the HDMI connection, vga connection, it would work ok sometimes but about 75% of the time I had a bad image. That's not even mentioning the dead pixel that is on the screen right out of the box. I even bought a new graphics card thinking that would work and still had the same problem. Gave up on it as a monitor and tried to just using it as a tv, same problem. The unit is bad. With a dvd player, monitor or regular tv most the time I have a bad picture that is mismatched or has lines and this unit has caused me countless headaches and aggrevation trying to fix it. Given all the problem I've encountered with a simple tv I cannot in any way recommend this tv.", "Date": "March 1, 2013"}, {"Title": "Did not work", "Author": "W. Forbes \"Any Failure you meet is never a de...", "ReviewID": "R377E9A6C1HYFJ", "Overall": "1.0", "Content": "The remote control was dead and not working, the TV has no display, Arrived as an old model not new like the description stated.", "Date": "February 18, 2013"}, {"Title": "Customer Service", "Author": "Ben Rosenthal", "ReviewID": "R3Q7YLDCUT93Q7", "Overall": "1.0", "Content": "Received the television w/o a remote. Amazon told us to contact the Manufacturer and Coby told us to contact the retailer (Amazon). Once I pressed Coby they wanted me to print out a form, fill it out, and MAIL it to them and when they received it, they would review it and determine whether they would send us a remote. Completely unacceptable to me. There was no reason he could not have taken the information he needed over the phone and FedEx a remote to us. ESPECIALLY considering it was THEIR fault that they did not QC the box before it left the warehouse. Gives me very little confidence in, makes me hesitant to order anything else from Amazon", "Date": "February 5, 2013"}, {"Title": "Great Product, good price!", "Author": "Dragon1264", "ReviewID": "R38JIHM2GH5K0X", "Overall": "4.0", "Content": "Overall a very good tv with great picture quality. The sound is the only issue. It is not very full with good treble or bass. However, when you connect it to a sound system all is well. A good value priced tv.", "Date": "December 28, 2012"}, {"Title": "What you expect", "Author": "Joey", "ReviewID": "R20XWXTP3ZS6WH", "Overall": "5.0", "Content": "Listen, this is meant to be a gaming T.V, and for that it is a perfect 10/10. The high refresh rate allows for stunning picture quality on those fast frame changing games. If you plan to use this T.v for a living room or something I highly suggest you hook it up to either an external speaker system or a surround sound system. It's audio is what you would expect from a T.V like this, so not the best. If you are a gamer now is the time to get a good gaming head set! Overall great product, highly recommend to others.", "Date": "December 28, 2012"}, {"Title": "Nice average HDTV", "Author": "Zulma Johnson", "ReviewID": "R207AMO37GPW8J", "Overall": "4.0", "Content": "The Coby TFTV3247 32-Inch is a very reasonably priced television compared to other name brand televisions that offer 1080p and a refresh rate of 120Hz.  Too be quite honest, Coby has been a brand I have not had much luck when it comes to smaller electronics such as portable DVD players, digital photo frames and MP3 players, but this is the second television we posses by Coby and there are no complaints.The picture screen measures 31 ½ inches diagonally from corner to corner.  It is not the thinnest LCD 32\" television we have, but it sure is the lightest.  The only negative feature I can comment about is the actual stand.  The TV does not sit very stable on it - wobbles side to side.  I am not worried it will tip over, but the base could have been made a bit sturdier in my opinion.  However, it can be hung on a wall using a wall mount that is VESA standard 200mm x 200mm.For inputs it includes 1 component video, 1 composite, 3 HDMI and 1 PC.For a bedroom or small living room, this television is perfect.  There are no thrills and frills - just an average HDTV that is affordable and easy to use.", "Date": "December 27, 2012"}, {"Title": "Product was defective 4 times but Amazon went above and beyond", "Author": "tania", "ReviewID": "R1UP6XI1L196V2", "Overall": "2.0", "Content": "GOOD THINGS ABOUT THE TV:You can't beat the price for this full hd tv 1080p quality, colors are great, sound is good enough for me despite other reviews I have read (I never set it over 40%, but that is after I played with custom sound settings and made it to my taste)Best thing about the tv is Amazon.com customer service (DONT BUY THIS ANYWHEREELSE where they don't give you the fantastic exchange policy that Amazon does)BAD ASPECTS OF THIS TV:Coby is a brand that must not have any quality control in factory, because I went through 4 tv exchanges and I am finally keeping the 4th one which still has a tiny issue that I am willing to live with due to the fantastic price.two of the tv Amazon sent were defective because tv did not read signal from remote (Caution! you may think that it is simply the remote that is bad, I thought that too and got a second coby remote just to realize that the problem was the actual tv, not the remotes,  which actually did work on a different tv)The third tv I got had a big bright red dead pixel on one side of the screen, extremely annoying when playing dark light movies.Finally, the 4th tv I've receive has a very small white (not as bad as bright red) pixel in the center bottom. At this point I am keeping the tv as is because I only notice that pixel in certain situations and when I go look at it, but remote works, and you can forget about that screen flaw while getting immersed in a movie.So I think you cannot have 100% quality for a $240 full 1080p hd tv with 120hz refresh ratio; for me I had to chose whether to live without remote control (not an option) or having a small screen factory defect that to me is not worth paying $400 more to get the same 32\" full hd from Samsung. And I know I don't want a 720p HD with just 60hz that would leave trail in high speed movement, I much rather compromise with the small pixel. In that sense, the specs of the Cob y are really great (in only the screen or remote sensor worked fine)If you decide to purchase this tv be prepared to inspect it thoroughly and know that you may have to either return it or compromise. Also, don't forget to add the 3year extended warranty you can buy separately from Amazon as well, I am sure I will be calling the warranty guys in a year or so. At least, I am covered for 3 years.In any case, Amazon was absolutely wonderful with their policy. I give Amazon 5stars.Just as a note, some reviews say that the screw to attach the base is missing, I don't know if that is totally accurate, but I can tell you in advance that the screw comes screwed to the TV post base, that you need to take it off before putting the base (sandwiched between tv and screw) and screw it back on. The screw does not come loose anywhere on the package, look at the base of the TV. The instructions don't mention that and I also thought the screw was missing.", "Date": "December 18, 2012"}, {"Title": "WoW!!!", "Author": "Libby", "ReviewID": "R1YGJW2BAX5LIF", "Overall": "5.0", "Content": "The picture is great, have it pluged in to my direct tv reciver for audio sounds great. Much better than I had hoped fore. The price can't be beat. Recived it in 4 days after I pushed the buy button.. Some buys are good and this one was.", "Date": "November 1, 2012"}, {"Title": "No Issues, sweet bang for your buck!", "Author": "Deployed", "ReviewID": "R1RJOT485X2P2Q", "Overall": "5.0", "Content": "No issues with the Coby TFTV3247 32 inch 1080p 120Hz Widescreen LCD HDTV.  Shipped to me in Afghanistan at an APO address, arrived in great shape, packaged carefully.  Picture is awesome, zero lag for gaming, plenty of inputs on the back.  I didn't see any of the old A/V inputs (the Red White and Yellow ones) however.  For the price, you won't do any better than this.  I've had it for a little over a month now.", "Date": "October 10, 2012"}, {"Title": "Excellent Buy", "Author": "Jodee Holbert", "ReviewID": "R36YB7SJMSDDWE", "Overall": "5.0", "Content": "The picture quality is really good ! I use it in my bedroom and it 's just perfect for that. I found this to be a very good buy and would buy Coby again.", "Date": "September 10, 2012"}, {"Title": "Great Deal", "Author": "T 5 Alive", "ReviewID": "RT0E0XW6XR0RM", "Overall": "5.0", "Content": "I purchased the TV for my son and thought it would not be a top notch product but was very happy with it.  The picture is crystal clear and dark and light areas hold nice detail.  I may get a second one.", "Date": "September 10, 2012"}, {"Title": "Great picture, but abysmal sound, and only a 90 day full warranty!", "Author": "M.D. Edwards \"Avid Aesthete\"", "ReviewID": "RDM55FMZ84QP4", "Overall": "2.0", "Content": "*Update* I arrived home just this past Saturday to find that my Coby TV was obviously still on (the lamps were clearly lit), but that the picture was fried out. I'm on the phone with Customer Service now, and so far, I've been reminded (hate how it's only once something's gone bad that you remember the guarantee on it was comparable to the newly-perceived quality...) that there's only a 90 day full product warranty. The first agent that I spoke with told me that I could take it to a local repair shop, and have them figure out what the problem is, and what part needs replacement, but that I'd have to cover the cost of labor, and wait for the part to be shipped. I asked to speak to a supervisor, and the agent put me on hold. When the original agent picked the phone back up, he offered to extend the full warranty, but explained that I would have to pay to ship the TV back to them, as well as enclose a $30 money order to cover the costs to ship the new replacement TV back to me. This was all after calling multiple times within their stated business hours Saturday, but getting no answer, then hearing a message saying that they're closed, and to call back during normal business hours (which, again, I was), or that I could leave a message, which I then found wasn't possible as their voicemail box was full.The TV has a beautiful, vibrant image, which I'm really missing, now that I have my older Sharp LCD back in place, but I really do, now, find myself questioning how much of a value this TV really is if it's dead after only 99 days of use (I was on vacation for twelve days recently, so, out of my 111 days of ownership, it's been actively used only nine days in excess of the duration of their full warranty). At this point, I just feel bad if my previously glowing review has encouraged anyone out there to buy this TV, as I feel my encouragement could put others at risk of spending your hard-earned money on a product that might very well not be worth it. At this point, I'm not sure whether or not I'm willing to dish out for shipping costs on this TV, since I just don't know how much I trust Coby and their products now...* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *When I write anything (reviews, emails, text messages), I aim to be as thorough as possible, which, honestly, ends up making my writings pretty long and verbose. In considering exactly what to write on this Coby TV, though, it's pretty cut and dry for me: the picture quality on this TV is top-notch for what you're getting in this (and an even higher!) price range, but the sound is simply abysmal, which is why I deducted a star.At its price, this Coby TV is a great choice if you happen to be in the market for either a really big computer monitor, or a smaller-size TV, AND you happen to have an external audio source. In my case, I'm fortunate enough to fit all of those requirements. So, in light of that, this TV works perfectly with my current entertainment system's setup. The picture comes through unquestionably as HD from all of my external media that are connected via HDMI, and said picture is sharp, and as clear as the best that I've seen out there. The AV signal that comes to this Coby TV via my coaxial cable (through which I receive simple basic cable) is, obviously, NOT HD, but it still delivers a pretty clear picture even from that substandard connection.I had previously had a 32\" flat screen Sharp TV (whose model # and specific details I don't recall right now, but I'll be sure to update my review with them) connected to my entertainment system, and it IS a good TV, but the color quality and image on THIS TV is GREAT! The only other high quality image that I had at my regular, personal disposal to compare image quality to previously was what I see on my current computer monitor as transmitted via my video card. That image is sharp, clear, and brightly colored (thanks to a quality computer monitor, for color production). This Coby, when I'm watching anything via my Xbox 360, for instance, leaves nothing to be desired for me in the sharpness and color saturation of the produced images... Really, I'm being redundant here because the picture really IS great from this Coby, and it just makes me want to wax poetic on it (but, I'm NOT a poet, so... )!As stated before, the only place that this Coby falls short IS the sound. As another reviewer stated, it DOES sound abysmally like it's being routed through an old-fashioned radio. The sound produced by this TV is hollow-sounding, and, really, it's just pretty crappy, to put it bluntly. Anyone that doesn't have an alternate speaker system to route this TV's sound through won't be able to deal with it long-term, I am positive. Truly, think of the worst-quality sound that you've been subjected to in the recent past. Now imagine what that would sound like if it was five times worse. That's at LEAST as bad as this Coby's audio quality, but the audio quality from this Coby TV, even still, might just be even worse than that! It really IS that bad! So, again, if you happen to have an external sound system with a receiver, you won't have to worry about that, since your audio will be routed elsewhere, but if you're relying on this Coby's speakers as your sole sound source, just don't even bother with this TV.In my case, the only issue that I've encountered really is the fault of my receiver's manufacturer; out of, easily, 45 different TV manufacturers (and I would bet money that it's more like 65 different ones), my Onkyo receiver does not accommodate Coby TVs regarding its universal remote. Really, it's not a big deal that I'm stuck keeping the Coby remote around to turn the TV on and off, and to switch the input to the one I've currently got selected, but, for me, it IS still an annoyance...Long story short, I feel that, for all of the connections that this TV offers, and the image quality that it presents, it's really very well-priced in comparison with its competitors. Unless you have prior experience with a given manufacturer, you really don't have any way of knowing if what you buy that's made by them will be worth the money that you've paid for said product. This being my first Coby TV, I can confidently say that the image that I am enjoying from this TV is right up there with its better-known competitors. The sound, however, is going to be this TV's downfall for anyone without an external audio source to connect it to.Hope this helps! Happy shopping!*UPDATE* Regarding the remote, mine never quite worked right, and it DID become enough of an annoyance for me (and Onkyo really was no help in giving me codes to get this Coby to work with my Receiver's remote), that I opted to go out and pick up a new universal remote. I ended up going with the Logitech Harmony 300 Remote Control 915-000143. Setting that remote up was a bit of a trial, as MyHarmony does NOT currently have an active code for THIS specific model, were you to type in this TV's model number, but they DO have a code for the Coby TF-TV3227 that DID finally control my TV on my new Logitech universal remote, so if you opt to use a Logitech Harmony remote to control your A/V equipment, try putting THAT model number in the MyLogitech field instead, and hopefully it'll work for you, too...", "Date": "May 2, 2012"}, {"Title": "Garbage", "Author": "sb D \"S. Cb\"", "ReviewID": "R1MCJ6F1HXS2NL", "Overall": "1.0", "Content": "My mother bought this thing.  I wish she would have asked me.  The thing eventually would run at an awful frame rate, into the single digits, until it finally died.  It lasted a little over a year.  Now it's a paper weight.", "Date": "November 28, 2013"}, {"Title": "failed within six months", "Author": "biggscpa", "ReviewID": "R3H2SQAF0XCL96", "Overall": "1.0", "Content": "I bought two of these for the kids rooms.  both failed within six months. I have heard from others that this is not unusual for Coby.  However, I still have larger COBY that is still working fine.", "Date": "November 12, 2013"}, {"Title": "Love it!", "Author": "Susan Schultz", "ReviewID": "R22H2V2VENW4XI", "Overall": "5.0", "Content": "The merchandise got here soon than I anticipated and it is just what I had ordered. I am very happy with the service. I have had no problems", "Date": "April 9, 2013"}, {"Title": "Nice picture, horrible sound", "Author": "ikennedy", "ReviewID": "R175K47O44GV81", "Overall": "2.0", "Content": "I bought this because I was looking for a new TV for an extra bedroom. A 32 inch LCD 1080 120 Hz for under $240.00, said why not. Right out the box, the TV had green color and lines through the screen. I was hoping it was just a setting but come to find out its a defect and had to send it back. Once the new TV came, the problem was gone. The picture is nice and clear but the sound is horrible. I highly recommend having a sound system for this TV.", "Date": "February 26, 2013"}, {"Title": "Three strikes and your out!", "Author": "Tiffany L. Ekins", "ReviewID": "R27PAO6I30UYG8", "Overall": "1.0", "Content": "I purchased this model Coby for my sons Christmas present. After getting three defective TV's I have finally given up and purchased a different brand. I was very disappointed when I called Coby, they told me that if I wanted the TV fixed under warranty I would have to pay for shipping both ways and repairs may take up to one month. They suggested that I return the TV back to the retailer for better service.Worst electronics customer service I have ever experienced.", "Date": "January 29, 2013"}, {"Title": "Waiting for broken remote", "Author": "Julie Groce", "ReviewID": "R2PBB2TXMXMB5J", "Overall": "3.0", "Content": "My remote was broke and it has been over a week since I returned it! Can't watch the tv without remote. Has anyone had any issue with remote, we need a code for a universal remote and can't find it anyone help please!!!!", "Date": "January 27, 2013"}, {"Title": "Sound is HORRIBLE!", "Author": "Kerry Graham", "ReviewID": "R3BHHG3UR0R08P", "Overall": "1.0", "Content": "We have to watch the TV with the Volume all the way to 64 and it sounds the same as ti does at level 35. The remote doesn't work very well either. I would NOT recommend this TV to anyone!", "Date": "January 25, 2013"}, {"Title": "Limitations, but good overall", "Author": "T. K. Paul \"imatyak\"", "ReviewID": "R2601UG1UH00XP", "Overall": "4.0", "Content": "Channel set up was easy, though our ten digital channels don't come in the same as our other TVs. Digital channels are available only after you've gone through the analog channels.  On our other TVs, the digital channels are mixed in with the analog.  (For instance, our analog ABC station is channel 6 and channel 6-1 is the digital version of the same station.) I have attempted to correct/change this, but have not been successful. I am probably overlooking something that may be obvious to others.The picture is not nearly as good as our Vizio, but my husband thinks it could improve with a new cable.  When my son was home from college, he played Xbox on this TV and was pleasantly surprised by the picture quality.  (He used RCA instead of HDMI hookup.) The sound is a bit tinny, but not too bad. The HDMI and RCA hookup is on the side, which is quite convenient. The cable hookup is on the back of the TV, but does not protrude.  Much like a computer monitor's plug, it faces down and is recessed. This makes for much better cord control. The TV is somewhat thick for a flat panel, but feels fairly solidly built. The weight is typical for a 32 inch. Base was quite easy to attach and it is possible to mount the TV, though I would purchase the TV before the mount to determine what type might be best.  I do not think all mount types would work.The remote is different than any I've seen. Button placement is quite awkward and hard to read. It's not my favorite, but there is a sleep timer - which is more than I can say for my TCL TV remote.Overall, I would recommend this TV if your expectations are not extremely high for sound and video quality.  I enjoy watching movies on the TV quite a bit more than watching cable, so I'm pleased.", "Date": "January 6, 2013"}, {"Title": "There is cheap and acceptable  and then there is this Coby", "Author": "M.L.", "ReviewID": "R2YEC700M91H84", "Overall": "1.0", "Content": "It is possible I got a lemon; however, that says more about quality control from Coby.First the positives.The TV comes with 3 HDMI ports, which is often over looked with the low cost brands.  This will allow you to have a cable box, Blu-Ray player, and a gaming system all hooked up a the same time..The picture is quality is good. The colors show through well. The color required adjusting at first use because the reds were to high in comparison. It is a 1080p TV. The blacks are more a darker gray.Now the negatives.I was one of the lucky recipients of not receiving the screw to attach the base to the TV. This looks like the issue has a high percentage of occurrence.  Definitely an issue with the manufacturing process.I have a major issue with the remote, which is why I believe I may have a lemon.  The remote quits working after it is more that a foot away from the TV.  I put a new batteries in the remote just in case the batteries that shipped with it were bad.  The issue remained.  I triple checked to make sure there is no film covering the sensors on the TV or remote. No filmSound Quality is horrible.  While the sound in many flat screen TVs is bad, this is worse sound I have heard from any flat screen TV.The plastic bevel, scratches easily.  I hardly bumped the bezel with the base and now there is scratch on the front bezel.  It is not deep but noticeable.The plastic on the TV shows why this is a low cost TV.  It has the cheap feel.Based on the experience with this TV I cannot recommend it.  If you are on the fence, my recommendation is to go to local retailer and look at the low cost models they have in stock. Realistically, I would suggest saving up a little longer and buy a better TV.", "Date": "January 1, 2013"}, {"Title": "Not 120hz as advertised", "Author": "Phil Etzel", "ReviewID": "R3BB8ISS00C89X", "Overall": "2.0", "Content": "This TV has been one big disappointment. The picture looks very pixelated when playing bluray movies through my HDMI cable which i have tested on another TV. When using it as a monitor using the VGA cable the picture has some fussiness to it and i can see lines across the screen.I sent it back and got a replacement thinking maybe i got a defective one, but the 2nd one had the same issues plus a stuck pixel that i couldnt fix. I will be returning this one today and will be looking for a better brand that will be a little more expensive.I would not recommend this TV to anyone who cares about picture quality.", "Date": "December 27, 2012"}, {"Title": "1 month old, sound but no picture", "Author": "A. Sutorius", "ReviewID": "R2X8ENHAG2IZEC", "Overall": "1.0", "Content": "Buyer beware with that price. I'm a pretty technically savvy guy and I researched \"lcd hdtv sound but no picture\" on the internet. Turns out this is a very common problem for lcd hdtvs. Well that's great however, I have to get the tv fixed instead of watching it. Not exactly what I was hoping for when I bought the tv about one month ago. Shame on Coby. You should be using better built capacitors!! Buyer beware.", "Date": "December 25, 2012"}, {"Title": "Terrible LCD from COBY", "Author": "NRGspot \"mike@centrella.com\"", "ReviewID": "R2FH8C64M6FTIQ", "Overall": "1.0", "Content": "This LCD looks good by it specs and price... But buyer beware... I returned the first one and opted for a replacement after the first malfunctioned... Second one also went bad within minutes of installing... Finally requested a refund... Brand stinks! However Amazon's return service rocks!!!", "Date": "December 23, 2012"}, {"Title": "Concerns from factory", "Author": "Carl Patterson", "ReviewID": "RDZF2KDVOCK5R", "Overall": "4.0", "Content": "The only concern I have for this TV is that I had to replace the first one due to loss of picture on the screen.  Coby rep advised that unit had to be replaced as they had experienced problems earlier with this model.  A new one was shipped out immediately and so far there have been no issues.  I have requested info as to extended warranty due to problem with first one.", "Date": "December 23, 2012"}, {"Title": "Coby 32\" LCD 1080p, 120Hz, HDTV", "Author": "John M", "ReviewID": "RENKXTQ9BP1BO", "Overall": "3.0", "Content": "Easy to set up, picture is good, but sound quality is very poor.  There are setting for sound, which helped at little, but it stills sounds like you are in a tunnel.  A home theater sound system might be the answer to this concern, but I have not tried that option yet.", "Date": "December 7, 2012"}, {"Title": "Missing Screw & lackluster sound", "Author": "Adam champoux", "ReviewID": "R31NMAKR5TCQF4", "Overall": "3.0", "Content": "*IMPORTANT*If your TV is missing the screw for the stand use a: \"METRIC4 X20MM PH PHIL screw\" I purchased this TV as a birthday present for my girlfriend but was let down when I was trying to set it up but it was missing a screw for the stand. I then researched other reviews only to find that it had happened to other buyers. I ended up having to buy about 10 different kinds of screws and found out that a METRIC4 X20MM PH PHIL screw to work for this TV since I didn't want to wait 2 weeks for Coby to send a replacement screw. The only thing that I found pleasing about this product was the picture quality , but the sound and color where sub par. If your willing to take a risk with this tv it's a good deal but I would recommend to do some research by actually reading reviews before buying a new TV unlike I did.", "Date": "December 2, 2012"}, {"Title": "Junk. I will return ASAP. 3 dead pixels. Missing hardware as well.", "Author": "KaraandRyan2", "ReviewID": "RKWFSTKU5HIF8", "Overall": "1.0", "Content": "I received a broken TV. It was missing the screw for it's stand and it had 3 dead pixels. The batteries for the remote were still good. That's a plus. Also, the sound on this thing is terrible. Worse than the cheapest laptop speakers... Not happy with this purchase.", "Date": "November 28, 2012"}, {"Title": "Great value for price", "Author": "Michael Burns", "ReviewID": "R2M0NE23X9JB8G", "Overall": "3.0", "Content": "Great picture, Sound is very poor, plan on buying a alternate sound source. Overall worth the price paid even with sound quality.", "Date": "October 10, 2012"}, {"Title": "For a little over $200? Who can complain about the minor faults you should 100% expect from a Coby?", "Author": "Green Desert Home", "ReviewID": "R1MOVJ8NDVOXJ3", "Overall": "5.0", "Content": "We have found two tiny faults so far. First, a little piece of trim between the screen and bezel was not cut short enough, making a little bulge in the upper right hand corner between the screen and bezel. So what? I will just snip it and tuck it in if it becomes a bother. And do you think Coby could pack two good batteries for the remote, instead of dead ones leaving me with that sinking feeling that I got one of the DUD sets when the remote would not turn the TV on? Sure they could. But on the other hand, after five minutes of problem solving, I thought to try two fresh batteries, and sure enough! Worked. Then I was really happy I did not have to send it back. Whew! Quite a way to create customer satisfaction.I have not tested all of the inputs yet (had to go back to Amazon for some cables for various devices around the house), but I suspect they work as well as the ones I have tested. (I will let you know if not.) And the picture, fine. Audio? Sucks, just like other reviews report. But again, for just over $200? Unless you check under your mattress for peas and insist on wooden hangers for your clothes, who really cares?", "Date": "December 29, 2012"}, {"Title": "Great for the money", "Author": "javier torres", "ReviewID": "R8MNWO5WPYQU3", "Overall": "5.0", "Content": "It has plenty for my son to attach xbox, computer, and tv. The price was fantastic, I will be getting another one.", "Date": "December 26, 2012"}, {"Title": "Great value for the price...", "Author": "D. Beck \"ddbyrd\"", "ReviewID": "R2OTNB9EFO04EC", "Overall": "4.0", "Content": "Bought this as a gift for my son's birthday - He loved it!! Easy to set up right out of the box, I recommend this!", "Date": "December 24, 2012"}, {"Title": "Great, but fragile", "Author": "J. V. Carone \"JVC\"", "ReviewID": "RF1MMMY8WJPJJ", "Overall": "4.0", "Content": "The first one I received was dead on arrival, unfortunately.  The replacement is working fine, but I'm very delicate with it.This TV is perfect as a second monitor, and for my X-Box station.  The price is great, and the quality of image is excellent.  The picture needed a little adjustment as it was far too bright at first, but it was easy to take care of.I'd definitely recommend this TV, just don't jostle it around too much while unpacking or setting it up.", "Date": "December 8, 2012"}, {"Title": "Great picture, work well, not too bad sound", "Author": "Michael T", "ReviewID": "R3V7AIIF9ZBL7I", "Overall": "4.0", "Content": "Well I have heard some very bad review about sound, quality in Amazon, but also this is what I need, 120hz for gaming and 1080p hdtv with a great price I can find. I believe that 30 days return/refund policy with Amazon is their honor, so I give it a trySet up not too difficult. Only used it for PS3 gaming, play smooth with some fast-paced action games (thanks 120hz, it really, not just advertised). Ready to hook up the HDMI. Picture is clear, not great, but good with the price it come with. The sound is not too bad like some review you have seen, but I am an easy person so if you're picky, please dont care what I said. But honestly, the sound is acceptable for itselft, and I still have my really old Logitech S220 system for watching Neflix or Amazon Instant Vid.After all it's a good HDTV for the price compare to another one same specs. However, I will updated the review if bad thing happen. I have bought 3 year Squaretrade, never trust Coby unless it show me something with this one. Have read the review with the guy and the tv dead after 99 days. Well, God Bless You, hope I will never have to call SquaretradeP/S: I dont really know much about customize HDTV, if anyone owe this TV before, can you tell me how to customize to get the best picture it can show. How about Contrast, Color and some Mode. Thanks in advance", "Date": "October 10, 2012"}, {"Title": "Coby TFTV3247 is bad TV, but its monitor is bad too", "Author": "W. D. Smith", "ReviewID": "R1OSSZT3CK1J7L", "Overall": "1.0", "Content": "I read the bad reviews before ordering this product, but being a life-long tech guy, and only wanting a big PC monitor, I thought my experience could be different.  Yes, it's a bad TV as everyone says, but as a PC Monitor, I found it completely unusable.  I know how to change display resolutions and refresh rates on my computer, but I could not find a combination that was compatible with the TFTV3247.  On boot up I could see BIOS messages, but as soon as Windows launched there was no display.  In addition to various resolutions and refresh rates, I also tried Window's Safe Mode and Window's VGA mode.  I was never able to see a display.  To make things worse, Coby's Tech Support is equally useless.  With most monitors, the manual provides a list of usable resolutions and refresh rates.  This manual doesn't, so I called Tech Support.  Coby does not provide their Tech Support team with this information.  They told me to call the maker of my graphics card!!!!  Simple logic... if Coby can't tell me about Coby products, what do they think the graphics card maker can tell me about Coby products?  I persisted and finally reached the Tech Support manager named 'Migel' and discovered why his team is so rude.  Migel is rude.  He argued and badgered and kept telling me to call the maker of my graphics card.  I persisted until he hung up on me.  No help; no answers; not even a simple list of compatible resolutions and refresh rates.", "Date": "October 17, 2012"}, {"Title": "Good TV with Lackluster 120Hz Performance", "Author": "richard", "ReviewID": "R2B970JE5FHWME", "Overall": "3.0", "Content": "Ok, I bought this TV almost primarily for its 120Hz capacity at its price pointMy first intention was to see if I could use it as a PC monitor using the HDMI out from my PC (that has an NVidia GTX680 video card) I'm partly happy to report that it indeed works but at 60Hz only. In fact adjusting the resolution in Windows 7  states that 1280 x 720 is the \"Recommended setting\". With that noted, if you want to know more about the PC Monitor experiment read more below.As a TVAs with most TV's the factory settings need adjustment but there are enough presets to go through, and adjusting them will help get a balanced setting. The menu items are straight forward using the controller to adjust the changes.The one thing I found lacking was the 120Hz performance. As good as the broadcasts look, watching sports didn't appear to benefit from it. I could see ghosting and blurring as I would see on a standard 60Hz TV set. I looked at several different sports channels and couldn't see that any of the broadcasts benefited with the 120Hz feature.With that noted, the picture quality is about as good or better as one could expect from a similar priced 60Hz TV.Solid blacks and good support of mid tones and color make for some pretty nice viewing.For Console GamingThis TV is real nice for gaming. I attached the XBox 360 and ran several games. Great color and sharpness in all games tested with great response time.For PC MonitorMost important to note - You need to disable Overscan in the Picture/Advanced Video Options to get your desktop to fit.Using the HDMI out from my PC, the Colby does an OK job in the 32bit color department. I'll state right here that I would NOT use this to edit pictures in Photoshop. Its probably a combination of low color gamut and at 32 inches, the colors in images  start to band - almost like looking at a Gif where you can note bands in color gradients. I'll also note that text is not sharp.If  you're simply going to visit sites, do non graphics work, and game, it fills that bill nicely. Given that its not an advertised featureNow for PC Gaming, note that as a monitor, it has at least a 7Ms or more response time. Not exactly the best response time but workable depending on the games you plan on playing. The other thing is 32 inches is big, you'll need to back away if its on your desk or your peripheral vision advantage will be lost.I attached some pictures showing the Windows 7 Desktop and running Battlefied 3The real downside is seeing others reviews noting the missing base screw. That's what happened to me which required me to find a metric screw that would fit it at Home Depot. That alone takes off one star.3 StarsSo one Star off for having no base screw (as others have mentioned) and another Star off for not performing as I expected it to in 120Hz. Seeing other TVs at 120Hz, the Colby falls well short.SummaryThe saving grace of this TV (for me) is its ability to perform as a good PC monitor (60Hz)using HDMI, something that isn't even advertised. For TV viewing and console gaming platform it holds up very well against similar priced TVs. It was close to 4 Stars but I simply don't see the 120Hz advantage which is the key reason I bought this TV.ProsEven tone and color - edge to edge even at varying viewing anglesNo light bleedGood Variable viewing angleNice blacksEasy intuitive controlsConsMissing the base screw120Hz not notable - blurring and ghosting was present in various sports broadcasts", "Date": "December 19, 2012"}, {"Title": "DON'T DO IT!!!!", "Author": "Richard A. Parent \"Rick\"", "ReviewID": "R1H0XLY3VO1C2N", "Overall": "1.0", "Content": "2 bad right out of the box` First one had a run-away volume - after 3 days the volume would take off on its own and go all the way up or down all by itself. The only way to get it to stop would be to unplug the TV.` Second one right out of the box came and the remote wouldn't work. The DirecTV remotes wouldn't work either but did on the first one. I called COBY and the jerk on the other end said that the DirecTV remotes don't work regardless so I need to have COBY send me a new remote. He emails me the instructions for replacement. It would take two weeks and it would cost me $6 to replace a brand new remote still under warranty.`Sound - sounded like it was coming out of a tin can`For the price I don't expect the moon but they should at least work.`In both cases I also purchased the extended warranty` I had no trouble at all with 1 exchange and 1 refund from the seller, fast turnaround for replacement and full refund` Also full refund of extended warranty without a problem", "Date": "October 15, 2012"}, {"Title": "Good for the money.", "Author": ",...", "ReviewID": "RSMOPFQ07HNY8", "Overall": "5.0", "Content": "Works great from the first day. Good picture, features and remote control. Works well with my laptop plugged in with an hdmi cable.", "Date": "June 24, 2013"}, {"Title": "This things a beast, great for gaming", "Author": "Jacob Gutierrez", "ReviewID": "R1TBSO6RQ2GJIE", "Overall": "5.0", "Content": "A lot of peopel complain about the name, but the specs are all top notch. Ive had mine since last November and still running strong. I will say the speakers arent hot, but its a small TV and I like sound bars/headphone better anyways. In the first few monthes I played easily an average of 6 hours atleast.", "Date": "May 15, 2013"}, {"Title": "Very good TV especially concidering the price. Great value.", "Author": "rranderson", "ReviewID": "R16D0BPFS52KZD", "Overall": "4.0", "Content": "This TV has a very good picture, audio has a little to be desired but after all it is a tv. Picture is sharp and clear, have not seen any pocture break-up during action sceens.", "Date": "December 21, 2012"}, {"Title": "Service is", "Author": "Faceman130", "ReviewID": "R1LGRW3SVSVZGG", "Overall": "4.0", "Content": "Service is one of the most important things I've found online products. Quality is number 1 how a seller handles my product as well as me. I believe I got that it took a little longer for it to get over here to Afghanistan thean other things I have bought. However, when it got here I was amazed at the careful packing buy the seller he apparently took his time with it. Sadly and Gladly, sadly the TV was not for me it was for friend of mine here in Afghan who could not  order it himself, so I have never seen it play. So I cannot comment on picture quality, but we tested it first it cut on fine, he has not complained one tiny bit so I think it is safe to say he happy. Gladly I promote this seller to anyone looking for anything he is selling, it looked like it was brand new and for what my friend payed. For a 32\" 1080P \"120\" Hz  you would be hard pressed to find a better deal!! :-D", "Date": "December 4, 2012"}, {"Title": "You get what you pay for.", "Author": "Parish", "ReviewID": "RFX0KV2NTZA44", "Overall": "2.0", "Content": "I understand that Coby is a value brand, but what came in the box was simply unacceptable for anything.  It had two dead pixels right out of the box and was completely missing the screws to mount the screen to the stand.  Aside from that the screen was sharp and the picture was nice.  As others have said, the sound is pretty awful.  It's not as bad as people make it to seem, it's just more of a \"underwater\" type sound.  I'm sure some people could live with it if they REALLY don't care, but for most people I'm sure it would bother them.I'm sure my item was simply a lemon with the dead pixels.  But having dead pixels right out the box and Coby's infamous reputation for customer service, I'm not willing to gamble on a replacement and have the same problem a few months down the road after the product is not able to be returned anymore.  I'd rather fork over the money for a reputable brand and not worry my TV will die every day.As with most value-brand items, you roll the dice and hope the savings don't compromised the quality.  This time I lost.  Luckily Amazon is allowing me to return it.  While I am disappointed, I'm not really surprised the quality was so low since a similar product from Samsung costs around $700.", "Date": "November 9, 2012"}, {"Title": "USELESS!", "Author": "MIZ BHAM", "ReviewID": "RSK56T3ABMWTH", "Overall": "1.0", "Content": "THE TUNER WAS TOO WEAK. THE TV WOULD TAKE SUPER LONG TO COME ON, THEN WOULD CONSTANTLY FLICKER AND BLACK OUT. SO ANNOYING, WHAT A CHEAP UNIT!IT JUST COULD NOT CATCH NOR MAINTAIN THE OPEN-AIR STATIONS THAT MY THREE OTHER TV'S COULD. I RETURNED THE UNIT IMMEDIATELY.", "Date": "November 18, 2012"}, {"Title": "Audio is horrid", "Author": "Michael Ratliff", "ReviewID": "R20HSWP2J8H8VY", "Overall": "2.0", "Content": "I love the picture on the Coby TFTV3247, but the audio is horrid. It sounds like a small portable radio instead of a Doby equiped TV. It's bad. I have to assume that is not the way it is suppose to sound. Now the TV does come with a 3 prong power cord, but my outlets only except 2 prong. It's an old house. I had to use an adapter to plug it in. I am postulating that the problem is that I am not getting a good ground. That is until I can determine otherwise.", "Date": "April 21, 2012"}, {"Title": "Came with missing piece; warranty service is slow", "Author": "Michael J. Descy", "ReviewID": "R2XN71T6L1UOC1", "Overall": "2.0", "Content": "I am a little frustrated with my experience with this TV. The hand screw that you need to secure the TV to its stand was not in the box. I got this through Amazon Vine, so I could not return it. I emailed product support right away, and got a response about 12 hours later (the next day). I was told to fax the information I had already emailed to product support. I did so, and it's been about 2 weeks, and I still havent gotten the missing part. It's very frustrating--it's just a screw, but without it, the TV could fall over with the slightest bump.Otherwise, the TV is a pretty good value. It has a nice picture and tinny sound. It is acceptable for a bedroom TV, and would benefit tremendously from external speakers. It can be used as a computer monitor through its resolution is really too low for such a large panel. It is not super thin, either, so if looks from the side are important to you, look elsewhere.", "Date": "May 16, 2012"}, {"Title": "Absolutely the worst I ever owned", "Author": "HenryH", "ReviewID": "R2WISTQQ1MIMPS", "Overall": "1.0", "Content": "Granted, I only owned this TV for two days. I got this TV through a rewards program my credit union has through VISA. It is a fine looking TV. When I first set it up it took over an hour of fiddling with it to get it to turn on. The picture was actually very clear, crisp and my DirecTV HD looked excellent. I was really glad to see how beautiful the picture looked. I watched all my favorite shows for about three hours. I turned the TV off and went to bed. I got up the next day and hit the power button but nothing happened. I tried all day long but never was able to get the tv to go beyond having a black screen with no sound. Luckily the rewards company took it back and replaced all the points I spent on the TV. I am going to the store and buy a known brand with an extended warranty. Coby has a rotten reputation online for custormer service and all their products have bad review scores. This was not worth the time and effort I spend on it and I will definitely not buy another Coby product. I am surprised these people are still in business.", "Date": "April 30, 2012"}, {"Title": "Bad experience", "Author": "Mario Peterson", "ReviewID": "R2M1DX7DLPKOU8", "Overall": "1.0", "Content": "I recently bought this tv and was excited to have gotten it for such a reasonable price. When I unpacked it and set it up, the picture quality was off a bit, I mean like the color of the pixels were not totally lined up rifgt. I tried adjusting the color, but that didn't helpTo make matters worse, after about 10 days i turned on the tv but no picture/no sound. I contacted amazon and they sent me a shipping label to sent the tv back. The problem with that is that i live in the bahamas and to sent thetv back will still cost me about $175.00. So no way I'm doing that. now I am stuck with a defective tv and out of $269.00 plus $180.00 I paid to have it shipped to the Bahamas.", "Date": "September 7, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "32-inch  Widescreen LCD HDTV (1080p) 120 Hz Refresh rate\nDTV-ready with dual ATSC/NTSC tuners\nHDMI digital connection for perfect AV signal transmission\nHDCP compliance for HDCP content support\nAV input jacks for use with media players, DVR/VCRs, video games, and more", "Name": "Coby TFTV3247 32-Inch 1080p 120 Hz Widescreen LCD HDTV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41CrzVjaxVL._SY300_.jpg", "ProductID": "B007PXV310"}}