{"Reviews": [{"Title": "The flagship of Samsung may destroy Samsung", "Author": "Mohsen Babaei", "ReviewID": "R5LJD3L47EBNU", "Overall": "1.0", "Content": "So hopefully you're reading all the one- two star reviews because they are true and all of them happened to me. I am going through my second UN65ES8000 (65\" Smart TV) and feel I owe my feedback to the community.Here are the PROS that upon usage become serious CONS:Stylish, such a thin bezel and equipped with a Web Cam unlike any other TV, Lots of Apps , quick access to Samsung customer support, I have not yet noticed the light escaping from the corners as some reviews indicated. The best outcome of this TV is the 3D picture and the engine that converts 2D to 3D. I love its 2D-to-3D feature because it is not as intense and therefore irritating that the 3D movies can be sometime. For me even the cheaper and lighter glasses work fine (Set of 4 comes with each TV purchase) but not sure people who have to wear prescription glasses agree with me; there is not enough room.Here are the CONS that kill all the PROS except 3D function:As many reviews mentioned clouding is a major issue with this top of the line, over-priced flagship of Samsung. Watch \"Cowboys and Aliens\" in HD reception and the Movie mode so you can see disgusting night scenes with clouding and pixelating. Bright scenes of daylight have excellent picture resolution and colour quality.No matter how hard I tried I could not get the face recognition to work in signing in Skype and with the flimsy Remote Control you have to make sure not to hit \"EXIT\" button adjacent to the curser keys or you'll lose few minutes of your day every time typing in your password.Don't buy this TV if you're interested in Motion and voice activation. The Motion menu pops up for no reason but the worse is when you need it. Each time after waving my hand in the air several times I end up jumping up and down with my hand in the air like a monkey and the TV is not responsive. It is true that you have to do this in a very well lit room, otherwise forget even trying. The voice activation to turn the TV On works but to turn it off or other limited commands the volume of the TV prevents the built in MIC to understand you, and finally comes up with the message\" Please try again at later time\"Now what will kill Samsung is the poor quality control of this TV when it's assembled in Mexico. As I mentioned I'm going through the second one because the first one purchased DEC 26 2012 start having vertical fine lines across the screen and only in few days it reached the point that I could not get the TV running long enough to reset it to the manufacturer's setting so I can wipe out my personal information for YOUTUBE, SKYPE and Netflix before returning the TV.  Luckily BestBuy replaced it with a new one. So far the second one has not shown any signs of random rebooting and Vertical lines but all the misbehaviours on the part of Voice and Motion control, clouding and poor black background remain the same.As I said the Samsung Apps are great as long as the Samsung Server is operational. God knows how many times I set-up Netflix and Skype and next day they were wiped out of Apps section because according to the customer Service the Samsung server was done for last couple of weeks.I could reach customer service very easily each time, but they never solved anything and worst of all they completely denied knowing about  the defective TV's with vertical lines and random rebooting. Samsung must have received not only 1000's of calls about this defect but people have returned 100's of defective TV within few days of purchase. Shame on you Samsung for lying!According to customer service my faulty TV might had been damaged/mishandled during the shipment. That might be true although the cardboard box arrived in a perfect condition.  Considering many of the low-ranking reviews if all of these TV's were damaged during the shipment and not because poor and unqualified Mexican workers mis-assembled them for peanuts; then Samsung is responsible for making these TV's so fragile that with a small puff of air they break beyond repair.All the features that excel this product vs. its counterparts have failed to perform even in the fraction of acceptable level. I didn't care for any of these gizmo's except picture quality and the 3D effects.  In final I am putting my second TV in test by running it as long as possible, so if it is destined to break, it breaks while I can return it for refund this time. Having it repaired under manufacturer warranty or the worst case scenario when the-on-year-manufacturer warranty runs out is absolutely unacceptable.", "Date": "January 18, 2013"}, {"Title": "Fabulous Picture & State of the Art LED", "Author": "Ricoflashback \"REM\"", "ReviewID": "R2MU8DNUZLB3W7", "Overall": "4.0", "Content": "08.31.12 - Update for vertical banding issue.  As mentioned before in my review  - - I do not want to give up on this set because the picture and features are flat out fantastic.  Filed support issue with Samsung back on 08/20/12 to have vertical banding issue addressed.  Initial \"fix\" was to have new LCD panel shipped & swapped out on TV.  Received a call today from Samsung - - due to delay in getting panel, they will provide brand new UN65ES8000.  If that doesn't fix the problem they will swap out, upgrade/downgrade or refund entire purchase amount. I've heard others complain about Samsung support but so far, they have been very responsive.  To be continued...08.15.12 - This review is for the Samsung UN65ES8000.If you're looking to buy a big screen TV, I hope this review helps you understand the benefits and drawbacks of this model.  My setup is as follows - Yamaha RX-A2000 receiver, Sony BDP-790 Blu-ray player, DirecTv HR-22 receiver, OTA antenna with all connected to a Belkin Power Console PF30 downstairs in my \"man cave\" in Colorado.My previous TV was a Samsung DLP HL-T5676, which gave me 5+ years of great service until the picture started to dim a little bit.  I bought an OEM replacement bulb (BIG MISTAKE !!! Replace with Phillips Original Bulb & Housing) and it exploded in the set after ten seconds of being turned on. I wanted to upgrade anyway, so I decided to look at 65\" to 70\" technology.I compared the CNET ballyhooed Panasonic Viera TC-PC65VT65 inch Plasma as well as the Sharp 70\" 847U.  I originally ordered the Sharp but they couldn't deliver the set and I cancelled the order.  I'm glad I did as the picture quality and 3D is no where near the Samsung visual experience.  The Panasonic Plasma looked OK but the 3D was terrible.  I cannot believe CNET's rating on this set (more on that later).  And...it generated a lot of heat - - it was amazing to look at the sets on the showroom floor and physically touch the Plasmas compared to the LCD/LED's.  You could dry your underwear on the Plasmas - - they were that hot.  I have been told that those in the know prefer Plasma TV's but I just couldn't bring myself to buying that set after seeing the brightness and thin design of the Samsung 65\".A word about where to buy your TV - - I ended up purchasing from a local retailer - Paul's TV - - they matched prices, the salesman was great and so was the Manager for the Colorado market as you will see later.  I am also going to purchase an extended warranty online from DTV Express as this is much cheaper with full five year coverage priced at $239.00.The main benefit from buying from Paul's was the delivery of the set and a thirty day guarantee (replace the set, no questions asked).  The first TV came in and I noticed that the shipping container was a little crushed on the right side.  Sure enough, the LED panel yielded a vertical line on the right side and subsequent horizontal lines near the top of the screen.  Paul's replaced the TV pronto and everything is in working order.First impressions - the good and not so good:Good - Absolutely stunning, fabulous picture.  I mean, it's like you're behind the camera and shooting the scene.*  Very thin bezel, elegant design - - very sleek looking.  I can see where people who hang this set on the wall can get in trouble - - the thinness and lightweight attributes requires you to be extremely careful in working with the panel.  Low power consumption - stays cool to the touch even after hours of use.*  Great color \"out of the box.\"  I read CNET's review of this TV (07/10/12) and even went through the painstaking settings they recommended.  Quite frankly, the standard settings on the TV worked out much better - - far better than the \"expert\" calibration settings.  I have the Disney WOW Blu-ray disc and will look to tweak with that later.*  No clouding, bleeding, spotlighting anywhere.  Black levels are fantastic - - again, contrary to the CNET rating.*  Setup was easy, the Audio Return Channel works great and the \"Anynet+\" connectivity is a nice feature.*  I haven't done anything with the applications, yet, but there is suppose to be a lot of free 3D content from Samsung's site.  I connected to the Internet via the ethernet cable as opposed to the wireless setting.  To me, it's easier to setup a router and it is faster as well.*  Motion and other \"bells & whistles\" are turned off and here I agree with CNET - - I really don't need or want these but they do come with the TV and if you like that sort of thing then see for yourself how it works.*  3D is stunning - glasses are comfortable, lightweight and easy to wear.  Again, the 3D experience with the Samsung combined with the DirecTV channels makes this a real winner for 3D viewing.*  Future upgrade path - hardware - with \"Smart Evolution.\"  I do not know how much this will cost but the concept is pretty amazing - - upgrade your TV to the latest and greatest processor & technology.  To be determined....Not So Good:*  Very faint vertical banding on scenes with extreme white background.  Right now, it's not a deal killer for me and I can adjust the picture to virtually eliminate this artifact.  I have very sensitives eyes and can note detail very well.  Other folks might not notice this at all.  I have been told that this is a by product of edge lit LED's.  I am not sure if this is the case, but again, it's not a deal killer for me and the positives far outweigh the negatives.*  Concern for product reliability.  My experience with Samsung products and support has been very good.  I see that other folks have not had that experience.CONCLUSION:  A definite \"want\" over \"need,\" but so far I've been very happy with this set.  Again, picture quality and 3D is the best out there as far as I'm concerned - - at least to my eyes.Concerns over reliability and price can be mitigated by working with a solid retailer (if you have one in your area - - I used Paul's TV and Costco is also an option WHEN they get this set since it is so light that you can bring it home yourself.)  Extended warranty - - a must in these days to protect your investment.  All in all - - very happy with the purchase, so far, and it really makes my home theater experience much more enjoyable.Hope this helps.", "Date": "August 15, 2012"}, {"Title": "Think twice about buying a 65 inch", "Author": "M", "ReviewID": "R18JL9P4KQPO3I", "Overall": "1.0", "Content": "Going to try and keep this short.If you are thinking of buying a 60inch version or below, you'll find that picture quality is good and if you wanted better, you'd really want to go the plasma route with the understanding that for the increased picture quality you get with the plasma you end up with some disadvantages (babying the tv more to avoid image retention).  Ok, now for the real reason I am writing this:The 65 inch model is flawed/defective.  I learned the hardway.  Search for vertical banding on the internet and in these reviews and you will see that the 65 inch sufferes from this defect.  Not sure why, but it is there and you will just not be able to find one that doesn't have it from all my research.  I recommend you search AVS (audio video science) forums, other 65 inch reviewers, and internet in general and don't just take my word for it.If you must have a 65 inch screen I would encourage you to look at other brands and other models, or at a plasma.  This TV is good if you don't mind having a 60 inch or below.I sincerely hope this helps someone avoid the hassles of exhanges and dealing with Samsung customer service as me and some others have had to go through.", "Date": "January 18, 2013"}, {"Title": "Awesome TV!", "Author": "Steve M. Keck \"Kecker\"", "ReviewID": "R23I8ONSQ2TYX7", "Overall": "5.0", "Content": "Samsung UN65ES8000 65-Inch 1080p 240Hz 3D Slim LED HDTV (Silver)I had researched Samsung, Sharp, and Panasonic TVs in the 60-75\" range and chose the Samsung 65\" given reviews read, experiences with other Samsung products, and features available.  The SmartHUB UI is intuitive and easy to set up.  I wish Amazon Video on Demand was available - I could/would drop my Netflix app if that were the case.  Speaking of Netflix, the app is impressive.  The web browser is a little clunky to use, likely need to get more familiar with the keyboard and mouse.  WiFi setup was simple, as was the entire setup process.Samsung UN65ES8000 65-Inch 1080p 240Hz 3D Slim LED HDTV (Silver)My 13 yr old daughter mastered the voice control in minutes, and has fallen in love with the new TV.As for picture?  Wowzer!  We have watched a few Netflix pics, YouTube digital vids, and tonight's 49er - Seahawks game on NFL Network in Hi-Def.  Each time we've watched the TV we've been amazed.  We upgraded from a 5 yr old Sony 50\" flat screen and while that was (and is) a workhorse, the quality of the picture on the Samsung is nothing less than spectacular.  I've used default settings to date (occasionally swapping from Standard to Natural to Movie and all around depending upon the channel) and it's all been great.I also updated my Logitech U-Remote to the new TV and other than one snafu (of my own doing) the transition has been flawless - the only function I do not have is the mouse control (and I'm working on that!).The TV has been around for a week so comparisons are fresh - as we move further into our experiences I am confident the impressions will remain positive.  And if anything signifcant changes I'll post an update herein.Last comments - I purchased thru Amazon - the TV arrived on time and the gentlemen who delivered it asked me what I wanted to do each step of the way - they took me to the point of power on making sure there wasn't any significant defects.  While not quite a \"Geek Squad\" or \"Magnolia TV-Audio\" level installation, the guys definitely were top notch with their service, friendliness, and willingness to go as far as I'd like with assistance.June 2013 Update:  The WiFi failed on my TV and since it was covered by the 12 month warranty the Samsung replaced the unit as expected.  The failure occurred mid-stream and none of my other wireless devices lost connectivity, the Samsung BluRay sitting in the cabinet beneath the UN65ES8000 TV had no issues either.  The hassle, if I were to call it that, was proving the failure.  After walking through the online troubleshooting steps, performing a factory reset (which explicitly states it will not reset the WiFi settings!) the device would still not find any WiFi networks (no surprise).  I called Samsung support - they wanted me to walk thru all the same steps which for any of you who have done this know, is painful and loses all your settings.  All is good, though, as the router was replaced (design fail - gee Samsung, why wouldn't you have created a separate panel to replace the device instead of requiring an entire backside dis-assembly?) and the connection's up and running.  The serviceman was informative and helpful - he also shared that the router / wifi failure is a common issue on this model.  Other than this one issue I still love my Samsung 65\" TV!", "Date": "October 18, 2012"}, {"Title": "This set is Awesome!", "Author": "brobox", "ReviewID": "R2E2K5JDN96HGS", "Overall": "5.0", "Content": "I can NOT believe the number of negative reviews this set has received.  I almost didn't buy it because of the negative reviews until I went to HHGreg and compared the 65es8000 side by side with the other sets on the floor  The picture was the best in the store!.  With Amazons 30 day return policy, and seeing a perfect picture, how could I go wrong?  I was not a bit disappointed right out of the box, it was almost perfect.  I came off of a Sony Bravia KDL-52BR4 which was top of the line less than 5 years ago.  The Sony next to the Samsung 8000 looks like an old CRT set.  After reading the reviews here, I ordered the Disney WOW calibration DVD and I hardly made any corrective adjustments to my set as it was delivered.  The minor adjusts I did make, made this set perfect.The \"Soap Opera\" effect that some have mentioned looks like PERFECT depth separation to me, almost 3D without the glasses and that is what we upgraded to 3D for.  There are NO dark corners that others have referred to, there is no dark anything.  All of the pixels are perfect, all the test with the WOW DVD came out perfect, the set was delivered working perfect.  Follow the \"Quick Start\" guide, read the instruction on what settings work best and there is NO problem with this set.All I can say is disregard the negative comments on this set, it is about as perfect as it comes in my book, and my viewing pleasure.  Don't hold back buying one because of the negative comments like I did, go see an 8000 in person, you will be very surprised.I have a Yamaha Amp and Energy Take Classic speakers by Kilpish making this an awesome entertainment center.  I was surprised how good the 8000 built in speakers were before hooking up the surround sound.  This is an amazing TV and worth every penny.  It was a $100. less than my Sony was 5 years ago.  I did catch the 8000 on sale when a $200. gift card was given with the purchase.", "Date": "January 6, 2013"}, {"Title": "Stuttering Picture", "Author": "gl \"gl\"", "ReviewID": "R1JSOSZ5XHR0HO", "Overall": "1.0", "Content": "Nice looking TV, but the picture stutters, I calibrated it, still stuttering. I wanted to love this TV, but it just doesn't cut the mustard. Just called Amazon for return. Will try Sony or LG.", "Date": "September 1, 2012"}, {"Title": "Poor Quality Control", "Author": "aceospds", "ReviewID": "R1AR6O0KRMGA96", "Overall": "1.0", "Content": "I want to start off saying I love all most all of Samsung's TV's. I own 4 of them and this is the only one I am dissatisfied with. I purchased the UN65ES8000 65-Inch and have noticed several performance problems. On some lighter colored screen images I notice what appears like rays of light coming from the top and bottom of the screen. The repair technician said it is common and that Samsung will not pay to replace the screen because it may or may not actually fix the issue. The repair technician also told me that if they did approve to replace it the screen they might replace it with may fix the problem or it might even be worse. Well after he submitted his report Samsung told me that after looking at the images of the screen that it is operating within their specs so they will do not do anything to resolve my problem. Since I am past my return date I am now stuck with an inferior picture on a TV that cost over $3000! Some other issues I have encountered, on several occasions the voice command just pops up and locks out the audio even though I did not try to activate the voice commands, I was forced to just shut down the motion and voice command feature because it happened so many times. The Smart Hub also has had many problems, sometimes it wont connect to the internet and none of the apps would even function. The TV looks great, very sleek design, but maybe they went too skinny and in order to go so skinny they created some of these problems.", "Date": "January 16, 2013"}, {"Title": "Banding problem", "Author": "Isehara \"isehara2\"", "ReviewID": "RHD6FL8GCZGFM", "Overall": "1.0", "Content": "I received this 65\" TV on 2/7/13. I was hoping that it would be problem-free, unlike the experience of many. Alas on day 2 it developed banding problems. These are vertical bands that you can see when the camera pans across a field. It seems like a soccer game really reveals this problem. When the camera moves across the field you can see areas of light/dark (vertical) bands. I cannot see the bands in any other scenes during the game, such as closeups, goal area, etc. If you are a soccer fan then this problem is an absolute killer.  The TV also has very significant edge light bleeding during dark scenes in some movies.  The pluses are that it us a very beautiful picture during well-lighted scenes, and the 3D is just amazing. The TV is incredibly attractive with its bezel and the thin panel. The picture goes out to the edge of the TV because the bezel (border) is only about 2 cm wide. I have a Z-line Cruise TV stand and it sits beautifully on it.  I bought it specifically from Amazon because I did not want a hassle with exchanges, and this is what seems to have happened. I received the TV on 2/7, and called them on 2/10 (Sunday) to send it back. They are going to ship a new one and have the delivery people just swap out the defective unit. It took < 15 minutes to arrange this, and AMZN was amazing; they did not fight me on the return in any shape or form. I never buy anything more than $200 from any 3rd party sellers - it is better to pay more for Amazon service.  You may ask why I persisted in ordering this TV again despite all the bad reviews and the dud I received. I really like Samsung in terms of the picture and the look of the TV. I compared Samsung to the Sharp Elite and the Sony XBR950 at Best Buy; I liked the Samsung better for picture quality and brightness. The Sony was not as bright as the other two despite being set on a similar dynamic setting. The BB rep, who was very knowledgeable, did this fine-tuning. He also agreed that Sony does not output as bright a picture. For all the great reputation of the Elite series, I liked the ES8000 better in terms of broadcast programming picture. Also do not forget the 70\" Elite is $7000 at BB and the Sony is $5200. If you want a 65\" then I believe the Samsung for its price is a good option, if it works. I do not want to spend too much as I think that in 4 - 5 years OLED or 4K will be entering as a new standard. I do not want to pay 7K for an Elite, which probably is my next choice.  I am keeping my fingers crossed and hoping that the next unit works. My plan is that if this also is defective then I will get an ES7500 60 inch; it appears as if this has less problems. I will update this review one I receive the new set. I will say that this whole ES series is not for those who want to buy without risk. If you fall in this category then look to another brand or the 7500 series from Samsung.Update 2/15/13 - I received the 2nd TV yesterday, and presto it had exactly the same problems. It was actually worse on this TV. Any sport where the camera goes across a field, like soccer and basketball, you can see this vertical banding going across the screen. If you are a soccer fan then you need to get rid of the TV immediately.  I called Amazon and they are going to pick up the TV on Monday. I will not order another ES8000 series, even though I like the look of the TV and the 65 inches. They are great TVs for movies, but not for sports. Samsung ought to be embarrassed for selling this TV. Obviously they did not do due diligence and proper product testing. This is terrible for one of your high-end TVs. The only TV more expensive is the 75\". I am shocked that a great company like Samsung would do this. Look at many of the other reviewers on this site and AV forum, etc. Many have had the same complaint with multiple TVs. Basically it is like showing a middle finger to your customer, and hurts the company over the long term.  I have a Samsung UN40B6000 which has worked great for almost 4 years; I plan to now buy a ES7500 which seems like it has much less problems. I still like Samsung for a bright high quality picure. But they have hurt customers and the company by the ES8000 garbage.  Who in their right mind is going to buy the 2013 F8000 series which are supposed to come out soon? Anybody who had a bad experience like me is surely going to wait to see if these are also flawed. Also any person who does some basic internet research must have some hesitiation about the quality of the 2013 series, based on the ES8000 customer reviews. Samsung is just plain stupid in this regard - this is how you chase away customers and degrade your reputation. They are obviously focused on releasing a new TV every 6 months, without enough regard for the quality.", "Date": "February 10, 2013"}, {"Title": "Lottery", "Author": "Adam", "ReviewID": "R2UCXUAKKM2XTD", "Overall": "1.0", "Content": "I usually don't write reviews,however I do read them before any making purchase. I kind of feel obligated to write something as courtesy to other customers.So, are your ready to enter 3,500 USD lottery ? Do you feel lucky ? If the answer is yes, go for it. This TV (65inch) has great picture and gives you full access to tweak it to your satisfaction.The problem is Samsung quality control. It looks like margin of error is very wide there. I have actually went through three panels and each of them had so called \"banding\", which are stipes of light going from the top to the bottom of the screen. They were visible only on certian colors (blue, green). Each panel had them in different places, but they were there. Watching anything with panormaic movement of the camera was basically impossible.I do understand that some spots of white are quite normal for edge light techonology but seeing them on regular programming was simple not acceptable for me. This unit has great 3D, great design and all other stuff, which I didn't care for. At the end, them most important is the screen. In case of other issues, please be aware that this model has very bad angle vieweing, so be ready to fight for your \"Sweet spot\" on the sofa. Some features were very strange,especially automated light dimming in darker pictures. It looked like someone is behind the panel with light switch. If you intend to watch this TV in bright day, you will not see anything in dark scenes. At the end, only \"Film mode\" has been acceptable.My final decision was to return this unit and wait for full array led lightning Sony XBR950. I had a chance to see previous model (929) and the screen uniformity was perfect.", "Date": "October 15, 2012"}, {"Title": "Amazon Excellent Customer Service - Samsung No Quality Control", "Author": "Kevin M", "ReviewID": "RDYNCS4CUROWN", "Overall": "1.0", "Content": "After buying Samsung TV's for over 10 years and being very happy with them I will never buy a Samsung product ever again.  I originally purchased a Panasonic TCP65-ST50 and whilst the picture quality was fantastic I discovered I was susceptible to seeing Plasma lag (I can see yellow flickering in the whites), so I thought it was time go back to Samsung.  I was originally put off by some of the bad reviews but when it reached the right price I thought why not.I have now had three replacement TV's and all of them have suffered from vertical banding and flashlighting from the bottom corners, I cannot believe that Samsung's 2012 flagship model suffers from these faults, do they have any quality control what so ever?  What would it take to turn the TV on and check the panel uniformity before putting it in a box and shipping it out? As Amazon's return policy goes up to three (I didn't want another return anyway) I thought I would contact Samsung directly and an engineer visit was arranged for today between 9am- 12pm.  I was told the engineer would call me 2 hours before arriving, well I called the service centre at 12:30pm and was informed they would call me back, it's now 10pm and still no call back; it looks like Samsung lack of quality control also extends to the repair centres they outsource to.Enough is enough so I called Amazon today to arrange return and full refund, life is to precious to waste dealing with companies (Samsung that is) who don't seemed to be the slightest bit concerned about quality control and customer satisfaction.  I can't believe that up until now I have always recommended Samsung to friends and family, well I will never do that again and they have lost a once loyal customer; I was even thinking about about making my next phone the Galaxy S4 but there is no chance of that now.On a positive not I have nothing but good things to say about Amazon's customer service, they always seemed customer focussed and dealt with my enquiries/complaints in the most professional manner, I will purchase my next TV through Amazon, it just wont be a Samsung.", "Date": "April 26, 2013"}, {"Title": "Great as LED's go.", "Author": "Claudio Pozzi", "ReviewID": "R12RWECOKYOA0Z", "Overall": "4.0", "Content": "Have had our UN60ES8000 for 4 months now. This is a uber attractive model but that usually is the case with this brand and looks are not the most important for some, how it handles is... We own 1 Pioneer (the best Plasmas ever made from my point of view) and 3 Samsung top of the line Plasmas due to Samsung's great knack for the plasma picture quality on their higher end models. This was our first LED and we researched for quit a bit before taking the leap to LED and even more time on which brand to choose. This Samsung won out for us. But boy is it an adjustment from only watching Plasmas to these LED's, takes a bit of visual adjustment on the consumers part, I dare say maybe even lower expectations. I feel you make a sacrifice; plasma= best picture quality even from a corner or side if you will but heavy,hot,not energy efficient enough and harder to see in bright rooms. LED= lighter,super thin,energy efficient,does not run hot,better in bright rooms and looks great on the wall but not as good picture quality and bad side view ( gets less sharp and brighter) And known for bad back lighting uniformity. But like their higher end plasmas I do believe Samsung's LED,s and LED 3ds are one of the best right now and I have to admit my TV has far better 3d then any of our friends. So with that said I will move on to something very important, when you set this tv up take a sec to go on cnet or a Samsung thread and get its recommended/ suggested picture adjustments, this is very important and unfortunately  can take upwards of 15 minutes just to make all the changes more if you don't have someone reading them out to you, but trust me its necessary otherwise it will be like watching a cartoon and will have tons of shudder during fast movements and bad backlighting. Once these adjustments are made you can then do some of your own tweaking if you like, but remember it takes time for the set to be properly broken in (like a car).Also these LED,s work best with true HD (1080p) form like on play station video games and true HD (1080p-Bluray) movies. Some of the other reviews complain about the voice control popping up or the motion control popping up, Ours is wall mounted and the motion pops up rarely when the kids wave Their hands unintentionally but not often unless  you try and the voice only does when you say\" HI TV\" or push the touch pad remote. I think proper adjustment to the height of the TV and camera can fix the motion issue. Or even better just turn these features off. the TV is equipped with 2 remotes a Universal, and a smaller touch pad type. We use our Direct TV remote and our voice control to run ours mostly. Comes  with 4 3d glasses and if you want more (we have 8) they are around $20 a pair on this site. I really like the smart hub feature (TV apps) its convenient and I put my top four on top (Netflix, Amazon prime)And can just run these from the TV instead of turning on the play station. So all and all I like this TV.  Would have given it 5 if it was a plasma with all the physical features of a LED but you can't have everything. If you remember anything from this post it should be adjustments. We tried one set of adjustments and tried them out for a month then found a different set on a thread and are happier with these ones especially when it comes to the backlighting. Found the best adjustments so far on AVS forum site.", "Date": "April 8, 2013"}, {"Title": "Terrific TV  - But Not Perfect ***Update 1: Lowered to 3 Stars***", "Author": "PkFloydLvr", "ReviewID": "R3FCMLXV69S3C0", "Overall": "3.0", "Content": "I researched newer HDTVs for weeks before pulling the string on this purchase. Amazon/Pauls TV had  the lowest price and offered free White Glove Delivery from southern CA to central OH. The TV arrived on the 7th day which was also the last day of the delivery window. (More on shipping later.)The TV has been in service for 24-hours, so my experience is limited. Given all of the good information offered product reviewers, I am returning the favor by sharing my thoughts thus far, updating as appropriate.*** Selection of the Samsung UN65ES8000 65\" ***My long time main screen is a seven year old Hitachi 42HDT79 UltraVision Cineform 42\" Plasma. This model remains one of the best displays I have ever seen. It is time for an increased screen size given the larger viewing space of a new family room. Calculations indicated a 65\" screen was a bit on the \"small size,\" but larger screens command a healthy premium. Once installed the 65\" screen seems almost too large for us; seating distance is 15 feet from the face.We visited the normal big box stores, plus some home grown outlets. My heart was set on a larger plasma, but their performance did not match my expectations. As we viewed the 100+ screens (all set on \"high\" brightness - my retinas almost hurt from the exposure) only one jumped out above the rest. I had the salesman adjust the screen from Demo to a more natural setting and I knew this was the right set.Other goodies important to me: - The TV can be updated via an easy chip swap. - Smart functions, including wireless internet browser via Blue Tooth keyboard/swipe pad. (I use a LogicTech K400 - cheaper than Samsung's overpriced version.) - Several smart apps, including Amazon's Prime and rental videos. - Good 3D, although that was the least of my criteriaThe box store negotiated price, but would only drop their bottom line by $100 - and delivery was another $80. I price shopped many outlets over the internet and settled on Amazon for a nice savings and free delivery.*** Shipping and Delivery ***Shipping from southern CA to central OH was scheduled for 5-7 days. It arrived at my local terminal on Day 6, and was delivered to my home on Day 7.Home deliver was via a common carrier offering the \"White Glove Service\" (WGS). What a huge disappointment, frankly. The two delivery men showed up at my door on the last hour of their 4-hour window (which was okay by me). Delivery from the truck to the family room was attacked as if they were players in the midst of a Ohio State vs. Michigan football game. The final straw was when they slid the box down the carpeted steps to the basement. Whatever grime accumulated on the box bottom between the factory and my home was transferred into my neutral colored carpet, as were their boot prints. After two hours of scrubbing I took a break to formulate my next attack. At least the WGS men said they were sorry - I bet they do it again, though.The box had deep crush/cut areas across the top about 2' from each end. Inspection of the TV indicated no visible markings to the set. With the top off the box the TV rests on the bottom shipping skid. I was told the WGS protocol is for the TV to be plugged in as it sits on the skid and a few basic strokes of the remote to check function. That was it. I have no complaint about the \"testing,\" just understand the buyer is responsible for lifting the TV out of the shipping skid to the stand, table or wall brackets.*** Setup ***First off, there is not a printed instruction manual provided with this TV. For something priced nearly $3,000 I expect a manual. I did find an electronic version online, but was not impressed. I blew up and printed some illustrations prior to delivery; they were usefully for set up.Setup is mostly intuitive, though a manual would answer some early questions. For example, the TV did not recognize the cable box initially. Eventually I found the \"Inputs\" selection and made adjustments. Note the remote control does have a handy Input button, but I totally missed it the first 10 or so minutes.WiFi setup took only as long as typing in my password. The unit was recognized, then immediately downloaded and installed file updates without prompting. Impressive.*** Initial Performance ***Just as many have noted, there is a noticeable \"spot light effect\" on the four corners of the screen. However, the effect is present only on certain static, gray backgrounds, like an apps or set up screen. Active color video is wonderful thus far. No other adverse visual issues. I will monitor and return the set if required.I selected the \"Normal\" screen display and streamed videos, cruised cable broadcasts and played a BluRay DVD. The color and overall display is exceptional. Out of the box color settings are a touch off to my taste. I will use the TV for a week or two then perform a calibration.In comparison to my 42\" plasma the new screen is just huge! The plasma color quality is better and images perhaps a bit \"softer,\" while the Samsung has a picture that is so accurate/sharp it has a surreal, almost unnatural effect. Not bad, just very, very different. It will take a bit to become accustomed.Fast action sports is worth the 240 Hz refresh rate. No blur at all. I watched golf (yes, golf!) on a 120 Hz model that had a terrible blurring effect when zooming towards the green. The grass appeared more like soft moss until the zoom motion ceased. The 240 Hz Samsung has nothing but perfectly sharp images.BluRay videos are simply amazing! Again, the sharpness is hard to describe, but seems almost exaggerated.I have not tried 3-D, voice recognition or hand motion (other than in Setup mode).*** Summary ***I am truly aggravated with the White Glove Service severely soiling the carpet. The \"spot lights\" on some menu screens is a distraction and - hopefully - not a harbinger of future issues. (I purchased a warranty for an additional three years - via another firm - at a huge discount.) The picture quality is outstanding where it counts, though a good calibration is worth the effort. I will update as appropriate.***Update ***3-D Glasses: The TV comes with four sets of active glasses and button style batteries. The glasses must be assembled and the batteries installed. Installing the batteries is a pain because the access flap will not open by sliding \"upwards\" as the arrow indicates. You must also press firmly at the bottom of the flap while sliding upward pressure. The power/sync botton is very small; I often think I have engaged the button but have not.3-D Performance: 3-D video is nothing short of incredible! The every popular coral sea videos bring snorkel, diving and sharks to the tip of your nose. I find this unit performs 3-D much better than at IMAX theaters.Streaming: This is a hopeless (and very disappointing) cause with the \"flagship\" of Samsung's TV fleet. After hours of testing the issue has to be in the TV's software. My network tests at 22MIPs wireless. My Samsung wireless BluRay player streams flawlessly for hours on end. I can not stream for more than two minutes or so with this TV.Spot Lighting: As I reported earlier, this is very pronounced on set up and Samsung title screens.  Monochrome backgrounds are likely to experience this flaw. They can not be seen when watching videos or TV broadcasts.Streaking: I have noticed very, very light vertical banding at approximately the left and right third of the screen. This can only be seen on static, light colored monochrome displays; as with spot lighting, it is not an issue when watching video.Motion Control: This is beyond an unneeded gimick. I disabled it after it started changing channel and volume settings if someone set down on the couch. This is useless and a waste of technology, IMHO.Warranty: I purchased a 5 Year total warranty from Square Trade at under a hundo via a warehouse club.Summary: I am very disappointed with the nagging Samsung software issues. Upgrades to this system can not come soon enough. Streaming is lost on this unit, as are the hand motion features. The imagine is good so long as the spot lighting on setup screens doesnt bother you.Samsung must fix these quality issues or their reputation (and future sales) will suffer.I have lowered my overall rating to \"3 Stars\" because of poor performance ancillary features.", "Date": "April 3, 2013"}, {"Title": "UN65ES8000", "Author": "Szott", "ReviewID": "R1SXD77DQU9OJX", "Overall": "5.0", "Content": "I researched for hours/days/weeks/months...decided on this.  Saved and saved and saved..  Finally found a way to buy it and waited impatiently for its arrival.  I took the day off work to be there when it came home.  When I unboxed it and hung it on the wall I found it...broken.  Ugh!  I called Amazon to ask what to do and they handled EVERYTHING!  They ordered the pickup/return of the broken tv, the order of the new one, upgraded my shipping at no cost and as if they hadn't done enough, they gave me a 10% discount to compensate for my pain and suffering!  I always buy everything I can from Amazon and that is why.So anyway, this TV is exactly what I was hoping for.  I've owned it for a few months now and I'm still impressed when I see it.  It's interface is intuitive, it's great with our XBox and for watching sports, shows or movies .  We haven't even begun using the \"smart tv\" features too much so more fun is on the horizon.  Well worth the money and initial trouble.", "Date": "December 13, 2012"}, {"Title": "One of a Kind", "Author": "Smackafatty \"Smacka\"", "ReviewID": "R1DWBUW10DPGIJ", "Overall": "5.0", "Content": "Well, this review is not about what others have experienced, although I feel their pain. After reading the reviews (all of them), I took the plunge, and I am so glad I did. I set up the TV per the instruction manual, and that is it. XBOX 360 and PS3 are awesome on the 65\" unit. I have Samsung's 3D Blu-Ray player, and the 3D is great. I have no issues whatsoever with this TV. Now, is the voicecommand, face recognition and motion control flawless? Nope, and neither are those features on any other product. I have the flagship Garmin with voice activation. When I asked it to find the Hilltop restaurant, it said \"Did you say to wanted to go to the Goatship restaurant?\". The technology for voice and motion is not there yet. I believe that with the ability to upgrade this TV, once the technology catches up it will work much better. The TV connected easily to my network, and stays connected unless there is a problem at the service provider. The 2012 3D version of Avatar is incredible. I have no problems with the 3D glasses working properly. Again, all I did was follow the directions supplied with the TV. The only feature I have not checked is Skype and the onboard camera. I do not expect issues with this feature.***UPDATE***9-months after I purchase this TV, it started to reboot on its own (cycle on, off, on, off etc...) and then the screen would show nothing but vertical colored lines in between reboots. We called Samsung on a Sunday night around 8-PM. They tried to get us to complete some minor troubleshooting over the phone but could not get the normal screen to access menus. Samsung stated they would have a repair technician contact us within 48-hours. The next day by noon, we received a call from a repair technician. He stopped by at 1:30-PM and made it so we can use the TV. As it turns out, the WiFi adapter is faulty. He unplugged the WiFi adapter and will replace it once Samsung ships a new adapter. This has been a perfect response to a problem with the TV.I want to emphasize that Samsung did a fantastic job helping us with our problem. It is obvious that Samsung received a bad batch of WiFi adapters from their source, based on all the same reviews I have read about the self-reboots and the vertical colored lines on the screen. Things can and do go wrong. It is how you address them once it happens that is most important. For that reason, this review stays at 5-stars. Oh, and my TV works just fine with the WiFi adapter unplugged. The only thing I needed it for was to complete any firmware updates, as my Xbox and Samsung Blue Ray player both have internet access.Happy in Weedville, PA", "Date": "December 4, 2012"}, {"Title": "Awesome Picture! Love it!", "Author": "tlos \"Tony\"", "ReviewID": "R38E0EUU9U7EOX", "Overall": "5.0", "Content": "I was scared based on some of the reviews but my friend bought one and loved it.  It was just delivered and was set up by Amazon as promised.  Watchung HULU now and it looks spectacular.  Would recommend to anyone.  Will update after I have spent some time with it.  Please note I mainly bought this tv for picture quality and not the smart/3D features.**Update #1** So last night I watched a 3D movie just to check it out.  I was actually surprised by the clarity of the 3D.  It seemed to match the quality you would see in a theater, but on a smaller scale.  The glasses are comfortable also.  Netflix, Hulu, Pandora, HBO Go, Amazon, and the apps all seem to work fine.  The motion control and voice controls do not interest me at all so I have not turned them on.The first picture setting I turned off was Auto Motion Plus.  This removed the fake looking \"soap opera\" effect.  Otherwise the picture quality looks great to me on and I only hope to improve it through calibration.I played Call of Duty Black Ops II in 3D and 2D and it was crystal clear.  No issues with gaming that I could find.The only issue I have noticed is a color bleed (I think that is what they call it) in the corners and a large spot in the center.  It's only noticeable when the screen shows black or a dark scene.  It really does not bother me but I did call 800-Samsung to ask about it.  The rep was very pleasant and offered to have a local technician come out just to make sure it's not defective.  Some forums I have read say this issue is common with LED's and can be fixed with the picture settings.  I will play with that and see what the tech thinks and report back.  Even with this issue I am head over heels with this tv.**Update #2** After using WOW to calibrate and trying the expert settings I still can't get rid of the white ghost blob in the center.  It was really bad on the HULU app menu and during The Walking Dead.  Samsung has a local rep coming Wed to check the tv out.  I love the picture quality otherwise so I will try to get it fixed or replaced.  More to come...**Update #3*** So the tv repairman came today to check out the tv for Samsung.  He agreed there was a problem and suggested that I contact Amazon for a return vs having it serviced.  I called Amazon and the rep was amazing.  They are having the replacement sent and will get the old one when the new one comes.  Fingers crossed because I want this tv.**Update #4** Amazon was amazing and did the exchange.  The new tv has minor light bleed on the corners but the middle is clear and I am totally satisfied!", "Date": "November 29, 2012"}, {"Title": "Poor Quality control for a \"Top of Line\" TV", "Author": "HEK", "ReviewID": "RH6WBWNFPLYZF", "Overall": "1.0", "Content": "The following is the review I tried to put on Samsung's website but didn't meet their \"guidelines\". The only bright spot in this unpleasent experience was the customer service from Amazon. Absolutly no issues trying to resolve my problems:\"I really wanted to love this TV (UN65ES8000) and am still saddened it didn't work out and in addition, disappointed in Samsung in not posting my first review (perhaps because it's not favorable, but we'll see if this is allowed to get posted). I received the TV, set it up (left it on the stand since the Ultra Slim wall mount screws were not long enough - should have been my first indication this wasn't going to go well) and immediately noticed multiple areas of darkened vertical banding several inches wide. Turned on the Blu-ray, installed new HDMI cables and eventually went to the internal test picture and still saw the issue. System had me contact Customer support. They had me do a hard reset and I still had the issue and they said they need to get a repairman out (brand new TV, mind you). Instead of taking another day off for a repairman for Samsung's \"Flagship TV\", I contacted the store and had them exchange the TV with the same model. Took an afternoon off for that delivery and had vertical banding on that set also. I again contacted customer service and we went through the same routine and they assured me that this isn't normal and wanted to again schedule a repairman. This is obviously not a PPM issue and can only speculate the Quality Control is lacking or the technology is still not mature and I can't be comfortable that if I eventually do get a set without the banding, I won't have another quality issue early in its life. I was almost willing to live with it because otherwise the TV aesthetics and picture were gorgeous with the exception of that vertical banding. Also, if I'm having this issue with a \"high-quality\" producer of  LCD/LED TV's, what will be my experience with brands like LG or Sharp. Since I've had a good experience with the Sony XBR 55 rear-projection (and still have it), I may wait to get over this unpleasant experience and pay the extra for their XBR series LCD. Sorry Samsung, I really had high hopes.\"", "Date": "November 14, 2012"}, {"Title": "great tv", "Author": "David R. Buchanan", "ReviewID": "R117X55APDRHXR", "Overall": "5.0", "Content": "We now have had this over a year and it has been great.  wonderful picture quality and it blows you away with it's definition.  Makes watching hd totally like your in the room", "Date": "August 7, 2013"}, {"Title": "Thick vertical stripes/bands across the Screen.  DO NOT BUY THE 65 INCH VERSION", "Author": "Bets123", "ReviewID": "R3JHPA5CNCQDTN", "Overall": "1.0", "Content": "The TV interface is nice and we really wanted to love this (very expensive) television.  However, while watching movies on Amazon Prime or tv shows on Hulu (through the SmartTV feature) we see thick vertical dark bands across the screen.  It is particularly noticeable on lighter backgrounds and really detracts from the viewing experience, so much that my husband and I cannot stand to use this TV we paid so much money for (almost $3K).  We contacted Samsung customer service since the TV is under warranty and they sent out a repair technician for free.  Unfortunately, the technician said there is nothing he could do to fix it and that it is a problem with ALL LED tvs, just some people notice it more than others.  Personally, I don't know how anyone could miss 8-10 stripes across the screen that are between 3 and 5 inches thick each.  The technician said that these stripes are within Samsung technical \"specs\" so in essence, the TV is just fine and we are unlucky to \"notice\" the bands.  I wish I could upload a picture to show you how bad the picture is.My recommendation is to steer clear of this TV.  The technician told me that Plasma TVs do not have this banding problem.", "Date": "June 28, 2013"}, {"Title": "Awesome Picture", "Author": "Allana Horn", "ReviewID": "R2BBT71XEAUW4C", "Overall": "5.0", "Content": "Was worried about ordering a tv over the Internet but it came in undamaged. It has an unbelievable picture. Quite a bit cheaper on amazon vs best buy. Very satisfied.", "Date": "May 15, 2013"}, {"Title": "WHAT A PICTURE", "Author": "Phil 7777 \"phil 7777\"", "ReviewID": "R2LMI1JGTCIIFL", "Overall": "5.0", "Content": "Has a lot of features and settings and options............be patient...there is a lot to do and understand. I am still not done setting up all the features!!", "Date": "May 13, 2013"}, {"Title": "Too many Panel issues - Clouding, Banding & Flashlighting were so bad for a flagship product", "Author": "Damon", "ReviewID": "RAWANVRN3QL56", "Overall": "1.0", "Content": "Unfortunately I had the worst experience with my first Samsung product in years.  In reading the reviews for this top-of-the-line TV, I was sure that the misfortunes of some owners must be the vocal minority.  There's no way a flagship product that looks like such an amazing piece of hardware could be this bad.  That or maybe there was just a bad batch and Samsung probably has that sorted out.  That's what I was thinking anyway when I made my purchase.Turns out the poor reviews aren't planted either, they're true.  Look throughout out the web and the common themes of banding, clouding and flashlighting are true.  My 65ES8000 had all three issues distinctly, and Samsung knows this is common with this model.  But I guess when Samsung figured out the defective rate of these was high, it was just easier to just replace panels (which they will offer you, and didn't help in my situation) and roll the dice until the new model comes out rather than make major changes to the manufacturing process of this model.Very disappointed, this is a sweet looking TV in person... when its not turned on.  But if you have even an average idea of picture quality, this set isn't going to work for you.  This was my first/last Samsung for awhile, and my first return to Amazon.  Lesson learned.", "Date": "April 25, 2013"}, {"Title": "Still in awe!", "Author": "Satisfied", "ReviewID": "R1K79ERUCMBBRG", "Overall": "5.0", "Content": "If you going to upgrade your TV then do it right and get this one! I get offers in my email every day from retailers offering me cheap TV's and that's what they are! Sure they will do 1080p but there is so much more to a TV that that! This is the first time I have ever bought a piece of technology and seen the price go up! I bought this TV about two weeks ago and the price has gone up $800!I am still learning the features of this TV. The other day I was watching golf on CBS using an over-the-air HD antenna. I turned on the 3D feature and couldn't believe I was able to watch Tiger Woods in 3D.I will say that when watching anything in 3D, bigger is better, I am so glad we got the 65\" screen.The TV remotes will also operate my SONY BD player.It has a web browser and I am waiting for the wireless keyboard to arrive so I don't have to hunt and peck the onscreen keyboard with the remote.I can pull pictures, video and music using the allshare app. off other devices on my network and display them on the TV.", "Date": "April 15, 2013"}, {"Title": "Great TV, Despite Initial Problems", "Author": "Kalibr", "ReviewID": "R3VU2D3SICIPCZ", "Overall": "4.0", "Content": "I purchased my first Samsung TV in August 2009, the UN55B8000. This was the first or one of the first LED TVs Samsung introduced. The TV has and continues to perform great. However, I wanted to upgrade to a larger screen, so I decided to go with the UN65ES8000. Amazon was offering it at a very competitive price of $2699 with free shipping. The TV was shipped and received promptly. I checked the TV carefully for any issues, but it seemed fine (no dead pixels, vertical stripping, etc.). However, after wall-mounting it and watching TV later that evening, I noticed a great deal of clouding during dark scenes. The largest took over the majority of the center of screen with some light bleeds from the bottom corners. My heart sank. I tried adjusting the settings including lowering the backlight control to 7, but the clouding was still very noticeable. As if that wasn't bad enough, I also noticed obvious banding throughout the screen during bright scenes. Aside from those issues, the TV's PQ and other features were great. I dreaded having to return the set, but there was no way I could talk myself in keeping a set with these serious issues, especially for a top-of-the-line model. I called Amazon and within 2 minutes, they had ordered a replacement unit. I received it on Friday and it doesn't have any clouding or banding issues. I'm very pleased with the TV so far. I really have to commend Amazon for their great customer service!Btw, I didn't rate the TV 5 stars because I think that Samsung fails in its quality assurance measures. Their TV panels should all be tested and those with clouding or banding issues should be removed from the assembly line instead of going out to customers.", "Date": "April 1, 2013"}, {"Title": "Great product. Fast shipping. Good service", "Author": "Katie Trinh", "ReviewID": "R1NGONO4VF2AD4", "Overall": "5.0", "Content": "very happy with the purchase.  TV is very nice.  Shipping is very fast.  TV has shock sensor so when I receive it and the shock sensor is not activated yet, I know it's been handled well", "Date": "March 28, 2013"}, {"Title": "UN65ES8000 - so far so good", "Author": "firebirdwiz", "ReviewID": "R2344Y7MFTRUMD", "Overall": "5.0", "Content": "3-19-2013ORIGINAL:Just got this amazing UN65ES8000 yesterday. Better then expected. I loved it. I use my TV to watch 3D, blue ray, Netflix, and connected to my laptop with VGA to HDMI...I also own the UN55D8000 - I love it!!!Last night I set it up also loaded update, then watched Life of PI and Titanic both in 3D...Many reviews freaked me out!!! Im realy scared to loose my picture/faith in Samsung, also have the Note II phone.firebirdwiz@yahoo.comKeep you posted3-25-3013UPDATE (a week of usage)Excelent blu ray and 3D!!! been using it everyday!!! no vertical banding!!! no backlight stuff! perfect TV!!!Keep you posted...", "Date": "March 19, 2013"}, {"Title": "Samsung Backward Step", "Author": "leppa9", "ReviewID": "R2A66XXG7I1W6E", "Overall": "3.0", "Content": "In 2011 I bought a Samsung UN65D8000 for my brother from Amazon; the first time buying a TV online.  The purchase experience was great: decent price, awesome Amazon service, great delivery shippers (helpful & on-time).  The TV was also great: flawless picture, easy wall mounting, and all the features he wanted it for.  So this year when my +8year Sony 60WF655 got a fair share of dead pixels, I decided to try to repeat the magic.However now this \"newer\" ES model was being sold and there was a limited offer for a free Samsung Galaxy Tab 2.  So I decided to take advantage of it and bought this TV from Amazon.  I was able to schedule the TV to show up via phone and that's when the problems started.Delivery: The CEVA shipping agent was terrible.  Only 1 person came to deliver the TV up a flight of steps and once the TV was out of the box, he kept trying to leave before I even got a chance to check the picture display.  He just ripped apart the packaging and kept speaking broken English that he \"have to leave, have to leave\".  I asked him to help me move out the old TV and he just ran down the stairs leaving my dad and I dumbfounded.  He didn't even ask me to fill out a service survey (because he likely was going to forge it in the truck).Screen: With the TV on I started going through channels only to realize I got one with a defective screen.  Several other reviews have noted that getting a good version of this TV is almost like a lottery.  I used the HDMI output of my camera to display solid white and black images and the top of my screen has a grey bar on it even when the entire screen is supposed to be white.  I looked at the same model in a store and suspect that grey bar is the part where the TV demo lists the features.  When the TV is on but the screen image is black, there is an oval cloud in the middle.  Various other images seem to have a flashlight effect whereby the middle is very bright but the surrounding oval edge is darker.  I updated the firmware from 01041 => 01047 and gave it some time but it seems like the problems aren't going away.  On the plus-side, the TV can output some serious light and if you do get a good screen (mine was MH02 from October 2012 built in Mexico) I'd imagine it's comparable to my brother's awesome D model.Features: Well regardless of picture quality, I decided to play around with the \"Smart\" TV features.  This was also disappointing as the interface is clunky and seems to have remote input buffering issues.  One time the TV just froze in the Smart TV interface and I had to power-cycle the TV (because it's now a computer).  The ESPN scores app overlay is pretty cool but other \"pervasive\" apps like YouTube and Hulu are so much better on PC / Xbox that the whole \"Smart\" thing seems like a gimmick to try to get your credit card (and pay $10 for games based on gameshows).  Also, I might be the only person who uses Picture-In-Picture, but on this TV it's worthless as the sub-picture only takes input from the coax connector.  It can \"try\" to pull signals over the antenna, but it's spotty and is a bunch of stuff I'll never want to watch (simultaneously PIP or not).Amazon: Service-wise Amazon seems great so far but I'm now going to return my defective TV and see how that plays out.  I feel a bit bummed that my \"new\" TV might actually be a floor model / last lemon as Amazon doesn't seem to sell this model anymore.  A few days after I bought it, the price went down and Amazon matched part of it due to the free tablet promotion making the pricing screwy.  By interacting with Amazon support, I returned the Galaxy Tab 2 (Wi-Fi version) and got the lowered price no problem.  But even with a good price, the crummy picture makes it a bad deal.Overall: I rate the TV [3 out of 5] because there seems to be too much chance to getting a good screen.  Also the features it does have seem to be slow, poorly implemented, or done much better with other attaching devices.  Perhaps Samsung can sort this out in their upcoming F model version but I'm moving on.  I just wanted a thin TV, with a large screen, for a reasonable price and unfortunately that seems rare these days as everyone wants to kludge on 3D and mindless computer apps to increase the price.  I also don't want to go back myself and have a TV with a +4 inch depth nor pay over $5000.  I kind of wish Sony made a 60 or 65 inch version of their HX750 or HX850 line.", "Date": "March 18, 2013"}, {"Title": "very good picture, the rest is fluff.", "Author": "R. Eifler \"Psudo geek\"", "ReviewID": "R7L6QS6GHCOI5", "Overall": "3.0", "Content": "Quality picture, as expected.  Nice looking small bezel design.  I'm generally happy, but I think I would be equally happy with a different model 65\" LCD that cost $1,000.00 less.  I have not tried the 3D but I don't so much care about that, and all those apps don't impress me.  I'll use my computer or IPad if I want to run apps or access the internet while I let my new TV do what I bought it for -- play TV shows with a top quality picture.  I paid about $3,250. Probably most people dont spend that and consider a \"Just Okay\" rating to be acceptable.  But I would recommend that if you only want a 65\" with a great picture then just shop for that, but if you want a great picture and also all the fluff then this is a good choice.", "Date": "February 3, 2013"}, {"Title": "A bit pricy but worth it", "Author": "D Turner", "ReviewID": "R1BUMM1UH553TH", "Overall": "4.0", "Content": "We got this tv to replace our old 65in DLP model which sucked in more ways than I can name.  Besides being much more energy efficient the picture is very sharp and the colors are true and brilliant.  The smart TV features are never ending with HBO and Netfllix streaming content.  I have also copied 150 of my favorite movies to a 500GB hard drive which is connected to a USB port in the back of the TV so I can view my faves at the touch of the remote. It has WIFI built in so you can update the firmware automatically as well as surf the net and share the content of a PC or Laptop easily. All in all it performs very well just keep in  mind that if you want the sound to match the quality of the picture you will need to connect it to a good home theater system or a good sound bar since the built in speakers as you might expect are not made for a good action movie.", "Date": "March 20, 2013"}, {"Title": "buy something else", "Author": "schmoe", "ReviewID": "R35OG7XPQW0V9X", "Overall": "1.0", "Content": "Im not a tech junkie.  I paid good money to have a product that works even better than I require.  I specifically wanted to avoid a tv that jitters during large or fast scenes.  Sadly this samsung is plagued with chopiness even worse than my previous 2003 model mitsubishi non dlp rear projection.  I applied the settings recommended by cnet, and possibly got a little improvement, but not enough to avoid writing this review.  For example,  my mother, has a samsung 46 inch lcd that i know for sure is at least 5 years old.  Not only does it have a better picture, but I never see any choppyness in it.  Because i know mom,  there is no way she spent the money for a 240 hz machine.My 2 cents to you is to keep looking.  This tv is good on paper, but not movie friendly.", "Date": "January 7, 2013"}, {"Title": "Picture quality is great but features are useless! (Samsung ES8000 65 inch)", "Author": "TLN", "ReviewID": "RWPX6V8FAUBQ5", "Overall": "2.0", "Content": "I brought mine at BestBuy since on Amazon.com has it at the same price and bestbuy had the free haul away of the old TV.First off, it had turned off twice on me while I'm watching TV and it's been about a 3 weeks since I have gotten it.The picture quality is great but not excellent. You'll still experience the digital blur when watching fast action movies or the games (football, and NASCar races, etc), even with the 240 refresh rate and Samsung so call 960 Clear Motion Rate (CMR). And sometime 'judders'.For a $3500 TV I was expecting it to be AWESOME all around. But NO, the motion control and voice navigation is almost useless. You'll be lucky if you're able to active either one on the first several tries. Turning on the TV in a quiet room takes at least 3 tries. And using it while you're watching TV...you'll be repeating yourself or get to a point where you'll be yelling at it, then a curse word would follow afterward. And the motion control...I'm standing there waving my arm back and forth like a crazy person trying to active it! And when you're able to active it ... good luck on keeping it activated. You may have to keep on waving at it again and again! If you're planning to use the motion control to select letters, forget about it! Use the second remote or buy yourself a keyboard. You'll be too exhausted just trying to type \".com\" or just moving to pointer the \".\". And worst of all, at time, while I'm watching a movie or a TV show, either the motion or the voice would activate by themselves. they take turns on who would messes with me first.  It shows up at the lower left corner or left side of the TV that draws your attention away from your viewing. Then you're left scratching your head wondering if you did something to activate it. Then you'll stop watching whatever you were watching trying to deactivate them. And now instead of concentrating on show, you're left with troubleshooting on the issues. This happens so many times I end up turning the features off! So no more, \"Hi TV!\", and no more waving at it!Update 2/20/13I'm reducing from a 3 star to a 2 star rating. I've been noticing the banding while watching in  panned view. It's the white lining that appears across from left to right on the bottom and top of panned movies. And the clouding on dark scenes. They are so d am n annoying for such a TV!So the only good thing left about this TV is the picture quality in FULL, 1080i or Bluray 1080p movies, shows, or sports. I guess it's the only thing that matters. And I have to admit, beside the picture quality, the physical view of the TV is also very nice!", "Date": "October 28, 2012"}, {"Title": "Unacceptable issues for a high-end TV", "Author": "J.L.", "ReviewID": "R10M6WAWAL1OO2", "Overall": "2.0", "Content": "I've had two 65\" ES8000s, and both of them demonstrated the same problems.  While color, brightness and contrast are very good, Samsung has a defective backlight design.  Both of my sets demonstrated flashlighting/clouding (a splotchy looking screen on black or dark scenes) and banding (alternating strips of light and dark backlighting, particularly visible in panning scenes across a uniform backdrop).  This makes sports like football and auto racing very distracting to watch.  There is also visible artifacting/aliasing on fine details during motion.  Samsung has also designed the TV software so that it automatically darkens the image when it detects a \"dark\" scene.  This is supposed to make blacks appear deeper, but has the effect of artificially dimming credits, starfield scenes, and the like.  You cannot turn this effect off--another distracting issue.  These problems would be ok on a low-end LED.  It is completely unacceptable on a $3400 set.  If you don't need silly features like a camera and gesture recognition, there is no reason to spend the money on this set over a much cheaper LED.", "Date": "October 16, 2012"}, {"Title": "3D not perfect just yet...still some ghosting.", "Author": "Mr. Mitesh J. Patel", "ReviewID": "R2RTF7H5TRU04H", "Overall": "4.0", "Content": "This review is ONLY about the 3D, thats all I care about so If you are not interested in that aspect, just skip this review.  I purchased this 65 inch monster on the hope that Samsung had corrected the ghosting/crosstalk that was sooooo problematic in previous model years.  My previous TV was the UN55C8000 and now I have just upgraded to the UN65ES8000.  From the second I popped a 3D movie in on my new TV, I was saddened to see that the Ghosting/Crosstalk was still present even in this - the \"E\" series flagship.  With the included (cheap quality) samsung 3D glasses the 3D had more visable ghosting then when I used G5 3D glasses.  With the G5 glasses, I'd say the 3D crosstalk was reduced 90 percent from the first generation 3D TVs. With the included Samsung 3D glasses, I'd say the Ghosting was only 50 percent better than my previous model.  Its worth noting here that to link 3rd party 3D glasses to this TV you should be holding the glasses about 2 inches from the TV screen to sync them. (this might save you a lot of time and headache that I had to suffer to figure this out)  The best movie to use to study Crosstalk issues is Fright Night.  There are so many dark on white scenes that the 3D was nearly unwatchable on my previous UN55C8000. There is still plenty of ghosting in that movie, however, it is now watchable on this TV.  My wife (who is not a 3D fanatic like me) hardly notices the ghosting anymore - except when watching Fright Night.  It is possible to tweak the settings on this TV to reduce ghosting further, however, it comes at a cost...reduced contrast and brightened black bars (at top and bottom) when watching widescreen movies.  Its always better if the bars can be pitch black, otherwise they look unsightly and are distracting when watching a movie at night.  I decided against using my crosstalk reducing tweaks, since I like the picture quality better with the default settings and the 3D ghosting is at least not as bad as it used to be on previous models.  I do have hope that Samsung will continue to pump out updates through the internet to improve the 3D even further.  Please comment if you have any input on other 3D settings I can tweak or any other suggustions/comments about 3D.  I always like to hear from other 3D experts, Thanks!", "Date": "August 27, 2012"}, {"Title": "very frustrated", "Author": "Guff", "ReviewID": "RO2N5UJECY0GN", "Overall": "1.0", "Content": "Have had the Samsung UN65ES8000 for a week.  At first, it was great.  Movies looked fantasic, blu-rays were even better, smart hub has a lot to offer and being able to skype on the big screen is great.  However, I love to watch sports and the next day decided to take in A hockey game.  After just a few minutes I noticed this these faint darker colored vertical bands going back and forth across the white background of the ice.  I immediately had this empty feeling in my stomach because I remembered reading many reviews for the 65inch that involved banding issues. I then switched over to the golf tournament, and there they were again.  Every time the camera panned across the fairway to follow the ball, or panned across the green to follow a put, those faint darker vertical bands were there scrolling across the screen.  The strange thing about this problem is if you are watching a movie or blu-ray it is not noticeable at all, only where there is a solid background with movement. Unfortunately, that covers most sports.  It makes watching sports very frustrating.  After taking a couple of days to think if I should return the TV because the picture for movies and tv is fantastic, I kept thinking about spending that much money for something that I was not happy with.  And I was reminded how unhappy I was every time I stopped to watch some hockey, golf, or basketball.  I have gone back to the store where I made the purchase and they are going to bring me a new UN65ES8000 next week.  They told me I was the third person in the last 4 months that had the same complaint.  I decided to give the tv one more try, but judging on some previous reviews, I think chances are I will end up with the same problem with the new one....I am keeping my fingers crossed and will update the outcome.Some other notes about the UN65ES8000, the smart remote is a waste of time because it does not respond very well and takes longer to do things than just using the regular remote.  Motion control is hard to use unless you have a bright room.  My TV is in the basement and I have to turn all the lights on for the motion control to work.  Voice control is cool to impress friends and family that come over to the house, but to shout at the tv on a regular basis is not practical and it is much quicker to use the regular remote.  As mentioned before, the skype camera feature works great.  My wife skypes with far away family often and it is nice to be able to sit comfortably on the couch and chat.  The camera and the sound for skype works perfectly, very clear picture and very easy to hear through the speakers.In conclusion, I realize that sometimes things are defective and don't work properly and I am hoping that when My new set arrives it will work as I expected the first time.  My worry from previous reviews it that this TV may be flawed and if so, shame on Samsung for not correcting this issue and allowing these defective sets to continue to be sold.Update March 9, 2013:  Was brought my second UN65ES8000 finally today.  As soon as the service techs turned on the new TV we all saw the faint verticle bands on the white screen just like the first TV.  They tried using different cables and I hooked up a different cable box to make completely sure it was the TV, and unfortunately it was.  Obviously, I sent that one back and I am going to exchange my samsung for a different TV and brand.  It is obvious there is a defect with the 65inch model because the vertical bands on the new TV were in the same position as the first TV I received, like they are all being produced the same way.  I am very, very disappointed that Samsung would sell this quality TV at any price, let alone for $3000-$4000.  Please, if you are looking for a 65inch TV read all the negative reviews for this TV.  These are not made up stories ,this TV is defective and you should spend your hard earned money elsewhere.", "Date": "February 23, 2013"}, {"Title": "Great picture... O.K. blacks...kinda pointless apps.", "Author": "Mark A. Donohoe \"Tom and Jerry\"", "ReviewID": "R2OWAI39DJHAGF", "Overall": "4.0", "Content": "The picture is stellar on this unit.  It really shines.  Colors are vibrant, the pixels respond fast so there's no ghosting like you see on other sets, fast refresh rate so you can do smoothing or good-quality 3D with minimal L/R ghosting (I never could remove it completely, but I could enough that it didn't bother you.)  Incredibly light set.  I lifted it easily by myself up onto a wall-mounted rack after attaching the mount-hooks on the back of the set.Black level has a little to be desired.  I've seen a lot worse, but I have seen better in other LED sets.  The pseudo-local-dimming doesn't work quite as good as the reviews (and their sales pitches) make you believe as in a dark room at night, you'll see a lot more gray than black... but again, not too bad.The apps are mediocre at best.  Think of them as your TV's equivalent of all the crap-ware old computer makers would install all over your PC that you had to then go remove.  The Netflix app takes ages to start, but hey, there's a Netflix app.  Want Pandora? That's there too, but why on earth would you want to turn your TV on if you're just listening to Pandora?  Use your stereo with a Smartphone!  That TV's an awful power-hungry radio!And hey... there's a Verizon FIOS on-demand app in there too for when you don't want to use the cable box's on-demand features... but since this doesn't take CableCards (which I thought all recent TVs had to but I guess I'm wrong) then you're going to have your cable box there anyway, so why do you need to load up a crappy, slow app to do what the crappy slow version on the cable box already does?The voice control and gesture control, while novel, are really just that.  They are fun to show someone in a 'Hey wow!' kinda thing, but they're too annoying/frustrating and not too accurate.  Supposedly the Evolution kit addresses a lot of that but considering I use a TiVo for a tuner, most of the features you get with that I can't use so I'm on the fence.Still, if you're looking for a large, really thin, 3D set with a great panel and decent, but not great blacks, you can't go wrong here.  Bur don't be fooled... that's what your buying it for, not the 'smart' features because if you're buying a Samsung for 'smart features' (or any similar 'I'm a computer... I'm a TV' type things where they think just adding apps with no regards to user experience is somehow a benefit) then I assure you, it would *only* be the TV that was smart, not the viewer.Truthfully, if I could have this exact set, just without all that (cr)app stuff on it, thus costing less, it would be the perfect TV as you could simply add RoKu, Google TV or best of all, Apple TV and have a much smarter experience on a great panel.  Add a CableCard slot and it would be perfect.", "Date": "August 9, 2013"}, {"Title": "Amazing picture quality", "Author": "Michael Liguori", "ReviewID": "R5CIHLO6D9S32", "Overall": "5.0", "Content": "I do not usually write reviews, but this TV is worth the time.  It is a great product and well I am very pleased with its performance. The picture quality is great.  The WiFi is very convenient and fast. Bluray movies look awesome.  The hand wave control is gimmicky but you can deactivate it. Can't say enough good things about this product.", "Date": "May 25, 2013"}, {"Title": "Awsome!!", "Author": "A. Johnson", "ReviewID": "R27OWHV4Z926HW", "Overall": "5.0", "Content": "The delivery was flawless.  Shipper brought in, unbox, we inspected it.  Very professional service.The TV is great, the picture quality is outstanding.  3D is a delight, but the standard picture is truly great.  The inputs -- 3 HDMI are configured well to work with other equipment.  The remote pairs completely with my SONY blue Ray/sound system--yes SONY.  Had to call support to work out one of the configurations, timely on-line chat.  Had the set completed in a few minutes.", "Date": "May 21, 2013"}, {"Title": "Love it", "Author": "Alla", "ReviewID": "RKBKDG9L9A5VA", "Overall": "5.0", "Content": "It' a real smart tv. Love it. Today it's the best tv. Will recommend it to buy, you won't be disappointed.", "Date": "May 5, 2013"}, {"Title": "Beautiful picture but extra features not very useful", "Author": "Amazon Customer", "ReviewID": "R1MQOH1GPW5P6T", "Overall": "4.0", "Content": "The set has a great picture and the 3D is very good.  The motion control is limited and is activated when I don't want it to.  I turned this feature off after a week.  Voice control is also not very useful except when used as an alternative to entering text for internet searches.  I feel the set was a bit over-priced but I am still very happy with this purchase.", "Date": "April 26, 2013"}, {"Title": "Great TV", "Author": "T. McGraw", "ReviewID": "RCASZ1DZYH6LD", "Overall": "5.0", "Content": "This TV did not disappoint.  Great picture, cool internet features.  I'm not using much of the \"smart\" features like motion or voice control but they are cool nonetheless.  Completely satisfied with the TV.", "Date": "April 4, 2013"}, {"Title": "Wow! what a dissapointment.", "Author": "keepingitreal12", "ReviewID": "RWEE9SOTNLKDM", "Overall": "1.0", "Content": "Bright spots from the corners and one the size of a basketball right in the middle of the screen. This was an amazon warehouse purchase, so you think it would have been tested before being resold. Returned right away, what a waste of time.", "Date": "April 1, 2013"}, {"Title": "Geat product", "Author": "Sam", "ReviewID": "R3AD6FCO3BJOL9", "Overall": "4.0", "Content": "The Samsung UN65ES8000 65-Inch 1080p 240Hz 3D Slim LED HDTV (Silver) did not disappoint me at all. All the symptoms I read from reviews were none existent on my product purchase.The setup was just so easily because I already have a home LAN. My bandwidth is great, eventhough I once in a while to insurfficient bandwidth notification when streaming 3D movie, but it depends on the amount of graphics. The TV discovered my machines/PCs with media and noticed it once I hit 'source\". I would have given it a 5 star but for minor little things.The TV is in the basement and it dims when it should light up/make itself brighter. when I switch on the lights, it becomes brighter and makes the picture sharper.I have touched the settings.The volume is not as loud and I have not bought the sound system to go with that. I can hook to my home system but I want the Samsung system to fully take advantage of the allshare thingy. I expect a TV as thin as the this not to carry heavy sound anyway. After the volume 30, it just doesn't increase by any discernible audio.Trying to surf the web with the Samsung keyboard I bought is a struggle, but I am happy that the TV can actually double as a computer should you need it. It is just good for a show off at this point. However any meaning use of the web via the TV requires the keyboard.Bottom line is that this TV is just awsome and the best part and the main reason I bought it is the upgradability. I don't want to plunge another thousands in two to three years buying another TV.. I bought a $2,800 55\" TV in 2010 and while it is still a great TV, it is fast becoming obselete and yet it was top of the line then.THIS TV IS A PLEASURE. it is all that Samsung said it is. However, it is for a STIFF price.", "Date": "February 4, 2013"}, {"Title": "Great TV", "Author": "servenaya", "ReviewID": "R3U61E6S5XL599", "Overall": "4.0", "Content": "I love the TV. Picture quality is good and it looks amazing. Although I believed the smart TV would be more interesting. I barely use the smart TV since I have an Xbox 360 hooked to it. Also the smart TV seems kind of buggy, i was expecting something more. I am a Samsung S3 owner and I love the Smartview app, lets me watch TV even when I'm away from the TV. The speakers are way better than my old series 7 46\" TV.***UPDATE***One of the four 3D glasses came DOA. I've never called Samsung Customer service but I've heard several stories of how bad it is. Well the stories are true, after a week of calling, sending information to get a replacement on the glasses, I didn't get any. The customer service people said they would call me back and I never received the call. Tried calling a few more times and I kept getting the same response, so I just gave up.  TRY YOUR GLASSES ONCE YOU GET IT!", "Date": "January 29, 2013"}, {"Title": "Fantastic TV", "Author": "Big D", "ReviewID": "R34BST31GZBYO4", "Overall": "5.0", "Content": "The picture is excellent. I used the WOW DVD to adjust the settings and made it even better. Someone recommended a professional calibration so I had that done too and it's worth the money. Watching a quality 3D movie on this is stunning. I have utilized nearly every feature this TV has and it is smart, very smart. We can Skype with it, stream movies and much more. I am not wow'd by the voice control and hand control feature, but I didn't buy it for that. My browser wasn't slow but I'd rather use my PC, once again I didn't buy it for that. I love how I can stream home movies from my PC on it wirelessly after installing a program on my PC. If you truly want to know everything this TV can do then I would recommend viewing the owners manual online, but bring a sneakers bar, it's about 700 pages. I'M VERY HAPPY WITH THIS TV!", "Date": "January 15, 2013"}, {"Title": "ITS GREAT", "Author": "SUSAN P SWINDELL", "ReviewID": "R3HBBO6DLC03H3", "Overall": "4.0", "Content": "it's great.  does everything it is advertised to do.  Quality of picture is not as good as my old Sony but, hey, it costs 50% LESS", "Date": "January 3, 2013"}, {"Title": "Was it worth it?", "Author": "Ellen Powers", "ReviewID": "R3A572EO4P6NDH", "Overall": "5.0", "Content": "It was my husband's idea/desire to get this TV - I was at the best neutral at the worst not interested....now I understand what HIDef TV is all about...it is AWESOME....totally convinvced me that this may be one of the best purchases we have ever made.  Highly recommend it and so far it is has been totally trouble free.", "Date": "December 30, 2012"}, {"Title": "I got a good one.", "Author": "RJ", "ReviewID": "R2EMU7PJQNYQ4O", "Overall": "5.0", "Content": "After reading the reviews I was nervous about spending this much on a 65\" TV that needed to be shipped. The TV arrived with minor bumps to the box but the AGS delivery service unboxing and setup went smooth. They hooked everything up and it worked without flaws. Im very happy with this purchase and the TV design is second to none. Amazon did a very good job. The TV is stunning and I highly recommend it to anyone and thats comming from a Sony fan. Buy this and enjoy the white glove delivery and inspection with confidence.", "Date": "November 27, 2012"}, {"Title": "The BEST Set We've Owned", "Author": "John N. Schear \"cxxi121\"", "ReviewID": "R1T3R7TFT2W8C0", "Overall": "5.0", "Content": "UPDATE:  4-8-13Over two weeks later and there is absolutely nothing I would change with this TV.  Each and every little aspect works as I expect and even though I have tinkered with the calibration I reverted to my original settings.  Golf shots and landscape look terrific.  Basketball at either slow NCAA or snappy NBA reminds me of attending the games except the TV games are far better.  I even notice the excessive makeup on many of the on-air talking heads and their blemished skin.  You do not get that with SD or some lower rated products.  I just love watching and surfing on the Internet at 65\".  It would be best for me to close this rambling and simply say as I have said before:  This is the BEST TV we have ever had.UPDATE:  3-19-13I am almost afraid to make a comment after seeing some of those who do not like their ES8 as much as we like ours.  The details are getting more specific and it is still our BEST regardless of any of the negative comments that follow.  The instruction booklet that accompanied the TV was not written by a person who had sufficient knowledge of their product to make a meaning instruction booklet.  I can think of no-one who opens a new TV and wants to sift through all the preface material.  If a \"Quick Start\" sheet is included and it was it should be the essentials needed by the user to get it up and running first.  I do not care about the IR Blaster nor the Smart TV aspects of this TV at first.  Those are later matters and will be addressed when it is time to learn the items.  It is so irritating to read a manufacturer's in-house material and vocabulary in the booklet and then NOT define what the words mean.  We viewers and especially I are not technical gurus and would be better served with defined lingo.  Not everyone knows what LOL means and in that case it should have been defined.  While LOL is not set specific it generally drives Samsung's general way of addressing their products.  Additionally, make one place that singular place for information and not a plethora of written booklets, articles and advertisements coupled with web sites that one may go to for further information.  These comments do not in any way take away from the overall TV.  I hope they alert a new user to the potential complications that may take place when installing the TV.  I, also, hope Samsung will consider its methods for the future.  Missing from Samsung's customer relations efforts is a philosophy of Customer First and Foremost.  They presently use a \"if you do not have a serial number for your product we cannot and will not give you assistance.\"I spent several hours calibrating the TV and for the most part the settings out of the box were close or identical with my final settings.  At no time did I have an issue of any kind relating to that timely set of tasks.  It just takes a lot of time.  The payoff, however, was well worth the labors.  I have a picture that is close to perfect as anyone could expect.  I say \"close to perfect\" because I cannot define perfect.  It exceeds my tastes.I will not praise the sound coming out of the 2 rear-firing 10 watt speakers.  It is at best adequate and you can hear the main thrust of voices and some of the background.  I sure am glad I used my old surround sound system to accentuate all the hidden sound elements not generally available with 2 small speakers.  I also use a 17 speaker sound bar that is quite sufficient for real noises but not on the par with a 5.1 surround system.The remote controller is sufficient and if anything a few steps above most standard equipment remotes but it does what it has to and that makes if fine with me.  I seldom use it, however, since I use the cable company's remote to do most of the TV watching.  I use the supplied remote for accessing the Smart TV functions and it works quite well there.Before I forget the one item that displeases me the most (this is really petty) is the way I have to get picture-in-picture (PIP) to work.  To access PIP you either access it through the MENU or TOOLS menu on the remote.  After, say Tools, accessing Tools you scroll down all the way down to PIP and click it, then move the arrow to Yes and click it, go back to the screen with a Return and there is the PIP.  PIP is available in another menu so that you can set up the location, size and other items.  I got lucky when I set the TV up by installing a TV source (regular cable plus Air) on the TV element of the remote and HDMI for the full cable elements including high-definition and any thing else cable had to offer.  I also included the Blu-Ray player and the Surround System so I had access to almost any noise one could imagine.  Thank goodness I have not found a way to run all of them at the same time.  I did, however, discover rather by accident that I could take a Bluetooth Keyboard and use some of the keys on it to access PIP and eliminate all the intolerant methods to access PIP.  Now I just hit the F4 key plus the channel number and it just appears on the screen.  If I want to change the PIP station I just hit the proper keys.  It's even better for example if I were watching local channel 7 and wanted to watch it in high-definition I would press 7-1 and there is HD.  Samsung chose not to tell me how to do that or I have not been able to find it in their instructions.I am going to do some other work and will return to close this out with the other interesting element of what we call the BEST Set We've Owned.  Thanks for you patience and if you see something I missed or could improve or add, by all means let me know.This review will take a long time to write to list all the positive and yes even some negative aspects of this TV.  It is still early in our new association with the UN65ES8000 (UN8) but they have been all positive.  From the moment the shipper received the TV, the phone call to set delivery, the delivery, the setting up of the TV on its and our stand, the initial connections, the first turn-on and its initial set-up matrix ending with delightful hours of viewing and tinkering with the settings.  Before I continue, I have NOT calibrated the set with the WOW disk yet.  My cable provider has an unbelievable set of numbers to locate and use before I can begin that process so what I am about to say is a from non-calibrated aspect.Delivery:  I received the call, arranged for the date and time, they arrived, delivered a no-incidence package, unboxed, left and it was perfect and according to our needs.  I could not ask for more than I received.Out of the Box:  Be sure there are two strong persons to do the job of removing the TV and lifting it onto the stand.  Luckily the 65\" and I am told the 60\" comes with the metal stand attached.  That was nice and made the job easier for us.  We placed the bottom of the box next to the TV stand and after removing the packing material and foam we lifted the TV on to our sound-stand.  Without wasting a lot of time I attached the HDMI cables to the TV outlet and the Blu-ray player.  The AC plug went in and it was \"let's see what we have here\" time.  I will not bother anyone with the setup process (it was easy and time-consuming) but after about 60 minutes we were watching the basketball game in high-definition and it was downright fantastic.  Keep in mind this was a picture and sound out of the box without any adjustments.  I began the tinkering process and the first was to check out the \"Smart\" TV aspects.  It is a lot smarter than I and I failed to outsmart it.  I hooked up the wireless network without any difficulty and engaged in a little internet browsing among several other goodies.  I will end now with that one simple remark:  One fantastic TV plus with all the bells and whistles it is super.", "Date": "March 17, 2013"}, {"Title": "Not Impressed (so far)", "Author": "G. Johanning", "ReviewID": "R2I6N4797HTTZU", "Overall": "1.0", "Content": "My new TV arrived 20 Sept.  One October 3rd, it died.  Kaput.  Powered off, wont turn on.  It lasted a whopping 13 days!  I checked the power outlet.  OK.  I hooked another TV up to the same HDMI cable.  All is well.  I'm still waiting for the warranty people to show up.  Supposedly, it will happen on Tuesday.  More to come...", "Date": "October 13, 2012"}, {"Title": "Returned due to vertical banding problems", "Author": "Joe C", "ReviewID": "R33BAA4QV59GZO", "Overall": "2.0", "Content": "I purchased this Samsung UN65ES8000 TV from Amazon.com on 12/12/2012.  Perhaps it is the size (65 inch) of the panel that causes my TV to have gray and white vertical bands when watching golf course field, blue sky, light blue water features, and all other light green, light blue and white scenes. It is not obvious when first detected. However, the gray vertical bands make golf course grass field looks very dirty.  I do not believe the problem is coming from my Verizon FIOS HD signals.  I tried to adjust TV picture with all options but did not work.  I assume this is a technology problem; so I return it and request refund. The Samsung UN65ES8000 TV has a great sound quality (A+) and in 90% of time this TV offers high quality picture except when white, light green, light blue colors showing up on the panel then it has vertical dirty cloud bands.  Amazon.com allows me to return it and the carrier has picked up the TV on 12/20/2012. Amazon.com services are superb.", "Date": "December 20, 2012"}, {"Title": "Poor quality/damaged?", "Author": "Rotorwng1", "ReviewID": "RG0CXNIBD02KY", "Overall": "2.0", "Content": "Tv looks great. 3D is awesome.  Brightness is terrific. I love everything about this tv except: there is a blob shaped bright spot right in the center of the screen. At night, I can see the bright area through the picture. During the day it's quite unnoticeable. I called Samsung and they sent someone to check it out. The people from Allen's TV,Columbus GA said that tros is normal in Movie mode. Unfortunately, I can see it in every mode. Personally, I don't think those guys know what their talking about. I mean it is Columbus GA and its possible I'm the only one in this Po Dunk Backwoods city that owns this size TV. I figure it will be impossible to convince Samsug that there is a problem with this TV, especially after their \"EXPERTS\" say nothing is wrong.I decided to just send the TV back to Amazon for a refund and I purchased the 64\" plasma Samsung 8000 series. I just don't want a tv that has a bright blob in the center of the screen and I'm not taking any chances getting stuck with a lemon. I'll let you guys know if the new tv is better or worse.The good news is that Amazon is accepting the return with no issues. Thanks Amazon.", "Date": "October 1, 2012"}, {"Title": "Amazing. If your looking for the best, this is it.", "Author": "Max \"Max\"", "ReviewID": "R34UWS4RYSLYFM", "Overall": "5.0", "Content": "It's true.  Now if your the type of person that doesn't like learning how to operate anything or to understand how an investment actually works, don't buy this.  Seriously. Buy a tv that has little features.  Any low star rating review here is from people who think TVs are drag n drop still. Only grandmas tv meets that criteria nowadays, no?  Or you good a bad batch. Even toothpaste runs that risk.  I shopped and read and tested TVs for two months, reading nightly for hours on pros n cons while keeping charts, notes, interviewing users.  Tv is insanely awesome.  So is the 7100 and 6500. I wanted the kids to Skype with grandma so I got the video camera option.  Oh and the 3D?  Wait until you see Life Of Pi on it.  That was my first movie with it.  Even my wife who thought I was crazy for dropping close to 3k on this hasn't said a word since. Now she's always on it. Ha. The size is also perfect. I though first \"man what if it looks to overbearing in my room?\"  It didn't. Perfect size.  You won't regret it. Well, unless grandmas tv is really what you need. Yard sales are great for that.  If you are savvy, this is for you.  Hulu/vudu/Netflix/amazon prime video/Blockbuster all in HD.", "Date": "July 7, 2013"}, {"Title": "Samsung ES8000 65 inch AWFUL", "Author": "Dan", "ReviewID": "R2P2ZD1JCNHZH1", "Overall": "1.0", "Content": "Arrived with a dent in the frames  edge. The picture is horrible and not like the same tv i viewed at the store.I loved this set when i was shopping for it.I am very knowledgeable about electronics and this set here has issues.I can not even adjust any of the settings to view it.I will be returning it.Also there is a horrible light cloud  bleeding in the top middle of the screen.", "Date": "April 9, 2013"}, {"Title": "Wow!", "Author": "Janice Cowen", "ReviewID": "R1SDEHT17HZUA1", "Overall": "5.0", "Content": "What a great picture!  Everything I expected from Samsung!  Received the shipment a day earlier than expected.  White glove delivery!  The television was in excellent condition.  Couldn't be more pleased!", "Date": "March 25, 2013"}, {"Title": "Great Buy..", "Author": "Joseph Tolson", "ReviewID": "R1WB1E11WOOC28", "Overall": "5.0", "Content": "I am very satisfied with this TV.  I'm so glad that I bought it.  I cannot imagine life without a Smart TV now.  A must have for every household.", "Date": "December 7, 2013"}, {"Title": "Cute", "Author": "Bosun", "ReviewID": "R3H4Z7GB7WL1YY", "Overall": "5.0", "Content": "For more than10 months, I've loved my TV and I can't ask for more! Coupled with the Sonos sound bar and surround speakers.", "Date": "November 29, 2013"}, {"Title": "Poor picture uniformity with dark image - grey splotch in center. Dark vertical bands appear with light monochrome background.", "Author": "David Weatherford", "ReviewID": "R366NI26MEE385", "Overall": "2.0", "Content": "Most of the time picture is very good. However, when image is dark (night scene) there is a grey splotch across the center third of the screen. Blacks in that area are too light. Have tried unsuccessfully to adjust image to compensate. Also, when image has a monochrome light background, vertical bands of a darker shade appear across the screen. This is especially bad when the image is panning. In addition, occasionally the image is jerky. Peoply appear to stutter for a few seconds. This seems to occur mostly when first changing to a new channel. After a time the TV seems to be able to adjust itself and the problem stops, but it is pretty bad  when it happens.Two weeks of making adjustments to the TV's settings have failed to resolve these problems. Very dissappointed given the high end cost of the product with the lack of a consistently high quality image.", "Date": "May 27, 2013"}, {"Title": "Samsung 65\" ES8000 3D TV is Awesome!", "Author": "Katherine L. Congdon", "ReviewID": "R2LG17PYKXZUAN", "Overall": "5.0", "Content": "Right out of the box this TV is stellar compared to others.  We searched out a variety of brands and found the Samsung to have the best picture.  The 240Hz makes it a super quick refresh, so no lines or squares showing up.The 3D glasses work much better than the other brands.  These use a battery so the powered glasses help.  Paired with a Samsung 3D BlueRay and the system takes over automatically when you install a disc.Super thin.Very compatible with cable remote.", "Date": "May 4, 2013"}, {"Title": "Ryan W.", "Author": "Ryan Wilder", "ReviewID": "R4G2UBSPZM19P", "Overall": "5.0", "Content": "I love this tv. The picture is great. The apps are really cool. The wired network connection is really fast. The only thing I have an issue with is the audio out. For some reason the tv only puts out sound on 2 channel. Even when using the optical output. To get 5.1 surround sound you have to use an external receiver. Other than that its a great tv.", "Date": "May 2, 2013"}, {"Title": "GREAT TV", "Author": "some random guy writing about stuff that he buys", "ReviewID": "R27LYHG6KFI7BM", "Overall": "4.0", "Content": "Been about a month since I have had this tv now:Pros:Bright3DCons:Whenever the video is all dark, you can see this two bright patches in the middle of the tvneutral:hand motion - cool idea, but playing angry bird on it is very very tiresome -_-", "Date": "May 1, 2013"}, {"Title": "Great TV", "Author": "Natarajan Palani", "ReviewID": "R10RTGZ3UCWL5J", "Overall": "4.0", "Content": "Great TV, the only issue that I have to the Keying in the letters is little hard from the remote.", "Date": "April 20, 2013"}, {"Title": "satisfied", "Author": "A. Mark Eudaley", "ReviewID": "R3O0VHYS5OYT8F", "Overall": "5.0", "Content": "a very fine picture. the 65\" doesn't seem all that big once it is up and going.the white glove sevice was great.  installed without a hitch.", "Date": "April 1, 2013"}, {"Title": "New toy", "Author": "Alvin A Arcemont", "ReviewID": "R2AXKJ36AA0U78", "Overall": "5.0", "Content": "Setup went much better than expected.  Now I need to learn more on how to maximize the TV's full potential.", "Date": "March 30, 2013"}, {"Title": "Great TV!!", "Author": "Micaela", "ReviewID": "R221AL00K62R02", "Overall": "5.0", "Content": "This TV is amazing, we could have used a bigger size based on space we had, but this is still good enough. Pretty and perfect. No problems so far.....", "Date": "December 13, 2012"}, {"Title": "Best TV", "Author": "thatoneguy", "ReviewID": "R348E5XB2CFIZV", "Overall": "5.0", "Content": "I recently bought the 65 inch Samsung UN65ES8000. I am very pleased with the over all quality. The touch pad TV remote is fun to use every now and then but is not responsive enough to be used at all times. The picture on this TV is absoluteness amazing, it blows my 47 inch LED TV out of the water. Some channels that are not HD can be a little blurry but that's expected when using a larger TV. The HD channels show up perfectly however. I viewed a lot of other TV's before finally settling on this model. I probably researched other TVs for about 2 months. I went to my local mall where they had one of these up for display along with 50 other TVs. This model was way more attractive than any of the other brands and even better than the other Samsung's that were out. I was shocked when i compared this TV to a Sony Bravia that was on display as well. This TV is a bit pricey compared to most, but if your looking for picture quality and a TV that just wows everyone when they come in and see it this is absolutely the TV your looking for. Great job Samsung you made an awesome product.", "Date": "December 10, 2012"}, {"Title": "STUNNING superb TV with few cons", "Author": "Anthony R. Difiore", "ReviewID": "R3U1R2LAT2312Q", "Overall": "5.0", "Content": "This is the most beautiful, superb TV I've ever owned. It hangs on the wall like a portrait, and looks enormous. I get a constant stream of compliments whenever people see it, even if the TV isn't on!! The picture quality is great, and I love watching whatever I can in 3D. I'm not a TV aficionado, but I've owned a series of nice Samsungs, and this is by far my favorite. Honestly, my only disappointment is the Smart controller, because it's slow to type buttons when I'm using the TV to browse the web. It really needs a keyboard, and maybe one exists, but I'm not a techie so I haven't researched this!!<3 this TV. You can't go wrong with it.", "Date": "October 17, 2012"}, {"Title": "samsung un65es8000 3d  tv", "Author": "David M Hall", "ReviewID": "RO2E5TSSUTA4O", "Overall": "5.0", "Content": "TV was very easy to set up, 3D grafics are beyond belief.Very satified.Would recemend this product to any one who wants to see the very best.", "Date": "September 30, 2012"}, {"Title": "TV so amazing!", "Author": "Ife", "ReviewID": "RKQ0FOKLTW35R", "Overall": "5.0", "Content": "TV viewing cannot be better than this! I use my TV overseas and it works perfectly....love all the technology this TV offers....really a SMART TV.", "Date": "June 9, 2013"}, {"Title": "Amazing Tv!", "Author": "Kelvin Quiroz \"Maldito Duende\"", "ReviewID": "R21UWIHX0SZGG0", "Overall": "5.0", "Content": "Samsung really made it whit this tv, really outstanding picture quality and tons of features.The gestures to control the tv its a very nice with voices and hands, even to tell the tv to surf on the web. I've a Playstation 3 and the games looks amazing.The 3D its amazing and comes with 4 3d active lens.I recommended!", "Date": "June 6, 2013"}, {"Title": "Incredible TV", "Author": "John Litras", "ReviewID": "R1ON3BS959ON0A", "Overall": "5.0", "Content": "I originally ordered this TV through Amazon with Paul's TV as the seller. It arrived a couple of days late but not that big of a deal. (local delivery company problem) I've been a Samsung TV buyer for a long time and I bought this one to replace my 2010 UN55D8000 which is still a Great TV (now on my basement wall) I looked at a few others and read reviews on all and I did see some negatives on the Samsung but after looking at all of them in person, it still had the best picture I've ever seen. I was excited when it arrived and got it set up in only a few minutes, very easy set up. I connected it to my directv, blu ray player and sound bar and was ready to go in a few minutes. When I turned it on, it looked good but not Fantastic like I was expecting. After a little more watching, I noticed on dark scenes a Big White Cloud (almost heart like shape) covering about 60% of the screen! I tried all kinds of adjustments and couldn't get rid of it. The soundbar also kept going in and out and although I hooked it up with a brand new Digital optical cord, the connection just wouldn't stay strong. Then I could not get the plug out of the back of the TV no matter what I did so now I had a white cloud and no soundbar...Not Happy! I called Paul's and Samsung and Paul's offered to take it back immediately but they were now out of stock. I sent pictures of the issue to Samsung and they said they'd send the local service out to look at it but when the service company saw the pictures I downloaded, they immediately said they would have to order a new panel. I declined immediately and told Samsung I wanted a replacement set. They told me that I would have to go back through Paul's / Amazon for a replacement. I called Amazon and spoke to Jessica to explain the issue. Since the TV was out of stock at Paul's I would have to order another through Amazon directly and Paul's would pick up my 1st one. The next problem was that I used Amazon's 24 month Zero Interest promotion (through GE) and if I ordered it and just paid cash, I couldn't use the promotional 24 months! I wasn't happy but they worked it out in just a couple of days with Paul's and the credit card so Paul's picked up the original last Friday morning,(with the optical cord still attached!) credited the money back to my account that day and my new one from Amazon was deliverd 6 days later on Thursday. Although it was a bit of a  hassle, both Paul's and Amazon provided Great Service!Now, about the TV...This is what I was expecting! The picture is Incredible and there are No Issues...no light bleed, No lines or pixel problems at all and I am amazed at how great the picture is! I don't bother with the touch pad remote or the voice control-hand gesture stuff. I hooked all my devices up to a Logitech Harmony 650 Universal Remote and it works like a charm! Real easy to use, even for my wife and just 1 remote needed for everything, including Netflix, Apps & Web. In conclusion, I'm thrilled I bought this TV and highly recommend it. If you get one and it's not perfect, send it back because it's worth the wait to get a perfect one.", "Date": "April 12, 2013"}, {"Title": "Samsung 65\"ES8000", "Author": "Pete Duro", "ReviewID": "R1BS4WAAOLNKUO", "Overall": "5.0", "Content": "The TV rocks. It is as expected. I own many samsung tv's. This is replacing a 1 year old 55\" samsung 3d tv that i moved to another room and we are very pleased with the improvements in the new model. The voice nav can be finicky but i expected that and don't use it much.", "Date": "August 3, 2012"}, {"Title": "bleeding galore", "Author": "A. Amyotte", "ReviewID": "R12G3143VZB28T", "Overall": "2.0", "Content": "I tried one 55 inch and two 60 inches and yes the image is unbelievable till you get into the dark seen and then bleeding that is unreal for a top of the line tv.I returned them all and went back to the sony tv (xbr) and never regretted one moment.Come on samsung you can do better then that", "Date": "July 22, 2013"}, {"Title": "worked right out of the box", "Author": "S. West \"Sheldon\"", "ReviewID": "RIHLQ2T4WFVLS", "Overall": "5.0", "Content": "have had about a month and is working fine . appears to be no dead pixels and was packaged securely.", "Date": "April 2, 2013"}, {"Title": "It v.cool", "Author": "Pilot", "ReviewID": "R2GB8FE6D33GJB", "Overall": "4.0", "Content": "Its v.cool and a lot of wonderful option is theirBut the main problem that i am living in the Middle est  region and the USA system they use NTSC system and ours is PALAnd when i ask our providers in ME they told me our provider they use multi-system which is both system then why the USA system not the same ???", "Date": "January 8, 2013"}, {"Title": "Returned due to unacceptable picture quality", "Author": "T. Ross", "ReviewID": "R39TJ5DACJZCX1", "Overall": "2.0", "Content": "Returned it after one week due to non-uniformity of the picture.  This was only noticeable when the picture panned across a uniform dark background like a golf course or football field.  Subtle but disturbing once you noticed it.  This may have been a bad unit or just a characteristic of the technology. Also the soap opera effect was disturbing on movies... made everything look fake.We got a Panasonic VT50 instead and are very happy with the picture, although we wish it were slightly brighter like the LED TV.", "Date": "December 3, 2012"}, {"Title": "I dont hate the TV...", "Author": "john Nuckolls", "ReviewID": "R2X7R3AVAPLAB3", "Overall": "5.0", "Content": "I love this Samsung TV and I have two others. I ordered and received this TV. The TV had a blue screen and my other half accepted the TV. I was having the TV installed by an AV specialist and my appointment got delayed at least 4 times.Finally the install is complete past the 30 days of purchase. The AV specialist notices a vertical line of LED lights out on a blue screen background because its very difficult to see otherwise and he suggests calling Amazon/Samsung immediately to get it repaired.I called Amazon, sorry its past the 30 days. You need to contact Samsung. I contact Samsung and they put me through customer service process assign a repair vendor to come out and repair the TV. Great! Next thing I know, the repair appointment is cancelled because I sent them a picture of the TV blue screen and they determined parts were not available to repair the TV because its been dis-continued.Samsung tells me they would swap the TV out but they don't have any available. Samsung requests the invoice and they will refund the cost of the TV etc and pick up the TV in two days!! I explained, I can wait for the part or a TV swap when one is available in a month or two. Samsung customer service declines and states they dont do that. I explain, I have kids and these aren't viable solutions for me and my family. It doesn't make sense, I haven't done anything wrong.I quickly realize, the TV I bought on sale was now $1400 more than what I purchased the model, and that's if you can find it. I ask Samsung to escalate the matter to a manager or Director of customer service who may be able to offer a viable solution and they wont return my calls. I was very professional with both Amazon and Samsung. Very disappointed, I love Samsung TV and Amazon but I have just been tossed into the wind. I'm not thrilled with the 30 day and deal with the manufacturer. If I went to Costco, I would never have had this problem period.Well there is great news now, and the change for my rating to were it should be with such high quality products. Samsung is now exchanging my TV for a brand new model that hasn't even been released yet.I'm so glad Samsung stepped up because I love their products and I love my Samsung TV's!!!And now my mom and dad are going to buy a Samsung TV because they love mine and see how they stand behind their loyal customers!!!!!!!!!!!!!!!!!!!!!", "Date": "June 11, 2013"}, {"Title": "Nightmare .. .. .. Horrible software", "Author": "Techie", "ReviewID": "R2TRRZSTGUKP1", "Overall": "1.0", "Content": "I placed this order by mistake and by the time I tried to cancel it, amazon is about to ship TV so I couldn't cancel my order so I got chance to review this expensive TV.PROS:1. Outstanding 3D  (so what, I don't watch 3D all the time)2. Good Design3. Good picture quality (worked so hard on settings to get expected quality)CONS:1. When I am watching TV, suddenly smart TV will come and go after 1 second (Voice and motion control is already turned OFF)2. Navigation in smart TV is very slow compared to my D8000 series Samsung TV. Not even close to D series3. When I try to play movies using all share, it will say this format is not supported. I have to go back and play the same video again so that it will work. Worst part is sometimes TV will get disconnected from network completely. I have to restart TV so that it will reconnect to network again.4. When I am watching movies, TV will restart automatically.5. Voice and motion control is junk.Today technician came to my house and checked all the issues. He said he will be back on Monday after talking with Samsung.I will update later .. .. ..UPDATE: 12/11/2012Samsung tech called me and said he cant repair it as Samsung informed him that MKV files are not supported by Samsung. I dont think so because my old D8000 is supporting properly.DECISION:Sending TV back to Amazon for refund.", "Date": "December 8, 2012"}, {"Title": "External sound out of sync with picture.", "Author": "Stephen Goldenberg", "ReviewID": "R22H4P6WRJJZQT", "Overall": "4.0", "Content": "My 2 year old Samsung 52\" has one unfixable problem. The external sound is a head or behind the video.Works fine with internal speakers so you can't add a 5.1 sound system or even TV ears. It's very obviouswhen you have external and internal on at the same time. Big echo.", "Date": "March 25, 2013"}, {"Title": "Screen Cracked while Adjusting", "Author": "Gregg M Davis", "ReviewID": "R37DFENGQSGG5U", "Overall": "1.0", "Content": "I had the TV in my hours for 3 hours. I hung the TV on the correct Samsung Wall Mount Clips. The clips (WMN250C) are a new model and they clip in the TV. The unit can move on a track and when I went to adjust it per the instructions the LCD screen cracked. The back of the unit is very thin plastic and it flexes back and forth. A unit this big needs a rigid back. The new clips are plastic tabs that get locked into metal. The clips are too strong to allow you to adjust the unit in the track. Samsung sent a person out to verify the TV was not physically abused and he told me it would probably be covered. Samsung called back and refuses to help. They want over $2000 to repair a TV that was broken within 3 hours using their products and following their instructions.The picture doesn't even look that good where the screen isn't cracked. I own 4 flat panel Samsung and this model is by far the worse as far as quality.", "Date": "August 3, 2012"}, {"Title": "Corner cutting, Workmanship issue, poor/no support!", "Author": "Cos", "ReviewID": "RXZ55QXFQ7NWY", "Overall": "1.0", "Content": "Updated 1/15/2013: I wish I could lower my review.  Set still not fixed.  I am on my third main board, samsung refuses to replace set, and gives me the run around. I have lost time out of work, samsung puts you on hold and acts like they have no idea there is even a problem.  Last tech wrote up the set was still not fixed, and samsung refuses to replace set.  Some one did call back once, left a number, refuses to return any of my numerous calls.  Samsung is terrible, the worst, do not buy anything from them, ever.It appears Samsung TVs have no quality control (other than the consumer being stuck with a defective product, so if you got a good one, you are very lucky, but I suspect you will have problems at some point). Right out of the factory sealed box, my brand new new PN64E8000 top of the line 64\" Samsung Plasma is defective. (My TV is similar to the UN65ES800 in regards to the problem, which you will see if you read on).  It is extremely difficult to get an HDMI connection. I tried 3 different cables, different cable manuafacturors, lastest ARC and 3D cables, and all 3 HDMI receptor slots. This in itself took hours of my time. The 3 HDMI receptor slots are in a multi input bar, which moves when you press on it. Yes, it actually moves. This is the design flaw.  I went to a store that happened to be setting up a UN65ES6500, a near top of the line LED, It has a similar HDMI connector plate which also moves. The UN65ES800 also appears to have a similar connector plate.  I recomend you go push on one for yourself before you buy. You can actually move it with one finger. Any Engineer knows that moving connections is a poor design. The specs are bad and need to be changed before the problem will go away.  If everything is just right, it may work for a few hook-ups and un-hook-ups, but it is likely to fail, probably after your one year warranty is up. Samsung customer service sent me an email confirming they received my request for support, then they closed my ticket without fixing TV. They will not re-open a ticket, I am on my third ticket now. I evenually reached the Executive Customer Relations Department, who claimed fixing the TV was not their responsability (quoting some fine print in their home warranty policy like they new it by heart). Basically what you have is a large 64\" TV, which they will not touch or move in any way, you have to provide the labor to get the TV flat on a table so they can work on it. This may be acceptable to strong young people, but if you are older, you may have to pay $500 or more to have TV put up and down. So you either need to shell out cash, or call in favors, so Sumsung can stick you with the hardest part of the repair.  Oh, and good luck finding a place to store this thing while it is down and you are waiting and waiting for Samsung to send a tech.  If you live in a big city it may be quicker, but where I am, the closest shop is 3 hours away in each direction, and I live 30 minutes from a good sized city.  The TV is huge and very very very very delicate. I actually heard the unit crack while the TV delivery guys did their intial unpacking, and I watched them the whole time, I do not know how they could do anything different.  So basically every time you (yes you) have to move it (so Samsung does not have to take responsability for their delicate product) you take a good chance of breaking it.  The hardest part is lowering it down to a flat position.  It has no lateral rigidity, and you can hear and possibly feel the set strain no matter how gentle you are.  The movers I had handle TVs all the time and were very carefull. Well, Samsung eventually refered me to the Office Of the Present@Sea.Samsung.Com, who will not accept phone calls. Without HDMI this set has limited value. The internet features take forever to navigate. The duel processor system is slow, slow, slow, SLOW!  This is regardless of your internet connection speed, the TV is just to slow to deal with all the non-vaule software you have to get through.  Two worthlessly slow processors are NOT better than one good one. Perhaps they know the processors are crap, and that is why the offer the evolution upgrade pack that they plan to sell for large amounts of money, so you get to pay over and over. Once you get through the slow and hard to use process of locating something you might want ot see, it ends up either being a pay for service app or a short vidoe with several commercials (except U-Tube, U-Tube is pretty great, at least for now). So, I suspect Samsung deliberly has this approach of no quality control and then refusing to support the TV because they make money that way. All we can do is boycott all Samsung products and hope they go out of business, I suspect that they will never change a system that works for them. It may also be a good idea not to vote for these right wing Republican leaders have do not feel that consumer protection is the role of Gorernment. Oh, the voice control and motion control on the 800 is crap, so that is one advantage of the 6500.Basically Samsung does not appear to inspect the TVs before they ship them out, at least not in a method that works. They rely on the comsumer to find the problems, then force the consumer to pay the most expensive part of the repair, which is hiring \"insured\" people to move the TV. Yes, I do recall that was one of their excuses, the insurance of moving the TVs was cost prohibative, that's probably because they make their TVs so delicate they break very easily, assuming it isn't already broken when you get it.UPDATE: Samsung says to fix the HDMI connectors they have to replace the entire main circuit.  This must mean that instead of just a panel of connectors, the connectors are hard wired onto the main very expensive circuit board.  This basically means that they have cut corners to the max and when Samsung's cheap faulty HDMI connections eventually fail, most people will be looking at a bill of several hundred dollars, perhaps even a $1,000.  Most people will just buy another TV, hopefully they will be smart enought to get another brand.", "Date": "November 21, 2012"}, {"Title": "excellent customer service", "Author": "Domenico Crapanzano", "ReviewID": "RPWQZPYE0U42E", "Overall": "5.0", "Content": "I bought three of these. Very happy with them. One had a dead pixel line running down the screen. Called customer service and received a technician visit at home with a new screen in the space of 4 days. Amazing customer service. Efficient and absolutely painless. Go Samsung!", "Date": "April 12, 2013"}, {"Title": "The only TV that would capture your eye in a store", "Author": "O. Maksymenko", "ReviewID": "R19K3NBKGTX07Q", "Overall": "5.0", "Content": "Got this TV today, really impressed. Haven't noticed any color bleeding and light spots, the image is very uniform, the colors are absolutely wonderful, probably little bit over saturated (Standard mode) but if you switch the TV to Movie mode the colors are getting normal and natural. The touch remote is weird, I would swap it for a second normal remote or a qwerty keyboard. Voice and gesture controls work well, the only concern - gestures don't work in the web browser (why Samsung???). 3d is superb, but I would still go to an IMAX 3d theater if I'd like to watch a 3d movie because 65\" is just not a good \"3d size\" at least for me.The AllShare feature is awesome as long as you install the AllShare application on your home server or laptop. It's capable to stream pretty much every popular video format (yes, including MKV!) to the the TV.In general it's an excellent TV, one of the best 65\" your money could buy. I was debating between buying this TV or Sony XBR950 and I didn't notice ANY visual advantage of XBR950 over ES8000. Why should I care if Samsung managed to build a sophisticated edge-lit TV that has a better picture than a full-array one and it also saves you $1500+.I know some people have quality issues with the earlier 8000 models, but I believe most of the problems have been resolved by Samsung, so if you decide to buy one - buy from a big retailer like Amazon: they have newer models in stock and usually returns and exchanges are much easier with them.", "Date": "December 13, 2012"}, {"Title": "Best in HDTV!! Sony was left behind!!", "Author": "Hely G. Martinez Montiel", "ReviewID": "RR7Z7TVFN4VYP", "Overall": "5.0", "Content": "Best in HDTV!! Exceeded all my expectations, I have always been a big fan of Sony which still respect and like, but this TV is the best I have seen so far beyond!! As for the price is even better in this size 65-inch TV the other brands that can be matched to Samsung, for example the Sony with similar specs costs $ 1600 more!", "Date": "October 18, 2012"}, {"Title": "Great TV - my first Amazon fail", "Author": "tkeo2", "ReviewID": "R1MBBTUD48TYQU", "Overall": "2.0", "Content": "I am giving the experience a 1 star and the TV a 5 star.  The TV has a great picture and the smart features are ahead of its time.  I like the gesture controls for adjusting volume.  I also like having built in wifi so that I can stream netflix, pandora, or amazon prime directly through the TV.I originally purchased the TV through Amazon.  Out of the box, it was broken with dead pixels running both vertically and horizontally across the screen.  I tried to get them to swap out the TV with the same model....only to have them tell me they could no longer provide?  So after repackaging, waiting at home for the pick -up....I then had to purchase the item from another vendor.  I found it hard to believe that Amazon could not send a replacement.  Oh - they have a special department for large purchases...which was not so user friendly.", "Date": "December 23, 2012"}, {"Title": "SAMSUNG CEO REP MISREPRESENTS CERTIFIED DEALER RULES", "Author": "drk", "ReviewID": "R1S3Y35C188HRY", "Overall": "1.0", "Content": "I have been on back order, and as I am told, countless others for this Samsung ES8000 model, going on 2 months now.  I  Contacted the CEO, and with witness, had a call from his rep,,, he lied to us about non delivery and distribution, and above all, not having anything to do with Bundles and package deals either!The CEO and this guy don't care about US buyers! Simply put, won't back their suppliers, and won't support the buyers!!  This guy was not only rude, but short, curt, condicending, and basically could care less.  When asked specific questions regarding the situation, he outright lied to me with regard to the distribution, the pricing restrictions with regard to \"certified dealers\", and bundles and packages.  He told us that Best Buy, Tiger Direct, and all the others we approached to buy the UN65ES8000 were not correct in their comments regarding the regulations of pricing and bundles, etc.. that are as they claim when we go to buy something is set by Samsung.I have it via witness and recorded.  Its time people understand the mentality of the SAMSUNG CEO as represented by the man who we talked with.  There was no hint of ethics here, no morals, or honor exibited by this man and he was clear in stating he represented the CEO!If you are a US citizen, beware of the CEO, he cares nothing about you, only to sell you his goods and to bask in the sun on your money, not to mention his rep! Spread the word, dishonesty at this level needs to be talked about, referred to, and shared until the CEO gets the message loud and clear.Dr. K,,, California", "Date": "October 16, 2012"}, {"Title": "Fantastic", "Author": "Medina35", "ReviewID": "R3NM2PQMBFVDFW", "Overall": "5.0", "Content": "One of the most good televisions. I like it and probably you to. Big tv looks great for me. And really advanced tv in technology. Great tv", "Date": "October 18, 2012"}, {"Title": "Horrible picture, overpriced and more MUST READ.", "Author": "C. R. Cruze \"C R. Cruze Audiophile & Home The...", "ReviewID": "RHQJ16LV5HR7N", "Overall": "1.0", "Content": "This is supposed to be the best well second best tv samsung makes there best is the ES9000. I've spent a lot of time with this tv and the more and more i watched it the more i noticed what was wrong with it.This review is based off viewing the tv in every one of its picture preset modes and calibrated setting too.every mode looked bad and showed problems. The problems with this tv were not affected by my settings in my Marantz AVR, my oppo bdp-103 blu ray or audioquest cables i can assure you of that.ConsUnbelievably bad motion. 240hz and 960 scanning backlight. makes things look fake and there is image ghosting.Bad off angle viewing.Picture Noise. one of the worst tvs for digital noise btw.color reproduction is off. even when calibrated.led back lighting leaks through. basically the blacks are blue. and there is a halo affect too.Pro'sSmart tv featuresslim light weight.Stay away from all Samsung TV's i would recommend Panasonic for Plasma sets or Sony XBR's for LED's if your considering a new tv.i took it back to Magnolia Hi-fi and got the 55\" Panasonic VT50 Plasma and WOW! no wonder the salesmen and Cnet call it a reference set, theres simply no comparison. 5 months with the VT50 and Im very very happy with it!", "Date": "December 24, 2012"}], "ProductInfo": {"Price": "$4,779.99", "Features": "Smart TV with Smart Interaction and Smart Evolution\nSmart Content with Signature Services\nBuilt-in Wi-Fi and Camera\nFull HD 2D and 3D\nThin LED Design: TV with stand (Width x Height x Depth): 58.3-Inch x 36.1-Inch x 11.5-Inch, TV without stand (Width x Height x Depth): 58.3-Inch x 34.5-Inch x 1.3-Inch", "Name": "Samsung UN65ES8000 65-Inch 1080p 240Hz 3D Slim LED HDTV (Silver) (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/51VlB3Ee1eL._SX300_.jpg", "ProductID": "B0074FGMEW"}}