{"Reviews": [{"Title": "Excellent TV", "Author": "Antony Steele", "ReviewID": "R3TCHEGT8X91OP", "Overall": "5.0", "Content": "Purchased this unit at a Brick and Morter store, and the Manager gave me a great price on this unit. I was actually shopping for a Plasma, but this overall screen brightness in 1080 resolution backed by the LED-LCD really came through in incredible clarity. I am running this through a HTPC, and using regular Broadcast TV to view. The HD programs streaming from the Internet are incredible using the HDMI port. I have a separate speaker system through the HTPC, but the base TV speakers seem to do a nice job. I have not tried Blu Ray yet, but I do not think I will be disappointed. I want to add that this TV is very easy to set up and to optimize, versus some of the tuning and burn in you have to do with a Plasma. I do not regret the purchase, and it seems like excellent performance and value. Also, I have not run into any \"blurred motion\" problems that LCD is known for. The specification on this TV reads more like a high end Computer Monitor, with a super fast refresh rate. In essence, as I do not get any blurring problems on my HP Computer monitor playing games, I do not anticipate blurring problems on this TV.", "Date": "October 28, 2012"}, {"Title": "Awesome tv!", "Author": "Crixus", "ReviewID": "R1SKAPFLEVL68W", "Overall": "5.0", "Content": "I bought this model about 4 months ago and I don'thave any complain so far. The quality of the imaging and soundis great. I use it for video games and movies and I recommendthis model to anyone looking for a very nice tv for a reasonable price.", "Date": "November 4, 2012"}, {"Title": "Great so far", "Author": "Kristin Smith", "ReviewID": "R1BC2CPM2TEY3", "Overall": "5.0", "Content": "Purchased this TV about a month ago for my bedroom and it's been great. The picture is very clear and sharp.  The sound is a little echo-y but that could just be from the location of the tv.  Great product for the price.", "Date": "October 20, 2012"}, {"Title": "Great TV", "Author": "Ike D.", "ReviewID": "R1P8PNB0LBR7RX", "Overall": "5.0", "Content": "I will recommend this TV to all. I cannot believe I bought it for $350.00 including standard shipping. Got it in 2 days from STL Inc. Now I see the price has changed, but it is definitely a great TV. I love it.", "Date": "October 13, 2012"}, {"Title": "Great Value", "Author": "Michael D. Macdonald", "ReviewID": "RZ8X4KOEWLZ80", "Overall": "5.0", "Content": "I bought this television in November of 2012 and am writing this about 3 months later.Aside from the price, the most impressive spec for this unit is the yearly energy cost. At 4 hours per day, the annual claimed cost is $11...I suspect that assumes a lower cost per kwh than what I pay but it is something I am pleased with.The television comes with plenty of connectors...I have a cable box and xbox connected to two of the three HDMI ports and sometimes connect a tablet to the third. I live too distant from any tv signals to comment on the over-the-air tuner but the pictures from cable are bright with no blurring during hockey or football games.Though I will be attaching a sound bar to it, the sound quality and volume has been surprisingly good...enough so that I delayed the upgrade.I am using the supplied stand which is both attractive and at least adequate in terms of sturdiness, I have the tv stand tethered to the wall but would be leery about this setup if small kids were in the house; while it seems stable, I am sure it wouldn't take a huge push to topple the television to the floor.Possible Concerns:-A note about the USB port: The manual state that you can use memory sticks up to 8 GB however it recognizes my 16 GB Patriot thumb drive well enough. Unfortunately, the only video format supported is 320 x 240 @ 30 fps. I use the xbox to watch videos instead.-When watching videos through the Xbox on some services such as Crackle, the sound through the television speakers is very muddy and has to be cranked up. I suspect that if I played with the sound settings, I could clear it up a little.", "Date": "February 25, 2013"}, {"Title": "beautiful picture", "Author": "Suzie Cannon \"Suzie Q\"", "ReviewID": "R311GHM09U9FYX", "Overall": "5.0", "Content": "Very light weight for the size and super impressed with the picture and speaker sound.  This being paired up with my Roku and I am fully entertained!", "Date": "January 3, 2013"}, {"Title": "Outstanding TV", "Author": "Andrew J. Darlow", "ReviewID": "R182IKI2NDF57M", "Overall": "5.0", "Content": "I was very impressed overall with this purchase. The screen had no dead pixels, it is sharp, and the color is excellent. It took a few adjustments with the remote (aspect ratio) to get my MacBook Pro to display perfectly (no to little cropping).", "Date": "December 28, 2012"}, {"Title": "So far, so good", "Author": "Charles M. Caruth \"C. M. Caruth\"", "ReviewID": "RL13LSFEQII2I", "Overall": "5.0", "Content": "I've only had this set for a month; but so far it delivers beautifully! The set was not complicated to set up, and the LED screen is crystal clear. I basically have set and left it on the \"SPORTS\" setting for very vivid color and motion. Hopefully, it will give us many years of excellent service.", "Date": "December 7, 2012"}, {"Title": "Great TV but...", "Author": "Sprado", "ReviewID": "RD951N0ZFP44Z", "Overall": "2.0", "Content": "Ghosting is a major problem with this TV. I don't know if it is a faulty TV or ghosting is a major problem with all LED TV's, but it's  unacceptable. I've tried everything I can think of to try and fix the problem but nothing has worked. Other than the ghosting this TV is great.", "Date": "December 30, 2012"}, {"Title": "Great Inexpensive TV", "Author": "PartyJoe", "ReviewID": "R2FCUQ5ES8XOVW", "Overall": "5.0", "Content": "Great TV. No downsides that I can see. For the price, I couldn't have gone wrong. Everything works just fine.", "Date": "April 3, 2013"}, {"Title": "Nice TV", "Author": "Juanita Pied", "ReviewID": "R1I2E2EQUW99R6", "Overall": "4.0", "Content": "The TV is working well and has a nice image. & sound options. I can really tell the difference of having HDTV now.The great thing is that menus are very simple. Only drawback, there is no possibility to set up favorite channels, nor to keep the info on screen while changing channels.", "Date": "March 18, 2013"}, {"Title": "Nice TV", "Author": "C. Pendleton", "ReviewID": "R112ENAF9S6QS1", "Overall": "4.0", "Content": "Works fine, hanging in a bedroom and has good contrast as well as a  sharp picture.  I would recommend and buy this set again.", "Date": "March 18, 2013"}, {"Title": "Beautiful", "Author": "Rosa \"Amazonholic\"", "ReviewID": "R2MIVGUZ1MX7OL", "Overall": "5.0", "Content": "For the price this is an amazing tv.  Beautiful image and perfect size for my bedroom.  I bought a $50 Roku to stream movies and music on it and didn't have to pay an extra $1,000 for a wifi capable tv.The sound is great also, no need for a surround sound system.  I even play my phone's playlists through my Roku on it.Could not ask for a better tv for the price.", "Date": "March 8, 2013"}, {"Title": "Know what you're getting", "Author": "Hank", "ReviewID": "RKPUTKIJVT3LN", "Overall": "3.0", "Content": "Know what you're getting. On the internet, there's some discrepancy about this TV.First, the USB port is practically useless. It will show pictures, but it only shows videos formatted in \"motion jpeg at 30 seconds per frame\".  In regular terms, don't expect any video from any UBS or Teradrive to work. If you think 'reformating will work'... good luck with that! Furthermore, if you have any audio files in that UBS stick, those won't work on this TV either. By the way, over the internet there's some discrepancy on whether this is a Smart TV - it's not. No Apps. No internet browser. Yada yada. Don't trust TopTenReviews*com is my point on this.Though i'm still contemplating taking it back, especially if i can get a better deal in the next twenty days and counting. There are a couple of things that are stopping me. The sound from the monitor is fantastic. I've heard horror stories about RCAs and poor sound quality. What's more, it is a name brand, LED, 1080p for a good ratio ($400 to a 40inch). That's a decent deal.Three stars for me. I realize they cut where they could cut (this Philips TV is the only model with a subpar USB) but this is a decent deal for less than $400.Oh, if you are paying more than $400, pass. This TV can shoot up in price, but I'd wait for it to come back to $400... if you aren't getting that deal, I can't stress it enough. Pass!", "Date": "February 9, 2013"}, {"Title": "Pretty much perfect", "Author": "P. O'Kane", "ReviewID": "R3PHIKAG27DLWJ", "Overall": "5.0", "Content": "Pros: - Picture quality is fantastic - Viewing angles are amazing - It's built like a tankCons: - It's thin, but there are thinner LED TV's out there", "Date": "January 3, 2013"}, {"Title": "Works perfect!", "Author": "Hugo Basabe", "ReviewID": "RVJ3HQT7F4F27", "Overall": "5.0", "Content": "I have had this tv during a year and it has worked perfectly, it has gone beyond my expectations.  It is really thin and light and for the amount of money i paid, there is no better option than this one.", "Date": "October 30, 2013"}, {"Title": "Everything I wanted.", "Author": "Antuan Walker", "ReviewID": "R3E7AXLC2NFM7A", "Overall": "5.0", "Content": "TV looks and sounds good.Still going to get some level of surround for it,but resolution and lighting is fine for my usage.", "Date": "June 24, 2013"}, {"Title": "Crisp, clean and nice color.", "Author": "As it is so shall it be...", "ReviewID": "RL0DV2MR0FXAT", "Overall": "5.0", "Content": "I'm not sure what anyone else sees, but what I see is a television at a phenomenal price that more than met my expectations. None of this blurring others complained about. Sharp colors, great bedroom tv, easy to set up, (my daughter and I did it in about 10 minutes at the most). So, it's all good and I would certainly buy more if I were in need of them. The old 32 inch went to the daughters room. We are getting ready to dump cable for all but the most basic of channels and all needed HD tvs for streaming purposes such as roku, as well as the other services. I figure, I'll save close to 50 to 75 a month in cable tv charges alone. That means this tv more than pays for itself in about 6 months. Even with the streaming monthly fees. You can't beat that. Oh, and add Amazon Prime on top, I'm set for late night television with my laptop or a roku up there as well.", "Date": "April 16, 2013"}, {"Title": "Great TV if you can get it.", "Author": "Tman", "ReviewID": "R1XAM31FJORHTP", "Overall": "5.0", "Content": "This is a nice size tv, great remote, great sound and picture.  This particular model is no longer produced.  It could have been found for around $350 black friday deals.  We paid $450 from a company that may have had the last few available.  This is the second Philips we have had in the last year and have liked both.", "Date": "April 4, 2013"}, {"Title": "Philips 40 inch High Definition TV", "Author": "Colleen Lee", "ReviewID": "R1T2N0C7ZH5X7V", "Overall": "5.0", "Content": "This is a nice quality television set with straightforward features regarding the resolution of the picture.  I like that it is universal to my cable remote control.  I hope the set will last longer than 2 different TCL televisions!", "Date": "March 15, 2013"}, {"Title": "Great for the Price", "Author": "enzofrost", "ReviewID": "R1E0SDOPTDOYJ2", "Overall": "5.0", "Content": "Ive seen better TVs and still prefer my Samsung admittedly, however for this price this TV is great. If your looking for the latest features and sharpest image look elsewhere and expect to pay at least double. If you are simply looking for a daily use Television this is a winner. Better in my opinion than other TVs in the segment it has a great screen and while the features are a bit lacking the features that it does have are simply, intuitive and helpful the best of which being the USB that actually reads external drives for recording or playing things saved on the drive.While Im not saying its the best TV out there I gave it a 5 star rating because it does what it is supposed to and does it well and for the size price and feature list it ranks near the top of the competition and I havent found anything I dont like about the TV as a daily viewer", "Date": "January 25, 2013"}, {"Title": "Great TV Great Price", "Author": "Hank Schwartz \"Hank\"", "ReviewID": "RBIR60U72X46F", "Overall": "5.0", "Content": "First off the price is right. As long as you dont mind a 60hz TV, which I didnt, This TV is going to be great for you, the setup was about as easy as I could imaging, and the 3 HDMI ports made set up to my receiver, xbox and blu-ray a snap. Picture quality, easy set up and great price are the reason for my 5 stars, buy this TV and enjoy with confidence.", "Date": "February 10, 2013"}, {"Title": "Philips 40PFL4707 40-Inch 60Hz LED-Lit TV (Black)", "Author": "jazzielife", "ReviewID": "RV1C2598AH2LE", "Overall": "4.0", "Content": "The only thing that makes this fall short of five stars is the sound (which is a common complaint of many flat panel HDTV's). It's not nearly as terrible as other HDTV's but at certain settings it is very muddled. I find that vivid and sports volume output are the best options. The picture quality is fantastic providing crisp details and vibrant colors with true 1080 display.  The connection options are equally good. The set up was quick and painless through my HD/DVR box via HDMI cable connection. I purchased this when it was sold and filled by Amazon for less than $350, and I wouldn't pay much more than that for a 40\". I highly recommend if you are looking for a set for medium size room (500 sq ft - 700 sq ft).Update January 2014: One year later and I haven't had any issues with this TV. I added a front surround system (sound bar) in the last month - all set!", "Date": "December 18, 2012"}, {"Title": "Do not buy if you are planning on using a computer with it", "Author": "Billy Maloney", "ReviewID": "R2O0N5M8PQ0BPI", "Overall": "2.0", "Content": "The sound and picture are great.  I have had no problems connecting my Xbox and cable to the TV.  However, when I try to connect my Macbook via HDMI, everything goes wrong (I have never had this problem on any other tv).  After playing around for about 2 days, I managed to finally get picture on the screen. Great.  However, this TV does not support audio through HDMI.  I have never had this problem before with any other TV I have ever used even though HDMI supports sound.", "Date": "August 16, 2013"}, {"Title": "Pretty good tv", "Author": "Amanda Welton \"mommy in MD\"", "ReviewID": "R3ADMJYLDY5LY7", "Overall": "4.0", "Content": "since we don't have HD anything, we don't get to enjoy the amazing picture I'm sure this TV is capable of but still a good TV. I like the design.  Sound isn't very good.", "Date": "January 4, 2013"}, {"Title": "Nice picture quality and very stylish", "Author": "Ilya", "ReviewID": "R1C616K3IARV5X", "Overall": "5.0", "Content": "I like the Unit, no complainsI think that the TV is very nice and you would not be disappointed!", "Date": "November 24, 2012"}, {"Title": "Excellent tv", "Author": "Purple People Eater", "ReviewID": "R34UWMQ2FDCA1B", "Overall": "5.0", "Content": "Nice nice nice nice nice nice nice nice nice nice nice nice nice nice nice nice pretty nice t v! It is really col also", "Date": "December 3, 2012"}, {"Title": "Stay away from the above mentioned TV", "Author": "Patrick", "ReviewID": "RZP3D13D8N8BP", "Overall": "2.0", "Content": "The above mentioned TV did not meet my expectation. The product had a zigging sound.Stay away from the above mentioned product", "Date": "February 20, 2013"}], "ProductInfo": {"Price": "$569.99", "Features": "Pixel Plus HD\n3 HDMI\nDLNA", "Name": "Philips 40PFL4707 40-Inch 60Hz LED-Lit TV (Black) (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/51-aLFpwGCL._SX300_.jpg", "ProductID": "B007G94EIC"}}