{"Reviews": [{"Title": "Great 40\", Great price!", "Author": "William P. Clark", "ReviewID": "R2R905R3V2587P", "Overall": "4.0", "Content": "This is a great TV, especially for the price. My main TV is a nice 42\" LG and this one is not quite on par with the LG, but still a darn good TV.Pros:  Price, picture, sound.Cons:  Cheap remote, slow channel change.Note: Like other reviews here you'll find that out of the box this TV is dark. If you try to increase the Backlight you'll find that nothing happens. That's because the Backlight settings are turned off by Energy Saver.Go into Setup and turn Energy Saver OFF and now you can adjust your Backlight and get a nice looking picture.Replace the cheap remote with a better one and you're all set. (The remote really is horrible)", "Date": "May 1, 2012"}, {"Title": "Mostly good", "Author": "J. Warren \"NiALTA\"", "ReviewID": "R2C8G4GC1E5K7F", "Overall": "3.0", "Content": "This flat screen is very bright. The colors are clear with good even saturation. No dead pixels. Very easy to set up. The stand is sturdy and even though the flatpanel is rather light it feels very solid.Sadly I had to deduct two stars for four reasons.1. It's VGA PC input is incapable of 1920x1080 at 60Hz. If an $87.oo 21\" LCD Acer screen can take full HD through VGA then so should a $400.oo LCD screen.>>>>>>Turns out that TOSHIBA has intentionally crippled Full-HD through the PC/VGA input.The RGB Component input can take Full HD though.Crazy huh? Why would TOSHIBA do this? It's quite annoying to lose an essential input. The VGA input can only properly display 4:3 resoltions.2. The only analog (RCA) sound output option is a bit noisy, (lots of hiss). Hooking up to non-optical equipped receivers is a waste of time.3. Remote control has poor responsiveness, often needing repeated button pushing and hard mashing to work.4. PC hook up though HDMI was more succesful, but took a lot of patience and repeated efforts for only marginal success. (read instructions closely)>>>Update July 18th 2012.Screen began taking longer and longer to reach full brightness. Something appears to be wrong with the CFL backlighting system. This recent problem coupled with the lack of a usable VGA PC input has led with me no recourse other than to send it back.This model is one the best selling on the web, and for most people it's a good product. I just got a bad one.If you don't need a VGA input or a clean analog audio output then this screen's positives outweigh its negatives.", "Date": "July 3, 2012"}, {"Title": "Great Bargain TV", "Author": "Tim", "ReviewID": "R1MJGQAF0PR7ML", "Overall": "5.0", "Content": "First realize that the dimensions where entered in error. This TV is not 1.8\" but actually 3.9\" without the stand. That is what you would expect for a TV this size anyways. This TV, unlike most TV does have a auto dimmer to help save energy and the life of the screen. I find it to operate a little cheaply, and enjoy the picture much more with the auto-dimming off. As a reference, I own a high-end HDTV as well and that one I left the auto-dimming on as it performs wonderfully. The picture on this TV meets my expectations for a cheap TV, the blacks and whites are decent and the 60Hz performs nicely. I do like that they actually put some effort into this unit with the ability to produce clear sound with what they call Audyssey Premium Television. I haven't noticed that the sound is better than average, but more importantly I haven't noticed the sound is bad. A 40\" at $400 is a great buy and hard to beat.", "Date": "April 25, 2012"}, {"Title": "Exactly what I wanted", "Author": "kryptor", "ReviewID": "RSGYAKC6183CM", "Overall": "5.0", "Content": "I don't know what people are complaining about the sound for. Granted, I live in a small apartment with thinwalls. The volume has never been above ten and I have had a neighbor ask me if I got a new sound system formy new TV because she could hear it very clearly. I usually keep it around 5-6. I think it goes passed 30.I've never needed to test max volume.The picture quality is exactly what I was expecting in a HDTV of this price/class. I must admit that whenthe lights are out the TV auto-dims and the picture suffers. I'm going to mess w/the energy setting and seehow that affects things.I did not purchase this TV from Amazon. I bought it at a local Fred Meyer. It was on sale for $399 and Iused some of my Fred Meyer Rewards coupons that I redeemed and walked out having only paid $277.67 !!!I feel that even at $400ish, it's still worth the money. I am very happy.My only complaint is that it doesn't have enough HDMI ports for me but I knew that when I bought it.I have my cable and bluray on the two HDMIs and unfortunately my 'puter on the PC in port (VGA) forvideo and using the PC/HDMI audio in port for the audio. Which is fine, it's just more cables ...more clutter. And also the remote looks very cheap but the numbers are big and clearly markedand .. lets face it .. it's working perfectly. My last TV was a Toshiba and, it's funny, this remotehas the EXACT same layout as my last, albeit it has a few extra buttons for picture selection etc.", "Date": "May 14, 2012"}, {"Title": "Great bedroom TV!", "Author": "ALH \"bisou bisou\"", "ReviewID": "R1ICTF8MVZZSKN", "Overall": "5.0", "Content": "I have this as my bedroom TV and am very happy with it. I have owned Toshiba TV's in the past. I owned two Toshiba rear projections TV's and then went to the LCD flat screens. I bought this TV at a local brick and mortar store that wears blue shirts and has yellow signage. It was easy to bring home and hook right up.For the bedroom it is perfect! I have it sitting on a desk which is perfect height wise for the bed. The sound is not great but I hooked it up to a VIZIO VSB200 Universal HD Sound Bar when I watch TV. It sounds wonderful! I managed to put the sound bar behind the TV stand since it sits out a little far. I also am using it as a monitor to a PC I have in the bedroom that I rarely use. However, having the VGA input is perfect; the picture is nice even though it is only 4:3 aspect ratio for the PC. I also have a Roku hooked up to it via a HDMI cable and it looks and sounds great!When I crawl into bed tired, I love watching TV on my Toshiba. With tax I spent more than what it is listed here but am very happy with it. I don't watch much sports or action movies so the 60Hz is fine for me.I don't know if I would have this as a main TV but as a bedroom TV, it is perfect! I am very satisfied with it and glad I purchased it.", "Date": "May 24, 2012"}, {"Title": "Great Picture for the price", "Author": "M. Scott \"Ultima Buyer\"", "ReviewID": "R2SOX0QN4XBYZ4", "Overall": "5.0", "Content": "I bought this TV for a rental property but ended up using it myself due to a power surge knocking out our plasma. Currently watching Euro 2012 on it and can't believe how good the picture is. Do the Energy Saving trick as advised and the picture is brighter. Remote control is rubbish but not an issue if you have a cable remote. Only thing the TV lacks is IP capability but you can always buy an xbox, media player etc if you want to watch Netflix etc. All in all I don't think there is another 1080p HDTV out there that can rival this one. Denmark 0 - Portugal 2. I might buy another one now :).", "Date": "June 13, 2012"}, {"Title": "DO NOT BUY, TOSHIBA DOES NOT STAND BEHIND THEIR POOR PRODUCTS AND HAS THE WORST CUSTOMER SERVICE", "Author": "Michele", "ReviewID": "R1QG3E27I9KFP9", "Overall": "1.0", "Content": "I purchased my Toshiba tv on January 2, 2012 and it stopped working on July 13, 2012. I called customer service because my tv would not turn on, the power indicator would come on then go off within 30 sec but there was no picture or sound. Customer service told me that they would create a work order and I would get an email from Nexicore. They automatically ordered a motherboard without even seeing my tv. Once my part was in the service provider would contact me within 24hrs to sch and it took 3 days to sch an appt w/ (Nick) he then told me he had to come to my house before 4pm because he lived on the other side of town and wanted to miss traffic. He replaced the motherboard and 2hrs later the tv is not working. I was then told they had to order the part again another 3-5 days and then resch a service visit. I told them at this time I did not want the same employee to come to my house and this was ignored. I was told that there are 3 parts to a flat screen tv the motherboard, power panel and the screen. So this time they order both the motherboard and the power panel to guess which part is bad. The same service employee came back out (nick) replaced the parts and the tv worked for 2 weeks. Then the tv not only wouldn't power on correctly but would emit a screeching sound. I then called Toshiba and told them that I do not want to deal with Nexicore any longer and they gave me a list of 3 authorized service providers. I brought my t.v. to HI Definition Electronics and they had no cooperation from Toshiba w/ ordering parts and were told that they were not an authorized service provider after Toshiba was the one to give me their contact. I had to call the customer relations manager myself and be placed on hold while he was on the phone w/ HI definition. Finally both companies decided to order the motherboard for a 3x and Hi definition replaced the part and informed me that the same malfunction is occurring. Finally my complaint was escalated to Mikalla but all Toshiba states that they can do is order another part and keep trying to fix the tv. I have been told by a customer relations manager that this is how electronics work and they will just keep replacing parts until they get it. Then Mikkalla told me I have not been through enough to get a replacement and that all they can do is order another part. I asked what else and how much longer until they actually will make this right and she stated that is not something that they inform the consumer of. Also I was informed that I did not read my warranty information and have not went through the proper steps to get the tv repaired which, I would think that they would of notified me of this the first time I called 3 months ago. It clearly states on my Toshiba warranty \"if your are experiencing a technical problem or have questions regarding operation, Authorized service providers, warranty or parts, please contact customer service department at: 1800-631-3811\"  Mikkalla also stated that I own this tv and it is my responsibility to get it fixed not Toshiba's.  DO NOT PURCHASE ANY PRODUCT FROM TOSHIBA!! TOSHIBA DOES NOT TAKE ANY RESPONSIBILITY FOR THEIR POOR PRODUCTS AND DOES NOT CARE AT ALL ABOUT THEIR CONSUMERS.", "Date": "September 17, 2012"}, {"Title": "Love this TV", "Author": "Kenneth In Dallas", "ReviewID": "R18I7PIWJOHRCM", "Overall": "4.0", "Content": "I bought this TV at Newegg.com on June 24th and received it June 27th. After hooking this baby up and adjusting the power feature to the off position(the picture sucks with it on)I used the composite jack on it to run my DVD and satellite till Directv upgraded my box (about a week later) and I have to say I was pretty impressed with the picture. It's wasn't as clear as my CRT TV, but it was better than I expected. After the upgrade to the HD box with the HDMI cable I was just blown away! This TV makes watching shows like True Blood so much better. I had no idea what I was missing in the picture! My only complaint seems to be with the sound. Now I have my TV hooked up to a sound system so this is kind of a non-issue for me, but for those without it could be a problem. The sound coming from the TV is incredibly low, even turned up to 50. I have yet to figure out a way to make that better, but I will keep trying. It's only bad enough for me to knock off one star. People complain about the remote a lot on these reviews, but tell you the truth I don't use mine much. I use maybe 3 or 4 buttons on it and the rest I use Directv remote. For the price this TV is a great TV, especially for someone entering into the flat screen TV market. I paid a total of $384.99 with free shipping.", "Date": "July 11, 2012"}, {"Title": "Good Television, Great value for Money - Failed in 1 month", "Author": "Aaman Lamba \"Books, Art and Life\"", "ReviewID": "R34F4ZWWJU223Z", "Overall": "1.0", "Content": "Update to Edit: Amazon showed their awesome customer service chops by replacing the television at no cost. I'm loving the TV, and if only it had not failed the first time round, I'd recommend it handily.Edit: I have had a negative/bad experience with this Toshiba television. Barely a month after buying it, it stopped displaying an image. The tech came out, replaced the board, but this still did not fix the issue. He gauged this to be a manufacturing defect with some wire within the frame. I'm still doing the run-around for a replacement on my now dead TV.Original review:We needed a second television for the bedroom and after much research, opted for the Toshiba 40E220U 40-Inch 1080p 60Hz LCD HDTV. The motivating factors behind our choice were* Great price - the closest comparable name-brand 40\" television was at least $40 higher* Good references* Visual verification of picture quality at SearsThe television arrived and has been wall-mounted. The picture quality is superb. It is very responsive. Darks are crisp and fast motion is captured with very little lag. We've opted to plug in a Roku 2 XS box instead of a full-fledged DVR and there's more than enough content to make it a good choice. The only other one we might have gone for would have been the Panasonic Viera IPS.A brief note on the higher end options like LED backlights and 120HZ displays - While both afford steps up in picture quality, remember that LED backlit televisions are still LCD television. Secondly, movies and broadcast television looks really bad with high background noise and plasticky in 120HZ/240HZ displays so don't expect a 'richer HD' experience.", "Date": "June 5, 2012"}, {"Title": "Toshiba Screen was defective need to return after only 2 hours post delivery", "Author": "kmason", "ReviewID": "R113JOUG55JFAD", "Overall": "1.0", "Content": "Bought TV and was excited initially based on the deal I got.  However, my excitement turned to frustration when I took delivery of an undamaged box but yet a TV that won't show a picture.  The LCD and/or firmware is completely broke.  This product seems to lack the quality needed to really be  a good player in the market.  In process of returning it and will have to wait several days to a week plus to get replacement.  Dissappointed!", "Date": "November 26, 2012"}, {"Title": "Toshiba 40E220U", "Author": "Greg", "ReviewID": "RSSEBKRJY44EG", "Overall": "4.0", "Content": "I bought mine at a retail store this weekend for my bedroom.In demo mode, the HDTV produced rich colors and impressive darks, but then again don't all TV's in retails stores look this good?Setup was rather easy as Comcast 480i (4:3) signal was identified and HDTV was up and running in minutes.  I also changed the screen output to TheaterWide-1 since I'm not getting HD Cable in my bedroom.After tinkering with the settings, I couldn't get the picture to look acceptable because the screen looked grayed out and too dark.  I was about to pack it up and return it but opted to tinker with it one more time.To remedy the darkness of the screen and brighten it up 75% higher, goto MENU > PREFERENCES > Scroll down to ENERGY SAVING SETTINGS (you won't see it on the screen because its listed underneath Regza Link Player Control and Channel Browser Setup.  Keep scolling down, then Turn off Energy Saving Setting.If you stand up close to the screen, you can see minor defects of distortion but it disappears after you back away a few feet.  For the price of the TV, this is a good bargain.", "Date": "June 10, 2012"}, {"Title": "value", "Author": "bacon", "ReviewID": "R1XUNU9SSUUO4L", "Overall": "5.0", "Content": "This is my second Toshiba TV i had the 32 inche for about a year, I had bought it for 300 and was super happy with it, when I wanted to upgrade i was able to sell the 32 inche for the same 300 i bought it for and pick this bad boy up for 399! the value is great, Toshibas product is easy to operate, not overly packed with odd features that I would not use( i am a simple man, no real need for ultra fancy this or that). Point is price is good, speakers fill the room, watch over running the bass, or buy some add on speakers for cheap, picture is great, there is a dimming feature, but i like that it could save the picture/screen, and overall i am very happy with it and will buy another Toshiba in the future.", "Date": "July 7, 2012"}, {"Title": "toshiba 40e210u do not buy this", "Author": "D. K. Numinen \"Plumbing HVAC\"", "ReviewID": "R29QN2UBCWMW2V", "Overall": "1.0", "Content": "after owning this Toshiba 40e210 U for three months it died, after talking with toshiba repair they diagnosed it over the phone, two weeks later Nexicor called to say they were scheduling service call, two days later service man called to say they only sent one of two needed parts, another week he called and installed the two parts, nope nothing nada, Another week goes buy and another part comes in, a few days later installs this one, nope nothing nada. another week goes buy and more parts third try is the charm, nope nothing nada. Calling Toshiba case worker every time in between, promised a replacement if cant fix, three time cant fix. Now they want physical receipt and will determine what they will do, Over a month no TV. customer service condescending and un-truthful. Still awaiting their determination, Repair man says its a Toshiba I do hundreds of these a year.", "Date": "June 7, 2012"}, {"Title": "Pleasantly Surprised", "Author": "Bazzle", "ReviewID": "R8LZEKXY97423", "Overall": "5.0", "Content": "I bought this product after a great deal of research on HDTV's. I decided to buya Toshiba, because I bought an old style non-HDTV Toshiba in 2005 and it isstill working perfectly. I have never had it repaired.This TV was easy to set-up. It took me less than 30 minutes. It was easy to makeany adjustments needed and then sit back and enjoy. The sound is very good. Thepicture is clear and sharp. It was a great buy at a price under $400. I recommendthis HDTV highly.I hope this television will give me good service like the old Toshiba I still own.", "Date": "July 19, 2012"}, {"Title": "Great TV in this price range", "Author": "Cari E.", "ReviewID": "R2S9B2TWJACNLJ", "Overall": "5.0", "Content": "We searched a long time before settling on this TV for our office. We live in an apartment and the room isn't huge, and felt 40\" was a comfortable size. The picture is what you'd expect for this kind of TV, very nice. As long as you're not expecting a $1500 TV, you won't be disappointed. My boyfriend did spend some time making adjustments out of the box, it seemed to be on some kind of eco mode. So make sure you mess around with the options before deciding you're not happy with the picture. No complaints about the sound either, works great out of the box. We had planned on hooking up a sound bar, but it's really not necessary.Only con is that like another reviewer stated, the remote is simply horrible. It's cheap and feels like it's going to fall apart. You also have to be at just the perfect angle from the TV to get it to work, I find myself having to stand up and walk over to the other side of the room to do anything remote-related.We're mainly using it to watch movies(and I watch Netflix during the day while I work on our Xbox 360). We've also done some light gaming on it. For what we use it for, it's great. I feel the picture is just as nice as the bigger Samsung we have in our living room, at a way better price.", "Date": "May 17, 2012"}, {"Title": "Great tv", "Author": "Josh", "ReviewID": "R31ZYI3XKDG4LO", "Overall": "5.0", "Content": "Really great tv. Bought it on black friday in 2012 and I have loved it ever since. Worth a purchase.", "Date": "September 19, 2013"}, {"Title": "Very dim TV", "Author": "Airplane", "ReviewID": "R3S9B7VT7IC50M", "Overall": "2.0", "Content": "When I bought this TV I was expecting same HD quality as other Toshiba TV that I bought. While it was indeed high definition, the picture quality was very sub-par, almost to the point that my eyes get sore after watching the screen for a while. The problem with this TV is that it is very dim. After doing some research, I found out that this was due to the \"Energy Saving Setting\". If you are suffering from the same problem, I think a good way to remedy is either return this TV or remove \"Energy Saving Setting\" via following method:MENU > PREFERENCES > Scroll down to ENERGY SAVING SETTINGS (you won't see it on the screen because its listed underneath Regza Link Player Control and Channel Browser Setup. Keep scolling down, then Turn off Energy Saving Setting.<Much Thanks to another reviewer who posted this remedy!>", "Date": "July 8, 2013"}, {"Title": "Love this TV", "Author": "alby13", "ReviewID": "R3UZYHXO6Q4UPY", "Overall": "4.0", "Content": "I love this TV, you get a lot of TV for the money.I won't repeat what others have said, and instead I will offer a tip and my thoughtsFirst of all I just updated the firmware that is on Toshiba's website. This fixed the controller lag, sluggish response, and having to push buttons twice or more to register. The menus are faster as well. Gaming mode still has to be enabled each time the TV is turned on which I dislike.I have been using the gaming mode and I don't really notice a big difference, in contrast to a Samsung that my friend owned that transforms the reaction time and filtering that can make FPS gameplay unplayable.I noticed that the backlight floods the top corners a little when the screen is black and the backlight is turned to max. Minor issue but a little distracting.I love the picture quality, colors, brightness, blacks, and the dynamic backlight auto adjustment and energy saving brightness auto adjustment. Wow, the picture is just awesome and lifelike. My favorite thing.I have to say the sound is above average. Convincing surround, and the sound shines once bump up bass and treble.", "Date": "April 20, 2013"}, {"Title": "Ugh", "Author": "Chris O'Leary", "ReviewID": "R18IQC0P4PXAFE", "Overall": "2.0", "Content": "No matter what I try, I can't brighten up the picture sufficiently or get the color balance right. The sound is also thin and tinny.We only paid $200 for it, but it's debatable whether it's worth that.P.S. The tip below about brightening up the picture worked, but the fact that you have to know a trick to make the TV usable says a lot about it, and is why I'm not upping my grade of this product. And the color balance is still terrible.", "Date": "April 12, 2013"}, {"Title": "TV turns off and in on its own! Volume raises on its own !", "Author": "Jennifer Clarke", "ReviewID": "R2RBWTZ586XOYR", "Overall": "1.0", "Content": "I have the second or replacement Toshiba TV in my home now. While watching this TV, the picture freezes, slowly screen darkens, power goes off and then turns back on. Very slow on start up.The original TV had the same issues with an additional one, its volume would turn randomly.* both televisions have very dark pictures, even with tweaking. Very tinny sound. Lots of pops and hiss through the speakers.Waiting now to hear if the retailer will return this TV or if I'm stuff with a lemon..", "Date": "March 18, 2013"}, {"Title": "Toshiba 40 LCD", "Author": "cozywozy \"cozywozy\"", "ReviewID": "R1JC7RPFUH04F3", "Overall": "1.0", "Content": "Lousy product.  Owned it 5 months & have called 6 times.  At first TV would turn itself off intermittently & I was told this was a \"safety\" feature.  I have had to call twice now in regards the screen freezing/stuttering and the audio stuttering for several seconds then TV turns itself off, then back on.  I called again and was told I would need a repairman to come see if & if I would hang on a minute they would find me a repair place close to my postal code.  Turns out I waited 5 minutes and they came back on line with a number.  I called the number and the guy told me he was in India and asked me if Cinninati Ohio was close.  I asked if they charged mileage as I live in western Canada not the eastern United States.  This TV takes a full 20 seconds to come on and when I asked about that was told that it how it is with all LCD TV's.  I said it was not as I also have a 40\" LCD TV from LG and it has instant on but was told I must be mistaken.  When TV does come on, when it doesn't stutter and shut itself off, etc etc,  it is an okay TV.  Would I recommend it?  NO  Would I buy another Toshiba TV?  NO", "Date": "February 14, 2013"}, {"Title": "POOR QUALITY", "Author": "Lisa Kimmell", "ReviewID": "R2F9462IBX2XEZ", "Overall": "1.0", "Content": "picture is very dull...no brightness...would not buy theToshiba brand again.  I tried adjusting the settings and no help on the brightness", "Date": "January 18, 2013"}, {"Title": "Worst TV I've ever had", "Author": "Gustavo Figueroa", "ReviewID": "R2AE8AAVO3HMFK", "Overall": "1.0", "Content": "If I could give this product less than 1 star I would. In a little over a month the picture became extremely blurry, and Toshiba's customer service was not any help. I had to be on the phone with them for hours after their service reps kept hanging up on me - up to 3 different times in a day. After I finally was able to go through the whole process of filing a claim the rep told me they had a new system and was having trouble putting the order through and I would have to call back again.When I was finally able to schedule a technician come try and repair the TV it took 4 different trips to my house to change every single possible part and nothing fixed it. Each time he would come I would have to take time off work to be home. After a month of changing part after part they finally agreed to replace the TV, and told me to ship mine to them, and when they saw in their system it was on its way they'd send me the replacement.Cut to almost a month later with no TV, and I finally get the replacement - only that it came with no stand. I called Toshiba, and they tell me the person in charge of that is not in and they can't do anything for me. I am at my wit's end and there's nothing I can do but take it because I made the mistake of buying this nightmare of a product. I would suggest to avoid this TV, as the only thing worse than the product quality is the customer service of this company.", "Date": "January 3, 2013"}, {"Title": "No Picture", "Author": "Mathew Chaplin", "ReviewID": "R2YOWCF08LFUOQ", "Overall": "1.0", "Content": "Everything worked right out of the box EXCEPT for the picture.  The \"Toshiba\" symbol flashed across the screen and then never saw a picture.  Had sound but no picture.  Sounds like the same problem as the other negative reviews.  In the process of returning it and dropping a few extra bucks for a Samsung.", "Date": "December 12, 2012"}, {"Title": "Great TV for the price", "Author": "Boston Tea", "ReviewID": "ROEYZY8O5R6X6", "Overall": "5.0", "Content": "Caught this Toshiba TV on sale for $179.  When I first got the TV set up, the picture was too dim. No matter what I did, it just wasn't bright enough. Disappointed at first, but I tried one more thing. I noticed that when I first set up the television, it gave the option to set TV in a retail or home setting.  So I reset everything to \"factory default\" and started over with the setup.  I chose \"retail\" mode this time and this solved the dimness problem.  Now the screen picture is bright, brilliant, and crisp.  Has very good sound...was very impressed!Pros:  Picture (in \"retail\" mode), sound, aesthetics.Cons:  Remote is on the cheap side, but most of them are. I'll just get a nice universal remote later.  Nothing to whine about. Picture in \"home\" mode is too dim.", "Date": "November 27, 2012"}, {"Title": "Solid, especially for the price", "Author": "Hammerklavier", "ReviewID": "R36950NZ9UW8N7", "Overall": "4.0", "Content": "Pros: Quality picture, decent sound, excellent price point, reliability of brandCons: Start up time (~30 seconds), cheap remote, only 2 HDMI ports, NO composite portsIMO, the Pros clearly outweigh the Cons.  This TV is right at the sweet spot of size, price, and reliability.  It is possible to get a 40 inch TV at a cheaper price, but it will be from a far less reliable brand.  If you are looking for an affordable, quality 40+ inch TV, this is a great choice.  I am very happy with this purchase.UPDATE------For some reason, I didn't realize that this had ZERO composite (red/white/yellow) ports.  That really kinda sucks, as I am unable to plug in things like my older video game systems.  Not a deal breaker, but this is definitely tuned towards people who will plug in a cable box and a bluray player and call it a day. Oh well.", "Date": "November 15, 2012"}, {"Title": "Great TV, great price...abysmal remote though!", "Author": "Jimmy Mac", "ReviewID": "R1XMJK6G12QIQJ", "Overall": "4.0", "Content": "TV is great, plenty of options, inputs etc. Picture is excellent - I happen to use this TV wall-mounted in a basement gym at home, so the lighting is favorable. Remote control is a joke...it stopped working on day 1...I switch it on/off manually, and the cable remote does everything else.", "Date": "September 18, 2012"}, {"Title": "You get what you pay for. Good Value", "Author": "Anthony Brea \"OhBoy88\"", "ReviewID": "R28EMSWYP77VVO", "Overall": "4.0", "Content": "Cheap stand/base. Good sound quality. Solid picture quality for the $$. Only 2 HDMI inputs. Good for a bedroom tv.", "Date": "September 16, 2012"}, {"Title": "Good economy HDTV", "Author": "JMC", "ReviewID": "RX4X8SN45GHPL", "Overall": "4.0", "Content": "Pros: Image is good. No dead pixels. All connections work. Low power consumption.Cons: Slow power on. Doesn't remember closed caption settings or picture size setting as you change channels (I'm not using a cable box and have external speakers so I keep it on mute)Overall I would recommend this if you are on a budget or if this is your first HDTV.", "Date": "September 14, 2012"}, {"Title": "Great TV. Great Price.", "Author": "LastWingerAlive", "ReviewID": "R1YZNC6H3RMVGK", "Overall": "5.0", "Content": "After some initial adjustments, the picture on this tv is OUTSTANDING! Other reviewers call this tv cheap, what it really is is limited. No 3D, no internet apps, no LED. But if those things aren't what you want, but a great picture is, then this tv is for you.I watch mostly sports and movies and the picture is smooth at 60hz, especially in game mode. I play a lot of xbox 360 games, which can take advantage of 1080p. The games look fantastic and run fast with no distortion.Here is the deal with the sound. Yes, you can hear it, even on low volume, but the quality is poor. It seems like the sounds are being emitted out of a tin can. Keep this in mind because the bargain price isn't a bargain if you have to purchase additional speakers, soundbar etc.The remote is functional, not cheap, but not programmable. I use my cable remote.This tv is extremely easy to get on the stand, unlike my plasma. At over 30 lbs it feels very light.The manual needs to be downloaded from toshiba as it only comes with a basic instruction booklet covering the remote and initial setup.For $379.99 total cost (As of 8/22/2012), you can't beat it.", "Date": "September 9, 2012"}, {"Title": "You get what you pay for", "Author": "brian122", "ReviewID": "R4JMJ9168IZ5F", "Overall": "2.0", "Content": "Purchased another lower end 40 inch Toshiba three years ago and it was excellent, so I recently bought this one for my daughter.  In order to keep the price very low, Toshiba has apparently reduced the quality.  The blacks are very grey; the \"vibrant\" colors are somewhat dull; overall brightness does not come close to our other hdtv's; and it lacks the crisp focus you expect.  It is what I expect of an off brand, not of Toshiba.", "Date": "August 10, 2012"}, {"Title": "completely satisfied", "Author": "GRANDPAIRV", "ReviewID": "R26K8Q7RFVU1IN", "Overall": "5.0", "Content": "I READ THE NEGATIVE REVIEWS ON THIS TELEVISION. I PURCHASED IT ANY WAY. I DON'T KNOW WHAT THOSE FOLKS WERE THINKING WHEN THEY COMPLAINED ABOUT THE SOUND AND THE DARK PICTURE. I AM VERY PLEASED WITH MY PURCHASE.THE SOUND IS GREAT. THE PICTURE QUALITY IS THE BEST I HAVE SEEN. IF THE BUYER GOES THROUGH THE SETUP PROCEDURES PROPERLY, THEY WILL ENJOY THEIR TV AS I DO. I HIGHLY RECOMMEND THE TOSHIBA 40E220U 40\" LCD TO ANYONE WANTING TO ENJOY TELEVISION AT ITS FINEST.", "Date": "June 5, 2012"}, {"Title": "Rough Start, but Getting Better", "Author": "Steve K. \"Music Junkie and a Dad\"", "ReviewID": "R1KI6NMY176VTZ", "Overall": "3.0", "Content": "This may turn out to be a very good TV eventually when I upgrade to High-Def programming, but it took me the better part of two days to make it watchable with standard def Dish Network satellite service and standard def DVD still looks horrible. I'll try to update this review later when I've had a chance to upgrade to high-def satellite programming. Meanwhile, here are some tips to try and save extra hassle for other new owners. Initial problems were made a lot worse by Toshiba's failure to include a decent set of instructions in the box. If I'd bought this at a local store instead of online, there's a good chance I would have given up and taken it back. If you don't already have a blu-ray DVD player with upsampling or high-def TV programming, you may want to consider making those upgrades first before you buy this TV so you'll know how good it really is while you still have time to return it. The best thing about this TV so far is I was able to get it for the same price online as discount brands at my local Wal-Mart and Best Buy. The first thing any new owner should do is download a copy of the full owner's manual from Toshiba's web site and keep it open on a laptop in the same room if possible. Don't turn the TV on until after you have plugged in all your input devices (cable/satellite box, DVR, DVD player, etc.) and have them all turned on so the TV set can detect all of the input signals you will be using; this is most important if you use a standard def coax Ant/Cable, or a standard def cable/satellite box. After the initial setup, the first thing you'll want to look for is the \"Energy Saver Setting\" for automatic brightness control to see if it makes your picture too dark and if turning this off helps make it bright enough for you. You can turn this back on later if you like to keep news or other programming on in the background all day and want to save some electricity. For any inputs with standard def devices, you'll want to look for Noise Reduction settings and the CableClear option. Turning the noise reduction settings up to high is what made my standard def satellite box (Dish Network DVR 625)go from unwatchable to pretty good, but I had to spend some time browsing and searching through the full owner's manual I downloaded to find out about this. I also wound up having to reset the TV a couple times because nothing was connected the first time I hit the power button and the CableClear option wasn't available on picture settings menu. The CableClear option showed up after doing a reset with everything plugged in and turned on.", "Date": "May 28, 2012"}, {"Title": "I got a lemon", "Author": "Linda M. Johnson \"LinnyLouWo\"", "ReviewID": "R2TUA2BOPX188R", "Overall": "1.0", "Content": "I bought this TV despite the not so stellar reviews, hoping that the bargain TV would live up to the raves of the positive reviews I had read.  Unfortunately, after I unboxed the TV, set it up, and turned it on, all that happened  was the brand name \"Toshiba\" flashed across the screen, and then.... nothing.  The screen was black.  There was no sound.  After I spent 2 hours troubleshooting the connections and speaking with the Toshiba customer support rep, the conclusion was reached that I got a lemon! So I removed the stand, repackaged the heavy 40\" TV, contacted Amazon, and sent the TV back.  Two weeks later the TV was back in Amazon's warehouse, my refund was processed, and my credit card credited.  Now I'm back to shopping for a new TV, and this time, it will not be a Toshiba.", "Date": "September 19, 2012"}, {"Title": "volume control and non-control", "Author": "mackthecop \"civil service retiree\"", "ReviewID": "RP4WTP8D7GFNV", "Overall": "1.0", "Content": "TV was purchased 07012012There is no volume control when tv is initially turned on. It originally took @3 minutes to get the volume on the remote to function but time interval has been increasing. During those sections of a television program when TV volume is intentionally raised to get around the requirements re; volume of commercials the volume on this model bounces off the walls and ceiling and it is a scramble to lower it The volume on the remote control used with cable vision works properly on another television but replicates the same defects as the television's remote", "Date": "September 2, 2012"}, {"Title": "Couldn't Be Better", "Author": "DocLRB", "ReviewID": "R20Q7LPTS5QTV2", "Overall": "5.0", "Content": "The image quality is super; sharp, clear, vivid. The number and types of connectors are adequate (I am not da**ing with faint praise). The price point was phenomenal. Compatible with numerous  wall mounts. The table stand is wide and sturdy. Order yours before they're out-of-stock!", "Date": "May 16, 2012"}, {"Title": "Gold Medal Winner", "Author": "S. P. Ristvedt \"Freethinker\"", "ReviewID": "R29GZWZSTKN5HL", "Overall": "5.0", "Content": "With the 2012 Olympics coming up I decided to purchase a new TV.Originally I purchased a $1000 LG 47-inch 3D 1080P 120Hz model which clearly showed major artifacts, such as a weird pixelation that seemed to surround people and objects when moving. I was shocked at the poor overall quality of the picture, the most important aspect for me.So that LG 3D model (47LM6700) didn't even make it out of the trials stage.Amazon's exceptional return policy allowed me to return the LG model at no cost to me and I was refunded the full amount back within 5 days of UPS taking it away. Bravo Amazon.So I found this $400 Toshiba 40-inch 1080p 60Hz model and wow, I'm so very happy with it! The picture quality is simply superb. When viewing 1080P footage via ROKU from either Netflix or Amazon Prime I'm amazed by the high quality that's being streamed, not exactly Blu-Ray quality but excellent nevertheless. That said, when viewing Blu-Ray, DVDs, even 1080i, the colors are deep, there's no botchiness (another artifact of that LG model when viewing a dark screen) and the whole picture has an exceptionally high level of clarity.This Toshiba doesn't have 3D but I'm not sure 3D models are quite up to par yet. They may do 3D well enough but if non-3D viewing is effected due to the technology necessary to do both, well that's no good. In any regard the few films and few times I found myself utilizing 3D with that LG model just didn't warrant a $600 increase. Don't know for sure why the LG had such poor picture quality while viewing regular programming, but I do know a bad image when I see it.This is a no-frills TV -- except for the picture quality -- and at $400 or less it's golden.", "Date": "August 9, 2012"}, {"Title": "Toshiba 40\"", "Author": "yodan2", "ReviewID": "R1RZI9NUOT6SXZ", "Overall": "4.0", "Content": "The stand was easy to attach, setting up was a piece of cake, and the picture quality is outstanding with a better then expected contrast ratio.  The remote control takes time to get used to, still trying to figure it out, as there is no user manual for this unit.  Not the best TV but a very good buy for the money.", "Date": "July 22, 2012"}, {"Title": "You need HDMI", "Author": "Michael C.", "ReviewID": "R2ZS41YWPV52C1", "Overall": "5.0", "Content": "For the TV to really pop and be worth the price you need HD cable, gaming, or movies. Its super great for the price. I have owned it for a year now and totally love it.", "Date": "December 27, 2013"}, {"Title": "Fine TV", "Author": "Jaderkinss", "ReviewID": "R1GT1KW8HR72I5", "Overall": "4.0", "Content": "Had this for over a year, no problems yet.The corners are starting to fade a little but I believe it's because this TV Is used more than averageI connect it to my computer and my xbox 360 for games and moviesWish the USB could play videos off a flash drive too, but it only does pictures for slideshows and stuffAll in all a good Tv", "Date": "December 18, 2013"}, {"Title": "toshiba 40\" lcd tv", "Author": "A. Smith", "ReviewID": "R3HWXUNFF475I0", "Overall": "5.0", "Content": "I own a couple Toshiba tv's and laptops.  All reliable and run flawlessly.  This was no exception.  Great picture right out of the box.  Thew only thing someone might want is more HDMI inputs but for my setup I only need 2.", "Date": "September 4, 2013"}, {"Title": "Price is Right, Volume Control is Terrible", "Author": "R. ORourke", "ReviewID": "RRNLVQBYAT00T", "Overall": "4.0", "Content": "Pros:Great priceGreat pictureSound is fineCons:Volume varies widely between inputs.In a quiet room, sitting at any distance up to about 15 feet, a volume of \"1\" is generally sufficient, sometimes even too loud. In a more noisy room (fans, etc) a volume of \"3 - 5\" is usually fine. After about \"10\" it's pretty much all the same, but yet it goes all the way up to \"100\" - what's the point? I'd like to see more control of the volume. In my opinion the range should be from 1 to about 50: the first 10 stops should  basically range from \"too quiet to hear\" to \"low volume\", then you should start getting into normal listening range from about 11-30, and then it should max out at 50. For this tv, with such a huge range from 1-100, wouldn't it make sense if maybe 15-45 was a normal listening range?Another problem with the volume (or maybe it's the HDMI inputs or devices?) is that between my cable provider's DVR, AppleTV, and Roku the volume varies widely. I mentioned earlier that you can view normally at 1, well that's on the DVR and for content delivered through AppleTV's iTunes media, but when you get into AppleTV's other apps like Netflix or HBOGo you need to turn it all the way up to 10-30 sometimes. All Roku apps pretty much require a lot of volume too. And it's that weird kind of volume where you can't hear it well in the room where the tv is, but in other rooms or downstairs / upstairs it seems really loud - you can't hear exactly what's being said, but you can definitely hear a loud tv somewhere else in the house.Also, there's only two HDMI inputs.Bottom Line:The price is right. I got burned on a $1600 Samsung that was new in 2010 and the screen fizzled out about 18 months later so I went with this cheap tv and it's lasted just as long so far. I'm happy enough with it.", "Date": "July 27, 2013"}, {"Title": "Great Budget Buy", "Author": "Nathan B", "ReviewID": "RD9GFWDG62P8I", "Overall": "5.0", "Content": "I bought this TV as a budget buy for my room. After getting a THX Video Setup image on my screen and calibrating it. The picture is Completely acceptable. The refresh rate is just fine on good sources like the PS3, Xbox, and HD Channels On my Cable box. The sound is acceptable for TV speakers however I use a full surround sound for more accurate sound. The TV is a little thick but completely mountable and not to heavy compared to other models. Brightness and Contrast Seem Great when well calibrated. (I recommend calibration)", "Date": "July 3, 2013"}, {"Title": "Conference room tv's", "Author": "ec", "ReviewID": "RJ9BSKER4NRWD", "Overall": "4.0", "Content": "Bought 2 of these for our offices. they work well and do exactly what we need, decent picture and sound", "Date": "May 31, 2013"}, {"Title": "love it. i would recommend it. enjoy it. its very nice and look good as describ. i approve of it.", "Author": "jess", "ReviewID": "R3OJP07K3RKA0I", "Overall": "5.0", "Content": "love it. i would recommend it. enjoy it. its very nice and look good as describ. i approve of it.", "Date": "May 28, 2013"}, {"Title": "It is good at being a TV", "Author": "drfundy", "ReviewID": "R1K1AUD6S0KZFT", "Overall": "5.0", "Content": "The picture quality is good for the price. Very dark blacks. I got a sound bar for mine and I'm glad I did. The built in speakers aren't horrible but leave something to be desired.", "Date": "April 12, 2013"}, {"Title": "Nephew Christmas gift.", "Author": "Tammy", "ReviewID": "R2XEYE7IDS5JX5", "Overall": "5.0", "Content": "This was a gift for my nephew,  He loves it and it works great.  He plays his video games on it and has no problems with it at all.  Cant best a 40\" LCD flat screed for under $300", "Date": "April 12, 2013"}, {"Title": "GREAT picture", "Author": "JENNIFER L O'BRIEN", "ReviewID": "RUJLDZVWMWMLP", "Overall": "4.0", "Content": "My son loves his tv....it has a great picture, great sound, great quality.  I would recommend this tv, it's a great tv at a great price!!!!", "Date": "March 26, 2013"}, {"Title": "Jack Spicer sez:", "Author": "John A. Spicer \"Music Lover\"", "ReviewID": "R1HUSGM4YBBMWB", "Overall": "4.0", "Content": "Picture is excellent.  Sound is very good.  I feel no need to buy a surround sound receiver.  For those who want surround sound built around a bright picture, just buy an av receiver.  I paid $469 through Amazon and recieved the tv in five days.  Setup wasn't too difficult and I put it on a $100 glass & steel stand.  I had a problem hooking up a second dvd player and Toshiba sent a repairman to my home.  He discovered the problem was in my dvd player.  There was nothing wrong with the Toshiba tv.  Strongly recommended.  It would be a good buy if it cost another $100.", "Date": "March 2, 2013"}, {"Title": "Great TV for smaller living room", "Author": "Epic Pen Name", "ReviewID": "R37S9SD8H1B52G", "Overall": "4.0", "Content": "The picture is crisp and vibrant (follow the tips in the other reviews here). Sound is fine. Works well with my Macbook attached. The 40\" size is perfect for our small apartment living room.Biggest cons I haven't seen much in other reviews:-In both upper corners there is some light leak, definitely noticeable during darker scenes. Some slight white coloring, but not egregious.-One press of the Mute button cuts the volume in half, so you have to hit it twice to get full mute. This is REALLY annoying for me since I mute at every commercial break.Other than that, no complaints.", "Date": "February 20, 2013"}, {"Title": "Great TV", "Author": "grinder369", "ReviewID": "R2L2OM9GZUWGZ2", "Overall": "5.0", "Content": "Purchased this tv at the end of last year and have been totally happy with it since. Great picture, reasonable sound, and easy to  set up.", "Date": "February 17, 2013"}, {"Title": "Very satisfied.", "Author": "T. Pritchett", "ReviewID": "RQCGR773TVDNT", "Overall": "4.0", "Content": "Note: we're NOT HDTV aficionados, not do we intend to be. But this gives a good picture, even up close. Don't buy the special coating (imo): this one wipes easily with a feather duster and a [for smudges] an eyeglasses cloth.Cons: remote is cheap-feeling and confusing (and I've got a Panasonic Blu Ray control the size of my forearm, so I know confusing). Basically, you turn it on, and use the left right circular buttons to pick which HDMI device you want to use, PC, ANT, or CABLE. Then you set it down and leave it alone. (Oh, you have to use it if you want to use anything other than native picture mode, like \"stretch\" — trust me, you don't. Let your peripheral and media run on this TV in default mode, or change it from the peripheral/media, because this TV doesn't \"stretch\" well.)And turning it on takes forever. You see Toshiba for what seems like forever, and the \"on\" indicator light (controlled by my DISH remote, thank God) is a teeny green light that is hard to detect the on/off state.Still, very impressive TV. We don't use the remote except to switch between DISH and the switch box (XBox, Blu Ray, Wii), so it's not a big deal. We leave the TV on almost all day, and have had no problems with overheating. It's cool to the touch unless we've played some hard-core games for hours, and even then, it doesn't run hot. We love it. If it broke, we'd buy another.", "Date": "February 15, 2013"}, {"Title": "Reasonably priced - Low Quality", "Author": "Miguel", "ReviewID": "R1M2VERIJVMBJU", "Overall": "2.0", "Content": "I read some reviews before buying this one, and even though I knew it wouldn't be the best tv, it really dissapointed me. The Remote Control is trash, the tv response is slow when turning it on, changing inputs, etc. Mine, had some weird lights in the background that wouldn't let me see movies in dark environment. It was a shame. It is OK for its price, but thing twice on spending 50-100 more to get a way better samsung tv. That's what I did.", "Date": "January 26, 2013"}, {"Title": "Very Good TV", "Author": "Jerry Bowman", "ReviewID": "R3D5QD8RCE4DX9", "Overall": "5.0", "Content": "I bought this on Thanksgiving day for $179, right here on Amazon. It is worth much more, it is a very good HDTV.An update on February 21, 2013:  Wow .... this is the best TV picture in the house. We have 3 other TVs that all have very good pictures but this one is by far the best picture quality.", "Date": "January 19, 2013"}, {"Title": "$179 for this TV? Yes please.", "Author": "C. R. Smith \"RDiddy\"", "ReviewID": "RQF3JDDOQEQQZ", "Overall": "5.0", "Content": "Bought this TV for my daughter's nursery. Yes, she's 16 months old and you're probably saying \"what the hell does a baby need with a 40\" TV?\" Well, we spend a lot of time with her in her room, and she loves here Gabba Gabba. This was a Black Friday deal, and why would you NOT buy a 40\" LCD when you can get it for the price of a 24\"? Duh. Looks great on the wall in her room, and has a very good picture for a TV in this price range.", "Date": "January 19, 2013"}, {"Title": "Decent tv for the price", "Author": "Mike", "ReviewID": "R3GKZHJWA3U7VH", "Overall": "4.0", "Content": "I bought this TV on black Friday when it was $180.  For that price I did not expect much.  The picture is decent, but does not have great contrast.  I had to bump up the brightness and contrast and it is still a little dull.  I also wish this had an audio return channel to send by to my receiver, but again, I did not expect this feature for such a low price.  If you are looking for a nice new TV, then I would look elsewhere.  If you just want a TV for a second room or need something cheap, this is a great TV for you.", "Date": "January 17, 2013"}, {"Title": "Affordable and good picture", "Author": "Kevin Holbert", "ReviewID": "R1YD9VTW7VXAD0", "Overall": "5.0", "Content": "no lag time, great refresh rate, the color saturation is gorgeous.  It was all I could want- and more witht he HD channels I get now.  I don't need anything fancy, just a big clear picture.  And this was just right for the budget.", "Date": "January 6, 2013"}, {"Title": "Great TV for the value", "Author": "J. Tan \"Lynndo\"", "ReviewID": "R2QJ6QOG1PK0UG", "Overall": "5.0", "Content": "Great deal for less than $500 for a 40\" and 1080p. Nice and sharp picture. I could change the setting to a sharper one like Samsung and waste more energy, or regular one and still good for the eye. I had Samsung 24\" before and I like this way better.Though could not get the analog signal at first, but the Toshiba's customer service gave a great advise.", "Date": "January 3, 2013"}, {"Title": "Not bad for the money", "Author": "Rachel Raifman", "ReviewID": "RKWHRB7K17JMG", "Overall": "3.0", "Content": "the remote control does not work well. We are using the one from the cable box. The tv is very slow to turn on. Press the power button and sometimes it is 20 seconds, if you jump too fast you can turn it off before it turned on.", "Date": "January 2, 2013"}, {"Title": "Works great so far!", "Author": "Lisa M. Schultz \"food fanatic\"", "ReviewID": "R268H8EJRJJQXH", "Overall": "5.0", "Content": "I got this for about $170 on a black friday deal.  The tv is really easy to set up, has all the normal hookups, and the picture looks great to me.  I am not a super high electronics type person, so someone more tv savvy may not think it's all that great, but I have had no problems so far.  My only complaint is that the remote sucks big time.  There is a delay when you change the channel that is really annoying.  I am  flipper and I hate waiting for the next channel to show up!", "Date": "January 1, 2013"}, {"Title": "Value for money", "Author": "Sushant", "ReviewID": "R1AR876M0OW6L", "Overall": "5.0", "Content": "I was lucky to get this TV in the black friday deal. The tv arrived quickly and Amazon customer service was kind enough to remove the shipping costs as I wrongly chose Standard Shipping instead of free shipping while ordering. Tv comes with stand and screws to attach it.The TV brightness is a little dim initially after turning it on but comes back to good brightness about 5 to 10 mins later.The sound is good unlike many other TVs my friends have bought recently. They have been forced to hook up a sound bar or home theatre systems to the tv. I was looking for a tv at a low price that would be able to show HD quality and then I plan to buy a bigger LED tv in future when LEDs are not that expensive. I am fully satisfied with the value delivered for the price.", "Date": "December 30, 2012"}, {"Title": "I like my new tv", "Author": "Angela Mathis", "ReviewID": "RR88OQJ8PF097", "Overall": "5.0", "Content": "I love my HD tv when I'm using my Blueray player, but when we have on Dish receiver and it's in the den and my tv in the bedroom and I connect the dish thru a coaxial cable it looks blurry at times the only things the look great is Adult Swim cartoons.  LOL!!  I've been searching for a converter than isn't expensive.  Any solutions let me know..", "Date": "December 28, 2012"}, {"Title": "Good choice", "Author": "diverchick", "ReviewID": "RG87GIVPG8DU9", "Overall": "4.0", "Content": "This item came quick and has a nice picture.  good size for my apartment.  Will be looking at getting a tv for my bedroom and will look into getting another Toshiba", "Date": "December 28, 2012"}, {"Title": "Love it", "Author": "Jenny Barnes", "ReviewID": "R2G3X5NGVTZSA8", "Overall": "4.0", "Content": "I chose this TV for my bedroom so I didn't need anything with a lot of connection possibilities.  Took some getting use to that it comes on very slowly but that's hardly an issue.  Screen is a little dark tho and even my extremely tech-savvy husband hasn't been able to adjust the picture just right, but I still love it.", "Date": "December 28, 2012"}, {"Title": "For Myself", "Author": "Georgia Beam", "ReviewID": "R3NRAEST47NH2W", "Overall": "5.0", "Content": "This was an early present for my house.  It has been great to see shows in enormous size.Definately got a good deal on Black Friday.", "Date": "December 27, 2012"}, {"Title": "Good Deal", "Author": "Jimmy", "ReviewID": "R37DBZIQFPTVBC", "Overall": "3.0", "Content": "This is a highly reliable unit.  There are better specs out there and better features but for the money it is reliable.  It really shines when connected to a Boxee Box. Its a 3-star TV  at a 1-star price - a steal as a bedroom TV.", "Date": "December 26, 2012"}, {"Title": "Black Friday purchase", "Author": "Ryan W. Sutton", "ReviewID": "R3F6QFRFGVJB5P", "Overall": "5.0", "Content": "I was lucky to get this TV at $179 Black Friday match price.  Amazon delivered promptly.  TV deserves 6 stars considering the price I paid.  Being a budget model, the screen is not as bright as my high end Toshiba I bought in 2007.  Tweaking the picture settings allows for improvement over the default settings.  Very satisfied at $179 but, this TV could be overpriced at $465 given it is a budget/basic model.", "Date": "December 26, 2012"}, {"Title": "$179 Black Friday deal was REAL!", "Author": "Blasko", "ReviewID": "RD2N0NYBH3J9N", "Overall": "5.0", "Content": "I know a lot of people freaked out on Amazon when this deal came up. It was gone in seconds which made a lot of people claim it to be scam. Not true. It wasn't a scam, it was a really good freaking deal! As soon I saw the post on FB, I went to Amazon (I was already logged in and cleared my cart of all the stuff we pretend we want to buy) added the tv and checked out. $179 plus tax, and I bought a warranty. That was it. I went back to the page and the deal was gone and the price was back up to $400+.The TV is wonderful, it was the first real purchase I made for my new home and I love it. Clear, bright picture. I never really cared about HD before, but wow what a difference when you land on a non-HD channel. I had to adjust the color a bit but that was it. Next on my list is getting it mounted on my wall.", "Date": "December 26, 2012"}, {"Title": "Great TV", "Author": "Rick W.", "ReviewID": "RFOTAEVP0FSW1", "Overall": "5.0", "Content": "I liked the first one so well that I bought two more.  I'm still enjoying my first Toshiba, I gave my son the second one I purchased and I bought this one as a spare.", "Date": "December 24, 2012"}, {"Title": "I love it", "Author": "Nick", "ReviewID": "R34CBY2WGB65WY", "Overall": "5.0", "Content": "I bought this tv on Thanksgiving day. Very good picture quality and brightness. Only thing I noticed that is not at par is slow response to remote controll. Everything else is perfect. Easy to hookup. I will recommend this product.", "Date": "December 24, 2012"}, {"Title": "Toshiba", "Author": "Casey", "ReviewID": "R1HGW1DXJ9H3C6", "Overall": "4.0", "Content": "The tv came in 2 days and is great! The picture is clear, and the size of the tv is perfect.", "Date": "December 24, 2012"}, {"Title": "Wonderful TV", "Author": "Danielle", "ReviewID": "R3O6SJH24J9L3J", "Overall": "5.0", "Content": "I am a very techy person, but when I bought my first TV for my new house I desperately wanted something inexpensive. I found this TV (which costs about the same as a 32 inch, but considerably larger) and immediately bought it. I admit the screen is a little dark at first, but you just have to change the energy saver setting (which is somewhat hidden in the menu, but it is there!) I also found it was best set for a cool setting, and increasing the blue tint made it more realistic (but that's just my personal preference).I ended up getting a really high quality TV for super cheap!My only complaint is it does not connect to my super ancient DVD player (which is fine since I really don't watch physical DVD's these days anymore.) and that the input plugs are all in the back, and very hard to reach if your TV is mounted.", "Date": "December 20, 2012"}, {"Title": "Great for the price", "Author": "Bugsy", "ReviewID": "R22SIRRZ60BPJ1", "Overall": "4.0", "Content": "This TV is great for the price. The features are average - nothing really special. The picture quality is pretty good and it has an adequate selection of inputs. Colors are bright, and blacks / dark tones are pretty deep. It takes a little longer than some TV's to turn on. I purchased this for my bedroom and it's good for that purpose. If it were for my living room, where I have more devices, it's a little limiting. The remote doesn't work so well. It's very directional and can be difficult and unresponsive at times. Overall, for the price it's a good buy. It's an attractive unit and fairly compact. It has a stand is easily wall mountable.", "Date": "December 20, 2012"}, {"Title": "Packaging", "Author": "Ralph L. Frasier \"R. Lee\"", "ReviewID": "R3HXT4DJ819Y0A", "Overall": "4.0", "Content": "TV arrived in good condition but operating manual was missing . Had to go on line for instructions.TV works well we are overall happy with it.", "Date": "December 19, 2012"}, {"Title": "great deal", "Author": "D. Drake", "ReviewID": "R3A9Z32NXNI34B", "Overall": "4.0", "Content": "only reason not five stars is the remote must point directly at TV  does not work off at angles.  great picture and was light enough for me to hang by myself", "Date": "December 19, 2012"}, {"Title": "Not too bad!!", "Author": "N. Bissett", "ReviewID": "R3HF9E05G6V34A", "Overall": "4.0", "Content": "I'm a little disappointed that I missed the sale on this TV. I purchased this set about a month before, so I suppose I deserve that. However, even though I paid full price, I still think this is a great TV for less than $500 There are a couple of small issues that are common with many LCD panels, especially on budget priced sets (such as flashlighting in the corners - although this problem is only noticeable when the room is dark) but they don't negatively affect the experience overall. The game mode and native display option is much appreciated :) and the image is pretty stellar after some minor calibration. Overall, if you can get this for under $400 I'd jump on it - as long as you don't expect it to be packed full of features. If you want a decent image, and a smaller sized set without all the frills this might be for you.", "Date": "December 18, 2012"}, {"Title": "A wonderful Television for the price.", "Author": "Kevin Holbert", "ReviewID": "RENW93XQ0A7K1", "Overall": "5.0", "Content": "I have no complaints- save one.  Now I want a blu-ray because my dvds are depressingly non-HD.  I did my research before buying, and I wanted a decent TV with no frills.  I watch college basketball on it with my HD cable and love it.  No problems with the refresh rate, it's really a good TV.", "Date": "December 18, 2012"}, {"Title": "Awesome TV", "Author": "LFuchs", "ReviewID": "R4EPOLAL1KHJ4", "Overall": "5.0", "Content": "I got this when it was a lighting deal on Thanksgiving for $179. This was the best deal i got this year and it is a great TV. It was much easier to get this TV then going to best buy to get. The picture is awesome.", "Date": "December 12, 2012"}, {"Title": "Score!!!", "Author": "PrttyBlndGrl", "ReviewID": "R1ZD9BGFS4E60Z", "Overall": "5.0", "Content": "I bought this on black...thursday as $179.  It was in the freezing cold so I warmed it up to room temperature for about 2-3 hours...plus I had a heater on in the room.  I was warned that if I turned it on freezing cold it would wreck the crystals in the LCD? Idk...but it came on and I filled out all the installation stuff.  The remote is a little cheap and turning the channel is slow but if you press enter right after you change the channel it quickens things.  The picture isn't as clear as my old philips TV but that's fine, I'm just glad I have a tv that isn't showing me headless people!  It looks great in my bedroom and is perfect for movie night with family.", "Date": "December 11, 2012"}, {"Title": "Good TV for the price", "Author": "Vishesh Panchal \"v!sh3sh\"", "ReviewID": "RK21A7EUED8WM", "Overall": "4.0", "Content": "I bought this Toshiba because it was a really nice deal. If you are looking for a basic tv this is great. The sound is good and the tuner catches all the over the air channel I should be receiving in my area.As for the viewing experience. The factory setting was obviously not perfect and the Dynalight thing worked but not quite spectacularly. I took some time to get the settings right but since then its been great viewing.I took off one star for the slow remote and the fact that the dynalight thing does not quite work well. If you have a bright apartment during the day and then dim lighting at night you might have to twiddle settings all the time.", "Date": "December 10, 2012"}, {"Title": "Good TV for a great price", "Author": "Scott", "ReviewID": "R29F5JREONA9C2", "Overall": "5.0", "Content": "I bought this on black friday for a steal $180. I really have no complaints for what I paid. Picture looks great. Just needed to turn the auto dim feature off and the picture to dynamic for better contrast ratio. I read some of the other reviews and have heard a lot of awful stories about their tv being damaged and toshiba or amazon not doing much about it. I consider myself lucky as I have gotten my TV undamaged and in perfect condition. For those working TV's I recommend updating it through Toshibas website as it fixes a few things and adds some settings options. As it is priced now at $409 I would probably look at other HD TVs around the same price point before looking at this one.", "Date": "December 9, 2012"}, {"Title": "Awesome all around, except for one thing.", "Author": "Cody J", "ReviewID": "R1KHUGOJC98BH6", "Overall": "4.0", "Content": "Got this TV on the Black Friday special, and I'm loving it so far. Picture is crisp, colors are vivid, but one thing is bothering me. The TV has been doing this since I first turned it on. There are white spots on the top left and top right corners, they look like spotlights. They're only visible when that area of the screen is black. It's very annoying and I have yet to find a fix for it. But otherwise this TV is awesome.", "Date": "December 5, 2012"}, {"Title": "Good, then bad, then great!", "Author": "Rebecca McCullough", "ReviewID": "R2VJLJT3XJX4GZ", "Overall": "5.0", "Content": "I was one of the lucky ones who got this TV for a steal on Black Friday.  I was so excited for it to show up, unfortunately when it did the box was dented and the screen was cracked.  I called Amazon to request a replacement and was told they couldn't because I had bought it on sale (no, duh) and they would only refund my money. What kind of customer service is that????  I've never had any problems with Amazon's customer service before, so I was really bothered by this.The next day I called back and spoke to a different rep who was wonderful and totally restored my faith in Amazon.  She was able to get a replacement sent out and arranged for a pickup of the broken TV.  The new set just arrived and appears to be in perfect working condition.  I had a bit of trouble figuring out how to change the brightness of the screen, but then remembered another review here that said to do a factory reset and choose \"retail\" mode instead of \"home.\"  The remote is a little on the cheap side, but I have a universal one already so no big deal.", "Date": "December 4, 2012"}, {"Title": "Toshiba -- $179 --what a deal", "Author": "T. A. Grant", "ReviewID": "R1T4FGARPAGDHT", "Overall": "5.0", "Content": "This TV is awesome, easy to configure, light weight, but heavy on performance and sound.  Do not stop the black friday deals.", "Date": "November 29, 2012"}, {"Title": "Good TV for the price. Have had HDMI issues.", "Author": "Matt", "ReviewID": "RSI38FN6N021I", "Overall": "2.0", "Content": "I have had this TV for several months and now feel I can write an honest review. In all I am pleased with the TV, for the price. This is no LED, it is larger, heavy and with only 60hz it is not amazing quality. But it is a good looking picture for things such as hockey, movies and video games.My real gripe is  the HDMI inputs. While watching cable if I change from an HD channel to non HD (or ever premium channel to non premium) the tv loses input and I am forced to power on/off. Same thing happens if I change from HDMI1 to HDMI2. This is very frustrating.I do not have a lot of experience using this tv with my computer through HDMI out, but was successful streaming once so no complaints.I have used both the stand included and a 3d wall mount with swivel extension which makes the tv look very nice. Although because it is larger than newer tvs it does stick out from the wall a good amount, but as long as it is not being put up near a walkway this is acceptable.Platstation 3 works well.If I could somehow fix the HDMI issue I would give this tv 5 stars.", "Date": "November 27, 2012"}, {"Title": "great tv", "Author": "Stacydawn", "ReviewID": "R21JAPL52ROKO0", "Overall": "5.0", "Content": "I took advantage of the trade in program that amazon has.  I sent my iphone 4S in and received a gift card so I used the card to get this tv.  It is a very nice tv and has a great picture.  It is a little slow to turn on but it has a nice picture after it comes on.  The sound is not that loud but I am used to my other tv that has built in surround sound.  Overall, great tv.  I am very happy with my purchase and happy I had a way to get rid of a very nice phone.", "Date": "November 27, 2012"}, {"Title": "Absolutely wonderful bargain", "Author": "Matthew Beilharz", "ReviewID": "R2TCR4BJVKLQ3L", "Overall": "5.0", "Content": "I purchased this late on Thanksgiving for $179, and it was at my front door Monday morning. It was shipped in the factory packaging and survived with no blemishes to the box.The TV itself is great!  The picture is crystal clear, and the sound is above and beyond what I expected, especially based on price purchases of flat screen televisions.No complaints at all. Setup was super easy, and I am looking forward to (hopefully) many years of use.", "Date": "November 26, 2012"}, {"Title": "Good TV but I got a defective set", "Author": "Anonymous", "ReviewID": "R3Q52TB7GGPJ9G", "Overall": "2.0", "Content": "I was lucky enough to purchase this TV on Black Friday for $179.99. An absolute bargain!Unfortunately, after completing the set up I discovered the TV was defective: it had two dead pixels on the left side of the screen plus several dozens of flashing pixels - visible only when the screen turned black. In the end I had to ask for a replacement.Defects aside, the speakers were loud and the picture was very clear. I just got a bad set. It seemed like a good tv, perhaps not worth the full price ($400+), especially considering Toshiba got out of the LCD tv business earlier this year and it is legitimate to wonder if they will be able to honor the warranty if the tv needs repairing. For this same reason Amazon didnt have in stock further sets to replace it, so they offered me another brand to stand behind their sale. A satisfactory solution.", "Date": "November 24, 2012"}, {"Title": "Superb budget tv", "Author": "shocktech", "ReviewID": "R2C17R99CH6H6X", "Overall": "4.0", "Content": "I ordered this on thanksgiving for $179. I was surprised and excited that I got this deal with almost no effort.This tv has a very good picture for a $450 tv. Getting it or $179 is crazy. You have to take time to adjust it to your preferences and look online for calibration recommendations. Don't judge it out of the box. This tv is not for those looking for elite images. You jut won't get plasma picture for this price. However, it's a very good picture and compares to much more expensive tv's.the speakers are also actually pretty good compared to most flat screens. Again, not for audiophiles, but you won't be miserable until you can grab a soundbar.I ordered this with super saver shipping and it delivered Saturday morning. I don't have prime and I still got this thing in 2 days. I don't know how amazon does it.And I didn't pay taxes!I love this purchase.  Get one if you can. Great for living room or large bedroom.", "Date": "November 24, 2012"}, {"Title": "Decent TV", "Author": "C.J.", "ReviewID": "R3COPYIXRHVC47", "Overall": "4.0", "Content": "I was one of the lucky people to get this TV on Black Friday for $179. I watch a lot of sports and didn't notice any motion blur despite this TV being only 60hz. The sound is decent, the volume is loud. Like what others have said, it does take some time to turn on, the remote is cheap quality, and there's only 2 hdmi ports but that can be solved with a hdmi splitter. Would I spend the regular price of $400+ for it? No, because there are other higher quality brands that are similarly priced. But if you can get this at sale price, it's definitely worth it.", "Date": "November 24, 2012"}, {"Title": "GREAT TV, worth it!", "Author": "J. Miller", "ReviewID": "R2UCTIP5TOBPR0", "Overall": "4.0", "Content": "I bought this TV from Amazon.com on October 13, 2012. It came UPS 3 days later shipped free my Amazon.This TV is amazing. I was so excited to order it, could not wait for it to come and pleased with it ever since.This is my first HDTV, my first big screen, by first flat screen and my first Amazon.com review.I was originally stalking a 42'' LG but this was better priced and shipped free.The picture is awesome once you turn Energy Saver OFF. The sound on the TV is good.It's easy to setup and troubleshooting it is a breeze. I got the HD package from my cable provider and have never looked back.The TV seems bigger than I thought which I am loving. I don't even want to through the box away how much I'm loving my new baby.Worthy the $377 for sure.", "Date": "November 3, 2012"}, {"Title": "great tv", "Author": "wooy mack", "ReviewID": "R3EO3LPVFGGZ8X", "Overall": "5.0", "Content": "this is a great tv, good price and great picture. the tv changer(flipper)  could be improved uponi also bought another one a  toshiba  32 inch the following week, and it is great also", "Date": "November 2, 2012"}, {"Title": "Good Value", "Author": "Richard", "ReviewID": "RH1IE83GMCUFY", "Overall": "4.0", "Content": "The Toshiba HDTV is good value, but I agree with some other buyers of this product that the Remote is cheap although seems to function adequately. This was a replacement purchase after returning an inferior poor quality TCL HDTV I purchased from AMAZON. To AMAZON'S credit I was given a full refund after 2 months of aggravation with the TCL warranty repair service company A&D; Electronics. No one should ever buy a TCL product based on my experience. AMAZON remains a good company to deal with.", "Date": "October 17, 2012"}, {"Title": "Not changing the channel", "Author": "Xxx20xxxx", "ReviewID": "R3Q8WRVDQC9GKC", "Overall": "3.0", "Content": "Just got my order today everything is good except the channel are not changing at all. Any suggestion on how to fix that?", "Date": "September 28, 2012"}, {"Title": "Great HD TV for the price", "Author": "Jim Murphy", "ReviewID": "R1LL18PGH26471", "Overall": "5.0", "Content": "TV was easy to install and worked great on first power on.  Previous reviews mentioned poor sound, but I have no complaints with it.  It works well in the small room it's in, so no entertainment center needed because it's kept fairly at low volumes.", "Date": "September 28, 2012"}, {"Title": "Great TV, sound is very low", "Author": "sabcreek", "ReviewID": "R70VJUE6E2W65", "Overall": "4.0", "Content": "This TV is great, has a lovely picture and is easy to run, our only let down is that it doesnt have very good volumn.  This TV was bought for m mother who has a slight hearing problem and with it all the way up, it was still hard for her to hear less then 12 feet away!  The picture is great and it wasvery easy to program.  The customer service people are all very nice and helpful as well!  (i did something wrong a few days after setting it up and didnt realize what it was till i called)We ended up hooking a stereo system up to the TV for now until we look more into a sound bar for better, higher sound in the future!(if you do something like this, make sure to turn the TV down or you will here a competing noise when they are both on)", "Date": "September 20, 2012"}, {"Title": "Good budget TV", "Author": "PaulB", "ReviewID": "R3QJK4NUK0W8DO", "Overall": "4.0", "Content": "I bought this TV about month ago. It has good picture quality (after turning Power Saver Off) and sound quality. We use it as second set in our bedroom.The only problem or nuisance we found it takes long time to turn unit ON. When Power button on remote control is pressed, green LED indicator comes ON immediately, but it takes about 20-30 seconds until picture appears. Therefore is 4 stars.I guess, you got what you paid for.PaulB.", "Date": "September 14, 2012"}, {"Title": "REALLY NICE SO FAR..BEAUTIFUL CLEAR PICTURE", "Author": "I. GLENN", "ReviewID": "R2F17HSZHHPNIS", "Overall": "5.0", "Content": "*********************************************************************************************  URGENT!!!!!ATTN FUTURE BUYERS: June 26, 2012 one month into this purchase the television has lost power to show the screen, and sound. It will boot up to show input settings, then the picture goes dim, then completely goes out; like on standby mode!!!Action taken: July 26, 2012 I called Toshiba tech support, we trouble shot for almost 1 hour; and it appears either the HDMI ports on the TV, or the HD cable box may be bad.***UPDATE 8/5/2012***..The tv is working \"full speed ahead\". My HD signal from my cable supplier had dropped one night. Normally most tv's can receive the signal again once the system is up. However, I had unplugged all of my connections when I called Toshiba, during trouble shooting the issue.So on August 5, 2012 I replugged everything in it's place, and let the cable box reboot. Then I called my cable supplier. The technician told me that some HD tv's have difficulty finding the input signals after the cable goes out. In order to get the HD signal back I had to use the tv remote, to click, and enter all of the inputs, s/a antenna/cable, HDMI 1 & 2, and so on down the line, one at a time. After approx 4 rotations the tv retrieved the signals. YEH!!An easier way to get the signal back is to press the ON button on the HD cable box once, to refresh, and if the tv screen doesn't come on, Press it again it will come up in about 4 seconds..this is guaranteed to work.Toshiba tech taught me how to varify if the problem is the tv, or the cable; press the menue button. If the information comes onto the screen, the tv is functioning; as it was in my case It has just lost the HD signal.***UPDATE 8/27/2012*** TV is still working great. It appears that this incident with the other TV's within this line, may be partially the fault of the cable supplier; and not soley the TV itself. However in my case I tried other issues that could be affecting the workings of the TV. So glad I did, because the price was a contributing factor of why I bought this one in particular. Also my husband, and I have two Toshiba 30 inch big square tv's, and both are still working after 15 years. No kidding. They are just to bulky now; so we opted to go flat.UPDATE: 11/08/2013 Television is working fabulously super. Still have issues with keeping strong HD signals; just refresh on the cable box, or the remote, and were up to vewing on average 6 seconds. This may occur 3 times a month only.---------------------------------------------------------------------------------------------INITIAL PURCHASE REVIEW:The TV is exceptional for the price of 399.00. The picture set up was easy, in order to get a lighter screen, go inside of picture mode, and scroll down to(PREFERENCE) this will give you a lighter screen. Then MENUE button on the remote to adjust the regular features, such as color, audio, screen aspects and etc. After setting Audio, scroll the top bar to the next setting which looks like a music bar, called (PREFERENCES) scroll to the bottom, which says Energy Saver..turn it off, then the picture is super bright. Make sure to scroll all of the features to ensure the best picture quality possible.Cons: Does not have zoom feature.", "Date": "June 21, 2012"}, {"Title": "Wow!  Great deal!", "Author": "Dan Delorit", "ReviewID": "R39VZZT1FXYK6H", "Overall": "5.0", "Content": "Bought this TV to use to replace an older Sony HD projection TV in the basement rec room.  We have a Sony 52, and a Samsung 32 LCD/LED TV.  The Sny is a 120 Mhz.  We are Costco members and looked to purchase our newest TV there. Amazon beat the price.o  We wanted a reasonably priced TV - Amazon had the best prices if you take into consideration free shipping, and no taxes.o  We struggled with the 60HZ of this TV vs. paying extra for a 120 for watching sports - I frankly don't notice the difference with this size screen and we are very happy with the picture, it is very vivid!o  We wanted a TV which gives good volume out of the box -It gives great volume - better than the 52\" Sonyo  Adjust the Energy Saving feature to off for the brighest picture - in preferences - scroll down to Energy Saver on turn offWe received no manual, and there were no AAA bateries for the remoteThe only issue was the packaging.  The Amazon supersaver shipping was fast.  The box came untaped on the bottom.  They could use a little more tape to close the box.Great bargain - great TV", "Date": "November 10, 2012"}, {"Title": "Decent Tv with a few caveats", "Author": "Matt W", "ReviewID": "R1D0K00GCV2IS3", "Overall": "3.0", "Content": "I got this Tv a few days ago and here are early findings. At a sub $400 prince point it definately is worth it however be ready to spend time getting the picture sorted out properly. I'm still working on it and although it's good right now I still think our Sharp 42in is clearer overall. I wont harp on the lackluster audio as that's old hat and to be expected on most all tv's these days. The remote is basic and seems to not have a great range or response at my 10ft viewing distance. Tv is slow to power up and lacks sufficient HDMI (2)outs unless you run an a/v receiver setup.Also BEWARE of light leakage, maybe mine is a bit more the exception but I have what I consider unacceptable light leakage from ALL 4 corners of the screen resulting in what looks like these little spotlight images you see on movie posters, not to noticeable on bright programs or movies but is there and def noticeable constantly on dark scenes or when watching in native letterbox formats.Conclusion: Worth the price as long as you take into account the limitations and possible weaknesses, I will probably not be keeping this one and will go to a 42in plasma instead like I had initially considered.", "Date": "September 4, 2012"}, {"Title": "Great value!", "Author": "Sschisler59", "ReviewID": "R1VYGQADTK2WJA", "Overall": "5.0", "Content": "This Toshiba TV has an absolutely great HD picture! Crisp, clear, responsive. I watch a lot of outdoor sports, olympics, hunting and fishing programs, and nature programs and the color and clarity and crispness is fantastic! It is so good that I usually watch the regular cable output and not the Hd, just because my dvr records more programs in reg than hd. Best tv for the money out there right now,", "Date": "August 20, 2012"}, {"Title": "Blackout for no reason!", "Author": "Hal", "ReviewID": "R3IG86QUSN4C2M", "Overall": "1.0", "Content": "Update - After I published the review the TV restarted in 10 minutes for 4 times with sometimes flashing screens.  I am pretty sure I have a defective TV and I'm gonna return it.===OK I've only had this TV for 3 days and I've encountered 3 complete blackouts. The picture first became static, and then gradually faded into black, and then repeat until it completely became unresponsive. I had to plug/unplug the power to get it back to work. Other than that, it was perfectly fine. Good looking and sound&pic; quality.I don't know if it's a know issue about HDMI, refresh rate or resolution. I am using ROKU to stream 1080p video via HDMI port. There is also a chance that I got a defective one. I hope I can find some workaround by calling either Amazon support or TOSHIBA. Until it get fixed, I am keeping the one-star rating.", "Date": "August 2, 2012"}, {"Title": "defective", "Author": "Mike", "ReviewID": "R2K6WB2VG6EIT8", "Overall": "1.0", "Content": "Ordered the 40inch TV, excited at the price....Product came, hooked it up.  Toshiba title popped on screen then screen would go completely black.  You could hear audio playing though in the background from a station.  No setup menu or anything.  Just a black screen no matter what I tried to do, which wasn't much since I could not access a menu.  Initiated an exchange with amazon and got a new one.....same exact problem.......returned it and bought a Samsung....Amazon 5 Stars. Toshiba 1 Star.", "Date": "August 29, 2012"}, {"Title": "Good value", "Author": "A Customer", "ReviewID": "R1EJZWV5BLCHM5", "Overall": "5.0", "Content": "Bought this TV for a rental property so I didn't want to spend a lot. The unit arrived on time and was super easy to set up (the unit itself did most of the work). My tenants are happy and so far no problems.", "Date": "July 8, 2012"}, {"Title": "The Best Has Arrived", "Author": "Bettye J. Sullivan", "ReviewID": "R2G4AF86GAZNPS", "Overall": "5.0", "Content": "This is my replacement for the TCL. No set-up problems with this one. The clarity, sound is wow. All I did was plugged into the same set-up and it is Grrreat", "Date": "November 17, 2012"}, {"Title": "Toshiba TV", "Author": "Lily Marlene \"Mar\"", "ReviewID": "RSFZDZ3CE8FNK", "Overall": "5.0", "Content": "We ordered this for our bedroom.  It is just what we wanted.  Good color, sound, and size.  We are very satisified.", "Date": "November 17, 2012"}, {"Title": "Very nice TV...", "Author": "vadoviejo", "ReviewID": "R11UYFH5RHD6VH", "Overall": "5.0", "Content": "My old TV broke and I looked around and found this one...  The brand has been good to me and it was about the size I needed and so I bought it and hooked it up.  Works very good...  exceeds my expectations.  I am very happy with it and would recommend it to anyone that is looking for something this size.  No complaints.", "Date": "October 20, 2012"}, {"Title": "excellent value", "Author": "Alisa Tazioli", "ReviewID": "R32EX6VUD5P36O", "Overall": "5.0", "Content": "Great t.v. all around - great picture and easy functionality at a great price.  It came direct from Amazon with their usual lightening fast service and because it is a large item I could specify delivery time range.  Very happy with my purchase and buying experience.", "Date": "October 1, 2012"}, {"Title": "great TV", "Author": "tommygun", "ReviewID": "RP1PMKIZAJD78", "Overall": "5.0", "Content": "Great TV. Easy set up, fast delivery. Picture is excellent. My choice would have been 4.5 stars, but would round up instead of down!", "Date": "September 11, 2012"}, {"Title": "perfect", "Author": "shoes", "ReviewID": "R36ZNY6OFUMU6X", "Overall": "5.0", "Content": "I would reccomend this television to others. It has great picture and sound quality. It fits very nicely on the livingroom wall.", "Date": "September 3, 2012"}, {"Title": "Slow channel changing, akward hdmi setup.", "Author": "Amazon Customer \"Air and space\"", "ReviewID": "R35CWTOVQADLDR", "Overall": "4.0", "Content": "Very attractive, with nice picture. It took several tries to get the TV to recognize my DVD on HDMI. Very slow to change channels.Amazon was great about accepting my return of this product. They automatically scheduled UPS pickup for the next business day, and quickly processed my refund.", "Date": "September 3, 2012"}, {"Title": "Great TV", "Author": "A. Gheorghe \"aurjo\"", "ReviewID": "R16RK1CB6HFLBR", "Overall": "5.0", "Content": "I do not have much to say in addition to what others have previously stated. This is a good looking TV, great picture, great price, lightweight and perfect size for a large bedroom or a smaller living-room. The remote control looks and feels cheap but don't care, I am using the cable remote. The sound is fine, plenty of volume. A couple of minor things I have noticed: if you are watching TV from an angle the picture became a little fuzzy, but this is not a bid deal for me. Also, to power-up the TV takes long time, almost a full 10 seconds, again not a big deal but kind of strange for a LCD; remind me a little of my childhood TV with tube. Overall a great buy for some like me who is looking for a TV easy to operate and do not want to pay for stuff that many times you will never need or use.", "Date": "August 29, 2012"}, {"Title": "Good TV", "Author": "Medici", "ReviewID": "REB0UTNR6CYC", "Overall": "4.0", "Content": "Just watched North By Northwest on the Toshiba and the color was superb. And this is an older movie shown on TCM which I don't believe is broadcast in HD. I'm really tickled pink with this TV including its looks and that of the big oval stand.For what it's worth, this is a great tv for old b&w; movies, dvds and tv shows. Film noir looks great on it. I just watched San Fransisco and the earthquake scenes were well rendered. Every shade and shadow appeared in those scenes. The new technology shows the superior photography of old movies very well.There's visual static at the very top in the native view of b&w; shows but the full view is very similar and doesn't have that problem.I don' t know if a Samsung of similar quality would be better, they're supposed to be the best, but this one is very good. I hope it lasts as long as a tube TV.", "Date": "August 19, 2012"}, {"Title": "Toshiba 40-inch LCD HDTV", "Author": "komara", "ReviewID": "R3KTPNKGDU8SCI", "Overall": "4.0", "Content": "I researched buying a LCD HDTV for quite some time ... my first purchase of a flat screen. I've been very happy with my choice of the Toshiba 40E220U. It's lightweight, great color & picture, sound quality and a reasonable price. Overall I'm a satisfied consumer.", "Date": "August 1, 2012"}, {"Title": "TOSHIBA 40E220U \"THE BEST VALUE\"", "Author": "Dennis Byram", "ReviewID": "R2O2SVQMQ80KQY", "Overall": "5.0", "Content": "I purchased this television as a house warming gift for my son and I must say for the price of this 40 Inch LCD HDTV has to be the best value available for the features. Nice crisp picture and quality sound for under $400!! Fabulous gift for someone or purchase one for yourself !!", "Date": "July 16, 2012"}, {"Title": "Great TV at a great price", "Author": "J. Fritz \"40yearfan\"", "ReviewID": "RSOU2JA4U24LC", "Overall": "5.0", "Content": "I was looking for a 1080P TV with a great picture, but without all the bells and whistles so many of them seem to have today like wi-fi and apps.  This TV fit that niche and was priced accordingly.  When I first hooked it up, I was somewhat disappointed in the picture quality, but with a newer HDMI cord and some burn-in time, the picture quality is excellent.  This TV is well worth the price if you are looking for great picture quality.  I was making a man cave for my father-in-law who is moving in with us and at 90 years of age, the simpler the operation, the better.  The TV is very user friendly and simple to operate.  I know he will enjoy it.", "Date": "July 5, 2012"}, {"Title": "frustrating to set up", "Author": "Charles G Bird", "ReviewID": "R3PRG54OC9EVPU", "Overall": "3.0", "Content": "Finally switched from a crt tv with digital box to an lcd tv. This was reasonably priced but it has some drawbacks. \\ customer support. long, automated, and requiring you manually read the serial number to a machine which doesn't understand you. took three tries just to find out where the old dvd player gets attached to the new tv. Evidently the yellow lead goes into the green plug.But the biggest gripe I have is in setting the channels. I get my feed off a switched set of antennae. With my old digital box you could automatically add channels and it would find new channels without deleting the old. This is handy if you have a pair of antennae ( or an antenna with a rotor.) but with the Toshiba if you run the setup again you lose the ones you had stored before. Now if you read the online manual( another minus by the way), it says you can just manually add the channel. yeah right. I tried adding  ch 9 here in seattle) and it could find nothing.  I run the scanner with the outside antenna and it found it. but couldn't find 5. so when I tune to five it first thinks it's analog then if you punch in 5 100 1 it gets that it's 5-1. But when you go to signal strength  section under menu it still thinks its analog and shows 0 signal strength. I could pick up 5 on the digital converter with the old crt tv with the indoor antenna. and briefly had 5 on the new set but 4 9 11 and 13 were lost. so I keep running the setup till I get a representative set.  I realize that every time you switch tv's the inside antenna placement requires some tinkering but it would certainly be nice if I did not have to risk losing the stations I've found just to add one.In a word, frustrating.", "Date": "July 3, 2012"}, {"Title": "MAYBE I GOT LUCKY BUT", "Author": "K. Goulet", "ReviewID": "R2M9L3QCQ86PBH", "Overall": "5.0", "Content": "OMG THIS TV IS ABSOLUTELY AMAZING FOR THE PRICE I READ THE OTHER REVIEWS AND WAS A LITTLE NERVOUS BECAUSE A LARGE NUMBER OF PEOPLE HAD ISSUES WITH THE TV RIGHT OUT OF THE BOX .. BUT ALL I CAN SAY IS WOW THE PICTURE IS BEAUTIFUL AND THE AUDIO IS HIGHER QUALITY THAT ANY OTHER TV I HAVE OWNED ID GIVE THIS TV 10 STARS IF I COULD", "Date": "September 1, 2012"}, {"Title": "clear picture, loud sound, great value", "Author": "K. Orcutt", "ReviewID": "R23HHWHLP3XM47", "Overall": "5.0", "Content": "Beautiful, crisp and clear picture. Sound can get pretty loud. I just LOVE this television! It's such a great value and i'm totally happy with my purchase.", "Date": "August 23, 2012"}, {"Title": "It want from great to very bad", "Author": "S. Mccarthy \"Darkknightboston\"", "ReviewID": "R1K1XZ0X7ZQUN0", "Overall": "1.0", "Content": "I was one of the lucky ones that got the $179.00 deal on this TV which was a great feeling.  Then I got home tonight only to discover that there was a major damage to the box.  How is it possible for either Amazon to release this to a customer or UPS to not accept responsibility that they damaged the product?  This was suppose to be a gift and now I don't know what to do.  I just left a package review with Amazon and I will update my review once I hear back from them.", "Date": "November 26, 2012"}, {"Title": "Not enough inputs!", "Author": "mwilsho", "ReviewID": "R7LXP1EFVI8H3", "Overall": "3.0", "Content": "Based on the description of this item, we thought there was a composite input AND a component input; that is NOT the case, there is ONE set of inputs that will accept either composite OR component, NOT BOTH! As soon as we discovered this we boxed it back up and returned it. We can't comment on the picture quality as we never hooked it up. The three stars are for the speed in which it was delivered, the excellent condition of the packaging, and the ease with which Amazon accomodated the return. Amazon is the ONLY place from which I would even consider ordering pricey electronics.", "Date": "August 23, 2012"}, {"Title": "Elated then Disappointed", "Author": "TomO.", "ReviewID": "R1O1H93OPD5AIJ", "Overall": "3.0", "Content": "I was amazed on Thanksgiving to refresh my laptop screen and see this pop up for the $179 price! Being a longtime Amazon customer, NO past problems with delivery, I was confident the TV would arrive in good condition.I was shocked when delivery came by my house, and I saw my TV, FACE DOWN, with boxes piled on it! I had to tell the driver where it was, the truck was such a mess. Then I saw the box! Looked like a fork lift went through one corner, denting and ripping the cardboard off. Add assorted cuts, holes, one side totally scuffed.....not acceptable!THIS WAS A GIFT, and I'm reluctant to open and set up the TV, just to try it and repack. Besides, who knows what problems it may have months or a year from now....Amazon says the TV is out of stock through them so the most I can get is a refund, while I missed all the other Black Friday sales. A lesson to be learned here about 'special deals'.", "Date": "November 28, 2012"}, {"Title": "toshiba 40e22ou", "Author": "doowron1", "ReviewID": "R2K5POC3DGLTYO", "Overall": "2.0", "Content": "I read reviews and purchased....however extremely disappointed with the overall screen brightness...read where you needed to turn off the auto brightness function which I did ....little improvement..1/3 the brightness of my Sony Bravo", "Date": "August 5, 2012"}, {"Title": "Poor after sale responce", "Author": "Tom Healy", "ReviewID": "R1YRWI74465N3M", "Overall": "2.0", "Content": "Toshiba 40E220U 40-Inch 1080p 60Hz LCD HDTV (Black)This is written in the hopes that someone will get back to me.The TV has a good picture.It is only part of the package.The remote control is not working.Trying to get in touch with anyone at Toshiba is impossible.This review would be better if all parts were in working order.I will follow up with another review within 2 weeks .Hoping to have a better opinion of the after sale customer service from Amazon.", "Date": "August 27, 2012"}, {"Title": "Good deal if you don't care about picture quality", "Author": "Tigerpaw75", "ReviewID": "R2MIBT9F4PS4FZ", "Overall": "2.0", "Content": "I bought this TV due to the good price for the size ($387 delivered), relatively good reviews, and my generally favorable view of Toshiba products.  Both my wife and I were very disappointed in this product due to the picture quality - signifcant pixelation compared to our LG 42LV5500 - LG Infinia 42LV5500 42-Inch 1080p 120 Hz LED-LCD HDTV with Smart TV we purchased in August 2011 for $670, or the 40\" Philips (40pfl3505d) we purchased in Oct 2011 for around $410.We returned the TV to Amazon and ended up buying a 46\" Philips LED LCD Philips 46PFL4706/F7 46-Inch 1080p LED LCD HDTV with Wireless Net TV, Black at Sam's Club, and its picture is amazing in comparison.  I also looked at a Toshiba 65\" LCD TV while shopping for the replacement and saw that it had the same pixelation and sharpness issues.  It must be a problem with the cheaper Toshiba TV's.I will say that Amazon's return process is super easy and efficient.  I paid the $6 for UPS to pick it up and they were there 1 business day after I requested the refund.  Amazon covers the return shipping...so kudos to them.  This is just a poor quality TV compared to other 40-42\" models in the sub-$500 category.  if all you care about is price, by all means, go for it.  But I couldn't live with this TV every day knowing I could have much better for a little more money.", "Date": "August 3, 2012"}, {"Title": "Don't pay full price for Toshiba TVs !!", "Author": "Duke \"Moots\"", "ReviewID": "R2ML0NJJ8LEKLG", "Overall": "2.0", "Content": "Okay folks the Toshiba Model 40E220U was or is a black Friday deal at Best Buy for $179.00... You know why ? because Toshiba is out of the TV business and any Toshiba TV is likely stock that was left over...I wouldn't recommend buying any Toshiba TV without first checking about support at their website and to see if You can get this TV somewhere else.  I bought it at Best Buy for $179.00  LOL  Gonna just use it in the bedroom anyway. But it's worth the 179.00.  Just be careful when and where you buy Toshiba TVs.", "Date": "November 24, 2012"}, {"Title": "Toshiba 40 in Tv", "Author": "Shante Demary", "ReviewID": "R24S24R55O2R8B", "Overall": "3.0", "Content": "This tv is very good still trying to learn setting! Picture is a little to dark for me! The tv fits well in the space I have for it! Like the body of the tv!", "Date": "May 21, 2012"}, {"Title": "Dreadful TV. Aweful picture and horrible smell!", "Author": "MASINALI", "ReviewID": "R1OI30ZR6MRL14", "Overall": "1.0", "Content": "Unfortunately, the packaging was in the trash and destroyed before we got to use the TV for more than the initial setup. The picture quality was the very worst I have ever seen with a dark picture and poor colors which were unable to be corrected after hours of trying. The bad thing about it is the smell which comes from it and it gives me a headache. It is a very strange odor which disappears when the TV is turned off. I bought this TV for one of my rental properties and would return it if I had not destroyed the packaging. I do not know if it defective but will certainly have to replace it very soon.", "Date": "May 7, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "TV without stand (Width x Height x Depth): 38.8'' x 23.8'' x 3.9'', TV with stand (Width x Height x Depth): 38.8'' x 26.1'' x 11.6''\nTOSHIBA 40\" 1080P/60HZ LCD\nLimited Warranty: 1 Year Parts & Labor\nBuilt in ATSC, NTSC, QAM tuner\nWall Mountable: VESA 200 x 200 mm", "Name": "Toshiba 40E220U 40-Inch 1080p 60Hz LCD HDTV (Black) (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/51gc27WYuGL._SX300_.jpg", "ProductID": "B0075Z2SMG"}}