{"Reviews": [{"Title": "LG 60PM6700 Not Bad So Far - See update 6/10/2012", "Author": "Ryan Lamprecht", "ReviewID": "R3QYFYGN9K7CV4", "Overall": "4.0", "Content": "I ordered the LG 60PM6700 on Friday March 11th, with Free Supersaver Shipping, and it was already delivered this evening Wednesday March 16. That was fast! Two guys brought it in, set it up, and made sure everything was as it should be before I signed for it. I've only had it for about 6 hours, so I'll give my initial impression, then update it in a few days after having more experience with the set.I had previously purchased a Panasonic TC-P60S30 from WalMart for a really good price, but in the end, I was not happy with its extremely dark picture and overall substandard picture quality, so I returned it.Right off the bat this LG blows away the picture quality of the Panasonic model I had returned. Granted, this one cost me about $300 more, but I can tell you it's already worth it. So far I've tweaked the settings to where I like the color, brightness, contrast, and black levels. I used the Picture Wizard II, but then did a few more minor tweaks to suit my taste, which tends to lean towards a brighter picture. I did have an inexpensive Element Electronics 42\" LCD sitting here while I was shopping for a replacement. I can say, the LG doesn't have quite the bright picture and vivid colors the smaller LCD has, but it does completely blow away the 60\" Panasonic plasma I had returned. From what I've experienced, heard, and read, Plasma's just don't quite have the bright brilliant pop that LCD TV's do, but this LG looks pretty darn awesome. My tastes run towards a brighter picture, so I'm pretty picky when it comes to getting the settings I want from a TV. So far, I find this LG very pleasing. As far as the bright vivid picture I'm looking for, this set gets me where I want to be.So far, I've viewed some HD Dish Network content (Restaurant Impossible on the Food Network), and it looked great. I then put on Rango through Netflix over the built in WIFI. The jury is still out on that since I'm not sure if my WIFI isn't the best, or the TV's WIFI isn't the greatest, but WIFI over my Panasonic BluRay player seems to look fine. I then connected a LAN cable to the TV and went back to viewing Rango through Netflix, and it looks great; almost DVD quality. I'll report back about the WIFI once I figure out if it's my WIFI network or if the TV's WIFI connection isn't the greatest.Next I watched part of a DVD I burned to back up one of my movies (a DVD copy of a DVD movie) through my Panasonic DMP BDT210 BluRay player. The picture was crisp and clear, but I noticed a lot of motion judder. Even messing with the de-judder setting didn't help. It may just be my copy of the movie, but a couple of times I had previously watched it on the LCD I had and didn't notice the judder at all, so I'll have to watch a few more of my copied movies and report back.I now have a store bought DVD of Alice in Wonderland playing, and it looks absolutely amazing, and with no motion judder at all. I still have to dig out a few of my BluRay disks to check that out, but I can't imagine even a Blue Ray looking much better than the standard DVD already looks. My family room is huge, so I'm sitting about 15 feet away from the TV, and I can count the individual hairs on Johnny Depp's Mad Hatter wig.I took advantage of the free two pair of 3D glasses being offered through Amazon when purchasing the LG set, but they have not arrived yet. I should have them in a day or two, so I'll have to wait to report about the 3D experience.I have noticed one design flaw in the TV stand. Due to the glossy black half inch beveled angle of the front of the stand, it tends to reflect brighter scenes, which is a bit distracting. It's a minor flaw, but if I decide to keep this set, I'll likely paint that thin strip of the stand with some flat black spray paint or use some flat black tape to cover it and eliminate the reflection. Of course if you mount this set on the wall, then this won't be an issue at all. (Update 6/10/2012 - As it turns out, this reflection from the stand is really not an issue. I rarely even notice it at all.)So far I'm very pleased with the set. As I said, I'll report back in a few days.5/20/2012 UpdateIt's now been 4 full days of owning the LG 60PM6700 and thus far it has surpassed my expectations. The picture quality, color, brightness, and black levels, etc... ALL AMAZING! I've been through three other large screen TV's. Let's just say I'm pretty picky when it comes to being satisfied with a television. My first was a 50\" Samsung I had for exactly 4 years, and it died. I purchased a LG 55LW6500 LED 3D TV, which I sent back due to horribly intolerable motion blur and judder. I then purchased a 60\" Panasonic TC-P60S30, which had an incredibly dark picture and overall substandard picture quality. That one went back after trying to live with it for nearly 3 months. I also own two 40\" LCD TV's which are in our bedrooms. Both of the LCDs have great picture quality. Until now, the best of all of them was definitely the Samsung plasma I had, but this new LG blows them all away.The picture detail of the LG 60PM6700 is crystal clear. The colors are awesome, the brightness is great, and the black levels are very good. I have some coppied DVDs that I burned to back up some of my favorite movies. Often the picture quality from the copied DVDs is far less than that of the originals. This TV converts the signal to a higher definition and makes even my worst copies of  DVDs look pretty amazing; much better than on any TV I've ever viewed them. The 3D is pretty cool, especially the 2D to 3D conversion. It's pretty cool watching sports (I really only religiously follow drag racing) and flipping through family photos converted to 3D. This TV has so many bells and whistles. I love the apps. The web browser is a bit cumbersome, but with some practice I can see it getting easier. The smart phone app pretty much replaces the Magic Remote, so no real need to purchase that if you have an iPhone or Android.I have yet to see a perfect television. In my opinion, as of yet, they just don't exist. It seems every set has its flaws. What one excels at in one area, has its shortcomings in other areas. I don't believe in rating a TV 5 stars if it has flaws, no matter how pleased I am. It doesn't leave anywhere to go with the rating when you do find that \"perfect TV,\" so it just dilutes the whole rating system. This is why I give this TV 4 stars and not 5.So here are the flaws:*There is some noticeable ghosting on moving objects; some content worse than others.*I've noticed some slight motion judder on occasions, and some motion blur; again only on occasions.*That super thin frame doesn't remain as thin when watching the TV. LG has added an additional black boarder around the actual picture, when then increases the total frame width to about an inch when the TV is turned on. I wish they had not done that because one of the beautiful features about the TV's design is that very thin half inch frame, but even with the addition of about another half in when the set is on, it's still a very thin frame, and very attractive design. Odd that they did that though because it's misleading to claim a super thin frame, if it's only super thin when the set is turned off.*The Active 3D isn't the greatest to watch is even a moderately lit room like mine. In the light of the room your peripheral vision will pick up the flickering of the glasses, when can be a bit distracting, or for some, even annoying. (In a dim setting, you can't see it, so it's not an issue at all, and the 3D looks great. The 3D has some nice adjustment features which does allow the viewer to tweak the 3D effect to their comfort level, and the glasses are very lightweight.)So, as of day 4, I'm amazed at the picture quality, and all this set has to offer. If my opinion changes, I'll surely update my review.Update 6/10/2012I've now owned this television for exactly a month, and I have to say, this is the best television I've ever owned. In my opinion, those rating this TV 2 stars have not compared it in their home to other 60\" televisions; but I have. I also believe they aren't realizing that all TVs have their flaws in some area or another. I've compared a lot of sets and I can say with confidence, there simply is no perfect television on the market, and the larger TV, the more magnified the flaws. I have compared the LG 60PM6700 to other 60\" televisions I've owned, and to other's I have not owned, and can safely say this TV blows the others away; especially for the money. I originally purchased the television for $1,499 and since then Amazon has lowered the price to $1,299 I called customer service and they promptly refunded me the difference. Trust me when I say, for the money, even at $1,499 you can't go wrong with this television. The picture quality, along with all its bells and whistles, blows away much more expensive TVs that make all sorts of grand claims.", "Date": "May 16, 2012"}, {"Title": "Updated review - Owned for nearly 1 year now", "Author": "Don", "ReviewID": "R1OOZLMQ4XIJOE", "Overall": "4.0", "Content": "I have to agree with one of the other reviewers.  I had the tv for about a week before the software asked to update.  I wish I had known before I allowed it to update, because the picture was pretty good up until that point (I hadn't done a lot of picture adjustments yet), but once the software updated, I got the same effects as the other reviewer.  Ghosting motion whenever anything moves somewhat quickly.  Soap opera effect on some channels - it seems to be more pronounced on certain channels.  The blurry motion, or \"ghosting\", happens all the time, no matter the quality of the input source, however the higher quality channels definitely look much better than the lower quality channels.  It looks like a funhouse mirror effect around a face or body whenever the motion is quick or they walk in front of a fence or other object that has a criss-cross pattern.  I too contacted LG via email and a phone call.  They said they were aware of the problem caused by the firmware update & their engineers are working on fixing it.  However, they made it sound like it would be done in a couple of days.  It's been just over a month, and no updates yet.  I'm a bit frustrated because, as it is, the tv is worse than my cheap 40\" Dynex LCD flat-screen with a 60hz refresh rate, and I bought the plasma thinking that with the 600hz refresh rate, I would never have to see any blurred motion again.I have since made several, and I mean several, adjustments to the settings to try and minimize the problem.  So far, the best I've found is with the Noise Reduction set to \"high\", and the TruMotion set on \"user\" and the effect all the way up to 10.  This doesn't always seem to be the best set-up, but overall, it did help.  I still play with the settings when I get irritated with the ghosting, but it pretty much just frustrates me more.I didn't return the tv, because I am holding out hope that LG will get the problem fixed soon, and because I put another $100 into 2 more pairs of 3D glasses (got 2 pairs free) that I didn't want to have to return.  If LG does get the software problem fixed, I would definitely give the tv 5 stars.  The problem is, how long will that take?On a side note, the 2D to 3D conversion is a pretty cool function to have.  It makes any show you want into a 3D picture.  As I don't have a 3D Blu Ray player yet, I can't compare to what a real 3D movie would look like, but for now, it's a pretty cool option on the tv.One other negative - no Amazon Instant Video in the internet apps.  The LG representative replied via email that he would put in a \"request to the factory\" to let them know that I had asked that this app be added, but who knows how far that will actually go.  I have a Roku box I can use for access to Amazon content, but it would be really nice not to have to plug it into this tv just to watch my Amazon movies, since I already have the Roku hooked to a different tv.UPDATE 7-28-2012A couple of days ago I finally found a new firmware update available.  I downloaded the newest firmware, and voila, the ghosting is gone...so is the soap opera effect.  I have now given the tv 5 stars, as it really does have a beautiful picture.  I thought about giving it 4 stars for not having Amazon Instant Video as part of the internet apps, and because it took so long for LG to update the firmware, but I bought the tv knowing that the Amazon content wasn't there.  Just remember to go back into your picture settings and turn off (or down) the Noise Reduction and turn off the TruMotion controls.  This will now make your picture look much better during scenes with fast motion.P.S.  Only a few days before this update came through, I found that I could set the tv on the \"game\" setting, and this took away most of the problems described above.  Too bad I wasn't smart enough to try this way earlier - I had done just about everything else.UPDATE 2-9-2013The tv still has a beautiful picture, and I like it a lot, but a few months ago, the picture started to get \"jerky\" when watching anything through the tv's Netflix app.  I wrote an email to LG, but got their standard \"sorry about your problem\" non-answer and asked that I call customer service for more help.  Since I also have Netflix through my blu-ray player, I just stopped using the tv's app for a while.  In December, I decided to check it out again, and the tv's Netflix app was still doing the same thing - picture would get very jerky after only a few minutes, and then it would come and go.  I called their customer service, and they had me go into the tv menu and reset the apps using the \"Initialization of Premium\" menu choice.  This didn't help.  They told me if this didn't work to call back, and I'd probably need to have a technician look at it.  I only have a couple months of warranty left, but I'm not sure I want someone to tear my tv apart for this, so I haven't yet called back.  Although it does bug me that it doesn't work properly, I feel like it has to be a software problem, not the wi-fi module, because it seems to work fine with the other apps I've tried.  For this reason, I've dropped the tv down to 4 stars now.  I still may call for service, but I haven't decided yet.", "Date": "June 6, 2012"}, {"Title": "plasma vs LCD", "Author": "Jeffrey Liu", "ReviewID": "R2Y0Y14P8HGW8S", "Overall": "5.0", "Content": "I was just a regular Joe looking for a good deal for a new 3D TV on line.  The brand did not matter to me as much.  My biggest struggle was trying to decide between Plasma vs LCD/LED and active 3D vs passive 3D.  I am not in the gaming.  I just wanna get a great TV so I can enjoy it after long hours of work.  I finally picked this Plasma TV with a newer version of the active shutter goggles.  So far, it has been a week and I love it.  I think I have made the right decision.  This Plasma TV still gives me the great quality of TV in 3D or 2D.  The goggles are very light weight.  The smart TV features are cool and nice.  This TV truly delivers as described on Amazon.  The only complaint I have about this TV is that its WiFi is weak.  I am not sure if it is the problem from the TV or from my wireless connection.  The WiFi still delivers what it is supposed to 95% of the time.  I think it is still not too bad for a \"smart TV\".  I would recommend this product to anyone.", "Date": "April 6, 2012"}, {"Title": "Great tv...until the firmware was updated", "Author": "Shoes", "ReviewID": "R2AEZWEYUAKONM", "Overall": "2.0", "Content": "This tv seemed to be everyting i wanted in a bigscreen, good picture, access to the internet, I was enjoying it. The 3d was no big deal and this tv DOES NOT come with the smart remote, but thats not why i bought it.Then it asked if i wanted to update the firmware, it did this automaticaly over the built in wifi connection, now the picture is much worse, HD seems ok for the most part, except now im seeing ghosting, but standard definition through HBO, Showtime, what have you, is terible now, i can only describe it as the same kind of resolution you get from one of those cheesy daytime soap operas, also see heavy ghosting on any fast moving images, as if you were watching it thru water is how i would describe it. Seeing heavy digital tiling that was not there before the update. I attempted every settings change i could try, unsucesfully, I did the online chat with lg and of course they denied this was even possible.Not sure what to do at this point, guess its going back. If anybody has any advice i'd be glad to hear it.*******UPDATE***************Apparently there is a problem with the latest fware update on lg tv's.Its being referd to as the \"soap opera effect\"Described here, line 64:[...]", "Date": "May 30, 2012"}, {"Title": "I'm very happy overall with this TV", "Author": "Coffee Lover", "ReviewID": "RSI69BLI5V08D", "Overall": "4.0", "Content": "We finally had to retire our rear projection big screen and so began the search for a new TV.  I looked at LED and Plasma as well as LCD and even projection but ultimately decided on Plasma for a couple reasons.  First, the colors look better to my family on the Plasma.  The LED almost looked artificial and although we liked the brightness of the LED it just didn't look as natural as the Plasma.  Second, we watch a lot of sports and the 600hz refresh on Plasma just couldn't be beat.  We looked at a lot of LED display TVs in different stores but really liked the smooth motion of the Plasma the best.We have a pretty light room and that can be a problem with the darker Plasma TV, we end up pulling the blinds to watch during the day but that's not a big deal to us.  I've noticed pixelation a number of times and haven't been happy about that at all.  I almost returned the TV the first week we had it because of this.  I ended up giving it some time and don't seem to notice it very often anymore.  I don't know if I'm getting used to it or it was just the shows I was watching.The sound is an issue of course, there's no way to put decent speakers in such a thin frame.  We added an LG soundbar a couple of weeks ago and now love the sound.  Just a tip, the soundbar we bought has Bluetooth which is an awesome feature for streaming music from our iPhones!I'm very happy with the picture quality of this set and the options and features are amazing.  I could spend a couple hours just playing with settings and options and probably not learn everything it can do.I recommend this TV especially for the price and features.  The picture is flawless and it works great with our Directv remote.", "Date": "October 18, 2012"}, {"Title": "Very pleased except for initial problem.", "Author": "Grim Reaper", "ReviewID": "R2K8C0G34Y4317", "Overall": "4.0", "Content": "I bought the LG 50PM6700 around the middle of April 2013.After about 2 hours of use, the TV let out an unbearable very high-pitched squeel and shut down.  I unplugged it and plugged it back in after about 5 minutes and everything was normal for about 10 minutes then, again, the same problem occurred.  I repeated unplugging and replugging and viewing and the same problem occurred after about 5 minutes.  I repeated the previous procedure and, when the problem recurred, instead of unplugging, I lightly smacked the back of the TV where I heard the squeel most intensely and, voila!, the squeel stopped and the picture came back on.  After a few hours of watching, the problem occurred again which I remedied with the same \"whack in the back\".  I also blew some compressed air into the small holes in the back where I heard the squeel coming from.  Since then, the TV has worked perfectly.  I don't know what caused the initial problem but it seems to have disappeard.Other than the initial problem, I am very pleased with the TV.  It has a very good picture and the Smart TV features are very useful.  The only criticism I have is that I had to buy 3D glasses separately which cost me $100 for two pair that should have come with the TV.Edit 1:I've found that other active 3D shutter type glasses, the Samsung SSG-5100GB which sell for $19 each on Amazon.com, work with the LG PM6700 series 3D HDTV. Too bad for me that I found out about them after I bought the LG AG-S350 glasses at $50 each.Edit 2:The PM6700 can be used with a Logitech K400r wireless keyboard which has an integrated/built-in trackpad.  It costs a lot less than the retail price of the LG \"magic wand\" which I have (I was given one for free so the keyboard actuall cost me more) and is much more useful.  Just plug the RF transceiver that comes with the keyboard into the PM6700 and turn the keyboard on and it works.Edit 3:It's been about a month since I bought the 50PM6700 and, subsequent to its initial problem that I fixed by giving it a whack on the back, it has worked perfectly and I am so pleased with it that I bought a 60PM6700 too even though it is a discontinued model because it has some features that the newer model doesn't. I also got the relatively inexpensive Samsung SSG-4100GB 3D glasses which work perfectly.  The 50PM6700 is in the bedroom and the 60PM6700 is in the living room.", "Date": "April 24, 2013"}, {"Title": "Love my LG 60pm6700 plasma tv", "Author": "joey t", "ReviewID": "R2A7ID6M93RX3D", "Overall": "5.0", "Content": "Received the tv Friday, April 6th, 2012Did a lot of reviewing prior to my purchase, read many comments about led and plasma tvs andvisited 4 different stores, some on more than one occasion. I picked the plasma because I like watching sports and the 600hz does the job for motion. Also, the LG 60\" pm6700 offersthe best picture and the most options for the money.Purchased the tv from Amazon, because they have the best overall price, extended warranty and I totally trust their shipping.From the shipping to the clear picture quality, to the sound, to all of the many options that this tv has to offer, I could not be happier.", "Date": "April 11, 2012"}, {"Title": "Problem after Problem", "Author": "Mike S", "ReviewID": "R16SA1O1PUOTIZ", "Overall": "1.0", "Content": "This is a review of the TV, not Amazon.  I purchased from a brick & mortar store. After (10) weeks, the glasses won't sync with the TV anymore. We keep getting popup boxes saying the Lan connection is disconnected when it's not. (hardwired instead of wireless for speed) Netflix consistently tells me it can't play the current title. (my other smart TV and set top box have no problems) After contacting lg technical support, a rep, whom I could barely understand, informed me it was the glasses, not the TV. I explained that I was having the same issue with all three pair of glasses. He also informed me that this was a Netflix issue, not a TV issue. They gave me the contact information of the only repair vendor in the state to contact. I contacted the vendor, and they said all these issues are caused by the same board. They said they could only come between 10-2 on Wednesdays. If I have to work, sorry. They will also have to pick it up and bring it back 1-2 weeks later when it's repaired. I've never had issues like this with Sony, Samsung, or Hitachi.Update:  Repair vendor came out, and replaced the board that controlled all these issues.  I tested the TV before he left, and It worked fine.  One week later, and the TV will not pair with the glasses again.  Also, the speaker is now crackling.  What Next??", "Date": "January 21, 2013"}, {"Title": "I like it; met my expectations", "Author": "jalesv", "ReviewID": "R3O3AOIMNNEDMX", "Overall": "4.0", "Content": "This was my first 3D TV, I really really like it.  I got the AG-S350 glasses, and with a 3D blu-ray, it's just great.  I picked up some 3D ocean movie, and the dolphins were swimming in my living room.  There's an eel sceen that makes you throw your hands up because you think you're going to kiss the eel.  A word of caution, I forgot that my receiver needs to play nice with the 3D signal and it doesn't!  So at first I wasn't getting a real 3D picture, just the up-convert 2D to 3D.  You'll know if that happens because 2D->3D is neat, but not like dolphins swimming in your living room.  Regarding fine picture quality, especially for fast action, all my comments are based on an out-of-the-box setup.  I have NOT updated the firmware, and I'll update this post with any differences when I do.  I've noticed two problems.  There is some judder in \"Game\" picture mode ... which if I understand it correctly, is that a fast moving image will tend to jump back and forth ever so slightly, to make it a bit blurry.  This didn't happen in the other modes (Standard, Vivid, Cinema, etc.).  Unfortunately, something else happened.  When there was a sharp constrast in color, like in the movie Brave, around 5 minutes, 50 seconds, Brave's red hair sharply contrasts with the gray background.  And as the screen pans around her head, there is a noticeable blur that occurs around the edge of her hair (where the gray meets the red) ... in Standard, Vivid, and Cinema picture modes (I didn't test all of the others).  However, in Game mode, this doesn't happen.  It was a bit distracting watching Spider man.  So I need to find some time to figure this out - hopefully a firmware upgrade will fix this, because that's the only thing keeping it from 5 stars.  I'm still really enjoying it.", "Date": "December 10, 2012"}, {"Title": "Great Value", "Author": "Charles J. Ferraris \"video nut\"", "ReviewID": "R2E7PLPT10EAQQ", "Overall": "5.0", "Content": "I've had this 50PM6700 for about 8 months, and although it's not my primary TV, this is my movie TV in my TV room.  Originally, I had a 47\" LG LCD in my TV room and I was going to purchase an additional set for the bedroom, but getting such a great deal on this, I moved this into my TV room and the other in the bedroom.  When I watch it, I watch it for marathons and will have it on for several hours every day on weekends.  Beautiful picture, and didn't go through the ghosting that some people talked about (I think I skipped the first update and went directly to the second firmware update). I am using this with a LG 3D BluRay player and a Samsung Sound Bar. Just ordered the 3D glasses and haven't used them yet. I am going to try them later today.  So far, I haven't found anything I haven't liked about it, however, I do need to black out a window (which I was going to do anyway) in front of the TV as it does let light bounce off the screen during the brightest part of the day.  My only complaint is that if you are going to tout the virtues of the magic remote and the 3D, the remote and one pair of glasses should have been bundled with them.  Charge an extra $50 for the TV initally, and if someone is impressed with the 3D, they'll buy more for the whole family.All in all, GREAT TV, GREAT value!!", "Date": "September 15, 2012"}, {"Title": "1st Night With This TV. Pretty Good.", "Author": "Dustin Wood", "ReviewID": "R1CBIXJXAW6SS1", "Overall": "4.0", "Content": "This is my first impression and thoughts about the TV for the first night. Its a pretty decent TV.I came from a 2005 Samsung 50 inch DLP. Starting off, I wish I would have just fixed my DLP instead. This 60 inch LG plasma seemed to have some ghosting, the soap opera effect, and would jitter for a split second. Not off to a goo start. This was from watching about 20 minutes of Water for Elephants on HBO through The Dish.But figured, my PS3 would give me a better idea to how the TV works. First off, I played a kick game of NBA Jam On Fire, and it looked great. Good picture, good color (still with default settings), and no blur or jittering. After that, I threw in a Blu-Ray movie. And here's where I started to notice the Soap Opera effect. It was driving me nuts. The actors looked like they were terrible actors. Its amazing how picture quality can make such a thing happen. Even though, I never experienced such a thing with my DLP.So since I wasn't really paying much attention to the movie, I started playing with the settings to see if I could fix it. And I now know that the soap opera effect is caused by the TV being so sharp. It looks too good. Because by bumping down the sharpness from 90% down to 10%, the movie started looking like a movie, and the actors were good again. So weird how that happens.The other thing that I noticed, is that there was a slight delay of picture from sound. The video was a little behind the sound. I know this is because of the TV because I never had the problem before, and the TV is the only thing thats changed. I have a Yamaha receiver with a Polk 7.1 setup. I'm pretty sure I can get into the settings to change the delay of sound in the receiver. I hope so.Like others have said, it doesn't come with the Magic Remote. It does come with a regular remote. Which I've tried out the Magic Remote in a Brick and Mortar store, and I hated it. It was like the Wii, and I don't care to use a controller like that. Give me buttons. But what I did find out, and like much better is, you can download the magic remote app for your iPad, and use it like a mouse. Much easier than pointing the remote at the screen and waving it around.Also this TV does not come with any 3D glasses. If you're like me, you've been looking at a lot of TV's, and all the specs and accessories get mixed up. I could have sworn that this TV came with 6 pairs. It does not. But as of ordering, and writing this review, Amazon has an offer to give you 2 free pairs of Active glasses. Make sure you add those to your cart when you order the TV, or you won't get them.But thats my first impression of the TV so far. Will update later as I know more.*UPDATE 9-17-12I've spend the weekend in front of this TV. And I'm enjoying it more. I really don't know where the ghosting and soap opera effect went. I actually tried to get it back to do some tests, but I actually haven't noticed it lately.One of the things that I didn't really notice until I thought about it, was that you can view this TV at pretty much any angle. The screen stays just as bright. when you're off to the side, and you can only see a sliver of the screen, it almost looks too fake. Like how in movies, the screens are always bright since they add them later in post.Really glad I didn't purchase the extra magic remote. And even if it did come with it, I'd probably ebay it. The iPad app works exactly like how I'd want to use a remote like that.The one thing that bothers me is the ARC feature. It works. But when I start up my TV, surround receiver, and The Dish, the TV will override the input that the receiver needs to be on. I have my Harmony One to turn on all devices, and set the input to HDMI 4, which is what the Dish is on. But After the TV warms up, it will put the input on AV4, which is the channel input on the receiver that the ARC is set up on. I'm sure there's a way to tell it to not auto-tune, but I haven't found it yet.3D is ok on it. The glasses that work with it are CHEAP. Super flimsy, and they don't work well with people like me who wear glasses. The first movie I watched on it, I decided to not wear my glasses. And the quality of the image was bothering me. So I put my glasses back on, with the 3D glasses over top, and the picture was much better. But I had to hold my head back, just to keep them on my face. Glad I was alone. Also, there is a shutter noise that comes from the glasses. Its only noticeable during quite times, but it kind of annoying. In my opinion, the Nvidia Nvision glasses are much higher quality, and fit much better. If only those would work with this TV. For the price of the glasses, free is good, but I wouldn't buy them for $50. Maybe $20.", "Date": "September 14, 2012"}, {"Title": "Beautiful TV....except for the soap opera effect. UPDATE - SOE resolved", "Author": "bdog", "ReviewID": "R3EL4QL1C6O4NB", "Overall": "5.0", "Content": "As many have already described, this is a beautiful TV. The only beef that I have is that the Soap Opera Effect makes movies completely unwatchable!! Many have attributed this to the tru-motion feature being stuck on in all video modes except game mode. If you have observed this problem, can you please create your own review of this TV or comment on this post!Update 2012-07-27A few days ago LG released a firmware update (04.00.12) that has resolved the 'stuck-on' tru-motion issue. The soap opera effect can now be turned on and off as desired using this video option. Since my only issue has been resolved, I've increased my rating to 5 stars. Thanks to LG for listening to your customers complaints and correcting this issue!", "Date": "July 18, 2012"}, {"Title": "Great TV!", "Author": "t1meband1t", "ReviewID": "R1QOZZ76N09ZU4", "Overall": "3.0", "Content": "I bought 2 new tv's...A Vizio 42\" smart led 3d tv(120hz) and a LG 60\" smart plasma (640hz)TV (PM6700).  The picture on the LG plasma is much better in my opinion.  The picture seems more vivid and realistic and the action is extremely smooth.  The picture on my Vizio is also very good but the action is not nearly as smooth. The 3d on both tv's is also very good.  Overall I would buy a plasma over a led.  Plasma's cost less and have a better picture in my opinion.  They do cost a little more to operate.  My 60\" plasma is rated at $35 a year and my 42\" led is rated at $15 a year.  I wouldn't make my choice on power usage in either case. Before you buy check out forums and listen to what people say about both types.  Hope this helps you.This is an update on the LG Plasma PM6700.  The only complaint that I have is that the TV's software makes sure you can only use an LG-AN=VC500 SKYPE camera.  My son bought as a very good Logitech HD Skype camera because it worked well on his Samsung smart TV and it was advertised to work with all smart TV's.  Well it works well as far as answering the call and turning on the TV.  What DOES NOT WORK is it won't let you change inputs unless you unplug the camera.  I'm very disappointed in LG for forcing customers to buy THEIR Skype camera at 2 to 3 times the cost. Take this into consideration when pricing TV's that you will be paying over $100 more for LG's camera.", "Date": "October 10, 2012"}, {"Title": "Great picture, great price", "Author": "Decker", "ReviewID": "R2I4H9L5N15Q4O", "Overall": "5.0", "Content": "Update: A new software upgrade came out a little more than a month ago (Aug 2012), and it solved the \"soap opera\" effect problem.  So now I would say the TV is excellent, definitely hard to beat for the price.  Unless you have a big problem with reflections in your TV screen, you can't go wrong with the fantastic picture from this one.I've had this TV (60pm6700) for about 1 week now.  At first, it seemed great -- the picture is really great, the screen is huge, the bezel is small, and it's overall an attractive TV.  However, as soon as I turned it on, it said that it needed a Software Update.  I put that off for a little while, but eventually (to my dismay now), I did update the software.  Since then, I can't really watch it.  It still works, but LG's \"TruMotion\" is permanently on, as there is an apparent bug in the latest version of the software (version 30.00.29).  Even if you set TruMotion to off in the Picture Options menu, it is still, very noticeably, ON.  What this means is that every show, including movies shot on Film, appear to be bad home video (or like a Soap Opera).  For me, the effect is so strong and off-putting, that I am completely taken out of the movie and cannot enjoy it.  This is true whether watching programs from Satellite TV or from a Blu-Ray disc.  Ugh.  If you google a bit, you will find that many others have encountered the same issue.  Theoretically, LG might provide another update that will fix the problem, but I wouldn't hold my breath.  On their own Q&A; forums, the question has been asked several times, and the LG representative doesn't even acknowledge that it's a problem.  Until they fix that problem, I can't recommend this TV.  Which is too bad, because it's otherwise a fine tv with a good picture.  I do feel let down by LG.  I work at a company that makes computer hardware, firmware, and software, and I know we would never let such an issue stand without telling our customers exactly what we were going to do about it.  At the very least, they should be able to provide the previous version of software so that owners could revert to that.  I will update this review if/when they release a new version of the software that fixes the problem.Update:I found that if you choose \"Game\" mode under Picture adjustments, it will allow TruMotion to truly be off.  Game mode does change the color temperature to a very cool color, so the colors for movies aren't quite right, but at least it makes the TV watchable again!", "Date": "July 13, 2012"}, {"Title": "This Plasma has alot of problems", "Author": "C. Peterson", "ReviewID": "RFAL8YXZV9XQK", "Overall": "5.0", "Content": "I purchased this HDTV around 4 months ago, worked fine for a while. And one day it had no Picture nor Sound, I called LG, LG stated that the TV needed to be serviced and gave me the number to take it to a local shop for repair. 1 month later it dies again!!!!!!! Same issue as last time.UPDATE!!!!11/30/2012I have sent the HDTV off for repair again, they now state that the total panel is a lemon, and therefore it needs to be replaced, panel as in the screen is shortening out other components.While so far I have not had to pay for any warranty repairs, I'm concerned about when the warranty is over.UPDATE!!!!12/10/2012So while going 2-3 weeks without my HDTV, the repair center says that the HDTV is totally shot, each time they add a new component the part only gets burned out during the testing process.Now LG has offered to replace the entire HDTV, shipping me a new one by FEDEX.UPDATE!!!!So far I have received my new LG 50inch HDTV from LG, working good so far.", "Date": "June 4, 2012"}, {"Title": "LG 60 inch - 3 D Smart TV...", "Author": "B. Levy \"Bev's  opinion\"", "ReviewID": "R2XU1FZPC1CLID", "Overall": "5.0", "Content": "This TV is Amazing...all the features including the 3D and internet options are terrific! I can sit on my couch watch a program and read my email on my TV at the same time. I recommend this TV 100%!!", "Date": "November 24, 2012"}, {"Title": "Exceeded My Expectations", "Author": "Lin", "ReviewID": "R3PK9O2IQUO3LQ", "Overall": "5.0", "Content": "I have owned this TV for just over a month now and I must say that I am very happy that I decided to purchase it.  I spent a couple months searching for a great deal for LED TVs and didn't even consider Plasmas.  I have heard a lot of negativity regarding plasma televisions.I ran into this TV on Amazon and was very impressed by its features.  The reviews were for the most part, very positive.  I did some more research and found that the newer plasma models have surpassed all the issues that they used to have.  I decided to purchase the TV directly from Amazon and figured worst case scenario, if I absolutely hated it, I'd send it back, no questions asked.  (I love Amazon's customer service).I scheduled the arrival date/time and the delivery guys were right on time!  A friend of mine helped me mount this and it was definitely heavier than my old 46\" Sony LCD.  Although it's quite slim, it's still pretty heavy!  Once mounted and powered up, this television is absolutely beautiful.  Words cannot describe how sharp this TV looks.The picture quality is awesome.  This TV came with two free 3D glasses and I didn't buy it for the 3D feature but it does look pretty cool.  I'm not a huge 3D fan.  There are a lot of customization options but I didn't have to mess too much with the picture as it already looked good to me.  The screen is quite reflective though but I have black-out curtains in my living room and never have an issue watching TV during the daytime.  It does reflect light from my kitchen though.  But still not a dealbreaker.The sound is average but I purchased a Samsung soundbar from Amazon with the TV.  I have it connected via HDMI (ARC) and it automatically powers on/off with the TV.  I love that control and everything sounds 100x better with the soundbar.I am a bit disappointed by the Apps features on the TV.  It comes with Netflix, Facebook, etc, which I don't subscribe to Netflix and a few others that I don't really care for.  The apps that I really wanted, Amazon Video and Pandora are not available.  I called the LG customer service and they said that there's no talk of bringing these apps to the LG market.  I'm not sure why because many people use these apps.  However, I have the Amazon app on my PS3 and that has solved that problem but still no Pandora app.I also downloaded the LG Magic app for the iPhone and love it very much!  It allows you to control the volume, access apps and my favorite feature is the \"Capture Screen\" which will take a screen shot of anything that you're watching and save it to your Camera Roll.  I think that's a very handy feature and use it quite often.  Again, not a mandatory app but fun to have.  I also use it to mess with people that are watching my TV when I'm in a different room.  Since it's WiFi controlled, I can still control the television from anywhere that I have WiFi range ;)In conclusion, I am very glad that I bought this TV.  It has every feature that I'm looking for and more.  I was very hesitant about purchasing a Plasma television as I was only searching for LED's but I'm glad I decided to get this one.  This TV has definitely exceeded my expectations.  I highly recommend it.Happy Shopping!", "Date": "September 12, 2012"}, {"Title": "Initially Disappointed (edited 9/10/12)", "Author": "Steve L.", "ReviewID": "R36JOM66HSHA08", "Overall": "4.0", "Content": "Pros: Beautiful picture in lit areas of the screen. Four hdmi ports. Unlimited viewing angle.Cons: Deep blacks make mirror like areas on the screen. Reflections are horrible even in low light. Viewing during daylight hours is annoying because of reflections. TV has a hard time loading most web pages and can't display many YouTube videos.8/31/12 - I just got the TV set up yesterday so these are my initial, out of the box impressions. First off, many of my issues are with the nature of plasma screens vs LCD. If I knew then what I know now I would have bought an LCD. Also it's my own fault for not going to see this model live in a store. I did extensive research online and read tons of reviews but since this unit wasn't at any of my local retailers I didn't see it in person. I also haven't had a lot of time to trouble shoot the settings but I have turned off the energy saving features and cranked up the brightness. If I find a combination that fixes my issues I will revise this review.I have the TV set up so that it doesn't face any windows and the windows that are in the room have blinds on them. I know plasma screens are more reflective then LCD but since this model was reviewed as being less reflective then other plasma sets I thought I would be alright. Unfortunately ANY light in the room will cause a very clear reflection in any dark areas of the screen. If you turn on a lamp that is in view of the TV it is clearly seen even lit areas of the screen. From my initial impressions it appears plasma screens are only suitable for dark rooms with little to no ambient light.Shows that fill the whole screen with light all the time, like kid's cartoons and sitcoms, look great. Movies with mood lighting or night time scenes can be annoying.So far the only issue I have with this unit specifically is the built in internet functions seem weak. Please note: I didn't expect the TV to work like a PC, but I did expect some basic functions that were useable.The TV linked to my wireless network easily. When browsing the web I found the TV loaded many web pages very slowly and could not stream video from them. Please note: I also have laptops that are connected to the wireless network and they have no problem with the sites and video I tied to view on the TV. I actually hooked one of them up to the TV using the many hdmi ports to browse the web and stream video and it worked wonderfully.The built in YouTube function didn't allow me to login with my YouTube account and when I just browsed to some of my favorite videos, including music videos, the TV put out a message saying they aren't available for viewing. The wireless laptop loads and streams the same videos with no problems.9/10/12 Update - After watching the TV for a few weeks I am less sensitive to the reflections. They are still there, I've just grow used to them and don't see them anymore. That being said I also make a point of darkening the room as much as possible and turn off all lights in view of the TV.The internet functions are still fairly week. I have found a few more YouTube videos that can be seen on the TV but I still find many music videos that can't. Also, trying to search using the remote is difficult.", "Date": "August 31, 2012"}, {"Title": "Very nice thus far, the definition of art in a TV.", "Author": "Mmanohio", "ReviewID": "R3FGBBXC8IEBWX", "Overall": "4.0", "Content": "While I am not a professional in the field nor do I claim to know everything on TVs, please take my review lightly, but accurate. I was very set originally on a Samsung unit (having owned 2 of them in the past five years) and LED technologies or even LCD still, yet decided to go with a plasma technology and different brand with LG. My major contributing factor was price and size, to get similar in different technology it would cost a bit more. Plus I don't think LED is 100% where it will be eventually as a technology. Having recently decided to try the brand of LG, buying a washer dryer combo and a vacuum recently I am very impressed thus far and have not had to deal with support yet on anything with them, so I can't accurately rate that. I am happy thus far with this unit!The TV alone is very powerful, bright and even with ECO mode it seems to adjust perfectly to my open style living room area, lots of windows, light (high ceiling and good size room), I was impressed to see it save energy and look good still. Really the look of the unit off is the definition of beauty, it's art! While this TV isn't the thinnest, it falls somewhere between being medium thin and low profile, I have seen some LED units almost paper thick in all comparison. The TV is very heavy though, so get help to put on base and if moving or mounting.I have mine hooked up to HD cable provider and the HD is very sharp and such an improvement over my old 40\" or even 32\" I was using temporarily in the room. I've tried out the Smart features with Netflix and Hulu and all seems to work great, found my old wireless router we have setup here with cable Internet and it works very quick and no connection problems what so ever! I was prepared to have to run an Ethernet cable run for Internet, but now it seems I will not have to. I am also very happy with the basic remote, although I was hoping to get the Magic remote with the unit, but this model doesn't come with it, so that's the only con so far.Do note that the unit gets fairly warm, had it on for about an hour and it's hot to touch around top area in back. Make sure you use the stand or keep space between it and any walls, although it does seem to move the heat towards upper corners, which is great because that means it's venting properly! While describing the base, although I plan to eventually wall mount this sucker ... the stand is very clean, sleek looking, and stable... both functional and good form.Now I am just following the price as I've seen it drop at some sites in the past couple days. Not sure what Amazon's policy is but will be following up on that. I will also review later hopefully to update this with any additional details. So far so good though!", "Date": "August 27, 2012"}, {"Title": "Awesome TV", "Author": "Gibson67v", "ReviewID": "R3CJE0K77V2NMU", "Overall": "5.0", "Content": "Great TV! One of the things that I was turned off about the TV was the fact that the glasses were Active and that only LG glasses work with the TV. It turns out that Passive glasses don't look nearly as clear and Samsung Glasses also work with this TV. The LG Glasses are a bit heavy and only last about 4 hours where as the Samsung glasses last 40 hours (1 minute quick charge for 2 hours) and aren't as heavy and are pretty comfortable. The TV is HUGE!!! We had a 47\" for the couple of years... now it's the bedroom TV, but 60\" is HUGE!!! 3D movies look amazing on this TV (I'm assuming due to the size) it's just like being in the theatre!", "Date": "October 9, 2012"}, {"Title": "LG Plasma", "Author": "Internet Consumer \"Ken\"", "ReviewID": "R1801ZXYIA90XV", "Overall": "4.0", "Content": "Great picture and custom video tuning capability a helpful feature. Be aware this T.V. will not output 5.1 Dolby. Using direct audio from your cable/dish box will give you SERIOUS lip-sync issues. If your reciever does not have audio delay tuning, video follows audio by at least 200 m.s. Be forewarned!", "Date": "October 8, 2012"}, {"Title": "Warnings should come with this TV", "Author": "Leonard Dijoseph \"bratticus\"", "ReviewID": "R3GTD16GLAZ4PC", "Overall": "5.0", "Content": "I have to say this is a nice television. I bought it and added the LG 3D blu ray player and I admit the 3D is awesome. Even the 2D to 3D is nice and the regular HD channels are like looking out your window for some shows.BE AWARE THAT THIS MODEL DOES NOT COME WITH 3D GLASSES!! AND THEY ARE ACTIVE 3D NOT THE PASSIVE TYPE THAT YOU GET IN THE THEATERS. There are similar models that come with the magic remote and glasses but they are more expensive and the TV will have a dual core processor. BUT NOT THIS ONE!The other bad thing is \"made only for this model\" accessories. There is only one type of \"Active\" glasses that will work and that is the 3D AG-S350 Shutter Glasses which will basically cost you $50 each. You can find generic but they will cost $80 each. :-OThe magic remote, AN-MR300, is also extra at $80 each. You will see variations of the remote, AN-MR3005, AN-MR300Q, etc., with some being much cheaper but LG says they are only for specific television sets and won't work with this model.So aside from the added extras this will cost you it is a fantastic television but you may want to spend a little more for the model that comes with the accessories.", "Date": "April 25, 2013"}, {"Title": "NO complaints, beautiful picture", "Author": "TShopperOnline", "ReviewID": "R2YZ4HTN76KDU4", "Overall": "5.0", "Content": "Easy to set up, I am NOT tech savy and this TV does it all for you. LOVE IT. The shipper they used even set everything up for me. I've had the tv for a few months now with no issues. LOVE the smart capabilities, Netflix works great and Vudu is perfect to rent right in the comfort of my living room! and the price is a steal for this quality of SmartTV.", "Date": "April 23, 2013"}, {"Title": "Excellent TV for the money", "Author": "Brad801", "ReviewID": "R1R4E5L5NLE7QK", "Overall": "5.0", "Content": "I bought this TV sight unseen and I'd say it is one of my better purchases. It may not have all the critical rave out there that you see for the Panasonics, but I would say that after turning off the dumb dynamic contrast setting, I was very happy with the picture. Vibrant colors, excellent deep blacks, lifelike appearance of skin colors, etc. I used Intel WiDi feature and after a bit of tweaking and trial-and-error, it works pretty well.  However, I don't use WiDi as much as I thought I would. I haven't bothered trying the 3D yet or most of the smart TV features, but it didn't cost much to get the smart features so why not.", "Date": "December 26, 2012"}, {"Title": "Good solid TV", "Author": "DangerDan", "ReviewID": "RA9TY6I6U1XAQ", "Overall": "5.0", "Content": "I purchased this TV to upgrade to a smart TV and I have been wanting to try 3D.I was getting tired of starting other devices to watch online content. This TV supports many popular video streamers, Netflix, Vudu, but not Amazon Video (which is the only downfall I found with this TV). LG supplies a nice selection of videos to try out the 3D as well as a 3D store for movies. The 3D movie selection is pretty small, for the most part Disney movies. They have a selection of videos, I would say most are store demo type of videos, so if you get 3D glasses with your TV you will be able to try it out without purchasing any 3D content. The glasses are lightweight and charge through USB to a proprietary connector on the glasses. The nose pad does get a little uncomfortable after awhile, but it is far from a deal breaker. If you understand that 3D content is limited, I would still suggest getting a 3D tv, it does add to movies and games.The TV was easy to setup up and the picture looks wonderful. I have yet to calibrate the set yet, but it still looks amazing. The interface (menus etc) on the tv are a little slower than I'd like but not slow enough you'll sit there waiting for a response. Update your firmware when you get it and fixes the Soap Opera effect (fast motion). I would definitely recommend this TV to anyone looking for a big TV that looks great.To note, there is a composite input, look in the manual it shows you where it is, it is part of one of the component inputs.", "Date": "October 1, 2012"}, {"Title": "Couldn't be Happier!", "Author": "Christopher J Thomas", "ReviewID": "RX036UJNE6DZW", "Overall": "5.0", "Content": "I have had this TV for exactly 6 days and I am so pleased with my purchase.  The picture quality - with the right content - is stunning.  3D, using a Sony PS3, is eye popping.  I've seen other 3D systems and I was not impressed.  This is honest to goodness actual 3D.  We purchased: IMAX: Grand Canyon Adventure: River at Risk [Blu-ray 3D] to test 3D and it's spectacular.  Now those guys at IMAX do know their cinematography, but WOW! We also have a copy of Rio in 3D and it is excellent as well.I can tell you that this TV, as with other 1080P TV's, you will see some of the 'soap opera effect'.  But that's just an ironic byproduct of having an excellent quality 1080P TV.  It's showing you the flaw's in your content over lighting a scene for lower resolution displays. It's really not that bad, but does take away from the movie experience when you notice it.The delivery service originally left a bad taste in my mouth.  The first TV came with the entire screen shattered and my heart broken.  Amazon was great about sending out another TV.  I requested that Amazon use a different carrier and they did.  The second carrier was excellent and knew what they were doing.  The first delivery driver actually laid the TV down on it's screen to install the base.  I think that's actually what cracked the screen.Others had complemented on the packaging, both TV's came to my house in the original factory box, unopened.  They white glove service opened and set the TV up for me.  If you get one that's not in a package, that's probably because the drivers opened the TV at their distribution center to make sure it wasn't broken.  Still, I wouldn't accept a TV that wasn't delivered in the box.The Smart TV features are cool, but since I have a PS3, most of that is duplicated.I've seen more expensive TV's in the box stores that claim to be better, but I can't see it - perhaps a video expert would.  All I know is I enjoy looking at the thing - you will too.  If you end up buying another TV for more money, I'm sure you'll have a good reason.  For me, this is more than I expected to get for $1299.  In my book that's a win.  If you've made it here, consider yourself lucky; stop shopping and buy this TV.  I promise, you won't be disappointed.I am looking forward to watching the Olympics in 3D via DirecTV.  Just found the 3D channels after googling for info about the Olympics.  Just AWESOME to watch the X-Games today in 3D!!!  LOVE THIS TV!!!", "Date": "July 26, 2012"}, {"Title": "DO NOT BUY THIS TV", "Author": "Patricia A Dunbar", "ReviewID": "R12Z76LNU24LSM", "Overall": "5.0", "Content": "I am updating my review 10/2013...this tv just completely quit...serviceman just said that it is not worth fixing...THANK GOODNESS I BOUGHT THE EXTENDED WARRANTY OTHERWISE I WOULD BE OUT OF EVERY PENNY I PAID FOR IT JUST 15 MONTHS AFTER PURCHASING!I just received my 50\" 3D tv this afternoon but I can not even begin to tell you how much I love this tv.  It does EVERYTHING I could ever want a tv to do and looks GREAT doing it!  I am not a very picky everything has to be perfect kind of person but again OMG, I can literally see blemishes in people's faces.  Now I just got this tv about 8 hours ago and it has so much that it can do that it is going to take me a little bit to figure it all out, honestly I wish it came with a dvd showing how to use everything.  It does have an user manual that is on the tv but doesn't go quite into as much detail and instructions that I would like but I will figure it all out.  Again I so HIGHLY RECOMMEND this tv!  If there were more than 5 stars I would give it more.  And you couldn't beat the price considering it came with 2 3D glasses and free delivery and setup.  I had been wanting a 50\" tv for a really long time and just couldn't pass this one up and I aM SOOOO glad that I didn't!  One complaint though is the remote control could be set up a little bit better, you control everything with what they call a \"wheel\" which isn't really a wheel and the up arrow is right below (and I do mean RIGHT BELOW) a button that changes everything so I am constantly hitting the wrong button losing everything I was working on....quite frustrating.Patricia", "Date": "June 30, 2012"}, {"Title": "Wonderful TV and satisfied buyer", "Author": "Karl Isaac", "ReviewID": "R2U73DTQWXO8UB", "Overall": "4.0", "Content": "I purchased the LG 50PM6700 in December 2012 after looking at other models and manufacturers.  The LG LM7600 model was my first choice due to cheaper 3D glasses.  Through research I discovered active 3D LCD provides better picture quality (full HD to each eye).  My final descision rested on price; my purchase was a deal for $899 which included two pairs of the active 3D glasses and an LCD was much cheaper than the LED.After unboxing, I was amazed at the screen size and the weight of the TV for a thin display.  The TV has many settings to adjust the sound, picture and the 3D. To me, the 3D works better in cinema option setting. The Pixar movie \"Brave\" looks fantastic in 3D on this set!Other reviews mention a lot of glare which is true.  Any TV screen will have glare especially those with large screens.  (This is just fact). My TV came with the standard remote, which I prefer.  I do not use the TV apps at all.  My big surprise was the TV can play video (.avi) directly from a USB 3.0 drive and also there is no s-video port (my cable box has composite ports).All in all, I am satisfied with my purchase. If you can afford a bigger screen, go for it!", "Date": "January 8, 2013"}, {"Title": "Get One.", "Author": "C. Walsh \"Chadillac\"", "ReviewID": "R232AOETJFG4HE", "Overall": "5.0", "Content": "Awesome Tv. So many features. Great contrast, and high quality picture when streaming. Better than I thought. Maybe have to get another...", "Date": "November 20, 2012"}, {"Title": "If you see my socks, send them back, because they have been blown-off!", "Author": "April Vawter \"Wilderness Photographer\"", "ReviewID": "RS0GZRIKM0Y16", "Overall": "5.0", "Content": "8-25-12  Quick update:  I have my sound system, Wii and peripherals hooked up, and now, my feet may be blown off!  I purchased a Sony 3D Blue Ray DVD player for the set, and although I still haven't watch anything in tru 3D, I've watched several pieces in 2D/3D conversion-mode.  I just finised watching an episode of Deadwood, one of the all-time great series, and believe me, what was gross ane pithy in the 1870s is doubly gross and pithy in 3D!This TV is incredible!!!  Those who think it has a \"soap opera\" picture just need to tinker with the picture menus.  I accidentally did something to kick it into that mode, and although, at first it freaked me out, I was able to easily reset it to my particular tastes, and being a photographer, I am picky, picky, picky!I just moved over the weekend and this TV replaced a Mitsubishi 65\" DLP 3D I purchased last year...two weeks before I watched The Cove.  After finding out about Mitsubishi's involvement in the dolphin slaughter, I have been embarassed to own it.  It is now in a loft where I do reading and computer work for my photography business...for the most part, out of view.The regular picture on this is very good for a Plasma, and after reading update reviews, I will not be upgrading the software!  What is wrong with a company that intentionally promotes software that degrades its performance???  LG had best reconsider that strategy!I haven't hooked up my home theater, a huge Kenwood, so the sound is tinny and cheap at this juncture.What is amazing is the 2D to 3D conversion!  I just watched this week's premier of Breaking Bad, streaming through Amazon, and while I haven't adjusted everything perfectly yet, it puts 3D in a whole new light for me.  I didn't watch anything in 3D on the Mitsubishi, partly because there is very little with decent production values and acting availably in the general 3D catalog, other than a few documentaries, Titanic and some Pixar stuff.  This gives me anything I want!  I can hardly wait to see Indiana Jones trying to outrun the boulder, or in the snake cavern!OK.  I'm sure the conversion isn't as dramatic as true 3D, but right now, I'm watching an episode of Dexter that makes my feel as if I could reach out and slap Masuka for being a perv!So far, I'm thrilled with the TV, and feel Karmically forgiven to some extent for having inadvertently subsidized animal cruelty.  I have it framed by two beautiful dragonfly Tiffany lamps I purchased at amazon.com, and my home theater and \"woman den\" will soon be perfect!", "Date": "July 17, 2012"}, {"Title": "Super TV", "Author": "David Ferraro", "ReviewID": "R2UWUDO61C5RM9", "Overall": "5.0", "Content": "I received my Tv before Christmas 2012. The 2d to 3d conversion barely worked at all, but for all prerecorded 3d movies, it was amazing. The screen was amazing. The picture is amazing. Everything about this Tv is amazing. Calrity, Ive been through two or three firmware updates now, and each one has gotten better and given the Tv more options under settings. Well, suddenly, today, Jan 24 2013 I had new 3d settings including a cinema setting and an extreme 3d mode for 2d to 3d conversion. And all I cam say is WOW AND FINALLY!!! Now the TV does everything it was meant to do and is capable of. No motion blur at all, just buy good cables. Great everything. This Tv blows me away!", "Date": "January 24, 2013"}, {"Title": "great tv", "Author": "andrea auman", "ReviewID": "R9PJUVQNR39SC", "Overall": "5.0", "Content": "I used amazon to buy. They have a delivery company bring it and they set up a time to deliver- it went well. Unboxed and hung on my wall and was impressed from the get go.  Picture is great I don't use the sound I have bose surround sound so no idea on speaker but the remote is easy to use and figure out.  I set everything up quickly and its nice there are 4 hdmi plugs for all my tech stuff.  Great tv great price and get delivery...", "Date": "February 4, 2013"}, {"Title": "Awesome tv", "Author": "F. Perrone", "ReviewID": "R2TNNW05NYDQM0", "Overall": "5.0", "Content": "This is a amazing tv , I was having trouble deciding on LCD or plasma . I did a lot of research and found that plasmas are faster cleaner and better quality overall . Most people don't know that Led tvs are still the same exact LCD tv as before just diffrent back light .....  LCDs even with the 240 motion still have blur due to there 5ms response time . Plasmas have a .04 ms which is basically none at all . I am a avid movie and gamer nut . They both look great , only thing which isn't bad is glare . I have a huge bay window and a side window letting in a lot of light . But even with that is tv blows away my Sony Bravia LCD tv . Don't waste money o. The magic remote . There are apps for IOS and android to controll the tv which is really cool. Hands down best buy for the money  , tv has it all and it's like being at the movies .", "Date": "October 20, 2012"}, {"Title": "love love love this tv", "Author": "Karen Hays", "ReviewID": "R1EJ3GV9JJ2Y9J", "Overall": "5.0", "Content": "i bought this tv on the internet which was a little scary to be honest.... great product just be aware when it gets delivered its a 3rd party contractor and i wasn't exactly impressed w/ the disorganization. The Tv is great and still enjoying it", "Date": "January 14, 2013"}, {"Title": "This is the Plasma you've been looking for!", "Author": "Dennis H", "ReviewID": "R2N2GEFGJ4SCZI", "Overall": "4.0", "Content": "I've had this set for a little over a month and have been very happy with it.  Before I purchased it I was a little concerned about the delivery process and that the TV may be damaged in transit as I've read in some reviews.  However, the delivery was excellent.  I selected a delivery date at the time of the order, on the day of the delivery the driver called to let us know he was coming. As the shipping instructions stated, the delivery person does not set up the TV (which I wasn't expecting anyway) but he did remove it from the box, plug it in and turn it on with the remote to show that it was working and undamaged.  He also carted off the box saving me the trouble.Setting up the TV stand was simple but it did take both me and the wife to lift it to the TV stand.  If you are placing it on a TV stand instead of wall mounting, I would highly recommend the TV safety straps (available on Amazon) to secure the TV to the stand you will place it on.  This gives peace of mind, especially if you have small kids around.Setting up the picture was straight forward as the set comes with a color calibration feature that works very well.  After I purchased the set I did see some reviews here and elsewhere that the firmware was causing the soap opera effect.  LG has since released a firmware update that fixes the problem and adds new functionality like Skype to the set.  One thing that took me a while to figure out was how to get the ARC feature to work.  After some research I found that the SimpLink feature must be turned on in addition to the ARC feature for it to work.  This wasn't clear in the manual.My one disappointment in this set was the Plex Server app and the DLNA streaming Apps in general. I have a large movie collection on my NAS server and was hoping that the Plex App would replace my aging WD Live Plus box. However,the Plex server app is very buggy and does not play all file formats and is nothing close to the Plex clients that are available for the PC and Tablets.  There in another LG DLNA app which works better than Plex but the controls for it are clunky on the remote and basic functions like rewind an fast forward jump too far ahead or back.  They need to refine the controls a bit more. So I guess I'll hold on to my WD Live box a little longer.  The Netflix app works great, the other apps are really just fluff.Also, if you have a brightly lit room you WILL get screen reflections that affect the picture.  The darker the room the better.I received 2 free pairs of 3D glasses with this set but I haven't really tested it out as I'm not that into 3D.  Overall, the picture is spectacular and I've been actually stunned more than a few times by the amazingly quality of the picture.  Hawaii 5 0 comes to mind, the HD scenes in that show are jaw dropping.  If you're looking for an excellent plasma set you can't go wrong with this one.Edit (02/24/13)The TV still performs beautifully.  LG has been great with updating the features with incremental firmware updates (I can now use the LG remote app to control the tv from my phone and tablet).  One interesting thing I noticed with this tv is that if the tv is OFF and we have a power outage or a brown out for a few seconds, the tv will turn itself on!  No fun when you have a brown out in the middle of the night while you're sleeping and the TV starts playing.  I plan to get a small UPS that I'll need to get for my connected HTPC anyway which should prevent this from happening.Update (03/29/13) - Trouble in ParadiseThe TV had been performing great...until a few weeks ago the TV suddenly started turning on and off every 5 seconds.  Called up LG and reported the issue and they sent out a tech a couple days later. Turns out the power supply had gone bad.  They fixed it and returned it a couple days later.  After delivering it the tech turned it on and all was well.  A couple hours later it started having the EXACT same problem...on and off every 5 seconds.  Called up the service center and LG and they picked it up again.  While the TV was being repaired I checked the outlets with a meter just to make sure everything was fine.  I have other equipment plugged into the same socket and have no issues.  TV got returned, turned it on,connected it ONLY to my DVD player all was well for an hour or so and then...on and off every 5 seconds...ARGH!  I was beyond frustrated!I called up the service center (by this time we were on a first name basis) and they said they changed every thing inside the TV, including the screen,and had no idea what was causing the problem.  So called up LG and, since the TV is still under warranty, they are sending me a replacement.  While the experience was very frustrating, LG and the Service center doing the repair was very professional in handling the issue.  So for now, as my replacement is being reprocessed, I will take off one star.  The TV up to this point has been terrific, Lets see how what happens when the replacement arrives.", "Date": "August 9, 2012"}, {"Title": "Great TV but recurring screen issues", "Author": "pc", "ReviewID": "RIRW7CM00585A", "Overall": "3.0", "Content": "It's a great TV - when it works. A bout 4 months after receiving it, a constant white pixel in the center of the screen made it's appearance. The display was replaced quickly, no charge. Today I turn on the TV and there's no screen whatsoever. No Home, Settings or otherwise display. Now I'm a bit worried about the life span of this TV. Luckily still under warranty. Will see how quickly they fix it now and let you know.", "Date": "November 3, 2013"}, {"Title": "Width question....", "Author": "paintcan", "ReviewID": "R1IMT9F56LYF1B", "Overall": "4.0", "Content": "50 inch & 60 inch sets are intermixed in these reviews. I'm not sure how much that matters but I expect it does to some degree.", "Date": "October 18, 2013"}, {"Title": "Sub-par components", "Author": "Jake Fantom", "ReviewID": "R3F85TROZLXUWI", "Overall": "2.0", "Content": "After less than a year, the motherboard on this puppy fried itself. (Search under \"LG Gray Screen\" if you want to read a bunch of posts about this problem.) On top of that, the \"smart\" features of this TV leave a lot to be desired. If you plan to use the on-board apps to watch your own videos, be aware that it won't play half the codecs out there, including the popular MKV format. The wi-fi module is dicey, as well. This is the second LG television I have owned that didn't last a year. Fortunately, this one is under warranty and will be repaired free of charge, which so far, has been a relatively hassle-free experience. The audio/video quality is fine when the set is functioning, but if the components are built to last months rather than years, what's the difference what kind of quality you get? My advice: do NOT buy this set unless you buy an extended warranty with it. If this had happened one month later, I would have been out of luck.", "Date": "October 17, 2013"}, {"Title": "Love THis TV", "Author": "Buc", "ReviewID": "R2EVXLAOF48ZUO", "Overall": "5.0", "Content": "Ok i waited since January to review this TV.... I love it. The colors the depth of black are just amazing.  I have no issues and would buy this again.", "Date": "August 16, 2013"}, {"Title": "Excellent choice", "Author": "Halsey", "ReviewID": "RY4ICCU4415P6", "Overall": "5.0", "Content": "This television does every thing that is claimed. My only regret is not buying a larger screen. Gaming is excellent.", "Date": "August 12, 2013"}, {"Title": "Great TV for the prices", "Author": "Michael Simpson", "ReviewID": "R1E2IZNUF6EX1C", "Overall": "5.0", "Content": "Great picture and sound. My next TV will be an LG as well. Plenty of HDMI ports to hook up to.", "Date": "July 27, 2013"}, {"Title": "Youtube doesn't work with this TV", "Author": "Suneet Katoch", "ReviewID": "R2UNQX6YOVY04", "Overall": "3.0", "Content": "Youtube is so slow with this TV its not worth watching. I have practically stopped using this television since I can't watch music videos or movies on here. Not even my playlist works. Since I can't watch youtube with my wife, I have gone back to using my small tv with a media player to watch youtube together.", "Date": "July 22, 2013"}, {"Title": "LG TV's are TERRIBLE WOULD NEVER BUY AGAIN!!!", "Author": "mag1000", "ReviewID": "R2GJ7CMNETJ3WH", "Overall": "1.0", "Content": "I will never again buy another LG product ever!!!!!!!!!!!!!!!!I have a 60\" 3D 60PM6700 Smart TV that is worthless.  It is 13 months old and just out of warranty.  Went to use apps like Youtube, netflix etc., said i needed to update the software.  Connected to the internet, i started the update, it gets to about 1% and quits.  I called LG support and spent hours on the phone, they had me try downloading update and installing via thumb drive, comes up with unknown error.  They said that i would have to pay a tech to come fix.  very disappointing!!! Should have bought a samsung at a local store!", "Date": "July 19, 2013"}, {"Title": "LG 50\" plasma", "Author": "genie at WC", "ReviewID": "R2N0YPOPP0G48L", "Overall": "4.0", "Content": "The LG plasma has a great picture, very sharp with good color tones.  The only drawback is that has high reflectivity, and you cannot use any lighting that is located behind the viewer, as it is reflected in the screen.  I have recessed ceiling lights which are used instead of \"rear\" lighting, but I need to change the dimming level, depending on the amount of outside lighting in the room; the darker it is outside, the lower the level of room lighting is required.  I have not tried the 3D feature yet.  The picture controls are not quite as easy to use a Samsung previously owned.", "Date": "June 12, 2013"}, {"Title": "nice for the price!", "Author": "tahoe phil", "ReviewID": "R5HDD48GC02BF", "Overall": "5.0", "Content": "TV arrived pretty quickly and was delivered and unpacked for free using Prime.  The TV performs really well and so far everyone is very happy.  It does not come with 3d glasses, however, and the ones I bought as an aftermarket item did not work.  I will get some LG glasses soon, but in the meantime we just love this TV in our little tahoe cabin.  Really fills up a blank wall with fabulous color!", "Date": "June 6, 2013"}, {"Title": "Great 3D Experience", "Author": "alan bailey", "ReviewID": "R38SLBX9MXIMXA", "Overall": "5.0", "Content": "This is my second LG 60\".  I was very satisfied with the old one, so when I wanted to upgrade I naturally looked at LGs first.  When I found this one, I shopped other brands to  see if any other manufacturer could compete.  They couldn't.  I am very happy with smart (internet capability) features.  I'm still exploring them.  The plasma picture is fantastic, and the 3D is exceptional.  If you are thinking about this TV be aware that you do have to purchase the 3D glasses separately.  All in all, I would recommend this TV to anyone looking for a great picture, great smart apps, and great 3D experience all at a price that undercuts almost all of the competition.", "Date": "May 5, 2013"}, {"Title": "Smart TV", "Author": "Kevin Crane", "ReviewID": "R3T5RFLMAR5DOZ", "Overall": "4.0", "Content": "Great value!  For $1,100.00 I have a 60\" smart TV with built in wireless.  Only bummer is that this LG smart TV does NOT have the LG voice recognition feature, but you get what you pay for...", "Date": "April 26, 2013"}, {"Title": "Great TV for even better price", "Author": "Rollingtex", "ReviewID": "R2IDA8SRODOXAA", "Overall": "5.0", "Content": "I am using this television to cover my open kitchen / main room set up that has me needing to provide a good picture for a very wide veiwing angle, and have no glare concerns in this particular space.  That is why I chose the plasma.  I have a 55\" LG 240 Hz LED/LCD smart TV, that I love and now get to enjoy in my bedroom, and this 60PM6700 is a great fit for the space it is in.I was a little dissapointed when I realized this model does not include a smart remote.  But then I found the free LG smart remote app for iphone and ipad and I'm happy enough with this that I do not feel a need to spend another $80 or so for a smart remote.  (After a month on the fence last summer, I have grown to enjoy the smart remote point and click system on my LED.  With it, I don't need glasses or a bright light to navigate all the tiny buttons at night and that's a big plus for me.)Other people can speak to the techicalities of the picture vs. other models better than I can.  In my simple terms, I enjoy the sharpness of my LED tv and this model trails the LED slightly in that category.  That said, some people may find a slightly softer edges more settling.  But for me the width of the quality viewing angle and the rich colors of this set have me pleased with my purchase.It was a little heavier than I realized (I should read product descriptions more carefully), and with the 60\" size it is generally speaking a two person job to move it around the house and up onto the console.  That said, this TV is less than half the weight (and half the price) of my previous 51\" plasma that was purchased in around 2005/2006.I'd probably give it 4.5 stars if that were an option, but the full fifth star might have cost me an additional $1,000 so I'm happy!", "Date": "April 15, 2013"}, {"Title": "LA CA retailer", "Author": "Rick D Blackard", "ReviewID": "R172JGBECC6P4V", "Overall": "4.0", "Content": "Dealing with Pauls TV was favorable, however the shipper they have contracted with did not meet the arrival date and pretty much does business as that how we do it? Pauls TV made it woeth my purchase and the set was what I expected and happy with the purchase. Might want to watch how retailers adv the product some incl;ude the 3D glasses, most don't But overall Pauls was very fair and stood behind thier end", "Date": "April 4, 2013"}, {"Title": "Great TV", "Author": "ADEPT", "ReviewID": "RVLE2LLVAB2GW", "Overall": "4.0", "Content": "Just a little let down its not passive instead of active however that was my fault for not reading more carefully, so need to buy new glasses to experience the 3D action, which sucks because I have plenty of passive for another 3D TV in another room. This purchase did not include any glasses which was the let down, however the Smart feature on the TV are excellent, you can connect a usb mouse or keyboard to use the web tv services, it comes packed with apps already for hulu, netflix and the like. Inputs galore, and built in wireless is a big plus. Over all just great, can run videos from within my network, and just a top notch TV. Just throw us a pair of active glasses next time LG.", "Date": "March 19, 2013"}, {"Title": "Very Satisfied", "Author": "LoVolt", "ReviewID": "R18XO5SI09O4DL", "Overall": "5.0", "Content": "Set-up and features were as expected. 2D performance is excellent. Haven't had occasion to get some 3D content and glasses yet, but I'm optimistic that that'll be just fine, too.  Nice TV!", "Date": "August 20, 2012"}, {"Title": "smart tv with 3D for under $900", "Author": "GM", "ReviewID": "R2G9LENDG0JU0K", "Overall": "4.0", "Content": "This TV gives a lot of bang for the buck. Free shipping, free delivery and setup, 12 months no interest were great perks.I held off updating the firmware because of reviews claiming undesirable performance afterwards. The TV's OS has a utility that checks for new firmware and when I noticed a version 7/28/12 or so I googled and it seems this fixes the problem with the defective interim update, and I updated mine with no issues. The LG web site says download the firmware to your pc, copy it to a USB thumbdrive, and when you insert the thumbdrive in the TV it auto updates. The TV also has its own native update utility, so I \"chatted\" with LG and they said either method is fine. IMHO the thumbdrive is for when firmware update fails catastrophically. Using the TV's native function is normal.So far so good. The only gripe is for another $200 you can get the model with better black performance. Watching demo delivered programs on Hulu had some buffering issues, but I think its my slow DSL.LG smart tv with 3G in 50\" under $1000? BUY IT!!!", "Date": "August 13, 2012"}, {"Title": "wowwwwwww", "Author": "home theater man", "ReviewID": "R2SDPMLH7DOPY1", "Overall": "5.0", "Content": "First of all the Tv design is Beautiful! As for the picture wow!! Hooked up my sony blu ray player and watched some Planet Earth! This tv is by far the best I have ever owned. My blu ray is not 3d so I cant speak to that aspect of the tv, but ESPN HBO etc.. looks incredible. I guess the 2d to 3d conversion feature gives you a little tease of what to expect. The built in wi-fi is great and the built in apps, its like I have a 60inch computer. The speakers are crappy,but what do you expect from such a thin tv, besides you should have a speaker system to compliment this tv,i have a bose lifestyle system hooked up to mine.  My first tv came completly shattered, but thanks to amazon I had a brand new one in perfect condition in about two days. I had the tv one week now, so far i love it!", "Date": "July 22, 2012"}, {"Title": "Beautiful Picture and Internet controls Plus 3D", "Author": "elmorejohn46", "ReviewID": "R3DYCHGHNWHRGV", "Overall": "5.0", "Content": "I have always loved the rich colors of a Plasma HDTV.I know when they first came out they had there problems ,like with imange burn,but all that is a thing of the past.With this HDTV if you have internet ,you can browse the web ,plus it has all the movie sites like netflix ,huluPlus and plemty more.I have'nt seen 3D since I was a kid at the Movies years ago with one side being red and the other blue,needless to say 3D was'nt so great.But on this HDTV with active 3D glasses,I never seen nothing look so cool ,I was watching whales and dophines in 3D and they were swimming in the middle of my room ,It was like I could just reach out and touch them,very cool.It has all the setup you would ever want ,you can ajust about everthing if you think it needs it.I like that it has 4 HDMI plugs so many just have two.I like the Glass that a Plasma has over it very easy to clean.LG always has great HDTV's and this LG 50\"Plasma PM6700 is no exception It called a SmartTV and I see why with all you can do with it.I also use this as my monitor for my computer and the games are just stunning,the Color is so rich and the picture is so clean and clear.I had a 50\" plasma Panasonic 3years ago that burned up in a house fire and the Blacks on this TV looks ever bit as good.I know that everyone that sees my LG Plasma HDTV ,just says wow what a picture ,it is so rich in color and so clear looking.I got this here at amazon for $899 and free white glove shipping.The first one that came was cracked but when I see the delievery guy throw it over his shoulder I knew it was going to be messed up.when the secound one came I told the delivery guy just wait untill I come down so I could help him carry it up my stairs and this time it was not a mark on it.Amazon has great customer support ,they appolgise and I had another one within 4 days.", "Date": "July 6, 2012"}, {"Title": "Fantastic Size, Picture, and Features. Built-In Wi-fi!", "Author": "Jorge F.", "ReviewID": "RZHRCRIVH2EW7", "Overall": "5.0", "Content": "I have two Samsung plasmas that I love, and I can tell that the picture is noticeably clearer on the LG 60PM6700. The picture is even more impressive when you consider that this TV is 60\" and my other TV's are 42\" and 50\". I love the built-in Wi-fi which my wife uses all the time for Netflix and Vudu. The 3D incorporates active shutter glasses which allows you to get a true 1080P picture in both lenses. It's truly fantastic. On the negative side, the Netflix ap sometimes disappears from the applications screen. After making a call to LG customer service, I learned how to make the ap reappear. Weird.", "Date": "July 2, 2012"}, {"Title": "Great TV", "Author": "D. Berg \"books, music, games.. who needs more\"", "ReviewID": "RG9M49ILSNJUX", "Overall": "5.0", "Content": "I was originally going to go with a Panasonic, but decided to save a little money. I am very pleased with this TV I upgraded to Digital Comcast and have not left the high definition channels. All of the screens are great. Hooking up to my wireless network was also easy. I received a pair of 3d glasses as a present and ran through some of the included demo videos in the LG Apps section, the pictures were great. I have not purchased my new blue-ray player yet so cannot comment on that. So far I have been happy with movies, regular shows and sports. Watched the Hockey finals and was amazed at the detail, basketball and baseball all have looked great.", "Date": "June 14, 2012"}, {"Title": "Amazing picture but you're going to have to keep it away from windows", "Author": "Mikey S", "ReviewID": "R3OJLJVO1HJLME", "Overall": "4.0", "Content": "This is an awesome TV.  If I can do something about the glare, I'll be golden.  If not, I may have to return this thing.  Trouble is, I'm not interested in the 240 hz LED TVs.  The image is unnatural to me.  I'm also not comfortable buying a 120 Hz device because I'm worried that will be obsoleted soon.  The appearance of 480 hz devices is not doing anything to ease these fears either.  Purely from a technology standpoint (setting aside the glare), I think Plasma is the clear choice.Pros:+ amazing, natural picture.+ best available solution for motion intensive things like HD hockey games+ WiFi with basically a built in media server and digital audio output.+ some 30%+ less expensive than comparable LEDCons:- GLARE.  It's a weakness of the technology.  Plasma + windows + sunlight = $1000 mirror- durability.  This is projected to start to show wear and tear in 3 years vs 5+ for comparable LED.- remote sucks. It's just slow and unresponsive (didn't get the magic one - get the feeling it will also be slow).Challenge 1: Audio and Video (Blu Ray) out of sync ... \"what is this, a godzilla movie, dammit?\"  I have a PS3 with accordingly aged HDMI cables.  I ended up setting the audio delay on my receiver to 200ms (max delay) and everything fell into place.Challenge 2: mitigating the glare.  This is a big deal but I'm willing to settle for it being minimized because the picture is that good.  Option 1 - curtains to replace blinds.  Option 2 - return TV and get comparable LED.", "Date": "April 24, 2012"}, {"Title": "Alittle bummed", "Author": "Ryan Scannell", "ReviewID": "R1S33LJ8QNMSQV", "Overall": "3.0", "Content": "Great picture!!!  Internet slow. No HBO Go App which is a major let down.  Can't update flash player which really limits internet video viewing.", "Date": "December 7, 2012"}, {"Title": "LG products are by far a Wonderful brand.", "Author": "Carol Ann Provost \"crafter in jewelry and  fi...", "ReviewID": "R1149AOTS1BDKY", "Overall": "5.0", "Content": "I did a lot of research before purchasing the LG 50\".  I am not disappointed.  I own a LG refrigerator, I love it!!I am now set on the LG brand", "Date": "January 5, 2013"}, {"Title": "One that meet my requirement.", "Author": "Balchan Oudit", "ReviewID": "R24MPC0B6K9E77", "Overall": "5.0", "Content": "There is no negative argument about this product,it simply just worth it.All the positive reality is built into  it.If considering having an HDTV, just select one like this through amazon, a trouble free supplier.", "Date": "January 4, 2013"}, {"Title": "Honestly? awesome...", "Author": "Billy H", "ReviewID": "R29O0M6AZ1EA4H", "Overall": "5.0", "Content": "I bought this product about 3 weeks ago from Frys.  I got it at open box so it was a bit cheaper, and was used as the display item.  I LOVE IT!!!!!!The video is CRYSTAL clear, i mean, ive never had a tv so vibrant and colorful, it is fantastic.  It has a smart feature that allows the tv to detect light in the room which is nice, but i dont use it, but im sure others will.It is a smart tv, and its actually smart.  The internet is really cool, plays lots of videos on real sites.  I dont use many of the apps, but there are plenty of games and stuff.  Some of the apps i do use is netflix and hulu plus.  Both are good, but on my ps3, netflix is able to automatically play the next episode of a show, but not on this tv, although i spoke with a representative and they said thats netflix not the tv, which makes sense, but still.  but i bet eventually they may be able to upgrade through firmware.It is a plasma tv, so I am constantly nervous about burn in.  Fortunately this tv has ways of avoiding the burn in effect.  For example, pausing the tv, after about a minute or two brings up a screen saver that moves around so nothing is on the screen in once place for too long.  Also has an easy \"sleep\" program under apps, unfortunately it isnt directly on the controller, but thats ok i guess, just be careful before falling asleep.  But I have had plasma before and never really had any problems so maybe its all in my head, but still be careful just in case.The 3D is the whole reason I bought this tv.  I tested out 3D first on a small 24\" playstation display, and i loved it, so I bought this.  The active glasses come seperately, and can cost about $40-$50.  They are so light and comfortable, they are just as good as the passive glasses.  I recommend active because the quality is so crystal clear and these specific glasses are the best ones ive ever worn.  Full 1080p in each eye, I just watched jurassic park in 3D and was blown away, I just hope they come out with more movies in 3D.BUT OH WAIT!!!!It has a 2D-3D conversion, which is pretty cool!  Obviously it isnt as good as watching something that was shot in 3D, but watching the Matrix in 3D was pretty great, also video games like skyrim!All in all, I love my new TV, and for the price, I say its pretty great.  50\" is perfect for my room.  I originally wanted bigger, but my roommate already has a 55\" so its all mine, which is great for me!", "Date": "April 24, 2013"}, {"Title": "A real SMART TV", "Author": "Smart TV Owner", "ReviewID": "R12PFHSIX7OBQT", "Overall": "4.0", "Content": "It is really a smart TV, you can pair your mobile devices(iphone 4, blackberry Gold, etc) and play you tube videos with high level quality. We liked this feature a lot as no cables are needed, you can simply play/pause and change videos using your iphone..The WiDi (if you have 2nd generation laptop) feature is amazing as well and you will really enjoy video quality without a cable. TV sound is simply great.Overall the picture quality is very good, however, the other video options such as Game, Vivid, etc are found not that useful as I found the video quality is good when standard video is set.Cons: With the default options we have observed that the picture quality/display is little dark when compare to other TV (I have Samsung 50\"). This is little disappointing..", "Date": "March 31, 2013"}, {"Title": "TV lasted 2 minutes", "Author": "Jeff Diller", "ReviewID": "R1IEILR7C34ORD", "Overall": "1.0", "Content": "I purchased this TV from Amazon and had the TV set up in my house.  As soon as the guys set up the tv, the picture went out.  You could still hear the sound, but no picture.  After hitting every button, changing the MDMI cable and reading the manual, nothing worked.  So the guys packed up the tv and off it went back to Amazon.  The guys did a great job, just a lemon of a tv. I heard great things about LG, but this experience changed my outlook and I purchased a Samsung 55\" LED.", "Date": "March 29, 2013"}, {"Title": "Great TV, Great Price but... not a great value. (Should've done more homework)", "Author": "Keith MacDonald", "ReviewID": "R38C1LIT1SP3FT", "Overall": "4.0", "Content": "Let me start out by saying that this is the first plasma TV I've ever owned.The picture is amazing! It is VERY reflective so be mindful of that and the room it will live in. In all the research I've done they only work with the LG Brand 3D Active Shutter Glasses (AG-S350). The cheapest I've found them for is $45 a piece on-line and they don't come with any, so be prepared to shell out some money for those. Overall, I like the TV, however knowing what I know now, I probably wouldn't have bought it because of the glare and the expensive glasses.", "Date": "March 19, 2013"}, {"Title": "BEST TV for the BEST price!!", "Author": "Julian Reid \"Space Boss\"", "ReviewID": "RNJMPY2DPDXFC", "Overall": "5.0", "Content": "I ordered this to replace the PM6500; which I am very glad I did. The delivery men came right away and set it up quickly and properly. Now I'm loving the 3D features + the 60in size = perfection ! !", "Date": "July 3, 2012"}, {"Title": "Excellent TV", "Author": "pickanyone", "ReviewID": "RVPP7V7VTZWKR", "Overall": "4.0", "Content": "This is an excellent TV with amazing picture and awesome sound. Particularly good value for the price.The reasons for 4 stars instead of 5 are1. amazon instant video is not yet available for 2012 LG TVs.2. does not work with the MR200 magic remote.  you need the mr300. This is not clear in the tech description (or even on the LG web page)The TV itself is 5 stars, the niggles I mention ( which others might not care about, or could well be fixed) make it 4 stars for me.", "Date": "June 7, 2012"}, {"Title": "Amazing Value", "Author": "Edgardo R. Ceballos", "ReviewID": "RQPU21LG4CLI8", "Overall": "5.0", "Content": "Guys, There are a bunch of 3D TV out there.And when you think about 3D and +50\" inches, the tab grows easily over the $2K.Then, you discover that active shutter glasses for 3D cost a lot for what they are...and you need some extra pairs for all family members.Bottom line: $2400 for a fancy TV.This amazing Samsung TV offers:-Slim profile, like the ones advertised for more expensive TVs-Smart applications (useful and other crappy ones)-WIRELESS!!! Yes...standard!-600MHz (not 240 like 99% of the rest)-It is Plasma, which means BETTER image. Manufacturers and retailers make way more money with LCD and LED, but Plasma is still and will continue to be the fastest and cleaner image. It is simple not as profitable for them, so they sell you the idea that LCD is \"better\" by adding exaggerated colors and bright. When you are watching a movie, the smoothens of  textures, the colors, everything is better.When you watch an actual movie, the difference is very evident. I have LCD and LED here. I know what I am talking about.I paid for everything $900 including a pair of glasses for free.No way, believe me, you can get this value out there with any other brand. Take advantage while it last.Important: Amazing deliver the product, unpacks it and test it for you...included in the price. Mine came broken, they exchanged for a new one immediately, and I am happy with it.Hope this review is useful. Do not pay overprice unnecessarily. Go a look the TV by yourself and compare.BTW, I am a REAL user, not one of those EXTREMELY ABUNDANT paid reviewers.Cheers, Ed", "Date": "May 31, 2012"}, {"Title": "Nice features but...", "Author": "MA \"Christjazz1\"", "ReviewID": "R18JO901ET8NYR", "Overall": "1.0", "Content": "My wife says I have an electronics curse and here is an example. It was time to replace our Hitachi rear projection, that wouldn't die, with a modern upgrade. After reading reviews I settled on the LG 60PM6700 having all of the features i looked for at a reasonable price.- Television #1 had a cracked screen (delivery team repacked tv and took it with them)- Television #2 lasted 6 days then lost video- Television #3 lasted 3 days then lost videoNot sure, but i connected the Sony HT-CT150 3D Sound Bar System (purchased through amazon.com) to both tv #2 and 3 via the HDMI ARC connection.In the case of the tv #3 the ARC did not seem to work so i connected audio via the optical connection.Is it remotely possible the Sony HT-CT150 3D Sound Bar System is killing tv\"s or is it an old fashioned defective model from LG?Some have suggested the shipping from Arizona does not do well for the tv's.Television was stunning when it worked, but after 3 tv's I give up", "Date": "July 23, 2012"}, {"Title": "LIKE VERY MUCH", "Author": "bambam", "ReviewID": "RLIQR3FQERRM6", "Overall": "4.0", "Content": "HAD VIZIO 3D AND INTERNET CONNECT FAILED LIKE 20 TIMES A DAY.  AM SO VERY HAPPY WITH THE LG BRAND SO MUCH THAT THREW AWAY THE BOX.  THAT NEVER HAPPENS IN OUR HOUSEHOLD.  AM DELIGHTED. REASON FOR 4 STARS INSTEAD OF 5 STARS, NEED CALIBRATION DISC TO GET BEST EXPERIENCE,  SO FAR HAVEN'T BEEN SUCCCESSFUL IN THAT DEPT.", "Date": "July 6, 2012"}, {"Title": "GOOD TV, JUST WISH FOR BETTER LG CUSTOMER SERVICE", "Author": "andyj", "ReviewID": "R10B9TGJHCE346", "Overall": "4.0", "Content": "UPDATE #2:TV is finally fixed (for about month and half), and there has not been any other issues since. Also LG has new app for smartphones now, that acts like remote, which is great, because it saves money on purchasing that smart remote or whatever the name of it is.I definitely could have lived without issues with the screen and dealing with LG non-existent customer service. However, I'm getting back in to loving this TV, and just pray that nothing will happen to it soon, don't feel like calling LG again.UPDATE:Well few months using, got annoyed by one pixel that was burning bright as soon any color except black overlayed it. Called repair man, TV is still under warranty. He checked TV, said it's manufacturers defect and he will fix it, however unit should be completely taken apart. That means all connections will be disturbed. Well, I bought new TV not refurbished, so I called LG customer service and in nice way asked for extension in my warranty, because after that kind of a repair that's what TV will become - refurbished. Well, you guessed... I was told, if i want i can buy extension to warranty, and if repair fails, they will just keep trying, and if TV will be not usable in the meantime and after that - \"tough luck, electronics do break\"...... In general product is not bad, and if it would be put together with decent customer service, it would be priceless. However, before making a LG product purchase, consider that if any problem arises, don't expect much help.For comparison, my old plasma was from Panasonic, and it came with wrong tv stand in the box, one call to Panasonic customer care, and right stand was overnighted to me at no charge with no questions asked, and TV is still going strong after six years too!!!!!!!BELOW MY ORIGINAL REVIEW....I had Panasonic plasma EDTV for six years, and wanted to upgrade to HDTV. First I tried new Toshiba LED Edge Lit HDTV, I thought it would be good. Picture was awful, I can't even describe it. Especially movies with a lot of night action scenes were the worst. You could not see a thing in any mode, if you tried to adjust brightness, all it did was make \"backlight\" from corners of TV very bright, and picture became just like blurred.  My old Plasma EDTV was many times better, with sharper more clear images. So this way i learned that Plasma TV's are by far better then LCD's or LED's. I returned LED TV, and bought this unit instead. Difference was huge.This TV unit is amazing. The best setting that works for me is THX Movie mode, it has deep blacks and rich colors.TV connected to Internet as soon as i plugged in Ethernet cord. On downside this unit comes with regular remote, so it's little bit challenge to navigate browser.HD content looks fantastic, so do Blue Ray's. Haven't tried 3D movies yet.Overall, very satisfied. And to note, for the people who want TV not over sized monitor, Plasma TV's are the best!!!", "Date": "July 12, 2012"}, {"Title": "Bought it -  LOVE IT", "Author": "YeahSoMaybe? \"computersandmusicperson\"", "ReviewID": "R3LULYUIUNZF9N", "Overall": "5.0", "Content": "I auditioned TVs in a big box store. While many of them were crystal clear, had well saturated colors, and would show minute razor sharp detail....only one struck me as something I would want in my living room:  The LG 60PM6700 60\" Plasma.  Why?  \"Visual comfort\" (my term), a \"warmth\"  I'm talking about how the screen was RENDERED and how the picture hit my soul.  Woo-Woo sounding I know but:  POINT BLANK  Most of those LED technology monitors irritate me.  They are ....too perfect?  I can't put my finger on it. I find there's something delineated but garish about them. By the way, I'm NOT talking about color saturation per se.  Now, realize that this TV is absolutely no slouch in the sharpness department.  I swooned when I saw the output. It's just pleasing and non-irritating.  I left and walked around and found that I kept coming back to this particular LG model.UPDATE: ---->  I bought the 60\" LG60PM6700 in early Dec 2012. Yahoo!  <-----This TV does a superb job of delivering a quality non-soul jarring picture.  I notice no ghosting or \"soap opera\" effect.  (My TV is new enough that it probably already has the firmware fix for the so-called \"soap opera\" effect mentioned in reviews from the 1st half of 2012.)NOTE: Watching ESPN and Sports are not a big deal to me, however action movies, \"Person of Interest\", etc are.  Action is not blurry on this TV.SHIPPING and DELIVERY (from Amazon Arizon warehouse): NO DAMAGE, NO WORRIES!  I was charged around 36 bucks for shipping and \"white glove\" delivery. (VERY fair deal I would say).  The 60\" LG Plasma arrived in good condition and two workers brought it into my house at an agreed upon scheduled time on a Saturday morning.  They unpacked it in front of me, plugged it in, then we hooked it up and proved it would display a decent picture from my Blu-Ray player's output.  I looked the unit all over, inspected:  not a scratch, then signed off on the delivery papers.  They offered to either take the box or let me keep it, I said I'd keep it for a month just in case.THE INSTALL:I then spent half the day mounting my Premier Ultra mount.  It took me so long because I have an older house with (it turns out) 18 inch stud spacing with lathe & plaster over it.  Stud finders don't work so well with some lathe and plaster.  I eventually was able to verify and get 6 lag bolts into the wall studs so I could trust that it wouldn't fall down.  The lag bolts that they (Premier) gave me worked fine.  (You'll see some reports out there on TV mounts of cheap lag bolts shearing off or breaking upon tightening, was not the case for me - they are decent quality).To the people complaining that it lacks built-in Amazon movie streaming - the Sony and Panasonic Blu-Ray players I have both support Amazon streaming - they both work great.  I don't feel inconvenienced by using this method.  Your mileage will vary.By the way I could give a rat's A** about 3D.  It's frippery.  It's actually annoying to me.  I am sold on 2D Blu-Ray though.  I am buying anything that matters in Blu-Ray as long as the transfer is known to be as good or better than the DVD version (I look up these things - there are a few actual cases where the Blu-Ray version has poorer audio or is no better than the DVD).I am shying away from Samsung TVs as they have had recalls/ longevity issues due to bad capacitors.  Maybe that issue has been resolved but it makes me leery._____________________________________________UPDATE #2 on 12/20/2012:OK have had this for 19 days.  We have been on a movie watching binge.PROs:  Wonderful picture, warm and clear - good blacks.  I plug my Sony HX-30 camera in and it quickly recognizes it as an external drive with folders.  The remote on the TV will let me navigate the SD card in my camera - I like it!WHAT MATTERS:  It delivers a very pleasing picture!  Good Blu-Ray 1080p content looks STUNNING on this TV.  Examples: The snow complex action scene in \"Inception\", the IMAX filmed chase scene in Dark Knight Returns (Joker).  (ALL of the Dark Knight Blu-Ray Trilogy set looks great). I have been noticing things in scenes I have watched previously...example:  All the stuff on Harrison Ford's desk in the  classroom scene in the 1st 30 minutes of Raiders of the Lost Ark Blu-Ray.  2001 Blu-Ray looks great.  Outland(Sean Connery) Blu-Ray - very good.  We normally sit about 11 to 13 feet from this TV, occasionally 6-8 feet away if we are congregated on the floor.  This 60\" version is the right size for our living room without \"taking over\" the whole visual asthetic of our living space.  I wouldn't want a smaller TV for our situation but I could see someone being happy with the 50\" TV in their bedroom or family room.  Broadcast (free over air) TV in our area is typically 480i (interlaced) to 1080i.  It looks decent, and I put in perspective that it's free and it's just the news, or Monk.  Person of Interest looks good.  We did bother to get a top of the line TV antenna by the way.I refuse to do Cable subscription. I view it as being locked into an never-ending escalating cost increase scam. The glare that some refer to is a non-issue in our experience.  We don't have the TV mounted across from a sunny picture window, if we did that might become an issue but so far, no problem.CONs:#1  I had to set the audio delay function in my Pioneer VSX-1021k AV receiver (which is between the TV and all sources) because - at first - the actors lips would visually move on screen , then slightly later you would get the sound.  To fix this, I had to play with my receiver's delay duration.  Currently I have it at \"5 frames\" out of 10 possible frames audio delay.  I don't know how frames translate into milliseconds (ms) but have read online that some delay audio to 200ms.  The TV has a built in audio delay/ sync feature but it did not do much for me.  I can say that this is not an issue now.CAVEAT:  If you don't have the option of setting audio delay in another device (receiver, source, etc) then IT'S POSSIBLE you may not be able to correct for this issue.  YMMV.#2  You'll get spoiled and and want to replace all your DVDs with Blu-Ray.  Maybe it's because my Sony BD-s790 Blu-Ray player has so-so upscaling, not sure. I'll put this in perspective:  I have Terminator 2 on an \"Artisan\" DVD disc where they don't have the special features, put the extra picture info into the scan (i.e. less compression supposedly).  Well, it looks decent / presentable but I * know * would be over the top on Blu-Ray.  Ya get spoiled...OK?My only complaint about our whole upgraded setup is really you have delve into all the various devices settings to get * integrated * performance.  There was more than once that I longed for my old two channel / DVD setup ONLY for it's lack of hassle.  Welcome to modern HDTV home theater: You'll have to put nose in the manual and fuss around for awhile and get things optimally to your liking.  That's just life.  Once you get it all set good - you're good to go.WHEN ALL IS SAID AND DONE:This is the last TV we are buying.  It's excellent.  I would buy it again.  I'm glad we went Plasma instead of LED.  Whatever comes next technology-wise, I really don't care.  I'll \"suffer\" with this ahahaha.  I'm a very happy camper.", "Date": "May 20, 2012"}, {"Title": "huluplus stinks on this tv", "Author": "Ronald R. Sercely", "ReviewID": "R3I4TCSYB5BV32", "Overall": "3.0", "Content": "Everything about this tv is very good, except two thingsthe hulu plus on this tv is TERRIBLEoften pausesoften \"loses its place\" within a playbackFast forward to a place after it loses its place then hit play - often starts at the beginning anywayHave udated to latest software, no difference.It is NOT my wireless, I can run huluplus from 2 other laptops placed within inches of the TV - no problem , everI tried talking to LG telephone support - no help. They say - no problem.either MY TV is bad, or the app is bad.second thing - remote control has one very bad layout feature. When navigating apps and web pages - the \"up\" button is millimeters away from the \"home\" button, which takes you out of whatever you were doing, losing all the information you just input", "Date": "October 13, 2012"}, {"Title": "LG 60PM6700 60-Inch 1080p 600Hz Active 3D Plasma HDTV", "Author": "michael", "ReviewID": "R3GRFEBXUZAVK8", "Overall": "3.0", "Content": "buy a 3d tv and it does not come with the3d glasses, Im surprised it came with a plugpicture okay, nothing special", "Date": "March 21, 2013"}, {"Title": "Too many ghosts for my taste", "Author": "Richard Jaggers", "ReviewID": "R2LTX9W1ZMCZQN", "Overall": "1.0", "Content": "I purchased this TV to replace a DLP TV that cost too much to fix.  Amazon delivery service was great.  Setup the TV and immediately noticed the ghosting effect created when people or objects moving and it was happening way too often.  Adjusted settings a hundred ways and did not get any better.  Contacted LG and they had an LG tech guy come out and guess what, he could not fix it either and only option was to replace the panel board inside.  LG customer service was great but I could not stand the picture on this set.  I opted to return.Also noticed the \"soap opera effect\" when watching movies on movie channel like HBO, Showtime etc...  thought it was 1970 all over again.Tried the 3d with the free glasses and that worked well.  Watched Hugo and was somewhat impressed.Returned this TV due to the issues and purchased the 55 inch panasonic  VIERA TC-P55ST50 55-Inch 1080p Full HD 3D Plasma TV that cost a little more but got better reviews and works better than the LG.  Family is happier despite the slightly smaller size but better picture.", "Date": "July 5, 2012"}, {"Title": "Disappointed in LG service level after getting a lemon", "Author": "Jaclyn K Karlen", "ReviewID": "R2Z9BKI5NYNAVM", "Overall": "2.0", "Content": "I read several reviews and found this TV was a terrific value for all the features. I have a 32\" LG that I have owned for several years and always thought the picture clarity was great.The TV was delivered on time, but after plugging it in for the first time, the sound worked but no picture. I called LG immediately and they scheduled a tech to come out three business days later (recieved TV on a Friday, tech came out on Wed.) The tech was unable to fix the problem with the parts he had available (bad panel), so we scheduled another appointment for the following Thursday. After taking another day off to stay home and wait for the tech, the tech called that morning and told me the part wasn't in. He said he would call in the next few days to schedule another appointment.I am frustrated by the level of service provided. I wish LG just would've swapped the TV and not put me through the hassle of taking two days off of work (so far) and not having my TV working for 3 weeks. I did not follow up with Amazon, so no knock on their level of service.I assume the TV will be great once it works!", "Date": "May 10, 2012"}, {"Title": "NEVER AGAIN!", "Author": "adam martin", "ReviewID": "R1TCS4Y52Y2HZU", "Overall": "1.0", "Content": "I previously owned a sony google smart tv. loved it. After buying lg, i can see why sony is still a preffered product. First off,the youtube app on the lg does not work properly, which is what i primarly use on my smart tv. Second, the tv does not come with the 3d glasses, or magic remote which trust me, you will want when you realize how terrible it is to navigate the tv with out it. The biggest problem with this is the fact that NO WHERE ( at least that i can find ) on the box, lg's website, or  the owneres manual does it tell you how to order it or most importantly, what model glasses or remote are compatible with the tv. I've wasted over 100 dollars buying and returning different glasses and remotes.", "Date": "March 22, 2013"}, {"Title": "THIS IS NOT A REVIEW FOR THE TV", "Author": "Cristhian Flores \"Cristhian Flores\"", "ReviewID": "R2Y05QFWC5IRQV", "Overall": "5.0", "Content": "i was reading all of these comments, but none of these mention the Panasonic GT50. Has anyone had this TV before and can see a difference? if so or if you have any comments please email me at flojenit54@aol.com. My GT50 broke down so not sure if this is an upgrade or  i should go for the gt50 again", "Date": "March 13, 2013"}, {"Title": "Very nice", "Author": "patrick shimer", "ReviewID": "RCTF8QM5D98FG", "Overall": "3.0", "Content": "Great value. This product meet all my expectaton but one big one. The reason for the 3 instead of 5 stars. One Big reason I puchased a new smart TV was to take advantage of new tech and content. When netflix went down over the holidays i Learned that many of the apps require monthly fee's to acess. as well as many being removed because of fee's. so the smart tv experiance was lessoned. paying for the \"smart TV\" is not the what you are doing you are paying for the acess to a smart TV. big diff. So it appears to acess we will have to pay more down the road and until then just do without.", "Date": "January 13, 2013"}, {"Title": "POORLY PACKAGED", "Author": "Jean", "ReviewID": "R1GB6QM8KBO4TQ", "Overall": "1.0", "Content": "This is no way reflects on Amazon as their customer service was fantastic!  We received 2 of these, both with completely shattered screens - not sure if original packaging or shipping caused, but it was very frustrating and disappointing.  We have purchased this same model elsewhere and had it shipped and delivered with no issues whatsoever.", "Date": "July 10, 2012"}, {"Title": "My 2nd LG TV Arrived- Once Again DAMAGED!!!!1", "Author": "Americanyon", "ReviewID": "R3D0BJ4YB2BJ9H", "Overall": "1.0", "Content": "Well, I have been waiting patiently for my second attempt to get this LG plasma TV and once the delivery guys opened the box.  The glass screen was all cracked.  They mentioned that LG TV packaging is horrible.  Please, if you buying this TV from Amazon, make sure to inspect the TV before the delivery guys leave.  Off to Costco to buy this TV.  I had with buying TV online.  What a hassle.", "Date": "September 21, 2012"}, {"Title": "LG Electronics  Magic Motion Remote Control", "Author": "Al", "ReviewID": "R1D7MGN9AESUPA", "Overall": "1.0", "Content": "This model of TV LG 60PM6700 60-Inch 1080p 600Hz Active 3D Plasma HDTV don't come with the magic remote control. I already check with LG directly", "Date": "August 22, 2012"}], "ProductInfo": {"Price": "$1,799.99", "Features": "60-inch Plasma display\nEasily access thousands of movies, customizable apps, videos and browse the web right at the click of the Magic Remote (not included).\nTired of streaky action or unclear plays during the game? See sports, fast action and video games like never before. The 600Hz refresh rate virtually eliminates motion blur.\nThis LG Smart TV is Wi-Fi ready, requiring only the supplied dongle to be fully accessible wirelessly.\nFull HD 1080p gives it superior picture quality over standard HDTV. You'll see details and colors like never before. Bring your content to life with 3D technology! The astonishing effects will immediately grab your attention and bring your entertainment experience to the next dimension.", "Name": "LG 60PM6700 60-Inch 1080p 600Hz Active 3D Plasma HDTV (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/31mVWhBVyuL._SX300_.jpg", "ProductID": "B0074YRGKM"}}