{"Reviews": [{"Title": "Excellent Little TV", "Author": "dhahrangirl", "ReviewID": "R2BPFDVDF5HGNL", "Overall": "5.0", "Content": "Got this for my mom who has limited space in the Assisted Living facility. It fits perfectly on her nightstand and gives a great picture and sound. I haven't been able to find any wireless headphones that will connect with it yet (tried adding a bluetooth adaptor and also tried LED headphones), but I'll keep looking until I find some that work. She isn't able to use her arms much, so having wireless is important. Other than that, great product! She loves it and that is all that matters. Would recommend and am also thinking of purchasing one for my teenager's room.", "Date": "November 5, 2012"}, {"Title": "goo buy", "Author": "J. Sample", "ReviewID": "R10H97VXH3IK1E", "Overall": "5.0", "Content": "I had never heard of a Coby, but the price was right so I decided to try it.  Ill definitely buy this again.  It's light weight, good size for a bedroom TV.  I had it working perfectly in about 15 minutes.  If I have to replace another TV, it will be a Coby!", "Date": "August 22, 2012"}, {"Title": "Perfect for what I bought it for.", "Author": "Traveling Guy", "ReviewID": "R3KGQ09C417DWW", "Overall": "4.0", "Content": "I wanted a small TV/DVD combo (couldn't find a TV/Blue Ray Combo) for use in our RV. The first unit shipped was defective, in that the DVDplayer would not read the discs. Coby support diagnosed a probable misalignment of the lens.  Sent it back for an exchange (Amazon's return policyis great, no cost to me) and the second unit works perfectly. Clear, crisp picture in both TV and DVD modes. Just right for our smallish RV. Light,easy to set up and move. The only thing which prevents me from rating it 5 stars is its somewhat slow response time to commands from the remote.", "Date": "July 17, 2012"}, {"Title": "Ciby 15\" LED HDTV/DVD Player", "Author": "K. \"K.\"", "ReviewID": "R2ILH5AZXW6DM8", "Overall": "4.0", "Content": "Hard to beat for the price. Works well, view angle is limited but I have not found that a problem since I always view from a comfortable static position. Picture quality is quite acceptable but not as good as my plasma units. Unable after much research to find another unit to compare at this price with same features. I'm satisfied.", "Date": "October 24, 2012"}, {"Title": "Good small tv for RV and Kitchen.", "Author": "Love to bake", "ReviewID": "R41WPVPEZR3KI", "Overall": "5.0", "Content": "Really, like this little tv. We use it in our RV and in the kitchen. Good picture and sound. The price is a very good bargain.", "Date": "January 6, 2013"}, {"Title": "Very nice", "Author": "Donny Lumpkin", "ReviewID": "R1NRUTYZBF19X8", "Overall": "5.0", "Content": "Nice picture and not bad sound for a flatscreen. Very happy with the unit so far, hopefully it will hold up under use.", "Date": "December 28, 2012"}, {"Title": "Coby 15 inch TV", "Author": "cal", "ReviewID": "RI1ZOMK84DB1J", "Overall": "3.0", "Content": "Is the size I needed for a small kitchen.  Haven't used the DVD player yet.  But I will echo other reviewers when they say that you really must view this straight on - from an angle gives a very dark image.  And the sound is OK especially if you're behind the TV!", "Date": "December 23, 2012"}, {"Title": "Coby TV DVD combo", "Author": "B. Turner", "ReviewID": "R3C02GGSY7IVOT", "Overall": "5.0", "Content": "It is not my first Boby LEDVD.  I order because of the product brand and quality and the combo capabilities.The smaller screen suits my purpose of desk top or on the shelf in the closet for guests.  I order often from Amazon and sellers at Amazon that I trust. This is a great TV for the price and does what I need it to do.", "Date": "January 31, 2013"}, {"Title": "Picture Performance!", "Author": "als57", "ReviewID": "RIBDRBW6H1WXM", "Overall": "2.0", "Content": "Picture color and definition is poor no-matter the menu options selected.  It will be relegated to the basement, instead of the TV it was supposed to replace.  Definetly has made me hesitant.", "Date": "January 18, 2013"}, {"Title": "Great", "Author": "JOHN", "ReviewID": "R25HWYLQ51VVJB", "Overall": "5.0", "Content": "This item for the price shown a better picture than my 32\" den TV. I have places in in my wives craft room and it is just ideal fit", "Date": "December 17, 2012"}, {"Title": "Nice TV but not for inverter use.", "Author": "D. Forty", "ReviewID": "R3JYYLQGGRH0S9", "Overall": "3.0", "Content": "I bought this to replace the TV in my conversion van. It's 120 Volts so I had to purchase an inverter to produce the 120 Volts for it. Unfortunately the power supply in this TV isn't good enough to filter out the 60 cycle AC sine wave produced by the inverter so there is a noticeable hum in the sound output. For home use it's a great little TV, but for a van or RV you would be better off spending the extra money for a 12 Volt DC TV.", "Date": "December 13, 2012"}, {"Title": "not bad!", "Author": "kimo", "ReviewID": "R1NY7F2LP1DNP7", "Overall": "4.0", "Content": "Small little HD tv with a built in DVD player .. great for the kids room.Simple and easy to use -  up and running in minutes and no problemssince we plugged it in.. several weeks now...  good for the price.", "Date": "December 6, 2012"}, {"Title": "DO NOT BUY THIS PRODUCT", "Author": "Anna", "ReviewID": "R3NQGTTFWHU2R9", "Overall": "1.0", "Content": "The speakers on this TV are horrible. The picture is great but not only is the sound tinny the volume is quiet low. Amazon was great in sending me a new one when I thought it was damaged, but the second TV was the same. Once again Amazon 's customer service was terrific and they gave me a refund. Both times they paid for the return postage.", "Date": "December 30, 2012"}, {"Title": "Narrow viewing angle", "Author": "Charles Holst", "ReviewID": "R3L93QLFKA6YXB", "Overall": "2.0", "Content": "I bought this TV to mount over my NordicTrack to make my exercise time go faster. Because the only place I could mount it was about an arm's length away, I needed a small screen; and because I exercise in the basement near a noisy furnace, I needed a phone jack to better hear the dialog. I was aware of the TV's narrow viewing angle from other reviews, but because I planned to always view it from the same position, I figured that would not be a problem. I was wrong. The viewing angle is so narrow that the contrast varies from top to bottom, and, worse, the slight bobbing motion of my head while exercising caused the picture contrast to flicker with the movement. This might not be a problem for those who view the TV from farther away, but if you're going to do that, then why not get a larger TV?Another problem I encountered was a loud hiss when I plugged in my Skull Candy ear buds, but this turned out to be a problem with every TV I tried that had a phone jack (the ear buds are fine with my MP3 player). Eventually I discovered that my Sennheiser headphones masked the problem, so I use those now, but now I wonder about their frequency response. I didn't try the TV speakers.A third problem is the built-in DVD player: it's cheap, does not upconvert, and it always reverts to the beginning of the disc when you turn it off. Can you imagine how irritating this is when your daily viewing time is shorter than the movie you're watching? Who wants to see the same ads over and over again? To be fair, I suspect this is a problem with every cheap TV that has a built-in DVD player, and not just a problem with the Coby.Another problem I had was that I couldn't figure out how to adjust the picture width so it didn't stretch 4:3 movies to the full width of the screen. Maybe I missed something in the manual.The Coby was just too irritating to keep. I returned it and replaced it with a 19\" Vizio TV and a Sony DVD player that upconverts and resumes the movie right where I turned it off. I'm happy now.", "Date": "March 24, 2013"}, {"Title": "Good TV", "Author": "Upset", "ReviewID": "R1QKPNRSHFCYLD", "Overall": "5.0", "Content": "Bought the Coby LEDVD1596 15-Inch 720p 60Hz Widescreen LED HDTV with DVD Player to use in RV. It has  good picture, the dvd player has works well. For the price it has been a good buy for me.", "Date": "March 19, 2013"}, {"Title": "excellent tv", "Author": "Gradeli Aguero Valverde", "ReviewID": "R2VXH3L7RRZW3L", "Overall": "4.0", "Content": "excellent tv, the only thing is the weight and the picture is not HD, but this very complete, could improve the image quality", "Date": "February 16, 2013"}, {"Title": "Just OK", "Author": "norbo", "ReviewID": "R1T373K5PZA25K", "Overall": "3.0", "Content": "Not a bad tv. Good picture. However, the speakers quit working. Will have to contact for a warranty repair.Will update review when I see how the warranty repair goes.", "Date": "February 14, 2013"}, {"Title": "overall it okay", "Author": "valtrice", "ReviewID": "R3G6IGWVVHNQHN", "Overall": "3.0", "Content": "really love the size of the tv. easy set-up with a great picture but cant be viewed at an angle. i have it mounted on the wall with a tilt mount so that i can adjust it. the dvd player on the side is great. got it at a great price, so overall im satisfied.", "Date": "February 3, 2013"}, {"Title": "Great little TV", "Author": "MaryAnneMoeller", "ReviewID": "R3ARNAIU2461B9", "Overall": "4.0", "Content": "The only issue I have with the TV is that you have to be directly infront of it, if you are higher or lower or to either side the pictures is distorted, almost 3d like. Also the stand can not be tilted, The picture is very very clear.", "Date": "January 13, 2013"}, {"Title": "Decent for the price", "Author": "Michael R Waites Jr", "ReviewID": "R346ZBXKHFC3VQ", "Overall": "4.0", "Content": "I got this TV for in the kitchen. For the price, the picture is good. If you are wanting a very clean, hi-res image, pay more, get a more expensive product. Also, this is the first TV I have ever had that after doing a channel auto scan, it found multiple signals on one channel. So now I have a channel 4.1, 4.2, 4.3, and 4.4 with different content on all of them. Funny enough, the normal channel 4 isn't one of them. Weird. Thank goodness it has the three channels my wife loves.", "Date": "January 4, 2013"}, {"Title": "lemon", "Author": "Elaine Garbarine", "ReviewID": "R1USPSSC8R6VK3", "Overall": "1.0", "Content": "I bought this tv less than six months ago.  It will not turn on.  I have a tv in my kitchen that is essentially useless.Try something else", "Date": "June 3, 2012"}, {"Title": "It's only an okay tv", "Author": "Marie Hopes", "ReviewID": "R227FLY0H4V4TS", "Overall": "3.0", "Content": "I was looking for a smaller tv for my kitchen that had a built in dvd player for when my grandkids came over. The tv is a nice size for the space I had but the sound is very annoying, the picture is ok, plus I couldn't even get my Direct TV remote to recognize the Coby brand. The price wasn't that great either. I found it somewhat cheaper on ebay. Overall it's ok.", "Date": "February 24, 2013"}, {"Title": "Not multidirectional as advertised", "Author": "Jeffrey Pingrey", "ReviewID": "RA0S2BJUN447W", "Overall": "2.0", "Content": "We researched small TVs to place in the bedroom of our motorhome. We bought a multidirectional support bracket and had great difficulty angling the screen to get a good image. The speaker is tinny with very limited volume.", "Date": "May 25, 2014"}, {"Title": "Very nice unit for the price...", "Author": "James Beck", "ReviewID": "R1596HDCUKZJ5X", "Overall": "4.0", "Content": "This TV is pretty hard to beat for the price.  And let me tell you, it is not easy to find a small size flatscreen TV - there's none in a brick-and-mortar store and very few online, especially with the integral DVD player.  And you're not likely to find any of the big brands like Sony, etc.  So although I was a little hesitant to go with a brand I didn't know - I'm pleased with this and so far it's working fine.  You do have the typical issues with poorer viewing the greater the angle is, but I think that's with most flatscreens.  I mounted this on an inexpensive VideoSecu arm on the side of my kitchen cabinet so if I'm moving around, I can easily adjust the angle.  And it gave me back much-needed kitchen counter space that my old 9-inch standard TV took up.  The sound, however, is horrible - no two ways about it.  Until I found a solution, I couldn't even bear to have it on.  Found an easy solution in plugging in a pair of decent computer speakers into the headphone jack and voila - it is perfect...about a 300% improvement!  The DVD-restarting-from-the-beginning every time problem that other reviewers commented on is indeed true, but I don't find it a major detractant.  I'm just glad it has a player at all.  In summary, I recommend it highly for small spaces, just remember to add in the price of secondary speakers.", "Date": "February 7, 2014"}, {"Title": "sight and sound", "Author": "Barbara Schikore", "ReviewID": "R3L0W6JFGQX2AW", "Overall": "3.0", "Content": "It is hard to see the screen from different angles.  The sound does not increase enough.  I've worked with the menu, but that has not seemed to help.  Any suggestions?", "Date": "January 7, 2014"}, {"Title": "Love this TV", "Author": "Tracey", "ReviewID": "R2OHKPZB3477K3", "Overall": "5.0", "Content": "Bought this tv a little over two years ago and it still works great. It is a rather small tv so the speakers aren't very loud but I use it in the kitchen or garage so it's fine for my purposes. I watch my cooking shows in the kitchen so I can follow along and this tv is perfect", "Date": "November 20, 2013"}, {"Title": "Worst Purchase I have made at Amazon!", "Author": "Tom L.", "ReviewID": "R213IV5KH7A300", "Overall": "1.0", "Content": "I put the tv in my motor home used it probably 5 times total of maybe 20 hours and it quit.  But of course it was out of warranty.  I would not purchase another Coby.", "Date": "November 13, 2013"}, {"Title": "Decent TV for the price", "Author": "Painter", "ReviewID": "R2RUWQKZ57TAGW", "Overall": "3.0", "Content": "For the price the TV is nice.  You do have to pretty much be looking straight it however.  The sound is fine.  The one thing I find harder to live with is that the DVD player doesn't pick up from where you left off if you stop it.", "Date": "November 10, 2013"}, {"Title": "Like New Colossal Coby", "Author": "L. A. Kahler", "ReviewID": "R1XVQ9Z90SQZK3", "Overall": "5.0", "Content": "Works great, like new as advertised.  Half the price of brand new 15-inch models.  Absolutely no complaints, very satisfied.  Recommended.", "Date": "July 20, 2013"}, {"Title": "VeRy good for price", "Author": "Victor", "ReviewID": "RA71JBZZ0PF3R", "Overall": "4.0", "Content": "I acquired  this TV to replace my LCD sharp tv that I bought in 2001, I wanted a smaller screen but I guess they are not available anymore. the good thing is that is small enough for the kitchen and decent screen, the bad is that it has a big and complicated remote, the ugly is the quality of sound. I would not recommend this for gaming, better use is for the kitchen and to play DVDs, but even in HDMI the sound is not good.", "Date": "June 11, 2013"}, {"Title": "Lanai TV", "Author": "Ellen Bawcom", "ReviewID": "R3BFPZZC3KI1JH", "Overall": "3.0", "Content": "As mentioned, sound is not great and screen is dim when viewed from an angle. Otherwise, works fine so far.", "Date": "May 17, 2013"}, {"Title": "Great...", "Author": "pam r", "ReviewID": "R2ZJJ1NXJ71O1T", "Overall": "5.0", "Content": "I bought this television for the kitchen and needed something small to go under the cabinet. This was a perfect fit. The picture was great and I had no issue with the sound as some customers stated in their review. There are different levels of sounds so I just left it at standard. Can't beat it for the price.", "Date": "April 25, 2013"}, {"Title": "I'm not sure I'd buy it again", "Author": "K. M. Floyde", "ReviewID": "R3PNTE5250RFQC", "Overall": "3.0", "Content": "I bought this TV mainly for its size... It isn't easy finding small televisions anymore.  The sound quality is very squawky, regardless of the settings I have tried, and the unit takes a long time to turn on.  The picture quality is good and I like the fact that it picked up some HD channels without the need for a cable box.  All in all, thought, I can't say that I would recommend this TV or that I would buy it again.", "Date": "May 11, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "15 inch widescreen LED HDTV with DVD Player\nIntegrated slot loading DVD player upconverts DVD video to near-HD quality\nDVD, DVD±R/RW, CD-R/RW and  JPEG compatible\nPlays digital media files from USB flash drives and SDHC memory cards\nBuilt-in digital TV tuner (ATSC/NTSC/QAM)", "Name": "Coby LEDVD1596 15-Inch 720p 60Hz Widescreen LED HDTV with DVD Player (Black) (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/516ZIbCNNAL._SY300_.jpg", "ProductID": "B0075W97NW"}}