{"Reviews": [{"Title": "Price and Features Make It a Good Buy - 4.5 Stars out of 5", "Author": "Cautious Consumer \"Cautious Baby!\"", "ReviewID": "R13NW9M2J16R9U", "Overall": "4.0", "Content": "Had the TV for 2 weeks, so far I am pleased. I'll begin with the TV's picture - it is excellent, colors, detail, etc...are excellent.The 3D is excellent.The 2D to 3D conversion is excellent.This plasma does have the \"Soap Opera Effect\" - which you can remedy by changing the picture setting to \"Game Mode\". I have the TV in Game Mode 24/7 and have no problems with that at all.That's where I deduct half a star - literally my only complaint.For me, this effect is extremely annoying, and I don't understand how manufacturers seem to think this is OK to ship out TVs with this strange motion effect. If you don't mind or even like this effect - this TV is even more highly recommended by me (5 out of 5 easily).The TV comes with a full internet browser which \"out of the box\" is controlled by the TV's remote. You can imagine that requires a little patience, but if you find a \"plug 'n play\" wireless keyboard - problem solved.The Internet works excellent. The TV streams Netflix movies no problem at all.The TV's form factor should also be considered a big plus. It is thin, all connections are well-thought out and located conveniently.Considering the features you get: 3D; 2D to 3D conversion (literally watch anything you want in 3D); the Internet with Netflix, full browser, USB inputs, and great picture quality - this TV is a very good deal.\"The Good\" most certainly outweigh \"the bad\" in this case and I recommend this TVThe Good:-Picture Quality**-2D to 3D conversion-Full Browser/Internet/Netflix-USB inputs-Form Factor/Thin/Connections nicely locatedThe Bad:-** \"Soap Opera Effect\" Occurs with this plasma, but you can avoid that by using \"Game\" mode picture setting.- No 'HBOgo' or 'Pandora' Apps yet, but maybe this will change in the future", "Date": "April 25, 2012"}, {"Title": "SO FAR SO GREAT!!", "Author": "Forevermercy", "ReviewID": "R3AMT5B927QDJX", "Overall": "5.0", "Content": "Got my TV on Friday and have been messing with it all this weekend.I'm not one of those picture quality snobs, but here's my take. Out of the box the eco energer saver settings are on so its really dim. I changed the settings to \"Standard\" and am pretty pleased with the picture quality.The movement is a lil bit different. Not bad but different from my old Samsung TV. I think another reviewer called it the \"Soap Opera Effect\". Whatever it is I'm sure it could be changed but it makes no difference to me. You do notice it more in the 3D setting tho.Speaking of 3D. This is my 1st 3D tv and I bought this one specifically because of the 2D to 3D conversion capability. Maybe I still need to configure the setting to my liking but I would say this the only downfall for this TV. There's alotta ghosting! When watching something in 3D world (which is made for 3D viewing) it was almost unbearable to watch because of the ghosting. Again, maybe I just don't have the settings right. Funny enough, the 2D converted into 3D actually wasn't bad with the ghosting and I enjoyed the enhanced viewing watching shows like \"Once Upon a Time\" and \"Awake\" in 3d! But for most shows, converting is not much of an enhancement. Mind you the 3D gets a lil wonky when converting, but that's because its not meant for 3D viewing so you get things like random pop outs and stuff. But that's not the TV's fault. Other than that its a pretty neat feature and I'm impressed that now I can enhance anything I watch (even netflix) in 3D. I suggest watching Inception! But as far as the actual Cinema 3D is concerned the jury is still out since I don't have a Blue Ray yet and what content was available was rrrreally bad! I'll let you know as soon as I can pop in an actual Blue ray 3D DVD.So the \"Smart TV\" features. This is the other reason I purchased this set and I can say I'm pretty happy with it. The apps like youtube and netflix work as good as on my Android. But I'm hoping they add Pandora soon! I haven't downloaded any extra apps yet but I haven't seen anything I use as often as netflix.I love the idea of being able to access my computer files from the TV since I have a ton of downloaded movies. Here again, I'm not sure if I have the setting right but I wasn't able to just pop into my PC as easy as they make it sound. You have to download Plex Media Server and then add content to a library which takes time depending on how much content you have. So far, the only files I can access from the TV is those I put in that Plex libray. And often I'm not even able to connect at all to my PC. Also you can only playback certain video formats. Its kind of a pain to be honest. But when it works it streams my content just fine! Rewinding and forwarding is a lil rough though.Same from my LG G2X android phone. The smartshare feature was a lil difficult to get running but once you've figured out the correct setting I can instantly play my pictures and music directly on my tv!****UPDATE****I found it is MUCH easier to transfer movies to my kindle fire and play it off the USB! So no connection cut offs when playing a movie. Works great!So all in all so far I'm happy. I bought this TV when it was in the $500 range and think its a great buy! LOTS of great features, nice design, and solid TV viewing. I would definitely recommend!PROS:2D to 3D conversion is pretty awesome!Streaming content from netflix and other apps.Wireless access to my PC and smart phone.Cons:3D isn't the best.Difficult getting settings configured.***UPDATE***So I've been able to view original 3D footage and its LOADS better than the provided footage on the LG 3D World. There's still noticeable ghosting but you'd be hard pressed to find much improvement on other 3D sets.***UPDATE 8 MONTHS LATER***My only real regret with buying this TV is not buying the bigger one!!! My 1 yr old broke one of the 3D glasses which was a huge disappointment. But to be honest I dont really watch too much in 3D anymore. The allure has faded for me, but good thing I did notice about the TV/Glasses as compared to similar 3D sets is you dont have to be sitting straight up to watch 3D. You can watch TV in any position your heart desires and it doesn't hinder the 3D viewing. Also I recommend buying a high capacity USB flash drive (like 64 gigs). You can find them for around $30 and they fit around 20-30 movies! I pop the USB drive in the 2nd input and I have a library of movies to watch at a click. LOVE this TV!", "Date": "May 14, 2012"}, {"Title": "Best TV Ever... (simpson's voice)", "Author": "Rabbit", "ReviewID": "R3NJCQNO07X3DB", "Overall": "5.0", "Content": "This is one of the best picture quality TV's I have seen. It may SAY 720p, but it rrenders 1080p. Check LG website Model # 42PM4700. TRUST ME. Plasma is GREAT. My father has a 55\" LCD Philips. He also had to buy a dongle for it (wireless) Pshh! MY TV came with everything. AND Amazon installed it for free. Why do I say free?? Got this TV for A little over $600. My dads TV was way more than that. I won't tell him (I'll wait till he sees it himself) But my TV blows his out the water. it came with the wifi dongle. has 3 HDMI ports and 2 USB. Plus 2 components, Digital out, computer hook up, bla bla bla. One charges my 3D glasses and the other for wifi. 1 hooks up to my Laptop and will play sound through it. the other is hooked up to my PS3 and the other is not yet used. This TV has SO many features. That's why they call it SMART. The ONLY problem I have with this TV is that it will only pick up 3 DTV channels. Antenna or not. With my DTV box i pick up 10 alone. IDK what the prob is what it doesn't really matter to me. I don't even watch TV. all i do is stream Netflix, play through my Laptop and Ps3. I am SO satisfied. seriously you NEED to buy this TV. Buy the official glasses that go with it. they work flawlessly!!!Ok, 3D? Great!! will make ANYTHING 3D and the depth is good. Especially if the game or show is in 3d (duhh...) Makes my PS3 all worth it. and it has many options for 3D as well.Sound is LOUD. but not buzzing loud. Good quality! not much bass but I have a subwoofer for that ;-)Overall 8.5 AGAIN the TV should say 1080p because it DOES view.", "Date": "April 16, 2012"}, {"Title": "Its okay", "Author": "D. Yang", "ReviewID": "R2TXXZPPIT5D8N", "Overall": "2.0", "Content": "I am no TV expert but I am tech savvy. This is based on my personal opinion so far, first 5hrs last night.This tv is easy to set up, wifi or wired. Smart hub is okay, one down fall would be the lg apps(download apps, games, etc) they're limited and sluggish; premium apps runs fine, youtube, facebook, netflix all great. Haven't tested browsing online yet will update later. Also doesn't come with magic remote(wii like).It is on eco mode by default so it will not look as bright, you may want to change this to cinema, game, custom. While watching greys anatomy last night it would have a short flash(peel) affect when scenes would cut to another(not sure if its just that show) but you could barely see it. The soap opera affect can make this look shaky when this are moving to fast(action scene). Still need to mess around with tv settings to see what looks best. As for 3D have not tested yet, don't have glasses :( but TV plays Blueray beautifully very nice and clean.Smartshare is nice but you have to download nero media(vista/win7) to pc provided by lg.com, with smartshare i am able to watch backup of bluerays and dvds stored on my pc. Also you can view pictures and listen to music. The interface is okay only thing I don't like about it is scrolling left and right(hold buttons to go faster).will try to update some more since i've only had it for less than half a day. its still not a bad buy, has smart features and 3d(still need glasses), but its an affordable tv suits my family.BE SURE to click on bundle and add glasses... \"Make sure your seller is Amazon.com\" I overlooked this and didn't get my 3D glasses.**************** update 5/11/12 I'v changed the rating to 2. ***************************when accessing smart hub, tv sometimes doesn't load, I would just get a black screen and would have to restart(turning off and on) the tv, then try again.I thought plasma was for watching fast moving scenes/shows/videos like sports. But I'm seeing a lot of stutter when watching fast motion scenes, like football being thrown.I can't recommend this tv, picture/motion quality is not great, smart hub doesn't load or just freezes with black screen sometimes. Bought this tv when price was below $600, currently above $700 I would look for more options.", "Date": "April 27, 2012"}, {"Title": "Great TV made even better by its price", "Author": "VM", "ReviewID": "R2VKDN876QBWWY", "Overall": "5.0", "Content": "Had this for about 2 months now, so I feel safe writing this review. Regardless of price, I am very satisfied w/ this TV and would highly recommend this to anyone. The price only makes it that much sweeter. Don't let the 720p fool you; it displays DTV 1080i and Blu Ray content just as my 1080p LED's do, very nicely. I haven't viewed any 3D content, so cannot comment on that. See below for a more detailed breakdown:Good:-Pretty aesthetically pleasing-Easy to set up and tweak-Pretty good picture quality-ARC-Full Web Browser-For flat panel, decent audio quality-Unlike (2) LG LHB336 HTIB's I have, web updates are pretty quickBad:-Bezel finish is piano black; I was fooled (by ALL pictures on ALL sites) into thinking it was a brushed type finish-While bezel is pretty thin, it's not as thin as website (ALL of them) pictures look-Supplied WiFi dongle not the greatest; have a laptop in the same room that connects at 4/5 bars while the dongle would not connect at all sometimes (yes, I tested them at different times to  avoid interference or hogging)-Pretty heavy for a 42\" TV. I know it's a plasma, but a 43\" Samsung weighs in about 8 lbs less-On DTV SD content, the screen actually gets bigger and doesn't fit on the screen (it does not do this on my 1080p LED's). I've set both the TV and DTV STB to set ratio according to program.-Did NOT come with 3D glasses nor the '12 magic remote; of which, the latter is a big disappointment", "Date": "June 5, 2012"}, {"Title": "Amazing!  Especially For Price", "Author": "A. Marks", "ReviewID": "R3NV6LR7EQMR4K", "Overall": "5.0", "Content": "I've had this TV for 4 months now and am super happy.  I was worried about getting a 720 instead of a 1080, but I wanted a Plasma at this size, and wanted to save $ so I risked it - so glad I did.  The picture quality really is excellent.  I trusted articles that said that the difference between the two was really hard to detect by the human eye, especially from more than 8 - 10 feet away... and that's true.  Maybe someone can see a difference, but I can't.  Colors are gorgeous, blacks are rich - I'm very, very happy with it.  The TV has built in Apps like Netflx and Hulu Plus that are great - Netflix works terrifically.  You never know when they're going to upgrade and add apps - I wish they'd add Amazon Prime and HBOGo.  Still, the apps are pretty cool... ESPECIALLY when you want to check out the 3D content.  When I got this, it came with 2 pairs of 3D glasses. I wasn't particularly looking for 3D and I haven't watched it much, but when I have, it's been AMAZING!  There's some free 3D content built into the Aps (Sea Creatures!), and my cable (Direct) has some 3D content as well.  It's mesmerizing.Oh and TV came with a wireless dongle which totally works.  I found the TV very easy to use and overall very well designed - especially the remote.Sound is fine - nothing amazing, but fine.  Oh and people say that when it's off it's really shinny/glossy and reflective.  They're right.  And when it's on, if there;s a light on in the room in front of the TV, it will absolutely reflect.  I just turn the light off, problem solved.  Also good assortment of inputs and outputs - I haven't need to make any connections I couldn't.  I think there's three HDMI inputs, so far that's working for me.Unless you're super-wealthy, with any big purchase there's always some kind of trade-off, so you need to decide what you're willing to compromise on - price, picture, sound, features etc.  For me, this is the best combination I found out there for my budget and needs.  I'm super, super happy with it.  I don't notice a degradation in picture at all - I feel like I totally scored!Oh, and finally, no I don't have a blu-ray player.  Maybe I'd notice a difference in quality there, but I doubt it - images look really great as is.", "Date": "November 7, 2012"}, {"Title": "Great for Movies, TERRIBLE for Video Games", "Author": "ReprobaNomen", "ReviewID": "R1CG7S0LAQPPYJ", "Overall": "3.0", "Content": "This TV is a pretty good deal and has great picture quality.My girlfriend isn't a fan of the smoothing feature, but for visual spectacle films I love it.I haven't tried the 3D yet so I can't give an evaluation of that.I must warn you though that if you are a gamer do not buy this television.At the very least go to a store and see if you can test your console of choice on it first.I play a wide variety of games (racing, shooter, RPG, etc.) and every single game I have played has had a weird jitter issue. Smoothing fixes part of it, but makes other parts much worse.Example; Borderlands 2 just came out. Great looking game. When I'm turning the camera object seem to have a flickering ghost or shadow image ahead and behind of where the object should be. If I turn smoothing on it eliminates that problem, but now makes the crosshairs on my HUD have that issue and for some reason moving objects in the distance cause the screen to lag. I have no idea what's causing this issue, but I just wanted to make sure gamers were warned.If anyone has a solution please let me know.", "Date": "October 13, 2012"}, {"Title": "Mostly good.", "Author": "Darwin", "ReviewID": "R3IX7ZZWTI4JDK", "Overall": "4.0", "Content": "Overall not bad.  I wanted a bargain 42\" set from any reputable MFR other than Samsung (will never buy another piece of crap from Samsung; too bad they're so cutting edge because in my experience they are very trouble-prone and the MFR doesn't stand behind them).  Plasma vs. LCD wasn't a concern but it had to have built-in apps (for Netflix) and Wi-Fi.Regarding Netflix -- careful if you do what I did:  wanted to change out my DVD subsciption for streaming, but found that the streaming content (variety) is horrible.The Good:  nice looking set, but as others have said, some pics make it look like it has a real thin silver-gray bezel, when in fact it's 1\" and black gloss.  Still very attractive.  Picture is great, crisp and vibrant.  Unless you're right on top of it you'll never notice 720p vs 1080p.  Set-up was simple, including Wi-Fi and Netflix, right out of the box.  (Speaking of which, Amazon had it delivered by a local company who brought it in and un-boxed it for no additional charge, a nice surprise).  I find the sound quality to be better than expected, especially since the speakers are down-firing.  Menus are fairly intuitive, which is a good thing because the funtions are not explained very well on-screen, and not at all in the printed manual.  Haven't used 3D yet but that wasn't a buying consideration.  Wi-Fi works flawlessly.The Bad:  If they're going to include a free Wi-Fi dongle, why not just make Wi-Fi built in?  As it is, the only USB is on the side of the set, so the dongle sticks out just beyond the frame.  Similarly, 2 of the 3 HDMI are on the side, meaning the cables also show on the sides when plugged in.  Poor design.  If you use the rear HDMI, you need to get a right-angle connector for it or the cable will stick out too far to be flush with the wall.  My old Vizio had all down-facing connections, so cables could tuck neatly behind the set.  So far for a clean wall-mount I've had to buy several angle-connectors for HDMI, USB, and CATV.  The remote works fine, but don't be duped by LG's ads which show the Magic Remote -- it's compatible but doesn't come with the set.  The \"soap opera effect\" is awful, but like others I just set it to Game Mode (which turns off TruMotion) and I'm happy.  The screen itself is very glossy, so it reflects light sources such as windows during the day and lights at night. So overall I'm generally happy with the performance, but HDTV companies have had a decade or more to get the details right and I'm disappointed that there are so many design flaws with these new sets.  I don't know if other brands would be any different, though.", "Date": "July 1, 2012"}, {"Title": "Returned because I wanted bigger", "Author": "Elliott G.", "ReviewID": "RNN9HRUQQMVXP", "Overall": "5.0", "Content": "So yea, this IS actually a 1080p TV.  It worked great and the picture quality was quite nice.  Sound could have been a little better, but I'm an audiophile so I might just be overcritical.", "Date": "December 18, 2012"}, {"Title": "All that I expected", "Author": "Rizon538 \"Richard Doherty\"", "ReviewID": "R38F2VVDXVC36R", "Overall": "4.0", "Content": "I just receives my 42PM4700 the other day and it is everything I expected for the price I paid for it. Despite the problem 1 reviewer had with Pilot Freight they did everything I was told they would do. The picture quality is excellent. Streaming video quality is superior depending on the service that you use. I use Vudu and Amazon from my Blu-Ray player and there is very little difference from the Blue-Ray Disc that I own.LG 42PM4700 42-Inch 720p 600Hz Active 3D Plasma HDTV Set up was a breeze. Smart TV function is excellent for what it provides. 3D is good. I have not noticed the \"Soap Opera\" effect that most of the previous reviewers mentioned. There are some minor draw backs with this particular model but it is to be expected for the price. Of these the lack of included 3D glasses is the major one. Also there was no disc that contained all the programs that are required to take full advantage of the \"Smart Share\" cababilities. Had to hunt the LG web site to find the free downloads. Lastly HBOtoGo and Amazon Prime are not available for this model. As I said minor but enough for a 1 star knock down. Still I would recommend this set for anyone living on a budget who wants something more then just a TV.", "Date": "August 16, 2012"}, {"Title": "The most bang for your buck", "Author": "techsavvy", "ReviewID": "R28WCFB52F8CFJ", "Overall": "5.0", "Content": "This television has actually exceeded my expectations.  I took into consideration that this was a relatively inexpensive television given that is was HD and has the features of a smart TV.  I expected an adequate entertainment experience for a HD television equipped with internet and apps at the listed cost, it has lived up to that and then some.  I bought this television for the guest bedroom and after setting it up, I set it to the same channel as my EXTREMELY expensive television set in my living room and could not tell a difference in picture quality.  Maybe if they were side by side, but standing alone I couldn't tell any difference; the quality is much better than I predicted.  If you are looking for a good picture and the added benefits of a smart TV, for a reasonable price, you will not be disappointed.Also, if you have a smart iPhone, the app store has downloadable remote controls for the LG smart tv's if you don't wanna shell out the $80 for the magic remote.Buy it!  you won't find a better price to performance ratio in any other television.", "Date": "July 23, 2012"}, {"Title": "HATE THIS LEMON!!!!!!!!  DO NOT BUY THIS TV!!!!!!!!!  WARNING!!!!!", "Author": "Sherea Jordan", "ReviewID": "RHLH7LV9FP7LF", "Overall": "1.0", "Content": "I bought this tv in May of 2013.  Within TWO weeks it literally POPPED & FIZZLED!!!  A strange smell came from it and it completely shut off.  Obviously I considered this serious enough to replace this garbage.  Instead it was \"FIXED\".  Well, 2 weeks later it is having MORE problems.  It shuts off and on BY ITSELF.  My daughter was having a movie night with her friends and right in the middle of the movie the tv shut off and didn't come on until an hour later.  Everyone had gone home by that time.  Well the technician is coming out on June 5 to \"CHECK IT\".  What more needs to happen before I get a working tv or my money back.  DEEPLY DISAPPOINTED BUYER!!!!!", "Date": "June 3, 2013"}, {"Title": "Very Nice!", "Author": "birdlady", "ReviewID": "RX6RH80K1S3VH", "Overall": "5.0", "Content": "I read other reviews and settled on this model.  I've had this for a few months and am not disappointed with my purchase.  It was easy-peasy to set up with the onscreen step-by-step instructions.  The only issue I have with the TV, is the power plug.  If it is moved or jiggled in some way, the TV will not power up, or turn on.  I have the TV set on the stand and like the swivel option.  The plasma allows me to view the TV at most angles from the room, unlike the LED/LCD which have a narrow viewing angle.  As for the 3D feature, I have not had the need to use it at this time.", "Date": "May 15, 2013"}, {"Title": "Not compatible with Amazon Instant Video", "Author": "James A. Perrin", "ReviewID": "R12FYY36MUGO1S", "Overall": "1.0", "Content": "I just bought this TV based on the fact it was listed in the compatible devices with Amazon Instant Video. Not true! Does not support it even though it is listed. TV is going to be returned.", "Date": "April 27, 2013"}, {"Title": "TV is great but the interface is horrible", "Author": "Alan Duquette", "ReviewID": "RTMX2PA5AL5BX", "Overall": "4.0", "Content": "No matter what I try to do beyond watching TV, it gets confusing.  I can not even find the netflix app today.  Some days I find it by chance, but today is not one of those.  Tried menu (logical choice right) couldn't find it there.  Tried inputs, not there.  Tried my apps, not there.  Keeps mentioning a magic remote.  Sure would have to be magic to get through the confusion and I see why they figured something had to be done..Keep in mind this is not my TV, but all TV's should be intuitive.  Sure if I had a few weeks I could figure it out but I usually am only trying to do a simple task for my mother, but I find that she is usually right about the difficulty of operating it.  Almost every other device I come across I can operate the simple tasks within a minute.  Not this one.Today I discovered the my apps button which causes them to stay lit for less than 2 seconds before it throws you back to the TV.  So I try to scroll through them quickly but if I pause for more than 1 second I get thrown back to TV yet again.So I have to agree with all the other reviewers and say the TV picture is great but the rest of it is a joke.  But since the picture is so important I give it a 4 star.  Would have been an easy 5 otherwise.  Of course I have not checked into the 3D part yet.", "Date": "March 4, 2013"}, {"Title": "My first 3D", "Author": "breadpitt", "ReviewID": "R2LDBFKXWDCJZ6", "Overall": "4.0", "Content": "This is one of the two LGs I recently bought. After my Samsung died, I wanna try another brand and I was not disappointed. The picture is so clear and yeah the tru motion can have that \" soap opera effect\" which was kinda weird at first but i learned to like it. There is an option on picture settings to turn it off though. 3D is awesome..true 3D that is. The 2D to 3D just gave me headaches and the SMART TV is useless really. Other than that, This is a really good TV.", "Date": "September 8, 2012"}, {"Title": "Awesome picture quality", "Author": "Mickyimp", "ReviewID": "R2L46UY50QBKD0", "Overall": "5.0", "Content": "This tv is awesome. It shows blacks very well for a plasma tv I was surprised it almost feels like a led tv. I the picture quality and audio quality are just amazing. I was really surprised with the quality of this tv money well spent. Oh and the picture looks like it's 1080p but plasmas usually with such high refresh rates make any picture look just as good as 1080p as long st the picture is in hd.", "Date": "September 6, 2012"}, {"Title": "Good TV", "Author": "Tyrone Faison", "ReviewID": "R2K4EID881I1C4", "Overall": "4.0", "Content": "Great tv but you need to buy the 3d glasses $20 a pair, love the fact that you can watch netflix on it", "Date": "November 29, 2013"}, {"Title": "Only good for one year", "Author": "Aurex", "ReviewID": "RXH94NOO75ZRD", "Overall": "2.0", "Content": "I bought this TV last August. It worked fine until this August, just one week after its one year warranty. I did some research online and found in order to repair it may cost me up to 500 bucks! The TV was only 900 when I bought it and a new one now is only 600, yet the repair cost can be 500? Luckily I was able to repair it at the cost of replacing a power supply board, but a TV only lasts for one year is not a good product.", "Date": "October 16, 2013"}, {"Title": "Looks better then alot of 1080P sets", "Author": "MB", "ReviewID": "R3E2DJDESGB2I2", "Overall": "5.0", "Content": "I have had this TV LG50PM470 for going on 3 weeks and love it. The color has a wow factor. A very sharp , crisp , detail in the picture.I have tried off air,the Dish, and Blu-ray and even the streaming video on the wifi all have the wow! For the money here on Amazon and free shiping at $639 Buy one you will Love it.from the deepist blacks to the bright whites.", "Date": "June 15, 2013"}, {"Title": "great", "Author": "mlk", "ReviewID": "R23UMOZGAZBH9F", "Overall": "5.0", "Content": "this is a great product, never got any issues with it. i would definitely recommend this product again, great buy ...", "Date": "May 26, 2013"}, {"Title": "Love the TV", "Author": "John E. Wymore", "ReviewID": "R3S98BP3GX5RH", "Overall": "5.0", "Content": "I was looking for a HD TV that would look the best when watching 420 video and non-HD TV.  The plasma picture is clear, sharp, and has great colors--even when watching non-HD programming, DVDs, or streaming movies by cable.  The settings are easy, but take a bit of learning and trial and error to get them right.  The biggest problem has been the slight distortion that comes when filling the 42\" screen with regular programing.", "Date": "May 24, 2013"}, {"Title": "Im ordering another one", "Author": "antipostal", "ReviewID": "R2MF4T6GPSAR93", "Overall": "5.0", "Content": "I love my tv so much i will be placing an order soon. Thank you for the prompt delivery and the great price Adorama Camera. @Amazon thanks for connecting me with this seller. To anyone viewing this review just know it is a real deal and you will love how smart this tv really is.  All i am missing now is my 3d glasses and magic remote!!", "Date": "April 25, 2013"}, {"Title": "Very good tv", "Author": "tone3", "ReviewID": "R37DE7XI9UIM3D", "Overall": "4.0", "Content": "I bought this tv to replace a year old Samsung \"Touch of color\" lcd. There is nothing wrong with the Samsung but i prefer plasma and the LG was a good price.I know that it is only 720p but i cannot tell the difference at 7feet. I still need educating regarding the Smart part of this tv but so far i am very happy with it.", "Date": "March 20, 2013"}, {"Title": "Relieved!", "Author": "GodzillaGirl", "ReviewID": "RN5W11AJGA0BX", "Overall": "5.0", "Content": "Bottom Line:  I love this TV!  GLASSES: Were fine by my household: ages 9, 14, 16, 49I was was nervous purchasing online, especially since we returned the first TV we bought (Vizio 42\" LED 3D).  In fairness, we hook the TV up to coaxial cable from the wall.  After researching, seemed like Plasma worked best with that hookup.  We already have two Vizios which have been wonderful.  When I hooked up this LG in my son's room, the picture was HORRIBLE!  I had a small panic attack.  Then I remembered other reviews commenting on this and after playing with the settings--BEAUTIFUL.  I had a hard time finding how to program the settings; I think I accessed them via the remote, LG Apps.  Even going to Game Mode without other adjustments made it look great.  Another reviewer commented on poor design of the back inputs.  This may bother others, since the TV is already not ultra slim (3\" profile).  There are adapters available at Walmart.  I installed a full motion mount, so it's a moot point.3D:  I didn't notice any noise from the TV or the active 3D glasses.  I haven't played with the 3D settings, nor have I streamed a 3D movie, yet. Happy with the  2D-3D conversion, didn't notice any ghosting, but have only used it twice.  I was caught by surprise that a 3D HDMI cable was required: don't forget!  I will write a review on the glasses.There is a high glare with the TV, as others have reviewed.  On the TV box it says it has a screen protector, maybe that's why.  Our window is directly across from the TV and we can clearly see the closed blinds reflected on the TV.Gamers:  my son (10 years old) says he had to change the sensitivity level from 11 down to 2 on his PS3, even with TruMotion at \"Smooth.\"  His old TV was a Sony, first HDMI model (HUGE) It may not be noticable when replacing a newer TV.Wifi dongle: I only tried once and could not get Netflix (router is about 10 feet away, room doorways face each other), but that may have been Netflix and not the singal, I don't know.  My son uses the PS3 wifi.", "Date": "March 10, 2013"}, {"Title": "Best tv", "Author": "Ronald L. Esarey", "ReviewID": "R3U1DGIVROYEUD", "Overall": "5.0", "Content": "This is a 2 thousand dollar tv with all the bells and whistles.Internet,3-D,includes glasses.I have a Sony 729 that cost 2 grand and this tv out performs that in every respect.The 720 is no big deal,the only 1080p I get is a DTV pay for view,or a Blu-Ray movie,then I might see a 10% difference.Glasses are lighter,simulated 3-D is excellent.Has 3 HDMI,and 2 USB ports,and optical out for your stereo,that you wont have to switch inputs for audio any more,what ever is played from locals to Blu-Ray will play 5.1.I haven't notice any motion blur.The LG apps are slow and not much you want t see,the others work well.Save your self a grand and get the 720,best picture out of 6 HD tv's I own!!", "Date": "February 22, 2013"}, {"Title": "Too Cool!", "Author": "Leslie", "ReviewID": "R3RVWUG3KKHUJ1", "Overall": "4.0", "Content": "picture is great and I'm hoping to try the 3D experience.  Quite an upgrade from what we had, so really nothing to compare to. Like it so far.", "Date": "December 14, 2012"}, {"Title": "Perfect TV", "Author": "Kkkk", "ReviewID": "R1U2UB051K3T45", "Overall": "5.0", "Content": "I'd say getting all of these features for $700 50-inch TV is beyond perfect. Sound is surprisingly good coming out this heavy box. Refresh rate is nice playing MKV files or any HD movie is really nice. Also perfect for gaming, mobile phone control, I'd say it's a good investment for a nice TV.", "Date": "November 27, 2012"}, {"Title": "Excellent Value", "Author": "Ed   Land O Lakes, FL \"delgadoe4\"", "ReviewID": "R2ME7559CFT0AV", "Overall": "5.0", "Content": "This 50\" LG Plasma is FANTASTIC! Picture is great, streaming works flawlessly, hell, speakers are even decent. I still have external audio but that's only because I already owned a system. Price was great, paid in the $550 -600 range. Can't go wrong with this set.", "Date": "November 11, 2012"}, {"Title": "bright!", "Author": "Lil_warrior", "ReviewID": "RZKJK8Y61UN3Q", "Overall": "5.0", "Content": "The TV in general is AMAZINGhere is the run downWhen you order this, if the tracking and shipment is through PILOT, BE AWARE that they do not call you like they are supposed to! Look for the number and call them and set up a date  for the TV to be delivered, if you do not you MAY end up waiting 1 or 2 days longer than the shipment date says!!ALSO, if you have a surround sound for your non flat screen hd tv.. lol  it will not work unless you purchase the special output optical cord.... if you do not purchase it hear on amazon or over the internet, more than likely you will have to find a guitar center nearest to you and have to get them through guitar center!!  radio shack does not carry this wire!OTHER THAN THAT,  the TV and 3D along with an xbox is AMAZING. I couldn't be more satisfied!", "Date": "July 13, 2012"}, {"Title": "BEST TV EVER!!!", "Author": "Tymere", "ReviewID": "R1LOG8FQMS2TCV", "Overall": "5.0", "Content": "ok i bought this tv 2 days ago and i can honestly say this is the best tv i ever had! it arrived exactly on the scheduled time it was suppose to be delivered, i had to hook the tv up myself which i thought was gonna be hard but the instruction manual made it pretty easy & simple. the picture quality is amazing once you put it in game mode or whatever mode you like. i love how the tv plays regular DVD movies like a Blu Ray movie (meaning it plays very clear.) the 3D on this tv is great, you don't need to sit right in front of the tv to have a great 3D experience. it feels like i'm watching a 3D movie at a theater. but you need to make sure you have the official 3D glasses for this tv, there's only one kind that works with this tv. i didn't even know that this tv came with a wifi dongle, i was surprised by that. you do not need to buy surround sound speakers, the volume on this tv is pretty loud and goes all the way up to 100. i have absolutely no complaints with this tv whatsoever, especially with such a great price like this. 5 stars!!!!", "Date": "November 18, 2012"}, {"Title": "3D or not?", "Author": "Aline Chouinard", "ReviewID": "R225KQM9TH7MTU", "Overall": "4.0", "Content": "The picture quality of this TV is very nice even the sound is quite good.  I gave it a 4 star rating because the instruction manual is really poor.  However I got my questions answered at LG.Com using the chat line.  One needs active 3D glasses AG-S350 to see in 3D, this was not specified anywhere and the glasses need to be purchased separately.  Also, I use wireless headphones to watch TV, and a converter from analog to digital optical has also to be purchased separately.  The manual does not discuss all the controls at the back of the TV.  Setting up the network was a breeze and the adaptor was included...I did not get to see anything in 3D yet as I have just ordered my 3D glasses.  But, it think it is going to be awesome once I have all the widgets in place.", "Date": "November 16, 2012"}, {"Title": "Disappointed that the magic remote is not included", "Author": "Shu Guice", "ReviewID": "R9I7B5S6NU1CZ", "Overall": "3.0", "Content": "We expected that the magic remote is included in our purchase but it's not.  The browser is very difficult to work with when using the LG remote.  We just give up on even trying to use the browser now.  You can watch movies with the installed apps such as Netflix etc. without the flexibility to browse other contents due to the difficulty with the remote. We have Roku and Longitech Google TV.  I'd say Longitech Google TV with a keyboard is the best.", "Date": "November 15, 2012"}, {"Title": "Great TV, No Complaints", "Author": "Nico", "ReviewID": "R2MOASOQAQC421", "Overall": "5.0", "Content": "This TV is great.  Haven't noticed any problems at all.  3d is best on content made for 3d, but you can tell a bit of a difference on 2d-3d conversion.  Games are awesome, just played Halo4 in 3d....superb.  Haven't had any issues with it all, I stream movies from my PC using Nero Home Media Server, use Netflix, watch regular and HDTV, and play xbox, all of it a great experience.  3d glasses don't come with it, only drawback I had.", "Date": "November 6, 2012"}, {"Title": "LG 50\" Plasma 3D smart TV is excellent investment.", "Author": "Reader", "ReviewID": "R344LU3SXP2AJ", "Overall": "5.0", "Content": "LG 50\" Plasma 3D smart TV is excellent investment.The TV is excellent and has no problems except that it requires active 3D glasses, not the passive 3D glasses(cheaper)that LG is using on all of their LCD TVs.Image is 50\" plasma at 720p not full HD at 1080p. Still looks excellent!Smart features offer WIFI dongle included with access to Netflix, Hulu plus and other Apps.3D is active not passive and requires a specific set of LG 3d glasses and not the passive glasses LG uses on all current (non plasma) TVs.LG active 3d glasses for all 2012 plasma TVs are available on Amazon since Best Buy does not offer the glasses. Model of glasses is LG Electronics AG-S350.TV supports connection of hard drive to play videos, music with excellent smooth playback even 1080p format video.At 10 feet is is difficult to notice that the TV is nit full HD 1080p.Image is bright and smooth.  TV offers many custom color and screen settings.TV supports HDMI audio return when connected to a compatible audio amplifier or receiver.  This allows the sound from Netflix, Hulu or movies watch from hard drives to play their sound through the attached home theater audio speakers, using the same HDMI cable.TV offers 50\" bright screen(good color), smart TV features with included WIFI dongle, smart TV apps and optional 3D.", "Date": "January 10, 2013"}, {"Title": "This is a 1080 P TV", "Author": "Scott R. Allshouse", "ReviewID": "RI1FZLEQSRVOE", "Overall": "5.0", "Content": "This is a 1080 P TV and it has outstanding picture quality. It does have the soap opera effect that you can get rid of by using the game mode if you do not like it", "Date": "July 7, 2012"}, {"Title": "Best TV I for the money !", "Author": "ALS", "ReviewID": "R2E0R1WVUYVKZT", "Overall": "5.0", "Content": "This has to be the clearest tv I have ever seen. For the money, this the best TV you can buy. For an extra $100 for the 3D version is simply amazing.", "Date": "May 24, 2012"}, {"Title": "Great Picture", "Author": "Black Pearl", "ReviewID": "RD9GW3DUPEX0Z", "Overall": "5.0", "Content": "The picture is like you are right there in the action. I felt like I was easedropping on the character's conversations. I love this product. I rate the picture and sound is rted 5-stars. Love this television.", "Date": "May 23, 2012"}, {"Title": "Affordable 3D HDTV", "Author": "Mig", "ReviewID": "R2UW9ESFP2NV9M", "Overall": "3.0", "Content": "Bought this TV because it was an affordable 3D HDTV, remember if planning on buying this to have some type of HD video to see: YouTube, Blu-Ray, or HD TV Programming. I also have a blu ray player that I have used for this TV and sometimes the quality is the same as the DVD format and at other times it is not. I have an HDMI cable which should improve the picture quality. However, it really only looks great during action scenes or when there is faster movement. It being a plasma means it needs extra care and that motion is clearer compared with other non-plasma TV's. Also, if you plan on purchasing this product, buy it from original seller because you can get two pairs of 3-D glasses included for free as other consumers may have mentioned.", "Date": "December 17, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0074YRGOI"}}