{"Reviews": [{"Title": "A lot of tech for the money...", "Author": "Imperialdrive", "ReviewID": "R230U2JTLVMPN", "Overall": "4.0", "Content": "Appears to be the best bang for buck after a week of solid research before buying.Pros.  Easy to unpack, install, setup, everything is guided.  Lightweight.  Very low glare in bright sunny room.Cons.  I was really excited about the wifi media connect option.  It simply does not work well.  Very hit and miss is the best I can share.  Spent hours to give up.  Fallback was long Hdmi cable to laptop.Side.  Uverse works fine for me, using hdmi too.Feel free to ask questions.", "Date": "July 26, 2012"}, {"Title": "Great Purchase i ever made", "Author": "vkan \"vkan\"", "ReviewID": "R1PRDC6150ZU6N", "Overall": "5.0", "Content": "its really nice tv in this price, and also have wifi built in and works great, pict quality is really good, its really better deal in this price compare to samsung $1300 and sony $1400 its really half price tv with same features..love it , its almost six months no issue,,", "Date": "August 26, 2012"}, {"Title": "Pretty awesome TV for the dollar", "Author": "Drew Liebert", "ReviewID": "R37I7L5H39YLCH", "Overall": "4.0", "Content": "I'd give it 5 stars but I don't rate anything as perfect.Aside from that, this is a fantastic television.Easy to set up, mounted it on the wall in minutes. Had it up and running within 30.Have an Xbox, Roku, Wii, DVD and Antenna connected. Also connected to my PC with MediaConnect. Not a problem with any of them. Not sure why anyone would have an issue with this TV, it's so easy.I'd like to update. I've seen a few people having issues with screen flicker. I found that buy cranking the back-light to max and dropping the contrast and brightness to 50 it went away. As for a PC connection failure. If you are streaming from the internet or networked storage via laptop to your TV, you may not have the bandwidth in your wireless card to stay connected. Also, sound issues with SRS HD. Turn it off. Unless you have a perfect room acoustically, you will never hear it right.", "Date": "December 7, 2012"}, {"Title": "Very nice TV", "Author": "Mito", "ReviewID": "R2FTMAS7AOLNIL", "Overall": "5.0", "Content": "I love the feature that allows you to connect your PC or Mac (I've got a Mac OSX 10.8.2) and share your desktop with sound onto the TV screen.  I know of no other so-called SMART TV that does that.  It has good picture quality and is reasonably easy to setup.  A good TV for the price.The only thing I don't like is the light sensor which dims the brightness automatically at night - Good thing you can turn it off.", "Date": "December 31, 2012"}, {"Title": "Best Value, Lots of features", "Author": "Christopher M. Cardenas \"Time Waster\"", "ReviewID": "RFL1IEGUV0H1N", "Overall": "5.0", "Content": "Once I set it up I was pleased with this TV.  Be careful when you lift off the box that the whole thing does not tip forward falling on the floor.  This was not my first flatscreen but it was more than 3 years since I bought my last 32\".  The stand is a two piece setup, you have to use the small machine screws to attach the base to a heavy weight metal piece.  That then slides securely into the bottom of the LCD.  you have to team lift it to set it in place.After that start plugging it all in and you are set!  The onscreen setup takes you through a selection of settings that are easy to follow.  Think of an eye exam and selecting from the better of two images (#1 or #2 and so forth)The only thing that I noticed is that it did not seem to remember the picture setting that I chose among the presets when I turned it back on.  I'll have to check if the setting was set to automatic.  I liked the \"vivid\" setting the best.On the last note, the sound is excellent! I like the surround sound setting the best.  I won't get technical about it but it fills the room with rich, full sound that makes this whole LCD a pleasure to watch.I have not owned a 1080 LCD, mine was always 720. I bought a Sony Blue-Ray for about 64.99 at Sams' Club.  I wanted to see how clear and defined the picture really was; I was in awe!  I watched Rango with the kids and it was like watching it for the first time. (not the greatest movie, but lots of detail)There is a Vizio 50\" for the same price at Wal-Mart but it;s not a Net TV or a Smart TV.  I am happy with this purchase.", "Date": "November 28, 2012"}, {"Title": "Problems with TV and with Philips", "Author": "Katie", "ReviewID": "R26BRUIJUCC3V4", "Overall": "1.0", "Content": "I bought this TV for a 30th birthday present to myself.  I did some basic research and decided this one would be worth trying.  I was a little worried that a 50\" TV was so cheap, and apparently I should have been...you get what you pay for.Within a day or two, I realized the picture was flickering/flashing. It literally looked like someone was taking a picture in the background with a bright flash.  I called Philips and they had me go through all the usual tests...switching out my cable box and other cables.  I also tried watching a movie on my DVD player as well.  I figured if it didn't flash during the movie, it was a cable issue. Well, it flashed all through the movie.  I called back and they set up a ticket with a local TV repair guy.  He came out and told me that these TVs were having this problem because the assembly line wasn'tmaking sure some connections in the back were tight.  He took the back off the TV and confirmed that things were loose and tightened everything.  It seemed to fix the problem initially, but then the flashing was back.  I called him back and he said he did what he could and was going to suggest Philips send me a new TV.The new TV came and we set it all up and put the original back in the box to return.  As I looked at the TV, I realized there was something all along the bottom of the frame.  Upon closer inspection, it looked like white, cloudy damage, like the TV's finish had been rubbed off. I called Philips and explained they had sent me a damaged TV.  Theyasked me to send them pictures, which I did.  The frame looked terrible, but then I also noticed the TV was flashing as well.  At this point, I didn't even want the TV anymore.I got a call from a Philips representative and was basically told this...Philips fulfilled their warranty requirement by sending me a TV that worked and it didn't matter what it looked like.  The damage was acceptable because they had sent me a refurbished model, so they expect those units to sometimes have damage.I seriously don't know how in the world a company that has this kind of policy is staying in business.  I bought a brand new TV two months earlier that didn't work, they sent me a refurbished, damaged replacement, and expected me to keep it and deal.Needless to say, I will never, ever purchase a Philips product again. I am returning the damaged unit.  The only plus out of this experience is how wonderful BJ's has been (that is where I purchased the TV).  I spoke to a manager there and he couldn't believe Philips was not sending me a non-damaged TV.  He agreed to exchange the TV with another TV, even though it was past their 30 day return policy.I am now looking into other TV options that are NOT made by Philips. I might have just gotten a couple of lemons in my situation, but I would be wary of purchasing any item from a company with such a terrible warranty service.", "Date": "November 22, 2012"}, {"Title": "great tv", "Author": "David Payne", "ReviewID": "R1VPWSWCJHLY85", "Overall": "4.0", "Content": "I love the capability of the tv, while large it has a great picture and many options, the internet can be slow, but having a wireless router despite it's a good one, My xbox has not trouble linking to the internet, but the tv does have difficulty and is slow, but I still love it, a great price and great picture.", "Date": "January 4, 2013"}, {"Title": "GOOD PRODUCT", "Author": "Kelly", "ReviewID": "R232VP3TV0FCMW", "Overall": "4.0", "Content": "SINCE it's LCD not Led TV,but withe wifi tv ,the quality,it's good enough actually for $600 with tax.so I like it.", "Date": "November 20, 2012"}, {"Title": "Nice TV", "Author": "Steven Ranieri", "ReviewID": "R2H2NEZLHLC1WL", "Overall": "4.0", "Content": "It is a good TV for the price has a beautiful picture and is excellent for gaming. I'm really happy with this product.", "Date": "June 24, 2013"}, {"Title": "Philips TV", "Author": "Benedict G. Harucki", "ReviewID": "R3A5MIUJVZDRSG", "Overall": "4.0", "Content": "Great deal with cool features. Sharpness picture and enjoying with it. Similar to smart tv but much lower price and can't beat!", "Date": "February 4, 2013"}, {"Title": "So far, working fine.", "Author": "VAWOOD", "ReviewID": "RIFZ2YA7JIWC8", "Overall": "4.0", "Content": "Purchased at Costco for $579.  Husband loves it.  I had no problem getting the WIFI to work or U-verse.  Picture is great.  Only had two days. Will upgrade/downgrade rating after having a month.  But as of now, it's working great.", "Date": "October 8, 2012"}, {"Title": "Uverse does work. Great TV so far.", "Author": "CMART", "ReviewID": "R1ZVBD0XMZM6UM", "Overall": "5.0", "Content": "Read numerous reviews on multiple sites about compatibility issues with this TV and Uverse. No problem on my end. Downloaded the software update when prompted, so maybe that fixed the problem. Netflix works great, TV sounds good, picture is good. Downloads are slow however. For the price and features, this seems to be a real solid deal. Only logged an hour on the unit so far...but the reason for the post was to dispell the Uverse myth.UPDATEWatching the Olympics now and my picture is exceptional. After reading some recent reviews, Uverse customers still having problems. I recently had this particular box changed out for a newer box, so maybe that is the issue. Guess its a roll of the dice if yours will work. The vast majority of reviewers are having problems with Uverse. Cant say I am. Even my brother-in-law, who has numeorus high dollar LCD tvs, says this Phillips is great, especially for the money. Weird???", "Date": "July 27, 2012"}, {"Title": "less than a year old and I'm having major trouble ...", "Author": "KarenL", "ReviewID": "R3BDCVOVVEDCW5", "Overall": "1.0", "Content": "Picture has begun looking like a photo negative for the first 10-or so minutes... like a warm up period. I called Phillips to get it repaired and they really make a person jump through hoops.", "Date": "September 19, 2013"}, {"Title": "i will give it five but interface is too slow.", "Author": "joel", "ReviewID": "R3M8UY8IOQ4KM3", "Overall": "4.0", "Content": "I bought this TV a couple of months ago.ProsLow energy consumptionVery clear imagePlenty of HDMI ports.ConsInterface is slow in response. sometimes when i press to change inputs it will stay like i didn't press anything, but if you wait it will change.", "Date": "July 11, 2013"}, {"Title": "Good TV for the Price", "Author": "Charles B Ross", "ReviewID": "R3V45S38G2Q3QN", "Overall": "4.0", "Content": "The picture quality is good.  Only rated it 4 stars because it does not have a channel guide and the channel Info does not provide and good information.", "Date": "December 23, 2012"}, {"Title": "Big screen, neat features, nice price!", "Author": "Jason J. Brown \"Guitarist\"", "ReviewID": "R3E3GB84UIC8N", "Overall": "4.0", "Content": "The holidays showed up quick, and found myself with some extra cash after buying gifts. I felt stuck in the Stone Age with my trusty but antiquated old JVC D-ILA 52\" projection set, and decided to upgrade. I sought the balance of features, reviews and price, and settled on this Philips. It's a decent mid-level set. Here's my pros and cons:Pros:Big 1080p screen for good priceIntegrated Netflix app3 HDMI inputsGreat color recreation/contrastSlim bezel, stylish standWireless network connectivity out of the boxAudio isn't terrible for a flat panelCons:NetTV apps are lacking, run choppyMediaConnect is practically worthless, runs at a 2-5 second delayDynamic contrast and backlight causes annoying flicker in picture. Recommend disabling.No stereo RCA audio out, only digital coaxial60 Hz refresh rate causes some motion judderI could've sprung for an LED with all the bells, but this met my few needs, and I'm happy not to have broken the bank doing so -- so is my wife! If you need a good mid-level full HD set in this size range, I say go for it. If sleek onboard gadgets and 120/240 Hz are important, invest in a Samsung SmarTV or comparable set.", "Date": "December 18, 2012"}, {"Title": "Great TV", "Author": "Happy Buyer", "ReviewID": "R17GYLU7VJ91J0", "Overall": "5.0", "Content": "Bought this TV from Target after doing research. Very happy with this TV. Some reviews mention issues, but any TV will have issues. This TV has been perfect for me.", "Date": "October 8, 2012"}, {"Title": "Great TV", "Author": "krissskrosss \"kriss\"", "ReviewID": "R2IKEIC8G5974", "Overall": "4.0", "Content": "Our 40\" Apex hd LCD died, so we upgraded size and brand and couldn't be happier. I got this at Target on sale for $575 just before Christmas. The picture quality and audio are both great -video is crisp, full 1080 HD streams through my Sony 3D receiver, and audio has no pitch problems.  The remote works perfectly. We had it out of the box and fully setup in under 15 minutes, including our surround sound, gaming systems, blu ray, and wifi. I've read some say they have had problems with wifi connection, but we had no trouble at all.Highly recommend this TV, especially if you can get it on sale.", "Date": "January 30, 2013"}, {"Title": "Wonderful TV...Ships quickly", "Author": "Vince", "ReviewID": "R3H9KIFGAL294E", "Overall": "4.0", "Content": "I received my tv within 5 days from ordering....and TV works great!....has Netflix and YouTube applications and has ability to connect wirelessly to the Internet....sound and picture are great for price...I was very pleased with this purchase.", "Date": "January 8, 2013"}, {"Title": "GREATEST TV EVER", "Author": "hollywababy", "ReviewID": "RS4ABPCLQT6ZZ", "Overall": "5.0", "Content": "THIS IS THE GREATEST TV EVER!!! I was Hoping for a nice tv for a good price, what I got was a GREAT TV  for a super low price, excellent picture, net tv is the greatest thing ever!!!", "Date": "January 3, 2014"}, {"Title": "Missing Optical Coaxial Connection", "Author": "Matt", "ReviewID": "R206T6DX8CJ3YF", "Overall": "3.0", "Content": "Bought this TV for $498, it's a 50\" LCD, picture is great really no complaints the image is sharp and the colors are warm.It has 3 HDMI connections, VGA connection, WIFI built in which I connected to my network and it recognized my computer and synced with all my movies in a minute.The only downside for this tv is it's missing a  Optical Coaxial Connection to connect my sound system which was a turn down, however i managed to connect my speakers with a regular connector.", "Date": "December 12, 2013"}, {"Title": "philips 50PFL3807/f7 by Jaboy69", "Author": "jaboy69", "ReviewID": "R1PH4BTI0NSDJU", "Overall": "5.0", "Content": "I brought three of these televisions in 2013 and everything works great.  The smart TV internet connection was a problem for two days but I found out that AT&T; had to lower something in their modem.  I had to coordinate between Philips TV tech support and AT&T; tech support.  I am not a fan of the TV remote.", "Date": "October 27, 2013"}, {"Title": "Decent picture, but lackluster smart tv performance", "Author": "lover of herbs", "ReviewID": "RG4CN06CQYY9B", "Overall": "4.0", "Content": "We bought this unit at the beginning of the year, so feel as if we've had it long enough to give an honest review. This was actually our first large LCD flat screen and smart tv all-in-one. The reason we chose this unit over anything was for the low price at the time, the supposed smart Internet features and because it fit the entertainment center cabinet perfectly. If we were to choose again again we'd probably've left this one on the store shelf. And here's why.The smart Internet applications are incredibly slow and frequently prone to connection failures.  The menus are set up logically, but the controls can lag way behind. Just to get it to stay connected to our wireless router can be a chore. And when you access some of the free on screen apps connection failures are a common thing. It seems like we have to hold our breath when trying to connect to the features because we're not sure they will work all the time.We got rid of our satellite tv recently because the rates kept going up and thought this would be an alternative to paying too much. We ended up adding Netflix which is cheaper, but still limited on programming. A \"better than nothing\" attempt at still having some entertainment besides the whopping 2 local channels we get over the antenna. The controls on the tv for Netflix are painfully slow. Luckily we have the same app on the Wii which is much faster and easier to use. This tv seriously bogs when using any of the net tv features and they don't always connect and run. There is a computer interface feature of some kind that I guess will let you stream your laptops on the big screen, but haven't tried it yet and truthfully after fighting with the other poor performing aspects of this \"smart tv\" we're not going to waste our time. Philips must be using a very slow processor in this unit which we find almost worthless for Internet applications.On the brighter side we are satisfied with the picture quality and settings. The glare on this unit's screen seems to be less than on other lcd's. This no doubt takes away from the sharper clarity seen in other units. I think it helps in our tv's location because of all the windows and light in the room adding so much reflection. The 60hz speed is decent for faster movement, but surely not ideal for all programming. HD signal seems to help that. The sound is your basic mediocre down pointing speaker type setup. We would advise a home theater system in lieu of the poor quality sound you get strictly from these tv's.All in all a nicely priced unit, but lacks Internet capability speed & interface performance.", "Date": "August 30, 2013"}, {"Title": "Has been a great TV so far", "Author": "K. Waldroff \"KW in LR\"", "ReviewID": "RNDROEM6S6O3I", "Overall": "5.0", "Content": "I haven't had any issues with this TV.  Great style, design, and quality.  Would recommend.  Very good value for the price!", "Date": "July 26, 2013"}, {"Title": "Great TV for the Price!", "Author": "terrie horvath", "ReviewID": "RWEIWTNK039LF", "Overall": "5.0", "Content": "Bought this TV for $605 inc tax and enhanced delivery where they unpack it and set it up for u to make sure everything is working top notch. I mean for the price you can't go wrong for this 50\" TV with built in wifi and apps. Defiantly a TV for those on a budget! Picture is good and it was easy to set up and hook up the wifi.", "Date": "January 30, 2013"}, {"Title": "Great Price", "Author": "Paladorys", "ReviewID": "RCKJTTH047UC7", "Overall": "5.0", "Content": "Arrived without a scratch, hand delivered with the  \"white glove\" service. You even have the opportunity to inspect the contents and set it up to ensure it works before the drivers leave! Marvelous deal.", "Date": "January 11, 2013"}, {"Title": "50\" LCD Philips", "Author": "Roland \"~R.T.F.\"", "ReviewID": "R3UA2KCD95WU2Q", "Overall": "4.0", "Content": "Its a pretty good tv. It has a few small issues tho.Issue 1: Controller response time is very slow in \"Net Tv\" mode and on Netflix. This is probably due to the limitations of the included wifi usb dongle. Not sure if it will take an upgraded wifi antenna or not.Issue 2: Driver crashes caused with ATI 6870 when applying Digital Screen Over Drive.  This could be due to a firmware issue.Issue 3: Sound. SRS \"HD\" is a pain to deal with; especially with down facing speakers. Had the speakers been facing outward the sound would be enhanced a great deal. Settings on sound took a long time to manually calibrate for the room I put the tv into. Philips may want to consider making the speakers on the side or detachable. This would solve the problem with a minimum of expense.Issue 4: Security upgrade needed. All that is available for security is one of those walmart K-lock slots. The base is fashioned with a standard fillips head screwdriver screw. Would be better if they used or had available a fastener that was more difficult to dis-engage.Issue 5: No direct item registration for the tv. Im not sure if philips would do this with an upgrade or not. It would help prevent theft. ** to clarify; would be nice if you could wifi connect and register online.Pros:Excellent price. Excellent picture; would have been astounding if tv was 120Hz.  No idea what the contrast ratio is, I checked with Philips website and it wasnt listed; but it seems to have a slightly better than average contrast rating than the standard LCD pc monitor with the DPI cable hook up.Colors are sharp; when video is properly calibrated.", "Date": "September 29, 2012"}, {"Title": "Great price, great picture quality  and easy setup", "Author": "andrew", "ReviewID": "R3EEYVGP9OA9XW", "Overall": "4.0", "Content": "Before I buy this TV, I read comments about people having difficulty with Wi-Fi setup for AT&T; U-Verse internet. Since I have Time-Warner cable internet, I went ahead and purchased it. The Wi-Fi setup with cable internet was surprisingly easy. At first, I tried to use the automatic Wi-Fi setup, it didn't work. I then switched to manual setup, follow ion screen instruction, enter in the key code, and walla, it connected on first my try. The Media Connect feature was great too since I have 20Mbps download connection. However,when using Wi-Fi MediaConnect  I need to experiment with my PC monitor resolution until the annoying pop-up (warning about PC resolution too high) disappeared. Overall, this is a great product for $598.", "Date": "December 26, 2012"}, {"Title": "Not a great deal", "Author": "Marc Fisher", "ReviewID": "R3BQ386GUWCFSX", "Overall": "2.0", "Content": "bought this tv not from amazon when it was on sale. I wanted a 50 inch tv and my wife gave me a budget. We own another Philips tv and we love it so we thought this one would be just as good. Not the case. This tv shows a decent picture but the ambient light sensor dims it especially when there are shades of blacks on the screen. Makes it hard to see. The audio is awful. When you sit in front of it you can barely hear, but if your on the side of the tv it is blaring.For the price you are better off paying the 50 bucks and getting the vizio e500i.I am returning this tv and have ordered that tv from amazon.", "Date": "December 27, 2012"}, {"Title": "Do not buy if you have Uverse", "Author": "A. Reed", "ReviewID": "R1Z3TOJ1RTG8GA", "Overall": "1.0", "Content": "This tv is not compatible with Uverse boxes.  It will not hook up, and you will not be able to get a signal.  I spend over 5 hours troubleshooting between Uverse and Phillips support.  Finally the phillips support tech told me they this TV has had connectivity issues with Uverse boxes.  Save yourself a HUGE hassle and get a different TV.  There is no way around this problem, we tried everything.  I wish there would have been more reviews on this TV because I wouldn't have purchased it!!!  Even a quick google search with the model number and uverse will pop up a couple results with people having the same issue.", "Date": "July 20, 2012"}, {"Title": "Beware of Buying This TV", "Author": "Dawn", "ReviewID": "R5WYRQ7IQUIIZ", "Overall": "1.0", "Content": "Purchased a smart TV because I stream almost everything I watch. I don't have cable or satellite. This thing has been nothing but a headache. I've spent more hours on the phone with Phillips and AT&T; in the past week and still can't get connected. Both swear it the other company's issue. All my equipment is up to date, my router is only a few months old. I requested a box from Phillips to return the TV, since the delivery person had taken it with him, and they refused. Phillips said that there was nothing wrong with the TV, so they will not take it back. I now have a $600 paper weight.Update: Eight days later it is finally connected. I spent 5 out of the last 8 evenings on the phone with AT&T;, Phillips, and Belkin. The problem seems to be mainly with the new AT&T; modem/router. Apparently, this new Pace router is not compatible with Phillips at this time. Phillips has been trying to get a hold of one to find out what the issue is, but thus far AT&T; has been uncooperative. Imagine that! This router is only available for service providers and I suspect AT&T; is being uncooperative because they have this new \"Connect Tech\" dept. that charges you $49 to enroll and then $15 per month service fee to help you connect all your items. I, also, hold Phillips somewhat responsibly for the 10+ hours I spent on the phone because they knew of this conflict and it took 3 people and days of calls before they informed me of the incompatibility. Phillips told me I would have to replace the router, if I wanted to connect. So, $75, another hour long call to India, and ten more minutes with Phillips later, and I am finally connected.", "Date": "December 4, 2012"}, {"Title": "i have uverse and doesnt  work", "Author": "chris", "ReviewID": "R15ZJ6WG7OCVPL", "Overall": "2.0", "Content": "i have uverse downloaded the update, had att come out, got it to work but even they say the pic quality is poor about to go to target to return. This tv does have great features for the $$$. Just isnt good for uverse customers. Very frustrating and a hassle. Watched a blu ray on it and looks great. You just cant have uverse.", "Date": "July 29, 2012"}, {"Title": "Does not work with Uverse", "Author": "Pen Name", "ReviewID": "RDAKYMAZEQINZ", "Overall": "1.0", "Content": "Had to return the TV since it is not compatible with AT&T; uverse. The customer serviceline has no idea about AT&T; uverse.", "Date": "October 14, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "50\" LCD iPTV\nWiFi Built-In\nMedia Connect\nNetApps\nDLNA", "Name": "Philips 50PFL3807/F7 50-Inch LCD 60Hz Internet (Black) (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/5152SrrfrPL._SX300_.jpg", "ProductID": "B007B5WO9W"}}