{"Reviews": [{"Title": "An excellent buy", "Author": "Ted Kurkowski \"tkurkowski\"", "ReviewID": "R1FMCDP0B8MOL8", "Overall": "4.0", "Content": "I was looking for a very large screen TV with a good picture but without bells and whistles I won't use (especially the doomed current 3D technology).  This 55\" Vizio fills that bill at a very good price.  Its picture is excellent particularly after you calibrate it and you do, of course, calibrate your TVs, don't you? (I recommend the Disney World of Wonder BluRay calibration disk for that - it doesn't take long, makes a big difference, and is easier to use than the other calibration disks I've tried.)  On HD this TV is like the saying goes: looking at the world through a window.  The sound is better than most flat screen TVs but none are great because their thin bezels, while attractive, don't allow room for decent speakers.  I use the Yamaha YSP-2200 soundbar (see my review of it).  For the price the picture quality is excellent.It gets 4 stars instead of 5, because it has a slow processor so when you change to a different screen resolution it hesitates while it thinks about how to display it. This slows down channel surfing from Low-def to Hi-def and back.  I had a Toshiba 46\" that was better at this (although the Toshiba has its own foibles like not really allowing you to turn the internal speakers off).Still, all in all it's hard to beat this TV for the price.", "Date": "June 21, 2012"}, {"Title": "Great picture and solid TV for the price", "Author": "Drew S", "ReviewID": "R3IAEYBJ25M22S", "Overall": "5.0", "Content": "I have had this TV for the last week and it is great.  It is not the thinnest TV and there is an occasional skip in the image, but overall I am very happy.  I have had 4 or 5 people look at it and they all raved about the picture quality.  It mounted very easy to the wall and has two HDMI ports in the back and two on the side which makes it easy to hide the cables that you want and have quick access for temporary devices, too.  The set up was VERY easy.  The set walks you through most of the settings.  It has quick buttons on the remote for Amazon Prime, Netflix, and Vudu.  I do not think that you can beat this TV for the price.", "Date": "August 13, 2012"}, {"Title": "VIZIO E552VLE", "Author": "William D. Mauer \"bmauer\"", "ReviewID": "R13TX9VU5NFXY2", "Overall": "5.0", "Content": "This T.V. was very easy to set up, and Without any adjustments (except passcode) for my Router. I did not have any other adjustments. The picture was first rate. I say this is a great buy for anyone thatwants a 55\" at a great price. I highly recommend this HDTV.  Bill", "Date": "August 6, 2012"}, {"Title": "Did I say I love it?  Updated 10/2013", "Author": "Neil Rosenberg \"The real Neil\"", "ReviewID": "R2OONJZ8HFKQIN", "Overall": "5.0", "Content": "I'm not one for specsmanship.  If I was, I'd probably buy another product.  I am however quite impressed with this TV.  For a while I thought that LED backlighting was the only way to go, and it certainly has its advantages from a lifetime and power consumption point of view.  But you really can't beat a good old LCD/CCFL display for even brightness, and absolutely wonderful off-angle viewing.  Try this experiment yourself --  go to your neighborhood Walmart, Sams Club, or what have you and stand way off to the side of all of the sets and you'll see what I mean.  The best sets from this perspective (no news) are the plasma displays, but they have a LOAD of problems (bad overall brightness, burn in, power usage, heat).  The next best are the old standard LCD/CCFL units.  And they're getting really cheap nowadays, with everyone getting wooed by the ultra-thin LED displays.  Honestly I could care less how thick my TV is, within reason.  From the front, where I'm sitting, the difference is moot.  Really, 1 inch thick versus 6 inches.  Big deal!So, moving on, about this set.  OK, it weighs a TON, but once it's in place, again, who cares.  Then the magic begins.  The picture is to DIE FOR.  Vivid colors, really good contrast in spite of what the \"experts\" say.  And the smoothing action with 120 hz is truly incredible.  Makes everything look better.  EVERYTHING!It connected with my WIFI in a heartbeat, with no problems, it has built in Netflix, which I love, and best of all it has an easy to use ANALOG audio output jack on the back that I use with a old set of really great computer speakers from Boston Acoustics.  Cost me all of 50 bucks, and it kicks butt compared with the multi-hundred-dollar speakers you find now.  All I had to do is go into the TV settings, turn off the speakers and set the audio out to \"Variable\".  Now I'm controlling my external speakers with the TVs remote.  Awesome.Now for the bad news.  Speaking of remotes, the one that comes with this set leaves much to be desired.  The buttons are tiny and squishy, and with my normal sized fingers are really hard to find and press.  Do yourself a favor, search on Amazon and get yourself a Vizio VR17 remote.  Totally compatible, same abilities, and much better (as in BIGGER and not squishy) buttons.Be sure to price shop this one.  This is probably soon to be discontinued, and you'll find some pretty great deals out there (no names, but it rhymes with \"Bell\").  I got a new unit, shipped for $649.  Beat that!Enjoy, don't wait, and tell them Neil sent you.4/1 update (NOT April Fools!): Been finding that the Wifi connection drops after the tv has been off for a while.  Kinda annoying since I have to re-punch in the WPA key each time to get it back, which is no joy with this remote.  Finally decided to use the wired ethernet, which solved the problem.  Not sure what's up with the wifi, but be aware.10/19/2013 Update:  Well, all is *mostly* ok in Mudville, and we still like the TV ...but... we have come to strongly dislike the Vizio Internet Apps (or \"VIA\", a major selling point).  In fact we have replaced the internet functions on all our Vizio TVs with a standalone Roku streaming video adapter (2XS model) and are much happier with the situation.  In short, Vizio seems to have no interest in updating their apps and they frankly are really poor.  One would think that Netflix, Amazon or whatever on one product is like on another, but it's just not true.  I'm not motivated to give a laundry list of ways in which the VIA apps fall short, suffice it to say there are many problems -- so many that for us it's not worth the trouble.  Not to mention it crashes way too often, often multiple times per sitting.One other problem that showed up is that our Dish box would frequently lose audio when hooked up with HDMI to this set.  I was forced to use the one component input.  Weird.So, in addendum to my review (which I'll leave at 5 stars cause it's still a fine TV), I suggest avoiding the VIA stuff altogether from consideration, then you won't be disappointed.", "Date": "March 29, 2013"}, {"Title": "A Consumer Reports Best Buy", "Author": "Dr. D", "ReviewID": "R9P74B5R600JS", "Overall": "5.0", "Content": "I basically went with this TV based on the latest Consumer Reports reviews.  I went with the lowest price \"Best Buy\" and so far have been very pleased and everything works great.It is easy to set up and the picture on default settings is excellent.  I also find the speaker sound to be better than most TVs. This might be due to the fact that the TV is a bit thicker so they might have had more room to put in a decent sound system.I have used it with the Wi-Fi connection and wired ethernet connection from my router and both work flawlessly.  The network connections set up easily.  The apps load fairly quickly and are easy to navigate.The side HDMI input is nice as this is where I hookup my laptop.  I have a wireless keyboard and mouse so I can just sit in the living room and surf the internet on the TV.  This TV doesn't include a built in browser and I would rather just use my laptop anyway where I am free to use any browser that I wish.I haven't used the USB inputs since I can just hookup the laptop with HDMI and access any media this way.The remote is easy to use although the buttons are on the smaller side.  There is no backlight or keyboard which some people might complain about.  Entering text can take awhile when performing tasks such as inputting WiFi passwords.  But honestly you won't need to enter text very often anyways.The screen has a very wide viewing angle and is comfortable from most viewing positions.If you are looking for a great LCD TV and don't care about 3D technology, this is a solid choice. I ended up buying this TV from the WalMart site as it came with a free wall mount for the same price and they have a 90 return policy as well.  Amazon started charging tax to California residents so my preference to Amazon just went out the window.", "Date": "December 4, 2012"}, {"Title": "Very Happy", "Author": "Delivery Guy \"Ron\"", "ReviewID": "R8PLOX2MAGT0", "Overall": "5.0", "Content": "I have had this TV for two weeks now and am very happy with it. The picture is a definite improvement over my 7 year old 39\" Magnavox.Straight out of the box with a simple installation of the stand and an easy hookup of my components and i was watching an acceptable picture. The adjustments are not difficult but i don't think my parents would be able to handle them. Do the set up it prompts you to complete or you will see the set up screen every time you turn it on. It does require E-mail address and phone number but i give a deletable account information to avoid possible spamming and to protect my privacy. The picture was good but not great until i spent a little time doing the picture adjustments, setting the picture mode to movie, color temp to computer, and some advanced settings. It then looked amazing. Almost too clear, with the Luma tech, there is no really dark areas or loosing detail to quick movements or dark scenes. It takes a little getting used to the new clarity and lighting. Some shows got a surreal, almost soap opera feel to them but it seems like i am right there watching through a large window. The price was unbeatable at around $800.00 for a 55\" LCD 1080p 120Hz refresh rate HDTV with smart apps technology. The smart apps (or VIA) is cool but not essential. It does not allow for web browsing but has a download screen for more apps to add to the already installed YouTube, Facebook, Amazon, Netflix and HuluPlus. I downloaded one movie from Amazon and after a long load time, it was ok for an internet movie, not as sharp as a DVD. I am still exploring the toys this TV came with.It has 3 rear HDMI inputs and one on the side. Hooked up to the HDMI ports, i have a Roku 2 coming thru at only 480p but still looks better than that. I also have a DTVPal PVR that comes in at 1080p and looks amazing. Lastly a DVD that also comes in as 1080p. It also has a VGA input that i have my computer hooked up to. After finding the correct screen resolution for a 55\" monitor i was blown away by the graphics. I have not tried the Wi-Fi since I have it connected directly to my broadband by an Ethernet connection and it works good.---------------Cons: Takes 17 seconds after pressing power on for an image to show up.Slight, occasional random screen flicker on the VGA screen with my computer. Not sure what the cause is but not a very big issue. Screen aspect ratio on some channels would only display in a 4:3 aspect ratio even with the setting at wide screen. Some have said it has to do with the broadcast, but a few of the lower resolution channels are being received at a 480i and still displayed at wide screen and some at 720i would only do 4:3 ratio. I would like to use all of my screen to watch tv, annoying to see a partial image with black bars on each side.Sound is pretty good coming thru the speakers. They are built in to the chassis and are front facing so loudness is ok, but not as good as my old Magnavox that had speaker outputs ready to plug into. The sound was small until i adjusted the audio settings to turn on the \"TruVolume\" tech. Made a huge difference. I might invest in a sound bar later.-----------------Worst thing: The stupid remote is horrible. Junk. It is small, buttons are confusing and just flat out worked like bleep. I changed the battery and no improvement. Even at a distance of 6 feet, the on screen keyboard was hard and frustrating to use. The remote always seemed to have to \"wake up\" initially, then worked fine for 3 seconds and then would lag, skip, or not follow the buttons being pressed than would work good again for 3 more seconds. I would end up stretching toward the IR sensor on the TV until my arm and neck cramped and almost ended falling off my seat. I finally ordered a Harmony 300 remote for #34.00 and it works great.", "Date": "December 3, 2012"}, {"Title": "1 Repair and 3 Replacements Later and Still No Working TV", "Author": "Kurt Inderbitzin", "ReviewID": "R321WZL64WVXSJ", "Overall": "1.0", "Content": "We purchased the Vizio 55-inch LCD TV - E552VLE 1080p 120Hz HDTV and 32\" Vizio in June of 2013 for a vacation rental property we own. (We also purchased 3 Panasonic 42\" TVs as well).  They sat in the box for 3-4 weeks while construction was finished on the home, and then were unwrapped and set up.Our first renter complained that \"the Vizios had a mind of their own.\"  (The Panasonics worked perfectly).  And sure enough, when she left, I tested the Vizios and the remote and manual controls on the side of the TVs worked only intermittently.  So intermittently that the Vizios were essentially unusable.  I called Vizio and nearly two weeks later a repairman arrived to fix them.He replaced the motherboard in both TVs and the 32\" worked fine but with the new motherboard you couldn't hear any sound on the 55\" Vizio.  Ugh.  I called Vizio.  They agreed to ship us a new TV and take back the one that didn't work.  2 more weeks.The new TV finally came (a slightly different, and older model, I should add), and the delivery person set it up.  It was immediately apparent to me and the delivery person that the new TV was malfunctioning.  The top four inches of the screen flickered.  I plugged another TV into the same outlet and cable as the Vizio and no flicker.  I called Vizio while the delivery person waited (for over an hour) and the Vizio person on the phone said I need to find some other device to plug into the coaxial cable outlet on the TV, like a VCR or something, to test it, or she couldn't help me.  Unfortunately, all of my devices use RCA cables or HDMI, so she said she couldn't help me.  I refused the delivery and kept my old, soundless Vizio and got on the phone with Vizio again.A Vizio manager agreed to ship me another new TV.  About 2 weeks later it arrived.  We plugged it in and it worked fine.  The delivery person left and then 2 days later we moved our beautiful new 55\" Vizio where we wanted it and tried to turn it on.  Nothing.  No picture, no sound, nothing.I called Vizio and told them that enough was enough, I wanted my money back.  I was denied.  Instead, Vizio has decided to send a technician to my house to see what is wrong with my house (even though lots of other non-Vizio TVs in the house work just fine.)  It will take 1-2 weeks for this repairman to come to my house.It's now October, approaching 3 months since we first tried to use the first 55\" Vizio, and we still have no working TV.  3 months.  We probably have 7-10 hours invested in trying to get a working 55\" TV, to no avail.  Vizio has offered no compensation, no extension of the warranty, nothing.UPDATESo the technician came, replaced the motherboard, and the TV worked...for 1 day.  Then dead.  We have tried two other TVs in the exact same socket with the exact same cable hook-up and they work perfectly.  As it turns out, others have had this nightmare too.  Check out this link...scroll down and see what people have said to Vizio's CEO:  [...]UPDATESo today, after, I guess, going through nearly 4 months and 5 TVs, Vizio is refunding our money.  So happy to be done with them.UPDATESo we have waited for 2 weeks for them to pick up the piece of junk.  More than 4 months now of Vizio in our lives, multiple sets, none work...so many hours on phone.  I called them again today, and they said they had a mix up and forgot to send the box (long gone) to re-pack the TV and the shippers to pick it up.  Box came and the TV didn't fit in it, so back on the phone with them again.  Folks, this is as bad as it gets.  I wrote the CEO and got no response.", "Date": "October 2, 2013"}, {"Title": "Consumer Reports hit a home run rating this one!", "Author": "Lisa", "ReviewID": "R21NRYAF4YN6QL", "Overall": "5.0", "Content": "I purchased this Vizio based on the Consumer Reports ratings which were very high for this product and it did not disappoint. It is a quality product, great picture, but as high tec as it is, the remote and messages are user friendly for the novice user. Highly recommend. It will not disappoint you.", "Date": "June 22, 2013"}, {"Title": "Great T.V", "Author": "MattTheGreat", "ReviewID": "RHSLYVKCS07QD", "Overall": "5.0", "Content": "The T.V is amazing, with HD 1080 shows online. I cant believe the quality for how little i paid. Glad I picked this one. Trust me im 23 guy and i tend to be picky with theses kind of things. I heard the TV is not the best with gaming, but have not tested it yet. I have had different tv but this one beats them.", "Date": "September 9, 2012"}, {"Title": "Love It!", "Author": "mek", "ReviewID": "RE4JJHFZGLY1M", "Overall": "5.0", "Content": "Love this TV. I own another Vizio and love that one too. Our Samsung died so I bought this TV and have no regrets. The shipping takes a while (couple weeks) but worth the wait. Colors are great and the TV looks really nice.", "Date": "August 9, 2012"}, {"Title": "Another Great Vizio", "Author": "Big Jim", "ReviewID": "R16EUC0LTNUFB3", "Overall": "5.0", "Content": "Definately a five star item IMO.  I currently own a 42\",47\"and now the 55\" Vizio TV and dollar for dollar its the best deal out there.  I've had the 55\" for a month now and have no real complaints, I have noticed that when the TV is first turned on it there is a slight time delay. I would recommend this TV to anyone based on the features it has, especially the smart TV feature. I've already praised my Vizio, but just as important is the awesome Amazon service...Free scheduled delivery, unboxed and set up.", "Date": "September 7, 2012"}, {"Title": "Great", "Author": "AmandaLH1234", "ReviewID": "R1HP0QZDVPDOP5", "Overall": "5.0", "Content": "Works great. Looks great. Just what we were wanted. Have had no issues with this tv. Would buy it again.", "Date": "July 31, 2012"}, {"Title": "Couldn't be more pleased!", "Author": "Christine In Florida", "ReviewID": "R2NOU8YOC4FNSE", "Overall": "5.0", "Content": "Purchased this from Walmart in Oct 2012. For such a large electronic device with fragile internal components, picking this up in person vs. delivery was logical. This TV replaces a 'bulky' 32 Sharp LCD from 2005 which, by the way, still functions nicely in the spare bedroom.  As for the Vizio, the picture is clear without any color discrepancy.  One plus is the power consumption is very low compared to plasma models. Also, for those with a brightly lit room with skylights, the Vizio screen is non-glossy which tones down the glare and reflection.  The extra features such as Netflix and Amazon Instant Video(Prime makes it even better) come in handy for those days when there's nothing good to watch on the 200+ channels available through the satellite/cable company. I won't go into detailed specs as there are other comments that provide this. The only con with this TV is the extended delay for the screen and sound to appear after powering it on. Otherwise, it is highly recommended!", "Date": "July 21, 2013"}, {"Title": "Great TV at a price you can't beat", "Author": "Linda M. Tonyes", "ReviewID": "RGPLPE8226ZXC", "Overall": "5.0", "Content": "My 3 year old Samsung bit the dust so I was in the market for a new TV.  After getting zero customer support from Samsung I decided that I would never by a \"high-end\" TV again, especially from Samsung.  I stumbled on this TV while shopping around and, based on the good reviews and the low price, I decided on this TV.  I can't believe the picture quality.  It's amazing.  Beats my Samsung any day of the week.  No problems with installation and no adjustments necessary.  The apps are a cool feature and I was able to ditch my Roku box.  I would recommend this TV to anyone.  Save your money and don't buy a high-end TV, especially from Samsung.  You WILL NOT get your money's worth.  If I get 3 years out of this TV I'll have definately gotten my money's worth and won't be sorry with this purchase, as I was with my Samsung purchase.", "Date": "January 16, 2013"}, {"Title": "55 inch Vizio", "Author": "Brandon S.", "ReviewID": "R29I49XP80ILAL", "Overall": "5.0", "Content": "This was indeed a great buy. The picture is great along with the different apps that can be used on television. Worth every penny!!!!", "Date": "June 2, 2013"}, {"Title": "Picture is great, takes a bit to start up", "Author": "A. Hayes", "ReviewID": "R3IS93J5BHECF7", "Overall": "4.0", "Content": "We have been very happy with this TV for what we paid for it. It does take some time to start up and the remote once in a while doesn't seem to communicate well with the TV but for the price, features and it's size, it's a great deal!", "Date": "March 25, 2013"}, {"Title": "Outstanding, for the price", "Author": "Dennis A. Kauffmann", "ReviewID": "R2I6579XHDJUEQ", "Overall": "5.0", "Content": "I was looking for a decent quality 55 inch smart tv for a reasonable price, and found this one for $765 and free shipping.  I was a bit skeptical about the quality, but read some favorable reviews, so I decided to give it a try.  The tv has very good picture quality and good sound.  Set up was fairly easy.  The only minor downside so far is that the power cord is a bit short, especially when you consider wall mounting and running the power to a conditioner unit, as I am.  A few more feet of cord would be nice. The wifi menus are ok, after you get used to them.  The tv operates cool, which I noticed right away.  It replaced my old plasma, which always gave off lots of heat.  I give it 5 stars, mainly due to the fact that, for the low price I paid, I got all that I wanted, and a bit more.", "Date": "March 19, 2013"}, {"Title": "Outstanding Product... So happy that I chose to purchase from Amazon", "Author": "AvidReader66 \"Tina  R. Glenn\"", "ReviewID": "R2Y1R7B3TGDPVP", "Overall": "5.0", "Content": "I have never attempted to go out and catch one of the great sales that local retailers advertise on Black Friday, until this year. I have been interested in a Vizio Smart TV for several months after doing alot of consumer research etc. I stood in line and fought crowds at Walmart for hours only to find out that they only had 4 of the televisions advertised and those had been sold hours before. I will never go out on Black Friday again! It was actually a blessing in disguise that I did not purchase the television that day, as I found it on Amazon for far less than it was on sale at local retail stores. No tax, no worrying about getting the huge box home, etc. I chose free delivery and was really pleased with the whole process. My television arrived in approximately 7 business days. The gentleman who delivered it, unpacked it, connected it, and took the box and other trash away. It has a beautiful picture and is VERY user friendly. Within minutes I had it completely programmed.  I purchased Vizio HDMI cables, but I really do not think they are necessary for the same high quality picture. If you are shopping for a GREAT Smart TV, I would highly recommend purchasing the 55-Inch or larger Vizio from Amazon. The box that it is shipped in is VERY large. With the free, easy, and professional delivery it is hassle free.", "Date": "December 12, 2012"}, {"Title": "Nice TV", "Author": "egypt", "ReviewID": "RVM1MS7DP4KAZ", "Overall": "4.0", "Content": "Good price and excellent delivery time, the picture quality form VIZIO is just fabulous, the only thing i did not like was the thickness of the set, i own two more 55\" LCD and they are half as thick as this one.", "Date": "December 11, 2012"}, {"Title": "Awesome TV with one disappointment", "Author": "Rachael", "ReviewID": "RTB6CRRG724GT", "Overall": "5.0", "Content": "I really like this television. I have not had any problems with it. The picture is so clear that it felt like on of my shows was just looking through a window and speaking right to me. The only thing I am disappointed with(and I suspected it might happen) is that it did not come with the qwerty keyboard remote. I priced it and matched model numbers with Wal-mart and decided that this was the best way to buy it. Wal-marts TV did come with the qwerty remote, but this one did not. I was sure it should, but I had seen someone(somewhere else)complain that it didn't. Either way I am happy because the remote it did come with suggests the next letter around it, so it is not that bad. Also, this is the first time I have ever had a TV with WiFi and I was hoping I would be able to access Audible on it. It only has about 200 WiFi channels and many are ones I have no use for. I'm not sure if Yahoo channels will improve or what. I suppose I need to read up more on the ability to access the WiFi. I gave it a five because it is all that it says it is. The rest is info I could not find that I thought others might like to know.", "Date": "September 8, 2012"}, {"Title": "Replaced our projector screen, much better to view in ambient light.", "Author": "Lynn Blakely", "ReviewID": "R1W9A119RZ3GNG", "Overall": "5.0", "Content": "It is being used for projection of lyrics and bible scripture and sermon notes during our church services. Viewing is fine from 40 feet away. Very sharp and has good contrast and color.", "Date": "November 22, 2013"}, {"Title": "Great Smart TV", "Author": "vern mcgill", "ReviewID": "RE4WRCOA89PSO", "Overall": "5.0", "Content": "It is as advertised very satisfied. Smart TV is the way to go. A lot of TV for the price.", "Date": "November 2, 2013"}, {"Title": "Great TV for the money", "Author": "A. Alice \"Alice M.\"", "ReviewID": "R7CYAR93KDFZH", "Overall": "4.0", "Content": "Was looking for a good 55\" TV, but didn't want to spend a lot of money. Went with the E552VLE based on the reviews, and was not disappointed..  I ended up calibrating it based on online specs & was not disappointed.Would definitely recommend this product if you're looking for a good solid 55\" and need to save money.", "Date": "October 20, 2013"}, {"Title": "vizio", "Author": "mike miller", "ReviewID": "R3V4MXF7VDK62N", "Overall": "5.0", "Content": "This is a great tv picture quality is great . It has many cool features like blue tooth so I didn't have to run extra wire", "Date": "October 11, 2013"}, {"Title": "Great product for the price.", "Author": "Carolyn V.", "ReviewID": "R1VJ55YKYR0PLA", "Overall": "4.0", "Content": "I Would recommend this if you are looking for a great picture quality. The down fall is there is only 1 place for RF to plug in if you are ready for all hdmi products it is great the is plenty of places to plug in but I had to buy a converter for $20 so that I could plug in video game system, cable and dvd player. This was packaged great and when it was delivered there were no problems it only took about 5 days to arrive. My husband loves it he says VIZIO LCD is the only product he will every buy as it does not have the glare on it and looks like a real picture. If you have never watched LCD I would definitely recommend it looks like the people are in the same room with you. The setup was simple and only took about 5 minutes.", "Date": "September 15, 2013"}, {"Title": "Good price/quality combinations", "Author": "Kristi G Grant", "ReviewID": "R26X5TWS0F0RH5", "Overall": "5.0", "Content": "This TV is a great option for someone with a big/long room as ours - it has a good picture quality (all we watch are sporting events and Nick Jr... haven't seen any issues like delay etc with either).", "Date": "June 21, 2013"}, {"Title": "Great picture and value", "Author": "Jonathan Newman", "ReviewID": "R3VLK0ANHPHLVF", "Overall": "5.0", "Content": "This is an incredible TV for the price. High quality and the smart TV functions are easy to use. A must buy if you're in the market for the best value smart TV", "Date": "May 17, 2013"}, {"Title": "Great TV", "Author": "Justin", "ReviewID": "R29LY6PLJKWK6", "Overall": "5.0", "Content": "I did a ton of research before I bought this TV. I love it. I could not be happier. The best feature is the 4 hdmi ports.", "Date": "March 31, 2013"}, {"Title": "Great product and a great price.", "Author": "Scottyboy", "ReviewID": "R2LVK6E4LANSZJ", "Overall": "5.0", "Content": "I bought this for my cousin just before the state taxes were required in Texas.  It's better than mine and I wish I had it.  ha.", "Date": "March 19, 2013"}, {"Title": "Best Deal in town for Smart T.V. by Visio", "Author": "paul", "ReviewID": "R3N54OMCD0SBE9", "Overall": "5.0", "Content": "This Vizio Smart 55\" T.V, is more than expected. Picture is good. Sound is good as can be for T.V. sound.For the size and what the whole package of this size T.V. it is the best price for the package.I would and will tell others", "Date": "March 12, 2013"}, {"Title": "Great TV", "Author": "Michael Hughes", "ReviewID": "R7ELCO13L5PYB", "Overall": "5.0", "Content": "The only issue that I had was getting the base installed.  Other than that it's a very nice unit; great picture and adequate sound ( I did buy a soundbar later for watching movies).  Buying through Amazon is great; no sales tax and free shipping with limited help in setup.", "Date": "February 19, 2013"}, {"Title": "Great product", "Author": "W. Wissinger", "ReviewID": "R1668XOC14M5NA", "Overall": "5.0", "Content": "My second Vizio .  Great picture that is almost like being there. Start up is a bit slow but well worth the wait.  Delivery was excellent.", "Date": "February 16, 2013"}, {"Title": "Great TV", "Author": "Nay717", "ReviewID": "R37TMWD6JPDWYO", "Overall": "5.0", "Content": "The TV works and looks great and was easy to set up.  I love being able to watch Netflix without attaching another box to the TV.  The remote control is super easy to understand---even my husband can figure it out and that is saying something!", "Date": "February 5, 2013"}, {"Title": "Good value for the money", "Author": "Janbert", "ReviewID": "R372G5UPQOA3BP", "Overall": "4.0", "Content": "Read several ratings; best buy; great picture; first HD TV - met expectation.  used for only several weeks.  Viewed other brands for more $", "Date": "December 30, 2012"}, {"Title": "Nice", "Author": "Rxoss87", "ReviewID": "R16QNYX48FKK3", "Overall": "5.0", "Content": "Great picture, good audio. The smooth motion is a little trippy but a cool feature. Good for movies, sports, etc.", "Date": "December 13, 2012"}, {"Title": "Great deal!", "Author": "Jessejune12", "ReviewID": "R1WFMW5I26BBEK", "Overall": "5.0", "Content": "This TV is awesome! We bought a 55\" a year ago but our home was broken into and of course it was the first thing they took. Having to wait a year was horrible but well worth the wait. We love this TV! They delivered and set it up for us, the programming was so simple and fast and the ease of navigating through the apps is great. I would highly recommend this TV to everyone!", "Date": "November 27, 2012"}, {"Title": "Great TV for the Price", "Author": "Btkamp", "ReviewID": "R3MBHGW356AB3F", "Overall": "5.0", "Content": "Great TV for the price.  I was looking for a television for our family room in the basement and wanted something a little larger but didn't want to spend a lot of money as we have plenty of TV's in the house.  It has a great picture and sound is not bad also.  Would definitely recommend!", "Date": "October 8, 2012"}, {"Title": "Vizio 55in TV", "Author": "victor_and_sons", "ReviewID": "RRIL5Y5LDEKG7", "Overall": "5.0", "Content": "Excellent choice of television thus far.  Image is great and the internet apps work as expected.  Would recommend it highly to friends an family.", "Date": "October 1, 2012"}, {"Title": "very nice for the price", "Author": "cosmo", "ReviewID": "R39MFAW9I2ALKX", "Overall": "5.0", "Content": "I have been monitoring flat screens in stores and noted brands  i've been a fan of for many years sony and zenith televisions durability quality of picture.And a electronics jr high school student. I noticed sony picture I was impressed and found  vizio brand similar. Bright picture with realistic image was concerned.  I didn't know these t.v.'s have different picture options. Vizio surpassed all pictures of other brands I noticed for the price. I enjoy the product. my cousin told me that vizio is a subsidery of zenith surprised but picture perfection for me. I enjoy this product !", "Date": "September 9, 2012"}, {"Title": "Great Value", "Author": "scorpioman", "ReviewID": "R16MWJXLDKV32C", "Overall": "4.0", "Content": "I really like the TV, the built in wireless, and smart TV functions. I just wish the built in processor was better. I have issues with it freezing and lagging sometimes. Great picture!!", "Date": "October 31, 2012"}, {"Title": "Fantastic TV", "Author": "Good Stuff", "ReviewID": "RZCZP0845TYKV", "Overall": "5.0", "Content": "I have had nothing but great luck in purchasing from Amazon. This TV blows my mind. It has everything you are looking for in a flat screen LCD TV. All the bells and whistles. I looked for about a year for the right TV.I ordered this and when it was all say and done, my expectations were exceeded. If you purchase this TV, you will be very pleased.", "Date": "February 10, 2013"}, {"Title": "great tv", "Author": "Jerry was not bored", "ReviewID": "R1UMEQEETLJRD9", "Overall": "4.0", "Content": "very happy with the tv the wifi i have not had time to play with the unit doesnt come with paper work to help you", "Date": "January 11, 2013"}, {"Title": "OMG", "Author": "R. St Cyr-Camilleri \"Voratious reader\"", "ReviewID": "R1O8XM7N42A04P", "Overall": "5.0", "Content": "My ex husband was Sooooo jealous and you hooked it all up. I am going to buy another as soon as the house sells", "Date": "January 10, 2013"}, {"Title": "This was a Christmas gift to my wife and I from us.", "Author": "johndad5", "ReviewID": "R2DQ97LPYTRSHI", "Overall": "5.0", "Content": "We love it. It is so crystal clear. HD is amazing and even standard def never looked so good. I will not get into the extreme reviews. I am not a professional reviewer, just an average schmo happy with his product. Netflix is incredibly sharp and fast. I almost feels like we changed to a faster internet. The price is right and it we love it.", "Date": "December 29, 2012"}, {"Title": "More than I hoped for", "Author": "Pete57101", "ReviewID": "R3IHZ1LASARHW3", "Overall": "5.0", "Content": "I was a little apprehensive when I bought this as all the review sites downgraded it so much. There was a young lady on You-tube who basically said \"Don't listen to the \"pros\". go to the sites where people who own it and review it\"Well I did that and low and behold they all like it. We originally picked this TV at Walmart where they had a wall full of working TV's (all prices), and this is the one we liked best. We tried to buy it there several times and they never had it in stock.So I went to Amazon, they had it and it came fast. The picture is amazing, crystal clear. Don't care about the internet stuff much, but it's there and it works. If you watch a 20 or 25 year old movie, it reminds me of blue-ray. Detail is out of this world.Amazon sent this with enhanced delivery, the man helped me bring it in, un-box it, set it where it was going after putting the stand on. He turned it on, made sure the remote worked, made sure there were no dead pixels. He then said \"Me and cable boxes don't get along, I'm done.\" I smiled and thanked him. Oh, he also told me \"You are really going to enjoy this TV.\" WOW, was he ever on!Thank you Amazon, for the service and a wonderful TV, and for the outstanding young lady who called me 3 times until the TV was in the door and I was satisfied, Karen I think.This is the place to go, and OH, I saved money in the process.", "Date": "December 11, 2012"}, {"Title": "Smooth return", "Author": "Grandma", "ReviewID": "R3MQVJHRKM9YT9", "Overall": "2.0", "Content": "As Amazon always does, it asks you to review your purchase. I knew this was going to be hard to review because we had to send the TV back due to no picture but the process of sending it back when so smooth, it’s worth writing about.  I'm sorry I had to give it a two star review because the Tech support at Visio was cordial and very helpful. They walked me through the troubleshooting steps to make sure there was indeed a problem with the set and the folks at Amazon where fantastic and processed my refund without a hitch.  So this is more of a review of Visio’s and Amazon’s process, which for me, shows why I buy from Amazon.", "Date": "January 21, 2013"}, {"Title": "Not quite so wi-fi", "Author": "S. Foster \"Foster Child\"", "ReviewID": "R1BIQBXIOWTK2X", "Overall": "3.0", "Content": "Description describes as built-in wi-fi capability, but what it does NOT say, is you can only access the internet through prebuilt Vizio \"apps\" for specific websites, such as \"You Tube\" and \"Netflix\". Most require a paid subscription. There's seem to be no way to navigate to individual websites and stream video. The apps are limited - about 25 today and most are not even streaming video.", "Date": "February 20, 2013"}, {"Title": "Save the extra money and skip smart tv", "Author": "JandCThomas", "ReviewID": "R25Z6OA3LIPRRA", "Overall": "1.0", "Content": "We bought this tv, and have been very happy with the picture quality, but the wifi connection has not worked. We have already had a replacement, and the same thing, only this time hard wire doesn't work either. Save the money and just get a TV... I am in the process of trying for a refund since they conveniently swapped my tv, so now i cannot take back to the store. Buy another brand!", "Date": "November 7, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "VIZIO Internet Apps with built-in Wi-Fi for easy connectivity\n120Hz refresh rate\n1080p Full HD resolution\nTV without stand (Width x Height x Depth): 52.13'' x 34.45'' x 11.48'', TV with stand (Width x Height x Depth): 52.13'' x 32.56'' x 3.74''\nSRS Studio Sound HD audio", "Name": "VIZIO E552VLE 55-Inch 120Hz Class LCD HDTV with VIZIO Internet Apps (Black) (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/51RZDTki9GL._SY300_.jpg", "ProductID": "B007TEH0JE"}}