{"Reviews": [{"Title": "Pretty Good Value", "Author": "L. Cooke", "ReviewID": "R2K4S1H8VXQFFI", "Overall": "4.0", "Content": "Hey All,Okay for 5 years now I had been the proud owner of a Phillips 37\" LCD.  The local CCTV service has determined that they were no longer going to support ATSC and we are in the process of moving to QAM.  (I had built an attic yagi antenna and attached it to a pre-amplifier for over the air testing; however, being in a fringe area most desireable stations are 80+ miles away and too far over the horizon).  This led me to considering moving from my 720p to a 1080p monitor.After searching for a cost effective unit we stumbled on this little gem.  It has the desired interconnections and QAM (clear) capability I sought at a very reasonable price.  It was bright enough and at 46\" dia. offered a potentially 35% larger picture.  I set it up in a s-b-s comparison to evaluate the differences.So two major differences immediately stood out, the audio and the picture size:AudioThe initial audio was tinny and even adjustment of the built-in equalizer could not fix it, simply the driver/speaker/enclosure was not going to support anything like a thudding bass or much more then roughly 120hz at listening volume.  As to the opposing spectral end it was not going to support the \"twinkling of starlight\" much above 6500hz, (Though the equalizer top end exceeds this value by several thousand hz, and my being old suggests my ability to hear could be an issue; but, when s-b-s and you can hear the high fidelity on one unit and not on the other, well you get the picture).PictureAs to the picture, the image was very good when viewing 720p material, (I do not have the means to see the 1080p, yet, and the tuner was not sensitive enough for me to try an over-the-air, OTA, program for testing).  When viewing the normal SDTV images from the CCTV company it quickly reminded me of the difference between watching a VCR versus DVD for the first time.  By connecting to a 720p source both TVs offered good HD images.  The main difference was the format.With the Philips you have a widescreen option which frames most video full-screen without the aspect fuzziness of a zoomed image.  The Sansui does not have this capability; however, even in normal mode, if the programming is 720p HDMI both units provide the image in normal Cinematic mode of which the Sansui is 30-35% greater.So as to the differences, the audio is an easy fix, with both analog and digital output it is easily compatible with most component audio systems.  With the digital audio you should be able to connect it to most Home Theater audio systems or sound bars and get wonderful full audio results.As to the picture mode, simply put being 35% larger then my current unit, the Sansui offers a larger picture and though there may be a lot of unused screen space now, I am hoping when we connect up the CCTV HDMI digital adapter, a full screen 1020p HD image will resolve any short comings.Overall, I find that for the money I am quite pleased, enough so that it was worth trading out the entertainment center for a cabinet/stand.  Where I know LCDs are on the wane at least with this new unit being \"Energy Saver\" rated, even if not an LED, it should cost no more then my Phillips to operate.(Oh and PS:  The power connection on the back is not stable and can come loose easily, even though it still appears plugged in.  Given that, you should insure the connector is firmly pushed in and then either with tape or an adhesive clip, secure the power cable so the cable weight does not make it work loose.  Else, you may have an issue with the unit suddenly quitting and not powering up...)Cheers!Dave Cooke", "Date": "December 5, 2012"}, {"Title": "GREAT TV", "Author": "Gary Malone", "ReviewID": "R2K2COD1RDWXLX", "Overall": "5.0", "Content": "Having had 2 older fatback sansui tv over the years, now i own a 24 inch sansui with built in dvd for the bedroom and this monster 46 inch in living room. quality of the hdtv tuner is great, and having a pc that connects thru hdmi cable the desktop is great quality. Walmart carries the smaller size sansui tv's but go to amazon to get the bigger ones. worth the price!", "Date": "June 28, 2013"}, {"Title": "Pathetic", "Author": "Jen", "ReviewID": "R1Y9HDNR0NEC2", "Overall": "1.0", "Content": "Bought this television one month ago, worked great. plenty of plug ins and hookups. great picture. Lacking on sound and volume.However, 35 days after purchase the television completely quit working. Absolutely pathetic product, pathetic company. Just another cheap knockoff.....Bad thing is that Alabama Power (a southern company) promoted this item and sell it out of their appliance center.Point blank: DO NOT WASTE YOUR MONEY TIME AND EFFORT ON THIS PRODUCT OR ANY PRODUCT FROM SANSUI.", "Date": "September 28, 2012"}, {"Title": "great hdtv for the price", "Author": "jonathan.L.L", "ReviewID": "R2K9KC23EVLXQ5", "Overall": "4.0", "Content": "PRO: good image/ sound, lots of input , overall real great.CON: Can't find the video format for the usb decoding (if possible, maybe its just for picture and musique ?)OVERALL: Everything I needed and at a price my student wallet liked :D", "Date": "February 22, 2013"}, {"Title": "average", "Author": "SC donny", "ReviewID": "R3AF1TEXI843OE", "Overall": "3.0", "Content": "Not good for online gaming but otherwise an average TV. Volume does not turn up high. Some antenna channels are a little blockie.", "Date": "March 12, 2013"}], "ProductInfo": {"Price": "$900.00", "Features": "Integrated digital tuner with ATSC and Clear QAM\nConnections: 3-HDMI, component, 2-composite, RCA L/R stereo, PC, coaxial digital audio out, stereo audio out and RF\n1920 x 1080 resolution", "Name": "Sansui HDLCD4650 46-Inch LCD 60Hz TV", "ImgURL": "http://ecx.images-amazon.com/images/I/41ywNKVSHqL._SY300_.jpg", "ProductID": "B0075WEGAG"}}