{"Reviews": [{"Title": "Excellent addition to the \"man cave\"", "Author": "Wayne \"Omegafiler\"", "ReviewID": "RCB09P68A75V2", "Overall": "5.0", "Content": "I did quite a bit of research looking for just the right TV for my game room. This is an important detail when considering any review as well. Not everybody has the same goals. My requirements were at least 50\", no extra features, LCD or Plasma, good picture quality, and it had to be inexpensive. I already have a dedicated Media Center PC ready to go and never have liked \"smoothing\" or 120hz+ effects. Oh, and I wanted it here in time for the 2012 Olympics.It's being used in a medium sized Media/Game room that measures about 14' x 13', give or take a few inches. There are 2 windows with blinds. And I'm normally sitting about 8-9 feet away. This room has a couple of computers, so it's used as an office / game & media room (aka \"man cave\").DESIGN & INSTALLATION:The TV is only about 2\" thick at the outer edge and has 1.5\" border around the screen, so it looks very nice and thin. If you include the portion at the back that you can't see, you're a bit over 3\" deep. It also only weighs about 40lbs. However, there is a larger \"base\" at the bottom where the included stand mounts. This base protrudes towards the back almost another ½\" than the rest of the TV. This can be an issue when using the low-profile Cheetah APTMM2B mount I purchased as it does limit the angle at which you can adjust downward.Fortunately at 4' off the ground, and with the help of the spacers that came with the mount, I was able to just barely get the angle I wanted for the TV without touching the wall. That does limit where I can route the cables since there isn't space to run them towards the middle and there is no way any screw driver I have is going to fit or reach from the bottom to tighten the extra support screws. I'll have to get a bendy screwdriver or something to reach from the side; otherwise it's not going anywhere.I would still prefer that the stand mount at the back like others I've seen (and have), instead of bolting directly to the bottom. That eliminates the need for a larger base that's inevitably going to get in the way.There is also a small green LED on the front of the TV. Which is good as this TV doesn't make any noises turning on or off. It's dim enough so I never even notice it when I'm watching a movie at night. And it's not one of those LED's that gets super bright when you look at it directly. That's it on the front as all of the physical buttons are hidden behind the recessed backing to the left, including power.You can easily see from the specs to see what inputs it has. You'll also note I don't list having 2 HDMI ports as a negative. Considering its price and the fact that I'll be eventually hooking this up to a receiver that will handle all HDMI switching, it's not a factor for me.PICTURE:So how does it look? After its calibrated, it looks excellent. As with most TV's, the default profiles leave much to be desired. My sources are OTA (Over-The-Air) HDTV, Blu-Ray, DVD, and hundreds of other TV shows that I stream or have on the Media Center PC. So far, they've all looked great. Even lower quality content looks decent. I don't currently have cable or satellite.As with all high resolution displays, lower res content will suffer a bit without upconversion. Fortunately most of what I'm viewing is at least 720p or higher. Or it's already been upconverted. I've been watching the Olympics just about non-stop since it started and I'm still impressed with how good it looks.One of the most impressive features is just how darn good the contrast ratio and viewing angles are. This has one of the best black levels that I've seen on any LCD. We're talking Plasma or DLP levels here. With LCDs it's very common to to have that greyish tone to \"black\" levels, especially with movies or dark scenes. Not an issue here. I also have a work bench directly below and in front of the TV and I can easily sit there and watch TV without any issues. It's not a 100% perfect at that sharp angle, but pretty darn good.The only slight negative is when looking at certain large solid bright or light colored images, you can see some very slight unevenness in the backlighting. You can see some areas that are ever so slightly darker than others. I've seen this effect with other TV's as well. If you think that might bother you, just be aware.However, I will add that with the many different sources I'm watching, it's rare that I even notice it. And I'm quite sensitive to any imperfections in displays regardless of how minor they are. In many cases, I have a hard time even pointing them out to other people. :) I also noticed you can lessen this by adjusting brightness and backlight settings. So far, it's minor and rare enough that it hasn't bothered me.GAMING:I also wanted to use the TV for playing the occasional PC game. I'm using a 25' HDMI cable to hook up my gaming PC on the other side of the room for that very purpose. I simply turned on \"Game Mode\" and fired up BF3 and Starcraft 2. So far, I haven't run into any input lag and everything looks great. At least none that I've noticed. So as a PC monitor, you're good to go.It does have a VGA port if you want to use it, but for the best 1080p image, you'll want to stick with HDMI. If your PC doesn't have that, you can easily find cables or adapters to convert your DVI or DisplayPort to HDMI for a full digital picture.CALIBRATION:I wasn't able to find any other professional presets on-line for this TV, so I pretty much started from scratch. This is a combination of adjusting on the fly and a bit of help from the Disney World of Wonder calibration disc. Which I should note, is pretty darn cool. Since some of this is indeed personal preference, you may just want to use this as a starting point and go from there.Disclaimer: I'm not an A/V \"expert\" by any means and I'm still playing with these settings. :)Picture Settings:Contrast: 85Backlight: 54DynaLight: OffBrightness: 56Color: 52Tint: -3Sharpness: 4Advanced Picture Settings:Dynamic Contrast: OffStatic Gamma: 0Color Temperature: MediumCinema Mode: VideoNoise Reduction:DNR: OffMPEG Noise Reduction: OffTheater Settings:Picture Size : NativeAuto Aspect Ratio: OnSOUND & REMOTE:The built-in speakers are what I'd consider to be very average and \"typical\" for a flat screen TV. They're OK and get the job done. Just don't expect a full or deep range of sound. The options to adjust the speakers are also quite limited in the menu system. I'm running a 700W 5.1 PC surround sound system, so that's not an issue for me.The remote on the other hand, isn't great. It has all of the right buttons, but it's not universal, and is very picky as to how you're pointing it at the TV. Just the wrong angle or not aimed perfectly at the IR sensor, and it'll ignore your input. So it's a good thing there is that green power LED so I know it turned off/on. At least it gives me an excuse to eventually get another Harmony remote.Pros:+ Thin design+ Great Value+ Contrast ratio+ Color accuracy+ Viewing angles+ Picture quality+ LED Backlit+ Game ModeCons:- Remote- Average speakers?- Minor image uniformity issue*CONCLUSION:Needless to say, I'm very happy with my purchase. Everybody that has seen the TV is equally impressed with the overall picture quality. They immediately assume this TV costs twice what it does. This bright LED backlit TV works great in the \"cave\" and has minimal glare as a result of the windows in the room. In fact, it's so bright that some may find themselves turning down the backlight at night time.I also added an asterisk to the \"con\" for the uniformity I noted as it's so minor it's almost insignificant for my use. But I put it there as an FYI. So if you're purchasing this for something along the lines of what I was looking for, I consider this TV highly recommended. If not, I'm sure you'll still like it. :)", "Date": "August 10, 2012"}, {"Title": "Great Picture - Grate Price", "Author": "Christopher Anello \"Chris\"", "ReviewID": "RSZ761ODYOMM4", "Overall": "5.0", "Content": "I was shopping for a new TV for our family room after our plasma was shattered during shipping to our new home. I liked the quality of the plasma but it was heavy and would not work well in the new room full of windows. I found this 50\" Toshiba for the same price as most same size plasmas. I was concerned bout the fact that it was 60hrz instead of 120hrz but to be honest cant even tell. Probably once the Olympics starts I may get some speed issues but most movies are made to fit 60hrz anyways. Not sure what he hype is about the higher htz, probably just marketing. The screen is nice, not as reflective as other competitors, and nice and bright. The only negative side is the 2 HDMI inputs. For a good all around TV for cable and kids movies its worth it. If you are looking for TV with all the latest technology like 3d and smart than this is not for you.", "Date": "July 9, 2012"}, {"Title": "Great Budget Set", "Author": "jordan", "ReviewID": "R2SU3HP2VHHGFP", "Overall": "4.0", "Content": "I purchased this set as a replacement for my father's 5 year-old 42\" Philips LCD as one of those crazy Black Friday deals.  I was very interested to set this thing up for him, mainly because it occupied a couple new product niches for 2012: a TV with a 50\" LCD panel (previously the 50\" size was the exclusive domain of the plasma), and a Direct-LED backlight (or D-LED).  For those unaware, a D-LED backlight is a new backlight configuration introduced this year by many different manufacturers.  Unlike the more expensive and ultra-thin LED models, which place LED lighting along the edges of the screen, D-LED TVs use fewer LEDs spaced apart directly behind the panel.  D-LED is similar in concept to the \"Full-Array\" LED backlight found in the most expensive LED TVs, but use far fewer individual LEDs, and lack the ability to selectively adjust the intensity of the backlight behind different areas of the panel (local dimming).Look and feel:  This is a budget set, and it doesn't try to hide that fact.  The frame of the TV is constructed out of a glossy black plastic.  To its credit, the frame around the screen is relatively thin -- about an inch -- and makes the TV fairly attractive looking.  Beneath the glossy black frame, the TV features a piece of glossy silver plastic that tapers from either side of the TV and meets in a point beneath the Toshiba logo.  The stand is made of the same glossy black plastic as the frame, and the TV wobbles pretty easily when attached to it.  Being D-LED, the TV is naturally thicker than an edge-lit model, but it still only comes in at a few inches deep.  On the whole, I like the design of the TV, but the materials do feel a little cheap; I wouldn't expect much more in this price range.  The LCD panel used in this set is what I'd refer to as \"semi-matte.\"  For the most part, it's matte, but it tends to pick up a tiny bit of reflection compared to the completely matte Philips it replaced.  To that point, semi-matte panels seem to be about as matte as you can get on an LCD television these days.  I don't really see anything that's 100% matte anymore.The supplied remote is standard Toshiba fare -- in fact, it's almost identical the remote supplied with my ancient Toshiba HD-DVD player (a moment of silence, if you would).  It's tiny, the edges are too pointed, and the buttons are too close together.  I'd assume most people won't be using it past the initial TV setup in favor of a universal remote, so it's not a big deal.  I did not test the built-in speakers since I am using a separate A/V receiver and speakers.Picture quality: This TV exceeded beyond my expectations in this area.  Since it's backlit, it exhibited very good uniformity across the entire panel.  It has a spot that's a tiny bit brighter than the rest of the screen in the lower left hand corner, but otherwise it's perfect.  Backlight clouding and flashlighting are some of the biggest annoyances on LED TVs, and fortunately this one avoids that pitfall. Out of the box, the picture did not look very good.  Some basic adjustment in \"Preference\" mode while eyeballing it during different content yielded a vastly improved picture.  Note that this TV doesn't feature very many advanced picture options, but there are certainly enough to get by.  I'll post the settings I'm currently using, but please note that 1) I am not a professional calibrator by any means, and 2) What works for my set will not necessarily work the same on another set.  With that said, here we go:Mode: PreferenceContrast: 87Backlight: 53Dynalight: OffBrightnes: 55Color: 43Tint: 3Sharpness: 1ADVANCED PICTURE SETTINGSDynamic Contrast: OffStatic Gamma: 3Color Temp: WarmMake Sure Picture Size is set to \"Native\" rather than \"Full.\"  This eliminates overscan and will render the image pixel-for-pixel, doing away with any unnecessary scaling or cropping.I was impressed by the contrast of the L2200U. This is aided by a better-than-average rendition of blacks - while they won't blow anybody away, they are relatively deep for a budget LED/LCD; the black depth is further assisted by the TV's very good backlight uniformity.  The blacks are tinged slightly blue, like on many LCDs.Unlike the older Philips LCD this Toshiba replaced, it handles dark scenes and mixed-contrast content very well.  I tested this using Blu-Ray content like Tangled, Men in Black 3, and the Dark Knight Rises via an older Sony BDP-S1000ES Blu-Ray player.  The L2200U held together very well on difficult scenes, looking natural and well-defined. Shadow detail was above-average, rendering many details on Agent J and K's suits in MIB3.  I felt it tended to crush blacks slightly -- black areas tended to be a little too dark and lacked that last scintilla of detail and definition. Turning up the Static Gamma control revealed a bit more detail in black areas, but it started to look a little exaggerated or unnatural past a setting of \"3,\" so that's where I left it.Another concern I had purchasing this TV was that it was only 60Hz.  To my surprise, however, the L2200U held together very well during fast motion and panning during close-up or detail shots.  Many LCDs (like the one this one replaced) tend to smear and blur pretty noticeably during these types of content.  This Toshiba isn't free of motion blur, but it isn't major enough to be distracting or annoying.  In fact, I find the blur less noticeable on this TV than on my 3 year-old 120Hz Sharp LED (see my previous reviews for that one).  Be aware that as a 60Hz model, it can't render the hyper-real \"soap opera effect\" smoothing, if you're into that. Nor can it do 5:5 pulldown on 24p content like a 120Hz model can, if you're a film buff.Negatives: Viewing angle is not great; color fidelity and contrast drop off significantly off-axis.  It isn't the worst I've ever seen, but it's not good.  Not a big deal if you sit on axis.  I also noticed that during up/down camera panning, this TV exhibits horizontal banding  -- e.g. you can see faint, static \"bands\" across the panel when the camera moves up or down.  I am not sure if this is from the structure of the backlight or something else; vertical banding is usually more endemic to LCD-based displays.  It can be mildly annoying, but it isn't too noticeable unless you're looking for it.The point: Overall, the Toshiba 50L2200U exhibited very good picture quality that far exceeds its price bracket.  I'm generally quite picky when it comes to picture quality, and I found myself impressed by the image the L2200U produced more often than not.  Whether you're paying close to MSRP or way below it, this television is definitely worth it.  Recommended!", "Date": "December 6, 2012"}, {"Title": "Brilliant Deal", "Author": "Rusty Klesla \"Rusty Klesla\"", "ReviewID": "R3JIU7HVA5ZK41", "Overall": "5.0", "Content": "This TV handles everything I've thrown at it.I went with this model based on price alone. I got it at 650.00 from Amazon, and considering that I live in Canada and picked it up cross border it was an insanely good value. The closest I could find here was a 699.99 on a 50% off sale for the same model, and that doesnt include shipping (Free from amazon), 12% sales tax (no sales tax at the time from California Amazon partner), or Eco Fee (no eco fee in the US on consumer electronics to my knowledge). In all, I ended up paying the 12% tax to import it and saved over 200 dollars on eco fee/shipping charges. This was on top of the differences in TV Price.I did not want 3d, I didnt need a SmartTV with wireless or integrated internet capability. I run a 25' HDMI cord from my desktop to the tv already, and with a tablet (Samsung Galaxy Tab) I can remotely play, adjust volume, pause, stop videos from my desktop. Therefore, I wasnt after every bell and whistle offered in the TV market. That being said, this TV delivers on fantastic picture, fantastic and surprisingly powerful audio, and great depth of color. The start up is reasonable and much better than many tvs of similiar size. The picture remains awesome at almost every practical angle you can see it from... My neighbours could easily cancel their cable package if I left my curtains open.I highly recommend this TV, the price is hard to beat for LED and if what you're doing is displaying shows from your PC, playing Xbox, or watching TV/Sports then it cant be beat. If you want it to iron your shirt and pick you up when you feel down, try a human because the TV market isnt quite there yet.", "Date": "September 21, 2012"}, {"Title": "Best buy for the buck!", "Author": "Harry \"Harry\"", "ReviewID": "R1EXRSPQQW4AG0", "Overall": "5.0", "Content": "I aquire this TV at SEARS for $750 with tax. The image is amazing and it looks just like an expensive model. I had a Panasonic 52\" LCD Projection. You can imagine the improvement of my movie experience! The only thing I am concern is that if you are step too close to the TV, something like 3 or 4 feet away the image does not seen as good when you are farther. Anyway the TV  is like 12' away and I cannot ask for better picture. I believe that there is no better picture!Go ahead and buy it if you are a movie lover. You will be not dissapointed!", "Date": "July 10, 2012"}, {"Title": "Good performance for a bargain price", "Author": "RichC", "ReviewID": "R1PTK9ZZXZ61CK", "Overall": "4.0", "Content": "I purchased this TV because I wanted a simple TV with no frills and as big of a screen as I could afford.  Plus, the picture looked good to me compared to other TVs (which is actually the most important factor when buying a TV) and I preferred it to the over-saturated color look of many other TVs.  It looked more \"natural\".  I purchased this model from our small Sears \"hometown\" store for $699 minus a $75 dollar coupon.  The coupon more than paid for the tax and I only had to drive one mile to take it home.  No waiting for delivery and no fear of possible damage during delivery.  I was looking at the step up 46\" model (120hz and more expensive), but I could see no difference in the picture between the 120hz 46\" and this 50\" 60hz model.  I am using it to watch broadcast TV (cable and off-air).  I do not game or watch movies on disc.  If you want the big screen experience at a bargain price, this would be a good choice.  Black levels and contrast are excellent, and the color levels do not look over-saturated.  HD channels are a true pleasure to watch.  I would say that the picture on this TV is just a step below the picture on my friend's Panasonic plasma which is twice the price or more (that is actually a compliment to the Toshiba).  I only have very minor complaints.  The remote is very basic (not universal, but that doesn't matter since my cable remote is universal), there is occasional blurring in some fast motion situations, but this is very rare and I knew I would get some blurring from less than excellent broadcast sources with this 60hz TV, and colors can wash out a bit when viewed way off angle when compared to a plasma set.  The wash-out is fairly insignificant however and is typical for any LCD/LED TV.  High quality, live sporting event broadcasts such as MLB baseball, NFL games, the Olympics, all look very good.  If you don't need a TV with all the latest features, and you are not hyper-critical about the smallest details, then this is a good big screen experience at a good price.  Shop around for discounts on this TV.  I have the TV mounted to the provided stand on an AV cabinet.  It is easier this way to move the TV to any angle I want.  I have not tried to wall mount, so I cannot give an opinion on that.", "Date": "September 10, 2012"}, {"Title": "Excellent picture at this price point", "Author": "Matthew Hartman", "ReviewID": "RKRU73MLU5YZ0", "Overall": "4.0", "Content": "Skipping many of the details of how I acquired the set because they aren't germane to reviewing the actual set, I'll simply say that after much research, I decided on this set against a comparable 50\" Panasonic set that was an edge-lit LED.  I ended up with a floor model from Sears for $539.  Best Buy matched WalMart's online price of $498, but they had no manual (turns out I didn't really need it), no box and no original remote.  I live in a rural area, about 20 miles from the nearest city with any type of shopping centers, and after two trips to two different cities AFTER buying the TV,  I was able to find the 8 mm x 16 mm COARSE THREAD mounting bolts I needed to mount this set on my stand (in the same city where I bought the set in earlier in the day.....).  The mounting configuration on the back panel is standard 400 x 400 mm, but the actual mounting bolts are very specific - see above.First, this is clearly not a set with a ton of bells and whistles.  It's a pretty bare-bones video monitor with a limited number of video/audio adjustment options.  If you want a TV with those features, BUY ONE, just don't expect this set to be one of them.  If you want a good-sized TV/monitor for around $500, this unit will certainly fit your needs.  It's nice and light (noticeably lighter than the 37\" Sharp Aquos that this unit replaced) and mounting it on a stand is an easy operation; my wife and I recruited our 12 year old son to help hold the set, so I will say that a third set of hands certainly helps.Even if you don't have a manual, setting up this unit is a breeze if you have any experience with navigating onscreen menus.  It's very intuitive, and because of the limited number of adjustments, your head won't swim.SET UPDo yourself a favor and use the HDMI feature to run this set from either a cable/satellite box or A/V receiver.  I used to have Dish Network satellite service, but the receiver I had didn't have an HDMI port, so I was running my audio/video signals through optical/component video cables from my Yamaha A/V receiver to my Sharp Aquos.  Yesterday, since I had since switched to Direct TV (but never upgraded to the available HDMI connection because the install tech just switched over the wiring system I had and I never got around to upgrading it) I connected my new Toshiba (and DVD player AND satellite box) with dedicated HDMI cables.  I'm \"hear\" to tell you that it DEFINITELY makes a huge difference in both picture AND sound quality.  Man, I've been missing out on my audio!  I'm almost as impressed with my \"new\" sound quality (through a relatively decent A/V home theater system that includes Paradigm speakers and an Adcom 5-channel amplifier and sounded pretty good to begin with) as I am with the picture quality of my new Toshiba television.  It doesn't matter if you're connecting this set to an A/V receiver or directly to a cable/satellite box.  To get the absolute most out of your unit, use an HDMI cable (but don't get sucked in by elevated \"high speeds\" and big name brands; I grabbed three 3-foot cables for $10 each at Lowe's and they work fine).PICTURE QUALITYI will confess that I had a fleeting moment of that sinking, buyer's remorse feeling of disappointment when I first got the unit up and running.  The picture was pretty good in the store, but a bit less so when I got it home (and I'm all about picture quality; it's the only reason I bought this set).  Having no manual for reference, I just hit \"Menu\" on the remote, went to \"Picture Settings\", and entered the suggested settings of Jordan and Wayne (they were both pretty close) included in their reviews here. My picture quality immediately went from \"uh oh!\" to \"WOWZA!!\".  KUDOS TO JORDAN AND WAYNE FOR NOT ONLY HITTING ON SOME VERY GOOD SETTINGS, BUT SHARING THEM WITH THE REST OF US!  I wouldn't suggest dinking around with the picture settings on your own - just duplicate their suggested settings (I think Wayne had a couple of extra settings that might have been found in the \"Advanced Settings\" menu) and after that you might tweak some settings a couple adjustment points one way or the other, but I'm confident that to get the absolute best picture out of this set, your numbers should be pretty close to theirs. So don't get too crazy if you don't like the initial picture quality.  Like all HDTV sets, it's all about making the necessary and CORRECT adjustments to maximize picture quality.  With the right settings, this TV puts out an excellent quality picture.  However, keep in mind that what pleases one eye might not please another, and some people - lets face it - just don't know how to really dial in a television set.  Follow the suggested settings found in these reviews, and there should be no reason whatsoever to be unhappy with this unit's picture quality.At startup, I agree with other reviews after having noticed the 15-second or so lag time between power up and actual picture appearance.  A bit of an annoyance?  Kind of.  However, every television set I've ever owned had its idiosyncrasies, and this one is no exception.  However, I have yet to encounter any \"deal killers\".SOUNDI'm sorry to say that I can't offer an assessment of sound quality because I have this set running through an A/V receiver.  I haven't heard the stock speakers on the set, and frankly don't care what they sound like because I won't ever listen to them.  Again, I bought this set strictly for it's function as a video monitor - and at this price point, it performs admirably.  At least after 24 hours...*lol*REMOTEAs others have indicated, the remote is only average.  The \"Menu\" button is a small round one that would have been much better were it in the place of the \"CCaption\" button, which is one of the larger (not largest) rectangular buttons in the middle of the remote unit.  Others were also correct in their assessment of the finicky nature of the IR signal.  It is a bit of an annoyance, however I programmed both the satellite remote control I use as well as my Universal programmable (think Harmony programmable) to this Toshiba, so I likely won't use the Toshiba remote much.SUMMARYSo far, I find this set to be very, very acceptable for the price.  The colors are good, sharpness is good when properly set, I see no light issues yet, acceptable blacks - again, all very acceptable for a set in this cost range.  Yes, there are other sets out there with more adjustments, bells and whistles, and better picture (and probably audio) quality.  And, yes.........you'll pay for those features.  If that's what you need (or want) then hey, go for it.  If you want to upgrade your existing set (be it your first flat screen or you just want to update your existing one as I did), you don't need a ton of features (as I don't), and you DON'T want to spend big money (as I didn't) then I don't think you can go wrong with this nice little offering from Toshiba.I'm giving this television 4 stars primarily because of what I consider to be a relatively substandard remote control for a 50\" LED flat screen television.  As far as available picture quality, I give it 5.", "Date": "April 7, 2013"}, {"Title": "If the price is right, a very good bargain", "Author": "Michael Alexander \"LVBnut\"", "ReviewID": "RR49CJXQL2SFZ", "Overall": "5.0", "Content": "I titled this \"If this price is right\" because it really is a matter of bang for your buck.  This TV is not a five star unit when compared with higher end, and more costly, sets.  But of course that's not the point. I got mine on sale at Best Buy for $500, and at that price it was a very good deal indeed in comparison to other sets in that price range.  These Toshibas have a high contrast image that cuts through in even the most brightly lit rooms.  The VGA input works very well too.  No need for fooling with settings on the computer to get it to match. You'll find reviews that complain that there is motion blur or that the sound isn't very good or it has too few inputs and so on.  But most of these are comparing this set to more expensive ones, which isn't really valid.  You need to compare the sound and picture and options to others in the same price range.  As many of the positive reviews pint out, this is a good BASIC set.  And I do find that adjusting the settings to your own preference will improve things.  In my case I turn down the color intensity (a lot) and kick the backlighting and brightness up quite a bit.You can get a decent 50\" set if you don't have a lot to spend (and I certainly didn't).  That's why I'm giving it a 5!", "Date": "March 9, 2013"}, {"Title": "Great basic big screen TV", "Author": "Robert Petry", "ReviewID": "RG67KMB7W5NQT", "Overall": "5.0", "Content": "Great 50 inch basic set.  I watch quite a bit of sports and action movies have not noticed motion blur at all.  Very evenly lit, bright, and color accurate.  I use it with Uverse service, an AppleTV 3 and an old DVD player. All content really looks good.  I really am not interested in gimmicky 3D or some poor user interface for the web or Netflix/Hulu.  My AppleTV and iPad have those tasks covered well. I just wanted an excellent big screen for my content at an excellent price. The 50L2200U is perfect for my purpose.", "Date": "December 12, 2012"}, {"Title": "All excellent", "Author": "Endicott", "ReviewID": "R2AYPI1QR0ZL68", "Overall": "5.0", "Content": "I have two Toshiba sets this 50\" LED bought 3/2013 and a 26\" LCD from 12/2008.  The larger remote from the 26\" works fine on the 50\" model.  The 50\" set was fine right out of the box. If you're not using a separate amplifier, TV sound can be vastly improved by turning on the Dynamic range and increasing the bass setting.  A calibration disc can be employed to set the picture to Preference mode.  My set is SOLELY for watching standard dvds upconverted to 1080p by my Pioneer dvd player.  They've all looked great.  Good sharp colors & strong blacks.  This is a BASIC big screen set which fit my budget, so I couldn't be happier with this item.", "Date": "March 8, 2013"}, {"Title": "Great tv for the price", "Author": "C. Streeter \"picture taker\"", "ReviewID": "R2O3NPMPO7L7J", "Overall": "5.0", "Content": "It has a very good picture after the picture settings were set. Thanks to reviewers Jordon and Wayne, their suggestions helped me set it up. It is a nice looking tv . I don't care for the remote control. I wish it had come with a manual instead of direction to a website.A lot of electronics are that way now I guess. We are really enjoying it and feel it was well worth what we paid for it.", "Date": "February 7, 2013"}, {"Title": "2nd Time is better", "Author": "Queen", "ReviewID": "R3KSOMIGA734GA", "Overall": "5.0", "Content": "The 1st TV arrived damaged but I am quite pleased with the replacement.  The process to get the 2nd TV was smooth and easy.  The picture, sound and everything about the Toshiba is very good.  I also did not and have not seen a better price!", "Date": "January 20, 2013"}, {"Title": "Awesome TV!", "Author": "Gina", "ReviewID": "R3PIBSK5EPO8LC", "Overall": "5.0", "Content": "Love this tv. We had a rear projection TV for the longest time, so this was a nice upgrade for us. We didn't feel that we needed it to have the built in \"internet stuff\" Like You Tube, etc, and it was a great price!", "Date": "January 19, 2013"}, {"Title": "Sweet!", "Author": "Brian Henry", "ReviewID": "RQEYDS6VP5M6E", "Overall": "5.0", "Content": "If you are looking for a flat screen and want just a good picture with no other fancy features - this is it.", "Date": "January 13, 2013"}, {"Title": "Great non-smart TV", "Author": "Nadev", "ReviewID": "R6SJINVY0JJY2", "Overall": "5.0", "Content": "The Good:*Good picture quality.  Deep black levels and good contrast. Default picture settings are not great, but once calibrated you'll get good quality pictures.*Decent sound quality. A sound bar would make a difference, but good for general viewing.*HDMI CEC control. Works with most devices and can control them using TV remote.The Bad:*Only 2 HDMI inputs. 50\" TV deserves at least 3 HDMI ports. No Audio Return Control (ARC) available as well. That means you'll need a separate optical audio cable if you're using an external sound system to output TV's sound.*Menu system is not user friendly  IMO. Wish it had more than 1 user setting profile for pictures.*Remote is boxy and not easy to hold. Limited range and angle. You'll have to be right in front of the TV to use the remote.Other Thoughts:TV is 4\" deep despite its a LED TV. Reason being its direct backlit, not edgelit. However, it results in uniform backlighting according to experts.I think the panel is TN (not IPS), because picture quality reduces when looked from wider angles. Picture quality is great when you sit in-front of the TV and within about 45 degrees. Beyond that, picture quality distorts.It has a thin bezel, although it's boxy and not fashionable.Built quality seems to be good, but I can't comment on much since I've owned for about 2 months yet.Not a swivel stand, but pretty rigid.Finally, it's not a smart TV. No online capability at all. (That's why there are streaming boxes for).If you want a basic TV with good picture quality and decent sound, consider this TV.", "Date": "January 9, 2013"}, {"Title": "No longer a screaming buy.", "Author": "Samuel Chell", "ReviewID": "R3EGY3RG2NC6IX", "Overall": "5.0", "Content": "[219/13]:  It's much harder to give this set an unqualified 5 stars now that it's sitting even higher above the $500 mark, unlikely to dip back down below it.  At present, Amazon is showing a newer Toshiba with a faster refresh rate (120HZ) for the identical price ($700) as the pictured model.  The 50L2200U is still an excellent set at a reasonable price, but it no longer qualifies as a \"screaming buy\" as was the case when Amazon had it priced below $500 with Prime (no extra charges).][2/12/13): It was inevitable. Immediately after the Super Bowl the prices of popular Amazon big screens began to inch upward.  Only this capacious set by a major brand was available for less than $500 (complete), but now it too is being lifted by an \"upward draft.\"  In my experience Toshiba's picture, when properly adjusted, has matched comparable Samsung and LG screens. I have no interest in 3D, and I'm not convinced that double and triple refresh rates (120HZ, 240HZ) results in a visible improvement in the sharpness of a high def signal (perhaps it \"smooths out\" rapid, jerky movement in a few instances).  And even with separate Roku and Apple TV boxes, I have no need for more than 2 HDMI ports.  You can take your chances on the price dropping once again to below $500, but there's no guarantee it won't continue to inch upward.  (My hunch is that if this set had been priced in the $700-$800 area from the start, you wouldn't be seeing the number of gripes and complaints that have appeared recently--nonsense like \"The picture's great but the remote looks cheap and there were no printed instructions.\"  What do you expect--especially at a time when so many of these \"experts\" talk about the \"research\" they've invested prior to purchase.  We used to call it \"shopping.\"  If comparing TV sets on Amazon, or reading Consumer Reports, now constitutes \"research,\" we're in trouble!  Forget about medical advances, self-dependent energy, even the innovations we've come to expect in Silicone Valley.  \"Consumerism\" can be a catching, even disabling, disease.]Original Review: Toshiba, along with Sony and Panasonic, is one of the three remaining Japanese giants in consumer electronics.  They duked it out with Sony in the earlier HD DVD vs. Blu-Ray DVD format war (finally, decided in favor of bigger Sony, which had lost the former controversial big battle between \"VHS' and \"Betamax\" consumer formats).  After having acquired 3 Toshiba sets over the past six years (two of them with a built-in DVD player), along with a Toshiba DVD player-burner, a Toshiba laptop computer, and finally a Toshiba external hard-drive, I have no reservations in recommending their products--the quality and durability have left nothing to be desired (a set that arrived DOA was quickly replaced by Amazon).  I can't recall the smallest little problem let alone a malfunction with any Toshiba product--and a Japanese student once assured me that in Japan the Toshiba name commands respect equal to its two larger rivals--both for its R&D; and the quality of its products.As currently priced (a new 50\" Toshiba LED for under five hundred?), this high-quality \"brand-name\" set is going for less than the inferior generic names currently showing on Amazon (including the generic sets with the transferred, now-meaningless titles of past fallen angels like Magnavox, Sylvania, GE, RCA, Westinghouse).  Unless you're a compulsive gamer or hockey fan (they say that little puck requires the highest \"refresh rate\" possible), you won't find a better value anywhere as of 2/4/13 (especially as I see the prices of other sets moving higher immediately following the pre-Superbowl sales hype for big-screen TVs).  As for big screens, Toshiba has made the decision, at least for the time-being, not to go higher than 55\".  They know what they do well and can always be counted on to come to market with a well-tested, reliable and certain winner (which is more than some of us can say for the Super Bowl itself!).In sum, the reasons for the current price (under five hundred) of this 50-inch, well-reviewed, reliable and \"authentic\" brand (the Toshiba name first appeared in 1978, but the company was founded in 1939) are two: 1. the set maintains the original refresh rate of 60HZ rather than the currently more fashionable 120HZ; 2. the set has \"only\" 2 HDMI ports rather than 3 or 4 (for DVD player, Roku box, Apple TV box, etc.) found on most new big-screen sets.  Both are negligible inconveniences that will not interfere with anyone's enjoyment of this Toshiba set which, in addition to offering high definition television with LED lighting (in an expansive yet thin-and-trim frame), guarantees anyone with Prime an unbeatable value.", "Date": "February 4, 2013"}, {"Title": "Just What I Wanted...", "Author": "L. Hendricks \"larrylove711\"", "ReviewID": "RWAUBHXIG1ZCD", "Overall": "4.0", "Content": "I bought this TV for $588 + tax at PC Richard and Sons. Thought there might have been a catch, but there was none. The TV looks great, sounds pretty good and the picture is phenomenal. If you're like me and looking to get a large size LED for a great price... and you're not too sure if you can really tell the difference between picture quality (if it looks good, then it looks good!) don't be afraid of the price of this set, if you see it discounted. No looking back for me... I'm too busy watching this great TV. Only 4-stars because I wanted a deeper bass in sound from the TV... but that's nothing that my surround sound system didn't fix. Getting a sounds bar and sub woofer soon... game over!", "Date": "August 10, 2012"}, {"Title": "Economical", "Author": "Princess_Zelda", "ReviewID": "R37HD4BQRCTCT3", "Overall": "3.0", "Content": "Good for the price. The picture isn't as fancy as I would like. I also have a smaller Sony TV and I can see freckles on actor's faces, whereas this tv detail doesn't stand out as much. Excellent choice for Gaming if you're into it.", "Date": "June 6, 2013"}, {"Title": "Great Picture", "Author": "Debbie Temparali", "ReviewID": "R2KW1KPY3D69QX", "Overall": "5.0", "Content": "I really am very satisfied with this product.  The picture quality is very crisp and clear. This was a replacement for an older projection tv, and it's much clearer than the old one, and it has 2 HDMI connections.  Love it.", "Date": "May 27, 2013"}, {"Title": "Great TV", "Author": "Sway Brown", "ReviewID": "R3FFDYZL91DMB8", "Overall": "5.0", "Content": "I love this TV. It shows great, the sound it great. Everything is great. I chose to wall mount it in my living room and it's perfect. I am very happy with the purchase and the price was awesome ($470.24) unbeatable price for a brand new 50 inch flat screen!!!", "Date": "May 19, 2013"}, {"Title": "Perfect", "Author": "Mike C", "ReviewID": "R1KGTAVY2DFRCQ", "Overall": "5.0", "Content": "I'm not going to make a big presentation. This TV is perfect for us, with no complaints. I'm not sure why people said the sound is weak. I've never had the volume above 11 (goes to 100) and I sit about 15' from the TV. I will say that I had tried turning it way up and noticed the sound is a bit muddled at louder volumes. If you're just looking for a bigger TV or a basic flat screen, buy it. If you're an entertainment aficionado, then you're going to want to spend more than $700 on your TV.", "Date": "May 10, 2013"}, {"Title": "Love it!", "Author": "K. Heylin \"Mornin'Blues\"", "ReviewID": "R1LEO72O8LKLDB", "Overall": "4.0", "Content": "Love the TV. Works great and the prices was great to boot. Just one issue, have a problem with the audio. Only when the audio is coming from the TV, about every 10 to 15 minutes, there is a silent gap of about 1 or 2 seconds, they it works normally again. When I plan the audio through my surround sound system, I never hear these gaps (or not hear)", "Date": "April 24, 2013"}, {"Title": "Works well", "Author": "Kevin J. Bratton \"Kevlar\"", "ReviewID": "R1JUYL43I50UK2", "Overall": "5.0", "Content": "Great deal for the money.  Remote is small and manageable, not a backlit remote. Nice picture. Sound is surprisingly loud.  I often run it at level 1 or 2.  Could use a little more gradual sound control. Lots of inputs. Not sure about gamer lag on XBOX but seems about par with my other TVs.", "Date": "April 18, 2013"}, {"Title": "Gorgeous Picture", "Author": "J. Spencer", "ReviewID": "R14YUDGWA0GO6O", "Overall": "5.0", "Content": "I can't really add much more than the other great reviewers on here have said.  This TV is a no-frills unit which excels at it's primary purpose: watching TV.  You won't find any internet connected gizmos or apps.  No 3D, no SuperFluid 580 Hz Motion.  Nope, this TV gives off a beautiful picture for a very reasonable price, and that's plenty for me.  I have never noticed a problem with watching anything even though the TV is \"only\" 60 Hz.  If I remember correctly, my computer monitor \"only\" refreshes at 60 Hz, and I've never had any problem with that, either.I knew when I bought it that it only comes with two HDMI connections, and that is a minor inconvenience, but for the price, you can't really complain.  In my case, it simply means I have to disconnect the Blu-ray player when I want to play X-Box, but I can deal with that.  What I can't deal with is my wife screaming at me when she tries to watch a Blu-ray but can't, because I forgot to reconnect the HDMI cable.  I can't really blame that on the TV, though.  ;)I have always found the built-in sound on TV sets to be lacking, and this one is no different.  For the 30 seconds that I used the TV sound before I finished connecting my sound bar, it sounded tinny, and lacked bass.  Again, no complaints there.  You'll always need to use external speakers to get a fuller range of sound.All in all, I am very pleased with my purchase.  The picture on HD cable channels is gorgeous, and blu-rays look even better!  I couldn't ask for more.", "Date": "April 10, 2013"}, {"Title": "Good value for your dollar", "Author": "Anonymous Alternative Name", "ReviewID": "R1VSJ1RL6PES5D", "Overall": "4.0", "Content": "Picture is great, sound is great, I like everything about how the unit functions. It's also great in the aesthetics department, and the price is good too.There are only two HDMI inputs. In this day and age, everything is starting to hook up to HDMI. My Xbox, Bluray player, laptop, and phone all plug into HDMI, and I would assume a lot of people will have cable or sattelite hooked up via HDMI. I'm not asking for 12 inputs, but I do think 3 or 4 is completely within reason. I can't think of any other issues I have with it.", "Date": "April 9, 2013"}, {"Title": "Great bare bones HDTV", "Author": "Terry M Harcar", "ReviewID": "R2ZAL7VSUEVC30", "Overall": "5.0", "Content": "Toshiba truly does make a great looking screen. No backlight bleeding along the edges as it is a full array screen. Uniformity all across the screen is superb. Semi gloss screen is fine in bright daylight. Takes a bit of tweeking to get the color right. Colors pop off the screen during BlueRay of Prometheus. For a 60 HZ HDTV, motion was great. Motion is also great on Playstation 3 games. The remote is simple and uncluttered. Yes the response is not the greatest. Big deal as that was about the only thing negative that comes to mind. No internet but I have the PS3 for that and Netflix and such. No 3D? An old schooler such as me will only care about 3D when there are no glasses. Oh, also the stand could be a bit heavier-duty. The inputs/outputs are awkward to get to, but this isn't supposed to be a mixing board. Last but not least the price was right...under $600. All in all Toshiba delivers with a great bare bones TV. We're very very happy with it.", "Date": "April 6, 2013"}, {"Title": "Great Value TV", "Author": "NiteWalker \"SimpleCase\"", "ReviewID": "RAVP0N93671O0", "Overall": "5.0", "Content": "I grabbed this during a recent amazon sale and couldn't be happier.The picture quality is very good and it looks nice on the wall. I use it for gaming (PS2, PS3, Wii U and later this year, PS4), digital cable and roku viewing and it handles everything beautifully.There's all kinds of fancy tvs out there with web features and all that, but for a budget minded shopper that wants a simple, no-frills hdtv, the toshiba is hard to match.There's not a ton of inputs, but I use an av receiver, so that's not an issue for me, as everything is connected to the receiver and only a single hdmi cable goes to the tv.Also, the remote isn't the greatest, but again I use an after market product, the logitech harmony 650, and that handles all my control needs.I really like toshiba tvs at this point. I have 3 in my house (a 32\", 40\" and this one), and all three have been solid, reliable performers. Next year I'll be getting a 70\" hdtv. Hopefully toshiba has a 70\" offering by then.", "Date": "April 2, 2013"}, {"Title": "Toshiba 50L2200U 50-Inch 60Hz LED-LCD HDTV", "Author": "Carolina Da Silva \"CAROLDAS\"", "ReviewID": "RSLH9MKQH22T7", "Overall": "5.0", "Content": "At first I was hesitant to order this article, I can say after buying it which is excellent, is offered, the image quality is spectacular, very bright, the sound is very good, only to place a 5.1 surround system you purchase a digital audio adapter to handle the volume control on the TV, otherwise you will have to use two controls ... Reasonable price and all the audio and video inputs you need, I recommend it to all the Amazon community. Thank you.", "Date": "March 28, 2013"}, {"Title": "We love our new tv!", "Author": "A. Gift For You", "ReviewID": "R2JBRECCLG6NDP", "Overall": "5.0", "Content": "I bought this tv for my fiancee as a Christmas gift. We upgraded from a 37 inch Sony LCD. This tv is perfect for our small apartment. Our couch sets about 8-10 feet away from the tv and because of it's size, we know longer have to squint to see (and as an added bonus, i can see the tv from the kitchen while I'm cooking). After a few months, we really love this tv. It has great picture quality and even better sound. We were contemplation putting in a surround sound but decided not too because the tv has such a high quality sound. We have never raised the volume passed 7. I would definitely recommend this tv to anyone looking to upgrade.", "Date": "March 1, 2013"}, {"Title": "Love it", "Author": "gam1989", "ReviewID": "R1J8EGJBM5RIYO", "Overall": "5.0", "Content": "Great tv. Used suggested calibration settings and tweaked it to my liking, the faces were too red. Great picture and got it for a steal at $499. Love the tv.", "Date": "February 27, 2013"}, {"Title": "Amazing", "Author": "emilee", "ReviewID": "R3V4QOIOOW6NFN", "Overall": "5.0", "Content": "I love this tv, it exceeded my expectations. Its my first flat screen and I'm very pleased the picture is amazing, and it only gets better with an hdmi cord. But thankfully it has color cords in the back for people like me who aren't high tech. The sound is amazing, you can hear every thing so clear and even little things in the background. The only downside is with the volume turned up all the way its not as loud as i like, but flat screens are meant to have surround sound, so i get mine soon and when i hook it up it'll only get better.", "Date": "February 22, 2013"}, {"Title": "perfect!", "Author": "Chantal", "ReviewID": "R1K6NNPU0G9UQL", "Overall": "5.0", "Content": "The picture is crystal clear, I can watch and read the C.C from a distance! I am enjoying my TV to the fullest :) Thanks!", "Date": "February 20, 2013"}, {"Title": "Nice LED TV", "Author": "Alexander Padilla", "ReviewID": "R2QW74ZGBT1JDT", "Overall": "4.0", "Content": "I love this TV. For the price, it cant get any better. Much brighter than my LCD TV which this replaced. Looks great when playing Xbox or hooked up to to the PC with a VGA cable. Had to research to find the calibration settings, but it was easy to setup. My only complaint is the remote. You have to press the buttons hard and aim at the center of the tv.", "Date": "February 19, 2013"}, {"Title": "Great TV for the Price", "Author": "kenss4", "ReviewID": "R15KRB4JIPQ0GN", "Overall": "5.0", "Content": "I haven't bought a new TV in over 10 years.  The last one was given to me (a huge 52 inch RCA Projection HDTV). So when looking for a new one, I was overwhelmed by the different technologies, brands and prices.  After reading many reviews here, I decided to bite the bullet and go with the Toshiba.  So far it has exceded my expectations.  Picture and sound quality are good and the price for a name brand cant be beat.  I used televisioninfo.com for the picture calibration and am very happy with it.", "Date": "February 13, 2013"}, {"Title": "Toshiba 50L2200U 50 inch LED", "Author": "Steve \"Steve\"", "ReviewID": "R1R4X7Q0JJDF9L", "Overall": "5.0", "Content": "This tv works great for price $499.99.  Easy to unpack and install and picture is fantastic, I have a Sony 55 inch and it looks just as good for less then half the price.  This sound on this tv excellent, it will blow you away.  After turning on after installation it was on (22) about half what way on the sound adjustment and was better sounding then my Sony & Samsung. Using the HDMI connections make it a snap to install.  This is a great bargain!", "Date": "February 10, 2013"}, {"Title": "Great TV for the price.", "Author": "Rokkstar", "ReviewID": "R17778W1NDTX56", "Overall": "5.0", "Content": "Upgrading from an LCD, I put these screens next to each other and it definitely is brighter and has much better blacks. Quite thin, but not slim. However, for the 300-500 price range it definitely does its job as a 50in TV. Looks great in the bedroom and plenty big for casual watching before bed. Also turns off if you forget to turn it off before going to sleep.", "Date": "January 27, 2013"}, {"Title": "Amazing", "Author": "junj64", "ReviewID": "R2SKOV664OTNI0", "Overall": "4.0", "Content": "The colors are vibrant and the blacks are so black. DynaLight is amazing at adjusting the image based in the content. only con i have is that it only has 2 HDMI ports and 1 Component.", "Date": "January 24, 2013"}, {"Title": "Good TV", "Author": "waynesworld", "ReviewID": "R1Z3Z356KJSX50", "Overall": "4.0", "Content": "This is a good basic 50\" flat screen tv.  Picture is good, no glare, can be viewed from any angle in my living room.  The sound isnt the best, but it works fine for my purposed.  I am just using it for basic viewing.  If you are looking for a good solid tv, this is a great choice.", "Date": "January 2, 2013"}, {"Title": "Good HDTV", "Author": "Doug", "ReviewID": "R2U9Y483QCU0E6", "Overall": "5.0", "Content": "I purchased this HDTC for the office.  The equipment works great.  I would purchase another one of these if I needed one.", "Date": "December 17, 2012"}, {"Title": "Excellent for the price", "Author": "John C", "ReviewID": "R31Q4ATEML858Z", "Overall": "4.0", "Content": "The TV has a great picture and perfect for the price. The only complaint is that the channels take a while to change.", "Date": "December 10, 2012"}, {"Title": "good price", "Author": "bettyboop", "ReviewID": "RMNTTOR8ZX3D0", "Overall": "5.0", "Content": "great picture, very good price, bought as a gift and my daughter loves it. Would suggest to others. Was suppose to have a low price guarentee, amazon refused to make a price adjusmet as promised!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "December 9, 2012"}, {"Title": "great value", "Author": "catfish63", "ReviewID": "R34DOBVZJW0SIA", "Overall": "5.0", "Content": "Bought this Tv at Sears Friday after Thanksgiving.  Paid $499.00. Great for the garage movie room.  Need to calabrst it. Great picture.", "Date": "November 27, 2012"}, {"Title": "Decent TV...GREAT PRICE", "Author": "chinee", "ReviewID": "R1DGXZEGXCV12F", "Overall": "4.0", "Content": "Basic Design and operations. No bells and whistles and \"smart\" features... but will grow to like once the TV is calibrated.", "Date": "September 19, 2012"}, {"Title": "Great TV - But you need to dim it", "Author": "H. Huang", "ReviewID": "R1XSDICTPRJU1G", "Overall": "5.0", "Content": "I set up this TV over the weekend with my 8-year-old Sony LCD projection TV on the side to compare. The Sony was still quite good when the scene was bright but it just could not show anything in the dark areas, which I hates since the start. Sony TVs do have the most nature color so I used it as reference for new TV adjustment. Basically you need to dim it to a certain level for movies to be more natural. With that said, the TV is perfect as far as in meeting my expections. The remote is not as bad some users have indicated.One minor issue: the TV did not sit on the base firmly and wobbled from side to side when I push. Will see if that will be an issue in the long run. Toshiba seems cannot make a solid base for their TV's as our older 32in also had some issues as it tilted forward since the base was not strong/solid enough.)", "Date": "December 24, 2012"}, {"Title": "Picture is very nice. Little issues about quality.", "Author": "TheACN", "ReviewID": "R26DXEKVLM72PZ", "Overall": "4.0", "Content": "The best way to describe this TV would be by saying that this TV is a reasonable priced TV with an excellent picture.I didn't give 5 start because there is something wrong with my unit's angle, well it's kinda tilted. It stand on a perfectly straight and strong place, but  when I measured the height from both sides of the TV, I saw 0.5 inch height difference. It doesn't bother that much and I don't want to deal with the hassle of returning the TV for a replacement, but I thought you should know. My guess is that this issue is specific is to my unit.", "Date": "November 28, 2012"}, {"Title": "Excellent TV", "Author": "MCR", "ReviewID": "R1TYY51ELJJIXI", "Overall": "5.0", "Content": "TV value is top of the line.  Am very satisfied with this TV.  Lowest Cost that I could find.  I followed the settings as suggested by previous valustion, and then experment a little  till I found what I liked the best. For my ears, the sound was certainly okay. Delivery was very fast, and arrived in excellent condition.  I recommend this to everyone", "Date": "October 24, 2012"}, {"Title": "Great for the price", "Author": "Amanda Ladson", "ReviewID": "R3GZ14F470T5QF", "Overall": "4.0", "Content": "I have always had Sony TV's, could not afford this time. This TV has a great picture and sound is ok. For the price it's awesome. Does not have many features.", "Date": "September 10, 2012"}, {"Title": "Nice tv", "Author": "Brandon", "ReviewID": "R3081YWH2W4GAR", "Overall": "4.0", "Content": "For the price I got it for it was a good buy. The colors are bright but it could be just a bit sharper in the picture. The lack of outputs make it difficult for additional components to be connected i.e.: surround sound, gaming headset etc. but still able to make it work. That said, you may not need auxillary audio because the speakers are VERY loud, I dont turn the volume past 15 and the 1/2 mute feature helps when the kid is napping. It mounted on my TV stand with ease so I did not connect the base.", "Date": "December 24, 2012"}, {"Title": "DO RESEARCH", "Author": "Charity Bishop", "ReviewID": "R25YCEA6X5WN14", "Overall": "1.0", "Content": "I didn't look this TV up online before buying it on sale -- that was a mistake. 4 months in, it went dead. I then spent some time surfing Toshiba help forums and customer complaint website -- it turns out this is a common problem with Toshiba: the picture/sound will go, but the green light stays on. Powering it down and unplugging it will fix it... for about an hour. By the time most people get Toshiba to the point where they'll agree to an exchange, their 1 year warranty is up.SHOP CAREFULLY. Buying this TV is like playing a very expensive game of Russian roulette -- you may get one that works, or like me, you may get one that doesn't. I'll last long enough for your in-store exchange to go out.ETA: March 12,2013. FINALLY got it fixed -- after four months of waiting. Fortunately, it was still under warranty. It sat in the TV shop for two months, while a new power source was ordered. They got it, put it in, and it didn't work -- ordered a replacement, it took another two weeks for Toshiba to send it. Works fine ... for the moment, but if it goes out again outside the warranty, I'll be out a television.", "Date": "January 2, 2013"}, {"Title": "Great, no frills tv for the price", "Author": "Amazon Customer", "ReviewID": "R2KCX0YZ4OJSNE", "Overall": "5.0", "Content": "I spent a long time looking at different specs for televisions, and ultimately decided to buy this television when I saw the great price and that it fit the specs I wanted (size, 60hz, dumb, price, and good viewer reviews). I wanted a dumb t.v. because I already had a roku -- a much cheaper alternative, and didn't want to pay extra for an unnecessary feature. After seeing this t.v. at a best buy I came in with low expectations; it looked terrible next to the other televisions on the wall. After hearing advice that you can't really judge a t.v. unless it's viewed in a home, I decided to give it a try in my own living room and hoped the best buy floor model was a dud. My expectations were greatly exceeded by this television -- I am glad I took the risk. As others mentioned, the colors are great once adjusted. The television does extremely well in a sunny room and minimizes glare from lights (I would have bought a plasma but for this point). I prefer the 60hz to 120hz (which makes everything look like a soap opera) -- sports still look great on a 60hz t.v. The best part of this TV is the size, which really does make a difference; I do not think you can get this quality and size for this price on any other model. The sound gets very, very loud. The only downside for me is that it only has two HDMI ports. This is an incredibly minor complaint -- I watch DVDs very infrequently so just pull the cord form the roku and plug it into the DVD player when I want to watch. Not really a hassle when you have to get off your couch to put the DVD in the player, anyways.", "Date": "January 24, 2013"}, {"Title": "Amazing", "Author": "Carl Chbeir", "ReviewID": "R3GXR25B3KD7DZ", "Overall": "5.0", "Content": "This TV has a great picture and for the price it is a no brainer. I would definitely buy the same TV over and over. Smart TVs are not worth the price; just buy a smart blu ray player and it will give you the same result as a smart tv.", "Date": "January 2, 2013"}, {"Title": "Excellent value for the money", "Author": "Murray Duffin", "ReviewID": "R2IND7NFNOQKSK", "Overall": "5.0", "Content": "Outstanding picture quality and ease of set-up and use. The first flat screen TV my daughter has owned and her family loves it.", "Date": "January 2, 2013"}, {"Title": "Great Product", "Author": "J Beam=n", "ReviewID": "RNVQYQG5D6TDV", "Overall": "5.0", "Content": "Products arrived in good time and in good condition.  It is a clear picture and a fantastic size.  We will see how it does over the long haul", "Date": "November 5, 2012"}, {"Title": "Great Deal and Great TV", "Author": "joshmoutlon", "ReviewID": "R8PK5MDLWPYYK", "Overall": "5.0", "Content": "Awesome TV. I've had this over a year now, picked it up as a Black Friday deal. It's our basement TV, but so far no issues. Good quality, the sound is awesome. Having it on 7-8 volume is almost too loud. I hate having to turn a TV up too much just to hear a TV show.", "Date": "December 10, 2013"}, {"Title": "Remote sensor is a pitiful weakling", "Author": "Roka2 \"mmx\"", "ReviewID": "R2C1NR1QA971X8", "Overall": "4.0", "Content": "This is a nice tv with great picture at a great price.My problem is that the wireless remote sensor is really bad. It is very difficult to get it to read ESPECIALLY with the remote they include. You need to hold the remote up and point it right at the TV to get it to work. I have a programable remote with my AV stereo, and this works a little better.With the stereo, or tape deck it is read great. I can point the remote at the ceiling and still if works. But the TV is still a problem, although not as bad as with the supplied remote. My Apple TV box is fantastic. Again (using its supplied remote) I just point at the ceiling and it picks up everything.Too bad - because it otherwise is nice.", "Date": "November 29, 2013"}, {"Title": "Meets my need", "Author": "Mick_1969", "ReviewID": "R30QSOEUTLGZRP", "Overall": "5.0", "Content": "This TV isn't watched very often but when we do the quality seems to be great.  The picture is super clear.", "Date": "October 31, 2013"}, {"Title": "Toshiba 50\" LCD", "Author": "John", "ReviewID": "R3U478BGZ5D9BZ", "Overall": "5.0", "Content": "Great TV at a great price, outstanding picture quality and no pixilation on fast moving sports shots. I don't think there's a better TV for the price.", "Date": "July 12, 2013"}, {"Title": "Excellent TV for The Price!!", "Author": "J. Johnson \"Yeah!!!!!!!\"", "ReviewID": "RDWNHJCIEILVL", "Overall": "5.0", "Content": "If youre looking for a Good Buy, Get this TV when its On Sale one of the Best purchases Ive ever made... Worth every dollar!! I got this TV on slae last Christmas for 499.00 + Tax, came up to 544.36!! and was a Steal at that Price.. Picture is Great! Sound is Preety Good.. I only like one of the picture presets but its good enough that havnt once adjusted it!! so thats damned good!! the mute button cuts the sound in half then you have to press again to mute which is weird.. the remote to TV signal is a bit quirky im guessing the sensor LED is too small or maybe i need new batteries?? been over 6 months and all ive done since taking this out the box is watch the damned thing no issues whatsoever so it might be safe to say its worth buying!!! anyway as a huge skeptic when it comes to technology and spending my money cuz i think everyone's trying to rob me.. which is why i waited so long to review.. Im gonna go ahead and recommend this TV.. Id even pay 600-650 for it.. well maybe not since im a cheap bastard but its worth that much easily!! Nice manly design too, square edges with the glossy finish.. meh its kinda nice! And its 50 INCHES  C'mon You cant beat that..", "Date": "July 9, 2013"}, {"Title": "Very good basic TV", "Author": "N. Hudspeth", "ReviewID": "R2IQERFU0DHPGD", "Overall": "4.0", "Content": "I got this TV on sale for $450 and am using it for my home theater setup. I use it for movies and gaming and love it for both of them. I would have to say that it works a bit better for games though; movies with dark scenes often show this tv's biggest weakness. There is some fairly heavy banding that occurs, especially during darker scenes. Picture an underwater shot that goes from dark blue to lighter blue on the top of the screen. Instead of a gradual change in color, it will show bands of color with visible sudden changes in shade.Overall though, I enjoy this tv and it is a perfect budget tv for someone who has no desire for 3D, 'smart' abilities, or soap-opera effect. If you want something solely for movies though and won't have a lot of static images (tv logos, game HUDs, etc), I would look into plasma.", "Date": "June 27, 2013"}, {"Title": "A good TV for the money", "Author": "Thorgoth", "ReviewID": "R31YHEAV5UZ3Z8", "Overall": "4.0", "Content": "We have now had the TV for 4 months. It's primarily used for playing XBOX games in the basement so it's not our primary TV.The good: Bought it for $490 with free shipping. 50 inches. Good picture unless you get too close, but that's the case with all of these slim TVs. Easy to set up. Light weight. Looks good.The bad: should have more than 2 HDMIs. A bit slow on start up.", "Date": "May 12, 2013"}, {"Title": "Almost perfect for the price", "Author": "Ry-z", "ReviewID": "R3IKTC2PE9Z70U", "Overall": "4.0", "Content": "Picture is amazingly great for this price.Sound is a little bit cheapy but OK.If there were more than 2 HDMI...", "Date": "January 1, 2013"}, {"Title": "Great deal overall", "Author": "Lee", "ReviewID": "R3KE16DR71O5GN", "Overall": "4.0", "Content": "I upgraded from a budget Olevia 32\" to this Toshiba TV. I'm not a videophile and I try really hard to spend 800 or below (typically below).[Good]HD Picture Quality: Pretty good, no complaints. Some people complain of blooming but I don't see it. Color seems to be better than non-LED lit LCDs.Auto Sound Control: When there's no signal and just static, the sound will automatically mute. This is nice.Price: For what you get, this is a good deal.Optical Output: This is nice to have. I didn't have this beforeTwo HDMI Inputs: I only had one before and it just got annoying to keep switching it out. UPDATE: I'm not sure if there's an issue, but I can't always get HDMI from my computer working.Headset Output: Great for watching TV and being quiet at the same time.Reliability: Toshiba is pretty well known for not breaking down.[Bad]SD Picture Quality: This is just totally horrible and I'm not sure why. There are plenty artifacts and ghosting and it's just too annoying to watch. It was so bad that I thought the TV was broken. Yes, I've tried playing with all the settings available. This TV is part of Toshiba's budget line so some settings that higher end Toshiba models have, this TV does not have.Customer Support: Toshiba's customer support is just really bad now. Three years ago it was fine and it was overall decent. Now you can't even get remote control replacement (it was missing from my package). In general they just don't seem to give a crap about anything, so if there's anything wrong - good luck. Yes, my TV was still in warranty. If reliability ever changes later on, I wouldn't touch this brand no matter what the price. I called three different times, speaking with three different customer reps. All of them were indifferent and none of them would do anything to help. Each referring me to the store where I bought the TV to solve the issue. That's a bit strange since stores solve the issue with me returning the whole TV set for a completely new one, which is something Toshiba doesn't want. Toshiba should fire all of them.PC Input: I think it's time to stop having an VGA port and instead change it to a DVI port. I just don't see the point in these anymore since the PC can't detect the TV resolution when you're using a DVI to VGA converter. Pretty much every PC works on DVI now. Even budget TV cards are starting not to  have VGA ports now.Number of HDMI ports: Yes two is better than one, but three and four are also better than two.[Misc]60 Hz: I don't feel that this is a bad thing since pretty much every computer monitor from the cheapest no-name ones to the ultra pricey Apple and Dell monitors are only 60 Hz. I think 120 Hz is only useful for hockey and maybe tennis during serves. Other than that 120 Hz makes things look weird. Most TVs with 120 Hz have the capability to switch to 60 Hz so that should tell you something.I got this TV below normal prices during Black Friday weekend, so this may affect my review.", "Date": "December 1, 2012"}, {"Title": "Great Deal?", "Author": "Frans", "ReviewID": "R3QMGNFU9BNBWB", "Overall": "5.0", "Content": "Television is just as advertised and delivered timely. No real setup, what a great tv, picture and sound is really excellent and affordable. I recommend this product.", "Date": "March 23, 2013"}, {"Title": "Great value for the price", "Author": "madylee", "ReviewID": "R3UMXK7RS7BB55", "Overall": "5.0", "Content": "I have had this tv for about a month, it works great and the picture is excellent. I would check this tv out if you are looking for a great deal!", "Date": "March 13, 2013"}, {"Title": "nice TV", "Author": "K. bauman", "ReviewID": "R3LFDOA7XTEIX3", "Overall": "5.0", "Content": "The picture is great, very clear, sound is better than my other large TV.  This is my go-to set when I want to enjoy a show.  Didn't need \"smart\" features, slower Hz ok since I don't watch sports. A bit slow to turn on. Got this at a fantastic price and although a big box store matched it, delivery was free and I used some points from my reward credit card on top - try That in a store!. Gotta love Amazon.This met my expectations and more.", "Date": "March 3, 2013"}, {"Title": "so far very pleased !", "Author": "Gary Gootnick", "ReviewID": "R2Z4T7XT8IIKQJ", "Overall": "5.0", "Content": "So far , I am very pleased with this TV.  I have not noticed any picture issues or remote control issues, as others have mentioned. The picture is amazing! The set up and menu use is very intuitive. For a 50\" TV at a cost of under $500 , I couldn't ask for more !  Highly recommended ! :)))))))", "Date": "February 18, 2013"}, {"Title": "What a great tv", "Author": "Duane Sparks \"Duane\"", "ReviewID": "R2Z0I2IC9V05BY", "Overall": "5.0", "Content": "We tried replacing our old flat screen with a 50\" Vizio tv and it just didn't have the sharpest picture.  This Toshiba DOES!", "Date": "January 20, 2013"}, {"Title": "toshiba", "Author": "christina", "ReviewID": "RIEXEQ8MIH9US", "Overall": "4.0", "Content": "The television was delivered as expected, setup ready to connect to my cable provider,very happy with my new tv great picture,", "Date": "January 16, 2013"}, {"Title": "Toshiba 50 inch tv, all I had hoped for :)", "Author": "Karen P Timmis", "ReviewID": "R17NS8P3SVLZG4", "Overall": "5.0", "Content": "This TV has an extremely clear picture. Size is perfect, very happy with this purchase.It definitely met my expectations, everything I was hoping for :)", "Date": "December 21, 2012"}, {"Title": "Nice TV for the money.", "Author": "Robert Mandeville", "ReviewID": "R8RUJ6GR8OFWG", "Overall": "4.0", "Content": "Nice TV for the money.  Only one input though and really needs a sound bar as the onboard speakers are really tinnee. Great picture quality.", "Date": "November 24, 2012"}, {"Title": "For $299, hard to beat", "Author": "completely disappointed", "ReviewID": "RXBBREM9MZVH2", "Overall": "5.0", "Content": "I haven't been able to find any 50\" hdtvs of any brand offered at such a low price!  What a deal!  Still in the box because its a gift but from a product that has only 4 and five star reviews at 66%off MSRP it's hard to rate it less!", "Date": "November 22, 2012"}, {"Title": "this tv is big", "Author": "gloria sandoval-thomas", "ReviewID": "R6MRWBFKH1AFN", "Overall": "4.0", "Content": "the picture is good, the sound is good, I just wish I had surround sound lol I should've got a system.", "Date": "September 7, 2013"}, {"Title": "Ridiculously Great Set", "Author": "Mike Colwell", "ReviewID": "R1O3RS94YG80KO", "Overall": "5.0", "Content": "For the money, absolutely no better television.  One draw back and it is only a minor inconvenience:  only 2 HDMI inputs.  Other than that, wow.  By the way, if you have a flat screen like this and you don't have a wall mount, you are in the wrong.  I finally got this TV and a Wall mount, what an amazing space saver!  This tv has an excellent picture too!", "Date": "March 23, 2013"}, {"Title": "Excellent service", "Author": "David Lewis", "ReviewID": "R2S9KYAKQBZNGT", "Overall": "4.0", "Content": "The television was a very good buy. Received it promptly, and I was able to get it up and running quickly.", "Date": "March 20, 2013"}, {"Title": "excellent picture", "Author": "Darlene Boyd", "ReviewID": "R29BDTJZ8ETG14", "Overall": "5.0", "Content": "i am very satisifed with the brand toshiba tv. easy to program and very good color.i would buy a toshiba again.", "Date": "March 15, 2013"}, {"Title": "awsome", "Author": "Debby Ohayon", "ReviewID": "R30C248O1Y3S3C", "Overall": "5.0", "Content": "Excellent all the way around....fantastic picture and sound.  Highly reccomend this product.  Easy set up right out of the box.", "Date": "March 15, 2013"}, {"Title": "Worth every penny", "Author": "alcwj", "ReviewID": "RBBNHMAUVI8C9", "Overall": "5.0", "Content": "Got this for about $450 on sale. Love the TV. Gotta give credit for Amazon delivery as well, 2 guys show up at my house and install the TV for us at our living room. Sure, it doesn't have all the smart features butt for the price I paid for a 50 inch TV, it's worth every penny.", "Date": "March 11, 2013"}, {"Title": "so far so good", "Author": "J. MA", "ReviewID": "R3U79U0TO13ASY", "Overall": "4.0", "Content": "Only use basic LCD-LED HDTVs.  So do not know other brand name or model.  So far so good for this TV.  I am happy with it.  I should purchase it on thanksgiving.  But I miss it.Do not like the shipping though, no installation provided.", "Date": "February 22, 2013"}, {"Title": "Great Price  Great Buy Love it", "Author": "George Gadalla", "ReviewID": "R2PNJD87F74H8O", "Overall": "5.0", "Content": "Definitely would recommend this tv to friends. Got here super quick and it was really easy to set up", "Date": "February 17, 2013"}, {"Title": "Not a good picture", "Author": "R. Acton", "ReviewID": "R283E0CSDI377Q", "Overall": "2.0", "Content": "I bought this TV about one month ago. I am very pleased with the sound quality compared  to my old 32\" Toshiba. I am very disappointed in the picture quality. Motion and movement causes blurring. You really need a 120Hz to keep that from happening.Live shows such as sporting events are fine but movies look terrible for an LED TV. I have it hooked up with Directv using an HDMI cable. The faces of people are really telling showing an incomplete picture quality.I can not recommend this product unless you just want a big TV with mediocre picture. A Samsung or Lg would have been better! I bought his TV because it was cheaper but you  get what you pay for.", "Date": "February 5, 2013"}, {"Title": "Mild disappointment", "Author": "Blindsleeper", "ReviewID": "R2WJENF267H3SV", "Overall": "3.0", "Content": "The exterior is great, good visual components, however it seems to be faulty in that it flickers to black during any function of use which I find exceptionally irritating. I would return it if it was not for the lengthy and arduous process of having to use a non main stream package carrier. So for now I suppose I will just contend with the malfunction", "Date": "April 18, 2013"}, {"Title": "very nice", "Author": "Romeo", "ReviewID": "REQBGV4E4XMB6", "Overall": "4.0", "Content": "we had order this tv a month ago and it came after 10 days and here we go after we opend it has discoloration and there was like red lines on the screen plus there was 2 cracks on the buttom corners of the tv, so we said ohh great, so we called customer service and they were super cool they said will send u another one today and will pick up the other  one,and the other one arrived in 6 daysthe picture on this tv is excellent the diffrent between 60 and 120hz not that big diffrent really,and it has pretty cool features too,i gave  it 4 stars cuz of the first tv defect but other than that i would give it 5 stars", "Date": "March 11, 2013"}, {"Title": "Fair picture quality, ok for price", "Author": "Hao Jiang", "ReviewID": "R35NN5WTCPQL6P", "Overall": "3.0", "Content": "I had a Panasonic 46'' IPS LCD TV in my bedroom, and bought this one for my living room. The price is a good deal, but the picture quality is not comparable to the Panasonic - especially when I try to connect it with my apple TV, the picture is a disaster when the source video is not in HD.Another thing I like to mention is, I tried to put it on my wall mount, but it requires \"M8\" screw. I found it is hard to find such screw and I used a 5/16(7.9mm) on it. I tried to screw it in without my wall mount, the bolt was broken... and I even can't get the screw out.. It finally turn out I had to put it on a TV stand instead. Anyway, buying this TV is not satisfying like other TVs before", "Date": "February 12, 2013"}, {"Title": "it's good", "Author": "Warren", "ReviewID": "REO3QJQB1H5CO", "Overall": "4.0", "Content": "no any problem, but a little light, not sure about the following usage, how is the long term quality? stable of not", "Date": "December 6, 2012"}, {"Title": "399 black friday sears", "Author": "camarosspr", "ReviewID": "R3SPQVSKDAZM50", "Overall": "4.0", "Content": "Plus 7% tax.Looked horrible. All pixelated. Sd worst.Almost returned it and bought panasonic plasma for 700.A friend sugested change the hdmi cable.Bought 17gps at sears $35 and fixed the problem.Very bright. Looks great. Blured on motion. Not much.", "Date": "December 19, 2012"}, {"Title": "Very disappointed.  Japanese quality gave way to Korean", "Author": "Fantomfears", "ReviewID": "RDI5TXNL9GW1H", "Overall": "2.0", "Content": "If I didn't get it on sale, I would have returned it. I can never get a good image on this tv. I tried different cables, different sources, but it is far below the image quality I get on my larger LG. since I got it on sale and delivered and set up free from Amazon, and since it's for my vacation home, I decided to keep it. I was hoping for a quality Japanese product, but seems that this reputation is not deserved any more. The Korean manufacturers seem to have surpassed them.  I never thought I would be writing a bad review on a Toshiba product.  What a shame.", "Date": "January 20, 2013"}, {"Title": "Mute should mute", "Author": "thegriobooks", "ReviewID": "R3ING8T2SN3QHD", "Overall": "3.0", "Content": "tv's a little glitchy at times....don't like the mute...it's should mute or not mute...it cuts the sound by half with the first click, then a full mute with the next.", "Date": "December 9, 2012"}, {"Title": "cut too many corners", "Author": "John Sheen", "ReviewID": "R2TONW5RJ4ORB", "Overall": "1.0", "Content": "This Toshiba TV (50L2200U) is advertised as 1080p HD. However, I found it's not totally true. There are two reasons;1) When connected to a computer through VGA, its maximum resolution is 1360 x 768 instead of 1920 x 1080.2) When connected to a computer through HDMI, it shows the resolution of 1920 x 1080 but the screen size is reduced. Black boarder lines  appear around the screen, about 1cm on top and bottom and 2cm on both sides.Picture quality is not so bad but I don't like it.Remote is cheap looking.Stand is not swivel.There is no manual included. You have to download from the web.Even screen menu is black and grey and cheap looking.As I said in the title, Toshiba cuts too many corners in this product.I am going to return it very soon.", "Date": "February 10, 2013"}, {"Title": "Picture not so clear", "Author": "Eddie", "ReviewID": "RFAPOI3P6DWO0", "Overall": "2.0", "Content": "If not running an Hd cable then forget it pic is just not good i wouldn't refer this tv to no one plus it is only 60 hrtz only reason it was allright for me is because I paid 399.00 on amazon for Black Friday lol", "Date": "December 27, 2012"}, {"Title": "Don't waste your money", "Author": "JosePam", "ReviewID": "R24GCCTYCLMNA5", "Overall": "1.0", "Content": "The screen is terrible, it's scrashed and it supossed to be new ..... the base support doesn't fit and customer service is worst. Toshiba sucks it's a shame.", "Date": "December 11, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Screen Size-50;Video-Digital Tuner-ATSC; Video-Maximum Resolution-1920 x 1080;Interfaces/Ports-HDMI-Yes; Interfaces/Ports-Composite Video-Yes; Remote Control-Remote Control Included-Yes; Power Description-Operating Power Consumption-95 W\nAspect Ratio-16:9;Video-Video Signal Standard-HDTV 1080p;Audio-Speakers-Yes;Interfaces/Ports-USB-Yes; Interfaces/Ports-Digital Audio Output-Yes; Remote Control-Battery Size Supported-AA; Physical Characteristics-Color-Black\nMedia Player-Yes; Video-Standard Refresh Rate-60 Hz; Audio-RMS Output Power-14 W;Interfaces/Ports-Number of USB Ports-1;Interfaces/Ports-VGA-Yes; Remote Control-Battery Included-Yes; Physical Characteristics-VESA Mount Standard-400 x 400\nTV without stand (Width x Height x Depth): 45.7'' x 28.2'' x 3.9'', TV with stand (Width x Height x Depth): 45.7'' x 30.1'' x 11.3''\nBacklight Technology-Direct LED; Video-Analog Tuner-NTSC; Video-Scan Format-1080p;Interfaces/Ports-Number of HDMI Ports-2;Interfaces/Ports-Component Video-Yes; Remote Control-Number of Batteries Supported-2;Power Description-Standby Power Consumption-200 mW", "Name": "Toshiba 50L2200U 50-Inch 60Hz LED-LCD HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41BspqzlG0L._SX300_.jpg", "ProductID": "B0073K64NM"}}