{"Reviews": [{"Title": "Struggle, Pain, and Joy", "Author": "Some Dude", "ReviewID": "R35UJBMMRVWQQV", "Overall": "4.0", "Content": "This review is for the 60\" model.First Impressions-----------------The box is *huge*.  The TV is *thin*.  Not even an inch at the edge, and maybe just over in the center.  The menus are pretty straightforward.  (I don't care too much about the 3D or Smart features of this TV at the moment, and don't have much frame of reference for how to judge modern 3D, so I can't really review these aspects.)  The screen doesn't seem too glossy, but it apparently works very well as a mirror because I can see a negative image of my kitchen when it's off.Struggle--------One extremely annoying \"feature\" of these TVs that I've found out after purchase is the \"CE Dimming\" feature.  This is not the \"ECO Dimming\" or anything you can control;  It's hard-coded into the certain picture modes (Standard and Native, at least).  This feature is something that will reduce the backlighting when there is mostly black on the screen.  (For example, if there is 100% brightness white text on a pure black screen, it would actually display at a fraction of that intensity due to the backlight dimming).  I've read that this is to reduce the appearance of light bleeding in from the edges, since it's edge-lit.  This \"feature\" annoys me significantly, particularly because I am not allowed to control it.  After searching around I found out this is called \"CE Dimming\" and you can hack it by going into the service menu (you can find the instructions online yourself), however messing with it apparently voids the warranty.  The only picture mode I found that doesn't use this is \"Movie\" mode.  But, movie mode looks terrible with its default settings.After 3 days of struggle, experimentation, and research, I've found settings that actually give me a picture I can call \"good\" or better.  I'm not an expert, but I'm technical and pretty picky.  So, because I have found no calibration settings for this series of TVs yet, I'm going to provide the ones I am using, if only to prevent any of you from having to obsess over this for hours and hours.  I'll offer a little bit of explanation as to why I'm setting it the way I am.  I got some guidance and expertise from a known site, but as of right now they do not have professionally calibrated settings.  What I did is by eye only.Settings--------Picture Mode:  MovieBacklight:  15Contrast:  100Brightness:  46Sharpness:  10Color:  50Tint:  50/50Dynamic Contrast:  OffBlack Tone:  OffFlesh Tone:  0RGB Off:  AutoColor Space:  AutoWhite Balance:  25 for all10p White Balance (R, G, B):  ON - Interval 1: -8, -7, -7 - Interval 2: -10, -3, 2 - Interval 3: -9, -2, 6 - Interval 4: -9, -1, 8 - Interval 5: -10, 1, 10 - Interval 6: -6, 3, 10 - Interval 7: -9, 5, 10 - Interval 8: -1, 5, 8 - Interval 9: -5, 1, 6 - Interval 10: 0, 2, 0Gamma:  0Color Tone:  Warm2Digital Noise Filter:  OffMPEG Noise Filter:  OffHDMI Black Level:  LOWFilm Mode:  Auto2Auto Motion Plus:  ClearLED Motion Plus:  OnComments on the Settings------------------------Movie mode is the only mode I found that doesn't use \"CE Dimming\", which is a huge annoyance to me.  (I'd rather see edge-lighting, easily.  Not sure why I can't control that, Samsung.)  Backlight, brightness, and color are kind of like salt and pepper:  Use to personal taste in your environment.A note about almost all the other settings:  I like an eye-popping, colorful picture as much as the next guy, but I don't like it at the expense of information loss.  From my own experimentation (in Standard and Native modes), all the Dynamic Contrast and Black Tone settings did was flatten out the low end of the blacks.  Dark scenes look like \"paint by number\" with all kinds of banding and digital multiplication/division.  Lame, worthless settings if that is the effect, and a problem in general with \"digital\" stuff.Standard white balance isn't fine-grained enough to make the adjustments to any of the picture modes that are necessary, in my opinion.  I messed with it for a long time, so I know.  :)  The only way to get actual, fine-grained color control is to use the 10p White Balance settings.  Now, I only know this from messing around with it, but what this does is allow you to control the individual colors R, G, and B as 10 different intensities, from black to white.  So, Interval 1 is the darkest reds, greens, and blues (close to black), and Interval 10 is the brightest R, G, and B, close to white.  If you use \"Expert Pattern 1\" you can see how this works.  Short summary?:  Red is WAY over-represented and blue is WAY under-represented when everything is set at 0.  Everything looked neon until I calibrated this, particularly the reds, and greens to some extent.  (Maybe they can create a \"1980's\" picture mode!)The noise filters aren't needed when you have everything calibrated correctly.  They are kind of an excuse for having the eye-popping over-saturated settings that Standard and Dynamic mode come with.  I'm not too sure on the Film Mode and LED Motion Plus.  They didn't give me any noticible changes.  The Auto Motion plus is nice, but I found that it starts getting choppy when you have other effects going on, including a lowered sharpness (I imagine it must be doing some extra calculations for that.)  So, I only set it to Clear because it doesn't seem to get choppy with that set, but still provides some stability and smoothness in fast scenes.Overall-------I give the picture (once it is set correctly) a 5/5.  The fact that I can't adjust certain \"features\", combined with the level of screwing around it requires to make the picture look good makes me lower that.  Seriously Samsung... why can't there be a default mode in here that has professionally calibrated settings?  You must know that the reds are way too saturated, right?  You can still set it to \"Standard Mode\" by default to create eye-popping pictures that make people buy the TV.  But with all your expertise, why not just have a mode that has all this stuff pre-calibrated and save us the time?EDIT (2012-05-28):  After further tinkering, I think I have refined settings to make the picture pop a little more without ruining the picture.  Use above settings, but adjust to these:Dynamic Contrast:  LOWBlack Tone:  DarkerHDMI Black Level:  LOWColor Space:  Native***********************EDIT (2012-11-06):  Now there are finally professionally calibrated settings available (have been for a few months).  You can do a search for \"un60es6500 calibration\" and it's one of the top results.  But, there are problems with those settings.  The major one is the regular \"White Balance\" blue offset setting.  They say to use 28.  The problem with this is that increasing the offset makes the black baseline move up.  So, 100% black now appears brighter.  I've adjusted their settings and come up with a slight modification that I think looks fantastic.  (Also, my experience with the latest firmware 001023 from Nov 1 was NOT GOOD.  It wouldn't allow any picture mode except Dynamic.  I did a factory reset, and things are better now.)Picture Mode  MovieBacklight  17Contrast  100Brightness  45Sharpness  10Color  60Tint  G50/R50ADVANCE SETTINGSDynamic Contrast  LowBlack Tone  OffFlesh Tone  0RGB Only Mode  OffColor Space  Native10pt White Balance  OnGamma  -1Expert Pattern  OffxvYCC  OffPICTURE OPTIONSColor Tone  Warm2Digital Noise Filter  OffMPEG Noise Filter  OffHDMI Black Level  LowFilm Mode  Film2Auto Motion Plus  ClearLED Motion Plus  Off10PT WHITE BALANCEONInterval Red Green Blue1  0  -1  -12  -1  -1  -13  0  0  04  -1  0  +15  -1  -1  +16  -1  -1  -17  -1  -1  -18  0  0  09  +1  0  010  +2  0  0WHITE BALANCESetting  ValueR-Offset  25G-Offset  25B-Offset  25R-Gain  18G-Gain  23B-Gain  25***********************EDIT (2012-12-02):  I've recently updated to the latest firmware version 001024 and I think it is an improvement.  With that update, I've adjusted my settings to the above, but with Gamma -2 and Black Tone: Dark and Color Tone: Warm 1.  Looks great to me!***********************EDIT (2013-01-02):  I've recently updated to firmware version 001025.  I might be me imagining it, but I think the video quality degraded slightly, and the issue with SmartHub (where the SmartHub will just pop up randomly, for a second or two, for no reason) is still there.  Samsung needs to get their sheet together, because this is just silly, for a $2000 product.  But hey, once you've got their money, who cares!***********************EDIT (2013-02-18):  The SmartHub problem is fixed now.  It apparently just needed to be updated to the latest version, and wasn't an issue with the firmware, as I'm still on 001025 and haven't had that issue in over a month.", "Date": "May 18, 2012"}, {"Title": "Excellent 3D TV, the \"Smart\" stuff isn't great but I don't care.", "Author": "Brian", "ReviewID": "R1FFF10WIR2X5A", "Overall": "5.0", "Content": "I got this TV to upgrade from an older Samsung 46\" 60htz LCD which I loved.  I spent a lot of time comparing TV brands when buying that first TV and didn't have to do much shopping for this one.  I knew that I loved Samsung's picture over any other TV except for some of the Sony Bravias but they're overpriced IMO.  I wanted a 55\" 3D with at least 120htz and this one fit the bill.  I bought the last one on Amazon so I came back here for this purchase.  They delivered it quickly and it was in perfect condition as expected.I was initially aprehensive about this TV after seeing it only got 3 1/2 stars in customer reviews so I read all the reviews.  I found that the people who gave the TV a negative review were all upset about the Smart TV internet features.  Slow connectivity when using a browser, Netflix, Youtube, etc.  I understand their reason for being upset because a TV that includes those features should function properly.  Unfortunately these rely heavily on your internet connection speed which may not be fast enough to support them.  Oh well, buy a faster internet plan.  This TV is on the low end of the Smart TV spectrum so I wouldn't expect those features to perform as well on it considering the other 3 models above it have dual core processors built into them to handle that.  Buy one of those models with the dual core if you're main reason for having a TV is to surf the internet or watch youtube.  Or just use your computer for that like the rest of us.  The actual \"TV\" is top-notch and the 3D is spectacular!I agree with some of the reviewers that the picture needs tweaking to get it right.  I was fully prepared for that because I had to tweak my last Samsung for a while before getting the picture just right but once it's set, it's awesome.  This TV has even more options to tweak so it can get confusing for the inexperienced but it's capable of producing one of the best pictures out there if you know how to tune it.  The Dynamic, Standard, and Native picture modes are actually pretty useless unfortunately.  Set it to Movie mode and start tweaking.  Yes, it starts out dark so increase the backlighting and brightness, bump up the color and sharpness, high auto contrast, darkest black level, etc... If anyone wants my specific settings I'll list them if you ask.The 3D is simply awesome.  Home theater 3D isn't going to be as good as going to an IMAX theater but it's still pretty sweet.  One thing to keep in mind is that the picture mode settings that you did in TV mode don't carry over to 3D mode nor do they carry over to the other sources, HDMI in, Component In.  So, if you have a PS3 hooked up to HDMI you'll have to edit the picture settings for that source to match the main TV settings so you get the same picture in both.  Game Mode limits the amount of settings you can tweak so you have to use your judgement with that but if you match everything you can it'll work out fine.  Just remember to turn Game Mode OFF before watching movies because it degrades picture quality.I'm sure this isn't the best review out there for the TV but it might be of some use to some of you.  If you're considering a 3D TV and you're not overly concerned with using it as a web browser and just want a great TV then this is it.  Once dialed in, the picture is fantastic and the price is right.  If you're interested in the Smart TV features MORE than watching a great and inexpensive 3D TV then pay more money for the next models in the series that have the dual core processor.  Regardless, stick with a Samsung because it's always the best picture for the money.", "Date": "July 9, 2012"}, {"Title": "Second Samsung TV", "Author": "PeteReviews", "ReviewID": "R84ZRAV11PV72", "Overall": "5.0", "Content": "After purchasing a Samsung UN55D7000 about 6 months ago (2011 model) which I was very happy with, I needed a new TV for my bedroom and this model was the perfect size and it had many of the same features.This TV is the 2012 model and is still fairly new, they are still working out the bugs with the smartTV side for the 2012 models at Samsung. I noticed that this TV does not have the HBO2GO app yet and I read how it is because it is a 2012 and the app has to be changed.Also the Browser is not working, this could be an issue with just my tv but I tested it and it would not connect.I compared this TV next to the D7000 and it was exactly the same but it did not have the \"spotlighting\" that occurs on the 2011 models. The blacks seem much blacker also.I have not tested the 3D part, one good this is that this model comes with 2 pairs of glasses, they are the ones with batteries you have to replace and they do not recharge but I did not buy it for the 3d part.I tested the Pandora app and it worked the same as other my other TV. The entire Samsung model line up seems to be ahead of the curve and quality seems to be great. The tv is very thin and crystal clear. The built in speakers sound good.Pros  - Clear Picture and good colors  - Samsung smartTV - huge fan of how it works and the ease of useCons  - Browser is not working and some apps are not ready for the 2012 line up (yet, no worries they will get them working)", "Date": "April 16, 2012"}, {"Title": "This tv is total awesomeness.................in my opinion this gets 6 stars!!!!!!!!!! (IF I COULD)", "Author": "mau", "ReviewID": "R11QM9DHBZHO9L", "Overall": "5.0", "Content": "I give 6 starts(IF I CAN) because it does exactly what it says,everything from top to bottom.I read many reviews in many places especially here before buying and this product fits my needs,I cannot pick something else because I cannot pass 32 inch (no space) and dont have a big budget.This TV has TOO MANY FEATURES and the PICTURE QUALITY AND 3D QUALITY IS SUPERB.........(EVEN BRINGS 2 3D GLASSES but are the 2011 model not the new 2012,STILL VERY GOOD ENOUGH IS JUST 3D GLASSES ONLY)........When the tv is connected the the cable box to watch television,on the HD channels is very VERY good,seeing how this is LED its super bright about 3 times more than my 2010 tv model..........its slim which is really neat.I have used the tv for computer (connected via hdmi) and its suburb again.........(IM WRITING THIS REVIEW OF THE TV AS WE SPEAK CONNECT TO THE PC)The smart features DO WORK VERY GOOD......i used youtube,some games the tv brings and you can download more apps(games,movies, Netflix,video apps,heatlh apps,many more apps types,ect), AND THE BROWSER IT WORKS JUST LIKE A COMPUTER..........I CHECK MY EMAIL,SAW MANY THINGS.......(I DO NOT KNOW IF IT SUPPORTS FLASH IN THE TV AS I DID NOT WENT THAT FAR.......YET!!!).I used all of these things via WIFI (WHICH WORKS PERFECTLY BY THE WAY BUT IF YOU DONT HAVE WIFI,THAN CONNECT VIA RJ-45 CABLE AND USE THAT........FOR INTERNET PURPOSES.....)ALSO I FOLLOWED A USER HERE IN THE REVIEW THAT HAS THE \"CALIBRATION SETTINGS FOR BEST TV QUALITY\" and i said to myself\"let me give it a go\" SO I DID AND ITS VERY TRUE IT DOES MAKE IT AN EXTRA 7-10% BETTER IMAGE QUALITY THAT WHAT IT IS....................ALSO IT ONLY TAKES ABOUT 5 MINUTES TOO DO...........NOT BAD.(I WILL REWRITE HIS CALIBRATION SETTING IN THE BOTTOM WITH SPECIAL THANKS AND CREDITS TO HIM,THE AMAZON USER GUYS THAT LISTED THE SETTINGS........)I WILL ALSO COMMENTS ON SOME OF THE NEGATIVE COMMENTS THAT ARE GIVING HERE IN AMAZON REVIEWS BY PEOPLE...........(nothing bad to them or anybody im just might be able to offer an advice)1-I remember somebody wrote that they bought this tv to use with the browser but its very bad the browser or lags in youtube.................my advice is to continue to UPDATE THE APPS AS MUCH AS POSSIBLE CHECK EVERY 3 DAYS TO SEE IF THERE IS A UPDATE FOR THE APPS AND AN UPDATE FOR THE TV........DO IT AS IT IMPROVES PERFORMANCE TO THE APPS(the tv brings an internal memory of about 700mb hard drive to store download apps and other things.......)2- some else here on amazon wrote that youtube is slow and lags......too much..........my advice:remember that when play a video on YouTube. PLEASE WAIT FOR A FULL MINUTE....BEFORE YOU PLAY THEN LAUNCH THE VIDEO AND IT SHOULD WORK PERFECTLY(REMEMBER TO UPDATE THE APPS AS MUCH AS POSSIBLE)  THIS IS A TV NOT THE PC OR SOMETHING ELSE KEEP THAT IN MIND......3-MY ADVICE...REMEMBER THAT THIS IS A TV NOT A PC,IT WILL NOT BE AS SUPER CHARGE AS YOU WANT IT TO BE LIKE IN A PC,MOBILE PHONE,TABLET,ECT..............BUT THIS TV IS NOT SLOW DURING NORMAL OPERATIONS (WATCHING TV,COMPUTER CONNECTED,GAMING CONSOLES,DVD OR BLUE RAY PLAYER,ECT) BUT IN THE SMART TV SECTION WAIT 10-15 SECONDS BEFORE YOU MOVE THE CURSOR...........WILL WORK PERFECTLY..........THAT IS IT OF MY COMMENTS AND REVIEW TOWARDS THIS PRODUCT.WILL I RECOMMEND THIS PRODUCT TO OTHER PEOPLE..........101%(IVE WAITED 2 AND A HALF WEEKS TO POST THE REVIEW OF THIS TV).....................HERE IS THE CALIBRATION SETTINGS FOR THE TV............(THANKS TO THE AMAZON USER THAT POSTED IT IN HIS COMMENTS AND CREDITS GOES TO HIM/HER)Picture Mode MovieBacklight 17Contrast 100Brightness 45Sharpness 10Color 60Tint G50/R50ADVANCE SETTINGSDynamic Contrast LowBlack Tone DarkFlesh Tone 0RGB Only Mode OffColor Space Native10pt White Balance OnGamma -2Expert Pattern OffxvYCC OffPICTURE OPTIONSColor Tone Warm1Digital Noise Filter OffMPEG Noise Filter OffHDMI Black Level LowFilm Mode Film2Auto Motion Plus ClearLED Motion Plus Off10PT WHITE BALANCEONInterval Red Green Blue1 0 -1 -12 -1 -1 -13 0 0 04 -1 0 +15 -1 -1 +16 -1 -1 -17 -1 -1 -18 0 0 09 +1 0 010 +2 0 0WHITE BALANCESetting ValueR-Offset 25G-Offset 25B-Offset 25R-Gain 18G-Gain 23B-Gain 25------------------------------------------------------------------------------------------------------------------------------------------------------------Note: it is 2/20/2013 and its still beautiful and perfect since day 1......................Keep in mind also that everything works great EVEN THE APP STORE AFTER MORE UPDATES MORE RESPONSIVE AND COMFORTABLE................KEEP UP THE GREAT WORK SAMSUNG.", "Date": "December 29, 2012"}, {"Title": "Samsung UN60ES6500", "Author": "Benny Hugo", "ReviewID": "R35AJMDJAAAIER", "Overall": "5.0", "Content": "I just received the TV yesterday at noon time and here are my initial impressions on it (an update will follow in 2 weeks)...Please keep in mind I previously owned a Samsung UN52A650, UN46D6000, UN55D6000 and now on my 4th Samsung unit UN60ES6500, all purchased through Amazon.comHARDWARE SPECS--------------Yes, the ES6500 models do come with only 3 HDMI inputs. I don't know why people are rating the TV low because of this (downgrade) feature.  Having previously owned the UN55D6000, which had 4 HDMI inputs, I never made use of all 4 HDMI ports anyhow because I do own an Onkyo 607 receiver with a built in 5 HDMI switcher.Here is how I use the HDMI labeled ports:1) HDMI/DVI (recommended for PC use) - connected to my HTPC computer, very sharp clear text in 1920x1080 resolution with Windows 72) HDMI 2 - connected directly to Sony 3D BX58 BLU RAY player (since my Onkyo 607 does not support 3D, but planning on buying Onkyo 616 through Amazon). Amazing picture quality. Be sure to use a high speed (10.2gbps) HDMI cable to playback 3D content.3) HDMI 3 - connected to Onkyo 607 receiver (cable box, Asus Oplay media player, Xbox 360, PS3)The TOSLINK (optical output on TV) however does not pass through HD-MASTER, TRUHD, or any other high fidelity sound other than Dolby Digital and PCM. The only way to achieve this is to connect your blu ray player through your surround sound receiver.The speakers sound OK, but only use them when watching conventional TV programming.  Surround sound is used mostly especially during movies and sporting events.PICTURE QUALITY---------------Default settings set the contrast level at '14' which is too low for my taste.  I did some calibration to match my UN55D6000 set and found the UN60ES6500 to be a tad bit dimmer than the UN55D6000, maybe because of the new semi-gloss finish on the screen.  Again, I will come back in two weeks to update this section after I have found the perfect settings for each of the 3 HDMI inputs, which can be configured independently.Now for the 3D part... I don't have an actual 3D blu ray movie just yet, and will update in 2 weeks when I do watch one.  However, I was able to view 1920x1080 24p/30p demos on my Sony 3D blu ray player and watched various content including music videos, sports, and PS3 games.  I've seen plenty of store demos on 3D, and after playing around with the UN60ES6500 3D features, I must tell you that 3D has come a long way especially on this unit.  The UN60ES6500 3D feature is simply mind blowing!!  You may have seen 3D, where it feels like the 3D only goes 'into the TV' and not protrude out towards you.  The UN60ES6500 3D feature DOES COME OUT at you, and with great depth!  I've seen some LG models that their 3D content goes 'out of the TV', but let me tell you the demos I've watched last night REALLY came out!! I'm very amazed Samsung, job well done here!  Even the 2D->3D worked impressively well, but again not as good as REAL3D video footage.Again, I will come back and update this in 2 weeks from 4/26/2012.  Hope this helped some of you in rethinking about buying the UN60ES6500.  Thanks!", "Date": "April 26, 2012"}, {"Title": "Very bad backlight bleeding from all corners and few options to improve the issue.", "Author": "Sonik35143", "ReviewID": "R277T4E3UY29IC", "Overall": "1.0", "Content": "This TV is beautiful, large, thin, stylish and looks great in my living room, that is until you turn it on; the backlight bleeding is so severe that you can see it during the day, of course there is usually ways to improve this issue, lowering the backlight, increasing screen brightness etc.The problem with this TV is the fact that a lot of the picture settings are locked into specific parameters, I did manage to bring the bleeding under control by changing the picture preset to \"Natural\" and the HDMI black to \"Darkest\" but because the \"Natural\" preset has so many picture options locked compared to the \"Movie\" preset the picture becomes really saturated and colors look way off without having a way to correct them. To give an example there was a video of the Golden Gate Bridge and I've been there in person and so I know what color it is in real life...\"Natural\" made the bridge look bright orange, the only thing that looks good under \"Natural\" are peoples faces, everything else looks wrong.Another massive problem with this set is the backlight dimming, unless you set the backlight setting to normal (Which seems to overide the auto dimming) the TV changes brightness so rapidly it feels like someone is turning a light on and off in front of your eyes, also keep in mind that while using the Samsung Apps (Netflix, etc..) the picture settings are completely on their own and don't use anything you might have made changes toOne last problem I had with this set is the wireless only worked once and then it wouldnt connect so I had to switch to wired ethernet. Needless to say I sent the TV back, Amazon is great when it comes to returning big items, I'm glad I bought it from them, also CEVA freight company was great and delivered on time and helped setting up the set, also picked up 2 days before it was scheduled to be sent back, this bad review falls completely on Samsung and not on Amazon or the delivery company. a big part of me believes that if you are spending $2700 on a TV, it should be flawless, I'm going back to SHARP.", "Date": "August 29, 2012"}, {"Title": "3D didn't work before getting main board replaced", "Author": "Mauricio", "ReviewID": "R3JJECRXYDCEVN", "Overall": "4.0", "Content": "I bought this TV on August 2012. The picture quality was excellent, and it was exactly what I was expecting since I already owned two other Samsung HDTVs. However, the 3D functionality wasn't working for my PS3 or my computer (it worked only for the 3D features offered directly from the TV, but not for external devices). I tried everything: using different HDMI cables, going through every single option in both the TV and my PS3, read every internet article about the subject, and nothing worked. In the end I wound up calling Samsung because I figured it was a problem with the TV.It was a painful process because I had to call them multiple times, and every time I had to go through the same description of what was going on. I believe they thought I was doing something wrong, so they kept on escalating the issue hoping someone would make me realize I was making a mistake with my setup; but of course no one was able to help me because no one knew what was going on. In the end they sent a guy to my house, who of course didn't know what the the problem was either, so he just decided to replace the main board on my tv. I am happy to say that the 3D functionality started working after that, but man, it took them a long time to finally conceed that the problem was on their end. In fact, they actually made me buy a Samsung Blu-Ray player just to make sure it wan't a problem that somehow all my external devices had.Still, I'm going to give the TV 4 stars because I'm quite happy with it now that it works, plus I haven't seen anybody else having the same issue in forums. I don't usually write reviews, but I wanted to let people know what the problem could be in case their 3D functionality doesn't work.", "Date": "November 3, 2012"}, {"Title": "Great Television / Ok Computer Monitor", "Author": "Scott Hester", "ReviewID": "R2OI0SMFA42PAS", "Overall": "4.0", "Content": "I bought this television to use as a computer monitor at home. When I first connected it to my PC I that picture didn't quite fit on my screen. Now, I found ways to fix this and the picture quality is amazing now except text looks a bit odd to me. The other thing was there was a extremely subtle lag between when I would move the mouse and when I would see it on screen. I was able to fix this by turning the tv to game mode. So, overall I am pleased however, I am not sure it this resolution is actually 1920x1080 because of the text thing. It might be over it might be under, but my PC will only recognize 1920x1080. However it is totally useful and Microsoft's Clear Text improved text appearance greatly.", "Date": "January 3, 2013"}, {"Title": "Good set, but not perfect", "Author": "ballplyr10", "ReviewID": "RBBQDYB26WOH4", "Overall": "4.0", "Content": "I must preface this review by saying I got a substantial discount on this set. If I had paid anything near MSRP I'd probably have to be more critical. I bought this TV because I liked the idea of having the \"Smart Hub\" internet TV features. I was in the market to replace my 34\" Sony Wega XBR CRT, and also replace the Netflix and streaming features of my PS3 due to it being an older system and wishing to extend it's life. The 3D feature to me was a bonus, but not a requirement in my shopping. I has somewhat fallen in love with the LG 6700 series with passive 3D but found this for a much lower price. The TV was well packaged and unboxing it and setting it on it's included stand was a snap. Setup takes quite some time to get all the advanced features up and running. Out of the box, the picture was fairly terrible. The backlight is turned all the way up and therefore on any black screen the edge lighting bleeds badly. There is also some clouding in the middle of my screen when the backlight is all the way up. Reducing the backlight level to 14 significantly reduced this tendency but it's still slightly problematic. Coming from the CRT world, I'm used to black being black so it's a bit of a let down but I realized this comes with the territory with edge lit LED/LCD sets. The color accuracy and gamut are nice, the picture out of the box is vivid to a fault and needs to be dialed back a bit to provide accurate color. The picture and the processing once adjusted are very nice. A HD signal from Blu-Ray or a STB is hard to fault. Even SD programming looks great, probably helped by the fact that this is a 40\" set. The Smart Hub features all seem to work well, with the exception of AllSharePlay. It will not play back .mkv files which seem to be how all the 3D SBS content that can be downloaded from the internet is packaged. Fortunately, old friend PS3 has no problem streaming these from my MBP to the set. In fact the set would not play back the .mkv files even when an external drive was plugged directly in to the TV. A neat feature is the ability to control the set through your iPhone. I don't use it that often but it is a feature that works well. It's much easier to enter text in this manner. The 3D feature works well and is a plus for truly immersive viewing. The provided glasses are light and comfortable, and I have not experienced any flickering or eyestrain in my experience. The sound is adequate but any serious movie watching deserves a decent sound system. If you want a set with some high-end features and a slick aesthetic design, and can accept some small PQ warts, this is a very nice set.Pros:HD PictureSmart TV FeaturesCustom settings for source/type of programmingMany picture adjustmentsLow power consumptionCons:Unadjusted pictureWon't play back some types of video filesEdge lighting bleed/cloudingSamsung UN40ES6500 40-Inch 1080p 120 Hz 3D Slim LED HDTV (Black)", "Date": "May 20, 2012"}, {"Title": "Basic design flaws", "Author": "D. Roca \"Amazon Fan\"", "ReviewID": "ROBM4MVWU465R", "Overall": "3.0", "Content": "I am an Amazon fan but this time I got this tv cheaper in a department store. My intention was to install this TV with a low profile wall mount. My surprise was to find that all connector in the back (except for 2 USB ports and 1 hdmi) where located facing out from the back of the TV. In addition to that the power cord is not recessed either. It comes out more than 1 inch from the back of the tv so when trying to use a low profile mount you simply can't.How come samsung makes these basic mistakes on design? If you buy a slim led tv it is because most likely you are planning to take advantage of the width and have it wall mounted as close as you can to the wall. Any way....the work around for me was to buy recessed outlet box for everything....hdmi, RCA, network, power, etc....and install the box exactly where the terminals in the back panel are. You have to measure perfectly where the recessed box should be located otherwise if you miss the location by .5 inch you are done.....no low profile mount.By the way, to add to samsung's mistakes, the power connector of the tv comes in the opposite side of the av connector on the tv so expect to install a 2nd box to allow the power connector sit on the wall.The TV quality is good and the image is really good....note that I'm not that picky with settings and image quality..formy normal use watcing tv with my family and enjoy the weekend this is a very good tv. If you are planning to install your tv on a tv stand I definitely recommend this tv otherwise add 200usd to 300usd to your budget to get the recessed boxes, connectors,etc and have them installed.", "Date": "May 3, 2012"}, {"Title": "Outstanding tv", "Author": "San", "ReviewID": "R34JRN4NNPD38G", "Overall": "5.0", "Content": "I purchased the tv recently. I am very much satisfied with the features and quality of the tv.60 inches tvBuilt in Wifi - works very good.Free Samsung apps - Netflix , YouTube etc. I tried both Netflix and YouTube . It's amazing quality. No buffering. Of course depends on the speed of your Internet connection.Browser included - renders the web page very nicely.A qwerty keyboard was not included. It would have been nice if they included them with the tv.The picture clarity is amazing. I had to set an option with picture settings for watching movies to feel like you are actually watching a movie.It comes with three hdmi ports.3d feature is nice. There is an option to cOnvert 2d to 3d as well. Comes with 2 free glasses.This is well worth for the prize compared to 7500 and 8000 series.Thus model was released in feb or march this year 2012.  It has improved Samsung apps .Overall I would rate this television better than Sony or LG or any other brand.Once you get the tv , make sure your cable receiver hdmi settings is configured to output 1080 I or 1080 p which ever is supported so that your tv can display with maximum clarity.", "Date": "June 3, 2012"}, {"Title": "We love it", "Author": "Robert Jersin", "ReviewID": "R1Z8F4J7FRG85H", "Overall": "5.0", "Content": "Purchased 2 months ago.Very full function.  A bit pricey.Picture is very good.  We are very happy with the TV.  I also like the low electricity use.TV acts as wifi hub for other devices when TV is turned on.  Very nice.Negative.  It is best to direct connect TV to home LAN for speed while streaming.We have some occasional difficulty with getting out of Netflix.Over all, we love the TV.", "Date": "January 6, 2013"}, {"Title": "Poor motion picture", "Author": "Pen Name", "ReviewID": "R27XVDYMJQPAGA", "Overall": "1.0", "Content": "Picture quality is great until you have to watch a fast motion picture. The picture becomes blurry during football games and action movies. I called Samsung to report the problem and they explained that this was because the motion rate was too low. Junk!", "Date": "October 31, 2012"}, {"Title": "Web Browser crash in Samsung Smart TV", "Author": "Srikrishna", "ReviewID": "R335JQ9Z5LR92D", "Overall": "2.0", "Content": "The web browser in Samsung does not support streaming of Videos. When I started to stream videos, the browser crashes within 5 minutes. I got a replacement and same happened. When I called Samsung Customer care they say that there is a limitation in the web browser and it should be used only for surfing.If that was the case they should indicate in the product description as a limitation rather misleading customers. Please do not get fooled by looking at this TV for a web browser.", "Date": "September 18, 2012"}, {"Title": "Great product, easy setup.  Picture looks great!", "Author": "bkmaster1", "ReviewID": "R17F0EX8Q6BGWA", "Overall": "5.0", "Content": "I just received this yesterday and had it hung on the wall within minutes.  The setup is easy and the picture is great.  Though I would point out, the mount I used for the wall required I go to the hardware store and pick up new mounting screws.  The way the holes are setup on the back of the set, they are indented to a depth greater than the screws that came with the mount.I read a lot of feedback on here before deciding to purchase this set, which I bought for the bedroom.  I have a Samsung in my living room, which I love so going back to a Samsung for the bedroom was a no brainer.  The picture is great but there is a review in here with very specific picture settings.  I recommend using the setup dictated in that review.  It's a pain to set all those settings but the picture truly is fantastic for the price.  My only regret is I don't have the wall space for the larger version!  The sound quality was also much better than I anticipated.I also want to point out that streaming Netflix works great.  I do have a fast cable connection (15 Mbps) with a great Wifi router.  I think if you are experiencing any issues streaming video, it must be your Internet speed or wireless connection.I have yet to try out the 3D and I am struggling with some of the Apps but overall, this is a great flat screen for the money.", "Date": "August 15, 2012"}, {"Title": "Bad picture = Pro calibration = best picture of any TV!", "Author": "Richard K. Ruiz", "ReviewID": "R1C2ONYDUSX408", "Overall": "5.0", "Content": "When I first received my UN60ES6500 I thought the TV was possibly defective. The picture was poor and the side angle very narrow. I fiddled with various adjustments and obtained detailed settings from audio visual web site. I even bought a calibration DVD. All with not much improvement. Then I had a very highly qualified certified individual come and do a professional calibration with the proper equipment and software. When he first looked at the settings he said he had never seen a set so far off directly from the factory. However, he was able to calibrate the TV to a very high level. One of his better calibrations that was almost perfectly spot on. The error factors were so small as to not be visible by the human eye. He was very happy and said that only a few TV's he had worked on were calibrated so accurately. Cost was $200. I had purchased a 3D Avatar DVD and he wanted to see the picture quality. After watching the movies for about 20 minutes I suggested we try some 3D off the cable TV. He was very knowledgeable about Avatar and the cameras used and the production techniques. His comment was that this was the best picture and 3D that he had seen on any type or brand of TV anywhere! I guess that was why he spent 20 minutes watching Avatar. He was genuinely impressed.Everything about the TV viewing improved including apparently widening the side viewing angle a bit. As I watch the Olympics with the latest high def TV cameras being used, I am just blown away. Obviously I am extremely happy with my purchase. I had a recent purchase LG 55\" that was also calibrated professionally. It had a very good picture. But the Samsung has a better picture even with a larger screen.My advice: buy from Amazon, keep the packing material until satisfied, have TV calibrated by certified and experienced professional.(If in San Diego area, I highly recommend Bill Ferguson of Coast Calibration in Carlsbad.)", "Date": "August 8, 2012"}, {"Title": "please read this", "Author": "michael pavon", "ReviewID": "R33CZFXKWOY8X", "Overall": "2.0", "Content": "i will not talk about the quality of this tv (from the hardware point) or the beautiful image, for those please read the other reviews, i will talk about the \"issues\" with this tv: you are watching a beautiful blu ray movie, you love how it looks, the image is crisp and so clear... and suddenly the image start to dimm by itself, yes start to loose light, and to make long story short, there is almost nothing you can do about it, looks its a \"feature\" built it in this tv, you can turn the eco sensor off and the auto dimm also, but guess what, ;) still nothing.i called samsung and they gave me a lame solution: my hdmi cables are to blame, i fill a service request online and guess what... next day samsung close it without an explanation, anyhow, just google the dimm problem, don't be frustrated as myself good luck.Update 01/29/2013:2 days ago i returned the tv, and got a panasonic gt instead, acording to the reviews one of the best tvs out there, image wise i like better LED, but no bugs and the internet apps soo much better!!I am happy now!", "Date": "January 24, 2013"}, {"Title": "Small flaw made impossible by the worst customer service ever", "Author": "MCC Phoenix", "ReviewID": "RTUCQ6UG0PU7S", "Overall": "1.0", "Content": "Would love the TV, except it came with a defect in the screen that Samsung refuses to deal with. The tv has a bright triangular spot at the upper right hand corner.  I spent 20 minutes in chat with a company rep, who had me initiate the program setup from the start. When it did not change the picture flaw, I emailed a picture of the screen from my phone. He then took my contact information and said He would arrange for a service technician to contact me for repair or replacement. We didn't receive the promised call to set up the appointment. We did get an email asking if our problem had been adequately handled. I replied it had not, and gave my history and contact information again. Two days and no response, so I sent the email again, this time giving the tv model and serial number, and asked for the promised contact. Except for the bright light on the corner of the screen, it would be a great tv, however, samsung's failure to deal with a defect present when the set came from the box and its wholly non responsive customer service department have come as a surprise that moved from puzzlement to irritation to frustration to anger. Wholly unacceptable.", "Date": "January 25, 2013"}, {"Title": "Love everything but the volume/meun beeps", "Author": "Plaz", "ReviewID": "R14JTVDY1AOHJE", "Overall": "4.0", "Content": "Have had the TV setup for a few days now. Love everything about it so far except the annoying beeps played when changing the volumn and when in the menu.  Generally it's very distracting and is really a problem when i'm trying to watch TV at night and my wife is asleep. She seems to wake up when I'm chaning the volume.  Beeps get louder as the volumn increases. Right now there is no way to disable that part of the audio. I'm hoping Samsung releases that option in a future update.  I also have a 55\" LCD from Samsung that is a 2011 model.  It does NOT have that annoying beep/chirp.For the others that have bought this TV, do you have any issues with this?  If so, please send Samsung feedback asking to release a firmware update that will disable it.", "Date": "March 28, 2012"}, {"Title": "Great value for the buck! Awesome Picture Quality", "Author": "eDER80", "ReviewID": "R5OSVJEGNHQ8O", "Overall": "4.0", "Content": "Purchased this tv yesterday as a gift for my father and he LOVES it! I already own the 55\"ES8000 which is the reason i decided to buy this 2012 model for him, as he has no interest in the extra bells and whistles. Prices have gone WAY down with all 2012 models so i decided to go for it. It was a toss up between this tv and the samsung plasma 60\"F5500. Plasma looked great, but would not work for the type of environment in which my father has his setup. too many windows and the screen was extremely reflective. I got to play with both sets' settings at the store and i could not be happier with my choice. The Led was the winner IMO. Once we set it up,the tv looks and works great! IT has an excellent PQ, specially for beign a 6 series. there is no clouding or edge bleeding with my particular set. I know many people arent so lucky when it comes to this. Its basicly luck of the draw with these samsungs to be honest. The setup was easy thanks to the built in wifi, which works smooth as it can be. I have not checked the 3D because as i said,my old man could care less about 3D. lol All he cares about is his movies and sports. One thing i did notice though, is that the blacks tend to be over saturated with blue at times, particularly in dark scenes. Its not too bad though, and its only something only a few people used to the inky blacks from higher end models will notice. Over all, This tv delivers a great picture for the price. Extended warranty, as always, is a must!", "Date": "April 23, 2013"}, {"Title": "Smart TV that isn't very smart!", "Author": "Lacey", "ReviewID": "RDXJMDHCEYCX1", "Overall": "2.0", "Content": "I purchased this TV four months ago because of my positive experience with an older model Samsung television.  I do not have cable/satellite, so my plan was to use this television primarily for its Smart features.  Unfortunately, right from the get-go, there were issues with the applications: sound but no picture on Netflix, a green line through the screen on Hulu, and absolutely no connectivity to Amazon Prime.  I worked with the Samsung support team to uninstall an update that was causing issues, which then allowed me to use the apps.Even with the apps working, they did not work as quickly or efficiently as my Roku.  Many of the covers/titles in Netflix still did not show up, but at least it was usable.  The latest issue has caused me to not be able to use the TV at all.  After clicking on an app, it says that it is connecting.  After awhile, it times out and tells me that I am not connected to the internet, so I go into the settings to find that the internet is, in fact, connected yet none of the apps will work.I contacted the support team again only to get this response: \"We apologize for the issue you are having with Smarthub. Please know that the issue is not related to your Samsung device.  We are experiencing high traffic on our server. We ask that you try to access SmartHub at a later time. Again,  we apologize for any inconvenience this has caused.\"  When I explained that the Smart Hub was the only feature that I use, she said, \"We are working to increase bandwidth on our servers to prevent further instances such as this from occurring.\"  Clearly, that is not an immediate solution to the problem.Another, unrelated con to purchasing this TV is that the picture quality is nowhere near a good as some of the older model, flat screen Samsungs.  Even after following instructions to improve picture quality from another reviewer, the picture still looks pixelated and lackluster in comparison with my older model.The bottom line:  If you're planning to use this TV solely for its internet connectivity and Smart features, save yourself the hassle (and a lot of money) and buy a Roku instead.", "Date": "March 3, 2013"}, {"Title": "Very disappointed with Samsung", "Author": "MNWA", "ReviewID": "RRHND3PAXKJY3", "Overall": "2.0", "Content": "The Good:1. Good design.2. Good vibrant color.3. Good features.The Bad:0. The picture quality is worse than lower end Samsung TVs.1. Black levels is very bad - my 6 years old Sony LCD TV gives a better lack level.2. Uniformity is fairly bad. You will also see lights coming out of the four corners (like flash lights). Extremely anoying.3. Buggy Smart TV aplications.I paid high primium just to get a Samsung branded TV, but it was not worth it. I could get a high end Sharp TV with higher options at $300 cheaper from Costco.UPDATE 3/4/2013:-------------------Having a serious problem with the Smart TV feature. The TV is connected to the network, but I cannot access any applications (netflix, youtube, browser, etc.) - they keep complaining the TV is not connected to the network. I have another TV, a few computers/tablets/smartphones and a VOIP phone connected to that router (Linksys E4200) without any problem. Interestingly, the TV always showing the connection o network is a success. Also, I tried to reset the TV to manufacturer default, but it did everything but the network settings (that's how it is designed). Did Google search, hundreds of users having the same problem! Lowering the rating to 2 based onthe price vs. value ratio.", "Date": "February 26, 2013"}, {"Title": "in case if you're wondering about the green halo / ghosting effect", "Author": "howie", "ReviewID": "R25JZ6JPS5ARPT", "Overall": "4.0", "Content": "this TV is ALMOST perfect. after a week long research, i went ahead and bought the un60es6500, being well aware of its pros and cons.Pros:1. beautiful blacks, beautiful blacks, beautiful blacks.2. great contrast ratio, even with moderate dynamic contrast setting, over 90% of the shadow details are still preserved.3. great color; after you plug in some of the professional calibrated settings.4. decently acceptable screen uniformity for its price. i went in well aware of it's uniformity issues that was mentioned in some of the reviews. i was wary, but knowing the LED panel technology still isn't perfect, i knew i was going to get some clouding issues. as it turned out, the clouding issue isn't as bad. i do get slight spills around four corners, but not very visible. with dynamic contrast setting at medium, and backlight setting at 16, it's nearly hard to spot the spills.5. Price6. 3D, which is a bonus, tho it's more of a novelty feature for me, not a necessity.Cons:1. green halo, or also known as ghosting effect in certain dark scenes. (i'll elaborate more later on).2. Standard preset is nasty looking, overblown, and over saturated. only setting that's view able is Movie mode. there is also not a lot of room for customization on top of the factory presets. many settings are greyed out for certain factory presets. i would much prefer letting the user to fine tune EVERY setting on top of each factory presets. for example, if you enable Game Mode, you're locked into Standard preset. you're only allowed to adjust the basic color settings, but not 10 point white balance, nor HDMI color space, nor are you able to turn off the CE dimming setting, which is kind of annoying and counter productive. i was hoping that i would be able to combine the game mode with the calibrated movie setting so i won't have to press 5 buttons through 3 different menus each time i want to play a game or start a movie.3. Certain hidden settings that are not customization, ie the CE dimming effect which is present in all the presets but Movie Mode.4. embarrassing manual that might as well be a stack of toilet paper. it serves no purpose what so ever. doesn't give the spec, nor does it advice you on any settings. this is a HUGE step back for Samsung.5. viewing angle isn't as good as plasma or traditional LCD. but i already knew that going in.now if you're wondering about the green halo or ghosting effect. read on. otherwise if you don't know what it is, or have never noticed it, do yourself a favor, forget about it and enjoy this great TV.i did some more extensive research. as it turns out, our european cousins are having the same issue with their european version, also known as ES6300. read this thread starting from the bottom of Page 7 [...]you'll notice that on page 9 someone changed out the Tcon board (also known as Timing Control Board), and he says the ghosting problem is gone. so now i am not sure whether it's the pixel response or some kind of module, but what we can all agree on is, there is a problem.but here's the kicker.... on that thread someone also mentioned that in 3D mode, the problem is none existence. so I came home and tried switch out of the calibrated movie mode and back into standard mode and tried to match the settings of the movie mode to as close i can get so that it's visually indistinguishable as possible. and guess what... the ghosting has gone down tremendously. i mean it's not COMPLETELY gone, but at this it has improved so much to a point that i am no longer thinking about returning the set, because it is almost undicernable now. the only time you'll still notice is during an extreme close up in a dark scene where you have an actor's face taking up half of the screen and the actor turns the face fast. but 99% of the time i can now watch my movies without having to notice those green ghosting effects anymore. i know it's not perfect, but i highly suggest you guys to give the below setting a try to see for yourself.in order to make the Standard mode to match the calibrated movie mode, i had to make some slight changes. mainly due to the fact that Standard mode doesn't have 10 point white balance option.btw, i can attest to the previous user that the Standard mode DOES have some kind of hidden effect applied to it that makes the picture more contrasty compare to the movie mode. even with all the settings matched, the Standard mode picture will still look more contrasty and BRIGHTER than movie mode at the same setting. but here're the settings below you'll need to make in order to get the picture look as close to calibrated Movie mode as close as possible. mind you i work in the motion picture industry doing visual effects, so i have a very keen eye on spotting colors.Picture Mode: StandardBacklight: 12Contrast: 100Brightness: 45Sharpness: 20 (this can be any value you like, won't affect color)Color: 40 (this must be 40, or something VERY close to this value in order to compensate for the slightly overblown/over saturated picture in standard mode)Tint: 50 (default)Advanced SettingsDynamic Contrast: Off (standard mode's dynamic contrast off setting will actually give you the same level of contrast as movie mode setting at LOW)Black Tone: Off (i highly recommend setting this value to OFF on all settings, as setting black tone on anything but off will only crush the shadows, trust me)Flesh Tone: 0RGB: offColro Space: AutoWhite Balance: leave it at default (if you change any of the values here WITHOUT fine tuning the 10 point white balance your color will be wayy off, and since Standard mode does not allow 10 point adjustment you need to NOT touch any of this setting. this is why we changed the COLOR value in the basic picture menu to 40 in order to compensate, so leave this setting unchanged.)Gamma: +1Picture OptionsColor Tone Warm2the rest of the settings that i did not mention you should leave them off. All the noise filter are up to you if you want them, but those won't affect any color.give the above settings a try if you have the 60/65 inch model like i do and have the green ghosting effect. pop back in a movie that you know will have the most amount of ghosting effect, for example Mission Impossible 4 the rail way scene after Tom Cuise escapes from the river and walking to the train, this is my benchmark scene for testing.one thing i do have to note is, since you're now forced to use standard mode, you're forced to use CE Dimming. so that's the only down side, but the up side is.. CE Dimming masks all the clouding issue that you might have.let me know if you have any questions. i am still hoping that Samsung can come out with a firmware update to address this, because if the settings can improve the problem, there's remedy for it. imagine if the TV had looked like this i would've never noticed any of the ghosting and just carry on with my life. so if them come out with a firmware that minimize the majority of the problem, i am willing to bet hardly anyone will notice the problem opening their box of new TV.", "Date": "February 19, 2013"}, {"Title": "This is great", "Author": "Jane Sheedy", "ReviewID": "RK27YQX6H1GSF", "Overall": "4.0", "Content": "Love the picture, sound is good. I don't use the online features as much as I thought I would but this was a good buy for my needs. My next purchase will be a blu ray player so I can test out some 3-D content.", "Date": "January 4, 2013"}, {"Title": "Great Picture!", "Author": "Cathy W.", "ReviewID": "RSIYK3J6J3GJF", "Overall": "5.0", "Content": "We purchased this TV about 4 months ago and are very pleased with the picture quality and features. Please beware that this Smart TV DID NOT include Amazon Instant Video (this was a big disappointment) but we were able to get around this issue by purchasing a Roku 2 box. The Roku has the Amazon Instant Video app and much more and worked extremely well with this TV. We also purchased an indoor leaf antenna (also from Amazon) and now have access to a lot of channels over the air, and we no longer subscribe to cable.", "Date": "December 31, 2012"}, {"Title": "Love It!", "Author": "Bernard Cornibert", "ReviewID": "R2ERJUR2YGDKSK", "Overall": "5.0", "Content": "Excellent! Fast delivery and good product. A very good choice so far and Samsung is a great brand.  Meet my expectations. Highly recommended.", "Date": "December 31, 2012"}, {"Title": "Great Pictures. but smart TV isn't so smart ...", "Author": "Amazon Customer \"Flo\"", "ReviewID": "R3A9JVRCVU51P5", "Overall": "3.0", "Content": "well I am pleased with the TV portion of this 32 inch  HD..Clear,Sharp w Beautiful color reproduction and Sound but the Smart TV portion not so much.......for one.. I has been an on going struggle since install to get the TV to sign into my wireless system.. once in it is as slow as can be..  at first I  thought it might be my system.. but then the  Samsung BluRay player has no problem just the TV..Nor does any other wireless component in the same room, JUST the Samsung TV.Calling Samsung was a joke..  No support what so ever.. They didn't' even listen to me try to tell them the issues just started reading off a Script.. about my Microwave  oven !!  Give me  a Break .....................  would I purchase this particular unit again ... NO... would I purchase a Samsung  without the Smart TV component YES...The 3D portion of the TV works fairly well.. the 2d to 3d is better than expected. The sound is GREAT.. sounds like a nice sound system. The glasses are the cheap version that the arms of the glasses will NOT fold..  so problem w storage. The report is big and has a self LIGHTING optionSet up minus the smart TV portion was simple..  easily recognized my satellite tv system ..andwhen connected to a ROKU ( which has not problem getting online by the way ) .. smoothAgain if I were to purchase again.. NO SMART TV.. waste of money at this point... just buy the  Samsung HD and pick up a bluray  w the apps ..much cheaper and works MUCH BETTER.  in my opinion.", "Date": "December 24, 2012"}, {"Title": "Samsung UN32ES6500", "Author": "acanal", "ReviewID": "R1L25QY9KU0M1Q", "Overall": "5.0", "Content": "Amazing. This is truly a wonderful set so far. Setup is very easy. It \"sees\" all my HDMI, Optical and USB connections.Only problem I am having so far is connecting the MS nano-usb keyboard and mouse. The system sees and registers them both but they will not function. I will call Samsung soon to get help-otherwise -great!", "Date": "December 20, 2012"}, {"Title": "A NON-TECHIE'S REVIEW", "Author": "Sharon Beverly", "ReviewID": "R1O8WRLKON1NPT", "Overall": "5.0", "Content": "I am not a techie and this is not a review of the technical aspects of the Samsung 6500 50 inch TV.  I can, however, tell you about its other characteristics.  If you are not tech savvy or, are a Boomer or, just plain perplexed, I hope this review will help clarify your thinking.It's important to determine what capabilities you want your new TV to have.  Shopping for a television isn't what it was years ago.  Then, all the features you looked for were the tuning buttons and (eventually) the remote control.  TV shopping's come a long way, baby. Prior to shopping for our new TV I researched online using: Consumers Reports; manufacturers' websites; blogs; and online discussions.  When we'd narrowed down what we wanted--and did not care about--we went shopping at the big box and warehouse stores.  Amazingly, at each store our experiences were consistent.  Here is what we found:* The mid-price point televisions that appealed to us were Vizio and Samsung* Viewing these two brands side-by-side, the major difference is picture quality* Samsung's picture is clearer, crisper, with more vivid colors* The refresh rate can be important if you watch a lot of fast action sports.  Blurring occurs at a slower rate.  The higher the refresh rate, the better.* There are off-brand TVs at a lower price, but don't compare well to Samsung* There are more expensive TVs (especially 3-D)* Some TVs offer web capability but, beware; these are predetermined sites set by the manufacturer--browsing is out* Samsung's 6500 allows total browsing, Skyping, etc.* Samsung's TV comes with the remote control--not with the keyboard for web access* Samsung's keyboard (as of this writing) is about $100; the Logitech keyboard (the most recommended by all sales associates) is about $30.  (We got the Logitech and it works fine.)* Samsung offers tech support, if neededWe bought the 50 inch Samsung 6500 to be placed in our family room.  The viewing distance is about 12 feet and is much smaller than the size recommended by Samsung.  (If you go to their site, they offer a way to calculate the size you will need.)  We see no reason to have a larger screen.We want to Skype using our keyboard and TV screen.  Seated 12 feet away from the TV means that we need to get a very good webcam and that viewing us (the party whom we are calling) will not offer a tight close-up at this distance.  From what we have researched so far, the angle is only about 78 degrees.Some final notes:* The Samsung 6500 gives us full internet access--albeit not as rapid as when using our PC* Amazon Prime's instant videos are a pleasure to watch on this TV* Netflix and many other apps are already  programmed* This TV is gaming (such as Wii) capableMost of what I have written so far is objective information.  Here are some subjective thoughts.  We watched THE LIFE OF PI with friends.  This movie has some 3-D moments and although the TV is not 3-D capable, we all felt as though those moments were even more spectacular than the clarity we were enjoying already.  Another time, we were watching a basketball game on our 6500 with friends.  They were impressed with our TV yet again.  As a result, two families are buying this TV.  And two of our kids want the Samsung 6500 for their own homes.  We are delighted with our purchase.  What more can be said?", "Date": "July 21, 2013"}, {"Title": "Great Picture - Affordable TV", "Author": "SillyYankee", "ReviewID": "REQATUCW6DQL2", "Overall": "4.0", "Content": "Let me start with 5 starts on the picture. It is amazing. I had this tv purchased and installed by a professional. It looks amazing.However, My husband is hard of hearing and for the last 10 years we have been using CC on all our TVs. I actually like the cc very much. When you miss what a certain character said, you can just read it. It is especially helpful during movies and the box really does not get in the way of the action (unless you are watching news - then it sometimes is in the way of the ticker). Also, you can watch Tv without disturbing anyone late at night and early in the morning. I digress. After a bit of on line searching I discovered that many people are having the same issue with their Samsung TV.Basically, Samsung HD does not support CC, but the coax cable hook up, non HD will show CC. WHAT??? I just purchased a beautiful TV for a pretty penny and I cannot watch it the way I want. I can choose, Closed Captioning or High Def, but not both. This is my last Samsung purchase. The picture may not be as good on my Panasonic, but it was less money and I can still watch HD and read Cc at the same time.Lastly, it does not support the Amazon streaming. Another nail in the coffin. If you don't need CC or Amazon streaming. This is an awesome TV.***************Update Dec 2013 - somehow closed captioning works now. It appears that comcast needed to \"upgrade\" the system in our area. Now we have an option to put closed captioning on. As the other commenter noted it had to be done through the set top box, which we could not do 18 months ago, but can now. I have upgraded my review to 4 stars.I am still annoyed that with a \"smart tv\" I have not been able to get amazon streaming. I also cannot spend any time messing around with it to see if I can now.", "Date": "August 12, 2012"}, {"Title": "Amazing Picture Quality", "Author": "PS3 gamer \"Josh S\"", "ReviewID": "R1KPQGQGQNEO2G", "Overall": "5.0", "Content": "I purchased this product for my parents who are in their 60's. At first, they were intimidated by many of the features, and especially the 3D, but they quickly became quite comfortable with the product. The 3D feature can be turned on and off with a single button from the remote control - no navigating through confusing menus. Fresh out of the box, the TV had a beautiful picture, and even though I don't consider myself an audio-video expert, I was quickly able to fine tune the picture using the on screen menu. 15 minutes of playing around with the color, brightness, and contrast resulted in screen quality that was as good as I had seen on more expensive televisions in stores. The 3D glasses synced with the TV on the first try, and I was blown away by the look of the 3D - both true 3D content (The Avenger's on 3D BluRay played on PS3) and \"converted\" content (football games on ESPN - not broadcast in 3D). I am extremely happy with this product, and plan on purchasing one for myself right after the holidays.", "Date": "October 2, 2012"}, {"Title": "Loved it - now wondering how long the TV will last", "Author": "Megha", "ReviewID": "R2ZUC5ML5VHWUE", "Overall": "2.0", "Content": "Had this TV for 34 days. Everything is great about this TV except when you run apps using wi-fi (example Netflix):- If Netflix takes more than ~10 seconds to load the movie, the TV restarts. Everything works great after restart.- Sometimes there is only audio and no video. Restart the TV and everything works great.- Sometimes half of the screen has video and the rest is black. Restart the TV and everything works great.With multiple rounds of troubleshooting, I can only see the TV being a problem, not Netflix, not the internet connection.", "Date": "August 28, 2012"}, {"Title": "It's okay", "Author": "LeetLaur \"Leet\"", "ReviewID": "R2ZWJJ4NF64WFT", "Overall": "3.0", "Content": "Samsung is supposed to be known for great quality.. I didn't exactly get that.The TV is thin, has a nice weight and the screen has a decent brightness to it. You can get a pretty picture if you mess around with the settings. There are A LOT of settings and messing around with them will let the TV produce a really colorful, vibrant picture... but that was only nice for me when my picture was clear.I had the same problem with 2 tvs, where my image from a device was just flickering and jumping with distortions all over my screen and now I'm having some kind of fading on the side of my screen. It doesn't happen enough to where it makes playing games terrible but it does happen and it is noticeable which is unacceptable for a TV of this caliber and price. Reading text is also frustrating at times as it can look extremely grainy or blurry. If you are patient and can mess with the settings you can probably get it to look better.It is a smart TV so it has apps and networking features but those are nothing state of the art that a computer can't handle 10 times better. If you don't have a computer you can open up various social media or streaming apps and connect to them from the TV.Overall this TV has lots of features but I feel like it doesn't do any of those features fairly well. I got it because it was a cheap 32\" 120hz tv with all of these crazy features and I wanted to use it as a pc monitor/casual gaming tv at home. It works well on occasion but the flaws with it make me regret my purchase wholeheartedly after going through 2 tvs and now dealing with another repair.", "Date": "July 11, 2013"}, {"Title": "NO WIRELESS CONNECTION", "Author": "Annis Roberts", "ReviewID": "R187IQIGDP106O", "Overall": "5.0", "Content": "Love the TV. Great picture!!! The only drawback is not being able to connect to the internet---the main reason we purchased the Smart TV. Several people with technology skills have tried with no success. My internet provider gave me a number to call--didn't work.  Right now I feel that we spent a lot of money for something that we are not able to use.", "Date": "May 22, 2013"}, {"Title": "Samsung Smart TV", "Author": "Eugene H Johnson", "ReviewID": "R1GHA1PJUW1XC4", "Overall": "5.0", "Content": "I've had three Samsung TVs. They're good TVs in my book. Clear pictures and easy-to-understand connections and remote. Hope you like yours.", "Date": "May 4, 2013"}, {"Title": "Not Totally Disappointed", "Author": "Joseph Kutches \"jdk\"", "ReviewID": "RGBYBTCGONJR4", "Overall": "3.0", "Content": "The TV picture quality was everything I was expecting, did use the picture set-up setting mentioned here and have no issues wit the picture quality. 3D is really nice option. Reason for downgrade is my SMART WiFi connection is not working, called Samsung and they said my WiFi router was too far away and I need to install a cable. Haven't done that yet as my DVD wifi works fine and has the same SMART options. Not sure why my $79 3D DVD WiFi works yet this TV doesn't.", "Date": "April 1, 2013"}, {"Title": "Good features and quality", "Author": "Too many toys", "ReviewID": "R37J3OO5OF4MW", "Overall": "4.0", "Content": "I've had mine for more than a month. I am pleased with the picture and sound and the smart features and app are very good. The only issued I've had are the odd-sized holes for the wall mount screws. They were larger than the VESA standard and required a trip to home depot and drilling out the holes on my VESA mount. When the standard screws did not fit, I contacted Samsung via live chat. Like their website, they gave me bad information.", "Date": "March 21, 2013"}, {"Title": "Great 3D TV for the price.", "Author": "Jacques Meyer", "ReviewID": "RP28905GP1FLW", "Overall": "4.0", "Content": "Pros--Samsung makes great products and this is no exception-good picture once calibrated-Great TV with lots of features for a reasonable priceCons--Semi-gloss finish is not very appealing-takes plenty of time to calibrate-depreciated almost $400 in 2 monthsConclusion-This television is by far one of the best on the market for the price and features. I love Samsung products because they consistently deliver the quality that expected. The cons on this product by no means take away from it but they are factors to consider.", "Date": "February 25, 2013"}, {"Title": "Great product", "Author": "L. Barlow", "ReviewID": "R1V5QZ0O59DWPG", "Overall": "5.0", "Content": "Very, very pleased.  Have TV mounted on the wall.  Did turn off the Energy Saving feature, since that caused the picture to dim at times.  Have a multi-regional Samsung DVD and a Wii connected to TV with HDMI cables, and they all work fine.  Even the old black-and-white DVDs look better than they did before.", "Date": "February 23, 2013"}, {"Title": "Fantastic picture both in 2D & 3D", "Author": "CBW51 \"drummer\"", "ReviewID": "R12AG48JCX7LY0", "Overall": "5.0", "Content": "I'm a huge fan of Samsung (have 3 others) and Samsung has produced another winner in the 6500 series. I looked at the 7100 and even 8000 series but kept coming back to this one because of the reviews, specs and price. After tweaking the settings, the picture on this set is spectacular. Black levels are great as are color, back lighting, sharpness and contrast. When I ordered the set, Amazon gave me the Samsung E5900 Blu-ray 3D player and I bought Avatar & Titanic in 3D. Wow! What a great picture using the Samsung active 3D glasses. I highly recommend this TV.", "Date": "February 13, 2013"}, {"Title": "Samsung UN32ES6500 32-Inch 1080p 120Hz 3D Slim LED HDTV (Black)Samsung", "Author": "June Jensen", "ReviewID": "RP5G2VBQ0XOR7", "Overall": "5.0", "Content": "Love my new Samsung TV. Just received it yesterday 1-25,2013. Was in perfect condition when my favorite UPS driver delivered it. The only thing is I can not get it to connect to WiFi or the network. I'm watching my first hockey came on the new TV. Thank you. I checked with Consumer Reports and customer reviews in making my decision on this brand TV. I purchased a Samsung Galaxy cell phone and love that also.", "Date": "January 26, 2013"}, {"Title": "NOT FOR LOW PROFILE WALL MOUNTS", "Author": "spunki mo", "ReviewID": "R2XIZBSC2R8Q5I", "Overall": "4.0", "Content": "This TV has great picture and sound, and is extremely thin and lightweight.  I love being able to stream YouTube and Amazon Prime videos seamlessly through Smart TV.  HOWEVER, the whole reason I purchased an ultra-slim TV was to be able to mount flat to the wall.  The power cord and two HDMI inputs project straight out of the back, rather than sideways, forcing the TV out at least 2\".  I am getting some 90 degree HDMI connectors and hoping the power cord wont be too much of an issue on its own.  Serious design oversight IMO.  Oh well.**UPDATE**The HDMI ports are stacked on top of each other, so there isn't enough room for two 90 degree adapters pointing down.  You need one 90 degree and one 270 degree adapter so they point in opposite directions. There, I just saved you 5 bucks.Too bad the power cord still projects out too far.  I cut a small hole in the drywall behind it to get the TV lying as flat as possible.", "Date": "January 24, 2013"}, {"Title": "Better than expectred", "Author": "Happy One", "ReviewID": "R2WOS9I1C2XM09", "Overall": "5.0", "Content": "Picture qality is very satisfyingand I was even able to connect the TV to my \"old\" stereo for much better sound quality.", "Date": "January 14, 2013"}, {"Title": "More than expected", "Author": "wmeieio", "ReviewID": "R1E8YCIH83E8XU", "Overall": "5.0", "Content": "I gave it as a Christmas gift. He's sill finding things to do with it.  Beautiful picture, needs sound bar.", "Date": "January 13, 2013"}, {"Title": "Samsung 40 inch slim LED HDTV", "Author": "Nezer", "ReviewID": "R1NAY3JGSD2CL8", "Overall": "5.0", "Content": "I have not had much time to access all features of the TV. It is the right size for my room and the picture is good. Some of the channels are cloudy. I haven't  found out if it is the station or the TV. Someone who knows about TVs well come out in the future to help me.", "Date": "December 28, 2012"}, {"Title": "WiFi", "Author": "Gary Kelderhouse", "ReviewID": "R1VAPBO7JK2019", "Overall": "5.0", "Content": "The \"built-in\" WiFi was very simple to setup!Wall mounted....some cables required 90° connectors.The sound is amazing....expected it would need an external system, BUT no!!", "Date": "December 28, 2012"}, {"Title": "good good good", "Author": "Yang Wang", "ReviewID": "R1VNY7QB1EEHL5", "Overall": "5.0", "Content": "Very good TV compare the money I spent. Samsung is the best for 3D, thats why their TV prices are a liitle bit costly, but you will get what you pay for.", "Date": "December 26, 2012"}, {"Title": "not bad", "Author": "aem", "ReviewID": "R2C4YZ8JV9BL91", "Overall": "4.0", "Content": "I bought this one because I have and like the larger version so much.  There are some slight differences of course, but it's nice.  Could be cheaper, but oh well.", "Date": "December 15, 2012"}, {"Title": "Good brand. Bad unit.", "Author": "ProfessionalProduction", "ReviewID": "RFLA0XUU41EDU", "Overall": "3.0", "Content": "Had the panel fizzle out on me after a few weeks of use. The bottom corners starting going dark, almost like a vignette effect. Except I didn't ask for the vignette effect during my video game playing. I only like that on photos and Instagram.Anyway, a quick call to Samsung and a visit from a 3rd party Samsung-affiliated technician and the panel was replaced free of charge.I can see clearly now, the darkness is gone. I can see all pixels on my screen. It's gonna be a bright, bright, bright blindingly bright screen.", "Date": "April 4, 2013"}, {"Title": "Great once calibrated", "Author": "nhwhazup \"nhwhazup\"", "ReviewID": "R28G1I23V7N2RC", "Overall": "4.0", "Content": "Bought this in the 55 inch 6550 model. Researched a bit and found this TV to be a great value.  Also, my previous Samsung has been an excellent TV with true to life colors and a superb picture.When we set it up and turned it on, I couldn't believe how awful the out of the box settings were.  A vivid, standard and Natural were all pretty much torch mode and garish. The movie mode was better but washed out and somewhat hazy. Needless to say I was pretty disappointed.So for the last few weeks, I've been tweaking away and finally found settings that provide natural flesh tones along with a crisp picture. This is by no means a professional calibration but looks great to my consumer eyes. I even thought about getting a professional calibration but I couldn't find any local services in NH other than Best Buy.  Anyway, I started with a couple of professional calibration settings that I found online and then tweaked the settings further to get to these settings. Hopefully they might help someone else.Picture Mode MovieBacklight 17Contrast  85Brightness 47Sharpness 15Color 47Tint G50/R50ADVANCE SETTINGSDynamic Contrast LowBlack Tone DarkFlesh Tone 0RGB Only Mode OffColor Space Native10pt White Balance OnGamma 0Expert Pattern OffxvYCC OffPICTURE OPTIONSColor Tone Warm1Digital Noise Filter OffMPEG Noise Filter OffHDMI Black Level LowFilm Mode Auto1Auto Motion Plus Clear OffLED Motion Plus Off10PT WHITE BALANCEONInterval Red Green Blue1 0 -1 -12 -1 -1 -13 0 0 04 -1 0 +15 -1 -1 +16 -1 -1 -17 -1 -1 -18 0 0 09 +1 0 010 +2 0 0WHITE BALANCESetting ValueR-Offset 25G-Offset 25B-Offset 28R-Gain 18G-Gain 23B-Gain 21", "Date": "February 9, 2013"}, {"Title": "SADLY DISSAPPOINTED...Thank you Amazon", "Author": "RSS", "ReviewID": "RG908PMRL8ZLN", "Overall": "4.0", "Content": "We received our TV a week ago and after about 5 days of showing clean and sharp and everything you would expect in a brand new TV set it just went completely BLANK. We tried unplugging and re-doing the entire set-up and still no luck in getting any visual...after a few minutes the audio came back without any visual. We contacted amazon via chat and currently I am awaiting a \"hardware specialist\" to take up the matter. we contacted Samsung and they indicated amazon would have to replace the item. As amazon responds to how we deal with this issue I will update my review. So far no hassle.After dealing with Amazon via chat we replaces the part for the television and issued the receipt to amazon who in turn refunded us the cost of repair ...Thank you Amazon", "Date": "January 31, 2013"}, {"Title": "Beware of the 60 inch model", "Author": "D. Webb \"Spivey\"", "ReviewID": "R3CLI404Y83225", "Overall": "2.0", "Content": "I've had this tv for 2 weeks now.  I have played with all settings and modes including the ones from the reviews on this site - even turned off all the effects and digital processing.  The tv is beautiful looking hanging on the wall.  The color reproduction is absolutely amazing on bright scenes and I don't really notice any hotspotting, flashlighting, etc.  But there is a serious issue with this 60\" model - there are green streaks that occur on dark moving objects, and around eyes and hair.  It doesn't occur on still screens, so it has something to do with the refresh rate of the green vs other colors.  Once you see it, it is very distracting and you can't stop seeing it.  Dark movies are the worst.  I have tried several input sources and cables, all with the same problem.  I checked avs forum, unfortunately after I bought it, and I am not the only one experiencing this problem on the 60 inch model.  I have not heard of it on other models.  Anyway, it is going back and I am going to try the 7100.", "Date": "October 31, 2012"}, {"Title": "Samsung UN40ES6500", "Author": "Hitagi", "ReviewID": "R3KS7HARC1YTI9", "Overall": "4.0", "Content": "I noticed there are few bleeding (few ones - below and one - above) on the screen. However, my wife and I can't see it if we sit front little far from HDTV. If we stand either right or left, we can see them on the screen. The bleeding are fairly small. It will be improving if I reduce backlit a bit. I don't see any flashing or clouding, but I will check it for few days and nights. I haven't test on 3D and 2D to 3D yet. I am little iffy about CE dimming, and it seems Samsung adds auto CE dimming. According to some customers, game mode will prevent it. If it is not for bleeding, I will be happy with HDTV.I need calibration for best picture and audio (movie and standard mode)and improve issues such as bleeding. I will update sooner or later.EDIT (Aug 16, 2012): I saw few clouding on the screen during the night. After I switch to HDMI 2 (before I turn PS3 on), I am able to see these clouding on the black background. While I watched Sherlock Holmes last night, I don't see any clouding or bleeding. Still debating should I return it back and get new one. Of course, I am fully aware of having risk to get new one that it may have worse clouding/bleeding or dead pixel. By the way, I don't see any dead pixel on the screen. It looks like Samsung or LG releases their edge-lit HDTV with little or no improving on clouding and bleeding problems. Oh well... If these clouding don't make the picture quality worse, then I will keep HDTV. If you don't like to see clouding or bleeding on HDTV then get backlit LED or plasma instead.While Netflix is connected with no problem via wifi last night, the movie can't start due to this message: \"Sorry that title is not available to watch. Please try another title.\" I tried to click few movies and still same message so far. I decided to try clicking movie this morning and it works finely. I am not surprised about this at all.BTW,it was shipped by UPS. I dislike UPS because they sometimes handle it roughly. I saw YouTube video that UPS driver threw package over the gate! Anyway, I noticed there is left corner of box below loose a bit since they didn't tape it all way. Fortunately, I don't see any damage on HDTV. If you order 46 inch or less HDTV, Amazon will pass the order form to UPS so make sure to be there at your house for UPS arrives.", "Date": "August 14, 2012"}, {"Title": "Samsung's SmartHub doesn't work.", "Author": "James McCauley", "ReviewID": "R1D9RRUWCYLZRW", "Overall": "1.0", "Content": "I specifically bought this TV to use in a workout room via the wireless connection. It worked about half the time before I finally called Samsung.At the time I called, I was told they're aware of many problems with SmartHub and they were planning on adding a server. They have no idea when that will be completed.As the conversation went on, they then admitted that their SmartHub application was down and was \"currently updating\". Again, no idea when it would be up.I let them know I would be writing this review, with this message. The response \"would there be anything else I could help you with?\"", "Date": "January 10, 2013"}, {"Title": "Just as amazing as advertised", "Author": "C. Holmes", "ReviewID": "R1JQ6YENDLEGQ9", "Overall": "5.0", "Content": "The wife and I were torn between the Samsung UN55ES6100 55-Inch 1080p 120 Hz Slim LED HDTV (Black) and the Samsung UN55ES6500 55-Inch 1080p 120 Hz 3D Slim LED HDTV (Black).  We chose the ES6500 for the faster processor speed that comes with the 3D feature.  Having had the TV for 3 weeks we have not used the 3D feature, but I can speak to the improved clarity.  I watch a lot of blu ray movies and fast moving sports and have seen no signs of blur and the clarity is amazing when compared to our earlier Samsung LCD.  The only picture issue I have noticed is a little bit of corner glow, but it is very faint and once it was properly calibrated for the house I have not seen it since.  Also, true blacks seem to be harder for the system to hit than the LCD series, but I guess to lose 20lbs of weight and 1\" thickness nothing can be perfect.In terms of calibration settings I would recommend the one found in the review section here (seems to be the first review you see when you search for this TV).  They work really well for movies and HD tv signals.  It does not work so well for games, but that is what Game Mode is for and with some basic calibration can be made to look just as good.This is a great television and the smart hub is a nice feature.  Not really something we will use regularly, but it is a nice feature.  My next purchase will be the Skype camera so we can talk with family.  I will update this review when I get around to buying it Samsung VG-STC2000 Skype TV Camera (2012 Models)As a side note:  While Amazon does consistently have the best pricing do not be afraid to shop around.  We purchased ours a a Big Box store and were able to get rewards points ($45), Discover Cashback (~$80), and a discounted warranty that could not have been obtained through Amazon.  Just sayin'", "Date": "July 17, 2012"}, {"Title": "Good computer monitor", "Author": "Kirill Lebedev", "ReviewID": "R2E191N2HEJLUF", "Overall": "4.0", "Content": "Excellent display whatever you use it for: video (TV, movies) or as computer monitor for gaming, office work, Internet, but some photographers might find a little bit disturbing very slight bluish tint on one side and purplish tint on the other, 1.5-2 inches wide. It's only visible on beige, white or gray background while using PC applications and absolutely non-existent when watching TV, photos, movies or gaming. Monitor is still very good for most of users, but picky graphics and photo professionals might find this unacceptable.For me some benefits of this screen outweigh this little problem: screen is huge for monitor and lots of controls make it highly customizable, it's not glossy (which is very important for me) and it's not losing contrast when you change your viewing angle.As for editing photos, I use Photoshop or Lightroom and image is always at the center of the screen and never gets affected by this tints on sides, only controls are. Anyway, it's not bad enough to motivate me to replace it.", "Date": "November 16, 2012"}, {"Title": "CAUTION:  REPAIR SERVICE IS POOR", "Author": "onisland", "ReviewID": "RY13HWCP0T1A9", "Overall": "1.0", "Content": "I purchased a Samsung 3D television last April (2012).  This was a tv that we use very infrequently, and after only a handful of uses, when turning on the tv there was no picture and no sound.  I called the Samsung support line to have the tv repaired, they indicated they knew exactly what the problem was and ordered replacement parts.  After two and a half months the tv has still not been repaired, and Samsung has told me they do not replace a tv.After spending a few thousand dollars on a tv one would expect it to work.  I would suggest you look at other televisions that perform better than this one.  We loved the look of the tv, however, looking at a tv that doesn't turn on for a few months makes you not like it so much.I asked to speak to management of Samsung and no one would speak to me.  BUYER BEWARE!!!!", "Date": "March 9, 2013"}, {"Title": "Great picture quality and overall value", "Author": "Angela Pak \"apak\"", "ReviewID": "R3TK3M89VDQ1YK", "Overall": "5.0", "Content": "I researched for a looong time to find the best TV I could find at around this price range (I paid $900), and this was what I came away with. When I bought it, this model was already a year old, but that doesn't mean the TV isn't as good as when it first came out. I saved a bunch of money this way.For the money, it comes with a great screen size and quality as well as smart TV functions and 3D capabilities. Screen is very bright and colors seems accurate enough for me, although I had to play around with the settings to get it just the way I like it. I recommend doing this for any new TVs anyway. I use this TV for a lot of video gaming, and it looks gorgeous. It's also nice that you can have separate configurations depending on what your output is.The smart TV functions work just fine, although the interface is not as zippy as say a laptop or a smartphone. My main use for this is Netflix, and I have absolutely no issues with it. I have to admit, I don't really use the 3D function, but it's just nice to have.One thing that isn't great is the way the speakers buzz at some of the lower bass sounds. It doesn't bother me much, but if you are an audiophile, I'd recommend adding a separate sound system. Overall the TV is very attractive, light, and energy efficient. I'd recommend this product to any casual to moderately picky user.", "Date": "October 11, 2013"}, {"Title": "Smart TV does not work and Samsung has no idea how to fix it.", "Author": "Michael L. Sherrard \"Michael S\"", "ReviewID": "R25VFGZ8SXP4HQ", "Overall": "1.0", "Content": "The TV worked fine for about 5 months.  Then the \"Smart Hub\" stopped working.  I got endless error messages that the network was not connected, it walked me through hooking up to the network again, starting from scratch, reentering the password etc, then it says I am connected, then when I try to open an app it says I am not.  I spent three hours with Samsung Support live chat.  We reset DNS Settings, updated the software, reset the \"Smart Hub,\" then the chat representative terminated the call because he said he had to help another customer!????  Really?  He terminated a call with a customer after three hours?  After a few more hours we determined that the problem was the wireless receiver on the TV. It is simply weak.  Five other devices are working fine in the living room and the network status on the Samsung TV says 3-4 bars of signal, but it cannot maintain a reliable wireless connection.  I finally plugged an Apple Airport Express into the wall to pick up the wireless signal and hard-wired it to the Samsung. My one-star rating goes to the wireless capability of the Smart Hub, the diagnostics (especially the one that showed me a 3-4 bar signal), and the support. For any of you that have network problems when using a wireless network, try a hardwire connection and see if it solves your problem.  Then at least you know what the problem is.", "Date": "September 9, 2013"}, {"Title": "red spot on screen", "Author": "Beach Bob", "ReviewID": "R2EUD4YM3OK2TN", "Overall": "1.0", "Content": "40 days after the 1 year anniversary of this purchase of this TV, one of the pixels on the screen has turned into a continuous red dot.  The warranty is now over and I'm screwed.  It will probably only get worse from here.Update:  I have e-mailed Samsung about this problem and will post their answer when I get it.Update:  Lucky for me that when I went to Samsung.com to register my TV I was given a 3 month extension to my warranty.  Samsung customer service was spot on and they quickly had a technician bring a new screen and switch it out.  Problem solved.  My only complaint was that they would not warranty the replacement screen unless I bought a extended warranty.  I will now give them 3 stars and hope the new screen holds up.", "Date": "August 20, 2013"}, {"Title": "Smart buy!", "Author": "satcom4fun", "ReviewID": "R2DC8GAX15QLGG", "Overall": "5.0", "Content": "The SAMSUNG 6500 class smart TV is a smart buy.  The 40 inch set easily fit in the same wall space as my old 32\" set and is lighter weight.  It has 2D & 3D capability although the 3D glasses are annoying and require a battery.  The HD screen quality is excellent.  There are 3 HDMI and 3 USB connections in addition to PC, component video/audio input, and audio output for external speakers.  The built-in WiFi is very handy and provides lots of cool apps without having to connect an external PC.  The TV support DLNA technology called SharePlay which allows you to stream video/audio from samsung phones/tablets such as the Samsung Galaxy Note 10.1.  The remote control is a universal remote and you can add an app to an Android tablet to control the TV.  I highly recommend this TV.", "Date": "February 7, 2013"}, {"Title": "Very disappointed in Samsung (great customer service from Amazon)", "Author": "Peter H.", "ReviewID": "R2Y4LWNFR3JOMY", "Overall": "3.0", "Content": "I bought this TV in the beginning of 2013 having read of potential clouding/flashlighting issues when viewing dark scenes. I had no idea how bad and distracting the effect would be.For bright pictures and images, the TV looks fine (I won't say great or mesmerizing, but roughly on par in terms of picture quality with the 3-year-old Samsung LCD I had hoped this would replace). However, for scenes that are dark or have black, there is prominent flashlighting at the corners, and splotchiness/cloudiness in the center of the screen. I have read on AVS forums that this is a known shortcoming of edge-lit panels, but if you're paying anywhere close to $2000 for a TV, that's not acceptable.I replaced the TV once and the replacement TV displayed the defect even more prominently. It's too bad, because I had been a loyal Samsung TV customer for almost a decade, and had sung its praises to friends and family.I have returned the replacement unit and am going to try my luck with a Panasonic Plasma TV specifically, the Panasonic VIERA TC-P60GT50 60-Inch 1080p 600Hz Full HD 3D Plasma TV.If you are a purist when it comes to image quality, avoid this TV.", "Date": "February 7, 2013"}, {"Title": "Excellent TV for the money.", "Author": "Alex", "ReviewID": "R2OJTOU4UR22WR", "Overall": "5.0", "Content": "Out of the box it didn't wow and amaze me, but after I spent a couple days testing different calibration settings, I can glady say that this TV is capable of excellent picture quality. Video games look excellent, Blu-rays look very crisp and sharp, and the 3-D is pretty cool too. I did not test the wi-fi features on this TV, because I am not expecting it to stream netflix or other internet apps very well. It's a TV, not a computer. For those who are looking for a quality budget sized TV, this TV is an excellent choice.", "Date": "January 7, 2013"}, {"Title": "We love it", "Author": "Xiaofang Li", "ReviewID": "R1WOK2R7IVS9MD", "Overall": "5.0", "Content": "It is a beautiful TV set. We have been using the old fashion one for years. My husband joked we finally from Dinosaur age stepped into 21 century.  My son loves the 3D feature. We bought him two 3D DVDs as Christmas present.", "Date": "January 7, 2013"}, {"Title": "Excellant choice", "Author": "Richard Swayden", "ReviewID": "R4CWS8V93L6FK", "Overall": "5.0", "Content": "We have always bought Sony televisions, but couldn't find a 32 inch Sony that had everything we wanted. I found this Samsung and bought it. It has the best picture of any TV we have ever owned and has so many features we still have not learned them all. It was a very good investment.", "Date": "December 21, 2012"}, {"Title": "We love our Samsung!", "Author": "Martha W.", "ReviewID": "R1UPMP20088XOP", "Overall": "5.0", "Content": "We love watching our Samsung. It is in a very light room and still does ok. The colors are vivid, the sound is good--we are just generally well pleased.  Good value for the money.", "Date": "January 2, 2014"}, {"Title": "Love it", "Author": "Robert Zoller", "ReviewID": "RDNCEDDFXU96Z", "Overall": "5.0", "Content": "This is such a great TV. My wife got it as a gift and it has a great picture. I love the WiFi capabilities and since we are Amazon Prime members it works great for streaming movies and TV shows from Amazon. To get the best picture you need to go online and search on what settings to use since all TVs sold are  set up to look good in the show room.", "Date": "December 22, 2013"}, {"Title": "Excllent", "Author": "Enmanuel", "ReviewID": "R2LQHTRY4F8R79", "Overall": "5.0", "Content": "I like this TV, i've been used it sice agust 2012 and works like the first day, is one of the best TV I've ever had. I don't use regulary the 3D, but when I use it I really enjoy it. The TV menu is really easy to explore and anyone without TV knowledge can figure it out.", "Date": "December 13, 2013"}, {"Title": "Very Satisfied!!!", "Author": "Zachary Fleming", "ReviewID": "R2PS7YZKZALFDY", "Overall": "5.0", "Content": "Tv has great graphics! Very happy with the price. Pickup was a breeze with FedEx! I am a satisfied customer!", "Date": "December 1, 2013"}, {"Title": "Graet buy", "Author": "Enrique Ulivi", "ReviewID": "R2N4HHKVMJ7IAO", "Overall": "5.0", "Content": "This Samsung 65-inch slim led HD tv is very slim and the image is very nice. I recommend this tv", "Date": "November 27, 2013"}, {"Title": "Great TV", "Author": "Erich A. Mabray", "ReviewID": "R34F9EG2VMQT6Z", "Overall": "5.0", "Content": "Great TV for the price. Apps are very good and work well. Setup is easy, of course my wireless internet is in the next room. Picture is perfect and no dead pixels.I do recommend an external audio system since the speakers on the TV do not put out that much noise.", "Date": "November 19, 2013"}, {"Title": "Love the picture", "Author": "Blitz81", "ReviewID": "R27DPK8NSLV8S3", "Overall": "5.0", "Content": "Exceptional HD Picture! Sports are particular vivid & clear. I would definitely recommend the tv. Samsung makes a great product.", "Date": "October 16, 2013"}, {"Title": "Samsung TV--went bigger not better", "Author": "Bay Cookie", "ReviewID": "R10WIYYJSCTMGC", "Overall": "3.0", "Content": "We have a 46 inch Samsung TV and got a new entertainment center and wanted a larger TV so bought the equivalent (we thought) of the 46 inch unit.I don't know if it's not as good because it's a warehouse deal but it consistently gets darker and then goes back to normal.There's an issue with the sound quality--sometimes it sounds tinny.The 46 inch is a much better TV--the picture is clearer and we never have a problem with sound or picture.", "Date": "October 11, 2013"}, {"Title": "Samsung UN32ES6500 32\" 1080p 120Hz 3D LED HDTV", "Author": "K. J. Woody \"WashingtonDyke\"", "ReviewID": "R14E0DEW6KRNEQ", "Overall": "4.0", "Content": "I wanted as small an HDTV, as possible, that has as many feature usually only found on larger sets.  This fits the bill and is very well rated.  However, it was hard to find.  Settled on taking the risk of buying a return/refurbished/showroom model.Delivery was prompt, but I was worried that the screen might be damaged because a corner of the box was damaged.  No problem there, but the 3D glasses were missing from the previously opened box.Since the product was promoted as \"Like New\", I've removed a star.That said, the TV set up was straight forward and everything works as expected.  Lovely image.  If you can find this, it's a very good option for a small room.  I'm using this with a soundbar.", "Date": "August 29, 2013"}, {"Title": "What a great tv", "Author": "Mark Moyer", "ReviewID": "RMMJEC8QHUZGI", "Overall": "5.0", "Content": "This tv has one incredible picture, it was easy to hook-up and the menu was easy to use.  I love it.", "Date": "August 26, 2013"}, {"Title": "Nice!", "Author": "April Olson", "ReviewID": "RSV4XP04BYY5C", "Overall": "5.0", "Content": "It is a really great TV, I love it a lot. Especially being able to have Amazon prime on it.", "Date": "July 31, 2013"}, {"Title": "Research all the options and so pleased with the Samsung UN60ES6500", "Author": "Stephanie Santucci \"Stephanie\"", "ReviewID": "R105EEEOYTXIRK", "Overall": "5.0", "Content": "Picture quality is amazing; easy to watch any show in 3D.  I shopped around for a while and found the best deal on Amazon.com.", "Date": "July 29, 2013"}, {"Title": "Great TV", "Author": "Sedonasky", "ReviewID": "RJ35YLHMV21VL", "Overall": "5.0", "Content": "I searched for a TV with clarity of picture and this one is great. I tried a couple of 3D movies and I didn't see any difference.  Will try that again.  The picture is so clear not sure there is a difference.  The glasses were fine to watch the 3D movies, just didn't seem to make a difference.  I haven't used everything it does yet and still learning.", "Date": "July 29, 2013"}, {"Title": "The most awesome TV I've ever owned", "Author": "Joseph A Darden", "ReviewID": "R22ZKFQD425SWJ", "Overall": "5.0", "Content": "I was a little worried about ordering a tv online but my son had this same TV only an older model and we got a great deal on the price so we went ahead and ordered it.  We could not be happier with how soon we recieved it and how great the picture is.  It almost feels like the characters on TV are right in the room with you.  LOVE IT!", "Date": "July 19, 2013"}, {"Title": "Thin TV with great picture", "Author": "John Hurd", "ReviewID": "R2V2NX75O81OEV", "Overall": "4.0", "Content": "This TV is very thin and looks great mounted on the wall. The Smart TV features work great and it was easy to setup.  This picture needs to be adjusted to be brighter and more dynamic but you can do this through the menu settings.", "Date": "July 17, 2013"}, {"Title": "Better Than Most", "Author": "Ronald  Sugarman", "ReviewID": "R1AOALXDXGHNMK", "Overall": "4.0", "Content": "There are less expensive options, but this set provides a much superior sound quality than competing sets. It also accurately tracks on screen motion very well, particularly considering that it's only a 120.", "Date": "July 15, 2013"}, {"Title": "Nice LED TV", "Author": "Hoa", "ReviewID": "R1JC6DWXIVOB5U", "Overall": "4.0", "Content": "Upside:The image quality is very good.Sound is ok: I don't feel to connect additional speakers for regular use.Downside:Smart TV feature is not great. I connect it to an Apple TV instead.", "Date": "July 11, 2013"}, {"Title": "picture is amazing", "Author": "F.J.", "ReviewID": "R9QE7UYR42O81", "Overall": "5.0", "Content": "I fall in love everytime I turn it on. The picture is crystal clear. Only one complaint the sound quality is horrible.I now need to purchase a sound bar.", "Date": "July 4, 2013"}, {"Title": "Its OK for a decent price.", "Author": "Shivam", "ReviewID": "R30M2GZ53YKYER", "Overall": "4.0", "Content": "I bought this for a pretty cheap price. (Around $1300 because I got lucky when I purchased it). Since I have a lot of HD channels, those have pretty great quality. But, for Indian channels that aren't HD, the quality is horrible! The sound isn't bad but its actually pretty good. The quality is pretty amazing although for HD channels. Its very easy to connect to wifi on this and the smart features are easy to understand. You can download apps and Youtube is pretty good too. The TV looks great! The 60 inch looks much better if you put it on the wall. Its very super thin and looks great. The 3D on this TV is actually pretty good, espically for action movies.", "Date": "July 1, 2013"}, {"Title": "I love it", "Author": "laoye", "ReviewID": "R1DGX193HDO8F", "Overall": "5.0", "Content": "it's very smart in deed. I didn't get thru all features yet. The picture and color are so nice. I love it.", "Date": "June 28, 2013"}, {"Title": "Awesome picture", "Author": "Sarah McCluskey", "ReviewID": "R1VYKEE2F7JLOG", "Overall": "4.0", "Content": "The picture quality is wonderful. I love the picture. the size is perfect. As of yet i have not used the 3d option nor the smart tv, so i cannot comment. I can't figure out why it has a 120Hz refresh rate but on the screen it only states that it is 60. For those reasons I give it a four but may increase the rating as I get to know my tv.", "Date": "June 28, 2013"}, {"Title": "Great tv!", "Author": "A. Silverman \"ArielNJ\"", "ReviewID": "R33JK53WAWW8AP", "Overall": "5.0", "Content": "I own 3 Samsung smart tv's and love them. Make sure the picture mode is \"normal.\" It makes a huge difference. I also think that Samsung's customer service is very good.", "Date": "June 19, 2013"}, {"Title": "Best picture on the market.", "Author": "Peggy and Ken Sharpe", "ReviewID": "R2X1I9BC3ZHY52", "Overall": "5.0", "Content": "We visited several stores to see many TVs side by side.  The Samsung has the best picture quality of them all.", "Date": "June 17, 2013"}, {"Title": "Samsung UN55ES6500 55\" LED TV", "Author": "Don", "ReviewID": "R2Y1NICUBCC6P", "Overall": "5.0", "Content": "This TV is perfect 2D and 3D very clear, wireless set up only a minute so far so good no problem at all what else should I write more? I give this TV review 5 stars.and recommend to any one looking for new TV. I love it.", "Date": "June 12, 2013"}, {"Title": "Confused", "Author": "Jason Dan", "ReviewID": "R27WID59ASHSDO", "Overall": "2.0", "Content": "Brought this TV 5 months ago worked very good for that time up until now in which it just stop work and now my technician saying the power supply is gone", "Date": "June 10, 2013"}, {"Title": "Great!", "Author": "Stacey Childers", "ReviewID": "R22LNRQPSALT2G", "Overall": "5.0", "Content": "This was the best graduation present I could have received! The tv is crystal clear and looks like the actors are right in front of you!I do want to add that shipping from this company was a hassle. They use a shipping service that calls you and you have to set up appointment for delivery. That was a pain and they were late to deliver!", "Date": "May 23, 2013"}, {"Title": "Great Picture & 3D", "Author": "Ricky L Stewart", "ReviewID": "RKN3VRIE2W9M3", "Overall": "4.0", "Content": "I am happy with the TV overall. The picture and 3D are excellent. The weakness is the same as has been mentioned on a large number of reviews here, namely that the Smart TV performance is inconsistent. It cannot consistently maintain connection to my wireless network, whereas my Roku box performs flawlessly over the same wireless connection. When the Smart TV is working I enjoy watching the 3D content that is available there, which is mostly documentaries that have very good 3D quality.", "Date": "May 20, 2013"}, {"Title": "I love this TV!", "Author": "Mark", "ReviewID": "R39GIN2BX6B6LQ", "Overall": "5.0", "Content": "skinny, lightweight and an awesome pic! can't say anything about the smart feature, I only use it as an hd/3d tv.", "Date": "May 20, 2013"}, {"Title": "60\"", "Author": "Smakdaddy", "ReviewID": "R7C63V9L4J3GO", "Overall": "4.0", "Content": "Great tv. I like the speakers. In my Sony, which was replaced by this one, i would have to use my AVR to boost the sound. The Samsung speakers are really nice. I can hear easily and still have room to increase the volume. My chair is close to 10' away from source.", "Date": "May 16, 2013"}, {"Title": "Great TV", "Author": "Michael C. Lamb", "ReviewID": "R3QJUOEZRM9MVJ", "Overall": "5.0", "Content": "Very happy with this TV. Received as described and picture is great. 3D is very cool and the apps are great.", "Date": "May 14, 2013"}, {"Title": "more then I  expected", "Author": "josephcannon07", "ReviewID": "RDGXANM3D9419", "Overall": "5.0", "Content": "The samsung tv I got is amazing the picture is sharp as a knife and it looks just as sharp. With all the apps you can get it won't let you down. Best thing about it is when my girlfriend falls a sleep with the remote on her side I can use my phone or galaxy tab to tern down the volume or shut off the tv so it won't  keep waking me when I need to sleep.", "Date": "May 13, 2013"}, {"Title": "You can't beat the quality of this TV.", "Author": "Amazon Customer", "ReviewID": "R1B8399K2LYELY", "Overall": "5.0", "Content": "Great picture, but I highly recommend going online and finding out what the best picture settings are. You won’t be disappointed.", "Date": "May 10, 2013"}, {"Title": "Beautiful", "Author": "Amazon Customer", "ReviewID": "R16J4YC75MCNWP", "Overall": "5.0", "Content": "Slim, good picture.  Easy to setup.  Love the wi-fi.  Downside is the fact a black screen has uneven areas where its lighter.", "Date": "May 9, 2013"}, {"Title": "Great TV", "Author": "J. Cotton", "ReviewID": "R2F1MJ1KCDLYDJ", "Overall": "5.0", "Content": "WOW! What an incredible picture.  My only regrete is I didn't buy the 80\"The 3D is better than I thought it was going to be and even watching regular TV, the picture is so crisp and clear that it almost looks 3D.Because I have a satellite Hugesnet, my internet speed is not very good, which is there Gen4 so I haven't been able to enjoy all of the Smart TV features with getting online but for what it is worth, the setup was easy and even though it is slow it is great to have.", "Date": "May 9, 2013"}, {"Title": "Sweet", "Author": "Lorna", "ReviewID": "RA2VVQOLPESZV", "Overall": "5.0", "Content": "We love our big, light weight, thin, sleek, clear, smart tv. It was easy to get set up and use?", "Date": "May 3, 2013"}, {"Title": "fits perfectly, great resolution and easy to install", "Author": "Ashika Jain", "ReviewID": "R2YDDCMU5XNL0O", "Overall": "4.0", "Content": "easy to install, great resolution and the 3D is awesome!I only gave it 4 instead of 5 stars because I cannot connect my stereo to it and because there are tv control on the tv....that i have found yet.", "Date": "April 21, 2013"}, {"Title": "everything is great, except the remote", "Author": "Ryan Pulis", "ReviewID": "R12FZF7J6ENXDP", "Overall": "5.0", "Content": "The TV itself is excellent.  But, the button placement on the remote is not so hot.  Commonly used buttons (play, pause, forward, reverse) that we use all the time to control DVR-ed content are awkwardly at the very bottom of the remote making it difficult to use with one hand.  Other than that, no complaints.", "Date": "April 19, 2013"}, {"Title": "Great TV", "Author": "Coug1", "ReviewID": "R249AREAE13AYD", "Overall": "5.0", "Content": "This is the third Samsung I have bought.  They are high quality, the pictures and sound are great.  They are definitely worth the extra money.", "Date": "April 17, 2013"}, {"Title": "excellent TV", "Author": "Greg Malanowski", "ReviewID": "R11PDOKKJ9S4T9", "Overall": "5.0", "Content": "I replaced my old rear-projection Mitsubishi 65\" TV when it got a \"brain disease\" after 10 years of excellent service. The fidelity of colors displayed by that top-level rear-projection TV was uncommon. I am a perfectionist and did not believe that one can find an LCD/LED TV displaying pictures of such a quality colors. After several trips to consumer-electronics stores to compare pictures on various TVs, we decided to purchase the Samsung UN65ES6500.After  cumbersome adjustments of color settings in the newly purchased Samsung TV (be aware that there are separate color settings for the TV and for the DVD inputs!) the displayed colors are very good. The picture is stunning. The sound from its two 10-watt speakers is better than I've expected from tiny speakers installed in a slim housing. The 3-D picture is good.Disadvantages:1) The user manual is a joke.2) Multiple color adjustments are very complex. There are 10 separate adjustments for B/W setting! Without a decent user manual it takes much time to set it up correctly. My wife gave up after 20 minutes.3) There are no standard RCA-type audio jacks for an external audio amplifier, if you want to use external speakers.Summary: I recommend it as a very good HDTV, better than most of other products.", "Date": "April 13, 2013"}, {"Title": "so far so good", "Author": "Robert Sasanoff", "ReviewID": "R30TOALACMS01P", "Overall": "4.0", "Content": "the picture is quite good.  but the set-up instructions are nowhere's as clear as is instructions that i get from my Mac equipment.little is friendly rather, info and buttons do not indicate a reasonable, logical procedure.the TV came ahead of time and was well packed.", "Date": "April 6, 2013"}, {"Title": "Great smaret TV which doubles as computer screen", "Author": "steven  riser", "ReviewID": "R2UV4YNF5XPCG6", "Overall": "4.0", "Content": "The product is great and I high recommend it!Unfortunately it arrived with a missing part which I had to purchase at an additional expense.Sincerely, Dr. Steven C. Riser", "Date": "April 5, 2013"}, {"Title": "HDTV Complete", "Author": "Tom F", "ReviewID": "R2RJA0UEWPL8R7", "Overall": "5.0", "Content": "This hdtv is everything I read about and more.  I was not interested in a 3D tv but it produces fantastic 2D realistic quality.  Don't forget HD signals are not there best yet.  Give it a year or two before signal and interpretation meet. My only dissatisfaction is with the stable picture angel.  It appears to be about 30 degrees from center.  About 15 degrees in either direction before the picture begins to whiten. Sitting straight across from the set is recommended.  I would recommend this tv to anyone especially since the price has come down considerably since its release in 2012.  It is more economical than any plasma set, much lighter in weight, and produce little heat.  Good work Samsung.", "Date": "April 4, 2013"}, {"Title": "Great TV", "Author": "Moe", "ReviewID": "R1EHF2CSSJQ5QV", "Overall": "4.0", "Content": "Just got one yesterday and spent the day to set it up. It looks very nice. It is 65\"ES6500My complaints so far are banding in all white~mid contrast field. Black uniformity is poor but with proper backlit/brightness setting looks a lot better.Great color, contrast and sharpness but colors appear cartoonish at times. Again proper color level is essential to get it look natural.If you are a movie person and watch in total dark I suggest a high quality plasma otherwise the black uniformity will spoil the experience as all LED's do. Local low level black level control (CE) kicks in during very low level black. To battle that use Movie mode or set your brightness level a notch higher than the calibrated value. Excellent remote but average speakers. The TV is very bright make it an excellent choice to watch sports in day time in bright room which plasma cannot do in million years.", "Date": "April 3, 2013"}, {"Title": "lo mejor", "Author": "eudi Ramón González", "ReviewID": "R1QHJH9VWMQWUX", "Overall": "5.0", "Content": "es delgado con una calidad de imagen excelente muchos puerto de usb con entradas hdmi  es lo mejor que e comprado en televisor hasta el momento", "Date": "March 29, 2013"}, {"Title": "Another Samsung TV and not disappointed", "Author": "OKings", "ReviewID": "R2FZWYBQUB8BB2", "Overall": "5.0", "Content": "Honestly, I was hesitant based on all the other reviews. This is our second Samsung TV and my word! It has lived up to the expectation! Picture is awesome! I am not sure what the other people are talking abut sound, it will by no means blow you away but it is just as good as any other TV. I had a sound bar already before, so I really didn't care about it, but honestly it's pretty decent.I honestly recommend this TV, very nice and the price is not bad at all!!", "Date": "March 25, 2013"}, {"Title": "It's great...", "Author": "M. Brisson", "ReviewID": "R2TJAFW3IC92Z8", "Overall": "5.0", "Content": "I replaced a 10 year old 42\" plasma with this new 55\" television so it was a noticeable upgrade to say the least.  The picture is ridiculous and the colors are crisp.  It's exactly what I was hoping for.  At this point all the apps work as advertised.  Setup takes very little time....I'm not particularly technical, but I was able to connect to my wifi network, my hdtv cable box, my 10 year old Denon receiver, and my brand new Sony Blu-Ray player with minimal struggle.  Blown away and so pleased.", "Date": "March 25, 2013"}, {"Title": "Great TV!", "Author": "Scott", "ReviewID": "RH3LR0LN23V76", "Overall": "5.0", "Content": "This TV has everything I wanted on it, and has performed as expected.I am using this TV in conjunction with a PC-based media server, connected via Ethernet, to view my collection of movies.  Everything works as planned.The 3D features of this unit are great, also.  I found that the 3D was \"believable,\" and not overly artificial.  The glasses are light enough to not be too \"in the way\" on your face as you watch your show.", "Date": "March 25, 2013"}, {"Title": "very good excellent product", "Author": "leonard", "ReviewID": "R1IN8CZ6F43XQO", "Overall": "5.0", "Content": "excellent product great the 3d is the maximum recommend excellent image has good sound is very easy to handle d", "Date": "March 25, 2013"}, {"Title": "Outstanding!", "Author": "Thomas Flanagan", "ReviewID": "R3CFBYN30G6LLK", "Overall": "5.0", "Content": "It is exactly what I ordered; that is the quality and the audio for a small TV.  Others are out there but they lack the strong points.", "Date": "March 21, 2013"}, {"Title": "Great TV So Far!", "Author": "Christopher", "ReviewID": "R2U1U04UPPJYBQ", "Overall": "4.0", "Content": "I received this TV two week ago. I was supposed to received it on a Friday but I didn't get it until Tuesday.  The biggest thing I was worried about was light bleed.  This TV has a little bit of it but not enough to send it back.  The whole screen has to be black before you really notice it. I have not calibrated it yet because I want to get 50 hours on it before I do.  But, I do notice the soap opera effect.  I did not purchase the TV for the SMART features, I have a ROKU for that.  It does have a great picture and all pixels are firing. The speakers are good if you have a quite room, but if the dishwasher is going or kids are screaming, you will definitely need a sound-bar.  This was my first HD LED TV.  I did get a 5 year warranty in-case the light bleed get worse or the mother board goes out. The 2d to 3d conversion is pretty cool also, my kids love it. Looking forward to getting a 3d blu-ray player.  I did not take off stars for the smart features because as I said, I have a ROKU. I rated it 4 stars because of the light bleed as each of the four corners, if it didn't have that, I would have gave it five stars.  Like I said, this is my first HD LED TV, so I do not have anything to compare it too.", "Date": "March 18, 2013"}, {"Title": "Excellent TV Except...", "Author": "Ss1494", "ReviewID": "R3JBC01ZCZ1FON", "Overall": "4.0", "Content": "It won't take the HBO app for some reason and you can't seem to use close caption on Netflix even though I have it on my regular TV.  Excellent picture and decent sound and a very usable remote.", "Date": "March 16, 2013"}, {"Title": "Awesome TV", "Author": "Carlos", "ReviewID": "R39H6IDW9H7J4N", "Overall": "4.0", "Content": "Easy installation, HD Looks Flawless, Internet functions are not great, but if you are not looking for internet based TV its awesome. Please consider that I purchased this TV with a considerable discount.", "Date": "March 13, 2013"}, {"Title": "Great TV - Small Bevel - Wish I Bought Bigger.", "Author": "D. Salotti \"DS\"", "ReviewID": "R1KMF3IP7OZRUA", "Overall": "4.0", "Content": "I purchased this to replace a 46\" Samsung I got off of Amazon a few years prior.PROS:1) Extremely thin bevel (outside non-screen frame area)  Bevel - I should have done my research more carefully; I completely missed how thin the bevel was and missed an opportunity to fit a 55\" in the space -- measure carefully!2) Built in Wi-Fi and comes preloaded with Hulu, Amazon and Netflix.  Awesome if you don't have an ethernet port nearby or don't want another wire to wrap and bundle.3) Picture - very clear, no dropped pixels. Blacks look real good.  Everything you would expect from Samsung.4) 3D w/2 pairs glasses - we're not heavy into 3D, but for the rare occasion, its nice to have the feature and the glasses on-hand.CONS:1) Pre-loaded apps -- all the fitness and kiddie stuff is junk.  Its bloatware in my mind that should be an optional download.2)  WiFi often doesn't connect automatically; need to go to network settings and tell it to connect.  Odd because it would auto-connect initially and at some point stopped working that way.  If by chance a setting got changed, I can't locate it and it would seem too easy to inadvertently change to be a good feature.3) Stand - its not a major con - I just feel that the stand is not as substantially made as my prior Samsung.  Perhaps to keep the price point down or increase margins they are pulling back on the quality here.  I like the design, I just wish it had a bit better material and weight -- it doesn't feel perfectly suited to hold a TV on an open media table.Overall, I really like the TV, and would definitely purchase again for a wall-mounted TV due to its super-thin profile.", "Date": "March 10, 2013"}, {"Title": "Great TV", "Author": "Kvo Clai", "ReviewID": "RDCTVAX7H1ICO", "Overall": "5.0", "Content": "I looked at several different Televisions. I ultimately decided on this one because it had everything I needed.LED, 3D, Slim, at least 120 Hz, wifi, Netflix, Hulu, hbo go, amazon video.The next model down was missing 3D, the next model up has a webcam that I really can't imagine using. I compared Sony, Panosonic, and LG and in looking at the actual pictures I decided that Samsung had the picture I was looking for.Couldn't be happier.", "Date": "March 9, 2013"}, {"Title": "Great Television", "Author": "Bigbman65", "ReviewID": "R22XNEHQ0NOB6L", "Overall": "5.0", "Content": "I love my new television. I had a Sony Bravia 46 inch which is the bedroom television now. Games look so much better on this. I will try blu rays over the weekend.", "Date": "March 5, 2013"}, {"Title": "Could be better", "Author": "M. Frey", "ReviewID": "R2VDW6A80EVDX5", "Overall": "3.0", "Content": "Picture is marginal and washes out when viewed at an angle. Speakers are useless and required a speaker system additive at extra cost. Older LCDs had better speaker systems.  I am amazed that the LED manufactures have not figured out how to enhance speakers. Had to maniputate settings on TV to get a picture that was acceptable.  My 7 year old LCD has a better picture than this TV. WI-FI is not user friendly. Unless you view alot of 3-D, is also marginal. Not what I expected from Samsung, who is supposedly the best in the LED TV world.", "Date": "March 4, 2013"}, {"Title": "Samsung TV purchase", "Author": "jr ford", "ReviewID": "R3T03HEUZXX87V", "Overall": "5.0", "Content": "Even a non techie such as me finds it easy to operate! All around quality was recommended by Consumer Report . Very happy with my purchase from Amazon...Bob", "Date": "March 3, 2013"}, {"Title": "Very good TV", "Author": "L.B.", "ReviewID": "REK9RGFV0XEMW", "Overall": "5.0", "Content": "Was just what I was looking for.  Was easy to set up and have had no problems at all.  The price seems a little high, however I don't mind paying a little more for good quality. Thanks.", "Date": "March 3, 2013"}, {"Title": "Incredible tv", "Author": "T. Swanson", "ReviewID": "R2GC78A3N7RI24", "Overall": "5.0", "Content": "The picture is amazing. Easy setup. I combined it with 3d home theater system and it awesome. I recommend it.", "Date": "March 2, 2013"}, {"Title": "Blows Me Away", "Author": "ILoveTheUSA", "ReviewID": "R22SSNZSCNDLIO", "Overall": "5.0", "Content": "I originally bought the 6100 series of this tv and ended up having the dreaded \"halo\" effect or \"back light bleeding\" which was very distracting.  I returned it and instead of getting a replacement I upgraded to this model.  So far, after a couple of days, the back light bleed is not there and the picture looks incredible.  I don't know if it is the particular model, or all these tvs, but the issue with the lights is a common one and isn't something that you should settle for, especially after dropping almost 800 bucks on it.  That being said, the tv is and excellent one at that and I couldn't be happier with the picture or the online smart features.  I've had no issues with streaming online content wireless and after the tv was all updated everything plays great.  There are many apps to choose from so there is no need for a BD player with a smart feature or anything else for that matter.  Amazon instant video and cloud player are on the list and so is Netflix along with all the other common apps we've come to know.  The only thing I haven't tried is the 3D feature but other reviews have stated this was also very good, can't wait to try it.", "Date": "March 1, 2013"}, {"Title": "Beautiful TV", "Author": "Todd", "ReviewID": "RR2X2C4NIKU0K", "Overall": "5.0", "Content": "This is a really nice TV. In our application people have to sit quite close to them so the 1080p makes a difference. The ultra slim profile is also really nice in our application. These two reasons are why we didn't get the Vizio equivalent which as of today does not have those features. I see Vizio as a better value and is at least an American owned company. These are really nice TVs built in wireless is simple to setup and update. Make sure you look at how you plan to mount this TV as well. Two of the HDMI inputs point strait to the back. If you wanted a really flat mount with more than one HDMI input that could be an issue. You would need the flat type HDMI with a 90 degree end.", "Date": "February 26, 2013"}, {"Title": "Right size and right amount of gadgets", "Author": "Santiago Ortega", "ReviewID": "RVKOFNG0YJQK8", "Overall": "5.0", "Content": "I have another Samsung, that I bought a few years ago, and I was very happy with that one, so I went ahead and bought another one for the living room. The size is just want we needed, and connected to the internet right away, netflixs works fine through the WIFI, I am very happy with it.", "Date": "February 23, 2013"}, {"Title": "VERY GOOD TV", "Author": "Monfri", "ReviewID": "R2UIFKFY4CEIGK", "Overall": "5.0", "Content": "Samsung TV the best.Have excellent definition and a very good sound.I recommend this TV to watch movies and to play.", "Date": "February 23, 2013"}, {"Title": "Works great in many ways, but has a few flaws", "Author": "John", "ReviewID": "R191EFN9UAC91O", "Overall": "4.0", "Content": "This is my first HDTV so to me it looks amazing compared to my previous tube NTSC TV.Good points:The ATSC off the air (OTA) tuner works very well with my home-built Hoverman TV antenna.  I'm able to pull in stations 40-60 miles away with an antenna only about 7 feet above ground.  Granted, the Hoverman TV antenna design works well and, yes, I have a preamp at the antenna.  That said, I have to give the Samsung ATSC receiver some credit for pulling in the free TV signals.  HD over the air is very nice.  The Superbowl looked spectacular using the antenna.  Search for \"Superbowl TV Antenna.\"Panasonic Blu-Ray player via HDMI to this TV is quite spectacular.  Ben Hur is awesome!Movie Apps work pretty well... I use the built-in Vudu, Netflix and Amazon.  WiFi connection is flawless.  Occasionally there is network lag, but never enough to be an issue.  When watching Christmas Vacation on Vudu I had to knock the quality down from 1080 to 720 to compete with the other network users on my WiFi (Kudos to the Vudu app for providing the option to change the resolution on the fly).  Most other times, HD movies play through with no issue.  The wife is very very happy with this ;)I use a VGA to HDMI converter (found on Amazon similar to this VGA2HDMI 3.5mm VGA to HDMI Converter) to display PC video graphics to use for Power Point presentations.  Nice.The thin TV snugs up well to the wall resulting in a nice, sleek, unobtrusive look.Questionable points:The stairstepping automatic backlight intensity control is a bit obvious and weird.The YouTube app has tremendous difficulty rendering YouTube videos with complex content and/or music (synth sounds, etc.).  After some checking, the buffering appears to be working well in the TV if I can believe the moving bar in the YouTube app.  This clearly leaves only the combination of this Samsung YouTube app and the TV's processing power to blame.  Many other Samsung TV owners report this same behavior as well.3D?I have not tried the 3D... yet.  No report.Conclusion:This is a good HDTV with \"Smart\" features that work well... except for the YouTube app.", "Date": "February 20, 2013"}, {"Title": "Composite video input", "Author": "Steve", "ReviewID": "R2LRWWC8C7UMYS", "Overall": "3.0", "Content": "Apparently this model has no input for composite video. This rules it out for anyone who requires closed captions, which are often garbled in digital transmission but render perfectly in analog.", "Date": "February 19, 2013"}, {"Title": "Love the smart TV", "Author": "harrytx", "ReviewID": "R2T93RNPH03ALF", "Overall": "5.0", "Content": "Easy to use netflix through my wireless router.Picture needs some tweaking to get it where it needs to be.", "Date": "February 19, 2013"}, {"Title": "Almost Perfect", "Author": "Jenni", "ReviewID": "R3CIN64MN5OF4Z", "Overall": "4.0", "Content": "The only thing I don't like about this TV is the frame. My other three Samsung have an edge that almost looks like glass and this one is in a black frame. The other look is just more impressive, but I do love the Samsung brand!", "Date": "February 17, 2013"}, {"Title": "Samsung has done it again.", "Author": "Axilea Vlachos", "ReviewID": "R9WY521OLJ7J0", "Overall": "5.0", "Content": "Even though this is the 6500 series.. the picture quality on this 32\" surpassess any of its contenders hands down. the 120 refresh rate really makes a difference on a tv.", "Date": "February 13, 2013"}, {"Title": "Excellent TV", "Author": "Nasi S. Sadat \"Wolverine\"", "ReviewID": "R2V7UIGGNB10KI", "Overall": "5.0", "Content": "Recently bought this 65-Inch ES 6500 Model, It has all the features in it and I guess I have to through away to my Roku 2 XD and Jadoo  TV box . It is very thin, wide Screen, Picture quality and Sound are amazing and love it.", "Date": "February 12, 2013"}, {"Title": "Excellent picture quality - poor apps", "Author": "Vlad", "ReviewID": "R2WRRZL22WVAUJ", "Overall": "4.0", "Content": "Picture quality and sound are amazing and my dig photos and videos look better than ever.  I'm giving it 4 stars because of smart TV apps. Facebook is completely screwed up: it shows only couple of two month old postings. YouTube works but wouldn't give me full access to my account when I'm logged in. Tried to down load updates, didn't help. looks like Netflix is the only one that works properly.  Hope they will eventually fix apps....", "Date": "February 6, 2013"}, {"Title": "Great buy", "Author": "V. Bhalchandra \"vbhalu\"", "ReviewID": "R1Q3L4D7Z1AA1J", "Overall": "4.0", "Content": "Have now been using this for over 4 weeks, connected this to the Onkyo Tx-NR609 receiver with 6 Polk Audio in ceiling speakers and a Yamaha sub-woofer. All for my basement pad - and it works like a dream.Delivery was prompt and it was very well packed. Due to the cold, they did not unpack the TV and check so I was a bit apprehensive when I plugged it on, but it worked just fine.We have used the 3D a few times and it looks great especially when watching animation films like Finding Nemo. I did all the setup with the receiver and fixing of the wall mount, and it was simple and easy. For the size of the TV it is very light and easy to fix on a wall mount, my 13 year old daughter helped me mount it. Colors are very bright and contrast is great.The TV sound is however poor and without a home theater it would be a waste to just use that sound.Overall happy with the buy.", "Date": "January 28, 2013"}, {"Title": "Great TV for the Price.", "Author": "Tom Dickerson \"Dizz\"", "ReviewID": "RGXPUYHZFC5AA", "Overall": "5.0", "Content": "I purchased this TV after looking at Plasma and LED both. I decided to go with the LED even though I primarily play games. I was turned off by the image retention and burn in issues that still do exist (don't let people fool you). The TV needed to be calibrated but once I got the right settings movies and tv shows look great. Gaming there is a noticeable amount of input lag but it's not a deal breaker. TV came when it was supposed to in excellent condition. Best thing is that it dropped $200 in price within 14 days and Amazon credited the amount to my card! I'd def recommend this TV for people new to LED/3D TV. The 2D to 3D conversion works pretty well actually but I have seen TV's do the 3D better. ALl in all, I am happy with my purchase.", "Date": "January 25, 2013"}, {"Title": "Phenomenal TV", "Author": "Nick B. \"Nick B.\"", "ReviewID": "R2C0O2RP822G1K", "Overall": "5.0", "Content": "This TV is incredible.  I first purchased it in the 55\" and was so pleased with it that I then purchased the 40\" and the 32\".  They are expensive TVs, but they are well worth the money.", "Date": "January 20, 2013"}, {"Title": "TV works fine.  No complaints", "Author": "Hal Steele", "ReviewID": "R11AYXPVAQ9YOA", "Overall": "4.0", "Content": "Chose it partially based on Consumer Reports ratings.  Haven't yet tried the 3D feature, but didn't purchase it for that.", "Date": "December 29, 2012"}, {"Title": "good tv", "Author": "Richrall", "ReviewID": "R3SDFASB9XWC54", "Overall": "4.0", "Content": "Easy setup for Wi-Fi. One dislike is that it will briefly display the Smart screen when it is updated while changing cable channels. The set has a uniform brightness (For 2D).", "Date": "December 28, 2012"}, {"Title": "Great TV", "Author": "B. Spears", "ReviewID": "R2B2JSB32TH5OS", "Overall": "4.0", "Content": "It has great features and the picture quality is great. Just beware that you have to update it all the time like a computer.", "Date": "December 26, 2012"}, {"Title": "great performance", "Author": "J. Narvell \"NumberCruncher\"", "ReviewID": "R1AX3MBK6WZEDD", "Overall": "4.0", "Content": "There are so many choices - just within the range from one manufacturer.  I have had smaller Samsungs and liked them and the recent reviews are good.  My preference is to go 2/3 rds the way up the range.  At the top the prices are too high just to get the latest feature and the bottom has too many compromises. In general I am very happy with the video.  The reason for not five stars is the audio.  It used to be that big TVs had spectacular audio because of the big box.  Now the screen is bezel to bezel and minutely thin.  As a result the speakers are rear facing. This is a horrible trend.  I will invest in a sound bar to get back the audio that I expect.", "Date": "December 11, 2012"}, {"Title": "Deceptive Specification for 65ES6550F", "Author": "buscomkg \"buscomkg\"", "ReviewID": "R3L4TKYL79CX5K", "Overall": "1.0", "Content": "I ordered a 65ES6550F from Costco but on further reading of the TV specifics at the Samsung web ([...]) realized that the the TV does not have wifi built-in as advertised all over the place.  To reconfirm my doubts, I chatted with a Samsung rep and sent a separate email and reconfirmed that the TV is wifi-ready not wifi built-in.  I do not understand why Samsung is continuing to advertise that the TV has built-in wifi.  On that ground, I cancelled my order.  Samsung should correct its misleading advertisements and that is the reason I am giving one star.", "Date": "December 14, 2012"}, {"Title": "So far so good....", "Author": "B. Shah \"bhappi\"", "ReviewID": "R2FZD9LEQ85GXP", "Overall": "4.0", "Content": "Just bought this TV and it arrived last week. This one replaced the 2011 year model UN40D6400 which I bought as open item. Its been 3 days and I am loving this so far. Picture quality is great and size is perfect. Its 40inches but is almost same as buying a regular 37in with sides. Wi-Fi works great and setup was a breeze. I think its a great buy and if something breaks then I will be back here to update the review.", "Date": "March 18, 2012"}, {"Title": "excellent tv", "Author": "H. Huang", "ReviewID": "RECAWQ0VOA2S7", "Overall": "5.0", "Content": "my family enjoy this tv a lot. i am not too picky on the picture quality like some experts who can detect the difference in dark black. i am however picky on usage. i am pleasantly surprised on how useful the smart tv is. i do not subscribe to hulu or netflix so i view internet video mainly through the browser. the connection speed is resaonable i do not like to use the control's direction arrow to move the mouse during the smart tv mode. it is slow and unresponsive. i hate to use the control to select letters one at time to enter web address or user name or password. newer samsung tv come with keyboard with mouse pad or better remote control with mouse pad. my solution is not to buy a wireless keyboard or mouse but i use galaxy tab 2 7 inch with IR. highly recommended.smart tv is more useful than i thought. i used to have to turn on the laptop i connect to the tv to browse or watch ip tv. smart tv, though the connection speed and processing speed are not as good as independent laptop, which i can continuously upgrade, are acceptable and its instant on feature is convenient.", "Date": "October 20, 2012"}, {"Title": "excellent buy", "Author": "Mohammed Sabir", "ReviewID": "RG8JHJK64OXKK", "Overall": "5.0", "Content": "Just loving the Samsung ES6500, So far all the Smart TV Apps working like charm. Value for money i guess great value for the $ spent.Easy sync Options to music,photo,videos", "Date": "June 8, 2012"}, {"Title": "Great Picture..but had to return it", "Author": "gjpwiz", "ReviewID": "R1QRPXWXOVW9K7", "Overall": "4.0", "Content": "This was my first samsung tv. I got it around 3 weeks back but had to return it due to a thin horizontal band that was always showing about an inch from the bottom of the picture. That aside I was quite impressed with the tv. Picture quality and 3D viewing were excellent.Pros:- Amazing picture quality.  Great black levels.- Looks great! Very lightweight too.- easy to navigate user menus.- nice selection of apps. netflix, pandora, etc..- From watching the preloaded 3D videos, 3d seemed to be quite good.Cons:- That horizontal band!- When playing netflix HD movies or other HD content, i felt the picture frames were not flowing smooth.  Maybe i needed to adjust some settings but this was my initial impression.", "Date": "April 12, 2012"}, {"Title": "2 years of frustration", "Author": "K. Gilligan", "ReviewID": "R3L9E8UAT9G02C", "Overall": "1.0", "Content": "Bottom Line: Save your money and get a second screen for your laptop, and it will make a better tv than this one.My sister and I bought this TV a couple of years ago because it was supposed to be Netflix ready and got good reviews. So I am surprised at how much we have come to hate it. We would have returned it, but it isn't broken. It's only the software design and implementation that is broken.  If I had it to do over again, for the price we paid for the TV, I could buy a top of the line custom gaming desktop with an extra big screen. Even an old xp laptop with a second monitor would be superior in usability.Here are the highlights of one of the worst \"customer usability experiences\" I have ever had.Customer Support: Did you know Netflix has a secret campaign to undermine Samsung?You can call Samsung customer support when things go wrong, but they blame everything on: 1. the customer, 2. Netflix. I have gotten way more support for this TV from Netflix tech support than from Samsung, even when the problem had nothing to do with Netflix.Performance:Slow, Slow, Slow: It takes about two minutes for the tv to come out of standby. There is an even longer wait if the tv was turned off, and there is no feedback, like a visible light or clicking sound, to let you know if the TV got the signal from the remote. I finally found out that there is a light on the bottom corner of the screen that flashes 5 times before the tv will come on, but you can barely see it. So it is difficult to tell if the tv is on or off. You can spend a frustrating several minutes inadvertently turning it off and on again. A better strategy is to push the button once and then walk away and do something else for a while. By the time you have made a pot of coffee or popped some popcorn, the old boot may have come to life.If you have an extremely slow Internet connection - under 5 mbps, the tv barely works at all. Switching between apps, or switching programs on Netflix takes 12-15 clicks on the remote, and sometimes the app shuts down saying there is no signal, or says the program is no longer available. The first time this happened I thought Netflix pulled the show, but when I checked on my laptop, there it was.  We finally got our Internet upgraded to 3 mbps, all that is available where we live, and the tv performance is marginally better, but you still have to click several times to get a show to start, and if you pause the playback, it sometimes refuses to start again.Who needs usability when you have Bugs & Clutter?Navigating this TV's interface is like trying to drive a car using a handful of mashed potatoes for a steering wheel. All parts of the interface require a qwerty keyboard to be usable, but I have yet to find one that is compatible.Samsung actually sells a supposedly tv ready keyboard, for 200 bucks if you can believe that, but the reviews I read about it indicated that it was not all that tv ready. I see no reason why this tv shouldn't be compatible with my 20 dollar logitech wireless keyboard and mouse combo, which works with just about every other device I own. After all, this tv came with 3 usb slots. Something should work with it.The online popup keyboard is nearly useless. It takes forever to type in your account information, and if you make one mistake, it defaults to the previous screen and deletes all your input. Of course you need a different account for EVERYTHING. There is no master password to log in to all your apps. To make this doubly frustrating, frequent automatic updates delete all your user information that you have so laboriously typed in with their useless onscreen keyboard.Updates that break things:Samsung sends frequent automatic updates, which you can't disable. The only purpose these updates seem to have is to delete your settings and your logon information for all of your apps, and sometimes the apps as well. We have had this tv for over two years and we have not seen one iota of performance or feature improvements, despite the nearly monthly updates, even though they are desperately needed to achieve minimal usability. Customizability: Not!Apps: The home screen is extremely cluttered with Samsung's commercials & their own apps of dubious utility. With their central placement and extra big icons they take up the best and the most real estate on the homescreen. These are the PermaApps bc you can't uninstall or move them.The apps people really use have tiny icons. There are a few on the very bottom of the screen with a couple more on the very  top. The majority of the apps are banished to a second screen that we found by accident. The top row apps change randomly. I suspect the top is the paid spot, bc Amazon, YouTube and HULU+ have the top spots. Pandora used to be there too, but mysteriously disappeared after an update.  I found it's icon hidden on the back screen a couple weeks later. I had to download it and install it again, and of course my login was deleted as well.Pandora, pay your rent will you? After much tongue chewing, I managed to shuffle Pandora back up to the front screen. But you still have to wade through the family and sports apps and the commercials for paid 3D apps to find it.Web browser as useless appendage:I thought it would be cool to have a TV with a web browser, but there is no way to use it, except for maybe  telepathy. There is no mouse or keyboard compatibility, even for the web browser. You have to use the remote.The remote is supposed to have some kind of surfing mode, but it doesn't really work, and of course you can't actually type anything into the Google search bar, unless you have lots and LOTS of patience. And then it is so slow. Install Firefox on a Windows 95 laptop with a dial-up connection. Install every plugin and extension you can find, and it will be 10 times faster than the Samsung tv browser.  Useless!Stuck in default mode:The TV has a broadcast mode and an Internet mode. We don't have any cable or broadcast signal where we live, so we only use Internet mode. But the default is broadcast mode. It continuously searches for a signal, and I suspect this is part of the reason for the TV's' poor performance.  It  takes a long time and sometimes many clicks of the remote to switch to Internet mode. There is no way turn off searching for signals or to set the default mode to Internet. Sheer Incompatibility:For the times it is just too frustrating to try to watch Internet TV, we bought a dvd player. We chose a Samsung device stupidly assuming  it would be compatible with the TV.It's not. They fight over who gets to be on, and whose remote gets to work. When you turn them both on, one will almost always turn the other off. When you get them to finally agree to be on at the same time, then they each display their own screen which conflicts with the other one's screen. There is no way to program the tv to recognize the dvd player or vice versa, neither can you configure one of the remotes to work with both devices. I suspec that what happened is that Samsung made the DVD player, with it's own Interface, and then they made the TV with a completely different interface, and without a thought to backward compatibility. That's a really slick marketing technique, I guess.I read somewhere recently that Samsung spends the lion's share of their R&D; money on software development. If so, they had better check to see if the people they are paying aren't really over at Google or Microsoft when they are supposed to be at Samsung, bc if this TV is the evidence, I would say they hired monkeys to write the code for them.I have given this tv one star, because after all the frustrations, and things that don't work right. When you can get something to actually play on it, it looks pretty good. I am still hopeful of finding something to put in the USB slots.", "Date": "December 21, 2013"}, {"Title": "Perfect for mid level large screen smart TV. UN65ES6550", "Author": "FirstTime", "ReviewID": "R2F3I8XZL1U784", "Overall": "5.0", "Content": "My criteria for a TV was 65\" / Amazon Prime / Yupp TV / SamsungI got this TV at a very discounted price.Walked into whole sale store. Floor model  was for sale. Was not sure if this is a good buy. Verified some stuff and bought it. Then came the difficult part moving it home.As it was display piece no boxes. So I went to Home Depot got packaging material for large screen TV and tried loading. The guy at the store said no need just be careful of bumps. SO I put a roll of bubble wrap below the screen and loaded it front down (along with the stand. ).Drove 130 miles and unloaded it after 3 days.(It was raining heavily). Was worried for three days if the TV wil be working or gone bust.Its very big but comparatively very light. I can lift it up by myself but I would always suggest two people handling it.I tried running Amazon and it asked for a system update. I go to system update it says System is upto date. So I chatted with Samsung. They told me I have to manually patch the firmware. The process is fairly straight forward if you have a USB mem stick and a PC.After manual firmware upgrade it did one more online upgrade. After that Amazon prime started working without a hitch.That was the initial setup.For 1 week I had the TV connected to cable via a component cable. ( I had basic digital box -no HDMI). So the picture quality was nothing stunning. So went to comcast and changed to HDMI box. Still not much of a difference. But last weekend my friend pointed out I was not watching the HD channels. So I started browsing the HD channels and Voila..Perfect TV.Crisp ImageNo LagDoes the job perfectly.I dont intend to use it for 3D movies so cannot comment on that.Few shortcomings from my observation.The setting for auto shutdown if the same image is present is minimum 2 or 4 hours. I would want that to be about 30 Min to 1 hr or more. Because my kids watch tv and get on with some other game. No use TV staying on for 1 hour before I come in and shut it off.Very happy with the purchase.BTW I was told my rTV will be same as any 65** series. Each retail chain gets its own version of the model to avoid price comparison.Relax and Enjoy.", "Date": "June 24, 2013"}, {"Title": "So Simple a Neanderthal .......", "Author": "Mackman", "ReviewID": "R2FO0YT0CTZYDK", "Overall": "5.0", "Content": "I purchased this exact TV from Costco. Out of the box when you turn it on it leads you through the easiest setup I have ever encountered on an HDTV and including connecting to your WIRELESS network (so simple a Neanderthal could do it). I found that this HDTV out of the box has a beautiful picture; calibrate it with these professional calibrations:Picture Mode MovieBacklight 16Contrast 95Brightness 45Sharpness 15Color 50Tint G50/R50Advance SettingsDynamic Contrast OffBlack Tone OffFlesh Tone 0RGB Only Mode OffColor Space Auto10pt White Balance OnGamma +1Expert Pattern OffxvYCC OffPicture OptionsColor Tone Warm2Digital Noise Filter OffMPEG Noise Filter OffHDMI Black Level LowFilm Mode OffAuto Motion Plus OffLED Motion Plus Off10pt White BalanceOnInterval Red Green Blue1 0 -1 -12 -1 -1 -13 0 0 04 -1 0 +15 -1 -1 +16 -1 -1 -17 -1 -1 -18 0 0 09 +1 0 010 +2 0 0White BalanceSetting ValueR-Offset 25G-Offset 25B-Offset 28R-Gain 18G-Gain 23B-Gain 21Screen AdjustmentPicture Size Screen Fitand you will have a picture second to none.The one and only complaint is the DLNA streaming disconnects; but this is a problem with ALL BRANDS of smart HDTV's. I suffered this and wondered how Samsung and other manufacturers could not address this software issue since it seems to have existed since at least 2010. You will get no help from the Samsung customer service reps due to the fact they really have no technical knowledge and work off a script.If you do some Googleing you have a vast amount of knowledge bases to research. After a lot of reading and trying many of the DLNA media servers out there I tried SERVIIO. The download is free and the setup seamless on your computer. Depending upon the size of the library of photos, music and videos you want to add from your computer it can take from minutes to a few hours for the server to catalog your media.  Be sure to uninstall the ALLSHARE software from your computer to avoid conflicts.I have used it for about a week now and every movie that I watched wirelessly using Serviio; I have NOT HAD ONE DISCONNECT (one movie was three hours long).The TV is very intuitive and the apps work flawlessly and there are hundreds to choose from. Unlike some other reviews state AMAZON is included in this TV for their video streaming.The fit and finish is immaculate and mounting it on the wall a breeze (400 X 400 VESA).  If you do use the stand it is HEAVY duty and swivels.The sound (I have it connected to an AVR) is extremely decent through the tv's speakers.I have had Panasonic, Vizio, Sharp and LG HDTV's and while all are good this Samsung's picture has impressed me the most. The end of the model year price break (retail is $3799) makes it a great buy", "Date": "March 20, 2013"}, {"Title": "Cyber monday purchase", "Author": "Serfirio", "ReviewID": "R38P287M5BITPU", "Overall": "4.0", "Content": "It is not a very big TV but it is a very fancy one at that. The only problem I had was that I dropped one of the 3D glasses 2' and it cracked pretty badly. I'm not a complete noob when it comes to technology but this TV showed me why they call it a \"smart TV\" set the 3D to split screen, play a video game on split screen and try using only one lens of the glasses and you will be shocked at what it does.. It's neat but not a very useful feature. Because the original price of this is 150$ more than what I had paid for it on cyber monday I would have to say its not that great for the price.", "Date": "February 9, 2013"}, {"Title": "This tv is awesome", "Author": "N. Hedstrom", "ReviewID": "R2SKB6X84J5GM5", "Overall": "5.0", "Content": "I know when looking for new TVs you'll probably look at a review site for the specifics, like I did before I bought this one, but official reviews aside I love this tv. It's very thing and light, almost scary thin. The picture looks great and it has so many good features. I always buy Samsung because you really do get what you pay for. At the same time I bought this I also got a 50\" Panasonic plasma, and even though it does have deeper blacks, there is NO competition between them because this one wins outright. The Panasonic has a Ethernet port for internet connection to access apps like Netflix and YouTube and it gives me trouble almost EVERY time I use it and it is terribly slow. This TV has built in WiFi and works perfectly, accessing Netflix and YouTube is fast and trouble free. This is a great TV!", "Date": "January 14, 2013"}, {"Title": "Great picture!!!", "Author": "T. Eddy \"Legend in my own Mind\"", "ReviewID": "R29DCCWH6PLFPV", "Overall": "4.0", "Content": "I like everything about this TV except one thing: It does not have a variable output for external speakers... only \"Line Out\".  That means that one must have an external volume control for self powered speakers.  I think that is a real aversight on the part of the designers.", "Date": "January 10, 2013"}, {"Title": "Dumbest Smart TV", "Author": "Amy Wills", "ReviewID": "R1RQX5XJ079IBF", "Overall": "2.0", "Content": "Smart Hub is slow and crashes all the time. The TV has a nice picture, but the Samsung Smart Hub is TERRIBLE!!!", "Date": "January 6, 2013"}, {"Title": "TV is great", "Author": "Byron P Baker", "ReviewID": "R31PR09S4QE76Z", "Overall": "4.0", "Content": "When the TV is smarter than the operator........ well what can I say.  We love it hope I find time on how to use it!  :)", "Date": "January 1, 2013"}, {"Title": "Great", "Author": "Gary Pignone", "ReviewID": "RC7PA3DK46GT0", "Overall": "5.0", "Content": "Great picture, easy setup, 3D is jaw-dropping.Thin design and corner to corner screen very nice. Already recommended it to friends.", "Date": "December 30, 2012"}, {"Title": "Fantastic", "Author": "Jack", "ReviewID": "R3AEKPCWFAILY7", "Overall": "5.0", "Content": "This 3D TV is unbelievable, the amount of technology in it will knock you out. The only thing missing is a key board which I ordered after I got the TV", "Date": "December 30, 2012"}, {"Title": "samsung un60es6500", "Author": "husni kobeissi", "ReviewID": "RXF5VFCA0GBEF", "Overall": "3.0", "Content": "everything worked fine, except every now and then it shows not connected to internet, then when you connect the unit it shows ready to use, you try to open anything using the internet, it asks you to connect. this does not happen every time", "Date": "December 21, 2012"}, {"Title": "Awesome", "Author": "Curtis Giles", "ReviewID": "R2W0PBCLYFXT0R", "Overall": "5.0", "Content": "I love just about everything about the television. The picture is perfect. I like the Netflix and YouTube apps. However, there is an awkward glitch where the Smart Hub home screen briefly appears while playing a game on the PS3. I don't know if this happens while watching television or with other sources. However, it only happens once or twice each time the tv is turned on.", "Date": "December 15, 2012"}, {"Title": "Just Love It!", "Author": "C. Dinh \"Suffering exists because of our desi...", "ReviewID": "R3UQ9AZI8WB4Y4", "Overall": "5.0", "Content": "I ordered a Samsung 60-inch 3D HDTV; it finally arrived last week.I bought this 60-inch TV because I wanted to take advantage of watching 3D channels from DirecTV.  After having it for more than a week, here are my 2-cent comments:1) Picture quality is really nice.  The color is amazing. I own 6 HDTV: 4 of them are Samsung and the other 2 TVs are Panasonic and LG 47-inch Cinema 3D.  This one is the largest one with 3D functionality using active shutter glasses.  I purchased it because I wanted to take advantages of watching 3D programs from DirecTV that are available from its basic package.  However, I did sign up for the top Premier package so I enjoy its programs to the fullest extent.  The 3D high definition is amazing when I watched Titanic 3D Blu-ray last week.  To tell the truth, since watching 3D, I don't want to watch any TV programs in 2D.  I just can't take 2D anymore.2) Smart TV with built-in Wifi is one of the coolest features that I really like about.  I could use it as to surf the Internet, watch youtube or listen to music on any other standard or flash-based websites. Flash is good with this TV as well.  The only draw-back I've seen so far is I can't watch ESPN3 sports programs on this TV due to a need to update for flash software that appears outdated for streaming.  I've attempted to update the flash, but it looks as if I can't do it manually.  Other than that, this TV can be used as a desktop computer.  I hope Samsung will send its latest flash update so I can fully enjoy ESPN3 sports experience through this TV.  Keyboard and mouse cursor operated with its standard remote TV also give me a little hard time as it takes such a fair amount of time to type a website address into its entry box.  This issue can be definitely improved with a Samsung blue-tooth keyboard associated with this TV.  I might have to buy this keyboard in hopes of facilitating better with my internet experience in this TV.3) Sound quality is not the best, but it is not the worst.  I would give its sound quality 3 out 5 stars because bass might present a possible problem as I could hear some crackling from the TV speakers.  I have to switch it back to standard sound mode in an attempt to reduce its level of crackling noise.  I don't know if that issue is originally defective or was caused from its shipping process.All in all, I am just satisfied with this purchase.  If I had to buy it again, I would do it without a second thought.  I would recommend everyone interested in 3D and a long list of cool features in this TV buy it.", "Date": "September 17, 2012"}, {"Title": "Awesome TV", "Author": "Neroos", "ReviewID": "R1Y4TAI0R963MZ", "Overall": "5.0", "Content": "This 50\" TV is just awesome and has a great picture. I put the TV on this TV stand  [...]What a perfect fit. Go for it, it's a great TV.I wasn't pleased with the audio at first so I ordered a Samsung soundbar. That soundbar was too annoying as it came with another remote with more setting choices than one really needs and it really didn't improve the sound. Anyhow, I returned the sound bar and have the TV sound adjusted to where we like it.8/16/12I had a chance to view a 3D movie today and all I have to say is, WOW! That is so cool. When you compare the 3D with 2D you wonder how you've watched 2D all these years. I hope 3D will be available more in the future.", "Date": "August 13, 2012"}, {"Title": "great TV and wonderful service from Amazon", "Author": "amz buyer \"AMZ list\"", "ReviewID": "R2KMHWFA5YQXVY", "Overall": "5.0", "Content": "I bought this 60 inch TV (Samsung UN60ES6500 60-Inch 1080p 120 Hz 3D Slim LED HDTV (Black)) from Amazon. It has been little over 2 weeks now, and i am extremely happy with my purchase. I don't need to write about picture quality and other features because you will already find those in other reviews here. I wanted to write about how i got this from Amazon. I was a bit apprehensive about buying such a big ticket item from amazon.. instead of going to a local store. But, i went ahead and did it anyways. Amazon's delivery service scheduled a date to come and install the TV. (not that it is complex to install it yourselves). They unpack install and leave... all in 15 minutes. excellent service.After about 2 weeks, i noticed that the price fell by $100, so i sent an email to amazon about it... and they have sent a refund for the price drop. well..that says a lot about customer service. If it was at some store like bestbuy.. i would have to physically go to the store... stand in line for their returns/customer service for an hour. and then maybe i might get a refund.", "Date": "May 17, 2012"}, {"Title": "Incredible TV - Great Product", "Author": "Edward Huber \"Splitrockvideo\"", "ReviewID": "R3SSDXH2SM6KQU", "Overall": "5.0", "Content": "This TV is almost too good. You actually have to use a slightly lower setting in the menu under \"Auto Motion Plus\" to \"Clear\" as the standard setting is actually too smooth and good. It makes movies look too crisp. The 3D is very nice although I think an upgrade in glasses may be in order. They are comfortable but I may look into getting ones that block more light from coming in on the sides.", "Date": "December 7, 2012"}, {"Title": "Love this TV!", "Author": "Styyyks816", "ReviewID": "R1O6G2ZV2A34KZ", "Overall": "5.0", "Content": "So I've had this TV for a few months now, and it is the best tv I have ever owned.  the refresh rate is amazing, picture quality is superb, the fact that fast action sequences no longer blur like my old tv is pretty much stellar, and its 40, 10 inches bigger! I've had an opportunity to play with 3D some but not much, need to purchase a good 3D bluray player.  Other than that, great buy, amazing discounted price, would purchase again.", "Date": "October 8, 2012"}, {"Title": "love it", "Author": "CA guy", "ReviewID": "R1WDMIO37QKV0L", "Overall": "5.0", "Content": "Have had the TV for a little over a week and love it. The picture is great and the sound is fine for a TV. Obviously you will want to use around sound for movies.Using the internet on it without a keyboard is a pain. Haven't had a chance to try out the 3D yet.I would highly recommend the TV though.", "Date": "May 14, 2012"}, {"Title": "Not Very User Friendly and misleading wifi ready feature", "Author": "Chris Z", "ReviewID": "R26W97PC8P78SF", "Overall": "1.0", "Content": "1) user interface is very hard to get around2) does not convert 2d to 3d3) says it is wifi ready, but that means you have to by a wireless Samsung LAN adapter running you around and extra $904) could not turn off the picture in picture feature from the homeI bought an LG 3D smart TV and was much happier with my purchase and the magic remote", "Date": "January 31, 2013"}, {"Title": "Just a bit of buyer remorse", "Author": "Tropical Nurse", "ReviewID": "R1P84MZVSLK24Y", "Overall": "4.0", "Content": "I have many Samsung products, including a 40 inch LCD TV which has served me well for six years. Hubby has been wanting a larger TV for our living room and has coveted a Smart TV. We decided on this one. He wanted 55 inch; I thought that was too big. I went along with it. We bought the 55 inch model of this TV. I still think it's a bit too big for the room, but I'm getting used to it. Shipping was fast and flawless, as usual. The picture is beautiful. Is it a whole lot better than the picture on our 40 inch LCD? It's better, I'll say that, but not incredibly better (both are very good). The sound is good enough for TV speakers. The Smart Hub? Ugh. I can see that we'll never use it. (to be fair, I really didn't think we would). We have a Samsung Blu-Ray DVD player as well as a ROKU. There's not one app that we'd actually use on this Smart Hub that we can't already access via said Blu-Ray player or the ROKU. I'd never use a TV for Skype or web browsing, at least not this one. Too time consuming and clumsy when I have my very fast desktop sitting ten feet away. But, I digress....I very carefully calibrated the TV using settings found right here in the user reviews. (This is such a wonderful benefit of reading the reviews!). They tweaked the picture to a level that was just short of stunning. A few days later calamity struck. I said OK to installing the latest firmware upgrade. That firmware upgrade took away the option of choosing the type of picture you want and changed it to \"dynamic\", which is not what I want and is not able to be changed.I immediately took to the Samsung Support page on Facebook (a wonderful and responsive page, by the way) and asked for an explanation. They answered within minutes and acknowledged that the functionality to select picture mode was indeed taken away with the firmware upgrade. They said they would escalate it to their tech folks. I'm still waiting to hear something about it, but I fear I'm stuck with it as the firmware upgrades cannot be undone. Maybe the next upgrade will fix it. In the meantime, the picture is still very good, but I'm a bit ticked about the picture mode decision being made for me.The stand is ugly. Our old LCD had a beautiful, oval stand. I question who designed this four-pronged stand, but that's not a huge deal. The TV is so thin. I'm amazed by this! Hard to believe they fit all the \"stuff\" in there!So all in all, if I had it to do over again, I'd skip the SMART TV function, skip the 3D (another concession to hubby--I can't watch 3D--it gives me a headache), and get a regular non-smart LED TV, then tweak the settings to my liking and wait to install ANY firmware upgrades until they are fully vetted by others and I am sure they won't screw anything up. (The same way I won't let Chase Mobile Banking app automatically install upgrades on my android phone until a week or two has gone by and I check the reviews!) Then, by all means, hook up the Blu-Ray and the ROKU, and if you must stream something from your laptop, just hook that up to the TV via the HDMI port. Save yourself the extra money.This was an uncharacteristically impulsive buy for me. Thus the buyer remorse. Don't make the same mistake", "Date": "November 22, 2012"}, {"Title": "Better than OK", "Author": "B. Chau", "ReviewID": "RSDZSKQYW6RH5", "Overall": "4.0", "Content": "This is a good pricing product.  Now, I still using it up to today.  Do not using internet, super slow.", "Date": "October 11, 2013"}, {"Title": "great and wrong", "Author": "alexander", "ReviewID": "R31V8E2L7R1UNM", "Overall": "5.0", "Content": "the product es great. the image and the resolution is out of this word. the only problem was the sound es wron. i guess is a problem of fabrics or manofactur. the shop dont have the gulty of this problem. i guest is one of the risk to buy a product and sended to another country.  disculpen mi ingles. soy venezolano. ya averigue un agente autorizado para arreglar lo del sonido. al subir volumen se distorciona", "Date": "May 1, 2013"}, {"Title": "Smart makes everything slower. Needs high end router with more bandwidth", "Author": "Priyadarshini Anandan", "ReviewID": "R1YEBJRZAFQU0M", "Overall": "3.0", "Content": "Web browser is not good. Consumes lot of internet . needs more bandwidth even 15mbps didnt make it. youtube app is the most comon we use but it has lot of problems still samsung didnt give solution for that. LED features are amazing, sound quality super good. 3D effect is the best one. but mostly we use apps which are annoying. some problem with syncing the wifi credentials, prompting lot of times. need to configure everytime.", "Date": "April 24, 2013"}, {"Title": "Love the picture", "Author": "Rina", "ReviewID": "R2MNAO2PVGYJXN", "Overall": "5.0", "Content": "This tv is beautiful. The 50\" smart tv model, with 3d, is gorgeous. I just watched les mis on it, and the picture didn't look flat, it looked like the people really were right in front of me. It was amazing. I honestly think from now on, I would rather wait for movies to come out on DVD then spend money to go to the theatre because of this tv.I love using the smart tv functions. So much easier to watch Netflix or Hulu. I don't have any problems with the screen, or the apps.", "Date": "April 8, 2013"}, {"Title": "3D TV", "Author": "Anthony A. Dennis", "ReviewID": "R2JOEWV4FQLPXB", "Overall": "5.0", "Content": "I was in the market for a TV for my kitchen.I have two other Samsung TVs so I know how well thay work.This unit fits ontop my computer desk for eye level viewing.It's a sweet setup.What I i'm really impressed with is the theather quality 3D that it produces.I had to buy extra glasses to share with my friends.I'm so happy with this buy,how do you beat 2 day shipping,right to my back door .The TV itself does everything its subposed to do very well.I think the price real good too.", "Date": "April 6, 2013"}, {"Title": "PERFECTAMUNDO!", "Author": "tokenjo", "ReviewID": "RSIIH1L88GPXY", "Overall": "5.0", "Content": "Pros: EXCELLENT LED/LCDCons: NADDAReplaced a 32\" Toshiba with this baby and I will never turn back.Installed and upgraded itself upon initial warm-up, turn on.Very Nice!Can't really say any more good things except that you need to purchase one and experience a whole new world of HD to appreciate this model fully.*** GREAT PRODUCT ***", "Date": "March 14, 2013"}, {"Title": "Samsung LED TVs: Beautifully small bezel, thin and horribly flawed.", "Author": "Leslie Ann", "ReviewID": "RNOC8NAVBMAUI", "Overall": "2.0", "Content": "I have owned this particular Samsung TV for several months. Purchased from Best Buy, I mounted it on the wall using a low-profile picture hanging style mount. It looks gorgeous! So thin and such a great picture.Pros:Thin with a tiny bezel! What initially drew me to this model was how awesomely thin it is, and with such a small bezel. So sleek and futuristic! Awesome.Great picture quality! Great for gaming, sports, movies, everything. 120hz means low motion blur and the color accuracy is great compared to the 1080p Plasmas and LCDs I've used in the past.Easy to mount! I highly recommend a picture hanging style mount, especially for this style TV. It is a very flattering way to show off this gorgeous TV.Cons:\"Smart\" TV. The Smart features sound great! Netflix and tons of other streaming options? Great! Unfortunately, it isn't wireless. So you have to front some cash for a wireless adapter (bleh!) or bridge (highly recommended substitution instead of a wireless adapter. More versatile and longer lasting. Highly recommend Apple's Airport Express for this usage). The Smart features are very sluggish and slow. Like most Samsung Smart devices (BluRay players, TVs and the like), it is unreasonably bloated and slow. It took us roughly 5 minutes from launching Netflix to actually watching a movie near the middle of our queue.LIGHT BLEED. This is the biggest nail in this TV's coffin. I noticed a tiny bit of light bleed at the time of purchase and installation, but it got drastically worse over time. Now it's unbearable. Thankfully, Best Buy is being good about this and is either repairing this TV in our home (replacing the panel) or giving us credit back to buy a new TV from another brand. Reading around and asking various Geek Squad employees, this is apparently a rampant problem with LED TVs made by Samsung.All in all, this TV is below average. The aesthetics are great, I can't stop harping on how thin the entire TV is, along with the bezel. However, the bloated \"Smart\" crapware Samsung bundles with their devices along with the horrific light bleed problem forces me to give this TV a pass. Recommend STAY AWAY.My Setup:Samsung UN40ES6500 40 inch LED TV 120hz 1080pXBOX 360 Elite 250gbHarman Kardon AVR1700Harman Kardon SoundsticksApple TV 3rd Generation", "Date": "March 10, 2013"}, {"Title": "Samsung 32-Inch 1080p 3D slim LED HDTV", "Author": "Mason Henson", "ReviewID": "R2ZZ0BXCBI7CYX", "Overall": "5.0", "Content": "I would say thing T.V is great if you looking for a small not so big T.V. To play game and even us for a monitor (HDMI-INPUT) it is a great buy. Pluse the 3d is amazing", "Date": "March 3, 2013"}, {"Title": "nice tv", "Author": "dan", "ReviewID": "R3JQS0249XZGUY", "Overall": "4.0", "Content": "no real problems..sure it has some technical falts but nothing remotely noticeable in the real world.the wifi web stuff was a selling point but I never use it..just use my phone or laptop.", "Date": "February 20, 2013"}, {"Title": "Browser Issues", "Author": "Maneesh Kumar", "ReviewID": "RSCZ49LI8X8BY", "Overall": "2.0", "Content": "Main reason I bought this TV, so I don't need to buy google player etc and use one device to address my internet needs. I was unable to play internet movies and I was getting error \"YOUR LAST BROWSER SESSION ENDED DUE TO LACK OF MEMORY OR OTHER UNNOWN REASONS\". When I contacted Samsung, I was told this unit would require service. I was frustated as  this was Brand New TV just 3-4 days old, and I could not simply digest accepting service as solution.I reserched extyensively on net, I found most Smart TVs this is an inherent issue. This Unit had memory of 797mb out of which 300MB was already used by Apps. I think this could be main issue. Unless Smart TVs are equipped with good cache memory, Smart TV cannot be really Smart.  My view, don't buy Smart TVs, I think technology is not matured to enable it Smart. I bought a 6 series non Smart TV, and plan to buy Roku/google player to make it Smart.", "Date": "February 12, 2013"}, {"Title": "Great bang for the buck!", "Author": "Jim \"Jim\"", "ReviewID": "R2ME72EEYVYBLO", "Overall": "5.0", "Content": "I've owned UN65ES6500 for a few weeks. Out of the box, the picture was too bright and red. It took a bit of playing around to customize the brightness, contrast, colors, etc. to our taste (standard mode, brightness way down, contrast way up). Internet access to our wireless network was simple, though a cable connection might be faster. The end result was a great picture that really shines in HD and doesn't break the bank. I don't plan to use 3D though its nice to have the option. Very light weight and good sound too. The price is currently controlled, but I got Best Buy to remove the tax by using a internet competitor (Crutchfield). This gave free delivery, basic setup and easy return (not that I want to). Based on bang for the buck, it's a great buy.", "Date": "January 22, 2013"}, {"Title": "Love the tv but can't set it up", "Author": "Nicpin", "ReviewID": "R1ANAPE79INTQP", "Overall": "4.0", "Content": "The tv is amazing. I would give it five stars but the packaging did not have the screws I needed to put the tv in the stand that comes in the box with it. So now the tv is leaning against the wall without a stand. I am very disappointed in the packaging of the TV. I have a stand that I cannot attached to the TV and have no idea how to get the screws to put in the stand. The picture and sound are great. The Samsung apps are the best out there.", "Date": "January 18, 2013"}, {"Title": "Everything I was looking for in a big screen", "Author": "Mark", "ReviewID": "R3BEHWIDS4Z14R", "Overall": "5.0", "Content": "Sammy is very consistent.  Great picture.  Good value!  I would make this purchase again and again. Easy to set up and use.", "Date": "January 15, 2013"}, {"Title": "Great TV", "Author": "Peter N. Neff", "ReviewID": "R27HTTE5YC1BNK", "Overall": "5.0", "Content": "What can I say, I'm not a techie.  It is a good, big TV.  The picture is great (for me).  It is very thin and light.  3D is pretty neat as a gimmick if you don't mind wearing the glasses.  The price is kind of steep, but I feel that 'you get what you pay for', and this TV does not disappoint.", "Date": "January 13, 2013"}, {"Title": "Essentially what I expected", "Author": "Patricia M. Dewey", "ReviewID": "R2WSQXU3V85N0F", "Overall": "4.0", "Content": "This item arrived on time, was fairly easy to set up and has performed well.  The Owners Manual had most of the basic information needed to operate the system, but to get details it is necessary to use the embedded e-manual which is a bit of a chore.  Also, it would have been helpful to have an index in the supplied manual, and a glossary of terms for those of us who are digitally challenged.", "Date": "January 13, 2013"}, {"Title": "Great TV", "Author": "Margaret S. Wood", "ReviewID": "R2AHOH5RZY6R4R", "Overall": "5.0", "Content": "We are big sports watchers - this TV is amazing for sports - you can see the shadows of the players on the basketball court and faces in the crowd.  The picture is soooo amazing.  It also was very easy to assemble and use.  Highly recommend it!", "Date": "January 10, 2013"}, {"Title": "Probably the best Samsung UN40ES6500 40-Inch 1080p 3D Slim LED HDTV (Black) I ever bought.", "Author": "Vuzzbox", "ReviewID": "R100OATTO85RJ0", "Overall": "5.0", "Content": "Actually, it's a great TV. Great image quality, especially with the Blueray player and the Wii. Works very well during daytime in our well sunny family room. Speakers on the TV are pretty good for being invisibly small.The only thing I would give a thumbs down on is the \"SmartHub\" user interface. Functional, but it needs some work to make it more usable.  That may have more to do with the individual apps than the SmartHub itself, however.Surprisingly, I wish I had the keyboard to go with the TV. I thought it was kind of gimmicky, but have actually found that I am using the web interface and other features of the SmartHub service enough where it's a nuisance without the keyboard.", "Date": "January 10, 2013"}, {"Title": "Great TV - Smart apps not so smart", "Author": "B. Vandermolen", "ReviewID": "RNRIXWI8UMYOQ", "Overall": "4.0", "Content": "As with (probably) all TVs with motion smoothing features, you'll have to turn those features off or else you end up with that horrible \"soap opera effect\". Beyond that, this is a great TV. I hung it on my living room wall with a JLAB mount and it looks very professional.The only thing I don't like about this TV is the Smart Hub and the various apps. I have similar apps in a Sony Blu Ray player and they are so much easier to use there. I am now reviewing candidates for a 40 inch TV for my family room and I am considering getting a Sony just because it has better apps.On the other hand, I am hearing through the grapevine that Samsung is working on a completely redesigned Smart Hub, so maybe that'll improve the situation.", "Date": "January 7, 2013"}, {"Title": "Best Purchase for 2012", "Author": "Victor Wilkinson", "ReviewID": "R2TSGXWMBTD18", "Overall": "5.0", "Content": "This is a wonderful TV and loved by all the family.The functions are all user friendly.Just waiting for more 3D channels to become available now.", "Date": "January 4, 2013"}, {"Title": "Samsung did it again", "Author": "Justin M", "ReviewID": "R2G2ENDY1WP2XW", "Overall": "5.0", "Content": "I love their TV's. I am a huge Bravia fan first of all. Sony, however, is pricing themselves out of this market in my opinion. This Samsung has an amazing picture and the ability to stream wireless is a great addition. Easy to setup and operate even for my electronically challenged wife. Set the picture to the settings shown in the other reviews and it is truly stunning.", "Date": "January 4, 2013"}, {"Title": "Another good Samsung TV", "Author": "D. Kropp \"Dex\"", "ReviewID": "R39LWQWG1WQLV2", "Overall": "5.0", "Content": "Pros:Great picture quality.  According to AV enthusiasts, the picture quality isn't as good as the newer Samsung LED's like the 9-series, but I think it's more than enough for a typical family room.  Might old Samsung 50\" DLP might have had slightly better sound, but it was also about 18\" thick and weighed more than twice as much.Cons:None so far.Other:I haven't finished trying out all of the SMART features because I already have a Sony SMP-N200 configured to do all of that.", "Date": "January 4, 2013"}, {"Title": "Exactly as expected", "Author": "B.Didds", "ReviewID": "RRVT188BXWVOB", "Overall": "5.0", "Content": "The TV arrived quicker than expected, in perfect condition. The quality, picture, and contents were all as advertised. This is a great TV, perfect size for bedroom or small entertainment room. After researching consumer reports and visiting many retail locations to check out the sets I am 100% satisfied with my purchase.", "Date": "January 3, 2013"}, {"Title": "Great TV", "Author": "Jim", "ReviewID": "REPCQI4498ED8", "Overall": "5.0", "Content": "Couldn't be happier with this HD TV. Samsung lived up to it's name on this one. Picture is great and sound good for the size.", "Date": "January 1, 2013"}, {"Title": "great delivery, great picture but...", "Author": "Zayde617 \"Zayde617\"", "ReviewID": "R1E468JBD9FBMX", "Overall": "4.0", "Content": "Been a little disappointed with factory responses - waiting for monday when they can direct connect and analyze what is happening.  my wireless internet connection was a breeze, fast and easy.  First disappointment came when I tried to connect to amazon from the tv for downloading amazon Prime movies to watch over the tv... samsung said, although a menu option, and promoted option,  the Samsung Software does not yet exist for activating this feature which should have been activated a month ago.There is also a problem connecting the tv to Pandora for music..Other than those 2 particular problems, I am very pleased,  this is my second Samsung TV purchase in less than a month.Amazon utilized FEDEX for delivery of this product which got it to me in record time, and in good condition.", "Date": "December 30, 2012"}, {"Title": "Very happy so far", "Author": "John B", "ReviewID": "R3V1GFPER3FRGN", "Overall": "4.0", "Content": "TV arrived one day earlier then promised. TV's preset picture modes are not the best and would suggest going to [...] for their recommended picture settings.  I set all the display controls manually as suggested and now I love the picture! Nice price from Amazon and fast shipping.I am very happy so far and would recommend the TV.", "Date": "December 26, 2012"}, {"Title": "I'm very pleased with this TV", "Author": "nicholas vernola", "ReviewID": "R2V8WBU8NGCRSY", "Overall": "4.0", "Content": "The only reason I didn't rate it a 5 is because I haven't had it long enough to use all of it's features. I have another Samsung TV that has poor quality sound. I frequently use my stereo sound system so I can understand the dialog. This new TV has much better on board sound. We don't need to supplement it with a separate sound system.", "Date": "December 25, 2012"}, {"Title": "Nice tv", "Author": "Marc", "ReviewID": "R3TQPE136734PR", "Overall": "4.0", "Content": "Had this tv for about 4 months. Picture looks best in Standard Picture Mode.With Contrast at about 83 and Eco Sensor Off. This keeps picture Brignt and looks best.Try these settings you may like it. I tried all other settings and picture looked fake with too mch color blead on skin tones, ECO Sensor left on makes picture look bad when it dims. Turn it off and does well.Contrast bumped down to about 83 works well. Need any help with this just let me know.", "Date": "December 24, 2012"}, {"Title": "Excelente producto", "Author": "prlc", "ReviewID": "R349A9OY06CL5E", "Overall": "5.0", "Content": "Compra satisfactoria, llego a tiempo y muy bien empaquetado. Lo estoy utilizando y me parece un producto de buena calidad.", "Date": "December 24, 2012"}, {"Title": "Samsung LED_Smart_3D TV", "Author": "Lokesh", "ReviewID": "R15C5YZVD1E4BK", "Overall": "4.0", "Content": "Good experience watching 3D movies, blue ray movies. And also good experience on using smart hub along with my home theater its awsum", "Date": "December 24, 2012"}, {"Title": "The Best HDTV", "Author": "Uri Vaisman", "ReviewID": "R3NKVX0C3FKLRB", "Overall": "5.0", "Content": "The best picture out there. This is my third Samsung HDTV, and I have no intention on buying any other brand.", "Date": "December 24, 2012"}, {"Title": "Great LCD for the money", "Author": "Ramona L. Hinz", "ReviewID": "R14ICT9XXOIOI8", "Overall": "4.0", "Content": "I bought this for our bedroom amour.  It was the largest that would fit inside it.I also own a 64 inch 8000 series Samsung plasma.I used the calibration settings given from another user on this site.  The default settings using motion software tricks should be disabled.  It gives TV shows a goofy 3D effect that makes it look like it was shot from a web cam.  Its clear but makes every show look artificial.  No idea why they would use that as default.Use Film mode for everything and turn off the motion tricks and filters.Its got a nice picture and not much blur in sports either.Get a plasma if you want the best in color sharpness and motion.  Plasma still the best.But for a LCD this one is pretty nice.", "Date": "December 15, 2012"}, {"Title": "great and some flaws", "Author": "T. Tran", "ReviewID": "RU60RIKHR2WXP", "Overall": "2.0", "Content": "Great TV with no issues except one.Did any have any light bleed on all corners of the TV while watching a movie on a black background?***UPDATE***So after owning it for only 2 monthes, my TV finally began to snap out. The top about 4-5 inches now have a strobing effect and its annoying as heck. Now have to call for a warranty issue..I owned another Samsung TV and was a different problem for it. The reliability is not so great.", "Date": "June 9, 2012"}, {"Title": "Great TV not as nice as expected", "Author": "Rusty Garduno", "ReviewID": "R28B1DOD88TJ5N", "Overall": "3.0", "Content": "Samsung always makes a great product. I see why this one was cheaper (panel is not quiet straight). Some of the Smart TV features are slow and not so easy to navigate around without a keyboard or mouse. Picture is good quality. I would always recommend Samsung to anyone....but you still get what you pay for.", "Date": "February 25, 2013"}, {"Title": "The best", "Author": "Michael", "ReviewID": "R2BDDO3UPTF8JF", "Overall": "5.0", "Content": "It is the best you can have with the same amount of money. Do not buy TV of other brands. Their screen will be from samsung too. Samsung is the best!!!", "Date": "January 6, 2013"}, {"Title": "Great TV", "Author": "Glenn K. Roter", "ReviewID": "R34CISHTFPX8A3", "Overall": "5.0", "Content": "We bought this TV a couple of weeks ago for our bedroom and we love it. It looks very nice wall mounted.  I wish DirecTV had more 3D content but I was able to watch a special about Hawaii's volcanoes and its not everyday that you see lava coming into your bedroom!  We just bought Titanic in 3D so I am eager to view it.  But very happy with the TV and the purchase.", "Date": "November 20, 2012"}, {"Title": "Outstanding Features, minus one thing", "Author": "Gerry", "ReviewID": "R32KNYYOT5YOK3", "Overall": "4.0", "Content": "I haven't purchased a TV in five years and decided to splurge on a new one.  I love this TV, i love its ease to use and to operate.  It has outstanding picture quality, solid 3D, and its easy to use.  I had to finagle the mounting brackets by using washers because the spacing was incorrect, but mounting the TV on my wall was a minimal hassle.The one true issue is that the main HDMI, the other inputs and outputs are all mounted on the back of the TV, perpendicular to the face of the wall, or that to which you would be mounting your TV.  Its ridiculous!  Its an ultra flat TV and the inputs should be mounted on the back, but sticking out parallel to the main plain of the TV!  Come on Samsung, with such a great product, you'd think it would have a little solid simple engineering!!!", "Date": "October 30, 2012"}, {"Title": "Excellent TV", "Author": "J. LoCicero", "ReviewID": "RW0MS1RNOF62A", "Overall": "5.0", "Content": "I just purchased this TV and has razor sharp images and beautiful HD resolution and nearly perfect motion correction. For the most part I love Samsung products and this one does not disappoint so far. I hope to enjoy some more of the features and eventually the 3D!", "Date": "July 20, 2012"}, {"Title": "WOW!", "Author": "clownin72", "ReviewID": "R3BSK2FQBKCDLN", "Overall": "5.0", "Content": "This is my second Samsung tv Ive purchased. This one is replacing my 58 inch samsung plasma I purchased in Jan 2011. I cannot believe the difference in picture quality . I thought the plasma was great, until i got the 60 led up and running. No comparison. Even with the setting just on the basic standard mode with energy saving its mind blowing. Lightweight and only 1 1/4 thick, this tv is a home run. Price wise to me its on the expensive side, but I also agree with the \"get what you pay for\" saying. Excellent choice so far!!", "Date": "July 15, 2012"}, {"Title": "Good but not great", "Author": "GK", "ReviewID": "R3OJFCL8XH4HND", "Overall": "3.0", "Content": "1. Browser support is not good. Cannot watch videos in it.2. TV doesn't have direct key board access. One could use USB with wireless keyboard and mouse.3. Above all, customer has no control on the apps. We cannot uninstall any of the apps. There are unwanted apps pushed into the tv by samsung. This is like treating customer like a crap!4. With surround audio set up, there is jarring sound in the TV.Is anything good..? May be the 3D. 3D is not bad. Good enough. Apps are working okay so far.Over all the TV is costing more than what is should be. If one could wait, wait for a year more to get a matured technology. Apple TV might be a killer in many aspects, I guess, by 2014!", "Date": "December 25, 2012"}, {"Title": "Samsung is the Bomb!!!", "Author": "Shon \"SEW\"", "ReviewID": "R1Z9GUXX5GZSSY", "Overall": "5.0", "Content": "Great experience.  The delivery was early and outstanding.  Setting up the TV was easy.  I did a google search for the recommended professional settings for this model TV and easily found them for free.  Didn't have to buy a DVD. The picture is absolutely amazing but I have to agree with the others that you will want to buy a sound system. The sound on the TV is only decent. This is my second Samsung TV and I'm very happy with it.  Since I'm an Amazon Prime member, Samsung is a perfect match for me with the Amazon Instant Video App plus the Pandora App just speaks for itself.  Samsung is the bomb!", "Date": "December 4, 2012"}, {"Title": "Excellent TV with awkward web browsing (but it is a TV not a computer, so what did you expected?)", "Author": "lica", "ReviewID": "R3I4237LDMEO0Y", "Overall": "4.0", "Content": "This is a great TV, especially for the price. I've spent several days looking up costumer's reviews, visiting a few stores, and decided to go with this brand and model. It has a great design, the image is awesome and the sound is much better than what I expected. I'm not an expert on the subject, but I'm very picky and I find this TV to be the right option for me. I also use it with my Xbox and I must say that it brought my game experience to a much superior level.Yes, the web browsing is awkward but it doesn't bother me that much (the only reason to take one star). I use Netflix frequently and I haven't experienced any of the software issues mentioned by other people, so maybe this problems can be solved with internet configurations or other measures.I've only had this TV for two months and, therefore, cannot comment on its durability. I intend to update this review in a year or so. Hopefully it will keep me a satisfied customer for years to come.", "Date": "October 16, 2012"}, {"Title": "Samsung seem to have missed the mark a little", "Author": "MK", "ReviewID": "R1OZ0IART0RLLS", "Overall": "3.0", "Content": "Samsung are usually the standard to look to. Not in this case.Very (physically) light unitExcellent picture.Network connection capability limited. It has a very customized interface that would not link to anything on my home network to share anything at all.The external connections were VERY limited. I have multiple sources (game machines, etc. not all HDMI) and couldn't connect them all. The connectors were also straight out the back rather than parallel to the plane of the screen.Read the fine print on the specific feature details and be sure you're getting EXACTLY what you need.I returned the unit and replaced it with an LG that's awesome and has the picture, network, and cable connectivity I need. Amazon were (as usual) great with the return, refund, and getting my replacement to me.", "Date": "June 27, 2012"}, {"Title": "Great TV, but the VESA mounting is a pain.", "Author": "Amazon Customer \"WEBOne\"", "ReviewID": "R18HGHM4HO7XZ3", "Overall": "4.0", "Content": "I've had the TV for about a week - the picture is amazingly clear for most things.  I had a lot of trouble getting the right screws for the VESA mount holes.  The instructions say m6, but they're actually m8 and a lot longer and bigger in diameter than the screws I've used before for mounting a tv of this size.", "Date": "December 1, 2012"}, {"Title": "Very Good TV", "Author": "Donnie W. Fox \"Fox5\"", "ReviewID": "RWHUQPIBUFOQI", "Overall": "5.0", "Content": "My first review was not good so I did it again.  After using this for a few days I have found that it is outstanding and it has Vudu.  There are a few things I think could be better though.1. It needs a small keypad / mouse remote and software to use it.2. The remote has a \"p=size\" button on it but it does not work when using Vudu. I like the picture to fill the screen instead of a narrow strip. The button on my 4 year old Panasonic TV works on anything.3. The 3D part.  I still have not figured out the glasses that came with it.  I can't tell when they are on or off.  I have to set the tv for 3D before I watch 3D and when I do, I can't read the screen with or without the glasses and I tried all four 3D modes.  I'll have to look at this some more.Update: Today I decided to figure out the 3D and I'm glad I did.  I started the Explore 3D app and selected a video to watch.  Then I pressed the 3D button on the remote, then I pressed the button on top of the glasses and wa-la I could see in 3D.I'm impressed.  Samsung has a video on their too and I liked it a lot and I could watch it all day.  Some of the others made my eyes tired though.  I guess it depends on how good the 3D video is.  I really like it and just ordered another Samsung 3D TV.  *also noticed the 3D glasses would turn itself on and off when the video ended and another one started... that was nice.", "Date": "November 13, 2012"}, {"Title": "Amazing HDTV...with some flaws...Review UPDATED", "Author": "TomB", "ReviewID": "R3RSZ6GDQPNJVR", "Overall": "4.0", "Content": "This is an update to my initial review below.As most of you have read in the other reviews...there are software issues.  I have updated the software several times and there are still a few remaining software issues.  Amazon TV is a recent addition that should have been offered sooner.  However, when you attempt to open it the App says I need to perform an update.  I have tried and their are not any updates available.  The Netflix has a problem with syncing the audio to the video.  When this happens I stop the show and restart...this seems to fix it.  I know this is not an internet issue since I have blazing fast FIOS.  Still an awesome TV all said and done.****original review****This TV is awesome!Pros -Amazing picture qualityVery cool Smart TV featuresEasy to useGreat universal remote includedCons-The auto dim feature is lame.  I turned it off and quality was much better.The 3D conversion feature doesn't change the picture enough to make it worth using.If you want to see the true 3D potential buy Despicable Me.  Incredible!I highley recommend this TV.  Awesome value too!", "Date": "September 4, 2012"}, {"Title": "Samsung, that's all that needs to be said", "Author": "Donna  Sturridge", "ReviewID": "R3QCITD9Z9FAYD", "Overall": "4.0", "Content": "Excellent tv, I only wish the Samsung logo lit up when tv is on.  I would recommend to anyone in the market for a tv", "Date": "April 12, 2013"}, {"Title": "a very nice TV", "Author": "Salzburg", "ReviewID": "R322Z61G9A8I9F", "Overall": "5.0", "Content": "We have had a hard time to look for a 32-Inch 1080p 120Hz 3D Slim LED HDTV (Black) for a long time.  Most 32-inch TVs in the stores are only 720p.  Finally we found this one online.  We loved it.  We also bought a full-motion wall mount from Amazon (with a great price as well).  In addition, 2pairs of 3D glasses were included.  We really enjoy it.", "Date": "April 4, 2013"}, {"Title": "Nice tv but not so smart", "Author": "Michael J. Troutner", "ReviewID": "R3OZ8WO4MATC44", "Overall": "2.0", "Content": "Not sure what the problem was but the smart stuff (online content) worked a little then some of the apps stopped working.  Also, the volume on the remote stopped working.  Turned TV off/on and it was working again.  Later stopped working again (both times the TV light was flashing to indicate it was receiving the data.)They really should send you an actual full hard-copy manual.  The TV-based manual is no-bueno.  Need the little book in your hand.  3D part (on Black Ops 1 / ps3) worked great.  Still laggy but not sure if that's primarily TV or just LED technology in general.Returned TV.  Amazon is great, make returns painless.  Give them 5 stars.", "Date": "March 4, 2013"}, {"Title": "So, So", "Author": "gary", "ReviewID": "R1M2BGI29FHB0W", "Overall": "3.0", "Content": "I found this set too fussy to set up. It has many features that may be fine for an enthusiast but I just want to watch a TV and be able to learn it quickly. The volumn control feature is terrible, the remote must be repeatedly pressed to adjust. The picture and performance is fine for me but then again the old tv's of the time were also fine. I am a fan of the 4:3 screen format and don't care what the industry thinks we should watch. If something comes on that doesn't fill the screen I paid for, I change channels. I do own a set that I can set to automatically blow the picture to fill the screen. Love that cheap old Phillips set.", "Date": "December 28, 2012"}, {"Title": "Perfect", "Author": "Krasimir Vechernikov", "ReviewID": "R31PDXGV7NUZP2", "Overall": "5.0", "Content": "I like this product it's working perfectly, came in excellent condition and that's the reason to like it, Recommend it.", "Date": "December 25, 2012"}, {"Title": "UN40ES6500", "Author": "gtncl", "ReviewID": "R1OCPGYKDEG0Z", "Overall": "5.0", "Content": "I am most delighted with the purchase of this television. This is my second Samsung HD TV. If you follow the hints on the settings from a previous review of this television, helps alot.", "Date": "June 18, 2012"}, {"Title": "apps and software is a joke!", "Author": "marekpg", "ReviewID": "R1E3V026WG70S0", "Overall": "1.0", "Content": "Design - 10, Picture quality - 8. It would be a good TV if not for the ridiculously crappy software. The on-screen keyboard is painfully difficult to use. Samsung apps are simply unusable. You tube app did not play the last 10-20 seconds of some videos. Netflix apps worked good until Samsung did the upgrade. It is OK for basic cable, but avoid if you would like to use streaming apps.", "Date": "October 12, 2013"}, {"Title": "best thing for my room", "Author": "Steven W. Zgonce", "ReviewID": "R2GYRTC9V5MJZJ", "Overall": "5.0", "Content": "Love the tv. got it so i dont have to move my ps3 to get netflix on it. the 3d works flawlessly and the other apps are pretty sweet. well the free ones at least!", "Date": "November 30, 2012"}, {"Title": "nive tv", "Author": "Ann", "ReviewID": "R3A4EQ8HNDJY3H", "Overall": "5.0", "Content": "great size, great features, nice design, great picture, color, its looking at life itself, games look good, led backlight amazing. and fast delivery", "Date": "November 28, 2012"}, {"Title": "Easy to set up, fantastic picture and not bad sound", "Author": "Patrick Higgins", "ReviewID": "R1OECVFAK7E4SD", "Overall": "5.0", "Content": "Easy to set up, fantastic picture and not bad sound. Everything we hoped for in a stylish design.  Swivel base is useful when plugging in accessories and makes access to side easier..", "Date": "November 26, 2012"}, {"Title": "Samsung UN40ES6500 40-Inch 1080p 120Hz 3D Slim LED HDTV (Black)", "Author": "Antonio Guerrero", "ReviewID": "R39K8KSWS45CV4", "Overall": "5.0", "Content": "It's a wonderful Smart TV, I really have been enjoying it with my family, specially my children. They do not want to use their own TV.", "Date": "November 5, 2012"}, {"Title": "Great Service", "Author": "SevenCityJP", "ReviewID": "R1Q3J5OQZLKC9M", "Overall": "5.0", "Content": "Fast and accurate delivery.  Delivered within the time specified.  The TV is awesome! Clear picture.  It could be a little louder when using Netflix, but other than that, its perfect.", "Date": "August 12, 2012"}, {"Title": "Good TV!", "Author": "Bigmac", "ReviewID": "R2L296VHNVD7IP", "Overall": "5.0", "Content": "Not sure what the naysayers are talking about.  The picture is great and it sounds fantastic.  I think for a 32\" TV this is best in class.", "Date": "September 4, 2012"}, {"Title": "Not that great", "Author": "BLAW", "ReviewID": "R3NJPE1GW6ZPVJ", "Overall": "3.0", "Content": "I have a 8000 series 46\" and it blows this picture away!!!! I'm going to keep it, only because it beats the picture on my Samsung 50\" plasma and laziness to ship back. Next one will have to be higher model. This only has a 7 million ratio as my other 8000 has a 25 million ratio and that would the reason it has a better picture, and this would also be my fault for not looking into that prior to purchasing this one. But either way if you have an older tv and bought this one, it would be a huge difference.", "Date": "August 14, 2012"}, {"Title": "First impressions - to be revisited...", "Author": "Daniel Luechtefeld", "ReviewID": "R3GA68WKS2SL98", "Overall": "3.0", "Content": "Received mine today. The maturity of Samsung's SmartHub connected TV functionality was a major consideration for my purchase. Unfortunately, there are currently technical issues preventing the Netflix app from running.I spent over an hour on the phone with Samsung Support's call center in South Carolina, both Tier I and Tier II, with no success. My Netflix issue has been escalated to a Tier III escalation point, which will call back during the call center's working hours, 8-5 weekdays Eastern Time (I called near the end of their workday). They also indicated that they would address the issue with Netflix and with Comcast (my ISP). The possibility of having to dispatch a technician to manually install a software patch remains on the table.The Tier I representative reported that this set is new to their support knowledge base as of Monday 3/19/12; consequently, troubleshooting procedures are still being developed. Her troubleshooting flowchart reflected that, as it called for pressing buttons that are inaccessible on my model during certain steps.This review will be updated.", "Date": "March 22, 2012"}, {"Title": "Big Vertical Blue line", "Author": "Josefus", "ReviewID": "R2T29BI1DYHG6U", "Overall": "1.0", "Content": "I got this TV (UN60ES6500) on March, the image quality is good. Some shadows on corner, but ok.2 months later a BIG BLUE VERTICAL LINE appears on the center of the screen!!I'll keep you posted about Samsung warranty.-----UPDATE Jul 16thSamsung Latinamerica said that I lost de warranty because a bought the TV on NY then moved to Venezuela. So they gave me two options:  1) Return the TV to USA to get the warranty. 2) Call service center on Venezuela.The first option is too expensive; I have to pay freight to USA a return to Venezuela. I tried the second option, but they have no spare parts for my TV yet.", "Date": "June 16, 2013"}, {"Title": "Random Black Friday Buy", "Author": "G. Thomas \"Glo in Burlington\"", "ReviewID": "R1VU0B4G3U6YP7", "Overall": "4.0", "Content": "I do not watch TV.I do not have cable.I happened upon this on Black Friday and did an impulse buy.So far I have no complaints", "Date": "February 22, 2013"}, {"Title": "Rating", "Author": "M", "ReviewID": "R2E37HHEUBASO2", "Overall": "4.0", "Content": "Have taken more days to delever than what it was showed when the time of purchasing.But its acceptable and try to show the exact time at the first time.", "Date": "January 27, 2013"}, {"Title": "LED TV", "Author": "Jonathan Gonzalez", "ReviewID": "R2245JWD5FONTZ", "Overall": "5.0", "Content": "El tv samsung es un producto de excelentes características a muy bajo costo. Es ideal para habitaciones pequeños o para sala pequeña", "Date": "January 10, 2013"}, {"Title": "poor delivery service", "Author": "MJ", "ReviewID": "R390EXNEDZLTJU", "Overall": "3.0", "Content": "The TV seems fine but it was a long time before I was able to try it!It was supposed to be delivered, unpacked and checked out. Thought that's what came with Amazon Prime! But the delivery person just brought it in and put it down then rushed me to sign several forms attesting to the good condition of the set. I had to wait until I could hire someone to unpack it, lift it onto the credenza, and hook it up!", "Date": "December 27, 2012"}, {"Title": "Read this before you order *** Do not order this TV ****", "Author": "Brad Christiansen", "ReviewID": "R37T7DOECPJCJO", "Overall": "1.0", "Content": "I just put the second one back in the box.  The first one had a large blue line all the way down the screen.  The second one just delivered today will not power up.  This TV is a colossal waste of time.  With shipping and exchanges this took three weeks and I still do not have a TV.", "Date": "April 18, 2013"}, {"Title": "Samsung UN50ES6500", "Author": "suby", "ReviewID": "R1NGZ74U4YBAAR", "Overall": "3.0", "Content": "The hardware sent with TV were not the correct size. eight screws (all same size) were sent with the TV.  The four screws that goes on the back of the TV were OK but four screws that go on the cross leg (stand)were wrong size.  Either they sent the wrong stand or wrong screws.  The Samsung Customer care was no help.  Just went to hardware store and got smaller bolts with nuts to fix the problem.Did anybody else had this problem?Dod any body else had proble with Samsung Cutomer care (or nocare is the right name)?", "Date": "December 5, 2012"}, {"Title": "Samsung ES6500 good screen", "Author": "Carlos Montero", "ReviewID": "R2JHXSGYNEVJS3", "Overall": "5.0", "Content": "Actually had a limited budget to buy two of this model of Samsung, and see features and specifications rather than the model offered, the purchase and I'm pretty satisfied with the roles I've tried and enjoyed. In image I am a follower of this brand.", "Date": "May 1, 2012"}, {"Title": "BUYER BEWARE - A HORSE WITH 3 LEGS - Samsung UN32ES6500 LED HDTV", "Author": "Bangagong Getiton, San Francisco", "ReviewID": "R3TB4VN1EJORQO", "Overall": "1.0", "Content": "REVIEW UPDATE, BUYER BEWARE, March 20, 2013 -Today, a Samsung Consumer Product Support Tier 2 Representative telephoned me because two days ago I spoke with a Samsung Consumer Product Support Tier 1 Representative and requested to speak to a Tier 2 Representative. Today, after speaking with the Tier 2 Representative for about 20 minutes to find a solution that would allow me to use in-ear ear bud external speakers for totally private listening on the Samsung TV, the Tier 2 Representative indicated that ear bud external speakers are not compatible with the Samsung UN32ES6500F LED HDTV, which means that a user cannot listen privately to programming on this TV. Samsung has designed this TV so that it is not compatible with external ear bud speakers. The only types of external speakers that are compatible with this TV are home theatre speaker systems. If you buy this TV, and you want to listen to the audio through your ear bud external speakers that connect to the Audio Out Port with an audio cable so that the sound will not disturb or distract other people in the same vicinity as you, you will not be able to listen to the audio in private through ear bud speakers like you can in other brands of TV's such as Sony and Panasonic because the technology for private listening does not exist on Samsung UN32ES6500F LED HDTV. In the other brands of televisions, the user can connect ear bud external speakers with an audio cable to the Audio Out Port on the backside of the TV and can adjust the audio volume output between low volume and high volume with the use of the volume control on the TV's remote control. However, on the Samsung UN32ES6500F LED HDTV, the volume output through the Audio Out Port is permanently set at a very low default Level 2, which renders the volume so low that the user can barely hear the audio. The user cannot increase the volume level coming out of the ear bud speakers because Samsung has permanently set the volume at a very low volume. When one attempts to increase the volume output by using the volume control on the Samsung Remote Control, the user cannot adjust the volume. The volume is permanently fixed at a very low adjustable Level 2. The user will not be able to adjust or increase the volume level on ear bud speakers.ORIGINAL REVIEW, MARCH 16, 2013:I am ticked off at Samsung. I want everyone to know why.During the Christmas Holiday sales season, I ordered a new Samsung UN32ES6500 LED HDTV from Amazon.com on Nov 26, 2012 for a purchase price of $597.99 plus $3.99 for one-day shipping plus $51.17 California Sales Tax plus $8.00 California Electronic Waste Recycling Fee for a total cost of $661.15. Amazon.com shipped it on Nov 27. ONTRAC delivered it to my residence on Nov 28. The TV had a physical defect on the edge of the translucent polycarbonate or plastic frame that surrounds the display screen. An air bubble or pocket was evident inside the frame structure and looked as though it eventually might result in a progressive fracture of the frame over a period. On Nov 30, I telephoned Amazon.com Customer Support, reported the defect, and the Amazon.com telephone representative agreed to ship another new and identical Samsung TV at no charge to me. Furthermore, the Amazon.com representative agreed to have UPS pick up the defective TV at my residence and return it to Amazon.com at no charge to me. On Dec 4, UPS delivered the new replacement TV to my residence. After removing it from the Samsung shipping package and inspecting it, the replacement TV appeared to have no damage. I packed the defective TV in the original Samsung shipping package. A few days later, UPS came to my residence and picked up the defective TV for return to Amazon.com. As usual, Amazon.com Customer Service and Return Policy is SUPERIOR AND EXCELLENT. I tip my hat to Jeff Bezos and the entire Amazon.com organization - FIRST CLASS CUSTOMER SERVICE, THE BEST OF THE BEST.Pros and Cons, BUYER BEWARE - Samsung UN32ES6500 LED HDTV. In my opinion, Samsung practice is IRRESPONSIBLE AND DECEPTIVE:PROS:(1) Good picture quality.(2) Good color quality.(3) Very good detail in High-Definition programming.(4) Good sound quality and volume control in Samsung internal speakers after downloading and installing Samsung Software Update Version T-MST10PAUSC-1029.2, BT-G (via wireless connection between Samsung TV and my home network's Internet router).(5) Slim space-saving design.(6) Very good-to-excellent Samsung customer telephone support.CONS:(1) BUYER BEWARE - The TV set has no built-in amplifier for external speakers. When I connected my Panasonic RP-HJE350-K SLIMZ In-Ear Earbud Headphones to the Audio-Out Port on the backside of the Samsung TV and opened the Samsung Menu with the Samsung Remote to disable the TV's internal speakers and enable the External Speakers (my earbuds), I discovered that I could not adjust the volume of the earbuds. I barely could hear the audio because Samsung has pre-set the External Speaker Volume Level around a very low Level 2 default setting that makes the earbuds practically useless with the TV because my earbuds do not have a built-in audio amplifier, and the Samsung TV does not have a built-in External Speaker amplifier. I called Samsung Customer Support, and the telephone representative said that I would have to use external speakers that have their own built-in volume amplifier if I wanted to increase the Samsung External Speaker volume above the very low Level 2 default setting. I was very disappointed to discover this issue only after I had purchased the TV. Before I had decided to purchase the TV, I studied the Samsung User Manual at Samsung.com. Samsung fails to disclose clearly in the User Manual that the TV has no built-in External Speaker amplifier, and if the user wants to adjust the External Speaker volume above the very low Level 2 default level, the user must use external speakers or earbuds that have their own built-in audio amplifier. The failure by Samsung to make this disclosure in the User Manual in my opinion is IRRESPONSIBLE AND DECEPTIVE.(2) BAD BLACK COLOR - In the TV display, the color black does not look realistic. Depending on the video program, the color black at times varies from shades of a lighter gray to a darker gray. This TV does a very poor to mediocre job of rendering black in video images.(3) BUYER BEWARE - To put it in simple terms, in my opinion the built-in programs that I have used in the Samsung Smart Hub SUCK! I have used the Samsung Web Browser application to connect the TV to the Internet. I have used the Samsung Netflix application to connect the TV to my Netflix account. In my opinion, both of those Samsung applications perform less than very poorly. Furthermore, any websites that require Adobe Flash Player to integrate with a website for optimum performance of video and audio content will not function properly because Samsung has failed to include a Flash Player application in the TV's software programming. What a big JIP! Samsung claims that this TV is an Internet device with a Smart Hub that provides Internet connectivity between the TV and your third-party Internet Service Provider account. The TV does connect to the Internet, but the built-in Samsung Web Browser application, the built-in Samsung Netflix application, and the TV's incompatibility with websites that render best with a Flash Player are in my opinion a BIG SHORTCHANGE on the customer, like the horse trader that bought a ready-to race thoroughbred from a supposedly reputable horse breeder only to discover after he brought the racehorse to his stables that the racehorse had only 3 legs. It seems to me that the so-called Smart Hub is really a Dumb Hub. Today, if I decided to buy a new TV with Internet connectivity, I definitely would shop around and research what is available to find a better Internet TV before I would buy another Samsung UN32ES6500 LED HDTV.", "Date": "March 16, 2013"}, {"Title": "Compra TV", "Author": "Gustavo Vásquez", "ReviewID": "R1S61MZWCN6QMF", "Overall": "5.0", "Content": "Muy bueno, llego en perfectas condiciones, lo traje hasta Colombia por un courier y llego perfecto. Estoy disfurtandolo al maximo", "Date": "November 5, 2012"}, {"Title": "Corner Cutting, not cutting edge. Workmanship Issues, designed to fail.", "Author": "Cos", "ReviewID": "RZI9AUDJQ7CY0", "Overall": "1.0", "Content": "Updated 1/15/2013: I wish I could lower my review.  Set still not fixed.  I am on my third main board, samsung refuses to replace set, and gives me the run around. I have lost time out of work, samsung puts you on hold and acts like they have no idea there is even a problem.  Last tech wrote up the set was still not fixed, and samsung refuses to replace set.  Some one did call back once, left a number, refuses to return any of my numerous calls.  Samsung is terrible, the worst, do not buy anything from them, ever.It appears Samsung TVs have no quality control (other than the consumer being stuck with a defective product, so if you got a good one, you are very lucky, but I suspect you will have problems at some point). Right out of the factory sealed box, my brand new new PN64E8000 top of the line 64\" Samsung Plasma is defective. (My TV is similar to the UN65ES6500 in regards to the problem, which you will see if you read on).  It is extremely difficult to get an HDMI connection. I tried 3 different cables, different cable manuafacturors, lastest ARC and 3D cables, and all 3 HDMI receptor slots. This in itself took hours of my time. The 3 HDMI receptor slots are in a multi input bar, which moves when you press on it. Yes, it actually moves. This is the design flaw.  I went to a store that happened to be setting up a UN65ES6500, a near top of the line LED, It has a similar HDMI connector plate which also moves. I recomend you go push on one for yourself before you buy. You can actually move it with one finger. Any Engineer knows that moving connections is a poor design. The specs are bad and need to be changed before the problem will go away.  If everything is just right, it may work for a few hook-ups and un-hook-ups, but it is likely to fail, probably after your one year warranty is up. Samsung customer service sent me an email confirming they received my request for support, then they closed my ticket without fixing TV. They will not re-open a ticket, I am on my third ticket now. I evenually reached the Executive Customer Relations Department, who claimed fixing the TV was not their responsability (quoting some fine print in their home warranty policy like they new it by heart). Basically what you have is a large 64\" TV, which they will not touch or move in any way, you have to provide the labor to get the TV flat on a table so they can work on it. This may be acceptable to strong young people, but if you are older, you may have to pay $500 or more to have TV put up and down. So you either need to shell out cash, or call in favors, so Sumsung can stick you with the hardest part of the repair.  Oh, and good luck finding a place to store this thing while it is down and you are waiting and waiting for Samsung to send a tech.  If you live in a big city it may be quicker, but where I am, the closest shop is 3 hours away in each direction, and I live 30 minutes from a good sized city.  The TV is huge and very very very very delicate. I actually heard the unit crack while the TV delivery guys did their intial unpacking, and I watched them the whole time, I do not know how they could do anything different.  So basically every time you (yes you) have to move it (so Samsung does not have to take responsability for their delicate product) you take a good chance of breaking it.  The hardest part is lowering it down to a flat position.  It has no lateral rigidity, and you can hear and possibly feel the set strain no matter how gentle you are.  The movers I had handle TVs all the time and were very carefull. Well, Samsung eventually refered me to the Office Of the Present@Sea.Samsung.Com, who will not accept phone calls. Without HDMI this set has limited value. The internet features take forever to navigate. The duel processor system is slow, slow, slow, SLOW!  This is regardless of your internet connection speed, the TV is just to slow to deal with all the non-vaule software you have to get through.  Two worthlessly slow processors are NOT better than one good one. Perhaps they know the processors are crap, and that is why the offer the evolution upgrade pack that they plan to sell for large amounts of money, so you get to pay over and over. Once you get through the slow and hard to use process of locating something you might want ot see, it ends up either being a pay for service app or a short vidoe with several commercials (except U-Tube, U-Tube is pretty great, at least for now). So, I suspect Samsung deliberly has this approach of no quality control and then refusing to support the TV because they make money that way. All we can do is boycott all Samsung products and hope they go out of business, I suspect that they will never change a system that works for them. It may also be a good idea not to vote for these right wing Republican leaders have do not feel that consumer protection is the role of Gorernment. Oh, the voice control and motion control is crap, but the CNET reviewers also noted that, only they were very polight about it. Nice job with that CNET.Basically Samsung does not appear to inspect the tVs before they ship them out, at least not in a method that works. They rely on the comsumer to find the problems, then force the consumer to pay the most expensive part of the repair, which is hiring \"insured\" people to move the TV. Yes, I do recall that was one of their excuses, the insurance of moving the TVs was cost prohibative, that's probably because they make their TVs so delicate they break very easily, assuming it isn't already broken when you get it.", "Date": "November 21, 2012"}, {"Title": "Samsung Sucks", "Author": "Robert & Cora", "ReviewID": "R2F2RJC81RIZH", "Overall": "1.0", "Content": "I contacted tech support and it took almost 1 hour to talk with an \"expert\". After 20 seconds he said nothing was wrong with the TV. He refused to even check it out via built in wifi.I wouldn't take one of their products for free.Tiger Direct is very impressive,", "Date": "May 2, 2013"}, {"Title": "The item, I wanted long back. New TV.", "Author": "Harshadray M. Joshi \"H. Joshi\"", "ReviewID": "R2VCAA5FQEQT2B", "Overall": "5.0", "Content": "I wanted to have this type of tv long back, but as I had already one lcd big scree  tv I was hesitating to buy another one. But finally we decided to get one. As of now I am very satisfied with the performance, of course, I got it recently so we have to wait for other aspects of its performance.", "Date": "June 13, 2012"}, {"Title": "TV is good, useless if you want to use it for browsing.", "Author": "Souj", "ReviewID": "R2QK81E9FMOWQA", "Overall": "1.0", "Content": "It does not support flash or shockwave, pretty much useless for video viewing or streaming. Samsung don't claim as smart TV, it is not smart but stupid when it comes to browsing. Release a patch to fix the issue ASAP, other wise Google will wipe you off of the market.", "Date": "September 29, 2012"}, {"Title": "Waiting for Samsung", "Author": "Pen Name", "ReviewID": "R1OCN9KWWE4KWJ", "Overall": "2.0", "Content": "Bought the TV with the idea that I would use the RVU technology that the Samsung CEO promised would be in all the 2012 smart TV's to eliminate my directv set top box. After 6 hours of directv visiting the house and telling me the tv is not compatible, while at the same time Samsung customer service stating it is, I still do not have it activated.Also disappointed that HBOGO is not available on the TV even thought the previous years model has it. Seams like Samsung is taking a step back not including that.TV has a great picture and functions well, but empty promises may cause me to take legal action now that I am unable to return the set.", "Date": "April 24, 2012"}, {"Title": "Downgraded TV is correct as previous reviewer stated.", "Author": "Jeffrey Williams", "ReviewID": "R2ZWG0Y7HXAK92", "Overall": "2.0", "Content": "Replaced a Samsung UN40C7000 due to the left side of the panel failing, which was an amazing LED TV.  Would purchase another one if they still sold them. Unfortunately, Samsung has downgraded their 40\" line of TVs as another reviewer has mentioned.  This thing only has 3 HDMI inputs and no VGA port for hooking up a computer.  For $1,100 bucks it SHOULD have 4 HDMI inputs and a VGA port as their previous line did. Someone might say, why didn't you look at the specs first?  Well, I looked at the CMR ratings and all of the other specs.  I would have never imagined they would put out a 40\" TV in 2012 with only 3 HDMI inputs and no VGA port so I didn't bother checking that. I could understand if this was a 23\" TV, but it's not. This is supposed to be a PREMIUM LED TV!Picture quality is good, but not as good as the UN40C7000.  The screen is neither glossy or matte finish.  They are using a new semi-gloss screen to help reduce glare which will still allow it to produce good color depth.  The remote is also a downgrade. Feels like a cheap replacement universal remote you would pick up at a local store. The light function on it is also very dim.  All in all, this TV is about a 2.5.  It's way overpriced for the features on it.  Thankfully I purchased at a local store and plan to return it.", "Date": "April 18, 2012"}, {"Title": "sam", "Author": "FSM", "ReviewID": "RDEB0D1IXUWIZ", "Overall": "2.0", "Content": "Well it was too small for what I wanted and also I got a better deal.  Samsung is rated high with Consumers but so is LG for a 3D tv.................they were neck and neck in their ratings.", "Date": "November 20, 2012"}, {"Title": "Not what I expeced", "Author": "vrystaat", "ReviewID": "R2C932KDP6DAAE", "Overall": "3.0", "Content": "After months of research, I bought the Samsung Samsung UN55ES6500 55-Inch 1080p 120Hz 3D Slim LED HDTV (Black).I wanted to buy the 240Hz model, as the picture is clearly superior. I could not afford the 240 Hz, as it is a $1000 more.I did buy the long term TV insurance, as I had heard that it was a good idea.I also bought the Samsung BD-E5900 3D WiFi Blu-ray Disc Player, and the Direct TV Plus HR24 HD DVR.I had the Geek Squad install the TV, and I'm most dissatisfied:- No speaker hookup- Tivo not connected to satellite- Tivo not connected to telephone line- No 3D on the television.Only two 3D glasses were provided (advertisement says 4 are provided)I'm bringing the Geek Squad back.PROSBeautiful picture.CONSNo visualization of 3D moviesComplex use with 4 remotesThe speaker hookup at the rear of the TV cannot be muted.Use of menus and tools is hideously complicated. There are no manuals available.For example: the 3D viewing is split in half, the screen picture is too small and I can't fix it.For me to reset to factory settings is not possible, as I do not have the code (and can't find it).CommentsI think a more professional setup is needed (not the Geek Squad)The Tivo is a problem, and I think I will have move it to another TV.The Tivo menus are far superior to Samsung's.ConclusionAn imperfect TV, but it is the best amongst a series of bad other manufacturers.Buy the Tivo hookup from Direct TV instead of the Direct TV box (Tivo Premiere XL4 TCD758250 HD Digital Video Recorder)I will report back.November 2012:I am still not able to manage the settings on this TV. This is a big drawback, and I am now not recommending this TV.", "Date": "October 11, 2012"}, {"Title": "Don't buy if you are planning to use it in India", "Author": "Hemanth Reddyshetty \"Hemanth\"", "ReviewID": "R3LOT8MGNA5IXK", "Overall": "3.0", "Content": "I bought this Television to use it in India. However, after I got it to India, I realized two things:1. The TV has an input of 100V, whereas, in India the input is between 110V-240V.2. The TV has 120MHZ frequency, whereas, in India this frequency is not supported.So, I strongly recommend you to look for other options, if you are planning to buy this for India.", "Date": "October 5, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Smart Content with Signature Services\nBuilt-in Wi-Fi\nWeb Browser\nFull HD 2D and 3D\nTV with stand (Width x Height x Depth): 29.3-Inch x 20.3-Inch x 9.5-Inch, TV without stand (Width x Height x Depth): 29.3-Inch x 17.7-Inch x 1.9-Inch\nBuilt-in WiFi\nFull HD 2D or 3D with Clear Motion Rate of 480\nSmart Hub", "Name": "Samsung UN32ES6500 32-Inch 1080p 120Hz 3D Slim LED HDTV (Black) (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/51b2mNksCiL._SX300_.jpg", "ProductID": "B007BG3FE4"}}