{"Reviews": [{"Title": "Good tv but poor item description...", "Author": "Laura", "ReviewID": "RUZ7CHLR8J78S", "Overall": "3.0", "Content": "This review is for the Coby 32\" 60Hz LEDTV3256 that we received on 2-26-13. I say 60 Hz because the item description is wrong and the tv is actually only 60Hz and not the 120Hz tv as the description says. I don't know if this was a screw up by amazon or coby but somebody messed up somewhere. Now the tv isn't a bad tv for the price. The picture and sound are really good and the led backlighting gives a rich vivid picture.  If it wasn't for this and the 2 bad pixels in the lower left corner of the screen i would have given this tv a 5 star rating. All in all though for the features and the size it's a good bang for the buck. Just over a year ago i paid the same price for a 24\" viore with only 1 hdmi port.Here are the tv's specifications from the box since it's not on the technical details part of the description.Display Type:  31.5\" TFT LCDResolution:  1366x768Backlight Type:  LEDContrast Ratio:  3000:1 (Typical)Brightness:  300 cd/m2Response Time:  6.5 ms (Typical)Pixel/Dot Pitch:  0.17025 x 0.51075 mmTV Tuner System:  ATSC/NTSC/QAMDTV Resolution Support:  480p, 480i, 720p (Native), 1080p, 1080iA/V Input:  RF Antenna, HDMI w/HDCP Support x3, PC VGA + 3.5 mm Stereo AudioRCA Component Video + Stereo Audio (Shared), RCA Composite Video + Stereo Audio (Shared)A/V Output:  Coaxial Digital Audio, RCA Stereo AudioSpeakers: Stereo (10 Watt x2 Total Output Power)Additional Features:  3D Digital Noise Reduction, V-Chip SupportPower:  AC 100-240V, Max Operation 60W, Standby; <0.5wUnit Dimensions:  (WHD)  29.25\" x 17.7\" x 1.75\"  Base Depth is 7.9\"Weight:  15.43lbs.Mount Support:  100 x 200 mmAlso the batteries are AAA and not AA like the technical details say.", "Date": "February 26, 2013"}, {"Title": "Met my desires in a tv.", "Author": "Ma Kettle", "ReviewID": "R1AL7XXPY6SY0L", "Overall": "5.0", "Content": "I have this tv in my bedroom. So far I am very pleased. The picture is very clear, colors are bright, and the tone is great.", "Date": "August 25, 2013"}, {"Title": "There is a black line on the screen", "Author": "zongping xie", "ReviewID": "R21TZHPLFLPA49", "Overall": "1.0", "Content": "There is a black line on the screen! I asked for return! After 20 minutes being turned on, the black line is still on there.", "Date": "March 17, 2013"}, {"Title": "Not as discribed", "Author": "matthew martin", "ReviewID": "R3OJ4CC3KA6PC1", "Overall": "3.0", "Content": "When I bought this discription said it was a 120Hz LEDTV, not what it actually is. 60Hz, good picture for what it is though.", "Date": "March 7, 2013"}, {"Title": "This item was so bad that it makes me re-consider doing business through Amazon.", "Author": "Just \"Jayme\"", "ReviewID": "R3SM1DRZ345KLE", "Overall": "1.0", "Content": "I love Amazon for most things, but buying a large television will not be one of them in the future. After plugging it in and hooking the cable up, I turned it on to a black screen. This ended up being a sequence issue, you have to turn the TV on before the cable or it won't get the signal, right? I don't know, I contacted the seller and asked for a refund, the shipping ended up being half of the cost of the TV! Well I figured I would just make due, and see if I could live with it. Did I mention that this particular model has a REALLY crappy picture yet? It was like watching a video that was shot with a very soft focus (spend the extra money and get an HDTV). So after about a month of tolerating a REALLY REALLY crappy picture and a temperamental television I start noticing little green dots, like a starry night, when very dark scenes were on. Then literally just over one month after purchasing this, the television developed green lines across the horizontal axis and the image began freezing and breaking up. VERY VERY disappointed with this purchase, First the return was authorized but without shipping, and then the shipping ends up being over half of the cost of the purchase.  My recommendation would be to first go and see what the picture looks like in person at a store. I would have NEVER picked this one out it had such a crappy picture! Go with the HDTV, it really does make a difference. And then my beef with Amazon over this is that if something goes wrong you are on the hook for shipping it back, and that can be spendy!Dispute proceedings to be initiated. Pinnacle Deals will hopefully make things right.", "Date": "October 17, 2013"}, {"Title": "TV for my son", "Author": "Silvy", "ReviewID": "RVEYLPZVFRYV3", "Overall": "5.0", "Content": "My son really likes the tv :-) Great purchase at a reasonable price.  We are very happy with it, so far so good!!!", "Date": "October 10, 2013"}, {"Title": "Very  nice for the price.", "Author": "hope h", "ReviewID": "R1ZU7QCPWL2ISA", "Overall": "4.0", "Content": "The sound is fine for a smaller room.  Not unexpected.The quality of the TV is good.  The black is a little saturated.  But other than that, it's a perfect TV.  Plenty of input/outputs.  I highly recommend it.", "Date": "August 3, 2013"}, {"Title": "Great TV for the Money as described", "Author": "Zanderdog", "ReviewID": "R38JTW6QHFQL6U", "Overall": "5.0", "Content": "This is an edge lit (slim LED) vs. a lot of what you see in this price range is FAT DLED product.  60Hz on a small screen like this is fine, most people can't see the difference of 120Hz on this size, that's why very few manufactures actually produce 120Hz in a 32\" or smaller size.  720p same thing, just don't get the benefit on a 32\" or smaller screen.", "Date": "April 17, 2013"}], "ProductInfo": {"Price": "$269.99", "Features": "Widescreen LED 720p HDTV\nBuilt-in digital TV tuner (ATSC/NTSC/QAM)\nPC VGA connection for use as a computer monitor\nPremium sound powered by SRS Labs\nDigital noise reduction", "Name": "Coby LEDTV3256 32-Inch 60Hz LED-Lit TV", "ImgURL": "http://ecx.images-amazon.com/images/I/510gDWW3NUL._SY300_.jpg", "ProductID": "B0085RUQH2"}}