{"Reviews": [{"Title": "A hard working over achiever", "Author": "Ammy_Evaluator", "ReviewID": "RBV652874T4NY", "Overall": "4.0", "Content": "This Westinghouse is one surprising TV. It delivers great performance in a slender package and at a decent price point.What works well?###########++ TV is ultra thin, and attractive, with a really unobtrusive bezel with a nice knurled finish.++ Setup was a breeze. Fasten the base using 4 screws, connect your input devices, and power up!++ Uses a faster refresh rate of 120Hz to reduce motion blur.++ Default picture settings were more than adequate.++ The control menus are very intuitive (except for a couple of picture controls found in the Power Settings menu).++ Impressive array of connection options. You have a coax input, a VGA input, 2 HDMI inputs, and even a composite video input.++ Excellent remote design. There are a ton of hard buttons for common uses - which means less hunting through menus. You can pick the input, turn on CC, change the aspect ratio, display the program guide, mute audio, and more, just using these hard buttons.So what doesn't work well?##################-- Sound output is its Achilles heel. As with most other flat panel TVs, you really need an external amplifier.-- Its controls provide only a limited range, which is a problem if you are really picky about your picture.-- No component video input.Conclusion########Overall, its picture impressed us - right out of the box. Colors were natural, black levels looked spot on, and even the color temperature looked just fine. We are using this in our fitness area, where it works great. Given what it delivers, this is definitely a 4-star product. Slightly better audio and more video control range would have made this a truly exceptional TV.Notes##### I am using the Paper Thin Leaf Indoor HDTV Antenna to receive over-the-air HDTV channels.# I was a bit upset by its distracting power light, but was overjoyed to discover that I could turn it off! Another example of great usability design by Westinghouse's engineers.# Another nod to usability is when changing the setting of any control, such as brightness, contrast, etc. In addition to the usual bar that shows the current setting as you change it, the TV also displays the original value before you began making your changes - allowing you to easily undo changes.Happy TV Viewing!", "Date": "August 23, 2012"}, {"Title": "Solid, Nice Looking, LED TV", "Author": "prisrob \"pris,\"", "ReviewID": "RY2KSWY5RZZW0", "Overall": "4.0", "Content": "Overall  this Westinghouse LED TV seems like a pretty decent TV.  The picture quality is quite nice. The sound is not quite where It should be. Wouldn't say it's bad but it sounds a bit tinny and voices can be low while other sounds are loud. The speakers are rated at 10watts each.One odd thing has to do with the physical screen depth. It has a very thin profile on the upper half as most LED backlit TVs do, but the lower half ends up being quite fat because of the speaker housings. The top is about 3/4\" thick, while the bottom balloons out to 2-3/4\". This may not sound like much but if you planned to mount it to a wall and wanted a very flush look, this set is not for you. Not a problem if mounted to the table stand, however.  The listing claims a 'super slim 1.5\" edge profile, with a Maximum thickness of 1.5\" for an easy fit in any space or on any wall'.My son noted that it comes with a very primitive remote control. It has all the functions you might want, but it will only control the TV (not other devices as some do) and it is not an example of good ergonomic design. It also feels quite flimsy and may not hold up well to heavy use. It'll do the job, but not much more.While on the subject of remotes,  my son has used one of the well regarded Logitech Harmony universal remotes and has setup many different devices on it in the last 3 or 4 years with not a single bit of trouble. With this Westinghouse TV however he was unable to get the Power button to function at all with theHarmony 600 remote. All other functions from the original remote work just fine when programmed into the Harmony, but not power, which quite obviously is a very necessary feature. After some web research it became apparent this is a common problem with Westinghouse TVs and there does appear to be a work-around, though it requires the help of Logitech Support personnel, and he has not yet worked his way through their support backlog. If his web research is correct then he should get this working within a few days. Others would have given up in frustration.The set has a decent, though not extravagant, selection of inputs. I needed HDMI and Component inputs for the devices I wanted to connect. HDMI was no problem as the TV has 2 of those, but even though the listing claims it there are no Component inputs. So I had to settle for Composite (of which it has 1). It also offers one each of VGA and RF inputs along with a single analog audio out.The on-screen menu is graphically pretty but has just the basic set of options. You get the standard array of picture controls including Brightness, Contrast, Saturation, Sharpness, Color Temp and Hue, along with 4 presets. For audio you get Bass, Treble, Balance and the ability to turn the speaker or the SS3D feature off entirely as well as some presets. There are also general settings for Date, Display Timeout, Language, Power Light control, Dynamic Contrast control and Backlight settings.Basic is probably the word I would use to describe this TV set in general. It covers all the basics and does them fairly well. If you are looking for a solid nice looking LED TV at a reasonable price then this set will likely fit the bill.The pricing on this television seems to change. Before I received the set, the price was $499, then it went down to $399, and now it is $429.  So, check before you purchase to get the best price.Addendum related to the Logitech Harmony Universal Remote:  It took a lot of back and forth with Logitech support and they had to fix the problem on their end, but they finally got it corrected. You will have to get Logitech to apply the same change to their account.Recommended. prisrob 09-09-12Westinghouse LD-4655VX 46\" Edge-lit LED HDTVOriginal Brand New Westinghouse LCD HDTV RMC-02 Remote Control (5041811800) for SK26H590 SK26H590D SK32H540S SK32H590 SK32H590D SK32H590DA SK40H590D VK40F580D VK40H580D Ships from and sold by WennoW", "Date": "September 9, 2012"}, {"Title": "This is a great TV", "Author": "Elizabeth", "ReviewID": "RD377828PY6BW", "Overall": "5.0", "Content": "I've had this tv for about 6 months and it's great! No problems, no worries. One thing I would mention though is that Target also sells this TV, I got it on sale for $330, so there are better prices around (normally  I think it's $370).", "Date": "September 1, 2012"}, {"Title": "Broke after a month", "Author": "Concerned reader", "ReviewID": "R1JW5XOU0HXRPZ", "Overall": "1.0", "Content": "Bought this last month at Costco.  Great deal.  Super light and thin.  Seemed like a great TV for the price.  And then tonight, for no discernible reason, the TV screen light fanned out and the left side of the screen became dimmer than the right side.  Nothing seems to fix it.  Like part of the picture tube or whatever LEDs use to project the image blew out.  Thank heavens it's still within Costco's 90-day return window but too quick for a TV to act up.", "Date": "September 25, 2012"}, {"Title": "Best value for the price", "Author": "Ali Hamedi", "ReviewID": "RQXUPVJPAKOFE", "Overall": "5.0", "Content": "I have it in my bedroom wall and its perfect size. Knowing its 120hz motion rate, the picture is great, even in action movies. Sounds is good for a thin LED tv. Don't waste your money on a name brand like Samsung and Sony.", "Date": "October 22, 2012"}, {"Title": "Defective TV with Poor Sound", "Author": "Jason Keck", "ReviewID": "R1YAQEOGIZEI5H", "Overall": "1.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moQP5JU4S89CJ1embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moQP5JU4S89CJ1refresh_preplay() {\n\ndocument.getElementById(\"cv_moQP5JU4S89CJ1chiDiv\").innerHTML = document.getElementById(\"cv_moQP5JU4S89CJ1hiddenPre\").innerHTML;\n};\ncv_moQP5JU4S89CJ1refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moQP5JU4S89CJ1so;\t   \n\n\nfunction cv_moQP5JU4S89CJ1loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moQP5JU4S89CJ1so = new SWFObject(swfLocation, \"cv_moQP5JU4S89CJ1AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moQP5JU4S89CJ1so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moQP5JU4S89CJ1so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moQP5JU4S89CJ1so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moQP5JU4S89CJ1so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moQP5JU4S89CJ1so.setAttribute(\"height\", swfHeight);\n          cv_moQP5JU4S89CJ1so.setAttribute(\"width\", swfWidth);\n          cv_moQP5JU4S89CJ1so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moQP5JU4S89CJ1so.write(\"cv_moQP5JU4S89CJ1flashcontent\")) {\n          fp_resizePlayerSpace('cv_moQP5JU4S89CJ1', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moQP5JU4S89CJ1';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moQP5JU4S89CJ1', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moQP5JU4S89CJ1loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moQP5JU4S89CJ1\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m184EI73QC9XVX\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m184EI73QC9XVX\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1YAQEOGIZEI5H\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m184EI73QC9XVX/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moQP5JU4S89CJ1duration')) {\n      document.getElementById('cv_moQP5JU4S89CJ1duration').style.display='none';\n    }\n    cv_moQP5JU4S89CJ1loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moQP5JU4S89CJ1loadSwf(movieID, playerVersion) {\n   return _cv_moQP5JU4S89CJ1loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moQP5JU4S89CJ1newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moQP5JU4S89CJ1', 0, h);\n}\n\nfunction cv_moQP5JU4S89CJ1resetPlayer(w,h,bw,cc) {\n  cv_moQP5JU4S89CJ1newHeight(h);\n\n  cv_moQP5JU4S89CJ1so.addVariable(\"resetBandwidth\", bw);\n  cv_moQP5JU4S89CJ1so.addVariable(\"cacheCode\", cc);\n  cv_moQP5JU4S89CJ1so.setAttribute(\"height\", h);\n  cv_moQP5JU4S89CJ1so.setAttribute(\"width\", w);\n  cv_moQP5JU4S89CJ1so.write(\"cv_moQP5JU4S89CJ1flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moQP5JU4S89CJ1RollOverImg = new Image();\ncv_moQP5JU4S89CJ1RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81qf6g7efrS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moQP5JU4S89CJ1preplay = document.getElementById('cv_moQP5JU4S89CJ1preplayImageId');\nif (cv_moQP5JU4S89CJ1preplay) {\n  cv_moQP5JU4S89CJ1preplay.onmouseover = function() {\n    cv_moQP5JU4S89CJ1preplay.src = \"http://ecx.images-amazon.com/images/I/81qf6g7efrS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moQP5JU4S89CJ1preplay.onmouseout = function() {\n    cv_moQP5JU4S89CJ1preplay.src = \"http://ecx.images-amazon.com/images/I/81qf6g7efrS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moQP5JU4S89CJ1preplay.parentNode;\n\n  var cv_moQP5JU4S89CJ1currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moQP5JU4S89CJ1currentClick) {\n      return cv_moQP5JU4S89CJ1currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:11 MinsWhile this TV seems ok for the price, it has two MAJOR problems.1. The audio is TERRIBLE.  And I usually don't notice these things.  But when watching movies, i have to turn the volume up to hear the voices and then turn it down when there are other sound effects (music, car chases, etc...).  It's not acceptable.2. JUST after the 1 year mark (e.g. after my warranty ran out), the TV started doing very odd things.  It goes on by itself in the middle of the night.  It randomly loses the HDMI connection with the cable box.  And most annoyingly, it gets into a mode where the volume starts going up or down as though someone where holding down the volume button on the remote. It's like there is a ghost in the TV.This video is an example of my TV with a \"ghost\" in it.", "Date": "October 24, 2013"}, {"Title": "Great TV for the money", "Author": "Diana L. Haytko", "ReviewID": "R24ZRVPU0ZMJ7P", "Overall": "5.0", "Content": "I bought this tv two weeks ago on sale at Costco.  It was easy to set up, looked great right out of the box.  I must admit that I'm surprised by the quality given the price.  Love it.", "Date": "September 17, 2012"}, {"Title": "Faulty firmware is common with this model, but it is otherwise a good set", "Author": "Glenn", "ReviewID": "R31Y1IVYBGH5Y2", "Overall": "2.0", "Content": "At first, I thought the Westinghouse UW40TC1W was a great value. It is crazy slim and is more pleasing to look at (in terms of set aesthetics, with the picture off) than a few Sony/Samsung TVs I have seen. The picture itself is good with surprisingly not-terrible black levels (a very common issue with no-name sets). There are some questionable design choices (a backlight that is largely not controllable, settings that are hard to calibrate because numbers are not provided, etc) and the input selection is lacking, but I otherwise like the features. The sound is surprisingly adequate. Westinghouse's TV warranties and customer service are said to be atrocious, but I have not needed to rely on either. Unfortunately, everything is somewhat ruined by the TV's firmware issues (and reading through the some of the negative reviews for this set, it appears that I am not alone). When using a remote to control the set, either the included one or the one that controls the cable box I have hooked up to it, the set sometimes misreads commands as number presses and switches to the \"TV\" input (the built-in tuner which one would use if they received their signal through an antenna or coaxial cable; I should note now that if you want to use the tuner, you need to receive an activation code from Westinghouse's website). In effect, pressing any button is a game of Russian roulette: Will you be randomly taken to the TV input, disrupting your viewing, or will your command actually work? In fairness, this does not happen 99% of the time, but when it does it is incredibly frustrating. Another problem that appears more often is that the face buttons on the front of the TV tend to not work correctly. Pressing the \"input\" button on the front, for example, is likely to cause the set to flip out and reset to the default set-up menu. Given these issues, I CANNOT recommend this set to anybody (unless you will be setting up the set and seldom touching it), which is a shame given the good picture/sound and budget price.", "Date": "June 9, 2013"}, {"Title": "Good", "Author": "Max", "ReviewID": "R1RI0MOH3W9K4", "Overall": "4.0", "Content": "Hi, I just bought this Tv , hooked it up and it's amazing. The price is too good to be true. I was hesitate to buy it because of people sometimes their review is lie. See it for yourself.", "Date": "January 8, 2013"}, {"Title": "Great product", "Author": "schills", "ReviewID": "R34153DOV3D7M8", "Overall": "4.0", "Content": "It has delivered everything that I wanted. I bought it as a part time supplement to my normal TV watching station and the picture quality and sound match up pretty well with my more expensive set up. Would not feel uneasy recommending this product to a friend.", "Date": "October 8, 2012"}, {"Title": "Do not Buy - turns itself on, raises volume on its own, resets", "Author": "Amazon Customer \"music mom\"", "ReviewID": "R2GE9JVJW82NIL", "Overall": "1.0", "Content": "We bought this TV at Costco - actually we bought two, thinking the first one was just a lemon.  If you read the review from 10/1/12, the reviewer nails it.  It is as if there's a ghost living in the TV.  It turns itself on randomly.  It raises its own volume - all the way up - randomly.  And when you try lowering it, the TV fights against you and the remote to keep the volume high.  It also keeps defaulting to the cable menu, several times a day, so you have to keep resetting your cable choices.  At first we thought it was a faulty remote, so we took the batteries out of it...and the TV continued doing all of these things without a remote.I had Costco and Westinghouse on the phone one day.  The Westinghouse rep said she had \"never heard of these problems\", which is ludicrous considering several reviewers here have complained about the same problems.  After returning the second one we bought, Costco told us that many of these had been returned with the same complaints.  Its a shame because it has a nice picture and decent sound.  You're better off spending a little more, like we did, and getting a better TV.  We ended up with a 42\" Sony Bravia, 120 Hz like this one.  Much better picture and sound - no problems whatsoever.  Do not buy unless you don't mind being driven crazy by your TV.", "Date": "January 30, 2013"}, {"Title": "The reason for three stars", "Author": "Herbert L Hoos jr", "ReviewID": "R2QM7FYZ0TDKOX", "Overall": "3.0", "Content": "HerbieThe onLy down fall is the USB port is for repair only. Thought I could use it as an input. Other than that picture is great.", "Date": "January 2, 2013"}, {"Title": "fantastic energy savings and great picture", "Author": "L. Knights", "ReviewID": "R1YL2EV83LHRE8", "Overall": "4.0", "Content": "For the past 5 1/2 years I have been using a Panasonic TH-42PX60U 42\" hdtv. It's been working well this whole time and I wasn't sure how this Westinghouse UW40TC1W would measure up. When I received it I was pleasantly surprised. First it is much lighter weight and so much more reasonable for one person to maneuver around and if I'd like to mount it on the wall it seems much less likely that it would ever fall. It also has a slimmer profile so will look much better on a wall. As to the screen size, I really cannot tell the difference, they look the same. I measured them and it seems they are a bit less than 2\" different on the diagonal, but really viewing them side by side they seem the same.This tv costs a third of what I paid for the Panasonic 5 1/2 years ago. Really, I cannot believe the price difference. It also is very low energy. I looked up the energy costs of both tvs and my old one used THREE TIMES the energy of this one. The one thing that is not as good is the sound, but it's not important in my small apartment. If you were using it in a large living room it might become an issue, as might the fact that the remote has a very short range. It's supposed to be ten feet but I have had issues using it at less than that. Neither of these things is an issue if you have external speakers/surround sound and a universal remote.I had no trouble hooking up my apple tv and watched some netflix and youtube and everything looked great. Really like that there are two hdmi inputs and I think the remote is well designed (the interface, not with the range issue.) The connection of the base to the tv could be sturdier. Over all I am way happier with this tv than I expected to be and I am in love with the energy savings.", "Date": "August 27, 2012"}, {"Title": "Cheap Garbage", "Author": "Brian Cahill \"NJBarFly\"", "ReviewID": "R1SUK9S79JT6BZ", "Overall": "1.0", "Content": "The picture quality and sound on this tv was decent for about the first year.  After that, the tv stopped working.  They have no customer service to help you.  They simply put you on hold indefinitely, so there is no recourse other than to just buy a new tv from a company that stands behind it's products.  Avoid all Westinghouse products at all costs.  Just look at the other reviews for their other tv's.  Everyone is saying the same thing.  Cheap garbage.", "Date": "November 16, 2012"}, {"Title": "Slim & beautiful! - Great Controls and Speakers!", "Author": "KindlePad", "ReviewID": "R1ST43S4VT2EV", "Overall": "5.0", "Content": "11/1/2012 UpdateAfter using this HDTV for a month or so, I am going to give it a huge thumbs up for 2 things:1. Great speakers!! When I got it in, I plugged it right into a speaker system. That system died and I have been using it sans external speakers for a while and really am impressed by both the clarity of the audio (voices) and the overall surround quality. It's not as good as say some $300 external speakers but for an HD, these are the best built in speakers I have ever used.2. The Controls are really simple to use for non techie types and its very quick & easy to pop in and make changes and get out. I have a lot of respect for whoever thought the settings & controls layout through so well.-----Very nice HD tv here. Lots of nice HDMI inputs and digital audio outputs. The viewing angle is very nice. Only downside is the built in speakers aren't \"room filling\" but that seems to be the case with many HD's. It would be nice if they started putting more powerful speakers in these so you didn't have to automatically buy a speaker bar, etc.I found the picture clarity to be very bright and crisp. The thin-ness and light weight build made it very easy to wall mount.", "Date": "August 23, 2012"}, {"Title": "DO NOT BUY", "Author": "Razmig Arabian", "ReviewID": "RPDA3COI0FSSY", "Overall": "1.0", "Content": "I bought this TV on sale from Costco. It began flickering and having weird small issues during the first 3 months of usage. It then completely stopped accepting any HDMI signals. The volume increases randomly without me touching it. The TV turns off on it's own, then when turned back on it resets settings so you have to run through several menus before actually getting back to what you're doing. The audio is awful. It also has no component in.I contacted Westinghouse support 3 times before getting an email response telling me to contact Costco support, who in turn told me to contact Westinghouse. I reported Westinghouse to the BBB but I'm still stuck with this garbage TV, can't get a refund, and no one will service it.Avoid this TV or anything by Westinghouse at all costs.", "Date": "March 13, 2013"}, {"Title": "One star is over rating this TV - returning", "Author": "Debbie Rankin", "ReviewID": "R157X4JH3N6SMI", "Overall": "1.0", "Content": "Terrible quality picture; unusual connections on the side located where the walll mount goes.  The installer said he'd never seen a television like this one.  Don't waste your money.", "Date": "November 30, 2012"}, {"Title": "Great value, very glitchy", "Author": "Scott Burbank", "ReviewID": "R35RW2FDJPS9LR", "Overall": "1.0", "Content": "I bought this tv from from Costco for $349. The picture is great for the price but the TV was very glitchy. It turned itself on at night and kept trying to reconnect to inputs after I had already set them up. I called Tech support and they were clueless. I exchanged for the same model hoping for better results. Exact same issues. Finally returned it for something else.", "Date": "November 29, 2012"}, {"Title": "Beautiful TV!", "Author": "Douchey", "ReviewID": "RSRFQAP0817HZ", "Overall": "5.0", "Content": "Got this after seeing it in a couple stores next to various much more expensive TVs, with a picture at least as good, if not better, than all the others. We use it in the bedroom, so the complaints about the sound that others have made haven't been an issue for us..  It may not be the Bose system on the main TV, but aside from that the sound seems great to me. Overall a great buy!", "Date": "October 19, 2012"}, {"Title": "Terrible Product - do not buy.", "Author": "CL", "ReviewID": "R32ZZR148MT1EO", "Overall": "1.0", "Content": "All of the negative reviews about this television are absolutely true - I purchased this TV from Costco in September 2012. At first, it seemed like a good TV for a good price (minus the fact that there is only one RCA input so you can't, for example, have a DVD player and a Wii plugged in at the same time - no matter, I purchased a splitter for a couple of bucks that solved that problem). The TV worked fine for about a year. Then, all of the problems that other people have had started - the volume raises itself without prompting, the input changes by itself all the time - in order to correct this, I have to turn the TV on and off, which is extremely annoying. This can happen as much as 10 times in one hour. The TV also turns itself on at random times in the day, so I have to keep it unplugged when it's not in use. If I accidentally forget, I am woken up at 3am by the TV blasting on full volume. Customer service is absolutely terrible - the TV coincidentally started having issues after the initial warranty period was over. I purchased the TV from Costco, which extends the warranty to two years, but it still costs more than the TV is worth to send it to the manufacturer. Spend your hard-earned money on another TV - this has taught me to always read Amazon reviews before making any major purchases.", "Date": "January 14, 2014"}, {"Title": "Lasts just a smidge over a year", "Author": "Christopher Jackson", "ReviewID": "R2Z23ZMFKOOLM8", "Overall": "1.0", "Content": "If you want to watch tv for more than a year Don't buy this one. Coincidentally it went out 1 day after my warranty expired. I'll never buy Westinghouse anything again.", "Date": "January 10, 2014"}, {"Title": "Lucky buy, would wait today.", "Author": "Jon D", "ReviewID": "R3JNV1K8KWE5U1", "Overall": "4.0", "Content": "I bought this for $314 with one-day shipping the day after Christmas. Compared to the current price, WELL worth it. Having waited so many years without a nice TV, it's been fulfilling to finally get one I enjoy well. I have it set up in my room as both my TV, gaming TV, and computer monitor. On the computer monitor side, it's a little lacking because you can't hook your laptop up to the TV to play sound, you have to have separate speakers for your computer. Besides that, the internal menus are very limited, you can't do much to change the picture significantly, high-contrast images can make things look VERY dark at times. Also, the sound quality isn't stellar, it can sound \"tinny\" as another user stated. I wouldn't pay $470 for this today, but I'm overall happy with it as a product.", "Date": "June 3, 2013"}, {"Title": "Great", "Author": "MICKEYY", "ReviewID": "R2RQZKODEE5AYJ", "Overall": "5.0", "Content": "This is the best item i bought  I feel like I in a theater  it was easy to Conect With or with out Instructionc", "Date": "June 1, 2013"}, {"Title": "TV works well", "Author": "Patrick Healy", "ReviewID": "R19UFEAOC0RPOR", "Overall": "4.0", "Content": "I have had no problems with this TV. The picture and sound work fine for my 2 bedroom apartment. Don't buy the TV expecting a full range of options, but for what I got the TV for, I am definitely satisfied.", "Date": "April 24, 2013"}, {"Title": "Quality! No illusions here!", "Author": "miker67x", "ReviewID": "R120QFY7GFI12M", "Overall": "5.0", "Content": "I have read the reviews stating that the sound may be sub-par in comparison to name brand tvs, however its all bunk. This TV has everything that my friends TVs have and more. The LED is flawless. Picture - Flawless. Sound - nothing special, but on par! Don't expect a subwoofer level of bass though obviously. My friends are jealous about the price I got mine too!", "Date": "March 24, 2013"}, {"Title": "Poor Quality TV", "Author": "drcjo", "ReviewID": "R3GLPTWZA5ZGY7", "Overall": "2.0", "Content": "I bought this TV because it seem like a good value for the price, but it really is not a very good TV. It's day and date timer does not work at all, and when I contacted the company about it, they said it was just the way it was, I I should just get used to it.", "Date": "March 3, 2013"}, {"Title": "NICE", "Author": "Betty Ensor Thomas", "ReviewID": "RUF8LEC4P7XNG", "Overall": "4.0", "Content": "This is exactly what I wanted and the television works perfect except that when I turn it on it takes a bit for it to actually come on.  I use the T.V. remote to turn it on, but cable could be the reason for the delay.  I'm not tech savvy - it could just be me.", "Date": "January 28, 2013"}, {"Title": "Great picture and good sound.", "Author": "L. Autry", "ReviewID": "R2FTF7ZHAWUVA5", "Overall": "5.0", "Content": "This review was started after I owned this for all of three hours. So far, I've found this to have an excellent display and very good On Screen Display menus. Your $500-$1000 TV may or may not be better, but I feel I have a five star deal regardless. If I change my mind, I'll let you know.Today (11/17), I found that the mounting holes are not VESA standard. There are plenty of non-VESA compatible brackets available so I'm sure I will find one. For now I'm just using the stand.I started with two cons and I'm up to four. So far still not too bad.1. The manual says the USB port is for service use only.I have a Boxee Box and a Roku so no big problem.2. Changing OTA channels - you need to enter \"5.1\", not \"5\". Dynex defaults to \"5.1\".3. Non-VESA mounting holes. (266 x 275 mm)4. No component connectors. Amazon's \"UW40TC1W Select Specifications\" is wrong.Looking at the documentation, there is good possibility that a VGA tocomponent adapter may work.There are at least two available from Amazon. I ordered the one for $11.18 asI hope it has better shielding. I will report my success or failure.Amazon SKU B000I21Y9G $ 5.25Amazon SKU B00213KFHW $11.1812/2 - The TV does not shut off with no input and that is annoying. Went to Westinghouse Digital support web site and sent a message via a form.", "Date": "November 20, 2012"}, {"Title": "Good value for the money", "Author": "Fred Camfield", "ReviewID": "RYEQ44OK3SVHB", "Overall": "4.0", "Content": "I bought this from Target at a discounted price.  With shipping and sales tax added, it worked out to about the same as the Amazon price.  It was easy to assemble - you do need a small phillips head screwdriver to mount the pedestal to the base - I found that laying the set across a couple sofa cushions left me the working room I needed - a small packet of screws is included with the set (be careful not to lose the small packet).  I boutht it because it comes with a pedestal for setting on a low cabinet between bookcases.  The main problem is with the instruction booklet.  It is in fine print is four languages.  There was a large card in the box printed in a foreign language about connections to other devices.  It was an adventure pushing buttons to get it to come on with a picture, but I finally got the setup menu and it is working fine.  There is a short time delay for the set to come on, i.e., push the button on the remote and count to 20 (like my flat screen PC monitor, it is NOT instant on).  They could have had a little better 1, 2, 3,... set of instructions for getting started.As to operations, the picture does not always seem to fill up the full screen - that may be a function of what I am watching, but I will see with some use.  There is a slight time delay with a black screen when you change from one channel to the next, so you have to scroll somewhat slowly.  The picture quality is very good, and the sound is good.A remote control comes with the set.  Instructions are somewhat brief, but you can generally figure it out.  Some reviewers have described the remote as \"primitive,\" but it is about par for remotes.Other reviewer complaints appear to be about particular sets that may have individual problems from manufacturing or shipping.  There is a contact number if you have problems, included on a card in the box (this is on the big card with device connection instructions written in a foreign language).  There is a Web address for registering your set.", "Date": "November 7, 2012"}, {"Title": "Glitchy Product and Lack of Support", "Author": "S. Feuss", "ReviewID": "R2DIG47I43NOJ2", "Overall": "1.0", "Content": "First off, good picture and okay sound (when it works). I too, like may others on this list, have been experiencing the glitchy TV (assuming it's bad firmware) since day one. Unfortunately, as I did not have the receipt we weren't able to return the TV to the store. Every few weeks I attempt to call the customer service team at Westinghouse. They either A.) Never pickup, B.) Have no clue what the issue is, or C.) Never pickup. (Yes, I know -- I put that in twice because that's usually what happens more often than not.) I'm so disappointed in this TV, and will not purchase another Westinghouse TV EVER again. I'm going back to my Vizio. At least their service was on this side of the Atlantic/Pacific and they were extremely helpful. BUYER BEWARE! Cheap TVs, you get what you pay for...", "Date": "October 28, 2013"}, {"Title": "Great TV", "Author": "TC", "ReviewID": "R1YL3WTEPW3GET", "Overall": "5.0", "Content": "Great TV for the price. Was a Christmas present to ourselves. Have had it 4 months without any problems. Some reviews said the audio was suspect, but it seems pretty darn good to me. It was my 1st larger flat screen purchase, so maybe that's why I have no complaints.", "Date": "March 2, 2013"}, {"Title": "Replacement for an old tube TV.", "Author": "JannieinVA", "ReviewID": "R19DC18WXXA5UW", "Overall": "5.0", "Content": "The picture is sharp.  The sound is better than on our 46\" Aquos.  The price I got it for was really good.  It's a great buy and I'd recommend it.", "Date": "January 19, 2013"}, {"Title": "marlon", "Author": "marlon guilarte", "ReviewID": "R2EEVJ9O8WHGJA", "Overall": "5.0", "Content": "estoy disfrutando mucho de este televisor tiene una imagen espectacular el sonido es suficiente tiene muy buena resolucion lleno mis expectativas a cabalidad", "Date": "December 27, 2012"}, {"Title": "Great LCD at a great price!", "Author": "Sorensam", "ReviewID": "RC3WJQKFAJDQ7", "Overall": "5.0", "Content": "I really really love this TV. I have it mounted to the wall in my living room and it worked with any wall mount i looked at. the picture is bright and crisp. I really love watching tv on it.My only wish is that it had more than two HDMI inputs. But with the money I saved I can get an HDMI switch!", "Date": "November 24, 2012"}, {"Title": "not a true 120 but still nice", "Author": "danielle", "ReviewID": "R16AT6QYZMW7JW", "Overall": "4.0", "Content": "this TV doesn't have that amazing, \"like I'm looking through a window\" clarity, but for the price it is still a good buy.", "Date": "November 14, 2012"}, {"Title": "TV acts on it's own", "Author": "alex", "ReviewID": "RWJPQ9G5T8MLL", "Overall": "1.0", "Content": "I am not sure if this is the exact model*** for my tv, but it's in the same price range, and brand, so i'm going to review it.There are ghosts living in my television. No, really. Multiple times it has turned on without us being in the room, or home. It will disconnect from the cable box randomly and i will have to reset the settings to get it to go back. One time, it happened about 6 times in a row... Both of these things can be chalked up to a ghost... or a neighbor with the same remote.Additionally, our tv also has had the habit, from almost day one, of getting insanely loud and dimming simultaneously. I will have to shut it off super fast and by the time i turn it back on, the volume returns to it's original level. Last night, it happened 3 times within an hour an a half. It's obviously not a neighborhood problem.All in all, i wish i could take this TV back to costco and i would never recommend it.*** Update: Do to super-exciting-and-constructive feedback, i checked the model and this is in fact that model i own & hate.", "Date": "October 1, 2012"}], "ProductInfo": {"Price": "$499.99", "Features": "The 1080p 40-Inch Westinghouse LED TV is feather-light at a mere 29.4 pounds.\nLarge viewing area and dynamic 100,000:1 contrast ratio to ensure movies and games look their best.\nTV Tuner Capability: NTSC/ATSC, Component: 480i, 480p, 720p, 1080i, HDMI: 480i, 480p, 720p, 1080i, 1080p, PC: SVGA, XGA, WXGA, Optimum Resolution: 1920 x 1080", "Name": "Westinghouse UW40TC1W 40-Inch 1080p 120Hz LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/31Pt3f7WI7L._SX300_.jpg", "ProductID": "B008J127IA"}}