{"Reviews": [{"Title": "Very happy with this TV", "Author": "Me \"Dog Lover\"", "ReviewID": "R15L8FCWFHKF38", "Overall": "4.0", "Content": "I am on a small budget so basically bought the cheapest 39 inch tv that I could find.  The tv was easy to set up.  At first I was disappointed with the picture quality until I figured out that there are different channels on my basic cable for HD. Once I figured the correct channels for the shows I watch I am estatic at the quality of the picture.  I don't have any problems with the sound, it is equal to the sound on any other basic tv I have had.I would like a remote control that was programmable for my favorite programs.", "Date": "January 12, 2013"}, {"Title": "Only lasted 12 days", "Author": "J", "ReviewID": "R11C1TJ8UDVNRS", "Overall": "1.0", "Content": "Do not waste your money.We bought this TV on Feb 2nd.  By February 14th, it would no longer turn on.  IT HAD ONLY BEEN 12 DAYS!!  We called Magnavox, and they told us they would send us a box for us to return it to them. (This took 2 weeks)  So, we send the TV back, then it takes them 3 more weeks to send us our new TV. We've now been without a TV for 5 weeks.  Only when we opened the box, we realize this is not a new TV at all.  It is scratched all the sides & on the front.  We call Magnavox again, and they say it is not their policy to send new tvs.  They will only send us a refurbished TV.  So, we paid $300 for a brand new TV that lasted 12 days, then 5 weeks of no TV, only to get a used TV.  I will NEVER buy anything from Magnavox again.  Don't waste your money.  They have HORRIBLE customer service.", "Date": "March 19, 2013"}, {"Title": "Great bedroom TV", "Author": "N.V.", "ReviewID": "R36AP6DSQ3VQPR", "Overall": "5.0", "Content": "We purchased this TV to replace a smaller non HD one we had in our bedroom and are pleased with it. It's a simple to work TV and we don't seem to have some of the issues others are having. This is our 2nd HD LCD TV and compared to our Vizio it's pretty basic, but that's not saying it's a bad TV at all.*Sound - For a large room I can see turning this up higher and the sound quality going down, but in a bedroom at around 15-20 ( the setting goes up to 100 which we would never have a need to ) it works just fine. Due to previous experience with our other TV we learned that some of the \"sound issues\" people are having could be from the True Surround ( ON -kicks out a little more sound. OFF -sound is a little flat) or the Auto Volume Leveling ( ON -seems to lower the volume drastically, we had the TV set to 12 and it was fine but when we turned this feature on the sound was equal to 5-6. This feature was introduced a while back to combat the jerk commercial makers that have their commercials broadcast at higher volumes because they figure if they talk louder we will want to buy whatever it is they are selling. It's kind of like someone talking louder and slower to someone that doesn't speak the same language as they do....it doesn't really change the fact that they don't understand your words. There has been talk about something being passed to make it so this can no longer be done with commercials. OFF -you get more sound but may have to deal with annoying commercials being louder. There is a digital coax output in back to connect to a theater system and a standard headphone jack.I am pleased with this TV and would recomend it to someone looking for a 1080p TV that's not tiny or huge for a bedroom.*Picture is crisp and can be viewed as well as you can see yourself from the side. The image does not fade out.My only complaint is the remote layout. The arrow selection buttons are at the bottom of the remote and the source button is clear at the top. I feel the source button should have been by the arrow buttons for quicker and more natural use. Three extra source buttons would have been nice ( HDMI, TV, Component) to quick select source options. This bugs me but it's pretty minor and if you are using a universal remote you may not have this problem at all.", "Date": "February 12, 2013"}, {"Title": "Good Value but.....", "Author": "John Hamlett", "ReviewID": "R1535312AHHUGO", "Overall": "3.0", "Content": "Bought this at my local Sam's Club as a kitchen TV and for that purpose it works fine however....like most flat screen TV's the sound is weak to tinny and has an irritating vibration at times.  I attempted to fix this with a sound bar then discovered the Magnavox does not have any appropriate audio output connections.  No HDMI or digital output.  Using the only available component outputs resulted in no improvement so the sound bar went back to the store.Since this TV is used over-the-air I was also expecting a program guide similar to what the digital conversion boxes can display and was disappointed that nothing like this exists.  The TV will display the show title and description but only when actually tuned to the station in question and only the active show is listed.It has a USB port but can only display JPG still images.  No video (like from a flash stick) and no other formats.  I have not used the other inputs (HDMI, digital or PC) so can't comment on them.The TV has an excellent picture and is easy to set up and use.  As a second TV in bedroom or kitchen it is fine.  I would not recommend it as the sole HDTV though.", "Date": "October 25, 2012"}, {"Title": "Marred pannel", "Author": "Froggy", "ReviewID": "R27PSW15HUPC75", "Overall": "4.0", "Content": "The tv functions pretty well  and is fairly easy to use I was not too happy with some small marring and scratches below the viewing screen evidence appears to be not a factory source of supply but from kmart box was not sealed very well for shipment  everything works well screen in very good condition.", "Date": "June 5, 2013"}, {"Title": "6 month TV", "Author": "joed", "ReviewID": "R1HC7F4EKS4KMT", "Overall": "1.0", "Content": "Bought this TV at Christmas 2012 and it quit working May 30th. Called customer service and they said it would be $110 to send a box to ship it back and receive a refurbished TV, the same experience that previous owner had cited only since the warrenty was only 90 days it was not covered. Very dissappointed as the TV was a great picture and fit the space we had perfectly. Decided not to pay $110 for a used TV probably worse than we already had.", "Date": "June 1, 2013"}, {"Title": "GREAT TV", "Author": "Brian Gore", "ReviewID": "R2Q1NWZRQ4AK95", "Overall": "5.0", "Content": "I AM SO HAPPY WITH THIS TV.... THE PICTURE IS CLEAR AND THE COLOR IS GREAT .... I USE THE HDMI HOOK UPS FOR A BETTER PICTURE AND SOUND QUALITY.....I'd Buy From This Seller Again", "Date": "August 11, 2013"}, {"Title": "Magnavox 39\"", "Author": "Maureena", "ReviewID": "R1HEU4L92EFMVK", "Overall": "3.0", "Content": "PROS:  Very easy set up and great picture.CONS:  Volume is problematic and not consistent in its malfunction.  Some stations seem fine.  Others, the commercials get extremely loud or extremely quiet.  During a series of commercials, one may be quiet, then one loud, then two quiet, etc.  The volume on TV stations also varies greatly from station to station.  Sometimes when there is background music on a show, the music is so loud you can hardly hear the voices.I am constantly adjusting the volume on this TV.There is no Guide available.  You can get info on the current show, but some shows will just say something like  \"Episode 56\" in the description of the show and the info doesn't indicate the year of the show or the time span (such as 11:00 - 12:00).", "Date": "November 28, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "LCD Full HD 1920x1080p Display\nTV Formats Supported: 1080p, 1080i, 720p, 480p, 480i\n3 HDMI Inputs\nPC Input via VGA and HDMI Ports\nTouch Sensor Keys", "Name": "Magnavox 39MF412B/F7 39-Inch 60Hz LCD TV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/318MCloUbjL._SX300_.jpg", "ProductID": "B0081XZILO"}}