{"Reviews": [{"Title": "Budget priced with all the options", "Author": "C. Hight", "ReviewID": "RAGZ9OI18EN0H", "Overall": "5.0", "Content": "I recently purchased this tv at a big box store. The picture is great and the controls are easy to use. Great TV for the money!Almost 2 months later the TV is still great! The sound is a little dismal but, I have a Vizio speaker bar hooked to it!", "Date": "August 16, 2012"}, {"Title": "Good for Dorm Room - Recommended", "Author": "C. Hill \"CFH\"", "ReviewID": "R2024ORMRYSVII", "Overall": "4.0", "Content": "This Emerson 22\" LED HDTV is a good basic TV that fits nicely in my daughter's college dorm room. We picked this up locally, when her old Polaroid TV stopped working, and it works exactly as we had hoped.This has good picture quality and decent sound for such a small TV. The remote comes with batteries and it provides the required functionality.This meets our needs in a small, inexpensive TV for a student's room.Recommended!CFH", "Date": "October 1, 2012"}, {"Title": "Emerson", "Author": "loomik", "ReviewID": "R2UCX0IWIYQQNQ", "Overall": "5.0", "Content": "Easy set up, beautiful picture & sound!!! Too many features to list!! Met or exceeded ALL of my expectations and then some!!!", "Date": "July 31, 2013"}, {"Title": "TV", "Author": "David Wheeler", "ReviewID": "R3F04JJNXEGJIZ", "Overall": "4.0", "Content": "Everything went fine with the getting the TV and it was in a pretty decent condition when I got it.  As for quality of TV, I have never tried an Emerson before and after having enough time to use it heavily I have to say that there are better TVs out there that will give you more for your money than this one.", "Date": "November 6, 2012"}, {"Title": "Good TV", "Author": "David W Sisk", "ReviewID": "R6AL9YV428NZX", "Overall": "5.0", "Content": "its a good tv except for one thing Amazon goofed and put up the wrong pic for the product Emerson 22\" LED 720p 60hz HDTV| LE220EM3 its showing speakers not the HDTV", "Date": "January 16, 2014"}, {"Title": "DO NOT BUY THIS!!!!!!!!!!!!!!!!!!!!", "Author": "Stephen Boncella", "ReviewID": "R1AGF50NT1CY1G", "Overall": "1.0", "Content": "I got this tv as an early Christmas present.  Next year, I'll just ask for a lump of coal.  The picture quality is real poor.  It's like watching tv through a cheese cloth.  The sound quailty is even worse.  I could be standing next to this peice of #F@!% and it sounds like I'm listening to it from a mile away.  The reomote barely funtions and trying to adjust this tv will NOT do any good.  About the only good thing I can say about this is that since it's a flat screen so in therory it should not take up that much room in a land fill.  I would NOT recomend this to even my worse enemy.", "Date": "December 3, 2013"}, {"Title": "Unhappy", "Author": "E. Colson", "ReviewID": "R2GQ7AEYA0PYH3", "Overall": "1.0", "Content": "I bought this TV in November 2011.  In October 2012, it quit working.  No picture.  No sound.  Will not turn on at all.  Customer support at Emerson is very poor.  I registered the TV as soon as I got it, but lost the receipt.  If I had the receipt, they would fix the TV or replace it for $70.  Since I do not have the original receipt, they will not do anything.  Registering it was a waste of time.  That is not sufficient.  The price of $188.00 on black Friday was good if the TV had continued to play but very bad for less than one year.  I do not plan to buy any more Emerson products.", "Date": "November 10, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "Emerson 22\" LED 720p 60hz HDTV| LE220EM3", "ImgURL": "http://ecx.images-amazon.com/images/I/51XCPGsfTEL._SY300_.jpg", "ProductID": "B008AM5B7W"}}