{"Reviews": [{"Title": "Surprisingly Great", "Author": "JP007", "ReviewID": "R1NF4E2KKVRUM6", "Overall": "4.0", "Content": "I was very skeptical of the sound quality of this tv in family room. My room has glass doors to the left an open kitchen to the right and open living room space directly behind the couch. So really had my doubts to whether I would still have a sorround type effect from my viewing and listening position. However I am able to hear voices and surround sounds as if my old Harmon Kardon surround system was still in place (which i also had difficulty hearing voices sometimes over other sounds.) And the sound is louder than what I need. I never have to turn the volume up more that half way. Picture quality is great too. I have read the tv is actually manufactured by samsung. You can probably buy a better picture tv and get a great component system for the same price if not cheaper though. However if you don't want to mess around with all that and just want one tv without the hassle of setting up a receiver and 6 different speakers this is a great option.  I give it four stars only because there is no Wifi in the TV.", "Date": "December 28, 2012"}, {"Title": "The best sounding tv on the market!", "Author": "Spartan", "ReviewID": "R3Q73PEOGAUCF9", "Overall": "5.0", "Content": "I went to the Bose store the other day and i saw the theater show that they had, and the VideoWave was the most amazing sounding TV I have ever heard. Like some other people have said already the TV is really expensive! but honestly what other TV  manufacturer has a TV that sounds even close to this? there really is none except for the Bang and Olufsen beo vision 11 which cost 15 thousand dollars! and the VidoeWave sounds better! so really this is a good price point.", "Date": "April 12, 2013"}, {"Title": "Awsume, Incredible, Wow", "Author": "dlesa", "ReviewID": "RNM823GEG6OGH", "Overall": "5.0", "Content": "After seeing and hearing this TV in the Bose store, I was a bit underwelmed. We where in the market for a new TV/surround system for our living room and in the past we have had a large screen TV with a Bose Lifestyles 25 (cira 2000) system so we where accustomed to haveing a nice sounding media center. The issues we shere looking to overcome with the new system where:1. Something to eleviate all of the speakers and wires that come with such a system.  6+ speakers and wires to power them, plus the head unit, and this is a simple system.2. Remotes, OMG, one for the TV, one for the Sound, one for the cable box, one for the Blueray, one for the Apple TV. Total of 5....wow.3. To have a much \"cleaner\" look to the LR with out all of these components out in the open for all to see as they must be for the IR remotes to function.As I stated at the begining I was a bit underwelmed seeing and hearing it in the store. The picture quality was great but it did not sound all that great, good but not great.What was interesting was the remote. One remote to control all of the components? Is that possible? and can put them in a enclosed cabinet so they are not visible?! (The Bose remote operates on a radio freq. instead of IR)So they offer a 30 day money back guarantee. I'll bite, when can you deliver and set up? (included in the price) Next day.... GREAT!Went to the furniture store to pick up the enclosed entertainment stand that hides all of the components that I had my eye on. TV will be the only thing sitting on the top of it!Next day the gentleman showed up and intalled the TV, all components in the cabinet and most importantly, cablibated the the TV and sound to the room it is located.Now for the ah ha moment. He turned it on and WOW, just WOW, the whole room was filled with sound!!! Incredible. It sounded so much better that it did in the showroom. Maybe all of the  backround noise in the store? or not calibrated the same? Dont know but it sounds great in the LR. No way this is going back!!!!Now for the remote. It is incredible. I can control all of the components and a connected Ipod with just one remote via the onscreen menus that pop up when using that component. It has to be experienced to trully appriciate.Now for price. It is expensive but consider what it does. One remote for everything. No speakers and wires hanging on the wall or sitting on a stand. Ya, you can intall speakers in a wall but you have grilles in the wall and how much does that cost to install, plus components and you cant take them with you if you move.This system is a true entertainment system, plays music(streaming and iPod, CD's), movies(streaming and DVD/Blueray).If your not a anal audio file or video geek and just want great sounding TV/music viewing experience, this is the system for the rest of us.I have owned this system since fall of 2012 and still feel the same way as the day it was delivered. If you can afford it, go for it.", "Date": "April 10, 2013"}, {"Title": "Cry Once", "Author": "Matthew Means", "ReviewID": "R3FN38QCBVDQJX", "Overall": "5.0", "Content": "We got this home theater system about two months ago and while it was expensive and I cried when I saw the bill, it was definitely worth the price. It is such an elegant and advanced system that calling it a TV is almost a crime. Unbelievable resolution fantastic sound and a simple, easy-to-use remote. You can stream from your iPad, iPod or iPhone wirelessly, it has a surprisingly robust set of features and you can tune the color and contrast effortlessly. I cried when I saw the price but this system will last at least ten years before the other companies begin to catch up. 5 BIG stars!", "Date": "January 12, 2014"}, {"Title": "Category of its own", "Author": "Randy C Linzel", "ReviewID": "R129KIEY8X1H99", "Overall": "4.0", "Content": "As an electrical engineer, I like to research products before purchase. In my consulting profession I make complex systems easier to use. Are there TV's with better pictures, probably. Are there sound systems with better sound, most likely. Are there remotes that have more buttons, most will. If you analyze a single feature, this unit may not be at the top but if you analyze the complete package and the typical user aged 5 to 85, many of whom want to watch or listen to something without having to call their recent engineering grad student, this unit stands apart. The remote is very simple with the TV providing the visual interface to the desired action. The integration of all the desired options is on par with what you get with an apple product. Your concern about what unit to turn on and which button to press to get the desired result is easy. The picture is very good. The sound is very good. The ease of use is in a category of its own. If you have the money, you'll be pleased with the end result. If you don't have the money, buy the pieces and call one of the experts that posted earlier to set it up and make tweaks in the future.", "Date": "December 23, 2012"}, {"Title": "staggered at the noise it produces.", "Author": "JoshStafford", "ReviewID": "R2ZSG2NLEW2BBY", "Overall": "5.0", "Content": "I was in the Bose store earlier and I sat in the theater to watch theyre little show and iam amazed! The picture wasn't anything special, but the sound is incredible. It probly cost Bose $500 to make the tv (if that) so I believe its way over priced, but how could anybody listen to that thing and not buy it? You could probly buy a tv for $800 and a nice soundbar for $300 and it would be the same, but the Bose tv means you don't have to deal with wires and all that.", "Date": "June 12, 2013"}, {"Title": "Bose has done it again? If you mean a joke on the public, then yes.", "Author": "Jane Doe \"Jane Doe\"", "ReviewID": "RQJESS88QRHHV", "Overall": "1.0", "Content": "**UPDATE** I dug out how to disable 'motion smoothing', or what we call in the trade 'frame insertion/motion interpolation' AKA the 'soap opera effect'. I also maanged to find some limited control instructions on the TV.Disable soap opera effect here: http://worldwide.bose.com/productsupport/en_us/web/videowave_46_series1/page.htmlQuote from the Bose site: \"Note: Movies will appear to be more natural and lifelike when motion smoothing is on.\" Which is amusing as how can a film, shot at 24 frames a second, (IE, the 35mm is exposed at 24 frames a second) appear more 'natural' and 'lifelike' when the 120 or so frames the Bose TV is making, literally out of nowhere inserted into the REAL frames be 'lifelike'? It's fake! Those extra frames never existed when say, Star Wars was shot decades ago!Then Bose states this rather telling sentence: \"However, you can set motion smoothing to \"None\" if you prefer to view films the way the director intended them to appear.\"Repeat: \"...the director intended them to appear\". Who knows best, the ARTIST, or the MESSENGER?To make the panel look slightly less crappy than it is already, here: http://worldwide.bose.com/productsupport/en_us/web/article_417_adjusting_basic_video_settings/page.htmlBose states: \"Your system comes from the factory with optimised bright and dark room video presets.\" Oh? That's good to hear. Optimised by whom? The Imaging Science Foundation Calibrators? (ISF http://www.imagingscience.com/ ) THX Calibrators? (THX http://www.thx.com/professional/home-theater-installer/ ) Or, a half blind monkey?No greyscale adjustment. No gamma curve adjustment. No colour management system (CMS). No colour gamut (scheme) choice. The conclusion is the same. Wether this TV is 5 thousand dollars, or 500 dollars, it doesn't do what a TV is supposed to do. Present ACCURATE images the artist intended. The fact that it's made by bose, or LG, Sharp, or by the hand of Zeus is *irrelevant*.A TV, that HAS all (or most of) these adjustments, are either ISF certified or THX certified displays. LG's and Panasonics.Here:http://www.amazon.com/LG-Electronics-50PN6500-50-Inch-Plasma/dp/B00BBAFUQC/ref=sr_1_sc_2?srs=2529790011&ie;=UTF8&qid;=1373233841&sr;=8-2-spell&keywords;=LG+tv+ISF+cccAnd here: http://www.amazon.com/Panasonic-TC-P50S60-50-Inch-1080p-Plasma/dp/B00ARAHBIW/ref=sr_1_1?s=electronics&ie;=UTF8&qid;=1373233921&sr;=1-1&keywords;=panasonic+THX+tv***Update ends***I am going to be harsher to this Bose TV. The panel itself is made by Samsung, a very competent panel manufacturer. However, after visiting the Bose shop, just to see if this TV, a 55inch this time, I already looked at the 46in and this one is just the same, but bigger. Could it live up to the hype (marketed by Bose of course), and, no, it couldn't.Firstly, the TV in Canada (in the Bose shop) is over $5000, plus 5% sales tax and another 40 or so bucks recycling levy. Over $5,500 for a TV this size? Seriously Bose?Really?Really?I figured the picture accuracy would be incredible owing to it being a Samsung panel at least, to make up for the immediately impressive 'surround' sound. (more on the ultimately inaccurate sound later)Nope. Despite me twiddling with the picture controls, as the sales guy looked on (who wasn't aware you could adjust the video controls) the picture accuracy is simply painfully awful. I will explain.I've been in the electronics retail industry a while. I've learned how to calibrate a TV self taught, bought the equipment, colouromiter, software, then received industry classroom training, and now do it as a full time job, to get panels looking as best as possible, IE, to adjust TV's to behave like the monitors the content was created on. Sure, you can twiddle with a normal TV and get it looking non awful, but you need test cards, filters and colourometers, software to get it way closer.EVERY tv I have ever calibrated or adjusted for friends and family has at least a smattering of picture controls, if not always separately controlled red green blue. The Bose TV has a pitifully limited control interface. It has contrast, brightness, colour, sharpness, and display mode, (cinema, sports etc) The sliders only go down a MAX of -7 on each and a max of +7, if you want it to look more awful than it is already. If there was more controls, I couldn't find them.No tint/hue, no advanced greyscale, no obvious way to disable frame interpolation, the retina frying dynamic contrast etc. I dialled down each of the limited controls on the TV, and it still looked like crap.Way to go Bose, put a Samsung panel in your TV, but use your own weird display algorithms set it at 'mega bright shop mode' and prevent the user from making much different.If I had my colourometer with me and my laptop, I shudder to think how way off base the colours were. Everyone looked like Snooki, even with colour reduced to maximum.You heard it here first folks, the Bose videowave TV is *impossible* to calibrate. Maybe entering the service menu used by TV repairmen might tone it down, but good luck finding that code out from Bose.I emailed Bose to ask why the controls were so limited, and why I couldn't get it lower than -7. Bose's answer essentially was \"were a private company and we don't have to tell anyone anything.\" So instead of helping, Bose weren't at liberty to say. Charming.Now, onto the sound. There are 16 speakers in the TV, according to the salesman. Looking at the thickness of the unit it had to be a whopping 10 inches. Looking into the grilles surrounding the tv, the most of the speakers looked to be the same as the ones used in the wave radio. The cheap paper cones. Yep. Those ones. Also used in the Bose companion 2 computer speakers, and at least one of the lifestyle system satellites. Bose must get a discount buying them from china or something...The sound, as I mentioned, is initially impressive on a scale and bravado basis but after listening to it a while, using my own reference music playing some contralto vocalists, like Maria Callas the audio was tiring and I wanted to turn it down. Good hifi you don't need to turn down. Lowfi irritates quickly and has one reaching for the volume. The sales guy at this point mentioned he is or did a sound engineer degree at university. I found that inwardly hilarious. A sound engineer, and you're working for Bose? Ahaha. HA hahahaha! That's akin to a Michelin chef making burgers at McDonald's. No insult to McDonald's folks of course, but if he WAS a sound engineer, why on earth he was working for a company that doesn't give out any information that sound engineers can use, is anyone guess.If there was supposed to be any 'surround' going on, I couldnt really perceive it. Just to correct other posters, in no way does the TV, or any of the bose 'home theatre' systems do DOLBY digital 5.1. Sure, they do digital 5.1, but not Dolby. There is a difference. Ray Dolby's 'Dolby Laboratories' company only allow companies to put 'dolby digital/dolby pro logic IIz' on the equipment if it can do it. Same with DTS. Bose doesn't do either. The TV, can only EMULATE 5.1, because, well....a 5.1 system has FIVE speakers and a sub. The Bose TV has a good 16 of those cheap paper 2 inch cones dotted around it.Neither has bose passed any of George Lucas' THX equipment certifications. Nor, will THX pass ANY of Bose equipment. Why? THX require full disclosure of how a manufacturers equipment works, the power used, the frequency response, sensitivity and a myriad of other things so they can test it. Bose has never, and probably will never, disclose anything other than the physical size of their equipment. Kinda like Ford making a new Mustang but declining to tell anyone the horsepower and torque.Note the amount of THX certified cinemas. As far as I know, there isn't ONE cinema in North America that is equipped with Bose speakers.In conclusion, this TV is staggeringly poor value for money for its size, horribly hobbled by short-sighted controls, leviathan heavy and audio like being on the receiving end of a baseball throwing machine chucking out balls like a machine gun.For over $5000 one can buy a Sharp Quattron 80\" and have a few hundred left to buy a well regarded Panasonic HTIB. Sure, quattrons aren't the last word in colour accuracy, but at least one can disable the yellow pixel and calibrate the damn things. Hell, one can buy LG/Samsung plasmas at 65\" for around $1700. (Irony, plasma is better tech than LCD/LED.)If this TV is a joke on Bose customers, it isn't funny. Bose, I hope you are ashamed of yourselves.IF however, you have so much money you cannot spend it fast enough,  and want to impress uninformed people who think Bose is top of the line, and do not care a jot about viewing films in the same way the creator intended it to be seen, and you do not mind people laughing at you behind your back, then go nuts and buy this TV.Bose has to walk the talk before they are taken seriously by people in the hifi biz. They say they are the best? Prove it. It's no good replying to the question, \"Excuse me, Bose Inc, why do you say you are the best?\" with, \"because we said so.\".", "Date": "December 13, 2012"}, {"Title": "Revolution, But Not for the Price.", "Author": "Kenneth Candelas", "ReviewID": "R2BE2D90IZ7YOR", "Overall": "4.0", "Content": "I tried this television at a Bose theater. It was great marketing, and the television was very pretty, but I noticed things that stuck out. I heard some port noise from the low end, which was relatively noticeable, and the acoustics of the room were also untouched, which makes it seem like there's a lot of low end, but it sounded more boomy than anything.That's not to say that I commend what Bose has done here. It's the best sounding television on the market hands down, but I wouldn't go to the extent of spending $5,000- $6,000 on a product that I can achieve a better sound with a dedicated sound system.One thing about Bose: they don't like to give away details. I asked the marketing specialist on the product and they said to me \"Bose doesn't like to give out that kind of information (such as frequency range and wattage, etc.). They say to just listen!\" Which is bull crap because as a post-production and audio engineer, it's useful to know what I'm dealing with. So I can't comment on specs so much.It may sound like I'm ranting, but in reality, I'm just pointing out some things that bothered me about this product. If you have that kind of money to shell out on a television, I hope you enjoy it. And you probably will. But for audiophiles, it's definitely not of the caliber of a set of great Bowers & Wilkins hooked up to a Macintosh amplifier.", "Date": "July 17, 2012"}, {"Title": "Not for the weak hearted", "Author": "topher", "ReviewID": "R1WNBSNZGS69FW", "Overall": "4.0", "Content": "Bose has done it again.The picture quality on this television makes real life look like garbage. The colors are so vibrant, the blacks so deep, and the detail... there are no words.The audio is unbelievable, but what else would you expect from the maker of the world's best speakers?Unfortunately, this set did not come with a Monster HDMI cable so I had to give it only 4 stars.", "Date": "November 18, 2012"}], "ProductInfo": {"Price": "$5,999.00", "Features": "Vivid picture from a 55\" LED backlit display (1080p/120Hz)\nExtraordinary audio performance with no visible speakers and no wiring to contend with\nMusic takes center stage with an included dock for your iPod®/iPhone®\nInnovative click pad remote provides easy, intuitive control of TV and all connected sources\nADAPTiQ® technology customizes system sound during setup to adapt to room acoustics", "Name": "Bose® VideoWave® II 55\" entertainment system", "ImgURL": "http://ecx.images-amazon.com/images/I/51ST5q5UjQL._SY300_.jpg", "ProductID": "B008KK3D10"}}