{"Reviews": [{"Title": "Amazing TV!", "Author": "Byron Ford \"B. Ford\"", "ReviewID": "R18B7VR9G2TRO8", "Overall": "5.0", "Content": "I purchased this TV from Costco as the offered an $1100 rebate which put me right around 1500.00. AT the time of this review, this was the best TV for that price point as I did tons of research and I wanted to stick with the Samsung brand as their LED TV's are far superior. This TV utilizes new technology in the 3D glasses themselves which are not the typical passive style glasses. They actually connect to the TV and powered by a \"watch\" type battery. The 3D quality is AMAZING. I have friends with new LG 3D, and Vizio TV's and this BLOWS them away. The TV is super thin and looks bigger than 55' due to how the edges are on the TV itself. The factory settings are OK as far as the HD view goes. I have been playing with the setting to calibrate it myself and found some 7000 model setting online which improve the picture even better. This model has few more detailed calibration settings than the 7000 series so I need to find some 7150 settings online. I REFUSE to pay someone to come out and calibrate the TV. Speakers are in back of the TV, so if you place flat on wall with that wall mount, sound might be stifled a bit but mine is not flat against the wall so the sound is really good for stock. I have sweet sound system set up so I don't listen to the TV speakers a lot. If you're interested in mounting it flat against the wall, get this mount: http://www.amazon.com/Samsung-WMN2000B-Ultra-Slim-Mount/dp/B004SP18DG/ref=wl_it_dp_o_pC_S_nC?ie=UTF8&colid;=541MJJQNQ1GN&coliid;=I1YENYA7CY4SDJ. In my opinion, why pay WAY more for the 8000 series when this is available and it is 3D!", "Date": "March 27, 2013"}, {"Title": "Samsung tv", "Author": "Steve", "ReviewID": "R23MERYZ50NS0I", "Overall": "5.0", "Content": "Worried of what I was going to get but to my surprise best tv I've ever had by far ever!Not a scratch on it. It was missing the stand but it was going up on the wall so it did not matter.", "Date": "May 20, 2013"}, {"Title": "From here to eternity", "Author": "michael hike", "ReviewID": "RKQFCTXIRWAXN", "Overall": "1.0", "Content": "I still am not able to use it. The remote malfunctioned and it has taken since April 11th to process a new one. I still have not received it and they (Samsung) say it may be another week before I do. Meanwhile the TV just gathers dust.", "Date": "May 9, 2013"}], "ProductInfo": {"Price": "$1,895.00", "Features": null, "Name": "Samsung UN55ES7150 55\" 1080p 3D Slim LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41cFbP7wrJL._SY300_.jpg", "ProductID": "B008RD2HTY"}}