{"Reviews": [{"Title": "Get It.", "Author": "Capricorn13", "ReviewID": "R1RUM4ZKBNIE4W", "Overall": "5.0", "Content": "I bought this tv for our Christmas house gift. It is the best. I love the size, the look and overall appearance. It was so easy to set up myself. I connected to my wi-fi, wii, dvd and dvr with no problems. It's so easy using that big screen. It has so many cool apps and features. If you are thinking about it, this just might be the tv for you. Warning: If you have kids you may not be able to keep them off of it. (smile)", "Date": "January 9, 2013"}, {"Title": "Wireless didn't work", "Author": "SIMON KEANE", "ReviewID": "R1F9ZWO1HTTA3B", "Overall": "1.0", "Content": "We bought this TV just after the New Year.  Loved the idea of it but unfortunately the wireless internet did not work.  After literally hours on the phone troubleshooting with Samsung, At&T;, etc. it was determined that there was a problem with the wireless card.  Samsung agreed to send a repairman out which was an inconvenience.  The repairman came and replaced the wireless card and said it would never trouble us again.  It was working fine so we were pleased.  However a few weeks later it is broken again. My guess is there is something in the TV malfunctioning and shorting/breaking the wireless card.  Anyway, more wasted time talking to Samsung...now they are saying they have to send another repairman out to fix it or to declare it unfixable...and after that then MAYBE I will be entitled to an exchange or a refund.  So, I bought a 'NEW' TV and am being told that after all my troubles I might end up with a twice repaired TV that may or may not break again in the near future or MAYBE my money back.  Not impressed with Samsung's procedures at all and am a thoroughly dis-satisfied customer.  This reflects in no way reflects on Amazon, it is purely an issue with Samsung.", "Date": "March 7, 2013"}, {"Title": "tv", "Author": "Brendan Estes", "ReviewID": "RT3IYB1NHLCEI", "Overall": "5.0", "Content": "the tv was what it said in the ad it was new and arrived on time nothing was wrong with it and its a great item", "Date": "July 22, 2013"}, {"Title": "Excellent - Simply the Best !", "Author": "JimmyMPR \"Jimmy Musignac\"", "ReviewID": "RXJ5S73I31D6T", "Overall": "5.0", "Content": "This is the best TV I ever had. Work with all my Samsung devices, Camera, Tablet 2 and Galaxy, all seamless. Is the best.", "Date": "January 8, 2013"}, {"Title": "DONT BUY FROM THIS PERSON/COMPANY", "Author": "Jackson Santiago", "ReviewID": "R2SYZ0OKGVJMRC", "Overall": "1.0", "Content": "I BOUGHT A TV FROM THEM IN 2013 AND A MONTH LATER THE TV I BOUGHT HAS MALFUNCTIONS. IT SHUTS ON AND OFF AND THE MOTHERBOARD NEEDS TO BE REPLACED. I HAVE TO PAY ALMOST 500 FOR LABOR AND REPAIRS. IF YOUR GOING TO BUY FROM THIS PERSON/COMPANY DONT BUY ELECTRONICS! HORRIABLE!", "Date": "January 19, 2014"}, {"Title": "very good", "Author": "johnn", "ReviewID": "R1DJ5M4K7BRMAB", "Overall": "4.0", "Content": "product in good condition and sumple my expectations without any kind of doubt, I can share my content quickly super good", "Date": "August 27, 2013"}, {"Title": "LOVE IT", "Author": "jchrisler77", "ReviewID": "R2BXRT0O46G70W", "Overall": "5.0", "Content": "I LOVE SAMSUNG AND HOW ITS DEVICE COMPATIBLE WITH MY PHONE ALLSHARE AND I LOVE HOW ITS WIFI ENABLED AS WELL. GREAT SOUND AND PICTURE QUAILITY. SIMPLY THEE BEST", "Date": "May 20, 2013"}, {"Title": "Samsung 46in LED", "Author": "V. Cosier", "ReviewID": "RZ8GOSHC1HT4I", "Overall": "3.0", "Content": "I have nothing but praise for the efficiency of the seller/shipper.My hope was to connect this to my laptop as I did my previous Samsung. But have had no lucky doing so.Samsung, after 3 calls to support, have been of no help.I like the size of this TV. But given what it was going to be used with, I would have purchased a 46in LCD, non Smart TV.with a VGA port.For me the picture is darker/sharper with an LCD.", "Date": "April 5, 2013"}, {"Title": "Very nice picture.", "Author": "Ray S", "ReviewID": "R2SJVSGCVJLQ2L", "Overall": "4.0", "Content": "The picture is very nice and I like most of the features. Have not quite figured out how to delete unwanted channels. The sound is ok overall but there are a few stations that I have not been able to adjust the soud to my satisfaction. Am considering getting external speaker bar or some other type of external speaker system. Overall I am satisfied with the tv.", "Date": "July 31, 2013"}, {"Title": "Great tv", "Author": "Victor Revenko", "ReviewID": "R15BBQK7CDETZN", "Overall": "5.0", "Content": "I ordered the Samsung ,my third because it is a consistent performer. This one meets all expectations, smart, good reception and other qualities.", "Date": "October 16, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Full HD 1080p Resolution\nWide Color Enhancer allows you to see picture color the way the director originally intended.\nClear Motion Rate of 240 Clear Motion Rate of 240 - Experience sharp picture quality, even when you are watching fast-moving images like sports or action movies.\nBuilt-in Wi-Fi\nENERGY STAR V 5.3 Compliant", "Name": "Samsung UN46ES6150 46\" Class (45.9\" Diag.) LED 6150 Series Smart TV", "ImgURL": "http://ecx.images-amazon.com/images/I/41jrBTXcgtL._SX300_.jpg", "ProductID": "B008RC9OGE"}}