{"Reviews": [{"Title": "A good, solid TV at a fair price", "Author": "justinh2626", "ReviewID": "R22GQNGL54RRZ9", "Overall": "4.0", "Content": "I figured since I rely so heavily on user reviews when making my purchasing decisions on Amazon that I owed it to the community to post my experience with this product.  I ordered this TV on Thanksgiving night and had been doing quite a bit of research trying to find the best combination of quality and price. While there were other television options out there that were more flashy they also came with a much heftier price tag.  First off, the TV came with free shipping and had an estimated arrival date of 7-10 business days. Imagine my surprise then, that it arrived on the afternoon of the second business day.  Coming out of the box, the unit looked amazing. Sleek design; light-weight and easy to maneuver, this TV looked great. I had a few issues getting the base securely attached to the TV, but after switching to a longer screwdriver, found the process to be quite easy.  The set-up was easy and very straight forward. I hooked my Ps3 and laptop up to the HDMI ports and was watching Netflix and playing video games within 45 minutes of getting the package.  I find the picture quality to be top notch. The 120 hz frame rate makes for a clear, seamless image. I watched Prometheus and The Dark Knight on it within the first couple of nights and was in awe of the quality of the picture. The blacks looked amazing which is something that always bothered me about previous LCD sets I have had. Sometimes, when watching HBOGo, the frame rate can be a bit dizzying but I would blame that more on the fact that I am streaming it to the TV then the quality of the TV itself. With Netflix or Blu-Rays I have had ZERO negative experiences.  For $500.00 and free/fast shipping, I am incredibly happy with my purchase. I would have given the product 5 stars had it not been for the fact that there are only 2 HDMI ports on the set. It can be slightly annoying switching the cable to a third device but the typical person is only using 1 or 2 ports anyways so it is something that has no real bearing on my ability to enjoy this product. I would recommend this TV for living room, bedroom or \"man-cave\" use.", "Date": "December 11, 2012"}, {"Title": "Great LED TV: especially for the price here on Amazon...BUT.. There's Always a But", "Author": "MindMayhem", "ReviewID": "R1MNW341SS8BLM", "Overall": "4.0", "Content": "Pros: Good picture. others have said it will not work for games.I find this not so. All of my PS3 game work just fine.(Far Cry3-Walking Dead-RE6-and many more.I also have a Xbox 360 all of my games work just fine on it as well.I purchased this TV when it was on sale for only $599.Which is a Great price for a 55\" LED TV.If you can wait, the price will drop to that or even a little lowerat some time again.Some of the other people here on Amazon reviewshave stated they have purchased this particular TV for even a little less than I did.\" just a couple of bucks\".Cons:Here a the Buts I mentioned,The description of this product on Amazon are not all Factual.1:  It states this TV has an VGA connection. ( For hooking up a computer)In fact there is none. If you wish to use it for a computer it will NOT work.2:also says it has a Swivel stand... Not true. But not a big deal.3:Okay. Says it's an LED TV. When in fact, It is LED back-light with an LCD screen.Not a big deal also. By law a LED Back-light TV is considered a LED TV.A LED back-light TV gives a much crisper and clearer picture than a LCD.This TV's picture is very good.4:Speaker Sound: as others have mentioned, The sound is not the greatest.Although I find it quite adequate. As with all of my other TV's, I have purchased Sound bars or Av's. But that's just me. I like the whole movie theater experience.5: and finally,I'm sure you have seen there are only two HDMI connection.Not a problem for me. However if it is a concern for you.You can purchase a USB Hub for around $10 to $20.They can range from turning one USB into anywhere from 3 To 5 extra connections.or you can pick up a AV with HDMI in and out connections.That's what I use. My TV only needs one HDMI my AV handles all the rest.", "Date": "April 7, 2013"}, {"Title": "TERRIBLE FOR GAMING", "Author": "Lacy", "ReviewID": "R2ZC5SNCJ5KQ5W", "Overall": "2.0", "Content": "Considering the lack of reviews for this product, I figured I owed it to the community to write one.I purchased this TV as an upgrade from an old 26\" HDTV 720p Insignia that I got from Best Buy 4-5 years ago. Although I knew this was a budget oriented tv, I didn't really think it was possible to take a step backward from what I was used to. I was wrong...For the several hours that I was watching cable in standard definition, it seemed to be a fine tv. I also watched a movie via my xbox 360 and too found the picture to be satisfactory. The problem with the tv is the ATROCIOUS \"input lag\" or \"display lag\" that you get when playing video games. It literally made playing fast twitch games like Call of Duty NEAR TO IMPOSSIBLE. There is no game mode to improve the delay either. I contacted tech support, and disabling the already-limited amount of post-processing features didn't resolve the issue. The TV is going back immediately.I WANT TO AGAIN STRESS THIS TV IS COMPLETELY INADEQUATE FOR ANY TYPE OF GAMING.If the TV will never be used for gaming purposes, it's possible you may be happy with it. I give it two stars...", "Date": "November 25, 2012"}, {"Title": "Meets every need", "Author": "Christian", "ReviewID": "R1OO7B4OA895PS", "Overall": "5.0", "Content": "This tv was absolutely great and looks wonderful for gaming also, very clear an perfect rim length. The tv was very sturdy and also easy to assemble couldn't be happier ;)", "Date": "August 18, 2013"}, {"Title": "Good flat screen", "Author": "A. Saenz Jr. \"Bettering self\"", "ReviewID": "R35192X0K5S7N9", "Overall": "5.0", "Content": "Great price for the quality. Could not get the direct tv remote to match codes, so I use two remotes. No problem. Had to change out HDMI cables to get the true 1080 picture from the blu ray and the direct tv box. but I had bought some bargain brand HDMI cables. Now enjoying everyday....", "Date": "March 14, 2013"}, {"Title": "RCA LED 55", "Author": "Terry B.", "ReviewID": "R1W11L5S0CROP1", "Overall": "5.0", "Content": "This TV is a great buy for the money...  It has a very good picture that seems  to be clean and  crisp.. But the sound is lacking a little depth..  other than that  its a great  TV", "Date": "February 21, 2013"}, {"Title": "Great, no frills HDTV at a great price", "Author": "L. Dippold", "ReviewID": "R2VSNXT4MZC2VD", "Overall": "5.0", "Content": "I've had this 46\" RCA LED 1080p 120Hz HDTV for about 3 months, and so far it's been fantastic. Great color clarity, easy to set up, polished look, decent sound--all around a great value.Unlike many of its competitors, this RCA TV doesn't have a lot of frills. If you're looking to stream movies or TV shows from Netflix, Amazon Prime, Hulu, or something else--you'll need another device to do so. This isn't a problem for most of us: who buys a 46\" HDTV LED TV without also having Blu-Ray player, gaming system, Roku, or something else? No one that I know. I bought the TV with the full intention of using my Blu-Ray player for streaming purposes, so it wasn't an issue for me.In terms of the sound...I've found this TV's sound to be surprisingly good, especially compared to other similarly-sized TVs on the market. I have the TV wall mounted, with two tall bookcases on either side of it; I suspect this set up, coupled with the smallish size of my living room, helps amplify the sound. I could see how the sound might get lost in a larger room. And of course, if you're looking for a huge bass sound, no TV will provide that--you need a decent subwoofer for that. At some point I may get a sound bar, but all things considered I find the sound surprisingly crisp. Most TV manufacturers, in my experience, don't invest in TV speakers on the assumption that the vast majority of consumers will circumvent the built-in speakers anyway with a sound system. So understanding this tendency, this TV's built-in speakers are at the better end of built-in speakers.All said, highly recommended. A great value, with excellent graphics. If your looking to upgrade the TV in your home theater system, this is a great option.", "Date": "January 25, 2013"}, {"Title": "Great Huge Tv For The Price", "Author": "HAROLD \"FROGGY6916\"", "ReviewID": "RNC7MAQYOD92C", "Overall": "4.0", "Content": "I really like this tv, and it is very hard to beat the price for a led tv of this sizeI have my directv hd and an xbox 360 connected to it, picture for directv looks amazing and i have played a little battlefield on it with no problem whatsoeverthats my experience with it and so far o goodOnly con is that it does have very few inputs, but everyone is supposed to know this before buying, as i did my research and knew what i was getting", "Date": "December 5, 2012"}, {"Title": "The picture is okay but...", "Author": "Charles", "ReviewID": "R4MY4A9GTIPUC", "Overall": "4.0", "Content": "The sound on this thing is awful.  Now, most people will be attaching this to some sort of home theater system but if you do not prepare for your ears to bleed.  I have tried adjusting everything I can on this thing (it even has equalizer settings) but cannot get the \"tin cup\" sound out of this thing.Using the following settings from Consumer Reports and I find the picture to be pretty good.  PS4 runs fine on it with no noticeable lag.Accessing the picture controls is simple; press the menu button on your remote and navigate to the picture settings menu where you'll see most of the controls. To find some other controls you may additionally have to enter the \"advanced settings\" or the \"picture options\" sub menus (name may vary depending on model). Don't worry about making any \"mistakes,\" you can always reset the picture settings to factory default if necessary. Consult your user manual for additional guidance.PICTURE SETTINGS.Picture Mode: UserContrast (Picture): 41Brightness: 55Color: 43Tint: 0Sharpness: 0Color Temperature: WarmBacklight: NAAspect Ratio: Full 100%Miscellaneous: Film Mode = On, All else off or 0", "Date": "December 17, 2013"}, {"Title": "Best value yet!", "Author": "J. Silberman \"jsmail951\"", "ReviewID": "R1CXGHOAEVKJXP", "Overall": "5.0", "Content": "Unbelievable value for incredible quality. This is the perfect set for those who already have receivers that do HD and all the rest. connect a Blu-ray player and it is a smart TV with everything you need to stream. I don't care about 3d at the prices they charge when I can get a 55 inch LED under 600 dollars.The bezel is so thin that this 55 is lighter and thinner than my 52 inch. Picture is super clear and bright and has freeze frame and PIP options, not that I ever needed that when I have FIOS DVR but still pretty cool.", "Date": "June 5, 2013"}, {"Title": "I recomment it", "Author": "Ana Ruiz", "ReviewID": "RQ4NSCBOPOPNX", "Overall": "5.0", "Content": "I'm very please with the purchase, it look great and sound perfect for the  price , even that I have connected to an antenna I enjoy it", "Date": "July 31, 2013"}, {"Title": "For our church", "Author": "H. Stone \"Harry\"", "ReviewID": "RG6UTYVL161UR", "Overall": "4.0", "Content": "I purchased this TV to use in our church, to allow those on the stage area the ability to see the song words and other things projected on the main projector. For what we purchased it, it works great. very crisp, clear words and letters. The 55\" size allows it to be seen from a distance of about 40-50 feet. It's not as thin as my personal plasma, but for a wall mounted TV, it does just fine.", "Date": "July 19, 2013"}, {"Title": "RCA TV", "Author": "Lorne A. Sturdivant \"onepercent\"", "ReviewID": "R1DPUIKLXW7VZP", "Overall": "5.0", "Content": "Great price and fast deliver.  Excellent picture.  Clear instruction and easy installation!  I am completely satisfied with this purchase.  Come highly recommended.", "Date": "May 10, 2013"}, {"Title": "Very Impressive", "Author": "James1seek \"James1seek\"", "ReviewID": "RU2UFYBUOV903", "Overall": "5.0", "Content": "I was concerned about making this purchase online 'cause I had not seen the set operating.  However, the price was attractive and I have seen older RCA models perform well in friends' homes.  Now that I've had this TV for a month, I must say I'm impressed with both the picture quality, and the sound is remarkably good for a thin flatscreen TV.  I agree with other reviews in that you will want to adjust both the picture and sound settings for your preference. I like pictures darker with good detail, contrast, and color...The RCA LED46C55r120Q delivers a very nice, clear and detailed HD picture.  Today, I purchased a pair of SONY SSF5000 floor speakers to fill out the sound for movies, games and such.  I will probably update this review after my receipt and trial of the speakers.  Couldn't find any apparent weakness in this set after 4 weeks use...so I give it 5 STARS!", "Date": "April 25, 2013"}, {"Title": "Amazing TV!", "Author": "Beavs285", "ReviewID": "R1DKT99V585OTY", "Overall": "5.0", "Content": "This TV was a steal of a deal... in comparison to one that I bought at a big-box store for 3 times the amount, we love this one more! Clear picture, and great small/thin frame around it. Awesome buy!", "Date": "April 4, 2013"}, {"Title": "RCA 55\" HDTV", "Author": "Bonnie Lowrance", "ReviewID": "R2F5817BWHJZVZ", "Overall": "5.0", "Content": "We had been looking at 55\" televisions for a while and finally ran across this great deal.  Works wonderful and has a great picture.", "Date": "March 14, 2013"}, {"Title": "Perfect for the Superbowl!!", "Author": "CGreene", "ReviewID": "R32ZEGRZKDRPNH", "Overall": "5.0", "Content": "Bought this during a daily deal for a great price after reading some good reviews. So far we have loved it, and watching the Superbowl on it was fantastic!!!", "Date": "February 26, 2013"}, {"Title": "Defective", "Author": "Maja", "ReviewID": "R14AUDCJ1MAQAS", "Overall": "1.0", "Content": "I purchased this TV in November of 2012. I loved the look of it and was very happy with it until recently. About a month ago it cut off for no reason. I thought at first that I had accidentally turned the timer on. When I looked at the sensor I saw the red light was off. I flipped the surge protector, the indicator glowed red and I turned the TV back on. Today the TV has cut off 10 times in a row after I hit the reset on my surge protector. I am really disappointed in this product and won't make the mistake of purchasing another RCA product.", "Date": "September 11, 2013"}, {"Title": "model confusion", "Author": "Mustang", "ReviewID": "R3C2O8PW7YPANJ", "Overall": "4.0", "Content": "There are 2 versions of this 55\" TV model number, or the Mfgr has simply changed the specs.Changed is the power consumption.Per this amazon spec, the \"Energy Guide\" power usage per year is $35.  Per Best Buy for the same exact model, it is $17 as of Jan 2014 inventory, which includes a 2013 dated manual.  Best Buy's is lighter by 2 lbs, as well.Speakers/sound of the Best Buy iteration is not good.  $35 computer 90 watt 2.1 speaker set with its large subwoofer fixes that in a cheap and big way for starters.  Over air and DVD picture is great with still and action video.  Cannot comment on gaming.  Not interested.There is also another version #3 which is a \"B\" iteration in lieu of this/these \"C\"s and is different in size, weight, HDMI jack number (4), etc.  Those are the K-mart, Walmart models.Tough to read an accurate review when some of these units are apples and some are oranges.", "Date": "January 26, 2014"}, {"Title": "Not the best picture, terrible contrast, use a soundbar", "Author": "Bill Thomas", "ReviewID": "R1XIRKD92FXUPY", "Overall": "3.0", "Content": "Want a giant TV for cheap, this is it.  I'm not a TV connoisseur, but I can tell this is not the best.  The blacks are not totally black, the 1080p seems more like 720, the sound is tinny, only 2 HDMI ports.  Another thing to consider (which I didn't) is most sound systems pair better with their own brand.  So if you plan to buy a surround system, or a sound bar, to go with it (at least get a sound bar with this tv) you are going to find out that the RCA brand sound stuff isn't even worth a second look.  When you look at the sony stuff you'll start to regret buying a sony TV.  Then you can use one remote, the tv sound automatically turns off, etc.  I've been pretty hard in this review, but I don't hate it.", "Date": "January 22, 2014"}, {"Title": "Nice TV, Lousy Shipper", "Author": "F. Anderson", "ReviewID": "R3RELNLELZEJ50", "Overall": "5.0", "Content": "First and foremost do not let Amazon use Ceva Logistics to ship this, they have to be the worst freight company on the planet, if Amazon didn't intercede on my behalf I still wouldn't have the TV. Kudos to Amazon for their intercession, shame on them for using Ceva Logistics in the first place. That being said this is a beautiful TV for the money. The 120HZ refresh is way too good, set up perfectly out of the box, couldn't have worked out any better. Admittedly it's not a smart TV and it could use a third HDMI port but I solved that issue with an HDMI hub (around $100) and a Roku 3 (another Franklin), with Directv on demand I have way too much to watch, never get to it all. I can't recommend this TV enough (provided you're OK with the 2 HDMI ports), it's a seriously nice piece. Remember to tell Amazon not to ship it with Ceva Logistics though if you ever want to get it, they suck.", "Date": "December 12, 2013"}, {"Title": "great tv for the price!", "Author": "Lzfortier", "ReviewID": "R1OV2FRS5N6S2G", "Overall": "5.0", "Content": "So like many other reviewers, my first tv arrived broken.  Amazon had a new one delivered the next day.  We've hung it on the wall, the sound is decent, the picture is great.  For the price you really can't beat it!  I'd buy another one if I needed too... hopefully I won't need to for a very long time though!  lol.  I'd recommend it to others.", "Date": "July 18, 2013"}, {"Title": "amazing", "Author": "Citi", "ReviewID": "RZQEPR2MZZCES", "Overall": "5.0", "Content": "Great picture, amazing value.  Mine cost $388 and free shipping, how can you beat that???????  Don't pay more than $400 because you will that price if you are patient.", "Date": "April 9, 2013"}, {"Title": "I would recommend this tv", "Author": "jackie", "ReviewID": "R2PT1IHFCE2KVI", "Overall": "4.0", "Content": "This is a great tv for the price. I have searched price and reviews and this is so far a great product.  Have had no problems and I think the sound is just fine but I'm not a gamer.", "Date": "March 14, 2013"}, {"Title": "Perfect TV", "Author": "NEffler76", "ReviewID": "R2PB3VUODC4XJS", "Overall": "5.0", "Content": "I got this TV on sale for a great price.  I bought it to replace an old tube tv, bought the cheetah wall mount and wall mount shelves.  The TV and wall mount were easy and quick to assemble and get mounted.  I was nervous about some of the comments about game play because I have a 15 year old Xboxer first person shooter game player, he said the TV was awesome for game play.  No dizzness at all some of the other people were complaining about.  Great tv extremely happy for the price.  If the TV was more expensive I would give it a lower score, but for the money best buy out there.", "Date": "March 13, 2013"}, {"Title": "I give it an A-", "Author": "Rich P", "ReviewID": "R3IH9ZNFEUKREH", "Overall": "4.0", "Content": "I received the TV in good condition.  I set it up and messed around with it a little bit.  After reading the reviews, I was sure to try Xbox360 and PS3 hooked up through HDMI, and both seemed fine.  I didn't notice any measurable amount of lag on Black Op2, Battlefield 3, Half Life 2, NHL 13, NCAA 13, the Last of Us and God Of War.  If there was any lag, I didn't notice it.  For the price, this TV is a steal.  The sound on the TV IS lacking, but I hooked up digitally through my Surround Sound. Problem solved.  I have my Fios going through HDMI port 1 and a HDMI 3-way connector through HDMI port 2 for Xbox and PS3.  I did notice very minimal motion blur at one point, but I am not sure if it was the TV or the broadcast. I have not had more time to invest in messing with the settings.The only thing that would bump this to 5 stars would be more HDMI ports IMO.", "Date": "July 24, 2013"}, {"Title": "Picture's good, service is not.", "Author": "T. Tesluk", "ReviewID": "R245XFRMMSMBTH", "Overall": "2.0", "Content": "I purchased this TV as a gift for my Parents. They enjoyed the good picture quality for six months, and then it stopped working. It stopped recognizing any input from either of it's HDMI sockets. They called RCA to get it repaired/replaced under warranty. So far, they've been getting the run-around from some sub-sub-sub-contracted repair company. Something got lost in that game of telephone, because they told my Dad that they would charge him $90 cash to show up and diagnose the problem, and then provide an estimate for the real repairs. So then, appalled, they proceeded to play phone tag with another six \"technicians\" on the phone trying to explain to them that he should not be charged for this service because the TV is still under warranty. They still don't have a clear answer. I mailed them a copy of the receipt, so we'll see what happens, and I'll update my review accordingly.", "Date": "July 22, 2013"}, {"Title": "HUGE VALUE", "Author": "VB Amazon", "ReviewID": "RZOZ1OQF3RS8J", "Overall": "5.0", "Content": "This was the best price for a 55\" LED TV anywhere by $200 so I jumped all over it!!!First note, some of the other reviews, there are limitations so it must meet your needs.  There are not a lot of inputs, but why would you need 4 or 6 HDMI inputs?  My video is all controlled by my AV Receiver so I only need one HDMI input and that is all.Gaming speed may be an issue but I don't game.I need one input, and a good picture and this has everything I need for an awesome price... I don't even need speakers, but who does...every heard of surround sound.Best TV for the $$$ anywhere at the time if the limitations don't effect you!The free delivery to the room and unpack and power up was an awesome adder...plus no Virginia sales tax on a $600 item is a big saving some don't consider.", "Date": "February 23, 2013"}, {"Title": "Best TV you can buy for this price", "Author": "A. Hamidi", "ReviewID": "R2M1ZZQHE1WXNM", "Overall": "5.0", "Content": "Considering I ended up getting this TV for $500 flat (Black Friday sale of $550 - $50 partial refund from Amazon for delayed shipment!) I'm utterly satisfied with this purchase. Still, even at $650, it's one of the best values you will find in TVs for the 1080p resolution, 120Hz refresh rate, and sheer SIZE of this beast. I've spend hours in Best Buys, Costcos, and various electronics stores looking at potential candidates for my new TV, and I must say that Samsungs are typically the best. They also cost about 3x as much as this RCA for the same size and specs.Bottom line is, for the average consumer this TV is more than enough and is absolutely incredible for watching movies/TV/sports etc. I'm a casually competitive gamer who doesn't even own his own Xbox One (it's my brothers, and I don't play like it's my job or life, but I enjoy it and perform better than the majority of other players I encounter) and this TV is certainly enough to get the job done. I'm sure for serious guys who spend $300 on gaming headsets and buy Monster and Mountain Dew by the case, this TV is probably somehow inadequate. But trust me...unless you are THAT type of consumer, you will love this TV.", "Date": "April 4, 2014"}, {"Title": "Best Buy Beautiful 55\" LED TV", "Author": "Certified Life Coach", "ReviewID": "R2HD0MKO0AJWE0", "Overall": "5.0", "Content": "I've had the TV for almost a year and we just love it and cannot imagine doing without it.  It's blue-ray capability and internet connection features brought a new world to us in a TV.  We cannot say enough good about this TV, it's clarity in color is brilliant.  Our dog who likes to watch TV, especially DVD's on Netflix, sits on the edge of the bed and watches intensely.  Some times we have to call out to him because it looks like he's going to jump at the screen when he sees another dog.  Very happy campers with this TV, and it's an RCA.", "Date": "January 9, 2014"}, {"Title": "TV for Parents", "Author": "GatorKindle", "ReviewID": "R1PB901VV0T2OU", "Overall": "4.0", "Content": "I got this TV for the parents in-law and it has a great picture.  I couldn't figure out how to get the picture to show in 120 hertz but I was only there for a few hours.  Besides that the TV looks great in their living room as it replaced one of those old big box sets.  The one big down side is that their were only two HDMI slots.  I own a 32inch with three HDMI slots so I was lost how a 55inch only had two.  Overall great value for the price we paid.", "Date": "January 3, 2014"}, {"Title": "Cheap simple hdtv", "Author": "gizmonet", "ReviewID": "RM06RCNMGNW7M", "Overall": "4.0", "Content": "I didn't buy this from Amazon.This is my first flat panel HD television so it's miles ahead of what I had previously.I specifically did not want a smartTV. I already have a roku.I don't care about the TV speakers as I have a home theater system.The picture is beautiful. There is some slight lag with action sports but barely noticeable. 2 HDMI ports are not big deal. You can get a hub for $10.The digital coax audio out does seem to broadcast in surround.The tv is light and was easy to install in a VERSA mount.All in all, very happy.", "Date": "December 23, 2013"}, {"Title": "Fantastic", "Author": "Michael Chilcote", "ReviewID": "R3Q94BIQGI9873", "Overall": "5.0", "Content": "Looks fantastic.  What a great price.  Highly recommend this item.  Looks just as good as a TV twice the price.", "Date": "November 11, 2013"}, {"Title": "Good for the price", "Author": "Melissa May", "ReviewID": "R3A9LQ6RGIZCPT", "Overall": "4.0", "Content": "This TV is what I was looking for. The price was good. The picture is wonderful! The sound isn't as good as I would have expected honestly.  I think if a few extra speakers were set up, it would be perfect.", "Date": "August 4, 2013"}, {"Title": "Solid Very Solid", "Author": "Maurisse Johnson", "ReviewID": "R2N3QZ66IQ9G9G", "Overall": "4.0", "Content": "I just purchased this TV from Sears. It was on sale for $599 and I thought comparatively it was a solid deal. Because of a lengthy wait due to a cash register snafu, they gave me a 20% discount which significantly lowered the price. After the usual unboxing and setting up, I quickly realized that the hookups are limited to 2 HDMI ports, which isn't awful because you can get a HDMI hub but for this price I'm not going to complain that loudly. The picture is really good for the price and the size of the tv is really thin compared to some other models at this price point.The edge to edge sharpness is really good and the picture itself is solid. I like the remote and will probably go for a universal remote to combine TV and Cable. The only real complaint is that my PS3 isn't working that great. It seems to have some lag problems and I have spent the last day or so playing with the settings to see if something changed would correct the lag time/soap opera effect. I'm still researching but I think at this point I may have to live with whatever lag times I experience. One note, The PS3 HDMI cord is directly connected to the TV and the TV states that it's on a 60HZ setting once the PS3 is on. I've looked all in the menus and I didn't see any where to change it to the 120Hz setting. Any idea's folks?", "Date": "July 16, 2013"}, {"Title": "Great for the price", "Author": "Guitarman", "ReviewID": "RE05T3HBN4Z8P", "Overall": "4.0", "Content": "When I bought this TV, it was on sale for $405, so I figured that kind of deal was pretty much impossible to come by without totally sacrificing quality and features. And wow, was I impressed by this guy. I have my Xbox hooked up via HDMI, a Gamecube via composite, and a stereo system via audio out, and the components play great together. I did have to adjust some color and picture settings to get the Xbox's images to appear bright and vivid, but once that was done, everything looks excellent. For some reason, the default color setting was Warm on mine, but changing it to Normal did the trick. Picture setting is on Standard and that looks great as well. I have this TV on the wall in my bedroom, and it has satisfied time and time again. Motion looks very smooth, even though some people seem to complain about a gaming lag. I had no such problem, and the lag would more likely be due to cables that are either too cheap or too long.I went into buying this thinking that if I wouldn't be taking a bath if it wasn't amazing, after all, it's not a thousand+ dollar TV. HOWEVER, for a no-frills experience, it gets the job done. The speakers aren't very good though, so some kind of soundbar or speaker system is absolutely necessary to get the best experience. Even a 2.1 system will sound much, much better. The ports on the TV are okay. I would have liked to see at least 3 HDMIs, but 2 is just fine. There is no VGA or Optical Audio Out, only coaxial. This isn't a huge setback, but having those options can be handy. Another thing that is unclear about the description is that there is no separate composite input, it is shared with the component, but that is very common among newer TVs.The bottom line here is that this TV is a really good bang for your buck. In my case, it was impossible to resist. The bezel is thin, so it looks great if you mount it on the wall. 120hz capability is nice, and motion is very smooth. With a few picture tweaks in the settings, it will look great. External sound systems are a must with this though, because the speakers are very underpowered, but most of us have something lying around at home that can be plugged into one of the audio ports. Other than that, a very decent TV with a decent price tag. Again though, I am basing this review on getting it for $405, not full price, so your experience could differ.", "Date": "July 15, 2013"}, {"Title": "Cant beat the quality/price ratio......", "Author": "Greg Cannon", "ReviewID": "R3OGUQJEX3LVLV", "Overall": "5.0", "Content": ".... as long as you don't pay more than $450 for this TV. There are plenty of great deals out there, but after looking for months I finally settled on this TV (46 inch model) for $399, free shipping no tax.A day later the price jumped up to 499, and the next day up to 650. Setup was cake.So my main issues with this TV are only two HDMI ports... solution? Buy an HDMI hub for cheap.And if you can get this tv for $399-500, definitely purchase a SquareTrade warranty- 3 years for 30 something bucks to protect your investment.The 120 hz soap opera effect can be turned off by turning off the MFC option. I personally like it on though.So if you don't care about Smart TV functions, for which I use my Blu ray player and Xbox 360, and don't need a 3d tv, then you really can't beat the functionality and beautiful picture this RCA can provide.However, as I stated, beware of the price. At $650, keep shopping, there are plenty of better deals....But at $399, buy two!", "Date": "July 9, 2013"}, {"Title": "Great product at a great price", "Author": "Smita Rao", "ReviewID": "R165NZXPJ0BJC5", "Overall": "5.0", "Content": "I haven't owned a TV in 6 years and bought this one after doing a bunch of research. I use it mainly to extend my desktop (I work off a tablet / laptop), and/or watch netflix / hulu. Works great with just a HDMI cable. The picture, sound, speed and resolution are all great. Completely satisfied, especially for the price and convenience.", "Date": "March 7, 2013"}, {"Title": "Love the tv!", "Author": "Katie Young", "ReviewID": "R3JH19HCTR6ELX", "Overall": "4.0", "Content": "Love the TV for the price. The only downfall would be the sound, but I am not big into turning it up too loud anyway so it doesnt bother me.", "Date": "February 23, 2013"}, {"Title": "Good picture, sound ok", "Author": "Emma Frances", "ReviewID": "R2VLHRCGRAYXMI", "Overall": "3.0", "Content": "Before you buy this tv, be sure you are aware of the following:1.  You cannot connect your surround sound with a Digital Audio Fiber Optic Cable.2.  You cannot program satellite remote control to operate this television.  I was unable to find a code that works.", "Date": "November 24, 2013"}, {"Title": "excellent buy if you don't need smart and 3d", "Author": "S. chanchan \"a professor\"", "ReviewID": "R3C07FS60MGJOF", "Overall": "5.0", "Content": "i am retired. initially, i planned to buy a sony 55\" smart and 3d at $1499.99. if tax incled, it would cost me more than $1700.00. after i compared it with rca 55\" hdtv. i cancelled the sony and bought rca. its color is solid, as good as sony, and the sound is real, no coloring. it is fast enough for me to watch sports like basket ball , foot ball, hockey, soccer and ice skating.i believe in my eyes, not the data. i don't use it to play games. so, it suits me fine.", "Date": "November 12, 2013"}, {"Title": "Great TV for the price!", "Author": "RuGeDRaW", "ReviewID": "ROE7AMXKV32D1", "Overall": "5.0", "Content": "I could not be happier with the purchase. Good luck getting a TV of this caliber for this price. Video games and Bluray look great, colors are vibrant, and it is compatible with my Dish Network remote so I don't need to keep the factory remote handy. My previous TV was a 46\" LCD that was also an RCA, and I had it for years without an issue, so I stuck with them when I upgraded.The only thing I would like is if it had more HDMI inputs. It only has 2 which is OK for most applications, but at least one more would be ideal.", "Date": "September 4, 2013"}, {"Title": "Great TV for what you pay for it", "Author": "sternbul", "ReviewID": "R2QGVK31M14FP6", "Overall": "4.0", "Content": "We bought this as a gift for our grandson who is attending college this fall. Our son hooked this set up and says the picture quality is very good. The sound isn't the greatest but for a college dorm it will work fine. Very nice TV for the price.", "Date": "August 2, 2013"}, {"Title": "great colour, bright display, no fancy features", "Author": "WallyK", "ReviewID": "R1YG5Y0VP8T43X", "Overall": "5.0", "Content": "If you are looking for a simple LED tv for ... watching tv... and not for playing games or having built in netflix or the like, then this is it. It may not have fancy features, but it sure delivers on great picture quality with great colour rendition and a bright display. At an angle you do lose some brightness, but that goes for majority of LCD based displays. I love the reds and greens this tv produces, so vibrant!", "Date": "July 12, 2013"}, {"Title": "A great deal!", "Author": "barb2012", "ReviewID": "R2WRPZ8JAZM9XP", "Overall": "5.0", "Content": "I bought this for my family for Christmas, and it's great.  Good picture and sound.  Easily set up.  A great \"Deal of the Day\" buy.", "Date": "February 26, 2013"}, {"Title": "No complaints, great price", "Author": "D. Reale \"dansgto1972\"", "ReviewID": "R3JCQQ1Q70PRLL", "Overall": "5.0", "Content": "After a short time hooking it up and playing around with the setup, I am amazed at the picture clarity especially while watching a Blu Ray. I know others have complained about playing games but I have not had this issue playing Xbox 360 games like Forza 4 and Madden 13. Other than having only 2 HDMI inputs (which I knew going in) I have absolutely no complaints and am extremely happy, especially at a great price. Sound is average (again, I knew this going in) but I'm getting a sound bar delivered tomorrow which hopefully will make a big difference.", "Date": "February 18, 2013"}, {"Title": "Decent TV", "Author": "Zeb", "ReviewID": "R25IU2515SJCZH", "Overall": "3.0", "Content": "Decent TV. You have to turn off the motion flow control (MFC) when watching movies and most TV shows in order to avoid Soap Opera Effect, which results in a bit if a reduction of picture quality. But it beats the alternative.Not a high-end set, but good for the money.", "Date": "February 17, 2013"}, {"Title": "Fantastic picture", "Author": "K. Swanson", "ReviewID": "R2XVOIF3K6RZXL", "Overall": "5.0", "Content": "Awesome TV, especially considering the price.  We have a decent A/V receiver, with lots of HD inputs, so didn't need a lot of inputs on the TV - everything goes into the receiver, and one HDMI cable comes back out to the TV.  And we don't play games on this TV, so we weren't looking for super quick reaction times.  So this TV does everything we need, and much brighter and clearer than our 8 year old DLP did.Having not owned a TV this thin before, it's a great treat - but wow, does it sound terrible.  They just can't put decent speakers in these skinny boxes, but it's to be expected.  Fortunately, as I think I mentioned, we do have a decent A/V receiver, so we just leave the volume on the TV at \"0\".  Much better that way.", "Date": "March 6, 2013"}, {"Title": "Decent  T.V  for the price", "Author": "Denyse Roberts", "ReviewID": "R14FBW1D1G0GXG", "Overall": "5.0", "Content": "I bought this television to replace an old sony television I had for 15 years. The television was placed in my living room on my wall unit. The television is not to heavy and fairly easy to handle and very easy to setup. My sister help me attached the base securely, holding the television into place. The design is sleek with a thin body frame. I love my RCA T.V and all the different features that comes with this television. I can hook up my laptop to the HDMI port on the T.V and stream movies form net flicks, which my family and I enjoy alot. The picture quality is top notch and shows a bright,crips and clear picture due to the 120 hz frame rate makes it clear. The sound is decent  and I have no promblem hearing it in my 16feet in lenght 16 feet in width  living room. You can view this T.V from all different angles and it shows great. The pixs and resolution is on point and it is also a 1080p LED HTTV , making it a definite steal.I am having a super bowl party at my house, so I can't wait to watch the game on my T.V. I also upgraded my cable services  to high defination and when I tell you how beautiful the picture look on my T.V scren it leave me very impress. Love love love my new televistion.Overall this was a great buy and I am very happy with my purchase. I'm glad I told a chance on a not so high end brand and got quality just like a high end brand like sony or samsung. I recommend this television for anybody who is looking for a good quality t.v for an affortable price.", "Date": "January 30, 2013"}, {"Title": "I finally entered the flatscreen age", "Author": "GeneOlympiaDiver", "ReviewID": "R2SMMHQLB0BX60", "Overall": "4.0", "Content": "I traded my 50 inch rear projection gigantic room-eating box for a flat screen that takes the place of a photo that's been hanging on my wall for 30 years.  About time.  The picture quality is much better than the old Panasonic.  Since my mother needs close captioning, I am pleased to say that the positioning and size of same is not so distracting on this set as on others.  Since the screen is larger, you don't have to have so much of the screen filled with writing to be able to read the captions from across the room.  As other reviewers have noted, there aren't many connections on this TV as on most others, but if all you need is TV with a DVD player and a home theater system, this will do nicely.  We have it in a room with lots of windows, and it is comfortable to watch in daylight or dark.  I would have rated it at 4 1/2 stars, but that's not an option.  Good value for the money.", "Date": "February 4, 2013"}, {"Title": "All good!", "Author": "Timm Lockhart", "ReviewID": "R3PW58C0WA0D79", "Overall": "5.0", "Content": "Great picture. Average sound (hooked it up to a stereo anyway). Great price. Received it in two working days. Ultra simple to set up. Nothing but good - go for it!", "Date": "January 20, 2013"}, {"Title": "Entirely satisfied", "Author": "Michael Stephenson", "ReviewID": "R1HKCS0T3U8SHU", "Overall": "5.0", "Content": "I bought this TV more or less on a whim, mainly because of the low price. I did read the reviews first and I'd say the favorable ones were accurate: This is a fine television for the price. The image is better than I expected and the sound is at least adequate. If you need more than 2 digital inputs or if you plan on doing significant gaming, you may want to look elsewhere (and pay more.)The only other caveat worth mentioning is that the screen is somewhat reflective if there is there's strong sunlight opposite the screen. I added some curtains and now things are fine. Recommended for non-gaming budget-conscious almost-videophile.", "Date": "February 5, 2013"}, {"Title": "so low priced", "Author": "Elaine Barclay \"DEB\"", "ReviewID": "R39KL1OGS8MTU", "Overall": "4.0", "Content": "This is the biggest best tv I have ever seen for $350. the picture is good too. when it is cold it doesn't work until the room is warm or the tv warms up though.", "Date": "September 5, 2013"}, {"Title": "You get what you pay for...", "Author": "Kevin McFarland", "ReviewID": "R8JX6LHLFEHQ2", "Overall": "3.0", "Content": "I was initially excited to see that I could actually afford to buy a 46\" flatscreen; and I didn't have to go into debt to do so. Well, all that changed after I set and started using it. What a disappointment, RCA! The picture quality isn't that great; heck, its barely good. I know, I know, that's why this TV was priced as low as it was. For having 1080p AND 120Hz, this baby sure does fall short in the picture quality dept. Isn't that why we buy flatscreens? Better luck next time for me. I'll save an extra month or two (or three), to get a higher quality product. YOU SHOULD TOO!", "Date": "July 4, 2013"}, {"Title": "Great TV for the price we paid!", "Author": "Al Heynneman", "ReviewID": "R248DN0VE8OCD0", "Overall": "5.0", "Content": "Impressive. Although it doesn't have a ton on input ports, it had enough for our living room setup. We've got our DirecTV running through a Logitech Google TV box, and a DVD player, and it all works good. The picture is fantastic, and has helped my elderly mother enjoy TV again, as her eyesight wasn't as good as it used to be, and now she can see/read everything again.", "Date": "May 16, 2013"}, {"Title": "Too Blurry for Basketball", "Author": "J. Lockwood \"Serious Amateur\"", "ReviewID": "R382A77V18W3DS", "Overall": "2.0", "Content": "Motion is very smeary on this set - I don't think it's a true 120 Hz panel. Also there is quite a bit of \"flashlighting\" from the backlighting in all four corners, and no way to turn it down that I could find. Picture saturation fades pretty fast as you increase viewing angles. Color varies a lot channel to channel. The tuner is a little weak. And what's up with a dynamic contrast ratio of only 5000? Yeah they all exaggerate, so this one must be really awful. Sound is okay, and the stand is nice (glass), but the picture is what really matters, and this set has some issues with that.", "Date": "April 22, 2013"}, {"Title": "Fantastic for watching sports, movies, not good for games.", "Author": "No.B.S.", "ReviewID": "R2FLC1S3E5Y40O", "Overall": "4.0", "Content": "We purchased this 55\" tv just before the Super Bowl. We had friends over and it was awesome. The picture is so vivid. 55\" is a real nice size, not over big and certainly not small. Our living room is 15' 20' and the tv is perfect. I tried playing vid games on it and there is some drag. So I must say if your buying for video games not the best, but fantastic for movies and watching sports. The sound is not good, we hooked ours up to a subwoofer with satellite speakers for $24.99 and it sounds great. All in all we figured we saved a couple $hundred$ even with buying speakers compared to some other 55\" flat screens.", "Date": "April 9, 2013"}, {"Title": "This TV does not have input lag. Don't listen to the negative reviews. It's great.", "Author": "Brian Lowe", "ReviewID": "RWOCKVEYH6J03", "Overall": "4.0", "Content": "I have tested this TV with my pc games and it is completely fine. Perhaps the issues others were having had to do with a firmware problem that has since been updated because it works great for me. Not great sound, but it has a great picture. I think it's a steal of a deal.", "Date": "March 9, 2013"}, {"Title": "Does not have VGA", "Author": "R. Khoja \"RK\"", "ReviewID": "R3M1ATLXZX5P11", "Overall": "3.0", "Content": "Prize was great and delivery was faster than expected. When I opened it up I was expecting a VGA connection as mentioned in the Product Description section but there isn't one. If you are looking to buy this TV and planning to connect your computer/PC then you will need a converter, no connection is available (except the HDMI).Only 1 day use so far so lets see how it turns out to be. Now I'm shopping for converters.", "Date": "March 5, 2013"}, {"Title": "Good value for the money", "Author": "Mark Gibbons", "ReviewID": "R1ZPJVJXIXGTSP", "Overall": "4.0", "Content": "I was pleased with this product. Very nice television at a bargain price. It had enough features to suit my needs.", "Date": "March 2, 2013"}, {"Title": "Great purchase!! The picture is great and great price!!", "Author": "Millie Pierce", "ReviewID": "RXOMY9F06L1UK", "Overall": "5.0", "Content": "This was a great purchase. The picture quality is very good and clear. The price was great. The only thing that I would like is one more HDMI connection.", "Date": "February 26, 2013"}, {"Title": "Nice Size But.......", "Author": "Darlene DeGannes-Yip Ying", "ReviewID": "R2P2EXAMJEV1NE", "Overall": "3.0", "Content": "This television is not showing as sharp and crisp as we would like, in comparison to others we've seen on display in stores. We've tried adjusting the settings but no luck. We are not pleased at all!", "Date": "February 26, 2013"}, {"Title": "Awesome Picture!", "Author": "Tim Rogers", "ReviewID": "RFXL0NTDI9MT1", "Overall": "5.0", "Content": "For the price, one of the best TV's on the market.  The size is perfect for the wall I mounted it on and with the addition of a sound bar and Blu-Ray, I couldn't be happier with the purchase.  I would definetly recommend this TV.", "Date": "February 23, 2013"}, {"Title": "RCA LED55C55R120Q 55 inch 1080p 120Hz LED HDTV", "Author": "Franky3919", "ReviewID": "RXHWPLH3ERPDC", "Overall": "4.0", "Content": "The picture is great on this TV but the only thing I do not like about it is the fact that the speakers are in the back.  I'm not sure whose idea it was to put flatscreen TV speakers in the back or pointing down towards the cabinet it is sitting on because it seems like I have to turn it up up up to hear it and my room isn't that big.  I have a smaller one that I purchased for my bedroom and the speakers are in the front - I only turn it up to the 1st or 2nd notch and it's almost too loud!!!", "Date": "February 18, 2013"}, {"Title": "Great!!!!!!........I LOVE IT", "Author": "isaac rivers", "ReviewID": "R3HUYZ7N2PSZ5Z", "Overall": "5.0", "Content": "This Is A Great Item. It Brings Out My Living Room In More Was Then One. Once Again I Love It. Thanks Amazon.", "Date": "February 16, 2013"}, {"Title": "Awesome", "Author": "Mountain Man", "ReviewID": "R1XW3C6OIOQSEK", "Overall": "5.0", "Content": "Item came within 5 days. They carried it in the house and set it up to make sure it worked. I am very happy with this tv. Thanks", "Date": "February 16, 2013"}, {"Title": "Great picture", "Author": "Emtae", "ReviewID": "RW3MHLAPJ3NO3", "Overall": "4.0", "Content": "Has a very nice picture.  Sound quality is lacking so I had to run it though my stereo.  If you plan on using with a surround sound system it will be a solid purchase", "Date": "June 5, 2014"}, {"Title": "RCA LED55 TV", "Author": "mt84", "ReviewID": "R2PLFLYO17PAMA", "Overall": "4.0", "Content": "I've read some reviews on this TV from Amazon, I don't quite agree with the gaming experience(s), but I may not be a hardcore gamer compared to some others out there.  I hooked up my PS3 and played Dark Souls, I have no complaints at all with it, the game was very fluid, as were a couple other RPG / Non-combat games.  That isn't to say it would look perfect if you're a Call of Duty player, but I just don't see it being horrible for gaming.  On the other hand, this is a budget TV, so YMMV depending on your gaming style.It's a very nice TV though, I have been happy with it!", "Date": "May 14, 2014"}, {"Title": "New", "Author": "James Alan Merrell-Thomas", "ReviewID": "R3SNJJ1AD494HF", "Overall": "4.0", "Content": "I just bought this TV and so far I like it.  However, I'm not sure how to get the 120 Hz refresh rate out of the Comcast Cable box.  I don't see any where to change any settings either with the TV or the Cable itself.  Otherwise the Picture is great.  Operation is fairly easy except the buttons are a little cumbersome on the Remote.  I've reprogrammed my Xfinity remote to operate the simple functions on the TV, volume , on/off.  But the Picture quality is still on the RCA remote menu.  Nice TV, I highly recommend for the price.", "Date": "April 18, 2014"}, {"Title": "Nice TV for the Price", "Author": "George Pearson", "ReviewID": "R2JV159WW0AHER", "Overall": "5.0", "Content": "Purchased to use outside by the pool and hot tube.  Large enough to watch movies by the pool and light enough to move around without issues.", "Date": "April 15, 2014"}, {"Title": "Happy TV Watcher", "Author": "Pat Rosson", "ReviewID": "R1RJMBADXA9O3B", "Overall": "5.0", "Content": "Everything works the way it's supposed to. The picture looks great.  It was well priced for value. I was reluctant to make a large purchase on the internet, but this was a wise choice.", "Date": "March 19, 2014"}, {"Title": "Fantastic sound and picture", "Author": "Theresa Escobar", "ReviewID": "R2D4MLWS3D7XBU", "Overall": "5.0", "Content": "After much research, I decided to purchase this RCA tv. I received a fantastic deal through Best Buy. After getting it home, I manually configured the audio and video. The picture is sharp and rich and the sound, while not as full as a home theater system, is more than adequate. I have decided that I don't need to spend extra for a sound bar. I am very happy with my purchase. The only improvement I could see is the addition of a n extra HDMI input.", "Date": "March 8, 2014"}, {"Title": "Great price for what you get", "Author": "Charles", "ReviewID": "R392QCLNTQ7Q5V", "Overall": "4.0", "Content": "Pros:Crisp HD colors.Incredible Black Friday priceConsSound is poor.  Sound bar almost mandatory.2 HDMI ports.  A little limited for such a modern tv.The remote is poor quality.  Sticks all the time and the navigator arrow wheel seems like it's slightly too big, so it's constantly rubbing the side when I try to change inputs.", "Date": "February 4, 2014"}, {"Title": "A Good TV", "Author": "rbaggett73", "ReviewID": "R1SP5PT1UIORXJ", "Overall": "5.0", "Content": "Very happy with this tv. I bought it based on the reviews. Some people may want to connect external speakers, but others may not. I am satisfied with the speaker quality.", "Date": "February 3, 2014"}, {"Title": "great deal!", "Author": "jennifer l", "ReviewID": "R98ZOXEEMQ5RT", "Overall": "5.0", "Content": "this has been a great tv. got it on sale so it cost me less than six hundred and i have been very happy with it so far", "Date": "January 13, 2014"}, {"Title": "Great TV!", "Author": "BG", "ReviewID": "R3R2U0QHMCK7MY", "Overall": "5.0", "Content": "I think this TV is awesome!  Color, picture, sound, remote control, etc. = ALL GOOD!  Definitely glad I made this purchase.", "Date": "January 3, 2014"}, {"Title": "Overall a good TV for the price!", "Author": "IMSC", "ReviewID": "R1EU3PHMVA29SX", "Overall": "4.0", "Content": "Bought this TV sometime back and I was pretty excited about it, a relative of mine bought it before me and showed it to me and that's why I decided to go with this model.After more than six months with it, I'm still pretty happy with it.I do notice a bit of a lag when playing games and the sound also is a bit disappointing, but the thing that annoys me the most, it's when channel surfing the TV will loose sound completely and the only way to get it back is by turning off the TV and turning it back on and then it works fine. I had this happened to me about 6 times, thinking of contacting RCA with this issue.Besides that is a pretty good TV.", "Date": "December 28, 2013"}, {"Title": "Delivered but had broken screen", "Author": "Oscar Haynes", "ReviewID": "RNL6GSOO4GIX4", "Overall": "4.0", "Content": "I had to return the one I got at Amazon.com because it had a broken screen when I opened it. The delivery men offered to unpack it but I wanted to wait until I got the wall bracket up. Return was not a problem but they were out of this model. I did find one at Best Buy so I purchased it there. It is hanging on the wall of my man cave and has a great picture and because it is a small room I have no issues with the volume or size of the speakers.", "Date": "December 27, 2013"}, {"Title": "good basic TV is a coulple of small issues", "Author": "Amazon Customer", "ReviewID": "RBRI4A61EBM5O", "Overall": "4.0", "Content": "First, it does not have an optical output, which is the preferred way to export sound to an external sound system.  Dumb move by RCA.Second, it only has 2 HDMA and on combined Composit/Component input, which is a little limiting, especially since there's no optical port..Great picture, everything else is fine", "Date": "December 17, 2013"}, {"Title": "Pleased", "Author": "Hunter \"Peanut Photography\"", "ReviewID": "R38KWA9JRSPG3", "Overall": "4.0", "Content": "I have owned this TV for 1.5 years and am pleased. The TV is nothing fancy, but I don't understand paying double for a \"smart\" TV. The only downside about this TV is when the screen goes all black, you can still seem the led's shining through.", "Date": "December 6, 2013"}, {"Title": "great Picture", "Author": "Bob Sudds", "ReviewID": "R2622DCBGDMOPK", "Overall": "5.0", "Content": "WOW what a great purchase and excellent deal. The delivery was also top notch and I always wonder how come I waited so long to buy a BIG TV", "Date": "August 26, 2013"}, {"Title": "This meets all my expectations", "Author": "Wayne Turner", "ReviewID": "R1HLI3TRMCP4HN", "Overall": "5.0", "Content": "Other reviewers have said it is a good TV for the money. I'm a little uncertain about what that means. I have nothing negative to say about this TV whatsoever. It has a great picture and the sound is fine as well. The low price was just a great bonus. It's a great 55\" TV at any price, and I have bought 14 55\" televisions (various brands) in the last six months.", "Date": "August 22, 2013"}, {"Title": "Great TV for the money", "Author": "Marsha Silagy", "ReviewID": "R28ELTD854XKC8", "Overall": "5.0", "Content": "This TV has great color with HD.  Easy to assemble....step by step directions.  Easy to unpack (some are in so tight you have to wrestle the TV out)  I would highly recommend this TV and am using mine in my great room.  The silver ban around the stand adds a decorative touch too.", "Date": "July 26, 2013"}, {"Title": "For The Price What do people Expect", "Author": "Stu n Kellie", "ReviewID": "R3QBDPZFL3XZQ4", "Overall": "4.0", "Content": "Firstly i got this TV for $400, for that price i wasnt expecting too much. The picture quality is excellent for the price, yes there are lots of tv's out there with better quality but at a much better price too. The sound is very poor but i knew that going in and it did not concern me as i use a seperate surrond amplifier. All in all for $400 you wont find a better 46inch.", "Date": "July 9, 2013"}, {"Title": "Worst sound ever!", "Author": "keyman88", "ReviewID": "R27CJE6AWMK26D", "Overall": "2.0", "Content": "Hi, I just had to let others know how terrible the sound on this TV is. And with Roku 3 only connecting through HDMI and not wanting to spring for a new hdmi capable home theater, the only sound I can \"enjoy\" when watching Roku is through the TV, and it is hideous. TVs from the 60's sound better than this. The sound is painfully harsh when music is playing and terribly tinny for voice. I can't stress enough how bad this sounds!!!So why did I rate it a 2 and not a 1? Because I got it on sale for $399. If I had paid more than that it would be going back. The picture is only OK. Not much depth of color. But I wanted a cheap TV. My last two $1200 Sony's both died a month or two after the warranty, so I'm tired of shelling out big bucks for even bigger disappointment and frustration. So it's ok for the money, but only if I can figure out how to hear good sound from the Roku 3.UPDATE 7/19/2013Having owned it for a little longer I willsay the picture is a little better than I first reported. Now that I have upgraded my sound with a Yamaha YHT-497BL the experience is much better. I still stick with my statements about the unacceptable sound of the TV by itself.The TV is no frills as was described and I'm OK with that. The owners manual is a pamphlet and I can only assume the TV does not support ARC since it isn't mentioned anywhere. Be aware it does not have digital optical out, but does have digital coax out. But the TV is better than I first thought. I will bump this up to 3 stars.", "Date": "July 9, 2013"}, {"Title": "good overall picture", "Author": "jackie", "ReviewID": "R2CHPP0TZ6XPRO", "Overall": "5.0", "Content": "TV is good for the price.  Its got here fast. Light so I was able to carry it myself.  Picture is bright and crisp.  No complaints.", "Date": "July 8, 2013"}, {"Title": "RCA TV", "Author": "Peggi S. Olson", "ReviewID": "R2UQRCGSA2TAGH", "Overall": "5.0", "Content": "I looked for days on Amazon, Best Buy, Crutchfield, etc.  I was very happy I purchased this TV.  The picture is great and the over all quality for the price was tough to beat!", "Date": "June 8, 2013"}, {"Title": "Decent for the price!", "Author": "Jason", "ReviewID": "R22553ADCN0Z9S", "Overall": "4.0", "Content": "Very decent TV for the price.  I purchased this on sale, and I was impressed with the picture quality.  Be aware it's integrated speakers are lackluster. It does have coax digital out, which supports pass-through for surround devices.  Only has 2-HDMI inputs.", "Date": "April 11, 2013"}, {"Title": "Excellent 2nd TV...", "Author": "John", "ReviewID": "R3C22YGGOW6U81", "Overall": "5.0", "Content": "This TV ended up in a guest bedroom/TV room for the kids...awesome price...plenty of options for hooking up cable, XBOX, DTV converter box, etc. Quick shipping and quality packaging make this purchase a no brainer!", "Date": "April 10, 2013"}, {"Title": "Very nice television.", "Author": "T", "ReviewID": "R812UOH7BSEDG", "Overall": "5.0", "Content": "This RCA television is perfect for what it is needed for, TV and movies. Very happy with this product at a very GOOD price.", "Date": "April 3, 2013"}, {"Title": "Great TV", "Author": "Aaron J. Foster \"-AJF\"", "ReviewID": "R14XFZMUSDV0KG", "Overall": "5.0", "Content": "I purchased this tevelvision a few months ago because there was some ridiculous sale on it and I needed a new tv for the gym I was building. I was a bit nervous from some of the reviews and even more nervous that I was leaving it in the box for months and not knowing if it worked properly. Just installed it this weekend and it works flawless! Picture is great! I can not comment on the sound as I also installed surround speakers and have this plugged into a receiver. That sound quality is phenomenal!", "Date": "April 1, 2013"}, {"Title": "Great Tv............", "Author": "Lance Frederick \"Fredo\"", "ReviewID": "R6JT38UNVW3SU", "Overall": "4.0", "Content": "Im in Saint Lucia..........and I got my TV thru Netshop........and its working great thus far..........although the picture is a bit fuzzy......but we\"re checking it might be a cable problem.........not sure........but great sound.......especially when we hook it up to our dvd player...........Lllllllllluuuuuuuuvvvvvvvvvvv the size......definitely value for money..........definitely would recommend this product............whoa!!!!!!!!!RCA.........(my former intinials.........lol.....RC)", "Date": "March 30, 2013"}, {"Title": "decent value for the money", "Author": "danno", "ReviewID": "R2108SBKMPP61T", "Overall": "3.0", "Content": "Got it on sale and the item arrived promptly. Some of the screw for the stand were missing but no biggie. Ace has the right screw size if you need them. Initially the tv had a noticeable lighter area visible in dark scenes and with the room darkened. After about a week or so though it went away. I have a tv dongle I use to stream media in HD and the picture is very acceptable with decent cotrast and tonal range... about par with most led tv's. Sound is a bit weak but acceptable. All in all a decent value for the money.", "Date": "March 29, 2013"}, {"Title": "Great TV for the money", "Author": "Jennifer R Heard", "ReviewID": "R33TGVBADHG9W", "Overall": "4.0", "Content": "I didn't have $800 or $1600 for an amazing TV so i was looking and found this TV. I read a lot of reviews on it and when i bought it I thought it was an LED TV but its actually an LCD TV with LED's. I had bought an Insignia LED TV from Best Buy and was not  impressed. The big thing for me was that this is a 120hz TV and the others I had found were almost the same amount but 60hz. I really like the picture and do agree that the sound is a little weak but is fine for my needs. I have this in my living room and the family loves it. It really does have a great picture.", "Date": "March 28, 2013"}, {"Title": "RCA 55 Review", "Author": "BRP76", "ReviewID": "RVG242TAK0VN4", "Overall": "5.0", "Content": "Great TV for the price! Free shipping and a company brought it and installed it for us! I would highly recommend as a low cost option!", "Date": "March 28, 2013"}, {"Title": "WoW - GREAT BUY, GREAT QUALITY!", "Author": "John J Quasarano", "ReviewID": "R913Z0XS212J2", "Overall": "5.0", "Content": "I purchased this televistion in February of 2013... I had been waiting for the prices of LCD TVs to come down to the ~500 dollar range for several years, and desprately needed a new television - the picture on my current rear-projection Panasonic HDTV from 2003, although still functioning, leaves much to be desired. I saw this 55\" LED-LCD on special for 579 shipped and couldn't pass it up. It arrived on schedule and works BEAUTIFULLY. I have had it for over a month, and although I do not use it for console gaming, it works exactly as I was hoping.Honestly, I couldn't be happier!", "Date": "March 27, 2013"}, {"Title": "Great TV... for the price", "Author": "LakerzPhan", "ReviewID": "R3CIRXH1DU5WW6", "Overall": "4.0", "Content": "I bought this for $599 + tax and for the price it is excellent. I've seen better TV's, but I'm guessing they also cost almost double what I paid. It's very light, easy to hang, and the picture is good bordering on better-than-good.", "Date": "March 26, 2013"}, {"Title": "Very good buy!", "Author": "Lee", "ReviewID": "R26HAWZ7P5SUME", "Overall": "5.0", "Content": "This TV way exceeded my expectations for a 46\" HDTV, 1080P, LED, 120Hz at the price I paid!  Couldn't be happier and would definitely recommend it!!  RCA LED46C55R120Q 46-Inch LED-Lit 1080p 120Hz HDTV (Black)", "Date": "March 24, 2013"}, {"Title": "A great purchase", "Author": "Melody Setliff", "ReviewID": "R1BGET10UD7M59", "Overall": "5.0", "Content": "I so love my new TV!!!! A great TV at a great price!!! It arrived quickly and the picture is great!!! Easy setup!! Met all my expectations!!! I would definately recommend this to a friend!! As I already have to many friends!!! Thank you Amazon!!! For always providing great products!! :)", "Date": "March 24, 2013"}, {"Title": "sound", "Author": "Chelli", "ReviewID": "R2VCGJRIGZE3C", "Overall": "2.0", "Content": "I like the look of the TV, but the sound is no good, starting with the volume on #1 and going up to 100, the volume stays the same from 40 to 100. Also there is no bass, even when bass volume is all the way up. You have to buy a good surround sound system if you want to hear it. So over all I am not satisfied with this purchase.", "Date": "March 21, 2013"}, {"Title": "good basic tv", "Author": "David Gilden", "ReviewID": "R1Q6LVO3X7JCWQ", "Overall": "4.0", "Content": "great picture-very good sound-good basic 46' TV. Looks good and will fit into ny space very easily  with ability to get to back of it very easy.", "Date": "March 21, 2013"}, {"Title": "2 things I did not like", "Author": "edesa duquesne", "ReviewID": "R2F1GC9AX4IBOL", "Overall": "4.0", "Content": "the two things I did not like about this tv is it only has one component input and the usb port does not play movies.", "Date": "March 19, 2013"}, {"Title": "55 inch led rca", "Author": "Jesse", "ReviewID": "RRLI8SHBZCOQH", "Overall": "5.0", "Content": "Love this TV since i turned it on. I had a 52 inch LCD before and there is a huge noticeable difference in picture quality and makes it Worth watching blue rays. Sound really hasn't been a issue i mean i don't expect surround quality from a flat screen but i can have it at 7 and hear it just fine. Yeah it would be nice to have more inputs but read the information before you buy and make sure it's going to work for what you have. I'm not big into gaming so i can't speak to much into that but if your looking for a good TV without breaking the bank this is a great choice.Amazon matched the price at $599 for me and free shipping with then unboxing and delivering it to my living room-can't beat it!", "Date": "March 18, 2013"}, {"Title": "awsome", "Author": "Jon", "ReviewID": "R4CV2LROXK38N", "Overall": "5.0", "Content": "awsome tv great pic i love it and the price was right ......... ...... ...... ...... ..... ..... ...... .....", "Date": "March 16, 2013"}, {"Title": "good for money", "Author": "Helen Helm", "ReviewID": "R35QHM3VCTV90O", "Overall": "4.0", "Content": "We are happy with the set, just wish we had bought a larger one, so we will move this to our bedroom, and have ordered a different set for the front room.  We have just become spoiled over time with the size of screens.", "Date": "March 1, 2013"}, {"Title": "You can't go wrong for this price!", "Author": "Richard L Lacks", "ReviewID": "R2D60JMNSSPZXT", "Overall": "5.0", "Content": "This is a very nice TV for the money. The sound is not as great as TVs with bigger frames, but Tvs are changing now and the frames as getting smaller. If you are big on sound I would recommend getting a home theater system to go along with this. Again, this TV is a good bargain and is good quality, you won't be let down.", "Date": "February 27, 2013"}, {"Title": "didn't last 6 months", "Author": "prcross", "ReviewID": "R1E0WGELC1QAC1", "Overall": "1.0", "Content": "This TV just shut off all the sudden.  It truns back on for about 5 seconds and turns off.  I have to get a tech to my house.  Didn't last 6 months.", "Date": "August 27, 2013"}, {"Title": "RCA 46 inch", "Author": "Steven V. \"SciFiFan\"", "ReviewID": "R2XMAPE8865AFK", "Overall": "5.0", "Content": "I chose this rating because it filled all the requirements that I was looking for.  Its dimensions were just right for the entertainment cabinet.  The picture was sharp and color was very nice. The price seemed very competitive.", "Date": "January 15, 2014"}, {"Title": "Tv went out within a week", "Author": "Pamela Hitson", "ReviewID": "R3NW2IF4VF177P", "Overall": "2.0", "Content": "I bought and tv picture went out within a week I bought in good shape, it was discounted 50 percent but not near what it cost to fix, I lost?????", "Date": "July 17, 2013"}, {"Title": "RCA LED55C55R120Q 55-inch 1080p LED HDTV ( Black )", "Author": "Ron P.", "ReviewID": "R2T3LDT1YBSM3K", "Overall": "5.0", "Content": "Could not be more pleased with the TV , simple to set up , bought RCA ,  as our last TV was an RCA purchasd in 1991 only had it servised once .  Can't say enough good about Amazon, delivery was on time , unpackaged and set up was prompt, service personal were courteous , and tidy .  Online invoices were correct , comprehensible , and printable , thanks Amazon", "Date": "July 6, 2013"}, {"Title": "not what it say it is", "Author": "Ernestine Williams", "ReviewID": "R1H4EUEATITIYG", "Overall": "3.0", "Content": "this tv said on the box and the computer that it's a1080p and 120hz  but when the tv come's on it say it's a 1080i and 60hz ; why is that", "Date": "June 23, 2013"}, {"Title": "AWESOME!", "Author": "Juan", "ReviewID": "R1KRPYVTPTOH4W", "Overall": "4.0", "Content": "This is a AWESOME TV for the price. You cannot beat it. I did a lot of research before buying and I will say I saved myself easily $800 from other brands of the same size. This is pretty standard and basica HD 1080IP TV, the only con is that the volume isnt the best, but I always recommend surround sound and my over priced LG and Samsung I have I have the same issue. So this TV isnt an exception. Other then this, its a great TV for sports, movies, and games. I have owned this for 3 months now and I am glad I purchased this TV.", "Date": "March 22, 2013"}, {"Title": "Nice product 55\"", "Author": "John B", "ReviewID": "RYRPD8OKF5W2X", "Overall": "4.0", "Content": "Video quality is nice once you adjust your user preferences.  Menu is labled accordingly and it has several preset video settings.  Audio is a little lacking but that is to be expected on these slim monitors.  Had several inputs to choose from for Dish input, disc and video game if you dont mind one of them RGB. Overall I like this product.", "Date": "March 20, 2013"}, {"Title": "Great TV, great price!", "Author": "CW52001", "ReviewID": "R1D7N3G8NOQY0A", "Overall": "4.0", "Content": "This is a great t.v. for the price.  Picture is excellent. Delivered within a week of ordering, and delivery service even helped take it out of the packaging to check for any damage. Only reason I didn't give it five stars is because of the sound, but with a t.v. this slim, it would be unrealistic to think they would have room in there for great speakers.  I would definitely recommend this t.v.", "Date": "February 2, 2013"}, {"Title": "This TV SUCKS!!", "Author": "Patricia Moore", "ReviewID": "RZQ2X5AAVOC67", "Overall": "2.0", "Content": "This TV keeps disconnecting from everything! One minute it is working fine and then all of a sudden it just goes out and then displays \"No Signal\". All the other TV's in my apartment are working just fine and remain connected to the cable. I wish I could send it back! The other times I have been able to reconnect it. I have not been able to do so this time. I have not even had it 7 months yet!", "Date": "September 8, 2013"}, {"Title": "Warehouse buy", "Author": "Shipmate", "ReviewID": "RLT2FN9ZECCD5", "Overall": "2.0", "Content": "Unfortunately the minor scrapes and damage that wasn't supposed to hamper the viewing quality of the device was actually it had been smashed at some point and you could see a wave pattern in the lining of the backlight that is noticeable in very dark or very bright scenes.  The size was good the sound was good the colors and quality of the shows are good.  I wish I hadn't tried to save 15 dollars on the Amazon Warehouse buy though.", "Date": "March 3, 2014"}, {"Title": "Best TV I have ever bought", "Author": "Diesel", "ReviewID": "RRDV7SG6FN2PV", "Overall": "5.0", "Content": "So happy I picked this up during the black Friday lightning deals... crisp clear picture and impressive contrast comes together for a very good TV.Pros:Easy Side Panel Access to all of the connections on the left side of the TV (your left if you are facing the TV).Great picture, 55 inches of itGlass decorative stand is pretty sharpPrice!!!!Cons:Audio is okayOnly two HDMI inputs, works for me though.If you have a speaker system to hook up to this TV (you should if you are investing in a TV this size) and you can make do with two HDMI inputs, then this is absolutely the TV for you. Granted, I got it at $550.00, but I would have been okay with spending $650.00 considering the quality of the product.", "Date": "December 26, 2013"}, {"Title": "Best Purchase", "Author": "Larry W. Barrett \"happygolucky\"", "ReviewID": "R23RNJCTMKFLE8", "Overall": "5.0", "Content": "I bought this for my daughter at a great price on Amazon, I thought so much of it that I went back to get me one and they had upped the price. Great HDTV with great picture.", "Date": "October 3, 2013"}, {"Title": "Amazing picture", "Author": "Todd", "ReviewID": "R1Q5RQ8V56Y0UY", "Overall": "5.0", "Content": "So far so good, after a week of turning on the tv.  Used for our company at conferences.  Recommend to others.", "Date": "May 26, 2013"}, {"Title": "did,nt work. 46in", "Author": "Ronald K. Nelson \"ron\"", "ReviewID": "R3FWZWPWH9ZLZV", "Overall": "5.0", "Content": "first tv 46in did not work at all.called amazon tel, and he talked me through some steps?still would,by come on. sent back had another in one day it work,s great .", "Date": "May 21, 2013"}, {"Title": "Nice size, great picture, good sound", "Author": "A Reliable Consumer", "ReviewID": "RGGSEDDE4LQW", "Overall": "5.0", "Content": "Can not beat the price and quality of what you get with this TV.  Nice stand, though not a swivel base. Good remote layout.", "Date": "April 21, 2013"}, {"Title": "great value", "Author": "mbmom", "ReviewID": "R2PQ53X4UWNAU6", "Overall": "5.0", "Content": "Tv was easy to set up and the picture is great. Instructions easy to follow and cables where all easy to attach.", "Date": "April 21, 2013"}, {"Title": "Great for gaming..dont be fooled by other reviews", "Author": "kenneth parlee", "ReviewID": "R2LPNGY7GDRLND", "Overall": "5.0", "Content": "This tv is the best value on the market..i got the 55...regarding the gaming..i think its fantastic for gaming!!!i believe the people who are playing are just not used to the frame rate on this tv...looking at the other reviews people went from 32 inch insignias and other lower quality brand tvs to this...you will get used to it...my 52 samsung 120 lcd blew up after a lightning storm...im a tv buff...46 samsung in bedroom, 32 samsung in my office...paid 1300 for the 52 had it 3 years and they wanted 500 to fix it..paid 588 for this when it was a deal of the day figuring mine as well get a fresh one if Im gonna drop the dough anyway..This is a great entry level television..as long as your not a spec freak only has 2 hdmi does not have rca audio outputs..nothing a 5 dollar wire on amazon cant cure..dont hesitate to buy tv...you get 30 days to return it also if for some odd reason you are not \"SATISFIED\" with the quality of the picture or your gaming experience...if your not \"SATISFIED\" go spend 2-3k on a Sony xbr which in 2 years will be worth 1000 bucks..I like to call these problems \"PEOPLE LOOKING FOR PROBLEMS CAUSE THEY HAVE NOTHING ELSE GOING ON IN THERE LIFE PROBLEMS!!!\"\" do yourself a favor buy the tv and keep the rest of the cash in your pocket..all the tvs are made in china or taiwan anyways...except vizio maybe???i will upload a screenshoot of my recent activity on black ops 2 where i had 59 kills and 9 deaths...not to bad for a BAD GAMING TV!!!", "Date": "March 1, 2013"}, {"Title": "great tv", "Author": "derick canfield", "ReviewID": "RDII7Z6CYQ2E7", "Overall": "3.0", "Content": "great tv only reason it gets 3 stars it cause of shipping and the problems i had to go though with it i ordered and got two day shipping and 7 days later i finaly got the tv but the picture is great and it works fine with my xbox 360 slim. idk y other ppl are having problems with theirs.", "Date": "February 19, 2013"}, {"Title": "great value", "Author": "PHenry", "ReviewID": "R1A87ZLDC3A7YW", "Overall": "4.0", "Content": "I have a 'smart' tv already, and was interested in a basic display unit.  This TV has a great picture, simple to use, and a very good price.  If like me you don't need your TV to be an internet browser, netflix receiver, gaming display and all the other things a smart TV gives you, this is the unit you want.", "Date": "February 8, 2013"}, {"Title": "PERFECT FOR ALL GENTLEMEN", "Author": "GABRIEL  L", "ReviewID": "R1V7L46Y5QWZD1", "Overall": "5.0", "Content": "I purchased this RCA TV 46 inch in NOV. 2012 and it's very good in all aspects. RCA Technicians would come to you should there be any problem. Because of these, I have sent the first one home and purchased another one just in OCT 2013 which I am currently using right now. BRAVO!! to RCA TV 46 inch.", "Date": "November 25, 2013"}, {"Title": "No VGA input as indicated in description", "Author": "D. Odelius", "ReviewID": "R27XGNMQ3EYWRG", "Overall": "3.0", "Content": "Description says: \"The LED55C55R120Q LED TV features a high-definition, 55\" display at 120Hz, ATSC/NTSC tuner, and HDMI connectivity. With additional component, VGA, and conventional AV input, as well as a USB port to play photos and music from your USB devices, this RCA HDTV makes it easy to connect you to all your favorite media.\"There is no VGA input.  We bought it specifically for this feature, as it is fairly difficult now to find a good cheap 1080p HDTV with VGA.  We had to run out and screw around with adapters and whatnot because the laptop we had only had VGA out.It is otherwise an acceptable TV for our purposes, which was to use for running a video at a trade show.", "Date": "April 25, 2013"}, {"Title": "About the same as my RCA 42 inch TV comments", "Author": "jlggfn", "ReviewID": "R3SY27RJ3FALZG", "Overall": "2.0", "Content": "Around the last week of January 2013 I purchased an RCA 42 inch TV. The following comment are mostly copied and past to the 46 RCA TV I purchased on February 14, 2013. The comments are: This is a good looking unit, and the sound quality was acceptable. It played well until I changed channels or when a channel was not on an HD channel. We noticed a shadow on the bottom, right and left side of the screen. The shadow (kind of egg shell color) looked a bit like a 'burn-in' (like when a monitor has been left on and you can still see an image when it was off). The shadow on this unit was not noticeable when the unit was off. The shadow was especially noticeable when the screen or picture was on dark or black areas of the picture... Maybe I got one out of thousands that RCA made that was not one of their best units. There are other good reviews, but I'm not one of the good reviewers of this particular unit. The Amazon associate was helpful with the return of this item. I plan to purchase another TV from Amazon, just not another RCA unit.Further comments on the 46 inch:The shadow on the sides are not as noticeable on this 46 inch, but when going to a commercial and the 1 or 2 seconds it takes to transition between pictures, there is a light color shadow that is seen on the screen. My first thought was maybe I got a bad one, and I decided to not purchase another RCA TV, but I reconsidered and I gave the 46 inch RCA a try. I made a mistake. I'm now convinced that it's an RCA design issue that I don't like. I do not recommend an RCA TV.Update, February 18, 2013:Since writing reviews on the RCA 42 and 46 inch TV's I have been in contact with Amazon and a RCA tech representatives. I'm not sure I understand the \"backlight\" that is seen, but I will add a link to what may assist in what I consider an ignoring view. The Amazon tech had not experience what I described to him, and the RCA tech had no clue but did agree to send out a tech (which I'll probably cancel later). From speaking with the techs, I have concluded that the new LED TV's, at least an RCA, is this is the \"new normal\" now. The shadow 'may be' the backlight that is seen on the screen and this should not affect the actual picture quality. However, new normal or not is ignoring to me. The link that might help to explain this is:[...]Good luck.", "Date": "February 17, 2013"}, {"Title": "TV ok, horrible for video games", "Author": "Doug R. Troupe \"drt568\"", "ReviewID": "RS2B87Z8NK2DW", "Overall": "2.0", "Content": "HDTV worked well.Played Halo 4 split screen and got dizzy. So did everyone that tried to use these sets in split screen.120HQ LED is not what you need to play video games. Also no game mode.Plasma is smoother refresh rate.", "Date": "January 16, 2013"}, {"Title": "Great Picture great price", "Author": "Kelly B :o)", "ReviewID": "RQR8XBZOWEAH3", "Overall": "5.0", "Content": "I found this on clearance / sale and had some gift cash to spend so it fit perfectly into my needs", "Date": "April 26, 2013"}, {"Title": "Highly misinformed", "Author": "patrick  Achorn", "ReviewID": "R7LO849L0J4SK", "Overall": "2.0", "Content": "It's and lcd tv not led, its 60hz not 120hz, like what the hell, its a boring crappy picture, save your money buy something better.", "Date": "March 19, 2013"}, {"Title": "LETTERS TO THE MANUFACTURER ABOUT THE EXTREMELY POOR QUALITY OF THESE TELEVISIONS", "Author": "Steppen-Wolf \"Wolf Britain\"", "ReviewID": "RAWH937XR3MQN", "Overall": "1.0", "Content": "///As as result of my bad experiences with this model of RCA HDTV, I thought others considering purchasing this product might be interested in reading my following correspondence with the manufacture, \"ON Corp USA Inc.\", about same, and the specifics of the problems with this particular model (update---I have returned this TV for a full refund):Hi,So far so good on the brand new version of the TV. Of course, I never got to see the picture on the used ones, either of the same model or the old model. I've been watching the new TV for almost a week now, and it looks pretty good for the price (certainly NOT worth the $650.00 so-called regular price, though). The dynamic contrast ratio is not very good, and there is ghosting on non-HD movies and shows; but, naturally, HD looks much better. I've had a very difficult time adjusting the picture quality to my liking; because, like Samsung HDTVs, the color(s) is and/or are \"off\", not very \"vibrant\", and the overall picture appears to tend towards the \"orange(ish)\" and \"green(ish)\". I've tried adjusting the tint with more red and less green (unfortunately, there is not a \"blue\" adjustment; because, if I'm not mistaken, if I could increase the blue it would probably make all of the colors more accurate); but the picture, tending towards the \"orange(ish)\", is already too red, so there's really nothing that I've been able to find that corrects the problem. Also, the dynamic contrast setting(s) of the TV make the picture too \"washed out\", so I've had to, usually, have that fully shut off, except during movies and/or shows that are too dark. So, it is very irritating that I keep having to change the picture adjustments; which, with other TVs I usually don't have to do; and I like usually being able to leave the picture adjustments alone and the same; which, with the other TVs, usually works out just fine. I get a better picture with an off-brand TV, too.Another disconcerting issue is that there seems to be no \"backlight\" adjustment like most HDTVs have. It would be very nice to be able to turn it down and perhaps make the backlighting last longer(?), and/or to make the picture less \"bright\" and/or \"washed-out\" when the dynamic contrast is turned on(?).Anyway, what can I say for $450.00? For that price, I probably can't expect much better. On the positive side though, the concern about \"edge bleed\" does not seem to be an issue AT ALL, and I don't see ANY edge bleed whatsoever; so the guy on Amazon who wrote a negative review about that, must have had a bad unit that wasn't assembled properly, or had the problem for some other reason caused by his particular TV being a bad unit (shipment damage?).Therefore, the next model of this TV needs a backlight adjustment, as well as more color adjustments. Also, the more I look at fast action on this TV, the more distortion I see due to an inadequate dynamic contrast ratio (and this I took notice of while watching an HD movie), which may cause me to return this product. In addition, the blacks are too black, and there's little or no detail in the shadow areas of the picture (which I seem to recall was a critical review on Amazon of this TV, too); and the same goes for the whites as well, as they're too white and there's too little detail in the bright areas of the picture as well. So, your company needs to much improve the dynamic contrast ratio, too. If you cut back on these things from the old model, you need to restore them.Well, I thought that I would give you some constructive feedback about this TV so your company could hopefully make improvements in the next model. I hope that you find this helpful; and that, even though most people don't usually want to hear negative feedback, it does some good regardless.All the best,/s./ WolfS. Wolf Britain, Customer///Even more detail(s) about the problems with this TV are as follows:Dear _______________, et al.:As a result of my further consideration of the very real problems with the RCA HDTV in question, they are much worse than I originally thought they were. The dynamic contrast ratio is much worse than I thought, and having the dynamic contrast setting(s) turned on make(s) it even worse as well. In addition, it appears that these TVs were allegedly designed to be 120hz in order to, at minimum, make up for the extremely poor dynamic contrast ratio, which it doesn't make up for at all; or to, at maximum, be a selling point regardless of how extremely poor the dynamic contrast ratio of these TVs is. And it looks to me like these TVs are not true, full 1080p TVs; but, rather, 720p or less, where the picture is stretched to 1080p, because the picture of even HD signals are not fully sharp like they would be if they were true, full 1080p HD signals. Instead, the picture is slightly out of focus.I have two other 1080p HDTVs, both 27 inch (Samsung) and 24 inch (Sceptre), setup to show the same HDMI signal side by side, and the picture on both of those other two TVs, even though simply LCD and not LED, is much sharper than the picture of the RCA LED model in question; and even the non name brand Sceptre TV with 70,000:1 dynamic contrast ratio has a much better dynamic contrast ratio than the 46 inch large screen RCA has. Thus, I am extremely disappointed with the latter, and wish I had neither ordered it nor set it up; because, as it is, it is not worth even $450.00; and, as a result, I am very likely going to return it for a complete refund. For $450.00 or more dollars, this TV should be truly and fully 1080p, provide a totally sharp picture, and have a much higher dynamic contrast ratio, particularly because it is an LED model.Most LED HDTVs have a minimum of 100,000:1, and usually 1 or 2 Million:1, dynamic contrast ratio; but, as your company appeared to try and inform me, this RCA model HDTV really has only a 4,000:1 dynamic contrast ration, which is awful, as well as difficult to believe, and as I tried to tell you and/or _______________. As I also tried to explain to one or both of you, an LED HDTV like this RCA model should be only about 4,000:1 in STATIC AND/OR NATIVE contrast ratio alone, and many more times that in DYNAMIC contrast ratio; otherwise, the TV in question is very poorly designed, and is an extreme ripoff. As a result, no wonder it is and/or was marked down $200.00; making it, as I said above, not even worth $450.00; and I couldn't be any more disappointed in this RCA TV than I already am, although I keep trying to talk myself in into finding it \"acceptable\" enough to keep and not return it because of how difficult it is to disconnect, remove and repackage it in order to return it; even though, on the contrary and considering everything, I am very likely to return it regardless.If you have another fully sharp 1080p HDTV at home that is a smaller size, try putting it side by side with the 46 inch RCA, using a $20.00 1:2 amplified video splitter from Amazon.com as I have done, and you should see what I mean. Actually, though I didn't think it would work this way, I have two of those amplified video splitters wired in series so that I can have three identical output signals rather than only two, and so I can thus have all three TVs showing the same video signal side by side; and, as I already said, the picture of the other two TVs named above is much sharper, and better, than the RCA's picture, and even though neither of them is LED, but only LCD. (I believe the 27 inch Samsung is also 70,000:1 like the Sceptre as I recall, or 100,000:1 at the most; but neither of them is out of focus, and both of them are completely sharp and full 1080p HD, unlike the RCA.)Therefore, everyone who thinks that this 46 inch RCA TV is a decent TV, including the positive reviewers thereof on Amazon.com, are greatly mistaken and fail to recognize just how unsatisfactory, unacceptable and disappointing this TV is; whereas I don't think I can ignore and live with the unsatisfactory aspects of same. Because, for the money, I expect much better than this, with a dynamic contrast ratio of at least 100,000:1 or much greater; otherwise, it might as well simply be an LCD-only TV, and not an LED model, and thus not even worth buying, regardless of whether it's LCD or LED. So, if your company continues to manufacture these TVs, I hope they will redesign it and greatly improve its quality and purchasing worth, rather than continuing to rip customers off with the extremely poor design and quality of this TV.Update before I sent this message: The dynamic contrast ratio does look better when playing Blu-ray disks; but, even though they are 1080p, the picture still isn't completely sharp; which, obviously, it should be; whereas, on my other HDTVs, 1080p IS completely sharp. It defeats the purpose of HD (high definition RESOLUTION and/or SHARPNESS). The whole purpose of HD is to provide a picture that's so sharp, resolute and realistic that it's lifelike, with no blurriness and/or being out of focus whatsoever.Pixels have started to go out, too; although, so far, I have been able to lightly press on that part of the screen where the pixel(s) is and/or are out, and get it and/or them working again. But it's not a good sign, and more and more it makes it appear that your company doesn't manufacture these TVs very well; either that or the parts you're using, the calibration of the TVs, and/or the quality control aren't very good. Thus, needless to say, I am very disappointed in and unhappy with this product.A highly dissatisfied customer,S. Wolf Britain///", "Date": "March 18, 2013"}, {"Title": "Tv review", "Author": "Giovani Zullo", "ReviewID": "R13M6NV2ZFQEJB", "Overall": "1.0", "Content": "I love the tv but it has to little amount of hertz and is bad for fast moving games, movies, or tv shows.", "Date": "October 28, 2013"}, {"Title": "You should avoid RCA.", "Author": "Chris", "ReviewID": "R35QGG5JS6HX3T", "Overall": "1.0", "Content": "I just put this in my cart and then let it go immediately.  Had one before and was lucky to get my money back.  Nothing against amazon since I did not buy from them.  Avoid RCA.  If you must I wish you luck.  Lacks the quality.", "Date": "December 2, 2013"}, {"Title": "^^^ BEST. REVIEW. EVER.", "Author": "Eizzy", "ReviewID": "R239DCS1Z3PZOQ", "Overall": "2.0", "Content": "Yeah the tv is useless for gaming as others have already stated. My friend has the same tv and has incredibly terrible lag for gaming.  But Brian and his knife throwing tale is a phenomenal review.", "Date": "January 25, 2013"}, {"Title": "had to get a new tv.... wish i didn't", "Author": "Brian McGrath the Carny", "ReviewID": "R2E05CIXNJCMHI", "Overall": "3.0", "Content": "Greetings fellow amazonians, I picked this tv up because of what happened a couple days ago. As some of you know I have been practicing knife throwing so I can be more than a carnival barker at my job (and I am getting very good at it). The issue started when I came home from practice a few nights ago and left my new knife set out on the table. Mongo, my trailermate, decided he wanted to give knife throwing a shot so when I went in to take a shower he grabbed my knives and started flinging them at the walls. If this was the only thing I would have forgave him for it (we live in a used trailer that has a surprising amount of knife holes in it already). Then he chucked one at eugene while he was sleeping and scared the crap out of him. Then when I came out of the shower there was a knife stuck to the outside of my bathroom door. At that point I had enough I started yelling at mongo and he kept chucking knives at me. One hit our computer, the next went into eugenes xbox and finally he threw one into my 3d tv. I was lucky enough to pull the knife out from the door and throw it back at mongo. It hit is reverse on his rascal and he beeped his way out the door. Then I ran out and yelled at him in the side yard while still dripping wet and in my towel. I'm sure my neighbors are happy about that little scene. Anyhoo I picked up this tv which is nice, but not 3d, and thankfully no one was hurt (although I made mongo sleep under the trailer the last few nights). Thanks amazon for helping me get my life back in order", "Date": "January 25, 2013"}], "ProductInfo": {"Price": "$637.99", "Features": "120Hz Refresh Rate\n2 HDMI Connections\nResolution: 1920 x 1080\nContrast: 5000:1\nUSB Media Play for Photos and Music", "Name": "RCA LED55C55R120Q 55-Inch 1080p 120Hz LED HDTV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51oTsK7Zq%2BL._SX300_.jpg", "ProductID": "B0091DQ79K"}}