{"Reviews": [{"Title": "Great TV", "Author": "Mark C. Merrill", "ReviewID": "R2L39M0TO93FMN", "Overall": "5.0", "Content": "I purchased this TV at a local retailer. I bought it for a bedroom TV. It is great. I don't understand previous review, This is my second LED TV and both Vizio. I looks great from the sides and high and low. It is approximately 10 feet from me in bed,and the picture is crystal clear and bright.I have no complaints. The speakers are minimal, as are all in slim TVs, but for the bedroom acceptable. I have multiple TV's in my house and different brands, and the LED's have the best pictures. I also have a Vizio 26\" LED which has an equally great picture. As in all flat panel TVs, the backlight and picture brightness are adjustable, and I do turn them up to maximum, for a bright brilliant picture. I highly recommend this TVavailable for a great price.", "Date": "March 5, 2013"}, {"Title": "Happy Birthday to Me!", "Author": "Nicole Kiser \"Draw2much\"", "ReviewID": "R2I4S4Y1V18XRV", "Overall": "5.0", "Content": "When I was looking at TVs I had only had a few things I wanted: It needed to be under $250, be a light weight 32\", have a decent-to-good picture quality, and speakers that were clear and loud. This TV does all those thing and does them well! I mostly use this TV to watch streaming video from my laptop, which it does very well through the HDMI hookup. Everything was extremely easy to set up. The remote is simple to use (or at least no more difficult than our old Sony LCD remote).I think the viewing angles are quite good, though admittedly I'm not looking at it from any extreme angle. As far as colors go, I quite like it (I have it set to \"game\" mode). I think it actually looks better than our 6yr old Sony LCD (which we paid $1,200 at the time for). I also like how everything seems really clear and crisp, even when streaming at 480p.Our Sony LCD speakers struggled with sound, even in a small living room. (We eventually got Surround Sound, so no real loss.) I was a bit worried about how something much thinner and smaller would do. However, I was pleasantly surprised. At 20% volume, this TV was actually *too loud* and I had to turn it down to 10%. Voices and sounds are crisp and clear, which is exactly how I like it!It looks really sleek too and it so wonderfully light! (This was replacing our guest 19\" \"fat\" TV.)I can't speak about longevity, since I haven't had it that long.", "Date": "July 26, 2013"}, {"Title": "Great TV For The Price", "Author": "Ron K", "ReviewID": "R3736XUBTJPSAT", "Overall": "4.0", "Content": "I purchased this TV to replace a dated, heavy analog CRT unit in our bedroom that was being used through a DTV converter box. The TV tuner up and evaporated one night. I initially zeroed in on a 24\" unit but when viewed at a retail store the 32\" made more sense. Vizio was on the top ten list based on reviews in general. This particular unit won me over as it has speakers with some discernible girth. It seems all flat screens suffer from \"Skinny Speaker\" syndrome and this is particularly pivotal to the hearing impaired such as myself. Set up was fairly simple. Picture quality is more than ample and quite satisfactory for viewing by the average viewer. It seems some people are obsessed with the clarity and sharpness of every pixel. The sound was initially disappointing (like two screaming tin cans). Out of the box you're given a brief printed instruction booklet that covers the absolute basics. I highly suggest downloading the full instructions from Vizio's website. From this PDF I discovered the sound quality can be somewhat enhanced with bass and treble controls making it more user friendly. There's ample inputs/outputs to handle the connection of a wireless headphone unit, VCR (yes, I still use one) and a portable DVD player in conjunction with the VCR. I have everything as before the great tuner meltdown plus the ability to record one show while watching another (something that was lost in the big DTV conversion several years back). On the negative side there's an INFO button on the remote that will display what channel your watching. Press it a second time and an additional bar appears with current program title. Press it a third time and still another bar is added with a brief summary of the program. You'd best be a speed reader as this info is timed and only appears briefly and not nearly long enough to take it all in. Also the text bars are quite small adding to the reading challenge. The set up procedure asks for your time zone. You would think the current time could be displayed at some point but in reading the enhanced directions this option requires the set be connected to the internet.Seriously ? I would guess for in exchange to display the time you give the programmers free data mining. I'm spoiled by my dinky yet versatile DTV converter that can display the current time, program info and even what's coming up next and not snatch it off screen before you're ready. I also agree with one reviewer that the included stand is flimsy and the TV sits slightly off level. The REMOTE gets a plus for one feature: it allows you to remotely control the set. Period. The remote gets an absolute FAIL for design and function. The shell design is completely symmetrical and in the dark (remember, this is a bedroom use unit) you literally don't know which end is up. The buttons are generally too small and in no real distinctive layout. After several weeks I still can't get the feel for true vision free operation. Overall the TV delivers a bright, clear picture and decent (adjusted) sound for a reasonable price. After all, that's all I was looking for.", "Date": "July 26, 2013"}, {"Title": "VIZIO E320-A0 32-inch 720p 60Hz LED HDTV is a great TV for the price, but be aware its only 720p", "Author": "Christopher J. Cowen", "ReviewID": "R1WSIICIASWYBN", "Overall": "5.0", "Content": "VIZIO makes a nice TV and the fact that this TV is only $248.00 is pretty awesome.  So first off I would definitely recommend this TV one for the price, second for the technology within the TV, and third for the fact I don't have to fight people in the stores for it. But I will tell there a few things to be aware of. This is only a \"720p\" and not the standard \"1080p\" definition most TV's are today. The second thing I noticed while reviewing this TV it that it only has to 2 HDMI outputs. This could be an issue for you if you will have alot of things plugging into it.  But with all that said I have had some great looking 720p TV's and this TV is under $300 dollars. So I still would recommend it.2 years ago you could not even dream about getting a 32 inch LED TV for under $300 dollars, times have definitely changed. This review will act as a guide as well as a review for this VIZIO.One thing that I have found with TV's that its very important to actually look at the TV in person. Now when you look at the TV's, go to a place like Walmart to see them, because many times specialty stores like Best Buy play with the lighting controls on the TV and in the store to skew the image to there advantage. Once you look at the TV simply look and decide which one looks better to youNow first thing when a TV says its LED that is very similar to LCD. The main difference with this type of TV is the way the lighting within the TV is done. LED is back-lit better so that their are no dark spots on the screen.The next step is to look at the features that are offered with the TV.  Here are some offered by this VIZIO TV:- With LED backlighting the pops with rich color and vivid details.- This LED HDTV is up to 50% more energy efficient than conventional LCD HDTVs to save money.- The slim frame design for this VIZIO lets you maximize your space, allowing you to fit a bigger screen size TV in the same space.- Here is the input/Output layout: 2 HDMI, 1 Component, 1 Composite (shared with component), RF Connector for Internal Tuner,  1 Ethernet, and 1 USB 2.0.- Item Weight = 13.5 pounds- Dimension 19.2 x 28.7 x 7.5 inchesThank you for reading my review, if you have any questions feel free to email me, I would be happy to help you with any questions you have.", "Date": "December 17, 2013"}, {"Title": "Good", "Author": "Wanda Martin", "ReviewID": "R2D019OK8LIZ6Q", "Overall": "3.0", "Content": "It's a little smaller that what I excpected but it's a nice little tv. I wish  it would of been a 40inch, but this is just a start.", "Date": "January 12, 2014"}, {"Title": "Good quality Picture - (with a caveat)  Very light weight.", "Author": "M. Thaler", "ReviewID": "R1SPJ5H0N4L3KE", "Overall": "4.0", "Content": "We use it very seldom in bedroom of second home.  Thus, the fact you have to view the screen almost head on doesn't matter to us.  This would NOT be suitable in a room where people would be viewing more than a few feet from dead center.  The picture almost disappears!  I do not know if this is a \"feature\" of all LED screens.  It seems to me that older LCD screens hide a little bit wider viewing angle.  Of course a small screen like this is not meant to be your main screen.  Nothing beats the quality of a plasma.  With plasma, you can have a whole room full of people viewing - including those sitting off to the side.  We paid $250 at Tarjay.  Amazon did not have this low end model themselves.", "Date": "February 21, 2013"}], "ProductInfo": {"Price": "$353.41", "Features": "1.LED delivers richer colors and more vivid details\n2.Slim frame design for a more immersive picture with less frame around the TV\n3.Up to 50% more energy efficient than conventional LCD TVs\n4.720p HD resolution for high definition clarity\nWhen compared to same size 2012 LCD HDTVs lighted with CCFL technology.", "Name": "Vizio E320-A0 32-Inch 720p 60Hz LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41Gkniq8bGL._SY300_.jpg", "ProductID": "B009W4QYG4"}}