{"Reviews": [{"Title": "Mostly Good and A Little Not So Good", "Author": "GH", "ReviewID": "R3E4VTK4DAULO7", "Overall": "4.0", "Content": "Good first, the picture quality is outstanding and the sound is also very good.  Movie mode is my favorite out of the box picture setting.  I took a lot of time looking at all the new TV's and I didn't really feel the burning need for 3-D, so the Samsung unit seemed to have the balance between picture quality and features.  That's frankly what someone would expect from a top tier TV brand like Samsung, so no extra brownie points can be given since what I received was expected.  \"All Share\" app is great for viewing network stored family photos.OK...now to the not so good.  \"Smart TV\" welcome screen and marketing falls short in a few areas:1.  Your best bet is to plan on a wired LAN connection and don't expect much from the wifi capability of this TV.  I have a Linksys E4200 router and 12Mbps cable connection (wired) and 6-8 Mbps (wireless in that location in my home) and there was way too much buffering when trying to run on wireless.  The TV was within range and had 2-3 bars of wifi and I experienced buffering on YouTube and Netflix.  Solution I found after testing was to simply run via wired CAT5 connection and I chose to use a static IP address.  I'd live to find a way to increase the RAM via a USB stick addition if that could be possible in a future firmware update.  This may not be an issue of your wireless router is right near the TV, in my case, my router is about 40' away and that wasn't good enough IMO.2.  Application manager cannot remove all factory installed apps that are not desired, so you'll need to expect to have to live with some bloatware as many manufacturers provide with their new units.  I wish Samsung would give us the capacity to delete any and all apps with a future firmware update.3.  Netflix viewing needs to be adjusted to increase the streaming quality to the highest given the 1080p resolution and lack of up-sampling.  To do this, you log onto your Netflix account on the web (not on the TV app) and change your streaming quality setting.  After doing that, you'll be very happy with quality of streaming when combined with a wired LAN connection.4.  There's no 2nd tuner, so don't expect to be able to have \"picture in picture\".Overall, very good value and I wouldn't hesitate buying again since I don't know of a better TV even with the few shortcomings noted.", "Date": "December 25, 2012"}, {"Title": "Love the TV", "Author": "Les", "ReviewID": "RERI25C20ZHEI", "Overall": "5.0", "Content": "I read a lot before purchasing. The smart features are great and depends on your wireless network. Please remember this is not PC. All  features work well. Video is great as well the sound. Would like one more HDMI but that's easy to get around. We love it", "Date": "December 3, 2012"}, {"Title": "OUTSTANDING PICTURE QUALITY", "Author": "Cent \"guitar player\"", "ReviewID": "R5DTT0U80AX04", "Overall": "5.0", "Content": "Awesome picture quality!!!!!!I haven't used the smart wifi yet but I care more about picture quality and this is THE BEST.Anyone relying on a TV for web surfing has other issues IMHO.", "Date": "January 10, 2013"}, {"Title": "DO NOT BUY SAMSUNG PRODUCTS", "Author": "Just Sayin'", "ReviewID": "R271SQKM12IGAG", "Overall": "1.0", "Content": "*****W A R N I N G*****Do not buy SAMSUNG Televisions!!!  After the one year warranty period SAMSUNG Television screens tend to show burn-in and ghosting with horizontal lines, along with very heavy distortion of picture on right side of screen.  This problem is systemic in all their LCD's and LED's.  Consumer's have complained all over the internet.  There are even numerous Youtube postings with the exact same problems as in my DEFECTIVE SAMSUNG model, as well as the same DEFECT in other models.  This defect occurs upon start-up, and lasts for the first 15 minutes of trying to view a program. Then the picture gets progressively worse over time and continuously declines.I tried SAMSUNG's Executive Customer Relations Dept. and was told:  \"We will do nothing but refer you to a local Authorized Repair Shop.\"  They were downright blunt and rude to boot!  I feel robbed of $2,900.00The repair will consist of a diagnosis visit, and then another visit to install a replacement \"Panel\" that costs $1,300.00 for the part plus $279.00 to install, plus taxes......all told, another $1,719.16....basically, buy another TV.SAMSUNG customer service also told me that their Televisions depreciate at 20% per year, and they do not repair any of their products after 4 years!  Their own repair people told me to just buy a new set!!!If I save one family the heartache of losing they're hard-earned money, I'll be happy!SAMSUNG CONS:No Customer SupportSystemic Panel DefectGhosting of imagesBurn-in on screenDistorted pictureVery expensive to repair", "Date": "November 29, 2013"}, {"Title": "Very Pleased", "Author": "Parbuckle", "ReviewID": "RBTI8C99UPP7Y", "Overall": "5.0", "Content": "3 HDMI inputs are handy, Ethernet connector is nice, WiFi could work better.  It would be nice if this TV would remember several WiFi passwords, not just one at a time.  The Smart TV works OK hooking up to Netflix, HuLu, and YouTube.  Picture quality is very good, I must watch this TV ten hours a day now for several months.  No complaints, very pleased.", "Date": "June 28, 2013"}, {"Title": "Be Forewarned! Cannot watch flash video!", "Author": "William L. Turner III", "ReviewID": "RQ49R0R0CJVG1", "Overall": "1.0", "Content": "I tend to watch a number of shows off the web. Sadly, the very first two shows I tried to watch, \"Big Bang Theory\" from CBS.com and \"The Daily Show\" from comedycentral.com, cannot be watched. The latter is especially troubling since it means I cannot watch \"The Colbert Report\" nor \"Southpark\" as well. I spoke with customer support. Apparently the built-in browser does not support all Flash capabilities. Yes, I could attach my computer, but then why did I spend the extra money on the smart tv? I am about to try one more website: booktv.org. I am very seriously considering returning this TV. The apps are not enough of an incentive if I cannot watch all the videos of which I am capable of watching via my computer.", "Date": "November 30, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Downloadable Apps, Internet Browsing\nBuilt-in WiF\n3D Not Supported\n1080p\nExceeds ENERGY STAR standards", "Name": "Samsung SAMSUNG UN50ES6150 50IN 1080P WIFI LED TV (REFURBISHED)", "ImgURL": "http://ecx.images-amazon.com/images/I/410rXlFS6BL._SY300_.jpg", "ProductID": "B0094K6CKY"}}