{"Reviews": [{"Title": "Missing power cord", "Author": "Llama", "ReviewID": "R3FOV0KLBKJBDT", "Overall": "1.0", "Content": "Received the tv yesterday. I went to set it up today, but there wasn't a power cord. My son found an adapter that would bring the power red light on. I called the manufacturer tech support and had to leave a message. I have not gotten a response thus far. We were able to get the red light to come on that shows it has power, but no picture. Also, it seems to be leaning very far forward even when we tightened the screws. My son even took the screws completely out and put them back in thinking that would help. All in all--not a very happy customer so far . This was to be a gift, but I won't be able to give it now. I will update status if I receive anymore news about the product.12/27/12 12:00 pm Manufacturer called back finally. Will send me adapter for power cord. No apology received. I already bought another tv BEFORE Christmas. I'm not sure whati will do with this one? I will update if the tv works once I receive the missing part.1/12/13 Received The same cord as before (the part that plugs into the wall--not the DC part that plugs into the TV). Called the company back and got a live person!!  Finally received the right part this week and the tv now works.  It still leans forward a bit.  Overall, I guess it's ok.  I will keep it myself now that I went through all this hassle.  I will not buy this brand again.", "Date": "December 21, 2012"}, {"Title": "fine for bedroom", "Author": "setterlab", "ReviewID": "RGVI30VP4TA1L", "Overall": "5.0", "Content": "purchased for the bedroom; it works fine.  I prefer LCD but picked this for the price and dvd combo.  Figure I can always use it as a computer monitor or take advantage of the ac/dc capability at some point.  Worth the price.  Has sleep timer, which was my main concern.  The sound quality is not great as noted in other reviews I read... but again ok for the bedroom.", "Date": "December 6, 2012"}, {"Title": "Horrible product.  Quality control is non existent.", "Author": "Phred", "ReviewID": "RXKTQJTPVSSIR", "Overall": "1.0", "Content": "I tried two of these TVs before giving up.  The first one came without a power cord.  I returned that one for a replacement.  The replacement came with a power cord, but the fixed, metal mounting bracket on the TV caused it to lean forward on its stand.  It stood on a flat table, leaning about 45 degrees forward.  I had to stick a book under the front edge of the stand in order to get the TV vertical -- but that causes the stand to be unstable.It appears that this TV is manufactured and packaged with little to no quality control.  Caveat Emptor!", "Date": "January 1, 2013"}, {"Title": "Where is the power cord??", "Author": "Seth Wright", "ReviewID": "R15RQUR01OY0RG", "Overall": "1.0", "Content": "There was no power cord included! How does something like that happen? I went out searching for a place to buy one and no one had one (even Radioshack!) Good thing I caught this error before Christmas.", "Date": "December 29, 2012"}, {"Title": "Came without a power cord", "Author": "Nitro Joe", "ReviewID": "R9K7CZ7O4OZ6T", "Overall": "1.0", "Content": "No power cord. Useless paper weight. Customer service for Scepter sounds like someone's personal voicemail. I see I am not alone in this problem. Was a gift for my wife, so I am incredibly disappointed.1/11/13 update. After several attempts to resolve through Amazon customer service, the problem remained unresolved. Had to RMA, which Amazon did grant w/o any trouble.", "Date": "December 26, 2012"}, {"Title": "Great Picture - sound is not so great", "Author": "Ursula A Richards", "ReviewID": "R1079HUYNTY9YL", "Overall": "3.0", "Content": "I realize this is a low prices item but the sound is very \"tinny\" and you have to really turn up the volume. The DVD loader is a little stiff but since it's a side player I guess that's expected. I have external speakers I plan on plugging into the tv when I get it situated in it's long-term home so that should take care of the sound issue.", "Date": "January 31, 2014"}, {"Title": "P. O. S.", "Author": "Amy A.", "ReviewID": "R2ORBJ2FI2U14T", "Overall": "1.0", "Content": "This piece did not come with a remote control or  power cable. WTF I should of realized something would be wrong at the price It was going for. Cant find a power cord Any where", "Date": "December 16, 2013"}, {"Title": "Worst HD ever - Poor response, clarity, and audio. Shop at local stores first", "Author": "Maxx Penn", "ReviewID": "R2GIMRHH6CX0H7", "Overall": "1.0", "Content": "Really ? Does 1080p fit on a 23 inch ? Seriously now. What is this BS ? I don't think the Math adds up to realistically do 1080p in just 23 inches. This is the worst HD tv I've seen in a long time. Poor response, clarity, audio , . . . . I think it is a fake HD . Wait for a short time and get a better deal on a bigger better quality HDTVs. This is the kind of thing that gives new products a bad rap. Go to a local TV store and compare TVs and prices first.", "Date": "November 16, 2013"}, {"Title": "Sound is terrible", "Author": "Pen Name", "ReviewID": "R3SGZJ56M3BY68", "Overall": "1.0", "Content": "I need to know, is anyone else having the same problem as me? I've had this tv for about 5 months and I have speakers plugged in (sound is horrible without them) but recently, I've been hearing a lot of static whenever there's like and exploration or a crash or something in that nature (coming from the tv of course, I play alot of skyrim :D) it sounds fine when anything else is going but then something like that happens, and all I hear is a bunch of static. It's not the speakers, and I know this because I unplugged them from the tv and the sound from the tv is doing the exact same thing. The picture quality is great but this problem with the sounds happens a lot and it is really getting on my nerves >:( but is anyone else having this problem?", "Date": "June 3, 2013"}, {"Title": "great", "Author": "laura", "ReviewID": "RVLQZGZQF3CP5", "Overall": "4.0", "Content": "My granddaughter truelly loves this gift.I was so pleased.The picture is awesome and the ease of the remote also.Thank you and i would order from you again anytime.Thank you for being a great person of your word and with a wonderful product.", "Date": "February 24, 2013"}, {"Title": "No Power Adapter - Cheap/Damaged Base Stand", "Author": "VinceG", "ReviewID": "R30BUUBC20OBRW", "Overall": "2.0", "Content": "Just like everyone else that bought this item during the 2012 Holiday Season, I did not receive the DC Adapter side of the power cord. I did receive the basic side of the power cord that plugs into the wall outlet, but not the DC transformer side that plugs into the TV. Other Problems: The stand was broken. There is a really cheap base stand that does not lock together well with the TV.....VERY CHEAPLY MADE & WOBBLES. If you are wall mounting, this does not matter, but if you plan to have the unit on a desktop/table....BEWARE!The product manual makes no reference to the power adapter, other that it is ATTACHED to the TV......Clearly, it is NOT! Is there any quality Control / testing here????To add insult to injury, I paid $170 for the TV about 2 weeks before Christmas, and with all of the negative reviews for missing power adapters, quality control, Etc, during the past couple of weeks, the price jumped up $90 to $260??????Amazon was great, as usual, and paid for me to return the item. I wanted to order another, however, after reading the recent reviews, I was afraid I would just get another TV with a missing power adapter. I emailed the Manufacturer to see what they can do, and how fast they can do it, so I plan to give it a few days before I return the TV.UPDATE:  01-15-2013 - I finally received a power adapter from the Manufacturer. They just asked for the serial number, but it took them about 5 days to ship the adapter, and another 5 days for regular mail delivery from California to the east coast.  So far so good - The adapter works, powered up and picture seems good.  The TV will be used in a child's bedroom mostly for watching DVDs. The stand still is somewhat of a problem, but nothing that some black duct tape easily fixed and also reduced the wobble.  Oh well...I guess I will keep it for now!", "Date": "January 1, 2013"}, {"Title": "Cord not attached, so TV would not work", "Author": "Debbie Mary", "ReviewID": "R18N25BRK1QQA1", "Overall": "1.0", "Content": "Had to send back TV because the co was not attached to it.  It took the company over 4 days to return my call.  By that time I had returned this TV and purchased another.", "Date": "December 28, 2012"}, {"Title": "NO POWER CORD", "Author": "Martin H. Berend", "ReviewID": "RXC5E0Y8PCRZF", "Overall": "1.0", "Content": "I AM NOT HAPPY!I should've read all the reviews thoroughly before buying this as a gift for my wife.  It came with a 3-prong A/C Power Cord but the TV clearly indicates that it requires 12v DC input!  I called the Tech Support line and had to leave a message.  We'll see what happens but I'm NOT HAPPY!Something tells me that I'm going to have to resolve this problem tomorrow by going to Radio Shack and buying an appropriate 12v power adapter.  I'm going to send the receipt for the adapter to Sceptre and demand that they refund the price.  We'll see what happens.I'll report back with an update.12/31/2012 - I wasn't able to find a 12v 5A power supply at any of the local electronics stores.  I complained bitterly to the company by email (they never did return my telephone calls) and they promptly sent me the appropriate power supply... I'm uspest that I had to got through this to settle the matter but the company did make it right.  It arrived today and the TV works just fine.  The speakers are less than wonderful but this is a kitchen TV set and I'm now satisfied.", "Date": "December 28, 2012"}, {"Title": "Received two both with missing AC to DC power adapter", "Author": "HemisphereDancer \"HemisphereDancer\"", "ReviewID": "R2SG25GN1260N1", "Overall": "1.0", "Content": "We were looking for a reasonably priced TV and DVD combo for our daughters room and came across this.  There were not a lot of reviews but decided to give it a try.  The first one arrived and when it was unboxed discovered that the AC to DC power adapter was left out of the box.  Since I ordered from Amazon I quickly got online documented the issue and had them send another one out while I shipped the first one back.  The second one arrived yesterday (12/27) and again no AC to DC power adapter.  This time when I got back online to Amazon I asked for a refund and will be ordering from a completely different company.  I could understand one box missing the power adapter but not the two I received and the others noted on here.  I will not be buying anything from Sceptre in the future because their quality control seems to be poor.Thankfully I ordered from Amazon and they make is very easy to return items that have problems.", "Date": "December 28, 2012"}, {"Title": "Beautiful picture", "Author": "Peggy Larson", "ReviewID": "R2X2218CBE9JZ1", "Overall": "4.0", "Content": "We are using this television as a monitor for our desk top computer and are very pleased with the HD quality of it's picture and it has a automatic shut down when no activity is present so we don't have to always be thinking about whether the monitor was shut off or not. So far we are very pleased with it!!", "Date": "December 25, 2012"}, {"Title": "Great RV television", "Author": "David S. \"Dave\"", "ReviewID": "R39EWX20MPVHYR", "Overall": "5.0", "Content": "Saw in one of the reviews that some folks got one that didn't come with the 12V adapter, that was all I needed to get this TV on the way to my house.  I've been looking for a good LED/LCD TV with internal DVD player that also had an external adapter to convert 120V to 12v, I'll be moving this between my truck camper and RV.  This unit is perfect for those of us with a 12V lifestyle and are concerned with battery life.Picture is very good, sound is somewhat tinny but you can't have both a small LED/LCD TV and large speakers.  It's perfect for small spaces like a slide in truck camper or the bedroom of an RV.  As soon as it got home I fired it up and as far as I'm concerned the picture is great, very clear with bright and true colors, the DVD works well and is fairly quiet, can't hear it at all over whatever is playing.When I have hookups I'll use the \"brick\",  when I'm boondocking I'll use a 12v cord (that you can source from just about anywhere) and save the inverter's power losses.  The power brick is rated at 4.5 amps 12V DC, so draw on your batteries will be minimal as that's the absolute maximum.", "Date": "February 25, 2013"}], "ProductInfo": {"Price": "$169.96", "Features": "Sleek & Slim Black 23\" LED Class 1080P HDTV with built-in DVD\n2 x HDMI Port, USB Port\nATSC/NTSC/Clear QAM\n60 Hz Refresh Rate", "Name": "Sceptre Inc. E243BD-FHD 23-Inch LED-Lit 1080p 60Hz HDTV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41t-Bu1lSRL._SX300_.jpg", "ProductID": "B009M27NZC"}}