{"Reviews": [{"Title": "Glad I went with the bigger TV", "Author": "Avid Amazon Buyer", "ReviewID": "R3RRD796CP2DAF", "Overall": "5.0", "Content": "I was looking for a new TV for the bedroom.  I was debating between this TV and the the 39\" Samsung for the same price.  I was leary because there was no reviews yet on this TV.  I could not be happier with the purchase.  The picture is awesome and the sound quality for a flat screen is great. I would definitely reccomend this to a friend or family member.", "Date": "December 8, 2012"}, {"Title": "Great Tv I will Post Updates", "Author": "VicsDeals", "ReviewID": "R4Y8NTPMF4RL2", "Overall": "4.0", "Content": "We previously had a 40 inch element as a Black Friday deal and it ended up bad out of the box. I am glad we waited a little before buying another tv. RCA not the best brand but this actuly changed my mind about the quality of this company. Tv design is sleek and no problems. Set up was as simple as plug and watch. Get this before it is gone don't believe the bad reviews this is a great deal for a tv of this size and quality!NEW UPDATE:Well we replaced the first RCA because of the backlight bleeding then the second one had the same issue. Dont expect a super dooper perfect tv for the 300$ it was for a 42 inch. I wouldnt complain,but I guess others might.", "Date": "January 26, 2013"}, {"Title": "Didn't last long", "Author": "RONIE BEL AIR MD", "ReviewID": "ROXBBV66V8Q7F", "Overall": "2.0", "Content": "Quit working after 9+ months. Worked fine. Great Picture. Great Sound. I thought I was happy but I was expecting the TV to last 3-4 years not 9 months... Guess I was wrong!", "Date": "October 10, 2013"}, {"Title": "DON'T UNDERSTAND THE BAD REVIEWS", "Author": "natalie", "ReviewID": "REON3AQ9RXMBN", "Overall": "5.0", "Content": "I wanted a basic HD TV .. no bells & whistles. I can play my cable, HD DVD & analog VCR. It's very easy to get from one input to another. Picture is great .. no redmarks, \"egg\" like shadows or other picture problems that other people point out. The sound is great too.If you want something basic & easy to use .. this is the TV for you.", "Date": "June 24, 2013"}, {"Title": "Great TV at a Great Price", "Author": "Mike Batch", "ReviewID": "R1IGI5SZJ3OMR2", "Overall": "5.0", "Content": "I had been watching this TV and several other 42 inch TVs through Amazon for a few weeks, but was waiting for a better price. When the price of this TV dropped dramatically, I pounced and bought it. I got it mounted on my downstairs wall and it works and looks great. The sound could be a little better, but I have a sound bar hooked up which solves that problem. I'm very pleased with this purchase.", "Date": "January 29, 2013"}, {"Title": "I had not had a flat screen and this has been very exciting", "Author": "Michelle L Eckert", "ReviewID": "R38TXK1C4FM8QC", "Overall": "4.0", "Content": "The first one I received we had gotten it all hooked up and saw the screen had cracks in it.  They came and picked up the damanged on and replaced it with no problem!!!The picture is just great!", "Date": "July 23, 2013"}, {"Title": "Great picture", "Author": "Rickgum", "ReviewID": "R31WMTUA2M6CAG", "Overall": "5.0", "Content": "Bought this for my guest room, and everyone who has stayed here says they can't believe the picture an the sharpness of it. Works great an I would suggest buying this to anyone.", "Date": "July 14, 2013"}, {"Title": "Good deal", "Author": "Scott J Darby", "ReviewID": "R2E1Y1TJHXPEI", "Overall": "4.0", "Content": "Aside from the fact that it takes about 10 seconds to let you know that you've turned it on, this TV has been perfect for me. I use it on a screened porch so I didn't want to spend a fortune. This TV has performed above and beyond my expectations.", "Date": "March 20, 2013"}, {"Title": "Good TV. It's only limited by typical LED issues.", "Author": "HEF", "ReviewID": "RX7WGVZ9N3K33", "Overall": "4.0", "Content": "I have owned this TV for about a week and am very happy with the purchase.  It suffers from some typical LED issues, but not bad enough for me to return it.  There is some backlight bleed-through at the corners of the TV, which is noticeable during dark scenes.  It's not bad enough to bother me though.  This is a bedroom TV for me and I do not game on it so I can't comment on gaming lag.  I assume it is pretty bad with a 60Hz refresh rate.  Although, I haven't noticed any serious lag watching sporting events.  Out of the box, the video settings aren't terrible, although I definitely recommend making a couple changes if you don't plan to do a proper calibration.  I wound up turning all the \"features\" off in the advanced video menu, turning the sharpness completely off, and setting the color temp to standard.  One other thing I'll mention is that HDMI from a FiOS Motorola STB is not working (tested 3 different HDMI cables).  I had to connect using component.  I should also mention that I had the same issue with my previous TV - a Panasonic plasma.  So I am starting to think the weak link is the STB.  The component feed looks great though, so other than having 5 cables instead of 1, there's no issue here.  I got this TV on special on Amazon for just over three hundred bucks.  If it hits that price again, jump on it.  It's worth it in my opinion.", "Date": "January 28, 2013"}, {"Title": "Great T.V. for a GREAT price!", "Author": "EMC", "ReviewID": "R27SFHUNDQLI89", "Overall": "5.0", "Content": "Bought this tv back in February, but didn't receive it until March, as I do not live in the US. Anyhow, I hooked it up as I received it, and I turned it on and I was instantly in love with it!!! It's no VIZIO or Sharp or Samsung, etc., but it was in my budget range and I was absolutely thrilled about it!! Got it on sale for $350 + tax. I was a bit skeptical at first because of the contrast ratio and the low output from the speakers, but it was pretty much the best tv I could find and afford that was in my price range. I have NO REGRETS whatsoever about purchasing this tv!!!I hooked it up to my desktop via HDMI and ran some music videos and movies both in 720p & 1080p and I was just blown away! Stunning graphics!! I was surprised at the performance, given the fact that the contrast ratio is only 4000:1 and that the refresh rate is only 60Hz. Just a few pros and cons about it, but other than that, it's a wonderful television.Pros: Thin, not bulky like some older flat screens  Great picture quality  42\" LED screen  Sturdy glass table stand with rubber gripsCons: 8W speakers don't deliver good bass (easily fixed with home theater system)  60Hz refresh rate  4000:1 contrast ratio  Only 2 HDMI ports  No VGA input for computers (only matters if you don't have HDMI port on computer)  USB port only plays music or shows picturesWell, that's pretty much it. I've had it up and running since March 2013 and it hasn't given me any problems as yet!!! No LED bleeding or anything!!!", "Date": "November 15, 2013"}, {"Title": "LED TV", "Author": "Donald H. Smith", "ReviewID": "RADWJZP14OXRZ", "Overall": "4.0", "Content": "An excellent price for a reasonably good TV.  It serves my personal needs adequately.  It certainly does not have \"instant on\" feature, but I am happy with the value.", "Date": "March 19, 2013"}, {"Title": "LED TV", "Author": "Rein", "ReviewID": "R19K1XNEE89W4G", "Overall": "5.0", "Content": "Tv arrived on time as expected and very good quality.  Was very easy to assemble and the video quality is awesome.", "Date": "February 15, 2013"}, {"Title": "good tv, excellent", "Author": "Edwin Hernanado Sanchez Baez", "ReviewID": "R2UREUP461PXPP", "Overall": "5.0", "Content": "It is nice tv, I can play everything on my PS3, I can see my blueray movie. Used as computer", "Date": "September 28, 2013"}, {"Title": "Using as computer monitor", "Author": "Richard T. Brayton", "ReviewID": "R1SAR91EQW8Z96", "Overall": "5.0", "Content": "I've been meaning to get a larger monitor for my computer for some time, and this TV fits the bill. Crystal clear and a headphone port for me to hook up my sound system. I can't sit as close to it as my other monitor, but about 3 feet away it's perfect in 1080p resolution.", "Date": "April 2, 2013"}, {"Title": "First HDTV - No VGA input", "Author": "Michael Crow", "ReviewID": "R2B9N3SZD6Q1I2", "Overall": "4.0", "Content": "I chose an LED HDTV for my first step into HDTV.  I'd considered plasma, but wanted something a bit lighter weight for a wall mount.  I knew I'd be mounting it myself, and that I wanted a dynamic mount with a swing-neck, rather than a more fixed angle.  The TV arrived sooner than expected.  The deliverer carried the TV on one arm.I easily carried it upstairs and began the installation process.  Super easy.  Nice lightweight object.I can see some of the concerns of other buyers that discussed the inherent shortcomings of LED/LCDs.  When I have a flat black image on screen, I can see that it is not really a flat black.  On a plasma, it is truly flat.  But that happens so infrequently... it doesn't really bother me.  The picture is stunning when showing moving images. When I have a true HD signal (Over the Air via my Tivo premiere) I just can't stop staring at it.  When the TV processes a standard def signal, it looks slightly worse than that signal did on the tube TV this one replaced.The audio is reasonable. Better than any other TV I've owned.With only 2 HDMI inputs I guess I might need to do some cable switching, but it hasn't been an issue so far.  I only have a DVD player and TIVO hooked up currently.I could see where some owners might be lonesome for onboard wifi and apps. I don't, because my Tivo makes up the shortomings.This TV is everything I could have asked for at a $349 price point.  I see it has increased to $399 since my purchase. I'm kicking myself a bit for not buying a second one at the lower price-point.  But if the main room TV dies tomorrow, I'd likely replace it with another like this one, even at the $399 price.*****UPDATE*****I'm knocking it down to 4 stars due to no PC/VGA input.  This is not a crisis item, but it was expected, given that I reviewed the RCA user manual before purchase.  Also, a VGA input is listed on the technical details.  It is not a dealbreaker for me, but it might be for some.", "Date": "February 7, 2013"}, {"Title": "Dead pixels and Damaged panel", "Author": "Andrew Hinson", "ReviewID": "RM25Y8XDQXSRY", "Overall": "1.0", "Content": "I received the TV yesterday.  I expected to have minor issues with back light bleeding as others have reported, but it was much worse than I expected.  The bleeding on the right side of screen extended vertically almost entirely from the bottom corner to top corner and then out about 5 inches from right to left along the top and bottom.Also, there was a large blue area in the middle of the screen that was very visible when the screen was black, and there was a dead pixel in the upper right quadrant of the screen.I'd say this thing is defective.  Getting a refund and getting something else.", "Date": "February 28, 2013"}, {"Title": "Good Value - Needs Sound System", "Author": "Rose Woodruff", "ReviewID": "R3Q27RWMUEGLST", "Overall": "3.0", "Content": "For the price, I'm happy with this (about $300 delivered to my door with Prime). However, the sound is lacking. It definitely needs to be fed through a sound system for good movie watching. Also, once you turn it on, it takes so long for the screen to light up that you might turn it off thinking you didn't push the button hard enough the first time. With that said, I'm very happy with the picture and the placement of inputs, etc. is all good.", "Date": "October 5, 2013"}, {"Title": "Not what I expected", "Author": "jlggfn", "ReviewID": "R2IFWQ9ICOJTQ4", "Overall": "2.0", "Content": "This is a good looking unit, and the sound quality was acceptable. It played well until I changed channels or when a channel was not on an HD channel. We noticed a shadow on the bottom, right and left side of the screen. The shadow (kind of egg shell color) looked a bit like a 'burn-in' (like when a monitor has been left on and you can still see an image when it was off). The shadow on this unit was not noticeable when the unit was off. The shadow was especially noticeable when the screen or picture was on dark or black areas of the picture. The sticker says the unit was manufactured December 2012, and I purchased it January 25, 2013. Maybe I got one out of thousand that RCA had built that was not one of their best units. There are other good reviews, but I'm not one of the good reviewers of this particular unit. The Amazon associate was helpful with the return of this item. I plan to purchase another TV from Amazon, just not another RCA unit.Update, February 18, 2013:Since writing reviews on the RCA 42 and 46 inch TV's I have been in contact with Amazon and a RCA tech representatives. I'm not sure I understand the \"backlight\" that is seen, but I will add a link to what may assist in what I consider an ignoring view. The Amazon tech had not experience what I described to him, and the RCA tech had no clue but did agree to send out a tech (which I'll probably cancel later). From speaking with the techs, I have concluded that the new LED TV's, at least an RCA, is this is the \"new normal\" now. The shadow 'may be' the backlight that is seen on the screen and this should not affect the actual picture quality. However, new normal or not is ignoring to me. The link that might help to explain this is:[...]Good luck.", "Date": "January 26, 2013"}, {"Title": "very happy with this", "Author": "Troy J Snider", "ReviewID": "R3DO16H2ZTSXTF", "Overall": "5.0", "Content": "purchased for bedroom tv. didn't expect much, for the 299.00 price, or the product it self. its great. picture is great, options and programing was so easy and great. only thing I bought was a cheap rca soundbar, and couldn't be happier.", "Date": "January 2, 2014"}, {"Title": "nice buy", "Author": "Carol L. Stecher", "ReviewID": "R3AFQPDXQ9OM8L", "Overall": "4.0", "Content": "This TV is a nice set for the price. No complaint on the sound or the clarity of the picture. There is no way to determine if it is reliable since we have only had it a month.", "Date": "December 23, 2013"}, {"Title": "Great company, great tv", "Author": "Donna M. Wilson \"Donna\"", "ReviewID": "R1LOO152E26JSX", "Overall": "5.0", "Content": "Easy to set up, nice slim lines, great picture and sound.  I have a 47 inch vizio and the picture is as good if not better than that tv.  It is everything I could have asked for.", "Date": "December 14, 2013"}, {"Title": "Very nice tv", "Author": "Michael", "ReviewID": "R2B3NAG8MVMQDV", "Overall": "5.0", "Content": "Took three shipments to get one not broken but 3rd time was a charm. Amazon was good to deal with for returns. TV has a high quality pic but below average audio. Get a sound bar!", "Date": "December 11, 2013"}, {"Title": "RCA LED HDTV", "Author": "Devie", "ReviewID": "R29GN09EKTL96H", "Overall": "4.0", "Content": "A Quality TV for a decent price, nice clear picture, crisp sound. A very nice basic HD TV for a reasonable price. Be aware if you have older accessories that this TV only has One set of composite hookups.", "Date": "December 4, 2013"}, {"Title": "Purchased", "Author": "Chrissy R", "ReviewID": "RW39QVR99SPNS", "Overall": "5.0", "Content": "I purchased this for my grandmother. She loves it. It is light enough for her to pick up on her own. She loves it! The TV was kind of complicated to get programmed but I believe it was a cable issue and not a TV issue. The color is great and it shipped on time and arrived on the due date. I cannot say anything bad about this TV. It has great sound and picture.", "Date": "June 27, 2013"}, {"Title": "Excellent Picture", "Author": "NCK", "ReviewID": "R18RJ4VU8P4NMR", "Overall": "5.0", "Content": "This is an excellent monitor for the price.  Great picture.  I've had no issues at all with the TBV. Very easy to set up.", "Date": "May 28, 2013"}, {"Title": "Good buy for the money", "Author": "Karl Fields", "ReviewID": "R1RYAGLRJ068V6", "Overall": "4.0", "Content": "My trusty plasma went out after almost eight years of service. Rather than spend three hundred to fix it, I bought this TV for four and am happy with my purchase. Setup was a breeze and the unit delivers a nice, crisp picture. It doesn't have bells and whistles like web connectivity, but I don't supposed you'd expect that at this price point. I love that the inputs are on the side rather than on the back like my old set; it makes them so much easier to access. The only real gripe I have about this TV is about the speakers. I found them very weak and hollow sounding, and ended up investing in a sound bar. With that one caveat, I'd definitely recommend this set.", "Date": "April 21, 2013"}, {"Title": "it's a great product for the price", "Author": "Chase", "ReviewID": "R30Z54R9P002EM", "Overall": "5.0", "Content": "So far, so good. Great screen. 2 HDMI ports are helpful. Also, the quality of the sound is better than I expected.", "Date": "March 9, 2013"}, {"Title": "Fantastic American Made Quality TV!!", "Author": "Sheila Kibler", "ReviewID": "R225D7X0I6ZIVG", "Overall": "5.0", "Content": "We had been looking at 32\" tvs because of budget. When this one went on special, I quickly reviewed the specs, reviews, etc. and decided to give it a try. I mean, why not since it was the same price as the 32\" tvs! I was surprised at just how much bigger a 42\" is compared to a 32\". We got it right before the super bowl and WOW!!! It made the game come alive!Pros:Sound quality it GREAT! You don't need an external speaker system as in some reviews on other tvs.Settings are easy to use. We found that the high definition is the best quality all around. You can also change the screen size. We have it on full screen and quality is still there.Picture quality is fantastic if you are on HD stations. Crisp and clear. Also with DVDs.2 HDMI slots plus regular video cable outputs means you don't have to go back and forth if you want to stream straight from your computer. Very easy to do; just plug in the HDMI cable, change the setting input to AV and you are set!Easy input change. It's right on the remote and is very simple to change from HDMI 1& HDMI 2, AV (for DVDs, Roku, etc.), Video (never used it yet), and Media (for thumb drive for pictures, etc.)Very slick modern look and very thin. Looks and feels quality.Very easy to put together. Just have to put in a few screws in the base and you are good to go. Very well packaged.Cons:The picture quality isn't quite as good on regular cable channels and Roku stations, but compared to my old box tv, it is very comparable. You just see the difference on the HD channels. Not enough of a difference to down rate this product.Not wireless but with 2 HDMI inputs, that is not a problem for me.I'm VERY happy that we waited and got this tv!!!! Love that I am supporting an American company and LOVE the quality!!", "Date": "February 27, 2013"}, {"Title": "New TV", "Author": "Cat Lady", "ReviewID": "R2BDNGCXM89JRG", "Overall": "5.0", "Content": "This TV is new, so hard to judge these things until you have used them for some time.  So far we really like the project.", "Date": "March 23, 2013"}, {"Title": "Read the reviews!", "Author": "Rogue XJ", "ReviewID": "R238LAS5SVXY1D", "Overall": "3.0", "Content": "I was looking for an inexpensive 42\" flat screen and this fits the bill BUT.....If you read the reviews they tell of \"ambient light\" irregularities built in to the bottom primarily and sides of the screen that at times are annoying... tis true. And they also tell of limited input jacks on the unit, tis also true.  And they tell of poor sound quality from the built in speakers... tis also very true, but doesn't matter if you're using the sound output through a receiver/amplifier. So yes, it's an inexpensive flat screen per se, but it has a couple of flaws if you don't mind.  It's \"okay\"", "Date": "July 8, 2013"}, {"Title": "Nice tv but..", "Author": "Sooozie \"sooozie\"", "ReviewID": "R3UT7ZADY9G0T8", "Overall": "2.0", "Content": "This tv has great picture and sound...however the screen is messed up like some others reviewers have mentioned. Large White or faded spots on the screen, which you usually cannot see when the picture is colorful and bright, but any dark scenes the foggy, white, large area is quite noticeable. Very frustrating. This is not acceptable for purchasing a new tv as I see it as an investment. You want the quality to be as new and the product to last. I paid for an extended warranty and why do that if the product is faulty from the get go. Disappointed", "Date": "January 31, 2013"}, {"Title": "Item as described/bad shipping with UPS (not seller's fault)", "Author": "ctz", "ReviewID": "RF2JOAO9T138O", "Overall": "4.0", "Content": "The TV is as described at a great price.  We are concerned about how long it will work because UPS left it outside behind our grill in the snow.  We didn't even know it was there for three days. UPS was supposed to obtain a signature but chose to \"dump\" it.  Luckily, we are honest ppl, but we hope that the snow and water don't affect the lifespan of the TV. We do like the aspect ratio features and overall picture quality. Easy to hook up to multiple systems.  Another HDMI outlet would be nice.  Please seller, change to FedEx...UPS really did a horrible job with their customer service.", "Date": "March 5, 2013"}, {"Title": "Think twice before you purchase", "Author": "Cody Diekroeger", "ReviewID": "R2TOW3YK6J7DYS", "Overall": "1.0", "Content": "The sound is mediocre.  When the picture is blank, the right side of the screen is blue while the left side is black.  This blue \"tint\" is also visible when viewing programming.  While the price was attractive, I would not repeat this purchase.", "Date": "February 26, 2013"}, {"Title": "good, but not the best", "Author": "Marcus Bethea", "ReviewID": "R3IX3E7AG0Y1TP", "Overall": "4.0", "Content": "I bought the tv back in february.  I like the rich colors that led tv's put out.  I, too, notice the blotches on the screen during dark & black scenes.  I understand that it is the backlighting [just like the screen on a laptop computer], so even though it can be annoying to look at...there is really no getting around it.  I have seen other led tv's on display in stores that do not appear to exhibit the blotchy screens, so I may invest in one of them for my next tv.  but all in all, the rca has worked well for me.  I love the rich colors.....and more hdmi ports would have been a plus.", "Date": "May 28, 2013"}, {"Title": "It took less than 2 hours to fail.", "Author": "Good Time Davy", "ReviewID": "REJ9MOEJGEKSM", "Overall": "1.0", "Content": "I set this up and started learning how to use it along with XBMC and in about 2 hours, the display got sort of overcast with a shadow in a rectangle about 2/3 of the way across and about 2/3 of the way vertically.  The cursor would move over that area with a comet like tail and you could see through to realize what was behind.  I tried to return the unit but they wanted me to pay freight and I disputed it.  The vendor would not authorize a prepaid return and I still have the thing in a box in the living room.  Amazon backed up my money problem and I don't know what to do with a non-working monster like this.  I hope they sort this out and get it out of my house.", "Date": "June 3, 2014"}, {"Title": "Lower cost TV", "Author": "John Harrington", "ReviewID": "R20D2ZMOXV01XG", "Overall": "5.0", "Content": "No issues with this product. I would definitely buy another if I need another tv in another room.one two", "Date": "May 9, 2014"}, {"Title": "Good for the Price", "Author": "Chinedu Akunne", "ReviewID": "RAP4HM2M6NAAN", "Overall": "4.0", "Content": "I'm not one to stay glued to the TV. However, this was perfect for the price. And, serves the purpose. My guests like it", "Date": "April 6, 2014"}, {"Title": "whatever you do make sure that you don't get it from  Secondipity", "Author": "Kerwin", "ReviewID": "R3B0LUDMWSZUJP", "Overall": "1.0", "Content": "when I first received the package i thought there was something wrong with it since the box looked worn. and I was 100% correct when I took it out of the packaging and set it up it had black and white lines running diagonally along the screen. If I was you I would think twice before buying anything from this. make sure its a reliable source and make sure you can get in contact with the seller.", "Date": "February 28, 2014"}, {"Title": "UPDATE - Now two have arrived faulty!", "Author": "Linux SysAdmin", "ReviewID": "RW44NUQ33TE42", "Overall": "1.0", "Content": "ORIGINAL REVIEW:We ordered this to go on the wall of the office to show output of monitoring systems. We were replacing an earlier model of this same TV, a 42\" LCD. The old one still works great, but this one is definitely lighter and thinner.The fault was with the screen, it had a black anomaly not unlike the effect you'd see if putting a large magnet next to an old tube TV. Of course, there were no magnets nearby and magnets do not affect LCD panels, but that is the best way I could subscribe the problem. I am currently working with the seller to try to get a replacement rather than a refund.UPDATE:We got our replacement in, now two days past the two-month mark since we ordered. This one arrived in worse shape, with about half the screen covered in what I can only describe as a big red blob. We've requested a refund, and I'll just go to a retailer now. I am QUITE disappointed in this transaction, in both the seller and the product, and most likely will never buy another RCA TV.", "Date": "February 19, 2014"}, {"Title": "Priced perfect.", "Author": "Lisa DeAngelis", "ReviewID": "R347W6ZF960BK2", "Overall": "5.0", "Content": "For the price this TV is awesome. Fit right into our budget. Can't complain about a thing. Picture and sound quality are great.", "Date": "December 15, 2013"}, {"Title": "Returnning Television", "Author": "Blessed", "ReviewID": "ROZNXVEOXPM19", "Overall": "2.0", "Content": "There is a ghost distortion in the left hand side of the screen that looks like a half bullseye that interferes with the picture quality.  I am in the process of returning the television.", "Date": "December 7, 2013"}, {"Title": "Great for bedroom", "Author": "Legal Eagle \"working gal\"", "ReviewID": "RZQLQI46GQGYR", "Overall": "5.0", "Content": "We have this on the wall in our master bedroom.  The only strange thing was that our wall hanging kit, which is \"standard\" called for the holes to be in different locations So I have it hooked solely in the middle and not on the extensions, if that makes sense.  But it appears to be working okay", "Date": "November 28, 2013"}, {"Title": "A good TV at a great price", "Author": "Michael S", "ReviewID": "R1UA36OS27SKCS", "Overall": "4.0", "Content": "Ok, so I have had this TV for a while now.  I wanted and LED because it is supposed to use so much less energy than plasma or LCD, and still have bright, vivid colors.  I will say that the colors and the picture seem find on this TV.  Being 42 inches, its a nice size to fit my living room.  My couch is about 10 ft away and it seems like a perfect size.  The color, even in daylight shines brightly and brilliantly.There are a couple of things that keep this TV from getting a 5 star rating from me.  First the sound it TERRIBLE.  I don't claim to be an audiophile by any stretch and even to me the sound seems bad.  I have had to hook up external speakers to make it bearable.Secondly, the base does not swivel.  If I want to angle the TV to point directly at one chair or another, I have to turn the entire television.  It doesn't seem like a big deal, but it is where my speakers are, and they are always getting messed up.Third, it takes probably 3 seconds for this tv to turn on.  I'll press power and the time it takes to come on is just long enough that I think it didn't turn on..  Consequently I often see the tv flicker on and then off because I have hit the power button a second time.", "Date": "November 12, 2013"}, {"Title": "Love it", "Author": "Tonya Monteiro", "ReviewID": "R3A3GVBQGUDT7J", "Overall": "5.0", "Content": "Very nice purchase at a great cost. delivered with no issues and I enjoy it! I would recommend this item to friends.", "Date": "May 24, 2013"}, {"Title": "Good product for the price.", "Author": "dan murphy", "ReviewID": "R2TIEMCUW4LXV5", "Overall": "4.0", "Content": "Easy set up. Clear picture, However sound is very tinny had to hook up a speaker system. Side mounted inputs made it easy. All in all Good deal for the price!", "Date": "May 4, 2013"}, {"Title": "Great TV", "Author": "Amazon Customer", "ReviewID": "R3V7P5046A9PKF", "Overall": "5.0", "Content": "Love this TV. Very pleased with the picture quality.  Sound quality is okay but not outstanding but overall great buy for the price.", "Date": "April 17, 2013"}, {"Title": "great deal", "Author": "Randal Gassman", "ReviewID": "R1N5X1N8TTNAKN", "Overall": "5.0", "Content": "Best deal I have seen on a 42\" TV  great picture but i wish i could get it for 300 bucks agin.  It was a daily special", "Date": "April 15, 2013"}, {"Title": "Great TV, great deal too", "Author": "Chris D Moore", "ReviewID": "R1618SPCBYCXG4", "Overall": "4.0", "Content": "Easy to set up, easy to use, and looks great.  I really would never pay more, this TV is better than I even guessed it would be.  Highly recommend for all your standard family uses.", "Date": "April 15, 2013"}, {"Title": "good deal", "Author": "John G.", "ReviewID": "R3VQ4V05BYDSTZ", "Overall": "5.0", "Content": "a very good tv, picture seems on par with Sony and Panasonic at a lower price point. Works flawlessly, nice size remote.", "Date": "April 13, 2013"}, {"Title": "Great product!", "Author": "RBQ4 \"RBQ4\"", "ReviewID": "R2XPT7C8WFBOWX", "Overall": "5.0", "Content": "I love it.  Amazing picture.  No problems.  Sound is a little tinny, but you can overcome that with additional speakers.", "Date": "March 12, 2013"}, {"Title": "Great TV", "Author": "Douglas S Saegesser", "ReviewID": "R2NW8YVRB6YHGT", "Overall": "5.0", "Content": "Bought this for our bedroom set and it has been perfect in that role.  If you plan on using it as your mai TV, I would add a soundbar or other audio enhancement, but not necessary for my use.", "Date": "March 7, 2013"}, {"Title": "it has imperfections", "Author": "evans", "ReviewID": "R30BP5W5RPWACL", "Overall": "4.0", "Content": "almost looks like someone puhopet a magnet on part of the screen ruining the picture at certain times. hopefully they replace it or something soon", "Date": "March 7, 2013"}, {"Title": "Perfect", "Author": "Joseph Comfort \"Music Junkie\"", "ReviewID": "R3QADIC53JPHWJ", "Overall": "5.0", "Content": "Great picture, bright and clear with brilliant color and even fairly decent sound, for a flat screen.  Still considering speakers, but its a bedroom set so big sound is not so important.", "Date": "March 6, 2013"}, {"Title": "Great TV", "Author": "Jack F Stadelmeier", "ReviewID": "R2177DP7ETR05P", "Overall": "4.0", "Content": "Bought this TV for my bedroom and  it performs well especially considering the price that was paid for this unit. My only criticism is that the sound quality is not very good.", "Date": "March 1, 2013"}, {"Title": "Good deal", "Author": "MARTIN69", "ReviewID": "R3UZLODLSNPLQ6", "Overall": "5.0", "Content": "Is nice quality. Pretty decent accurate colors I buy for master bedroom and was good deal I will recommend to anybody who want a good tv for less money", "Date": "February 26, 2013"}, {"Title": "RCA 42 inch HDTV", "Author": "D. Leppanen \"Leppy\"", "ReviewID": "R3E4A5YWAVZ7CO", "Overall": "4.0", "Content": "TV came fast, as noted in the online tracking feature, installed easy BUT the documentation for the TV was sort of sparse.  The RCA web site offered a download of a better user manual but it was for an older, outmoded TV of the same model.", "Date": "February 26, 2013"}, {"Title": "What a deal!", "Author": "Gary Shriver \"G Shriver\"", "ReviewID": "R1LC9JB7PT864R", "Overall": "5.0", "Content": "I found myself needing a new HD monitor for a new video editing system.  I was very skeptical because of the price.  When I found it, it was like $315 .  But with the amazon incredible return policy, I figured , go for  it.  I'm sure glad I did.  This thing rocks.  This was an incredible deal and delived free in two days.  Life is good!", "Date": "February 26, 2013"}, {"Title": "Good value", "Author": "Rolf W. Donahower \"FYI\"", "ReviewID": "R20I2PV29ZY8DG", "Overall": "4.0", "Content": "No complaints except sound quality which is normal for thin LED sets. Plenty of I/Os including headphone jack to which I used to hook up some computer speakers w/sub. Now it sounds pretty good. Set-up was easy and defaults gave best quality picture.", "Date": "February 26, 2013"}, {"Title": "Incredible value", "Author": "Bill Loran", "ReviewID": "R12C1VCR3HAXHB", "Overall": "4.0", "Content": "This was our first flat screen Tv purchase. We are very pleased. The picture is great and it has all the features and inputs we need. Only negative is the sound. Has the tinny sound of small speakers. Plan to get a sound bar to remedy the situation. Looking to buy another if the price is right.", "Date": "February 26, 2013"}, {"Title": "Wonderful Bargain", "Author": "Linda C. Hackling \"IRRLYM\"", "ReviewID": "RVBKMXI4X8750", "Overall": "5.0", "Content": "I'm very happy with my TV. The picture is great, the price was right and it came in a very timely manner. This experience has been nothing but positive.", "Date": "February 23, 2013"}, {"Title": "What a great TV!", "Author": "Patty Ann Caccavale", "ReviewID": "R311Y6EIL62SSZ", "Overall": "5.0", "Content": "We ordered one of these and liked it so much we ordered another one!  Great picture!  Love it, I mean \"them\"!", "Date": "February 21, 2013"}, {"Title": "Beautiful", "Author": "Ryan Merl", "ReviewID": "R8OVCN7U7BUBY", "Overall": "4.0", "Content": "I love this TV. I've had it for a few weeks now and it's amazing. Even for built in speakers, in my bedroom it sounds great. Great price for what you get too.I'm docking 1 star due to one small issue that I have (and honestly, it doesn't bother me that much, I'd rather dock .5 but you can't do that). The TV seems to have a bit of a ripple in the screen. However, the only time this is noticeable is when the screen is all one color. Like all white when my XBox360 loads, or all black when it's just turning on. Pretty much only during transition screens. Not much of an issue, and likely only there because I bought a refurbished model. But it's really not even enough of an issue for me to complain.Would definitely recommend.", "Date": "February 15, 2013"}, {"Title": "good but bad", "Author": "CyberOrca \"On PI Vacation\"", "ReviewID": "RC61FRB5S3RLR", "Overall": "3.0", "Content": "I am loving the picture and the look of this RCA TV but the sound is like listening to an old transistor am. radio and the speakers are on the back of the set. I bought this set to replace a 4 year old SANYO 37 inch.  The SANYO is by far superior in sound quality, I’ll miss that! I will more than likely get a sound bar for this set and hopefully that will make it better. Again, good TV but nasty sound quality!", "Date": "February 9, 2013"}, {"Title": "Would not purchase again", "Author": "computerhater", "ReviewID": "RWYEMJGCLJE3L", "Overall": "3.0", "Content": "This tv was supposed to be a nice replacement for our 4 year old tv, but after getting it setup, there were a few dead pixles when the screen is all black. Its not enough to send it back, but it is enough that I'll buy my next one from a brick and mortar store.", "Date": "February 7, 2013"}, {"Title": "Excellent TV, excellent price.", "Author": "Biloxi", "ReviewID": "R1DOLA8V8WLXCK", "Overall": "5.0", "Content": "We shopped around for a TVs for a long time before settling on this model.  Was a little worried because there weren't many reviews at the time of my purchase, but decided to try it anyway.I paid an extra $8.99 for Amazon Prime Saturday delivery, but unfortunately the TV was not delivered until Monday (amazon refunded the shipping fees).  Got the TV set up and turned on and immediately noticed the LEDs bleeding from the edges of the screen.  Also had what looked like a large ripple radiating from the right edge of the screen.  I called RCA and was told we got a TV with a bad panel so logged on to amazon.com and requested a replacement.  They sent me prepaid labels to send the bad TV back to them and sent a replacement out overnight.Got the replacement hooked up yesterday and everything works beautiful.  Colors and lighting are even, picture is clear and sharp, and no ripple this time!  Very happy with my purchase and with the service from Amazon!!", "Date": "February 7, 2013"}, {"Title": "Great Tv, not so good audio.", "Author": "Jamie Hanley \"jamsmanblue\"", "ReviewID": "R2F2CA6XFED31U", "Overall": "4.0", "Content": "This is a really good TV, but the audion leaves alot to be desired. Also i have a problem with only having 2 HDMI inputs. i have to keep unpluging one thing to run the other. The picture is great though, and like the TV alot. I do have a surround sound hooked up to the TV, but with out that hooked up, The sound is crappie. Over all i give this tv 4 stars out of 5. For the price you can't beat it.", "Date": "February 4, 2013"}, {"Title": "Amazing TV for the price", "Author": "Radius", "ReviewID": "RA0QMEA7SIIGH", "Overall": "5.0", "Content": "I was expecting a DOA for the price I paid for this TV.  But, I was pleasantly surprised to see this TV delivering a nice, crisp picture.  Unless you work for Consumer Reports, it is hard to find subtle differences between this and higher priced cousins.I haven't noticed any picture troubles like few other customers, and happy with the purchase.", "Date": "February 3, 2013"}, {"Title": "Great tv", "Author": "jjon", "ReviewID": "RHUXCH6MHJBTX", "Overall": "5.0", "Content": "I love this TV. I bought it on amazon when it was a gold box deal for $300. For a 42'' TV I am very impressed. It has a great picture and good sound. This TV lacks an AV cable port (the red, white, and yellow), so you will have to use either an HD cord or composite cables when connecting an external device such as you DVD player or game console.", "Date": "February 2, 2013"}, {"Title": "Not bad, good for the price", "Author": "Amazon Customer", "ReviewID": "R2NNIEH2KASUWG", "Overall": "3.0", "Content": "I was really excited when I saw this for $350. I've wanted an LED TV for a while and could finally afford one. Performance is just OK. pix-elates during bright flashes on the screen. Also color washes out at greater than 30 degree angle, can still see picture just looks like its in a bright fog. Head on though the picture quality is excellent, and the features are pretty good. One thing that I was really disappointed in is that I have a wii for the wife and kids and this does not have the standard coax input you need the HD connectors. From what I've seen with those it's hit and miss on quality and picture so I'm hoping the one I've ordered will be good. All in all I think it is well worth the price, but definitely not the best out there. If I would've had more to spend I might have tried the TCL 48\" LED or gotten another Vizio.", "Date": "February 1, 2013"}, {"Title": "Inexpensive TV, totally worth it.", "Author": "A. Solari", "ReviewID": "R3HV2M7EMZZLUH", "Overall": "4.0", "Content": "I was skeptical because I feel like I got such a bargain TV, but I love it. Although we were upgrading from watching TV on our computer monitors. We don't subscribe to cable, we just watch a few shows we like on Hulu. The picture is fantastic, size is nice, sound is acceptable. The price is so low, it's perfect for  3rd, 4th, or 5th TV in the house.", "Date": "January 31, 2013"}, {"Title": "Slight Problem", "Author": "Zach Iverson", "ReviewID": "R2SK70XD5WB9AO", "Overall": "4.0", "Content": "One of the leds is showing from under the frame around the edge. hardly noticeable but still annoying since i just received the TV. Called RCA customer support and they are sending out a technician to fix it. I have to say that  this TV is great quality for the price and would recommend it to anyone, Just hope that they don't have the same problem as me right away but one fixed it will be perfect", "Date": "January 31, 2013"}, {"Title": "Affordable Quality 42\" HDTV", "Author": "Born to Shop!", "ReviewID": "RD9Y1KN9T1I4C", "Overall": "5.0", "Content": "I was searching for an easy to use HDTV for my 90 year-old grandmother and I am happy I went with this RCA 42-inch 1080p 60Hz LED HDTV. Setup was very easy and the remote is simple to use.Does come with two HDMI, PC, USB port and AV inputs for individuals who wish to connect more components and devices. Displays beautiful vivid colors that are crisp and vibrant. Sound quality is produced from two 8 watt speakers that sound clear and not muffled. Ultra thin and weighs less than 40 pounds. The swivel stand is an added bonus since must table top stands do not move.Great value for the money and highly recommend it.", "Date": "January 30, 2013"}, {"Title": "Cannot get a code for the Comcast Universal remote", "Author": "Bruce Mitchell", "ReviewID": "R1703U60SVQ3W", "Overall": "1.0", "Content": "Got my TV today and spent 4 hours trying to get it to work with my Comcast Universal remote. Had Comcast on the phone and they could not get ti, tried RCA support and no help...called ON which is the company that makes this TV for RCA and they could not help. Read many many postings on internet help sites of people with the same problem. Turns out if you have comcast and many many other universal remotes you will end up needing to use TWO remotes for this TV. One for the TV and one for the cable box....MAJOR MAJOR turn off.", "Date": "March 29, 2014"}, {"Title": "Great deal", "Author": "Catherine E  Murphy", "ReviewID": "RM0BGMN5P4WMV", "Overall": "5.0", "Content": "I  really like the tv.  It does what it is supposed to do.  Has a great picture, easy to use remote, looks good in my living room.  The only thing that I did not like was that the instructions were not clear to me, but that might have been my problem.", "Date": "March 28, 2013"}, {"Title": "Excellent Choice", "Author": "José Wilfrido Ávila", "ReviewID": "R2RRQVLUJF1DI0", "Overall": "5.0", "Content": "I liked this TV because the price was very chip and good brand. In general because is not a expensive tv", "Date": "March 12, 2013"}, {"Title": "By far a great purchase", "Author": "ActiveAnn", "ReviewID": "R54B5LODZQCS8", "Overall": "5.0", "Content": "I could not be happier with this purchase. The picture is exceptionally clear, it was easy to set up, and the price was very reasonable. I would definitely recommend this TV.", "Date": "February 27, 2013"}, {"Title": "Don't buy", "Author": "SGL48 \"sgl\"", "ReviewID": "R1P6AJ38LZYPYG", "Overall": "1.0", "Content": "had a bad experience with this tv, i had a professional come set it up and he said it was defective. I had to use the direct tv remote to turn it on and the RCA remote for the sound and had to press several buttons to get sound on. Called the dealership they tried to help but couldn't, then I called direct tv as directed by dealership but they tried but didn't work. I also did not like the sound as much as my Sanyo.", "Date": "February 6, 2013"}, {"Title": "The worst TV I have ever had", "Author": "DestinedToRein", "ReviewID": "R2UWTW8DXRLJIO", "Overall": "1.0", "Content": "The TV broke after only 1 month.  RCA does not make good TVs.  I will never buy another RCA TV again. Major suck!", "Date": "December 10, 2013"}, {"Title": "RCA tv", "Author": "Tom Rogozinski", "ReviewID": "R2UEQQFTO8DCF6", "Overall": "4.0", "Content": "It is fine , but there is a little flaw in the left side of the screen . I told one of your reps about it the next day after I received it. I don't know if I will receive any compensation for this flaw, Amazon should let me know. If they don't, I'll probably buy nothing from them again. You can take that to the cleaners.", "Date": "December 3, 2013"}, {"Title": "Good buy for my money.", "Author": "Rex in Texas", "ReviewID": "R14KCNLL9IAW2Y", "Overall": "3.0", "Content": "TV has good quality. Was very easy to assemble and the video quality is very good for my room.Little disappointed with the speakers.", "Date": "March 9, 2013"}, {"Title": "Rating feedback", "Author": "Nancy Dill", "ReviewID": "R2L6V4V3JAB5IB", "Overall": "4.0", "Content": "The only complaint I have with the tv is the sound is very tinny. I believe this is because the speakers appear to be under the frame and as I have it setting on a stand rather than wall mounted the sound is muffled. Otherwise, the picture quality is excellent and I am very satisfied.", "Date": "February 27, 2013"}, {"Title": "Unexpected Inputs", "Author": "J. M. Jensen", "ReviewID": "R1CJE5VU3UN2IW", "Overall": "3.0", "Content": "The users manual shows Composite, Component, and HDMI inputs, but there is no Composite input on my unit.  Other reviewers complained that there is no Coaxial input, but mine has one. The picture is pretty good with a direct coaxial input from my cable company, but the sound is thin and high-pitch only.  I haven't been able to change the picture frame to fit my cable signal -- I either see the whole picture on \"Normal\" size (3x4) or lose 15-25 percent of the picture all around the frame with one of  the other settings.  But for $320, should I complain?  \\\\", "Date": "February 19, 2013"}, {"Title": "Awesome Picture", "Author": "pdnpdn", "ReviewID": "R1F8N7Z3HSCKWK", "Overall": "3.0", "Content": "Awesome Picture but not enough connections. Sound is OK, This is the reason for only 3 stars. * * *", "Date": "February 19, 2013"}, {"Title": "I dub it \"the green machine\"", "Author": "Gordon Halfpipe", "ReviewID": "R3S7C44C5E5L66", "Overall": "3.0", "Content": "So many sets have a green push to them, especially in the dark areas.  This set has that big time, but offers no advanced settings to correct for it.  If I could find a service menu I could probably fix it, but no luck finding one online.It's a good set at a good price, but the picture is too green.  Also there is \"banding\" (where color gradients become distinct lines).Just not a great set, but it will do.  Good blacks.", "Date": "February 9, 2013"}, {"Title": "i'm in limbo with this TV and review...", "Author": "screw67", "ReviewID": "R2OR022MP6HJX0", "Overall": "3.0", "Content": "The three stars is not about the quality of the TV, let me say that first.I received this TV last Thursday and excited to unbox it and get it set up. everything looked great....until i watched a commercial with a white background noticed there were dark \"waves\" running through the screen, yikes! I hoped maybe it was due to the TV being cold or something when it came in off the UPS truck so i waited all weekend and, nope, like someone else said it looked like \"burn in\" that you would see on an extremely old TV or monitor. amazon is known for the great customer service so I jumped on the phone Sunday night and had a replacement on the way (with one-day shipping) and return labels sent to me to send back the dameged unit, within 10 minutes.My replacement TV is due to arrive tonight so i will update my review once i unbox and set it up. hopefully, this was just a one-away mistake because i really like this TV and, other than the issue above, it has a great picture. the TV is super-thin and would look great in any room, whether wall-mounted or on a TV stand/entertaintment center.if i had one complaint so far it would be that the TV does not have VGA, video (yellow cord) or coax inputs so you're kind of limited in what you can use this for. my last TV, a best buy Dynex, had everything this TV has (2 HDMI ports, component video amd RWY audio/video inputs) plus VGA, coax and others. you wont be able to connect a VCR with coax or a laptop using VGA but, then again, i may be the only person alive who doesnt have a laptop or VCR with HDMI capability.So yeah, in essence, i would say BUY, if asked.", "Date": "February 5, 2013"}, {"Title": "led tv", "Author": "AJD112103", "ReviewID": "R18R451U3A1HHX", "Overall": "5.0", "Content": "this is a great product. great picture and sound quality. very easy fool proof set up features. it came with what looks like a very sturdy stand for the tv to set on the table. but i purchased a wall mount with the tv. great buy. would definitely recommend to everyone looking for a great deal", "Date": "February 1, 2013"}, {"Title": "Not Acceptable", "Author": "Smith", "ReviewID": "R1B1H6TSVB7SYC", "Overall": "2.0", "Content": "Bought as DoD for 317.00.  Got it home and set it up and it had a white spot in the upper right corner of the screen that radiated halos throughout. Amazon was great and promptly dispatched a new one. Unfortunately it arrived in worse condition with a black bar running top to bottom through the middle of the screen. Since i am a sucker and not in a big hurry Amazon is sending out the third unit. Its got to be good right?  Update once it arrives.UPDATE 4/1The television still has a bit of white spots when the screen is totally black but otherwise quite a good picture.", "Date": "February 9, 2013"}, {"Title": "Great color, good sound, just one problem", "Author": "Jennifer", "ReviewID": "RUIKRTCSQJAK1", "Overall": "2.0", "Content": "I got this tv so that when I could move out I would have one for my living room. I haven't moved out yet, so I thought I would try it out. It had no scratches or problems with the sound, but I soon found out that NEITHER hdmi ports worked. I'm not sure if I just got the one defective tv in the bunch, but I'm not happy about it. And I'm past my return time limit as well.", "Date": "July 2, 2013"}, {"Title": "TV set good.  Amazon shipping not so much.", "Author": "loosecanon", "ReviewID": "RWZTM02PPZYBO", "Overall": "1.0", "Content": "Arrived damaged and unusable.  Was a great price and I hated to sent it back.  Found out that it must have been the last one in the warehouse since they could not ship a replacement.  Amazon did refund the purchase for which I am grateful.  All said and done, I ordered from another \"unnamed\" supplier at a higher price.  Love the unit now that I have one that was not damaged when it arrived.  Great picture.  Good sound.  If you can buy this for under $300. you are getting a very good LED HDTV!", "Date": "December 2, 2013"}, {"Title": "Issue with mine", "Author": "Teesha Keen", "ReviewID": "RJQDW4OBD9TT4", "Overall": "3.0", "Content": "I think the TV looks great but for some reason I have to turn it on and off twice to get the volume to work. I have gotten no where with returning it or exchanging it. But other than that the sound quality and picture look great.", "Date": "June 15, 2013"}, {"Title": "good price not so good product", "Author": "Cheryl A. Galliano", "ReviewID": "R1VGYNKVL1DO08", "Overall": "2.0", "Content": "not too happy with this product picture is that good no matter what you do to it I thought and rca would be a good product but not this one", "Date": "February 27, 2013"}, {"Title": "Damaged goods", "Author": "Derrek", "ReviewID": "R2LRIQRIYVZQF2", "Overall": "1.0", "Content": "I was excited to get this TV. Until it arrived with a smashed screen. There aren't any left in stock so I'm out of luck for a replacement. I have to wait 3-5 Business days for a refund (So now I can't buy a different TV this week) AND I'm missing my local University and NFL team's games this weekend. Thanks Amazon!", "Date": "November 15, 2013"}, {"Title": "Out of Three 2 not turning ON??", "Author": "saleem", "ReviewID": "R2ZOHUMS5R34Y8", "Overall": "1.0", "Content": "I bought 3 tvs for my new home but 2 of them are not turning ON. Both are showing red lights (ON), one is totally blank black screen and second one is showing little bit white screen when you turn off the tv with red light Off???(looks like it is on but with red light Off and with red light On it is showing black screen)???", "Date": "March 25, 2013"}, {"Title": "Excellent TV", "Author": "John Morris", "ReviewID": "R7ZQ6E46B79J1", "Overall": "4.0", "Content": "I was a bit hesitant to buy this TV because it didn't have any reviews yet, but I took a chance on it.  I actually bought a different TV first, the \"Coby TFTV3925 39-Inch 1080p 60HZ LCD HDTV (Black)\" for $278.  When it arrived and I turned it on, the screen just flashed and it didn't work.  I talked to Amazon, and they were going to replace it with another of the same kind.  However, they were sold out.  I was offered a refund, but I insisted on being able to get a different TV which is in stock for the same price I paid.  So, after speaking to a manager they agreed.  So, anyways, this TV was the closest in terms of dimensions, so I chose this one.  It was about $125 more than what I paid previously, so I felt it was a good deal.  So, I can only speak from the perspective of someone who spent $278, and from this perspective this TV is definitely worth it.If I was purchasing this item from scratch for the full price of $399 I would have to compare specs to other TV's more carefully to make the best choice.  But, the TV functions well and it is easy to put together.  The only reason I gave 4 rather than 5 stars is because the color seems a little off and it takes some time to adjust the settings so that the picture looks proper.  But, I suppose this is par for the course with purchasing any new TV.", "Date": "December 11, 2012"}, {"Title": "Use RCA 42 inch watch out", "Author": "shotell mitchell", "ReviewID": "R34Z7IWLT8JDV8", "Overall": "3.0", "Content": "Well I got my use $280.00 42 inch RCA in 5 days by UPS.The box was to big for the tv the side was crack the power cord plug end was damage. So I still plug it up think god it worked the sound is not that load. I really hate to ship it back what a head ache for now on I will buy new.Well at least it work great.......", "Date": "April 11, 2013"}, {"Title": "Having problems", "Author": "grandmadonna", "ReviewID": "R2L9BLEIB9M7SR", "Overall": "2.0", "Content": "I ordered a TV from you last year and have had no problems and love it!!This tv is giving me trouble right now.  It seems to blink, scrambling the picture.  We thought it was the cable box and have replaced that but the tv still is acting up.I don't know what to do next.", "Date": "December 22, 2012"}, {"Title": "No estoy realmente contento con el producto", "Author": "César Alcázar", "ReviewID": "R20OXNQK36KDCH", "Overall": "3.0", "Content": "Presenta unas sombras en la imagen, lo cual es producto de algún daño interno. No fue una buena compra, si pudiera cambiarla lo haría.", "Date": "January 28, 2013"}, {"Title": "LED HDTV", "Author": "Jessie Natkong", "ReviewID": "R1UZUECCCV7ZNO", "Overall": "5.0", "Content": "im really happy with the TV. my honey and i love it.we are watching it now. if i ever have to order it willorder form here again.thank youJessie", "Date": "December 26, 2012"}], "ProductInfo": {"Price": "$355.99", "Features": "42-Inch LED HDTV\nFull 1080p - Resolution 1920 x 1080\nContrast 4000:1\n2 HDMI, 1 Component, 1 Coaxial Inputs\nWall Mountable (VESA 200x200mm)", "Name": "RCA LED42C45RQ 42-Inch 1080p 60Hz LED HDTV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51oTsK7Zq%2BL._SX300_.jpg", "ProductID": "B0093YV4R2"}}