{"Reviews": [{"Title": "OK but leaves much to be desired", "Author": "Chad A. T.", "ReviewID": "R3P7FJPJPWU3SD", "Overall": "3.0", "Content": "After doing a ton of research on LED televisions, I had decided on the M3D550KD which has raving reviews.  However, it's been replaced with a newer model.  Better right?  That's what I was banking on but have been sadly disappointed.  Let me say before going on that I don't consider myself an overly-picky person and don't have a ton of experience with LED televisions.  I'm replacing a 6 year old Samsung DLP that I've been more than happy with but it's time to get rid of that clunky thing.This really is a nice looking TV out of the box with a really nice remote.  The Visio website shows the new version of the remote with the qwerty keypad on the opposite side but it's an IR remote which means it needs a clear line of sight to the TV.  I was happy to discover that mine came with the bluetooth remote with the slider keypad so I need no clear line of sight.  That qwerty keypad sure saves time when setting up the different apps.  As for the apps, I found them to be easily navigable and smooth enough.  However, Neflix is DOA on this TV.  After troubleshooting with Netflix with no success (didn't troubleshoot with Vizio because there has been a lot of feedback already saying that they're passing the blame on to Netflix).  Their conclusion is that Vizio installed the wrong version of Netflix so they need a firmware update with the right one.  I think that will eventually happen and if this was my only problem, I'd be happy to wait for it but it's not my only issue.Vizio advertises this to be 120 hz but on closer inspection, it's 120 hz effective which means it's actually 60 hz with a little extra processing (which is a downgrade from the M3D550KD which is 120 hz with a 240 hz effective rate).  This really makes it no better than any of the other cheap LEDs out there.  I don't like this because, as with many of the faster TVs today (yes, even 60 hz is faster than my DLP), there is a certain amount of \"soap opera effect\" going on which can be remedied by turning on \"game mode.\"  However, this reduces the speed to 60 hz which is no clearer than my old 720p DLP TV.  That's unacceptable for me when I upgraded and spent $1000 on this new TV.  The preset picture settings are pretty disappointing but with a bunch of tweaking they're better.  However, I just can't get it quite right.  The colors are either way too vivid or too bleached which is just getting frustrating.  Also, at times certain parts of the picture, especially people, go blurry when they shouldn't.I must say that it's got decent blacks for an LED.  The speakers are to be expected from such a thin TV but still decent.  Also, the 3D is good, I didn't notice any artifacts or anything weird when using it.  There are a few light spots (which also is a normal thing for side lit LEDs), especially on the left side but not an insane amount that I couldn't live with.  There are plenty of inputs, I've been using two hdmi's, the optical and the ethernet.  All of them super easy to hook up with no problems.  I didn't test the wireless connection so no feedback there.After all of this, I agree with others that Vizio pulled a bait and switch on the unknowing consumer.  We thought that they'd just do a few improvements on the old model and keep making an amazing product.  This isn't what they did though.  They made a new model at a much better price point for themselves by lowering the quality of components, thus making an inferior product.  Let me say this though, I'm saying \"inferior\" when comparing this model to it's older sibling.  I definitely wouldn't say it's inferior to many of the other LED televisions out there.  It's still a good product but it needs to be at a little lower price point to make it a decent deal for the consumer.  As for me, this is going back to Amazon and my search continues.  Maybe I'll get lucky and find the original version of this guy without the \"E.\"Update:  Now that this is $100 lower than I paid for it, I would say it's more in the price point it should be.  I still think that it's just OK for a 3D LED but if you're on a budget, I doubt you'll be disappointed.Now that I've got the previous version, the M3D550KD, my suspicions have been confirmed, the new version is definitely NOT a true 120 Hz.  In all programming, the M3D550KD has a noticeably clearer picture even with the \"Smooth motion\" turned off which does essentially the same thing as turning \"Game mode\" on.  No matter what Vizio tells you, the M3D550KD is a true 120 Hz and the M3D550KDE is 60 Hz.", "Date": "December 14, 2012"}, {"Title": "Good TV with many features, for a reasonable price", "Author": "K. Woerner", "ReviewID": "R1NXEJSBSW7KHB", "Overall": "4.0", "Content": "I currently own two Vizio TV's, each several years old.  I've enjoyed both, though they are your basic LCD TV (not smart, LED, 3D, etc.).When looking for a new TV, price was a deciding factor.  I definitely wanted it to be smart, so I didn't need an additional box like Roku (which I own today) hooked up to it.  I use Netflix and Pandora a lot, so this was a must have.  Nothing against Roku because I love it -- but having it built in already is just easier.  Wifi setup was part of the initial turn-on procedures (you can skip if you want), so this was a snap to get going.  I did have to download the Pandora app (following a system update to Vizio Apps), but Netflix came already installed by default.Though less important, I did want the 3D capability given I have a couple movies that have 3D options.  I've never owned a 3D TV, but based on the test with Avatar 3D, I think it performed quite well.  I saw Avatar 3D in the theater, by comparison this TV did produce good image quality and 3D effects, without any blurring or stuttering.I tested this watching a Thursday Night Football game in HD, and the signal from my digital cable box was clear and responsive.  Having owned smaller TV's with less features, I can't really compare the image quality of this unit vs. something priced higher.  However, being a sub-$1k TV (when I purchased it on sale) with more than adequate quality during TV and movies (2D and 3D), I can't justify spending more for the apparent same functionality and experience.There is obviously a dispute over the impact of this TV being effective 120Hz vs. true 120Hz.  I think that is the case in many TV's today, given confusing descriptions and brand-created terms.  However, I judge by performance and not any specs.  Effective or true 120Hz, I saw no blurring/stuttering in action scenes with this unit.  Again, you can pay more for true 120Hz or even 240Hz, but its debatable if you are getting the performance that goes along with the price increase with the higher end specs.In short, this appears to be a good TV with great options for the price.  There are not many TV's with a 3D options with a sub-$1k price tag, and the addition of smart functionality is practically standard these days, so I am quite happy with my purchase.", "Date": "November 30, 2012"}, {"Title": "Do not regret purchase at all.", "Author": "LXAstud", "ReviewID": "R37XZGBB7ICPDI", "Overall": "4.0", "Content": "For under $1000, I do not think you can find as quality a TV as this. Out of the box, the picture blows, which is the reason I deducted a star. Thankfully, I'm not afraid to mess with the picture settings, and I now have a picture that rivals my Samsung UN55ES8000FXZA. Had I known I could've had a similar picture as the Samsung, there is no way I would've spent that kind of money on the Samsung name. Also, I love the passive 3d. It works flawlessly, and being able to use the Real3D glasses you get at the movie theaters is a real plus. If you are looking for a 55in LED Smart 3D TV and you have some tech sense, this really is a no-brainer.", "Date": "December 15, 2012"}, {"Title": "Great deal, great features", "Author": "Grimmy \"Grimmy\"", "ReviewID": "R3F2VVNZSV8BN3", "Overall": "4.0", "Content": "Got it from warehouse store, basically same price (with tax) except Amazon offers free shipping (with Prime) and basic unpacking and setup. I needed the easy return option just in case, though.At first we were annoyed. My wife commented that the picture looked strange. It was the dreaded \"soap opera effect\", and this TV does not have a specific setting to turn off \"smooth motion.\"After some research, I tried setting Game Mode on, and that fixed it. Whew! It was quite unpleasant watching Dark Knight Rises like it was filmed in the As The World Turns studio.Thank goodness for Game Mode, because this is an unbeatable price for its features. A smart TV which lets you use Amazon video, Netflix, Vudu, Hulu Plus, YouTube, some Yahoo stuff, Twitter, Skype (cam needed), FaceBook, MGo, Rhapsody ... no browser, but there is a VGA input. (You'll need to let it update to get all these apps.)And passive 3D, to boot. It may not look as high-res as active - from four or five feet away you may see thin horizontal lines - but it'll do.There are inputs aplenty: 4 HDMI, cable/antenna, component, VGA, ethernet, USB ...Connecting a soundbar: HDMI 1  is the ARC port. That lets you connect a soundbar to it via HDMI and control the volume through it (you can connect the video input directly to another HDMI port on the TV, rather than through the soundbar HDMI IN). If you're connecting a Samsung soundbar (HW-E450, in my case), you need to turn AnyNet+ on for this to work. Go to TV settings, turn CEC ON, System Audio Control ON. Try the Device Discovery. You probably want to go to Audio settings and turn TV speakers OFF. The video may vanish, but just go back and select that input. That should do it!You can adjust backlight settings manually only if you turn off the Ambient Light Sensor in advanced picture settings..Haven't gotten the ideal picture yet ... cinema mode is darker, standard mode seems to warm, vivid mode gives splotchy faces and skin (darker, pink patches on yellowish skin).Had an issue getting Netflix to play video. Called tech support and they resolved it. I've called them a couple of times and they were actually quite helpful.All told, I think we'll be keeping it.Update: sometimes Netflix fails and it goes nuts - the remote stops working. Try this:1- Power off TV2- Unplug TV from outlet3- Press and hold in the power button on the TV for 30 seconds (while it is unplugged from the wall)4- Release the power button5- Plug in the TV in6- Power on the TVNext:Un pair Remote :1. Press the \"Q\"  \"P\" and \"SPACE\" button on remote at the same time for 5 seconds.2.  Take out both batteries.3. Press all the buttons on the remote, one at a time (including the keyboard). (You can skip this step sometimes)4. Put batteries back in.5. Test the remoteRe Pair remote :1. Press the Green Button and RED Record button for 10 seconds.2. It should now be paired.3. Test out the remote", "Date": "December 30, 2012"}, {"Title": "Typical bait and switch", "Author": "James H Wood", "ReviewID": "RK94BTB8LR6CP", "Overall": "1.0", "Content": "This TV is your typical bait and switch for holiday season. Vizio produced a tv with amazing reviews, the m3d550KD...this is not that TV. The KDE is an entirely different television. It was rushed into production to replace the KD because it has significantly lower performance and a much higher profit margin for Vizio. The TV was so rushed, it doesn't even come with the correct parts. The TV and base are fine, but the neck is the wrong part and can't be used to connect the TV to the base. Since I can't stand the TV up, I can't even do a proper review of the TVs performance; however, if Vizio sends me the correct part I will update this review with how well the TV performs...which at this point I wouldn't expect much. Please search for M3D550KD before you purchase this TV. You will see Vizio made a model \"M3d550KD\" for about 3 months and it got great reviews. Then just prior to the holiday shopping season vizio canceled production of the KD and started pushing out the KDE. Now ask yourself this. Why would a company stop production and start a new production line on a TV after three moths, especially when that TV was getting great reviews? The answer is fairly simple, and similiar to the games some PC component manufacturers play. Make a great product, then make a s***ty product with a nearly identical model number. People will naturally think the second product is just a newer version of the earlier product since it has nearly the exact same model number...but alas it's just a trick.", "Date": "December 10, 2012"}, {"Title": "Previous reviews were right on the money.", "Author": "Amazon Customer", "ReviewID": "RC4OKJYDZ6QYN", "Overall": "5.0", "Content": "Set Picture to Game and, in my case, bump the color up to 70 and you get a perfect picture.  I am very much enjoying the Neflix app.  The set updated itself after I linked it to my home network.  Set was delivered on time and set in place by the freight company.  I am pleased.", "Date": "March 18, 2013"}, {"Title": "GREAT VALUE & EXCELLENT CUSTOMER SERVICE and UPDATES", "Author": "Mark D. Serbin", "ReviewID": "R2644BBGMT13CX", "Overall": "5.0", "Content": "I ordered this TV on a early Friday morning. It was in my living room late Tuesday morning only because Monday was President's Day. The price dropped $131 from the time I added it to my wish list to the time I ordered.I am replacing a 6.5 year old Sharp 42\" Aquos. The Vizio is like 1.5 inches thick as opposed to the 5.5\" of my Sharp. I was almost afraid to install wall mounting bracket screws. No only is is slim, is is rather light weight as well. I am amazed that there is no flex to it and that something this slim and light did not shatter the glass during shipping.Setting up the TV was rather simple. There was no problem connecting to the Internet, I was able to adjust the picture to my preference and the sound, ah the sound, amazing from such a slim unit. It puts my old Sharp to shame.I have not tried the 3D feature yet. When I do I will update this review. The 4 pair of passive 3D glasses is a real nice touch.The only real concern I have is that there is no physical On/Off switch! I hope that the remote is far more durable than it feels. I like the slide out QWERTY keyboard. I have small hands and have no trouble typing on it.I was able to add and remove Apps at will. No problems there either.The only negative I can list now is that the picture looks a little 'soft' even with DISH HD. It lacks a tad of crispness that my Sharp was producing. I will play with the controls a bit more to see if this can improve. This is my first TV with a 120 mega hertz refresh rate and I have read in many placed that it can produce a bit more 'soap opera' effect on programs than the good old 60 mega hertz of days gone by.I would have given this TV 5 Stars if it had a physical On/Off switch. I guess I am just a bit old fashion and like that one button. Otherwise there are enough HDMI ports and inputs to hook up just about anything you can throw at it.VIZIO, is a great value brand and appears to be making nice quality products. i don't know about durability, but if it can match my 2007 Sharp Aquos (which still works fine) then I will declare VIZIO a top tier #1 vendor along with Samsung, Sony and Sharp. Yeah, it appears to be that good, at a price the others can't begin to match. Great bang for the buck.UPDATE #1: Thanks to a comment left, I did find the power button. It's on the right side. A small button on the back among others. However there are labels but they are in black as well.I bought a Vizio 3D Blu-Ray player. Hooked it up to the TV and the screen had problems properly displaying the 3D picture.  I called Vizio at 3:15pm on a Saturday afternoon, they close at 4. The rep was most kind and helpful. Turns out that I just needed to eject the disc, and load it again. The 3D worked just fine and I must say the quality of the 3D is superb. Vizio uses passive 3D, the kind used in movie theaters. I was very impressed with Vizio's USA based customer service.The screen is glossy, very glossy. it's almost like having a black mirror. The blacks in the picture are some of the deepest black color I have ever seen on a TV. I guess this is an advantage of LED backlighting.While I was taking to the CSR at Vizio I decided to check out the extended warranty. They do offer a it via Square Trade. I took out a 3 year plan for $89. I am waiting for the full details to sent to me. With a TV this size, I thought it would be worth the expense. I have only bought one extended warranty before on my first MacBook, and used it once. It more than paid for itself. I would recommend a 3 year plan as most TVs will exhibit problems within this time period. The extended plan also has service tech come to your place. No bringing in sets of this size for service. That's a good deal.HDMI port #1 is not working.  I use a Sony Home Theater in a box system to add 5.1 channel sound to the TV. I noticed that the Sony can not pass through a 3D signal to the TV. Everything else about the Sony works fine with the Vizio.The set offers Skype. However only a Vizio web cam will work with Skype. My Logitech 9000 will not be of use. The set would not recognize my Pandora sign in. I'll keep working on that.At the end of week one, I have no overall regrets. While the screen is far more glossy that I would like, it does offer very deep black color and is the right size for 3D viewing. The viewing angles are wide with virtually little loss of picture quality.UPDATE #2: I got in touch with VIZIO customer service about the non-functional HDMI port #1. They had me run some diagnostic tests, but they did not resolve the issue. VIZIO shipped a new unit to me, the delivery company took my broken unit off an entertainment stand, hooked up the replacement to the stand and made certain that everything worked before they left. I had been a Sharp LCD buyer prior to this VIZIO, but due to the customer service and that they stand behind their products, I will be a VIZIO customer for years to come.The 3D is amazing. I got a copy of Avatar and the 3D effects are simply stunning. No problems with the screen being too dim or any artifacting in the picture. Simply amazing 3D.Netflix on the VIZIO works like a charm.  It's actually a better experience on the 55\" TV than using my Apple TV box. When watching a series, like House of Cards or Archer, one episode ends and the next one starts. With the Apple TV I would have to go back to the series menu, select the next show, hit the control button a few times and the series would start playing. With the VIZIO app its just automatic. Nice touch guys.", "Date": "February 20, 2013"}, {"Title": "Awesome 3D at a great price", "Author": "M. Birdsall", "ReviewID": "R3AUQFJ42PWSJN", "Overall": "5.0", "Content": "The picture is great, the 3D is even better than a movie theater and the apps work great. I am very satisfied with this TV. (It's my second Vizio)I would recommend picking up a sound bar with subwoofer. The stock speakers are a little on the tinny side. And don't be afraid to tweak the picture settings.", "Date": "March 20, 2013"}, {"Title": "Great price, Good TV", "Author": "Abigail Adams", "ReviewID": "R32T9QNWIPCE1M", "Overall": "4.0", "Content": "I did a lot of research on which TV to buy, and decided to go with CNET's recommendation (which was the 240Hz model), but when I went on Amazon, the only one I could find was the 120Hz model.  I decided to buy this one after I purchased a Panasonic that had horrible black levels.  I have watched several movies on the Vizio and am happy with the picture.  I haven't used the 3D option yet.  The other issue I had was the \"Soap Opera Effect.\"  If the odd smoothness bothers you, just go into TV Settings and turn Game Mode \"On.\" (If you change the game mode in the picture settings of the TV...i.e. the mode that changes the color, etc, it will not help, you have to change it in the main setting area).  Once I turned Game Mode on, the viewing was more cinematic, rather than soap opera.Pros:Very slim designEasy to set upPlug and play USB capabilityQWERTY keyboard on remoteDecent variety of appsCons:No DLAN capabilityTV has slow response to remote commandsOverall great TV, may just upgrade the remote.Update Edit 6/4/13I have been using the TV for a while now.  I have no complaints.  There is one minor thing that may bug some people however.  It seems the TV automatically adjusts for low light, and bright light scenes.  If there is a scene that is between the mark of low vs bright light, you can see the black bars on the top and bottom of the screen flicker a bit as the picture is changing.  This is not a deal breaker or even a big issue for me.  I am happy it has the automatic setting, so I don't have to float through and find how to change the light settings in the middle of watching something.  Just something to be aware of.", "Date": "April 1, 2013"}, {"Title": "Nice picture", "Author": "A. Middleton \"sqeeshy\"", "ReviewID": "R2O776XTYALDDJ", "Overall": "3.0", "Content": "I just bought this TV and I must say is has a nice picture but I can't get the Netflix app to stream. I have tried everything and it still wont work. So I am having to use my PS3 to stream Netflix. Very disappointed with that aspect of it. Other than that, no problems thus far.", "Date": "December 3, 2012"}, {"Title": "M3D550KDE - stay away from this.  Stay away from VIZIO support", "Author": "Anand Shirodkar \"Anand\"", "ReviewID": "R2NP1B1FCJB50Z", "Overall": "1.0", "Content": "I had this tv shipped to me early December. This tv is supposed to have in-built-wifi & should connect to my internet instantly. What I found out after setting up the TV is that it was not able to stream videos using my Netflix account. I contacted Netflix & Vizio - Netflix confirmed there is no issue with my account and that the TV is defective if it is not able to play videos.Note that Netflix works on anohter smart tv in the house.Here are some of my exerience with Vizio customer service that I wanted to share with you. Clearly at this point I am frustrated with the quality of customer service I got from Vizio.With wireless connection ---------------------------I am not able to play videos from netflix.Vizio support tried resetting tv and my account few times with no resolution.  Vizio support pointed finger at netflix and vice versa.Vizio support is not even willing to talk with netflix when I offered to initiate conference call with netflix.I have anohter old smart tv and a WII (in additon to computers), bought couple yrs back.  All connect to same network using wireless connection, with no issues playing netflix!With wired connection ------------------------The wifi tv is not able to connect internet.None of the Internet Applications work.TV fails to connect to internet.  My computer works on same wired network port with no issues.Vizio support responded by saying that this issue is related to the modem ... My computer works on same wired network port!I would ask everyone to STAY AWAY from this piece of junk from VIZIO.  Currently have initiated my online return process !In nutshell (this is what I get from support):If you can not play Netflix - its netflix issueIf TV fails to connect intenet with wired connection - its my modem !Bottom line:Stay away from all VIZIO products to avoid dealing with vizio support.  They are all well trained to disagree with customers on all problems.  What a Customer Support and what a product !", "Date": "December 10, 2012"}, {"Title": "This is better than listed...", "Author": "Kelly", "ReviewID": "R9CSM6A205OMG", "Overall": "5.0", "Content": "The feature list here is wrong... this TV, the Vizio M3D550KDE:1) Is a passive 3D TV. It comes with 4 passive 3D glasses. (The \"3D\" in the serial number is a giveaway: M-3D-550KDE.) These are the same kinda glasses you get in the movie theater and don't require batteries like the active 3D technology.2) It it a Smart TV, with both wired and wireless connections. It supports NetFlix streaming, along with Hulu and a couple other streaming services I haven't used. It has also automatically updated the firmware through the internet connection.There is also a lot of confusion on the differences between M3D550KDE and the M3D550KD based on refresh rates and other features. Accoring to Vizio The M3D550KDE replaces the M3D550KD in the product line, and the M3D550KD is no longer being produced. The M3D550KD was native 120Hz with a scanning backlight technology that simulated 240Hz. The M3D550KDE is native 120Hz.Also, I saw a review that said the base didn't fit the TV. This was not true in my case... the TV came complete with the base and everything went together in a jiffy.For the price, this is an amazing TV... great picture, great features, and a great value. I'm very happy with the purchase.", "Date": "January 2, 2013"}, {"Title": "Best tv ever", "Author": "E", "ReviewID": "RKJMR08H7ZPBC", "Overall": "5.0", "Content": "I have zero negative things to say. Was hesitant about buying a tv on amazon but I am glad I did now. Shipping came from a 3rd party company and they take extreme care of the tv while they deliver it. The guy was really helpful and even asked if I needed help setting it up. He actually came before I had finished building my new tv stand so I passed on the help but it was definitely appreciated. If your reading this review and wondering how the tv is, well the only words I can use is amazing. Everything is crisp and clean. 3D is also amazing. I have directv which offers a few 3d channels and I had zero issues getting them to work. The remote is simple to use and the slide out keyboard is a huge plus. If your hesitating, don't. Get this and don't think twice because you will be extremely happy.", "Date": "May 9, 2013"}, {"Title": "Mind-blowing picture and 3D quality", "Author": "JeffSto \"JeffSto\"", "ReviewID": "R1FKSD1SU5V7ZZ", "Overall": "5.0", "Content": "I have no complaints so far about this TV. I hooked up my Sony blu-ray 3D player and the picture just about blew my socks off, as did the quality of the 3D.Also, for what it's worth, I feel that 55\" is the perfect size. I realize that is subjective, but it really is quite big without being too showy and outrageous.", "Date": "May 2, 2013"}, {"Title": "I love this TV", "Author": "Casey", "ReviewID": "R27MKV6ZTXXY9Y", "Overall": "5.0", "Content": "This is a great TV. We got it for a great price. It came with 4 glasses which was a bonus. It has wonderful color. The first 3D movie we watched was Avatar. This tv brought the movie to life. A must buy.", "Date": "April 24, 2013"}, {"Title": "best buy", "Author": "Kelly Goff", "ReviewID": "R1PBTAJJOUVONG", "Overall": "5.0", "Content": "Great pic.  great sound great color as good as it gets. could not ask for anything more and price is right", "Date": "April 23, 2013"}, {"Title": "Vizio", "Author": "planner board", "ReviewID": "R1H0C0T17ZQFHH", "Overall": "5.0", "Content": "The TV came packed very well. The set up was very simple to my WIFI. Everyone is very impressed with the color and clarity of the picture.", "Date": "April 22, 2013"}, {"Title": "VIZIO M3D550KDE 55-inch 1080p 120Hz LED Smart 3D HDTV", "Author": "Charles", "ReviewID": "R3MH0HMXGSUMSK", "Overall": "5.0", "Content": "The 3D picture quality is amazing.  You can view from 180 degree angle.  The Vizio also has apps and internet.  I rated this product five stars; this was an excellent purchase for the money.", "Date": "March 18, 2013"}, {"Title": "Finally got a big screen TV!", "Author": "grrrama", "ReviewID": "RDHZ43SKU8Q58", "Overall": "5.0", "Content": "We just moved to a new place, and hubby didn't want to move heavy TV's up the stairs.  Bonus!  I finally got my big screen TV!  Love it!  Have been having fun with the apps.  Watched many Amazon Prime Movies over the weekend, and we're just getting started.  Actually looking forward to football now.  (First time I've ever said that).  Thanks Amazon!", "Date": "March 18, 2013"}, {"Title": "Awesome TV", "Author": "stacy", "ReviewID": "RTSTBO8R63JXG", "Overall": "5.0", "Content": "The TV is great!!!  Picture is clear and it has so many options.  Love the remote control too.  Worth the money for sure!", "Date": "March 11, 2013"}, {"Title": "Great TV", "Author": "Paul Girgenti \"MrGee\"", "ReviewID": "R15BLS5LRTD7W4", "Overall": "5.0", "Content": "The TV works great but the drivers for the smart TV werent loaded. so that was a hassle but this TV is well worth the money.", "Date": "February 28, 2013"}, {"Title": "Works great!", "Author": "mkztg", "ReviewID": "R3AHV2VC9632U0", "Overall": "4.0", "Content": "So far no issues with this TV in 2D and 3D mode.  One thing that I still need to research is what the various options for 3D settings actually are.The TV was delivered on time and in perfect condition.  The picture is crystal clear.  Through reading various reviews on this TV before I bought it I found out that when the TV is placed in \"Game Mode\" you will get the brightest and clearest picture.I love having Amazon Prime Instant streaming as a part of the apps.  The only one 'missing' as far as I'm concerned is Crackle.  If it had that app this TV would be one of the very best out there but even without it, this is a great TV.", "Date": "February 14, 2013"}, {"Title": "Beautiful Picture", "Author": "Jennifer Komarek", "ReviewID": "R2YSVJN477HVRA", "Overall": "5.0", "Content": "Beautiful picture and amazing 3D! My husband was skeptical about getting a 3D TV, but he was shocked at the picture and 3D that came from this TV. We love that the glasses needed don't require batteries, they are the same that you would receive at a theater (we actually have a couple of pairs from a movie we saw at a theater and they work with the TV.)  Great TV at a great price!", "Date": "January 15, 2013"}, {"Title": "Great deal!!", "Author": "MiguelNYC \"MiguelNYC\"", "ReviewID": "R1CAIE6MYX6PD7", "Overall": "4.0", "Content": "I read all prior reviews before buying. I am very happy with the quality of the product. I purchased 55 inch slim, 3d 120... I was impressed how good it look...super slim. Tons of ports for all your needs. Highly impressed with the quality of blue ray dvd and video games. As prior reviews mentioned for the regular channels watching games you might want to adjust the colors. The standard settings isn't optimum for everyday tv programming. 3d is something I am not interested, I haven't tested the 3d, the glasses are pretty regular nothing special.  What really pronted me to write this review is the Amazing Sound...This TV is loud.. I will not be purchasing additional speakers.  One negative is the smart features.  The options are very limited, I haven't been able to browse the web. Netflix worked just fine. Again overall great price, looks good, sounds good let's hope it last.Update. 8/15. 9 months later. No problems at all. The building netflix is great, youtube as well. Very happy with this purchsse.", "Date": "December 30, 2012"}, {"Title": "TV Smarter than we are !!", "Author": "Debbie L. Wilson \"alwaysshopping\"", "ReviewID": "R2ITH11EL1SVME", "Overall": "5.0", "Content": "Purchased the tv, picture was great, sound was good, 3D worked great, apps would not load, netflix would not work.  Son picked up the remote and in 10 minutes everything working including Netflix. The TV was a great purchase !!!  We did buy a more expensive router.", "Date": "December 26, 2012"}, {"Title": "own 2 vizio tvs and have th 3rd on the way", "Author": "Clyde E. Baxter", "ReviewID": "RZHP2F2AJ1RZS", "Overall": "5.0", "Content": "i have a 42 and a 46 inch vizio tv and have a 55 inch on the way.  the two i have have been outstanding.  they have better pictures than my sony 50 inch tv. i was so impressed with the vizio picture that i am replacing the sony with the 55 inch vizio.", "Date": "March 3, 2013"}, {"Title": "Very Happy With The M3D55", "Author": "Lawrence Lazar", "ReviewID": "R35D73W7Q9LCR5", "Overall": "5.0", "Content": "I purchased the Vizio M3D550KDE in the middle of November from a big box warehouse store. Setup was very easy, fast and just about fully automatic.The picture is very, very good.As setup the factory default settings left the picture fairly washed out and fuzzy. I researched settings for the TV online and then changed the settings to those recommended but with a few additional tweaks. What a difference that made. Just a beautiful picture. The depth of color and clarity make for a really superb viewing experience.The 3D is also very, very good. It is not quite as sharp as in the movies, but is more than acceptable and a really fun feature.Unfortunately there isn't too much 3D content on the air or cable at this time, but I'm hoping that it will improve as time goes by.A real plus is that a non-active 3D system is used and the same type of glasses you use in the movies will work with this TV.The internet setup was very easy and I had no problems connecting with my wi-fi setup.  At first the Netflix app didn't work but I understand that the incompatibility has been solved and it is now working.  The selections of included apps is very nice, but I wish that a web browser would be available.The audio is clear and very powerful for a flat panel TV.  No sound bar needed.To sum up: this television is right up there with the best. The picture as I have mentioned excellent and the 3D feature will be a hit with everyone....and the price makes it a no brainer.\"", "Date": "January 20, 2013"}, {"Title": "Great TV, Great Customer Service", "Author": "Oversteer325", "ReviewID": "R2WG32DSCC1XA6", "Overall": "5.0", "Content": "I purchsed this TV in November and was amazed by the picture.  Setup was easy and everything worked as advertised.  The TV has received two software updates since I purchased it and the menu system is much smoother and a few of the smart apps have been upgraded.  I started having a flickering issue on the screen in December and eventually the TV had trouble turning on at all.  I contacted Vizio customer service and described the issue.  They had me try a couple of troubleshooting methods but neither of them were successful.  They immediately shipped me a brand new replacement without even sending anyone to look at the TV first.  The new TV arrived in less than a week and the delivery company took away the old one and set the new one in my theater room.  This was one of the most hassle free customer service interactions I've ever had.  I am completely satisfied with the new TV and have had no issues since.", "Date": "January 30, 2013"}, {"Title": "Happy now that Netflix issue is resolved", "Author": "SYV Mom", "ReviewID": "R3BE1IZAYG63D8", "Overall": "5.0", "Content": "First the negative.  We received our set on 1/8 and, as some others have experienced, Netflix would not load.  We could sign into our account and see our queue, but could not play any of the movies.  It took several contacts with Vizio, by email and phone, but I'm happy to say that as of today, the issue has been resolved (at least for me) with the latest firmware update. I still don't understand why it should take ten days to receive an over-the-air update that has been out since December.  Now that it's been fixed, we are completely happy with our purchase!Anyway, this was an upgrade for us from our Vizeo 37-inch flat screen that we'd had for about 5 years.  We're blown away.  The picture quality was fine for us, right out of the box.  Haven't even played around with all the custom settings.  The 3D works great, love the passive glasses.  We tried active 3D in a local store, and didn't like it as well.  That's probably subjective, and I would suggest trying both styles before making a decision, as I know others who definitely prefer the active.  If you have Directv you have access to four 3D channels, plus there's 3D programming available through some of the apps.You are limited to 17 apps at a time, but you can change those up if you want.  Plus, you have the ability to create different profiles, allowing different family members to have access to their preferred group of apps.The remote is bluetooth as well as IR, so I was able to link it to the DTV DVR and use it as a universal remote.  The remote has a slide-out keyboard, but I find it easier to use the on-screen keyboard.", "Date": "January 18, 2013"}, {"Title": "Impressive Vizio 3D LED Lit Smart HDTV", "Author": "Dsinned", "ReviewID": "R3PHX33P2RYKHG", "Overall": "5.0", "Content": "Most of the comments here have been glowing reviews of this HDTV, and I must add, they are all well deserved.  This IS a phenomenal 55\" TV set for the money.The only criticism I have is the Bluetooth Universal Remote.  I could not get it to work quite right with my external, HDMI connected devices; the cursor, enter, and audio volume controls worked with my Apple TV, Xbox 360 and Vizio Soundbar, but I was not able to get each of these devices' Power On/Off to work from the Vizio HDTV's remote control. Perhaps, because these older devices do not support Bluetooth, but then why do they work at all?  However, my Sony 3D Blu-ray DVD Player worked flawlessly, so it must also be using a Bluetooth remote.  Of course, it would have nice to retire all my other remotes, but no such luck.  In Vizio's defense, I have had the same type of issues with every other home electronics device known to modern man when it comes to \"universal\" remotes.This Vizio is incredible thin (and lightweight at ~55lbs).  I was able to manage it myself from the store to the back of my SUV and all the way home into my family room without assistance.  Even attaching the stand was a snap, although at first I thought it was missing from the shipping box.  Alas, it was there all along.Internet setup was also a breeze, although having my security password written down for future access was essential.  With my DSL WiFi (\"N\" type) Gateway upstairs at a distance of about 10' verically (thru the ceiling), I received a signal strength of \"5\" bars.  Excellent!I have not yet tried \"3D\", but that is next on my list of things to do with this HDTV.  I have only purchased a couple of 3D Blu-ray DVDs; the new TRON movie in 3D being one of them.  That movie was a disappointment, so I think I will try to stream Avatar or maybe Titanic in 3D from VUDU and see how that goes. There is an Internet data rate test under the \"Network\" menu options, which is useful to determine if streaming a movie in \"HD\" will work without dropouts.  The best test result I have obtained is right around 4500 Kbps which is minimally adequate.  I cannot get a DSL ISP with a download speed higher than 6.0 Mbps where I live, but my other, smaller Vizio 3D HDTV uses the same WiFi connection and usually works fine even in VUDU's highest quality resolution \"HDX\" movie format, so this 55\" should work just as well..Again for the price paid, Vizio makes very high value and quality Smart 3D HDTVs.  I recommend paying a little extra for 3D feature for \"future proofing\".  Arguably, a \"3D\" HDTV (even if only ever watched in 2D) is technologically superior, and at the very least, often purchased for the bragging rights alone.", "Date": "April 1, 2013"}, {"Title": "The KDE IS NOT Equal or better than The older  KD model", "Author": "W. Accousti", "ReviewID": "R89PB0ESLXH4N", "Overall": "4.0", "Content": "I bought the 3D550KD model from SAMs Club. Blew me away for a price around $1100.  3D and picture was amazing. So good I went back this week to but another for our bedroom.  Couldn't believe price was already $250 lower but in reality it is a different TV. The newer one I got was the KDE model.  Pretty sure picture is inferior in direct comparison.  Not sure bedroom TV is worth the extra $250-300 but I am perplexed why Vizio would cheap out.  They still had market edge for that size class at $100 cheaper than competition. I'm sure they figured they would sell a ton more for under $1000 with less features.Addendum: after a few weeks of viewing and almost direct comparison (the 2 TVs are in different rooms) I think the image is the same on each.  The motion settings are absent from the KDE but for me this is fine because I turn it off on the fast motion (240hrz) models because I do not prefer the soap opera effect.I had to re-rate this higher because I think it has a very  good image with stunning 3D using plain theatre glasses for the price and size. Vizio needs to update the on-TV product guide (and the paper one supplied) as it is not exactly accurate for this model.", "Date": "March 11, 2013"}, {"Title": "excellent tv", "Author": "mandie3979", "ReviewID": "R3AB3VW307BA5H", "Overall": "5.0", "Content": "A great tv for the price got it on time and was worth it. Would recommended to someone else. And. Would buy something else.", "Date": "March 10, 2013"}, {"Title": "Great for the Price!", "Author": "Gary Paquette \"Gary P\"", "ReviewID": "R1UAZ5J2XALCM6", "Overall": "5.0", "Content": "If you are not worried about netflix, or refresh rates and are just looking for an inexpensive 3D 55\" TV with a solid picture then look no further. Understanding that some of the reviewers here are technology snobs and some Net Flix Adicts, Fact of the matter is for the price it can't be beat.", "Date": "January 27, 2013"}, {"Title": "Great value but speakers blew at %40 volume 4 days after we got it", "Author": "Papa Vlahodame", "ReviewID": "RJ91KFK6LBT68", "Overall": "4.0", "Content": "Everything is awesome about this tv except that the speakers blew in just 4 days.  We are old folks and don't watch the tv at any louder than %40.  I have heard that virtually all the speakers on thin tvs blow.  So we called Amazon and as usual got excellent service.  They sent us a new TV in a week.  (Thanks amazon!)  We then bought a sound bar for our new one.  Its one month later and everything else about the TV is great.", "Date": "January 9, 2013"}, {"Title": "Great value, one annoying image problem", "Author": "D. M. Shopper \"Dave\"", "ReviewID": "RC66NTWS8HY6S", "Overall": "4.0", "Content": "I love my new TV.  It's bright, looks great with all the movies I've watched, and the 3D effects are crisp, with a minimum of fuss.  It also works very well as a computer monitor.With passive 3D TVs like this one, you get to use cheap glasses (I brought some home from the theater, and they work), that are light and comfortable, but at the expense of some vertical resolution.The vertical viewing angle for 3D is quite limited, or else you see ghosting.  If you make sure that your stand/mount is tilt-adjustable, this isn't a significant problem.The big annoying problem is the local dimming effects.  On dark screens, like the windows boot-up logo, the local dimming flickers distractlingly.  It's even worse if you have the 3D glasses on.  I've never noticed a problem during an actual movie, but it could crop up in some very dark scenes.Also, the power cord is not detachable from the TV, which makes running the cable through walls trickier when the TV is wall-mounted.All in all, an awesome value for the money, that looks absolutely great 99% of the time.", "Date": "December 5, 2012"}, {"Title": "Buy this TV if you hate your money and your time", "Author": "RebeccaBock", "ReviewID": "R3GFOZJ3ARP5T4", "Overall": "2.0", "Content": "So awful. We had our TV for two weeks before the remote control went out...so we sent it back and had to have it replaced.  Then, two weeks ago, after having the TV for one year and two days (I kid you not), the TV screen went out--first it had colored, pixilated lines across it, then half the screen went black, and then finally (and within an entire evening), the screen went totally black. Well, this is apparently an extremely common problem with this model of TV and it's been deemed \"unfixable\".  So you have to try to get a new \"board\" and repair it yourself if it's outside of the warranty window (which is a year).Well, Vizio so graciously decided to honor our warranty (that was two days outside the window), and we got a refurbished TV today after they hauled away the old one. And this remote doesn't work.Seriously, stay away from Vizio.  Do your homework first.  This TV has very common problems, and they arise within a short amount of time from purchase.  Buy a brand that will cause you less time and headaches.", "Date": "January 10, 2014"}, {"Title": "AMAZING TV!  for the PRICE...", "Author": "Adam Sinclair", "ReviewID": "R3BK7CIPPH2K76", "Overall": "4.0", "Content": "I am contributing this +/- 5 months after I actually got this model (M3D550KDE).  I did a lot of online and in store research ('cause I was waiting on my tax return!).  This is what I eventually settled on.  Granted, there are BETTER tvs out there...you will not find one of this QUALITY for anything less than $500 more than this.  I Have read all the reviews and can say that i have not been disappointed with this product!-My internet connectivity worked from day one and still works.-Apps work. Netflix, youTube, etc.. (Although the selection of apps isn't awesome).-3D (the reason I bought this) is great!  3D movies are theater quality!  My only complaint is VERY SLIGHT motion blur when 3D Gaming on-line. (reason for 4 star rating)  Trust me...for first time 3D owners, this is the best VALUE!", "Date": "July 9, 2013"}, {"Title": "Stunning.", "Author": "Donald Cantwell III \"Captain Temerity\"", "ReviewID": "R3EVDZWSZCAJ40", "Overall": "5.0", "Content": "I watch a lot of TV.  I also play video games, have a Google TV (the Logitech Revue), stream Netflix and such.  Our television gets a lot of use.  So when our 56\" Samsung DLP died on us (the second time in a year), I started looking for the best replacement I could find at a reasonable cost.I'd recently found out that Vizio was manufactured in the US (California).  Having worked at Best Buy for 12 years, I wasn't as familiar with the brand (we didn't stock them in the stores, and they were commonly thought of as a \"cheap Costco product\"), but I read more and more great reviews.  And then a friend loaned us an old Vizio LCD to use while we were in-between sets.  It was older, but certainly a nice TV.I decided on LED because I wanted the brighter backlike, and I knew that, if I was going to make the investment at all, I wasn't going to go less that 120Hz.  The 3D aspect isn't something we're interested in at all, but I do like that the (included) glasses are for passive instead of active viewing (active give me headaches and eye strain).We did have a problem with the set initially, in that it kept not getting a signal on various inputs after a period of use.  It turned out to be a bad internal board, but Vizio's support was tremendous in helping me get it resolved (both online and the person who came out to do the repair), and we haven't had a single problem since.I use the apps on the TV more and more, especially the YouTube one, as it's often snappier than the Revue at this point.  We have strong wifi in the room, but I tend to prefer a wired connection when available (I use a powerline adapter).  And the screen is just lovely, much sharper than our old HD TV (LED vs. DLP will do that for you).My overall experience has definitely changed my (mostly uninformed) opinion of Vizio, and I would certainly put them at the top of my list for TV choices in the future.  Wouldn't mind checking out their computer line at some point as well.", "Date": "June 29, 2013"}, {"Title": "Noise and artifact in picture", "Author": "Fire Chief 17", "ReviewID": "R38O026ZUU4MWA", "Overall": "1.0", "Content": "Easy to setup and install but picture quality was poor.  Red pixels appearing in light areas as digital noise. Very distracting.  Have contacted seller and they said they would review and advise on repair or replacement.  Not pleased with the Quality control on this model.  I already had a 4 year old Visio and it works great.  Also - no sound on HD channels - only on the regular channels of the same stations.  Will ask why when repair person arrives.", "Date": "June 29, 2013"}, {"Title": "Amazing TV", "Author": "Cake Gurl", "ReviewID": "R2QNBCLW3E5KX8", "Overall": "5.0", "Content": "This tv is truly awesome! I am still baffled that you can get such a large 3D tv with all of the bells and whistles for a fraction of the cost of a standard television in its class. The picture is like glass. The 3D makes you feel as if you can touch the object. Before purchasing this tv, make sure you measure your space. I don't recommend sitting directly up on it. It should be in a large room to enjoy it. The picture does appear to be a little daytime soap-operish, but that is easy to change. I put mine on the mode for viewing games and am very pleased. The sound quality is minimalistic as in all flat tv's. I just ordered a Vizio sound bar, and a Vizio 3D Blu-ray player in which I am waiting for. My Family Room is wired for surround sound in ceiling. It has the speaker covers, but I don't know what kind of speakers to purchase. The previous owner's took their speakers, which is no big deal. I'll be able to fully enjoy the tv once I get more in ceiling speakers. This tv has all of the most used apps at your finger tips and you can simply install others that don't pre-exist. I would recommend this tv to anyone. The small issues I have are not enough to warrant me not to highly recommend this tv. It is the best purchase I have made considering there were only( 3) 55\" class tv's that would fit my entertainment center. I have had all brands of tv's from the highest end and probably the lowest end also, but this tv is in a class of it's own. I LOVE IT, LOVE IT, LOVE IT!!!", "Date": "June 10, 2013"}, {"Title": "Great LED Smart TV for the money!", "Author": "VanillaVixen \"dawnalee\"", "ReviewID": "R1VZGEZ7TXGIPM", "Overall": "5.0", "Content": "Upgraded from a Sony 46\" that was about 3yrs old, love the Vizio brand.  Customer service is great, based in America.  The apps work great, lots to choose from. Great bargain, I would recommend.  I also purchased a 4yr Squaretrade warranty, always a good buy to have coverage on such a large TV.  The picture is great, the remote is super with the query keyboard built in.", "Date": "May 23, 2013"}, {"Title": "Happy customer", "Author": "Jessica B.", "ReviewID": "R5ZHIO8AY33C1", "Overall": "5.0", "Content": "I bought this television because it seemed like a good deal, and it was. I've had it for a few months now with no complaints. We replaced our dying plasma TV with this one, and it lets off way less heat. I love the smart features- my husband and I use Netflix and Pandora all the time. Accessing Netflix through the TV is much easier than how we previously had to do it through the Playstation 3. The picture is great. My husband took the time to adjust the picture and color settings, and it looks perfect. We haven't used the 3D glasses yet, as we don't have any 3D movies, but I'm excited to try them out.", "Date": "May 22, 2013"}, {"Title": "would not turn off", "Author": "Jonathan C. Dean", "ReviewID": "R30918A37WYN11", "Overall": "1.0", "Content": "I was looking for Smart TV and l  found a great deal. well when I got delivered I set it all up and turned it on just to find out it would not turn off.  it's a good TV if you can get it to turn off", "Date": "May 20, 2013"}, {"Title": "Great Pic!", "Author": "Stella Palmer", "ReviewID": "R3IL0KE96LC3TH", "Overall": "5.0", "Content": "This TV has a great pic and the 3D is way more than I expected. It was such a great purchase.", "Date": "May 14, 2013"}, {"Title": "good buy for the money", "Author": "brian osterloh", "ReviewID": "R2HP15S5LMI0NO", "Overall": "5.0", "Content": "great buy for the money went to tv store the other day and seen a 3d tv for 17,000 just insane why pay that much when this one works just fine", "Date": "May 14, 2013"}, {"Title": "Great TV for the price", "Author": "Noonan", "ReviewID": "ROC6EO92AAHG1", "Overall": "5.0", "Content": "Fantastic bright picture and wide range of smart tv applications and functions. 3D function works great with standard theater glasses.", "Date": "May 9, 2013"}, {"Title": "Love it!", "Author": "sarah", "ReviewID": "RW119KAQGBANI", "Overall": "5.0", "Content": "This is a great 55in LED Smart 3D TV for the price.  Comes with 4 - 3D glasses and a qwerty keyboard.  Easy to setup.", "Date": "May 9, 2013"}, {"Title": "Re: Vizio M3D550KDE 55-inch 1080p 120Hz LED Smart 3D HDTV", "Author": "SIPSEY 12 \"SIPSEY AT Class of 2012\"", "ReviewID": "R2GVIPUIX02TFJ", "Overall": "4.0", "Content": "Very easy out of the box set-up even for someone like me considering I'm not techno literate. The thing I like most about this purchase is the value for purchase, it's like purchasing A Zebco-33 reel, you can spend A lot more or A lot less but this item gives you much more bang-for-the-buck than any other like-item available at the current time. My rating of four stars may be because of of the existing lighting lighting in the viewing room, but with the lights on we have A rainbow effect on screen at times and also A friend of ours has the same size TV and also has the recessed lighting without the rainbow effect; which may be because he has A 240Hz; for the money this is the best.", "Date": "April 9, 2013"}, {"Title": "VERY PLEASED!!!!!!!!!", "Author": "Gail D Harris", "ReviewID": "R3OVIQEGMPIOHJ", "Overall": "5.0", "Content": "We are so proud of our new tv--- wonderful picture and more features than we senior citizens will ever learn to use..But we will try to learn something new everyday.  After shopping around I found foa so be a GREAT price.", "Date": "April 9, 2013"}, {"Title": "Excellent picture.  Terrible speakers.", "Author": "Joe", "ReviewID": "RA5GS36PBITTZ", "Overall": "4.0", "Content": "I'm overall very pleased with the television.  The picture is rock solid and very impressive.  As other reviewers have noted, the tiny speakers are less than up to the task.  I've incorportated a small sound bar to do the job.  For the money, this a great value.", "Date": "April 8, 2013"}, {"Title": "Love it!", "Author": "Batman", "ReviewID": "R1SR8KH9Y8SGJF", "Overall": "5.0", "Content": "I would definitely recommend this product to everyone! The screen is amazing, the 3D is breathtaking, and being able to watch netflix, hulu, and youtube right off the tv is spectacular. The best part is that the glasses don't have batteries so you never have to worry if they are charged or not. It's very sturdy and well built with a big base so i  never worry about it falling. Assembly was easy as well and I got it really fast and in excellent condition!", "Date": "April 6, 2013"}, {"Title": "working great so far", "Author": "IRIS SMITH", "ReviewID": "R1792B8DD88FTI", "Overall": "5.0", "Content": "always wanted a smart tv. great price picture quality great. internet is great just as long as you dont have too many electronics on at the same time.", "Date": "April 6, 2013"}, {"Title": "TV is good, but remote stopped working after a week", "Author": "Chetan Siddaramu", "ReviewID": "R2UJH7NBPJDFVQ", "Overall": "3.0", "Content": "I ordered TV on March 2nd, got TV delivered on 28th now remote stopped working yesterday. We could not watch anything and we are stuck with a TV which cant be switched on.", "Date": "April 5, 2013"}, {"Title": "Like this set", "Author": "Debbie Farley", "ReviewID": "R1JWLYSYBHU92O", "Overall": "5.0", "Content": "Great picture. Love the size. Am learning how to use the Apps...but this set has it all. We like it.", "Date": "April 3, 2013"}, {"Title": "best purchase by far", "Author": "karan weiler", "ReviewID": "R2WXBS025DP4PS", "Overall": "5.0", "Content": "wished it had more jacks to plug other items in but still an awesome tv!! My spouse and I both love it!!", "Date": "February 22, 2013"}, {"Title": "Great TV", "Author": "Jesus  A. Rangel", "ReviewID": "R1SS6BP81INTEO", "Overall": "5.0", "Content": "I'm very happy with my Vizio TV. It has excellent picture quality. The 3D feature works great. I enjoy watching movies much more now. I would definitely recommend this TV to anyone looking for a 3d smart TV.", "Date": "February 5, 2013"}, {"Title": "Great for a day", "Author": "Shirley Crehan", "ReviewID": "R3DOCV3XXL3CFD", "Overall": "5.0", "Content": "Various reviews indicated this was the set for me.  With HD, FTC,wifi,blueray.  Image is great.  Remote is cleverly designed. Haven't mastered all tools but soon to enjoy it all.  Second day the set went wild, when you tap left side you get the picture back.  Vizio has been excellent  at solving the the issue and today my new set will be put into place Without wanting it to happen got full experience  with support. Give the product a look. Pricing at Amazon was cheapest by at least 100.00.", "Date": "December 27, 2012"}, {"Title": "TV is pretty good", "Author": "Christopher Casey", "ReviewID": "R2YRBK1PYQDF4K", "Overall": "4.0", "Content": "The picture and 3D settings are great.  The apps are lacking, there is no app market, just a few loaded apps.  Netflix is not working so I need to see about fixing that and you can not get on the internet at all other than you tube and facebook.  I can access more using my PS3 so if you are going to have a PS3 or Xbox connected to a Vizio you can save yourself some money or get a larger Vizio by buying one without the apps.", "Date": "December 26, 2012"}, {"Title": "Great TV great price", "Author": "Mikeysoonerfan", "ReviewID": "R30ZAZF95K0V45", "Overall": "5.0", "Content": "All I can say is wow, this TV rocks. I know a lot of people have knocked it since the refresh rate isn't a true rate. I really haven't noticed it. This TV is replacing a JVC ILP TV. It puts that TV to shame by far. As far as the internet is concerned, worked fine for me. Netflix and youtube worked perfectly with the TV no problems at all. So far I have watched Avatar, Spiderman, and The Hobbit in 3D. The 3D is fantastic. The kids love it. It was fun watching my youngest child trying to reach out to the stuff in front of him. Another nice thing is this TV is flicker free, that means no batteries for your glasses. If you ever have to replace your 3D glasses they are cheap unlike the flicker style which will cost you over a $100. The color on the TV is great as well. The only thing I would knock is the remote. It flips out a keyboard that feels a little flimsy. It works good as a universal, runs my Hopper DVR just fine. Just seems to be missing something. I don't know, maybe I just expected something fancy. Great TV, the 4 HDMI slots are nice since I seem to have all these extra devices that run off of it now. This is my 3 HD TV, the best I have bought so far. It is also my second Vizio, Vizio has not let me down yet", "Date": "March 24, 2013"}, {"Title": "Excellent TV with superb features and picture. Great value for the price range!", "Author": "B Lael", "ReviewID": "R197C5UKWMCVEG", "Overall": "5.0", "Content": "I spent many hours researching televisions and the Vizio M3D550KDE is tops in its price range.After reading reviews and specifications for many LED and Plasma TVs in the 50-55\" category, I settled on the M3D550KDE (and I'm glad I did). There were some negative comments on the speed and reliability of the internet apps (Netflix, Hulu, VUDU...) on this TV, but as far as I can tell, these glitches have to be related to internet connection speed. I have a 30MB internet connection and the apps perform flawlessly, even wirelessly.So far, the only slow response related to apps and remote response time that others mention seem to be shortly after initial start-up. If the TV is turned on and allowed to \"boot\", for lack of a better term, there is no remote lag and the apps are not alow at all. I was able to reproduce remote and lag time by using the remote to navigate immediately after the television was turned on. As with most televisions, the picture quality is dependent on the source. With quality source material, I have yet to encounter a poor picture. That said, I did tweak the picture settings from the factory defaults to obtain the best picture. None of the factory presets for \"Movie\", \"Sports\", \"Golf\" etc. provided the best overall picture.Overall, this was a great purchase.", "Date": "April 15, 2013"}, {"Title": "VIZIO TV!  AWESOME TV AND FAST AND SUPERIOR SHIPPING!", "Author": "Mary Von Elling", "ReviewID": "R2YVN0FTD8NXAU", "Overall": "5.0", "Content": "AMAZON HAS GREAT SHIPPING AND VERY FAST! THEY EVEN OFFERED TO SET UP MY T.V..THE PRICE WAS UNBELIEVABLY LOW FOR SUCH A GREAT TV. CHECK OUT CONSUMER REPORTS 2013 IF YOU DON'T BELIEVE IT.WE COULDN'T BE MORE PLEASED WITH AMAZON. THANKS AGAIN!!!", "Date": "March 22, 2013"}, {"Title": "low quality vizio", "Author": "Carolyn K. Deprima", "ReviewID": "R3L1KBT34NBWV0", "Overall": "2.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2GK27UYAFAEPZembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2GK27UYAFAEPZrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo2GK27UYAFAEPZchiDiv\").innerHTML = document.getElementById(\"cv_mo2GK27UYAFAEPZhiddenPre\").innerHTML;\n};\ncv_mo2GK27UYAFAEPZrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2GK27UYAFAEPZso;\t   \n\n\nfunction cv_mo2GK27UYAFAEPZloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2GK27UYAFAEPZso = new SWFObject(swfLocation, \"cv_mo2GK27UYAFAEPZAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2GK27UYAFAEPZso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2GK27UYAFAEPZso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2GK27UYAFAEPZso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2GK27UYAFAEPZso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2GK27UYAFAEPZso.setAttribute(\"height\", swfHeight);\n          cv_mo2GK27UYAFAEPZso.setAttribute(\"width\", swfWidth);\n          cv_mo2GK27UYAFAEPZso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2GK27UYAFAEPZso.write(\"cv_mo2GK27UYAFAEPZflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2GK27UYAFAEPZ', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2GK27UYAFAEPZ';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2GK27UYAFAEPZ', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2GK27UYAFAEPZloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2GK27UYAFAEPZ\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3MKFKHK2KW1XA\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3MKFKHK2KW1XA\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3L1KBT34NBWV0\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3MKFKHK2KW1XA/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2GK27UYAFAEPZduration')) {\n      document.getElementById('cv_mo2GK27UYAFAEPZduration').style.display='none';\n    }\n    cv_mo2GK27UYAFAEPZloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2GK27UYAFAEPZloadSwf(movieID, playerVersion) {\n   return _cv_mo2GK27UYAFAEPZloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2GK27UYAFAEPZnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2GK27UYAFAEPZ', 0, h);\n}\n\nfunction cv_mo2GK27UYAFAEPZresetPlayer(w,h,bw,cc) {\n  cv_mo2GK27UYAFAEPZnewHeight(h);\n\n  cv_mo2GK27UYAFAEPZso.addVariable(\"resetBandwidth\", bw);\n  cv_mo2GK27UYAFAEPZso.addVariable(\"cacheCode\", cc);\n  cv_mo2GK27UYAFAEPZso.setAttribute(\"height\", h);\n  cv_mo2GK27UYAFAEPZso.setAttribute(\"width\", w);\n  cv_mo2GK27UYAFAEPZso.write(\"cv_mo2GK27UYAFAEPZflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2GK27UYAFAEPZRollOverImg = new Image();\ncv_mo2GK27UYAFAEPZRollOverImg.src = \"http://ecx.images-amazon.com/images/I/71%2B31PlV-DS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2GK27UYAFAEPZpreplay = document.getElementById('cv_mo2GK27UYAFAEPZpreplayImageId');\nif (cv_mo2GK27UYAFAEPZpreplay) {\n  cv_mo2GK27UYAFAEPZpreplay.onmouseover = function() {\n    cv_mo2GK27UYAFAEPZpreplay.src = \"http://ecx.images-amazon.com/images/I/71%2B31PlV-DS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2GK27UYAFAEPZpreplay.onmouseout = function() {\n    cv_mo2GK27UYAFAEPZpreplay.src = \"http://ecx.images-amazon.com/images/I/71%2B31PlV-DS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2GK27UYAFAEPZpreplay.parentNode;\n\n  var cv_mo2GK27UYAFAEPZcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2GK27UYAFAEPZcurrentClick) {\n      return cv_mo2GK27UYAFAEPZcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:43 MinsI first had a problem with the Bluetooth remote. It quit working on the third day. After speaking with 3 different customer service representatives, I finally spoke with a technician who was able to help me correct it. They really should inform the customers on how to disable that function if you're not going to need it, before it messes with the remote. Anyway, after that it seemed to work just fine.Then, while watching normal TV channel reception, I was noticing that occasionally, I was getting these white alternating lines on the top of the screen (\"Transmission Bars\"). (There is a 1 minute video I filmed so you can see what I'm talking about). I also checked on both of the 21\" Vizio TVs and saw it was happening on them as well! I didn't have this problem the old Vizios that I just replaced. I know that this is just a minor adjustment to the size/position control. BUT when I went into that option I discovered that I can only control these settings on the HDMI input and the RGB input. So. I called the customer service line. I couldn't get anyone to understand my problem. First they told me that it was a problem with the equipment I was playing. When I told them I wasn't using any, it was just normal TV reception, they told me to hit the zoom button. This would cut too much on the surrounding scenery out of view. THIS WAS NOT ACCEPTABLE! Here is an example of an adjustment I could have made myself, but have been denied access! I asked the representative to speak to a technician but was unable to talk to one.I was also disappointed in the fact that the Guide button on the new TVs will only let you look at what is currently on. Instead of being able to to find something to watch that's coming on next, Now you have to wait until after the hour/half hour to see what shows are playing at that time. It sort of makes the guide kind of useless. I was not to happy to see that a lot of the commonly used functions were now only in the menu screens. It was nice to have direct access before. Not everything needs to be in the menus! I know everyone is trying to find ways to cut costs, but cutting too much stuff lowers to desirability of the product!On February 1st, I sent letters to the VP and the CEO of Vizio in Irvine in hopes they could help me with the transmission bars and maybe re-instate some of these lost features (like the guide button) for their future TVs. On February 16th I received a call from someone at Vizio. But, to my dismay, this person could do nothing for me. I'm not even sure I know why he called me!  I told him that apparently I would be looking at someone else's TVs when it came time to buy new TVs.In closing, I really like the picture quality of the Vizio TVs. I've compared them to MANY other brands. I believe that they have the best picture reproduction without spending thousands of dollars. But if they continue to try to save a dollar here and a dollar there, the product, and subsequently, the customer will suffer. And now I am stuck with 3 Vizio TVs that have these transmissions lines on them. I hope they will correct some of these issues so I will be able to purchase their products again in the future!", "Date": "February 18, 2013"}, {"Title": "NetFlix doesn't work", "Author": "Volkan Berksoy", "ReviewID": "R1G8KR64B8VD0S", "Overall": "2.0", "Content": "NetFlix application doesn't  work with VIZIO M3D550KDE; Vizio & NetFlix working together to resolve the issue!!! NetFlix users be aware...", "Date": "December 21, 2012"}, {"Title": "VIZIO M3D550KDE 55-inch 1080p 120Hz LED Smart 3D HDTV", "Author": "LoLo", "ReviewID": "R3P4C95KCR01PD", "Overall": "5.0", "Content": "-HIGHLY RECOMMENDED!-BEAUTIFUL LED HDTV!-AMAZING PICTURE QUALITY!-3D Is Like WOW! I watched 3D Avatar and was shocked at the picture quaility...very crisp and sharp!-I have the HDTV mounted with the: Cheetah Mounts 32\"-55\" Articulating LCD TV Wall Mount Bracket with Full Motion Swing Out Tilt & Swivel Dual Arms for Flat Screen Flat Panel LED Plasma ... http://www.amazon.com/gp/product/B002MYQTEI/ref=oh_details_o02_s00_i00-Power cord is detachable if you want to run it behind the wall with your other wires...you can!-Sound is good enough for me! If you need and like all the extra...then go out and buy all the extra speakers!-4 HDMI's to hook up your other devices, like: Samsung Cable Box, Sony 3D Blu Ray DVD Player, Apple TV...etc etc etc-Wifi setup was nice and easy! I'm using the Apple AirPort Extreme Base Station.-APP's are preloaded into the VIZIO HDTV and they all work very GREAT!+December 25,2012: - Another thing I noticed about this Vizio Smart LED HDTV is that when I was watching Netflix via the Apple TV device (I have everything Apple. I stream stuff from my iMac, iPhone and iPad via the Apple TV to the Vizio Smart LED HDTV. I prefer the interface and setup of the apps on the Apple TV more than the Vizio Smart LED HDTV app interface and setup.) I have the Apple TV set to shut off after 15 minutes of no activity. I also noticed that once the Apple TV shut off, about 15 or 20 minutes of No Signal, the Vizio Smart LED HDTV also shut off! I am assuming it shut off to save energy as well as wear and tear of the product! I really like that feature! *THANK YOU VIZIO*SOME PEOPLE GAVE THIS PRODUCT BAD REVIEWS AND I AM NOT SURE WHY...BUT ONE THING I DO KNOW IS THAT SOME PEOPLE WILL NEVER BE HAPPY OR SATISFIED, NO MATTER WHAT!GO BUY THE VIZIO M3D550KDE 55-inch 1080p 120Hz LED Smart 3D HDTV & ENJOY IT!", "Date": "December 15, 2012"}, {"Title": "Terrible sound", "Author": "Amy S. Myhaver \"Flankitty\"", "ReviewID": "R2IEM4ESCKZWVN", "Overall": "1.0", "Content": "So I loved this tv for the first 4 months with the exception of the terrible \"tinny\" sound...until tonight when the Vizio remote stopped working. First the volume controls wouldn't work and then I couldn't get to my Netflix (which I'm paying for) and then I couldn't even power the tv off. I couldn't even power the tv off by using the actual power button on the tv itself! I literally had to unplug the tv! Insane. I will attempt to contact Vizio tomorrow, but won't hold my breathe. Frustrating! Junk.", "Date": "July 18, 2013"}, {"Title": "Bought used", "Author": "Deanna Brunlinger", "ReviewID": "R3CJG63179H0T3", "Overall": "2.0", "Content": "When I got it, I plugged it in & turned it on. Then I was doomed to \"on\" forever. If I turned it off, within 20 seconds, it turned back on. Had to unplug it for it to stay off. I returned it, & was sent a 2nd one. I plugged it in & it turned on by itself! Sent that back, too. Picture was awesome!", "Date": "May 23, 2013"}, {"Title": "Great TV.", "Author": "robert monical \"SgtMon\"", "ReviewID": "R3EBZWSUVKDX83", "Overall": "5.0", "Content": "Great TV. Bought 3. Man Cave, living Room, master bedroom. Wife didn't know why it had to be a 3d TV until she watch a few movies in 3d. Internet app is great. I have one prime account and all 3 TV's use it to watch movies and tv shows. The TV in the man cave only picked up 1 or 2 bars from my home wireless network. After putting in a wireless range extender it gets 5 bars. I now own 4 Vizio TV's.", "Date": "May 13, 2013"}, {"Title": "Great TV", "Author": "Eon I.Williams", "ReviewID": "R248SA8TUFBLUO", "Overall": "5.0", "Content": "Great TV - Great price & speedy delivery.  First one had a faulty screen, but replacement came quickly w/o a hitch!  Amazon's customer service is excellent.  Mounting it was easy & the set up for the wireless was a breeze!  The TV has bells & whistles we haven't had the chance to thoroughly check out, but we definitely noticed the viewing is sharp & clear.  If you haven't replaced your TV in a few years, you'll be blown away with the difference in detail!  The flat screen DOES relect glare from our large west-facing windows on the opposite wall, so we have to resort to closing curtains for afternoon watching, but we've seen some matt-surface flat screen TVs & pictures aren't as sharp.  If I had any complaints about the TV at all, it would be that Closed Captioning doesn't come on automatically when the tv is muted (or else I haven't found it yet) - my old Vizio had it, but it was a simpler model & you have to download the full manual.", "Date": "April 8, 2013"}, {"Title": "This TV is garbage stay away", "Author": "ergibson83", "ReviewID": "R31AUQNSB9IOR9", "Overall": "1.0", "Content": "This is a perfect example of 'you get what you pay for'. I have been a fan of the Vizio TVs since day one. When I order this TV, I knew my history with Vizio TVs so I thought I was getting a deal. Well this TV has tons of backlight bleed around the edges and when I called Vizio customer support, they made it extremely difficult to honor any type of manufacture's warranty service. They requested 3 different times pictures of my display powered on and off, after 3 attempts at unsatisfactory emailed pictures, I finally said forget and I'll just return the TV through Amazon. Amazon was very helpful and made the return process very easy and effortless. I will never buy a Vizio TV again. Vizio has definitely lost a customer. +1 for Amazon :)", "Date": "February 24, 2013"}, {"Title": "Great TV", "Author": "content consumer", "ReviewID": "R2J87G1PO3XKS0", "Overall": "5.0", "Content": "The TV had great picture quality and the 3D feature is really easy to use. I think this TV is the best purchase I have made via Amazon, I am really happy with it.", "Date": "January 23, 2013"}, {"Title": "Don't buy", "Author": "Hello", "ReviewID": "R2FTA6DCILDEZ0", "Overall": "1.0", "Content": "Do not buy this TV.  Great deal, but you are getting what you pay for.The 120 Hz refresh rate is only an \"effective\" rate, with the actual being only 60 Hz.The Netflix app cannot stream any video content whatsoever...it basically does not work and an error message appears everytime I attempt to stream a movie/video.I bought this a week ago, and will wait until Christmas for more sales to appear.  I am returning this TV, being incredibly disappointed with the picture quality...thank goodness for Costco's return policy.I had a Samsung series 6 LCD before this.  The picture quality was superb, and family/friends always commented great things about it...but it went bad in only 3 years.  I never wanted to go back to Samsung after this.  However, now that I have seen the picture quality on the Vizio, well, it just doesn't even compare...not even by a long shot.  I plan on returning to the Samsung line, but plan on purchasing the extended warranty to play safe.", "Date": "December 2, 2012"}, {"Title": "Buyer beware", "Author": "Abdul C Jackson", "ReviewID": "R3GC8O3VFAFHK7", "Overall": "1.0", "Content": "Beware of purchasing any Vizio products. My Tv was shipped missing parts and when I contacted Vizio customer service to obtain the missing parts I was sent a continous runaround. You must send them proof of purchase but the kicker is that they only accept pictures of the receipt. When I sent pictures of the receipt I then had to call back and they said the picture was not good enough and they would not do anything about the missing part. The customer service people I dealt with appeared to be well trained in making the process as difficult as possible. They did everything short of telling me to send the TV back to the store from which it was purchased. Of course she said that would be my decision. This appears to be designed to make it so dificult that you eventually give up as I did and just send the TV back to the vendor so they have no warranty cost at the expense of the customer. Beware doing business with Vizio you will live to regret it!!!!!!!!", "Date": "February 9, 2013"}, {"Title": "Not a happy Vizio expereince", "Author": "herb craft", "ReviewID": "RXZ3TALIQBYZQ", "Overall": "1.0", "Content": "This unit shipped with old firmware and would not stream NetFlix. A tech call to vizio confirmed this info and I was told that their server would get around to updating the tv's firmware soon. When ask when \"soon\" was I was told maybe in a week or so. Not the right answer for me. Also this unit claims its 120Hz refresh but it really just 60Hz, and they do their stuff to simulate 120hz.All said a done it was a very nice 3D TV, but I want to watch Netflix now not in a week or two.Amazon is amazing, provided free pick up, free return shipping and credited my entire amount, including original shipping cost, back to my card in less then a few days. I can recommend buying big ticket items from Amazon will great confidence to all my friends and family. Great Job and Great service Amazon..................", "Date": "March 1, 2013"}, {"Title": "Satisfied customer", "Author": "BonnieLee", "ReviewID": "R5MX81ZMOTJKB", "Overall": "5.0", "Content": "Was a bit apprehensive about ordering a television online but didn't have any problems with shipping or the condition of the package when it arrived.  It was actually a very convenient way to purchase a TV.  The purchase price was the best deal I could find anywhere online.  I did my research and this model Vizio had the highest rating for picture quality in this price range.  I previously owned a Sony rear projection that I paid three times as much for and it only lived for 5 years.  The picture quality of the LED exceeds what I expected and the sound is good.  I am a technology amateur and I discovered that no matter how Smart the TV is, it is only as smart as the operater trying to set it up.  But I did manage set up by reading instructions and a few phone calls to Vizio and my satellite and internet provider.  Anyway, that was my only glitch and my situation may not be the same as others.  Otherwise extremely satisified with this purchase!!!", "Date": "February 6, 2013"}, {"Title": "Awesome Deal", "Author": "D. Green", "ReviewID": "R2BIIX2T1VWQ70", "Overall": "5.0", "Content": "Loved the quality of the picture and the 3D. I felt like I was in the movies. I replaced the Samsung with my Vizio due to white spots appearing on the screen. I am very pleased with this product.", "Date": "December 5, 2012"}, {"Title": "great tv", "Author": "ray", "ReviewID": "R37YO0V0FEC2EN", "Overall": "4.0", "Content": "I recently purchased this TV Sam's Clubgreat picture good quality couple of Nags the sound to be a little bit better definitely good idea to purchase a home theater system are good sound bar to go with it. 3d is very impressive. Barton watched avatar look just as good as it did in the theater. Picture is stunning with HD content, however the cable box hooked up threw coax cord looks only OK, as my older Polaroid 46' looks way better with the same setup. On the whole, the bang for the buck is definitely there, and really can't go wrong with this TV! Also Vizio is a great brand, and the smart hub I works effectively, gets the job done without being flashy or extravagant.  Certainly recommend this TV!", "Date": "March 25, 2013"}, {"Title": "Muy bueno", "Author": "Hugo Centeno", "ReviewID": "R3B2W8GL7EWC7V", "Overall": "4.0", "Content": "Recomendado excelente televisor  más y más y más  súper bueno en todo momento compárenlo esta en una súper oferta ....", "Date": "March 20, 2013"}, {"Title": "I Have The 240hz Class - Five Star", "Author": "Mike Mora", "ReviewID": "R2YNHSY8PYCLWK", "Overall": "5.0", "Content": "I bought the 240hz class VIZIO M3D550KD. I cannot speak to the difference between the 120hz and 240hz performance quality but I am very happy with my set.It appears you will pay about $200. more for the higher refresh rate. Costco was selling the 240hz units pre Black Friday but now only offer the 120hz model at just under a grand.", "Date": "December 5, 2012"}, {"Title": "I was about to buy it. but it is only 120Hz \"effective\" refresh rate", "Author": "Arun Krishnamoorthy \"Arun\"", "ReviewID": "R3L071VB21A9DC", "Overall": "2.0", "Content": "After researching for 4 days (there is not a single review on the M3D550KDE, only on the 47\" model or the older M3D550KD model, not the KDE model) I realized this is only \"120Hz effective refresh rate\" that means it is actually 60Hz. This is not good.Compare this to a $200 more Panasonic L55ET5Other than this confusion every this about this TV check out.if only this was true 120Hz I would have bought it", "Date": "November 25, 2012"}, {"Title": "Bait-and-switch????  Watch out...", "Author": "J. Mark Holland", "ReviewID": "RA6JDSQI24L62", "Overall": "1.0", "Content": "M3D550KDE is NOT as good quality-wise as M3D550KD.  I had just purchased the BETTER unit (from Best Buy, for $300 more), and when I searched for the user guide that might confirm how to mount it on the wall, etc., the search results listed AMAZON's $868 price - so I bit - clicked on it and did not see that it had an extra letter on the end.  My IT/Computer expert buddy says that the quality of the \"E\" version is very inferior to the \"no E\" genuine version.  Vizio, Amazon, or both of them need to fix this to avoid misleading customers - they need to make MUCH more clear that this is NOT the \"no E\" version, and that instead it is a much inferior version.  A hungry class-action atty may already be pursuing claims for this deceptive marketing.  BOTTOM LINE:  I am returning this \"E\" version and going back to Best Buy for the \"no E\" version.  NOTE:  Amazon's customer support was VERY helpful in connection with both this complaint and my return of the TV.UPDATE - looking into the situation further, it appears that the first \"bait and switch\" was by Best Buy.  In store, I asked them for the \"no E\" version (at the time, I did not even realize that there WAS an \"E\" and a \"no E\" version.  Without alerting me, they sold me the \"E\" version.  Subject to verifying everything (including mainly MODEL number), I'm now looking at getting the \"no E\" version from Buy Squad.", "Date": "March 25, 2013"}, {"Title": "el televisor me llego dañado", "Author": "eduardo", "ReviewID": "R36L4NV4JTE3MS", "Overall": "1.0", "Content": "buenas tarde la compra que les hice fue un fracaso cuando recibí el televisor la pantalla tiene los colores  movidos y llame al servicio técnico de vizio tuve que enviarles unas fotos para ver si me cubren la garantía", "Date": "March 18, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Four battery-free, lightweight 3D glasses included\nBluetooth universal remote with full keyboard\nThin LED Design: TV with stand (Width x Height x Depth): 49.67'' x 32.12'' x 11.22'', TV without stand (Width x Height x Depth): 49.67'' x 30.5'' x 1.5''\nSRS Studio Sound HD for crisp, clear audio\n1 million to 1 Dynamic Contrast Ratio for deeper blacks", "Name": "VIZIO M3D550KDE 55-inch 1080p 120Hz LED Smart 3D HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/511IovdtYbL._SY300_.jpg", "ProductID": "B0096YOQE2"}}