{"Reviews": [{"Title": "So far so good", "Author": "C. Jones", "ReviewID": "RUOQOVSVSE73I", "Overall": "4.0", "Content": "Initial impression.I'm coming from a 56\" Samsung 1080p DLP TV. (about 6 years old) I just received and set this tv up last night, first plasma that I've owned. I have yet to find any reviews or conversations about it by owners over the web other than some people seeing it at their Costco's for $1399, not around my town though. So I was a little hesitant to buy it but I read reviews for the e530 and e550 and figured this one should fall somewhere in between. And I saved $500 getting it as opposed to the 64\" e550. (I don't care anything about 3D or a \"smart\" tv)First impressions were mediocre, I couldn't tell much of a difference in the picture quality between it and my old DLP. I did some calibration tweaking and put in a dvd and noticed richer colors and blacks were definitely better. I then put the plasma in \"PC\" mode, to reduce lag, and started playing Halo 4 after some more tweaking. It played well but I noticed some blurring and the text wasn't as sharp as I'd hoped. PC mode limits calibration so I put the plasma in game mode, more tweaking and it was better. Game-play looked nicer then on my DLP but I still noticed a very slight blur affect, very slight distortion when looking side to side quickly in game. I didn't have time to tweak anymore. Started streaming Finding Nemo for my daughter - tweaked a little bit more, in which she replied \"Dad can you stop doing that please?\" (and she's only 3!) and got nice results. Also the sound in movie mode is quite nice and better than I expected.Watched an NFL game after that and the picture looked pretty good and couldn't see any blurring but I was tired, and kept falling asleep.I give it 3 stars (b/c currently its just OK) After doing all the research and finally deciding to get a plasma as opposed to a led-lcd I think I was expecting a huge leap in picture quality. I was envisioning a leap from SD to HD from years ago, which is probably unfair since my DLP was already 1080p. But thats what people made it seem like who owns plasmas. Don't get me wrong, I ended up being able to tell a difference but it simply wasn't as significant as I had hoped.Oh, and the tv handles reflections OK. I have two large windows on the opposite wall from the tv that receive indirect sunlight. I could see the windows in the reflection but it wasn't terrible and the tv gets brighter than I expected from a plasma. It may bother some people but I'm kinda used to it from my DLP. Closing the blinds will be sufficient.To be fair I will continue tweaking and trying to get the picture and playback results \"perfected\"; if something is noticeably improved I will come back and update my review, I can technically call it 3.5 stars - I just need that little extra picture pop to push it to a 4. And if I can get gaming figured out - no motion blur - and the picture improves it will easily be a 5 star especially at this price point.One last thing! The stand that comes with it is a swivel stand!! An unexpected surprise b/c the specs on amazon state otherwise. I may end up not mounting it to the wall now...Stay tuned!UPDATE: So far so good, I'm enjoying this TV and the picture is growing on me. (Though the screen is fairly reflective.) I'll hopefully be able to update this review with my \"final\" thoughts soon.UPDATE 1/23/13 : Changed to 4 stars, see comments below. If something crazy happens to this tv in the future I'll try to remember to come back and update my review.FINAL UPDATE (Unless something breaks) 6/23/13 : My review remains the same, no changes. Using as my main TV and enjoying it with no problems at 6 months; glad I didn't splurge and spend $2k+ on another model or different brand. I don't like 3D and have no need for a \"smart\" TV, I use my Xbox for that. Besides, in the gaming world a smart TV can actually cause slight lag. (The time it takes for a button pushed to show up through the screen) I'm happy with the set and it remains 4 stars.If anyone can recommend a cheap soundbar please let me know!", "Date": "December 14, 2012"}, {"Title": "Better than hoped for", "Author": "Steve", "ReviewID": "R1LDJWYFKV0KNY", "Overall": "5.0", "Content": "I'm not going to get long winded but just purchased this model and couldn't be happier. Picture quality is amazing. I also have an E8000 Samsung LED. Its not that good but a really close second. If you're a tech guy, this isn't for you. Very few options for tweaking your picture quality.My LED has 3d and I never use it. I have a Samsung blu ray that is hooked up via ethernet. Up loads are flawless.Pros: Picture quality. Its slim.Cons:  Not a smart TV and I didnt expect the heat output from a plasmaOverall, very good TV and for that price, its hard to beat.", "Date": "March 5, 2013"}, {"Title": "Great \"Basic\" 64\" TV", "Author": "Chris", "ReviewID": "R2XBKB2YT4QBEA", "Overall": "5.0", "Content": "When I say \"basic\" I mean a non \"smart\", non 3D TV.  However this TV is pretty advanced as far as picture quality (really overall quality) is concerned and I'm glad I looked past some of the reviews (on other sites) that dinged this TV.  Various dings complained about humming or poor volume, pixel failure - blah, blah, blah.  Well I can tell you that my TV does not hum whatsoever (no matter how bright I run the cell light or brightness).  The TV volume (and sound quality) far surpasses my expectations and all 2,073,600 of it's pixels work.  In short, it's everything I wanted in a Plasma TV - and - it's 64 inches diagonally (bonus!).If you're looking for a 64\" non \"smart\"/non 3D TV with excellent picture quality (and a large amount of video adjustment options), I think this one is pretty hard to beat.BTW - I have it in a room that has a tremendous amount of morning sun and with a couple of clicks of the remote I can modify the settings (cell light) to comfortably view it through the glare.  Oh, and I'm going to add curtains over the blinds in this room to eliminate this small tweak I need to do every morning.", "Date": "October 30, 2013"}, {"Title": "Great tv", "Author": "Faisal Junaid \"Fjunaid\"", "ReviewID": "R2LEB5B4QH6MAV", "Overall": "5.0", "Content": "I bought this tv from best buy. This is a great tv, the picture clarity is excellent. The smart apps are nice could have been better (interface can be improve alot). The screen is fairly reflective. The remote is a regular standard tv remote, it would have been nice if they had included qwerty keyboard at the back of the remote. I have dish network and they don't feed true 1080p, the best way to see true performance of tv is by playing the blue ray DVD.Overall this is a great tv. So far I'm satisfy with it.", "Date": "February 24, 2013"}, {"Title": "Samsung 64-inch 1080p plasma", "Author": "PerryAJoE \"Joe\"", "ReviewID": "R2R4ILIEEUESRX", "Overall": "5.0", "Content": "Great price, easy setup, a great 1080p picture and (with 64 inches) a great viewing experience.  This TV is only 2-D but it is just what I wanted.  Maybe 3-D is the latest thing but given the limited programming for 3-D, I would say that the extra $$$ is not worth it.  In fact, it is hard to find enough hi-def programming to use that feature all the time let alone the hi-def plus the 3-D functionality.  I love this TV.", "Date": "February 16, 2013"}, {"Title": "Great TV & Great Seller", "Author": "Javier Leal", "ReviewID": "RHJGBDRNAM97B", "Overall": "5.0", "Content": "I considered other tvs, and after reading other reviews and doing some research, I decided to purchase this model, no regrets.", "Date": "January 18, 2014"}, {"Title": "Samsung 64\"", "Author": "AL", "ReviewID": "R3GYYJ67FM9SOV", "Overall": "5.0", "Content": "TV has Clarity of picture and clarity of sound.  Just had for a month and so far, so good! Would recommend to anyone.", "Date": "December 21, 2012"}], "ProductInfo": {"Price": "$1,999.99", "Features": "1080p Full HD Picture Performance\n600Hz Subfield Motion Refresh Rate\nWide Color Enhancer Plus", "Name": "Samsung PN64E533 64-Inch 1080p 600Hz Slim Plasma HDTV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/31uxn1Sa7hL._SX300_.jpg", "ProductID": "B009ZGEYS4"}}