{"Reviews": [{"Title": "A darn good deal", "Author": "Josh Mole", "ReviewID": "R2JWZPSTYCLV0M", "Overall": "4.0", "Content": "When I bought this tv, I didn't have high expectations. I knew it would do the job because I'd read some other reviews saying that the only problem they had was a few dead pixels, but I was thoroughly surprised. I haven't seen a single dead pixel in the month I've had it. It's super thin (thinner than I expected), feels really solid, and has a great 1080p picture. I haven't had a single problem with it. The only tiny niggle I have is the sound is a little small and just sounds a little off sometimes, but I found a cheap Bluetooth speaker, hooked it up with an Aux cable to my tv and it's completely fixed. This tv will please the average television watcher.", "Date": "December 13, 2012"}, {"Title": "Great TV", "Author": "Yingzhou Du", "ReviewID": "RW7DQ8ERIC1OC", "Overall": "5.0", "Content": "Have used it for 4 months. No problem. Great TV for the price. Sharp image. Better to buy a ~$30 speaker to make it perfect.", "Date": "January 25, 2013"}, {"Title": "Decent flat panel, Great price", "Author": "Amazon-Addict \"Dusty\"", "ReviewID": "R2AV9Z1P48A6LR", "Overall": "5.0", "Content": "I've owned this LCD flat panel for over a year now and it is a nice addition to our home.Basic functions: 3 HDMI inputs, 1 AVI input, 1 VGA input, 1 component input, and 1 3.5mm audio port, as well as a much less common \"digital audio\". The reason I say less common is because it is not a standard digital audio port and I have not been able to find an adapter for it so I just use the 3.5mm audio out.Advanced functions: Coax digital/analog input, volume, menu(with advanced options listed below in Pros), and power controls can be accessed via remote or on the side of the TV. LED back light for energy efficiency, and zero glare, 80 degree viewing angle. HD 1080pi display looks incredible day or night.Pros:HD 1080pi  zero glare  LED backlight  mountable unit(mount not included)  easy to use remote  wide viewing angle  Loud stereo internal speakers  Aspect Ratio presets: Dependent on input and/or channel(ie HD channels vs. Standard definition) but still better then nothing.  Advanced video options: Picture presets and custom preset with brightness, contrast, saturation, and sharpness. 3 color temperatures, DNR, Adaptive Lumina Control, and Flesh tone.  Advanced audio options: Balance, surround sound, equilizer, SPDIF type, and auto volume control.  Parental controls: Channel blocking, Input, and program blocking.  Other options: OSD Timeout, multi-language support(English, French, and Spanish), DPMS, Power on and power off timer, and sleep timer.Cons:This TV is not just wide, it is thick, at about 5\" it really sticks out.  Inputs mostly on the left side of the TV make for an eye soar if you use the AVI, component, or coax cables  you will have wires clearly exposed.  Menu functions are limited. Though basic, audio, video, and picture options are available, advanced options  like duel input viewing and backlight dimming(TV can get really bright in a dark room), as well as custom screen picture stretching is non existent.  Audio 3.5mm output makes 3 loud popping feedback sounds through sound system when TV is turned on.Overall this TV at the time was a steal for $400(2012 purchase) and after a year of heavy use, it has all the necessary functions to serve as a nice upgrade from a CRT unit. It's lack of custom picture stretching can be annoying when viewing a select few wide screen movies. The loud popping feedback when turning on the TV is also a big negative if using the 3.5mm audio port. The build quality of the TV is great, it has no dead pixels, no bleeding through the screen edge, and no scratches from moving. I would highly recommend this TV to anyone who is looking for a crisp big screen at a low price and someone who isn't concerned about wires hanging out the side of the TV or a thick panel that sticks several inches out from the wall.**(Edit)**Have owned this TV for over a year now and it still works perfectly aside from some questionable odd behavior from HDMI port 1. The port works fine when connected with my smartphone but it will not recognize my Laptop anymore so I moved my laptop to HDMI port 3 and everything works fine. Also I found a digital audio adapter for it at Home Depot on clearance the other day, however it was not compatible with newer digital audio receivers.", "Date": "February 8, 2013"}, {"Title": "Great!", "Author": "A Zelda Fan", "ReviewID": "R1T800ZM1W4E45", "Overall": "5.0", "Content": "I have had this TV for 8 months now. I haven't had any problems at all with it. The internal speakers are a bit tinny, though. There is a headphone/speaker jack on the TV, so you could install some nice speakers. The TV is pretty slow to power on, at about 15 seconds, and the Hisense logo is pretty grainy, but it's great once it's on. I have a ps3 and a Wii attached to the TV, and switching between them takes just one button on the remote. There is an analog port, an AV, a Component, and 3 HDMI ports. There is also a 3.5mm audio out port for speakers. The visual experience is great. There are 4 preset picture settings, plus one that you can control. Cinema mode has incredible depth and saturation, making it feel like you're inside the TV. Vivid mode is great when there is a lot of ambient light. You can adjust the Brightness, hue, saturation, contrast, and sharpness. As for audio, there are two different modes, plus a surround sound setting. the equalizer is fully adjustable, and pretty intuitive. The refresh rate on this TV is slower that Vizio or Sony, but it is still Much faster than humans can detect. I highly recommend  this TV!", "Date": "January 31, 2013"}, {"Title": "Great Deal", "Author": "Melissa", "ReviewID": "R8XMREQBPM3IS", "Overall": "4.0", "Content": "I bought this TV from Costco about 14 months ago for $400, which is an awesome deal. It's a great TV--haven't had a single problem with it. The only things I don't like are how long it takes to turn on (just a bit annoying) and the sound. The speakers on this TV are dreadful (small sound, have to change more than 10 clicks to hear any volume difference), but it's not too hard to go out and buy some nicer speakers to hook up to it.", "Date": "September 30, 2013"}, {"Title": "Good tv, some issues, GREAT PRICE!", "Author": "Reviewerthree3103", "ReviewID": "R3DA0FZP80IQXZ", "Overall": "4.0", "Content": "Great tv, but has flaws. It's speakers are on the bottom of the tv and don't give a clear sound, (echoes a little.) It's picture quality isn't the best, but better than others. The price of the tv is what lead me to buy it. $400 for a tv that last a while is a great price to pay! It looks great and still works great! It has HDMI ports for connecting an Xbox 360, ps3, blu-ray, dish tv, or anything HDMI up to it. Over all this is a good tv for its price.", "Date": "February 17, 2013"}, {"Title": "great tv, amazing price", "Author": "Tomas", "ReviewID": "R3UKEPMDY21J5S", "Overall": "5.0", "Content": "I bought my 42\" Hisense from Walmart, it was an old floor model on clearance so I got it for a reduced price of $180. The speakers on this TV are terrible so i invested in a Logitech surround sound system, which fixed the issue. The refresh rate is lower than the name brands but is barely noticeable to the naked eye.I have read some reviews of people experiencing intermittent shutdowns for no reason. This hasn't happened to me yet but I have only owned the tv for about 2 months so I will keep my fingers crossed. Other than that, picture is sharp and clear, 1080 looks great, and for the price I couldn't have gone wrong.", "Date": "October 22, 2013"}, {"Title": "I was HAPPY ,but now im not  POWER on POWER clapper ,sucks", "Author": "D. searcy \"Goldfinger\"", "ReviewID": "RM9QJ0LA3ZA37", "Overall": "2.0", "Content": "Ok im sure someone will come here one day and have the same exact problem i have and be pretty cautious on warranty replacement plan,  Now I did some research and the Hisense model is one of the fastest selling models in China,although mine was made here.I had the BLU ray playing and the crazy power keeps turning off the tv and restarts it self, so i switched to Cable box and its set at 1080P as well so ,i fiddled around for at least 3 hours and was banking my head,then it hit me,these both play At the 1080P which is standard for the situation in almost most new TVS ,well it turns out the TV will now Play when i set the cable box to  720p ,i cant play blu ray player,now i bought an extended warranty that guaranteed replacement for 3 years after original warranty run out, OH yeah it just ran out,now before the crazy mess happened it was an excellent TV period, stellar even, sound isn't grand but I use a sound bar anyhow  so now matter.I did read that many models have the same issue but i have Magnavox 52 inch and knock on woood has been around 5 years and dos it all very perfectly.I will let all buyers know what the cause is ,remember set cable to 720 or lower.", "Date": "October 8, 2013"}, {"Title": "Great when it works!", "Author": "Richard \"O\" \"Values: Trust, Excellenc...", "ReviewID": "RDWZ1SWE7BQJK", "Overall": "1.0", "Content": "Video, after flickering for a day, completely crashed after 10 months.  Sound OK.  Looks like two weeks to get it fixed (new main board and power supply).  Poor customer service!  Not sure how house call to repair will go.Right now I have a large screen TV sound player.", "Date": "July 9, 2013"}, {"Title": "HiSense tvs suck!", "Author": "John D.", "ReviewID": "R2ODGDZ7RUS9BW", "Overall": "1.0", "Content": "HiSense has the worst customer service. Their tvs are terrible and if you google \"HiSense tvs suck\" you will see what I mean. I had mine for 90 days. It went bad and I sent it back. They would not honor the 1 year warranty. Save some time, don't buy a HiSense product!", "Date": "May 21, 2013"}, {"Title": "flimsy", "Author": "Nicholas P. Tang", "ReviewID": "R2FVJP0RPBUB0C", "Overall": "1.0", "Content": "This TV just cracked without dropping. It's thin but not sturdy. I would not recommend this to anyone but the most fastidious of individuals and probably not safe for delivery.", "Date": "January 24, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Hisense F42K20E 42\" 1080p 60Hz LED HDTV", "Name": "HISENSE F42K20EGB 42\" LED 1080p 60Hz", "ImgURL": "http://ecx.images-amazon.com/images/I/31QNNZP2ghL._SY300_.jpg", "ProductID": "B009CBY10S"}}