{"Reviews": [{"Title": "Sharp does not cover their product after sale", "Author": "Commguy", "ReviewID": "RNKRD5NEPX3KQ", "Overall": "2.0", "Content": "This TV is big. Very big. Definitely an upgrade from my 55\" Plasma as far as size goes. The picture quality is no too impressive out of the box, even with a Blu-Ray. I found after research this is due to the motion enhancement settings, which were meant to make fast paced motion better. However, they actually cause a pretty bad, very noticeable motion blur when anything moves. After playing around with the settings (you can find with a quick google search) the picture was much better. Of course you need an HD signal to get a good picture. If you try a standard definition cable channel or DVD, it is not worth watching, but this is expected for a TV of this size and price.Now why the low rating...I had a professional ISF certified company come out to calibrate my Sharp Aquos 70LE-600U. They were unable to perform the calibration since there is such a limited menu, only consisting of brightness, contrast, sharpness, and color. This is very basic, settings you will find on an early 90's TV. The company has contacted Sharp multiple times asking for a firmware update to resolve this, Sharp does not respond.\"Well it's a budget TV that's why there's only basic settings\" - Ok, I understand. I can deal with that. However if you are planning to hook up a Soundbar or surround sound to this TV, you better only have 1 device to input. It's 2013, most of us have a PS3, Xbox, Blue-Ray, Apple TV, Cable box, ect. to hook up via HDMI. The optical output on this TV only supports ONE HDMI input. So, you can have sound from you PS3, but not anything else. I contacted Sharp and they told me to use Analog RCA cables. If you search around you will see MANY people have this issue and have reported it. Sharp has done nothing about it.So, this TV has a pretty good picture after the settings are configured, especially for the price. The lack of settings in the menu and the disability of not being able to connect external sound equipment is why I would rate this 3 Stars. But then there's the issue of Sharp not caring about the customers and not doing anything about the issues. That's why this TV gets 2 stars.", "Date": "February 28, 2013"}, {"Title": "Don't pass it up!!", "Author": "HQINUSA", "ReviewID": "R3U0624LN7K5WF", "Overall": "5.0", "Content": "Great TV with only drawback being not being a smart TV.  However, there are much better smart options when purchased separately from the TV.  Highly recommend saving your money with this TV and buying a smart device.  Great picture, great sound and size!!", "Date": "December 9, 2013"}, {"Title": "70\" Of Viewing Glory!!!", "Author": "Mr. P.", "ReviewID": "RHQANQH7JMZ7P", "Overall": "5.0", "Content": "Absolutely great product for the price! Already had a Sony smart BluRay so just wanted a basic 70\" lcd/led panel. This serves the purpose perfectly! Just finished watching an entire weekend of football and couldn't be happier! FYI, I paired this with the Sharp HT-SB60 sound bar and am absolutely loving it! Thank you Amazon for the unbeatable pricing!!!", "Date": "November 4, 2013"}], "ProductInfo": {"Price": "$2,699.99", "Features": "Backlight Technology-Edge LED;Video-Digital Tuner-ATSC;Video-Enhanced Refresh Rate-120 Hz;Audio-Speakers-Yes;Interfaces/Ports-Number of HDMI Ports-3;Interfaces/Ports-Digital Audio Output-Yes;Power Description-Operating Power Consumption-178 W;\nHorizontal Viewing Angle-176 Degree;Video-Analog Tuner-NTSC;Video-Maximum Resolution-1920 x 1080;Audio-RMS Output Power-20 W;\nVertical Viewing Angle-176 Degree;Video-Video Signal Standard-HDTV 1080p;Video-Dynamic Contrast Ratio-4,000,000:1;Network & Communication-Ethernet-No;I\nlc70le600u", "Name": "Sharp LC70LE600U 70-Inch 120Hz LED-LCD TV", "ImgURL": "http://ecx.images-amazon.com/images/I/41XYGH1YgaL._SY300_.jpg", "ProductID": "B00A6HXL6W"}}