{"Reviews": [{"Title": "55LM4600 Amazing Value! Likely not true 120hz though.", "Author": "Snaby", "ReviewID": "R22GDBMBDKEYEP", "Overall": "5.0", "Content": "I love many things about this TV but one of my favorite features is the built-in picture calibration tool. With proper calibration this TV looks just as good if not better than my Samsung LCD.  With 3D Bluray content this TV is fantastic.  The 2d to 3d conversion is neat but nowhere close to the quality of true 3d content.  Also, it's nice that \"movie theater\" glasses work with this set.  I notice very little motion blur but LGs claim of 120 hz is likely bogus.  Apparently this model and several others LG put out are actually 60hz panels that they cycle the LEDs on and off to claim \"Trumotion 120 hz\".  I spoke with LG directly and they claim 120hz is \"always on\" for this TV, but there are no menu settings or controls for the Trumotion.  You will NOT get the soap opera effect from this TV, but to me that is a good thing, though I realize some people will be disappointed with this. The  HDGURU website has a great article on LGs claim of 120 hz on its review of a similar TV the 55lm6700 called \"When 120 Hz isn't 120Hz\".  Anyway, this was not a deal breaker for me as this TV has such a great picture and the 3d is amazing. (By the way passive 3d sets like this model don't have to have 120 hz as they are using polarization to display two separate images as opposed to cycling images for active shutter glasses). The sound on my set is fine but I ended up getting the TVee 25 soundbar from Boston Acoustics because I wanted the extra punch that a subwoofer adds.  On another note I bought this TV from Walmart for 849 before Christmas and it subsequently went down to 799 an unbelievable value for this set, strangely cheaper than the non-3D \"LS\" version of this set.  It is a myth that these retailers get inferior sets.  As long as the model numbers are the same go for the lowest price you can find with a retailer you feel comfortable dealing with.  I usually buy most of my gear through Amazon but unfortunately they didn't have this set available when I was in the market for a new TV.  If you already have all the \"smart\" gear and just want a fantastic LED TV with the ability to watch 3D content you can't go wrong with this set.", "Date": "January 17, 2013"}, {"Title": "Tried 4 Different TVs & This one is the Keeper!", "Author": "Daniel B.", "ReviewID": "R3M5XPQ2PPMEV0", "Overall": "5.0", "Content": "Went through 4 TVs before I landed on this 55\" LG LED 55LM4600. Initially bought a very inexpensive Element brand 46\" LCD 60Hz. Picture was just OK and the menus and input/output ports were sorely lacking. Also, I could never make it work with my Harmony Remote properly. Not a keeper. Next was an LG 50\" 1080p Plasma. Great picture but the screen was simply way too glossy. I could not stand seeing the lights reflecting in the screen during the entire movie! Back it went. Next TV was an Insignia from Best Buy. 55\" LED 120Hz. Tons of inputs and outputs. Very nice picture but had major \"soap opera effect\". Every scene looked \"fake\". Not sure how else to describe it but even my wife noticed it. I tried really hard to ignore it but it really did drive me crazy. Changing the motion settings in the menu did not seem to make any difference. Best Buy took it back. (super-great company by the way - very nice and easy to work with!) Next bought a Panasonic 55\" Plasma (ST30) but the Sears store where I went to buy it had been playing the CARS movie non-stop on all their display TVs for 3 months. I was buying the display model (on super sale) and the DVD Title Menu was completely burned into the screen so I passed on that one too. However, sitting right next to it was the LG 55LM4600 55\" LED (also on sale). The picture looked fantastic and I brought that one home instead. I could not be happier. Excellent picture, brighter than any plasma I looked at. No \"soap opera effect\", no ghosting. Very clear and crisp. I'm not a huge sports fan so I cannot testify to refresh but I have not noticed any blurring on any shows. Even the \"ticker\" at the bottom of the screen on news stations look fine to me. Screen is not as matte as the Insignia but still very little in the way of reflection. Works perfect with my Harmony 600 remote and Sony 590 Blu-Ray player. Menus are easy to use (remote is very nice). Comes with 4 pair of 3D glasses too. Finally found the keeper!", "Date": "February 27, 2013"}, {"Title": "AWESOME!", "Author": "eRRaTiC", "ReviewID": "R19FFLOBC1DCCC", "Overall": "5.0", "Content": "I will say, before purchasing the TV, I read countless reviews of other TVs out there. I had a 42\" I was looking to replace, but I don't want to be dropping money on a new TV every few years. I wanted to make sure I picked something that would last. So here I am.I purchased this for a few reasons. The price, 3D (honestly didnt care much about this) and the reviews. LG has a good overall review for most of their TV products and coming from the \"low\" end of pricing, it seemed like a good choice. Also, based on value per inch of screen, I chose this one.After receiving it a few days ago, I must say this TV is AWESOME! It looks great. Converts 2D-3D if you want (looks alright). Colors are great and has options to modify if needed.Now with that said, I will give you some pros/cons I have seen so far:Pros:Price4 Sets of 3D Glasses3D that looks AWESOMESize of the screenThinnessUSB port you can plug things in like flash drive to see pix etc.Divx SupportSupports WiFi/LANEasy to use remoteSmall bezelEasy to learn and use (settings, etc)Wall mountableCons:This sells as a 120hz TruMotion, but in reality, it is a 60hz TV with some \"tweaks\".Only 3 HDMI (I need more)The manual states it needs 4 inches of \"breathing room\" so that killed the flat against the wall mount idea.There seems to be some ghosting on some 3D, but maybe it's a settings thing I haven't figured out yet.No customization naming for the ports such as HDMI, etc. It does have some preset ones you can choose from.Some have complained of audio. I feel it compares to many others out there and it shouldn't be that big of a deal. I think it sounds great/loud. When I want to listen/watch a movie, I use a receiver/speakers, as you should as well.I had an issue with shipping as well. Heads up, of course depending on the seller, you may need to schedule a delivery date and time. I was sent a general email that the TV was shipped and given a tracking number but it didn't correspond with regular shippers. I had to contact the seller to get the shipper and then found out that they tried an old number to contact me and since they couldn't contact me, they had send me a postcard for a time. I was able to contact the shipper and get it fixed, but there wasn't any info that stated all that was going to happen.Overall, this TV is a great buy and product and you will not be unhappy with.", "Date": "February 9, 2013"}, {"Title": "Audio is horrible. Picture is great.", "Author": "Tp", "ReviewID": "R82I5WXV84M2H", "Overall": "3.0", "Content": "Do not buy this TV unless you are planning on purchasing a soundbar or surround sound system.The speakers on this TV are the worst I have ever heard. When bass hits it just distorts.The picture is great, and the 3d feature is nice if you want to watch 3d video. However I am not a fan of 3d, but this TV was the best 55\" in its class for the money without the 3D feature, so buying it was an easy choice.", "Date": "October 14, 2013"}, {"Title": "Excellent!!!", "Author": "Toni Mabe", "ReviewID": "RT8DV87GU1QJH", "Overall": "5.0", "Content": "So, I was looking for a new TV and found this one on sale at newegg.com for 599.99.  Thinking that a 55 inch, 1080, 3d tv for that cheap most have some serious issues, I did a little research.  Finding nothing wrong, I purchased the TV and are very happy I did.Pros:Packaging- The television came packaged up amazingly.  It was wrapped up in very firm Styrofoam that was very well done.Setup- The setup was very simple.  It did require two of us, my wife and I, but that is simply due to size, not weight.  My arms were not wide enough to fit around the entirety of the screen.  But it was incredibly easy to setup.Picture- The picture is really quite good.  At first my wife was complaining but that's because she didnt connect our satellite box up with an HDMI cord.  Once we fixed the issue, it was amazing.  Crisp picture and beautiful edges which was very nice.  The picture was a little dark for me, but that was easily fixed in the televisions menu.3D- The 3D looks great. You will need to purchase a 3D blu-ray player and 3D movies.  When you do, the picture is great.  It isnt dark like most other 3D televisions.  It is an easy switch and the picture looks really great.3D Glasses- The TV comes with 4 pairs which is nice.  Also, the TV works with the glasses that you get from the movie theater.  So, you can always have a ton of pairs.Cons: (Which there are few)2D-3D- It isnt true 3D.  This isnt a major issue as I dont really care about making non 3D things 3D.  There is a layering effect, but it isnt the true 3D, so dont expect much.Mounting- As others have said, you have to have 4 inches of space for cooling purposes.  So, buying a mounting kit isnt the best thing.  That is not an issue for me as I have a stand that like.  If you are interested in mounting this TV, you will need four inches of clearance.Sound- The sound is not horrible for a flat screen TV, in fact I would say that it is actually better then most.  However, you might need to bump up the sound on some channels because it can in fact seem really low.  However, you can purchase a 3D blu-ray player with sound system for around $200.00. Then, just connect the speaker to the TV and you have fantastic sound.Overall, I am incredibly pleased with this TV.  It was a nice purchase, and look around online, you may be able to find it for cheaper.  Highly recommend.Update:::I have had this TV for about a month so far and it has honed itself and it is working incredibly.  My wife and I love it.  The only issue that I seem to have is that it seems to reset itself every time we turn it off.  We, perhaps, are doing something wrong, but it resets.  Other then that, we love it.", "Date": "September 7, 2013"}, {"Title": "Great picture", "Author": "Steelesplace", "ReviewID": "R19OKTGPJRHZUG", "Overall": "5.0", "Content": "Bought tv mainly for 3d.Picture is best passive video I've seen on any tv.Also supports DLNA, Allshare and pnp.", "Date": "February 27, 2013"}, {"Title": "Listen to the reviews.", "Author": "Zas", "ReviewID": "RADIO5VKEBR1H", "Overall": "5.0", "Content": "As other reviewers have said, you can't turn tru-motion on and off (from what I hear LG never plans to enable this but they need to), and a lot of the times whatever audio / video mode you turned the TV off on, if you turn it back on switch inputs around it'll sometimes go back to the defaults or whatever it wants to show. The 2D to 3D works pretty okay, but the split-screen to one screen 3D converter gaming definitely takes some getting used to. I haven't tried it out yet, because the TV is currently above a fireplace, but you can adjust the angle of the 3D. So theoretically if I can mount the TV eye level, I can adjust the 3D to only affect top / bottom and or left / right and improve upon the split screen overlay. Has anyone tried this?This is a really thin 3d tv. Really takes some tweaking to get things looking great, and even when you have settings up as high as possible without looking washed out, I still don't necessarily feel 'wow'ed. I believe this might be due to viewing angle, and again will be solved by making the TV eye level. My 50\" Panasonic plasma looked great up there on the mantle but that's comparing apples to oranges.Most programs were good, but the first one program I watched with the adjust and fit aspect ratio mode that had that solid yellow line down the left side made me forever switch to another viewing mode. Couldn't stand it. Wife didn't see it until I walked up to it and pointed it out to her.Still it's my first 3D TV and I love it. Cheap w/ 2D to 3D mode? Yes! Be warned though, some people can't stand 3D and will not share your enthusiasm. It can make you feel queezy and cause eye strain.", "Date": "November 19, 2013"}, {"Title": "Sound is horrible", "Author": "Brian Cotton", "ReviewID": "R2CJJDMSRBP8M2", "Overall": "2.0", "Content": "The picture is exactly what you expect from LG great. I love the look and the 3d with blu ray is awesome but the sound is horrible. Constantly sounds like the speakers are blown I've tried several custom settings as well as the presets that are available with no change.Shipping was ok the box was a little beat up but the tv was fine", "Date": "October 14, 2013"}, {"Title": "so great", "Author": "munsoor", "ReviewID": "R53EGJ1RGAW4B", "Overall": "5.0", "Content": "it's the most great screen I've ever had.. it's so amazing i really love ityou should get one ..", "Date": "August 26, 2013"}, {"Title": "Good quality for the price", "Author": "Carlos Gonzalez", "ReviewID": "RBEU88VB3VY1D", "Overall": "4.0", "Content": "I bought this tv at a great price. Had initially some issues because image was getting too dim for my taste in low light condition. However, I found an option that let me adjust the settings to my liking and eliminated the issue. I hooked up this tv to an lg 3d blu-ray player and works great! The image quality is awesome. The 3d option to watch all your programming is good but 3d quality is not as good as images with original 3D sources. I have DirecTV and as of the date of this review I have not been able to resolve the side to side image problem of the 3D channels to be able to watch those channels on 3d in the TV", "Date": "April 6, 2013"}, {"Title": "You'll love it", "Author": "D. Johnson", "ReviewID": "R209H9H2NNQ4EW", "Overall": "5.0", "Content": "I purchased this TV just before Christmas at my local SAMs club on a one time buy special. Picture is great and so is the 3D. And considering it is half the price of a Samsung make the deal even better. Now for some advice... If you have researched 3D TVs you know this uses passive glasses. Samsung uses active glasses that use a battery. I bought an active glasses 3D TV a year and a half ago for more than twice this price because active 3D gives you full 1080 3D where the passive, using polarized glasses, only gives you \"half def\" or 540 for each eye. After having the Samsung for only a short time I realized I blew a lot of money I didn't have to spend and I hate the active glasses. You have to turn them on each time and the batteries run dead. The passive glasses you just pop on; and they are lighter... A no brainier in my opinion. Whether you are looking at this or any other 3D TV take my advice and buy LG or Vizio with passive glasses. You'll be glad you did. And if you really want to spend the money that the Samsung or Sony will cost just buy TWO of these!", "Date": "March 31, 2013"}, {"Title": "Best Television ever purchased by me.", "Author": "drsudsmp", "ReviewID": "R3528CTW89GVZD", "Overall": "5.0", "Content": "I must admit that purchasing this TV was indeed a hard task,with so many different brands offering 3D.I had to spend countless hours online comparing other brands.In the end I'm happy thatmy choice was the LG 55 LM4600. Picture quality is just amazing,especially in 3D mode.I was able to collect a few passive 3D glasses from my friends to add to my collection thats awesome,no charging required.I am considering above 60'' 3D already.................", "Date": "August 17, 2013"}, {"Title": "Beautiful picture, good sound BUT with speaker problems, too", "Author": "Allen Jackson", "ReviewID": "RAS1PS8VF3NIB", "Overall": "4.0", "Content": "The title of my review says it all, I think, in terms of my overall impression in a nutshell. (I've owned this TV for three weeks.)I tried several TV brands/models, and this one was the best.  Extra-sharp, beautiful, realistic HD picture quality.  Real and pretty colors.  There is no \"smooth\" mode (so-called on Toshiba models) which most people call the \"soap opera effect.\"  I LIKE that mode, as it's amazing for things like the wildlife shows on Animal Planet, and for making blu rays of older movies jump off the screen with sharpness and lifelike vividness.  But not having this feature is not a major thing, either, as it's a minor inconvenience to switch to it and then to switch back later.This 55\" TV was next to a 55\" $1360.00 Samsung (reputedly the best HD TV brand) at Costco, clearly both were set to the same settings, and the pictures were IDENTICAL (and I'm extremely detail-oriented).  It was nearly impossible to see a difference as to sharpness, color, brightness, you name it. And I looked for a long time.  Where there were any tiny differences at all: advantage LG.The sound is easily loud enough without a sound bar, and it has good stereo and surround-sound effects--but not as good as my 1998 JVC tube TV (this is a problem on all flat-screen TVs due to the inherent limitations on speaker size).However, I DID experience the speaker problems cited by other reviewers: vibrating sounds that occur only on SOME TV programs, even at very low volumes (like at setting 12 out of 100 max).  I do believe the vibrating/almost buzzing problem only occurs for certain TYPES of sounds--this person's voice, that particular musical instrument playing only CERTAIN notes--because this ANNOYING speaker vibration doesn't occur the majority of the time, EVEN when at much louder volumes. This will bother me a little forever, every time it occurs, I'm sure, as it simply shouldn't exist.I think this is something that LG should have gotten right, since no other TV brand seems to do this. I called LG about it, and they suggested a very bad thing--to turn down the CABLE BOX's own volume by 25%. . . which of course would eliminate the stereo sound (on my box, anyway) and permanently lower the volume of any DVD recordings you might make.  I didn't try this, because it's not even possible to do for the home user--I subsequently called my cable company so as to try doing it, and they took me to the right menu, but, as they acknowledged, it simply cannot be done on my Comcast box.Overall, however, I love this TV for its immaculate, best-in-class picture, fine remote control, great looks, swiveling stand, and great value ($699.00 at Costco before they sold out).", "Date": "March 27, 2013"}, {"Title": "Worth Your Pennies!!! (Worth A Read)", "Author": "Tony-The-Tech", "ReviewID": "R1EP6RJKPXRZTK", "Overall": "4.0", "Content": "I purchased this television through RAC.It does everything it says, though it would seem that it refersto some product that is not included as far as setup for LAN(Local Area Networkuse. Not needed.I have owned a number of HD televisions in 50\"+ class.I have owned LG's, Insignia's, Sharp, and a few other brands.I have owned Plasma's, LCD's, and LED's.Take into account:The difference is not in quality of product, it is in quality of picture (style preference)Deeper darker colors, lighter brighter colors and so on.One is better for Animated viewing while the other is ideal for non-animated movies.Also there are the \"Hz\" that allow for clearer picture during fast motion scenes.Also 1080p is greatly different then 1080i as well as 720p/720i.I have owned HD televisions that maxed out at each of these and have played movies and videogames on each and have noticed significant differences.Sum it up:Facts:The clarity is fantastic, and the details is outstanding, wonderful price for a 3D television at this size.The auto tuning works fantastic, no more trying to adjust during games or movies.the internet feature is for updating firmware (okay, could use work) as well as for streaming movies on LAN.You are able to watch movies that are on your computer as it will find them, use your computers shared folderallow access of your television.Remote is super user friendly.I don't need a smart television, as we own a ps3, laptop, and smartphones and we stream to our televisionusing these devices. (SMART television is simply a television with apps).  It would be redundant to us.Pros:55:/HD/3D/120HZ/LED/4MILLION:1 CONTRAST/INPUT FEATURES/LAN.Con:For me I paid a little more to get this television in payments.I cannot see anyone having a legitimate complaint about this television.Unless they do not understand how to purchase a television.(I the family consultant for televisions/computers/phones/etc.)I do understand how times have changed and it is not as simple as randomly choosing one over another.I remember when the only challenge was how big is big enough.Stay away from Wal-Mart's/K-Mart's and such when making your purchases.  Otherwise you will find thatthat television isn't as clear or quality is degraded in one way or another even though it appears tobe the same as a friends television that was purchased online or at a higher-end electronic store.", "Date": "December 28, 2012"}, {"Title": "Great tv, but watch for something.....", "Author": "J Booth \"customer\"", "ReviewID": "R3B7L8WJEIEB6F", "Overall": "5.0", "Content": "This tv is a great product! The picture quality is wonderful. The tv has a swivel built into the base( not all tvs have that). The 3d is also outstanding! The look of this tv is very modern and will fit with almost any decor. One thing to watch out for though, is the 3d ghosting. I previously had one of these, but had to take it back do to the ghosting during 3d. That set, I had purchased at Walmart. I then went to Sam's club and got another one. The one from Sam's club, didn't have ANY ghosting at all. Maybe they carry higher quality versions of this at Sam's club?? Another reason why I returned the previous one, was that after a firmware update, the tv would not let me control picture settings that I could previously control. Now that I have the better one(from Sam's club) I am not going to do another firmware update out of fear of this happening again. I am very happy with this television though, and get compliments on it when people are watching a 3d movie, or bluray. I recommend this tv, but watch out for the firmware updates, and if you notice ghosting during your 3d viewing, don't settle and exchange it for another.", "Date": "January 24, 2013"}, {"Title": "Great TV at an excellent price!", "Author": "Shane D.", "ReviewID": "R1U2R004ON8DAD", "Overall": "5.0", "Content": "I have to say, this is a fantastic looking television! I haven't gotten a new TV in 6 years and it's pretty amazing how they can make such a huge TV so thin now. At 1.4\" thick with a thin, shiny black bezel, it looks really great either turned on or off.This was very easy to assemble out of the box.  The supplied stand was simple to connect to the TV...5 minutes and I had it connected and propped up on my entertainment center.  I didn't realize you could swivel the stand...nice touch.Initial set up was quick and simple as well.  The menus are easy to follow and straight forward.  The supplied remote control is well laid out and easy to use.  I turned on the TV, went through the initial set up process, and I was up and running in about 5-10 minutes.The number of video outputs worked out perfectly for me (3 HDMI for XBox, PS3, and Apple TV, 1 component for my cable box, and 1 USB for whatever). And I can finally replace the old red and white RCA cable going from the TV to the surround sound receiver with a digital optical audio cable.As far as the picture goes...I'm not a videophile by any means, but I think the picture on this TV looks great. It definitely took some tweaking right out of the box, but the built in calibration tool is useful, and I was also able to find some people online that shared their calibration settings. After a while I was able to find the sweet spot for my viewing preferences.The 3d function is useable, though I didn't buy the TV for this purpose.  I played around with the 2d to 3d conversion and it is pretty neat and surprisingly effective.  I haven't gotten the chance to do any 3d gaming or watch any 3d movies, but I expect those experiences will be even better.The menus are well laid out, simple to follow, and have a generally \"premium\" look to them.  The supplied remote control looks nice, feels solid, has large (but not too large) buttons, and is very easy to use.All in all I am very happy with this TV.  I specifically wanted to get a \"non smart TV\" for the fact that I already have all of the apps and functionality I need with my XBox, PS3, and Apple TV.  I was really happy to find such a high quality TV without all the frills.  I was more than happy to pay a couple hundred dollars less for a quality TV set without the \"smart\" capability.  The fact that it has 3d capability was a really nice extra that seemed almost \"free\" considering the price tag.I decided to choose this TV over a smiliarly priced 55\" Samsung TV because this set was about $90 cheaper, it has 3 HDMI outputs as opposed to 2 on the Samsung, and it has the 3d function (icing on the cake).  So far I am very happy with my decision.I was able to purchse this set for $799 + $29 shipping and at that price I feel it was an absolute bargain.EDIT:  There have been a lot of negative things said about the sound quality on this TV and the internal speakers making rattling noises and things like that.  I have not experienced any issues with the sound on my TV whatsoever.  Granted, they are internal TV speakers so you can't really expect mind blowing sound out of them, but I have found the sound to be quite adequate at normal viewing levels.  I have actually noticed a few different sound effects and things like that on programs that I would watch on my previous TV that I had never heard before.  I haven't cranked up the volume too much yet, but I haven't experienced any noise/rattling, nothing like that at all.", "Date": "February 6, 2013"}, {"Title": "LG makes great tv's!", "Author": "S. Ramage \"3D MOVIE FAN\"", "ReviewID": "R292Q4WLA552TG", "Overall": "5.0", "Content": "We had bought a 47 inch LG 3d tv and loved it, passive is the way to go! So we upgraded to this 55in model and what a difference! It has a  great picture and the 3D is great. Watched all our 3D blu rays over again and if was like being at the show!", "Date": "March 24, 2013"}, {"Title": "Awesome!", "Author": "D. Gilliam", "ReviewID": "R2MY7TD8P52AM", "Overall": "5.0", "Content": "Very happy with this TV, easy setup, clear crisp picture, 3D up-conversion is nice, watching3D movies is like being in the theater, glasses are lightweight, all in all we are very satisfied with this purchase, I'd recommend it to anyone!And (IMHO) if you have Roku, Apple TV, or a BluRay player, you really don't need a smart TV, those give you pretty much the same thing, save yourself $500-600!", "Date": "March 14, 2013"}, {"Title": "Great TV", "Author": "JDizzles88", "ReviewID": "R312L3Y0JUYAIF", "Overall": "4.0", "Content": "So I didn't buy this through Amazon; got through Newegg but thought I'd write a review here anyways.Bought this via Newegg.com for $770. Company called Ceva delivered for me and helped carry it up with no hassles (more on this later).Setup: the base was quit seamless to setup and seems sturdy. Manual says to keep this 4 inches away from the wall so not sure how great wall mounting will be if you choose to.Be warned that it wouldn't recognize a good portion of my inputs until I used brand new HDMI cords (used the Amazon Basics cords, other ones were a few years old at that point).Actual setup was very easy. I'm using a HD Cable box via Comcast and couldn't get it to scan my channels into it, not sure if that's a flaw or user error on my end.Inputs: TV has majority of the inputs on the back - one HDMI and the PC are on the side. Has a optical output, etc too for sound systems.Features:2D-3D: So it's not real 3D, let's get that out of the way. Whereas 3D pops out, this makes it sort of layered. It's interesting. So far tested on Despicable Me and the Matrix.DLNA. So if you install Nero MediaHome Essentials, you can stream from your PC to your TV pretty flawlessly (both have to be on the same network). Worked with most of my files, though some had audio issues.Volume: volume levels aren't bad. I can usually play my Xbox on like 10-20 without issue. Volume for TV is fine around 20-30 or so. Some movies you have to go higher.No bass but there's no sub. If you want pristine sound, get a sound system. Otherwise not horrid for a flatscreen TV.Picture Quality: Haven't seen any ghosting or anything like that. Seems crisp to me in HD and all that. TV itself doesn't have that many options to tweak but so far I haven't noticed anything.Overall - a solid TV for the price I paid. I am definitely happy with the quality of the product overall. I'll be adding more in a few months after more usage out of it.", "Date": "July 21, 2013"}, {"Title": "so far so good", "Author": "Kenneth Tucker", "ReviewID": "R1W79YTV7KNB9G", "Overall": "5.0", "Content": "TV has been AWESOME to say the least. Love it. Gives me everything I want.  Right brightness and clarity as well as being such a space saver for such a big screen. One of the better decisions I've made in a purchase.", "Date": "April 1, 2013"}, {"Title": "bad luck I guess on my tv", "Author": "Loc L. Nguyen", "ReviewID": "R1WASE52H07F9K", "Overall": "1.0", "Content": "Initially, I loved the TV. Although, I've had this for about for about 5 months and it has developed black spots that keep growing. I've tried using ice packs to fix the dead pixel problem, but hasn't worked.Update: Dead tv after 7 months. LG blamed the shipping process and won't cover it under warranty.", "Date": "November 16, 2013"}, {"Title": "Great deal", "Author": "Jeffrey Geenius", "ReviewID": "R3TOAZ6IE3IRGO", "Overall": "5.0", "Content": "The TV looks and sounds great and the 3d component is pretty good as well, and all for a great price.", "Date": "September 23, 2013"}, {"Title": "I think there might be a burn in time...not sure", "Author": "David Washington \"little dave\"", "ReviewID": "R1P9AA7K73ME5P", "Overall": "5.0", "Content": "When I first recieved the tv I wasn't impressed by the cable picture, yet the 3d is simply beautiful.  Might I say prefect! Nemo is breath taking at times. The 2d to 3d is good as well.  But cable HD just isn't or hasn't been as good.  My 47lg was like that but now about a year later the picture is good. I'm not a tech guy so I can't explain this.  The price can't be bet unless you go to SAMs or Costco.  Qvc and HSN are selling this for roughly 1200 shipped.", "Date": "May 5, 2013"}, {"Title": "Great Deal", "Author": "JohnR", "ReviewID": "RW2TJ1CJAY8UN", "Overall": "5.0", "Content": "I really enjoy this purchase. I paid $880 for a $1,600 HDtv great product, everything works well and looks amazing. It's a Win!!", "Date": "April 8, 2013"}, {"Title": "Amazing 2d to 3d conversion", "Author": "ChicagoReviewer", "ReviewID": "R352T8BC43ALFR", "Overall": "5.0", "Content": "I received this TV as a gift but was skeptical at first with the 2d to 3d conversion. I was blown away with it, and the 3d is especially good when watching news and commercials. It's not as dramatic in comparison to watching an actual 3d movie, but it's good enough. It adds a lil bit of fun to watching my fave tv shows. The screen is a bit big so you can't be too close when turning on the 3d feature (they recommend sitting 2 meters away).The tv itself is sharp and bright. Picture quality is superb. I haven't updated the firmware yet so I hope I don't run into the same issues as the other reviewer when updating the firm ware. I also compared this TV to a similar model in Sams Club by  Vizio and Samsung. Ofcourse, the Samsung beats both competitors but only seems to be marginally better than this LG model. The LG model was by far sharper-looking, had better screen quality and brighter than the Vizio. The LG was actually the cheapest of the three at only 898 at Sams!", "Date": "January 28, 2013"}, {"Title": "LG Great picture!", "Author": "John R Hunter", "ReviewID": "RUZRHER7N4DXT", "Overall": "5.0", "Content": "We put these HDTV in the hotel i work for The Westin DFW Airport and i just had to have one with this great picture!", "Date": "May 9, 2013"}, {"Title": "its great", "Author": "elgo", "ReviewID": "R22DWNOBTR6FK6", "Overall": "4.0", "Content": "the tv is beautifull, great image but the TruMotion function can not be changed, there no exist option in the menu the tv, according the lg page [...] , \"The TruMotion feature is activated at the factory, and is set to its LOW setting by default. No options are made available to adjust this feature at this time. We currently have no indication when or if such an update will be released. \"I dont know if trumotion is set on by default but the image is great, 3d is very amazing and the price es very good.", "Date": "May 8, 2013"}, {"Title": "My new love", "Author": "tngaynor", "ReviewID": "RIAWNLWJ2H64S", "Overall": "5.0", "Content": "I only just received it a few days ago, so I will review again if anything changes. That being said, I love this TV, it is bigger than I thought, I don't know how I had a 32\" in my living room before, 55\" is a much better size for my this space. The picture quality in great, crystal clear. I only tried the 2d-3d conversion a few times, but it does add something extra to regular TV and games. I prefer to put in a high quality 3d blu-ray movie and enjoy it at it's glory. I'm very happy with my choice, this TV is just what I wanted and a beautiful addition to our new home. Oh and mine came with 4 pairs of glasses, wish I knew that because I also ordered some from amazon before receiving the TV.", "Date": "February 8, 2013"}, {"Title": "So guess what guys..", "Author": "Xane", "ReviewID": "RQWYOO4XIGRNA", "Overall": "5.0", "Content": "First off, I'd like to say hurrybargains took care of me when I accidently ordered the LCD instead of the LED 55\", the prices were both $740.  It was 2am when I ordered, clicked the wrong one.As far as this tv goes.. It's awesome.  Great value.  You can't find deals like this.. Even at Walmart.  Not with all these features.  Shipping took alittle bit due to the shipping company they used. (1.5 weeks)My fiancé and I are very satisfied with this TV.  Looks great on the wall.  If you wall mount it.. Be sure to buy the swivel wall mount, spend the extra money for it, you just paid $740 for a $1200 tv, you can spare the extra $30 for the swivel mount.  Thank me later when you have no problems accessing the back of the TV.", "Date": "October 13, 2013"}, {"Title": "Great 3D/Crappy HD", "Author": "fatso lardo", "ReviewID": "R1RJJ6CB53OURL", "Overall": "2.0", "Content": "I bought this TV because I really wanted to experience 3D at home.Well if thats all you want it for you're in luck.The 3D does look really good.But when not watching 3D it looks like crap.The HD picture is the worst I've ever seen.Images far away are unnoticeable.In sports everything is a blur when they move fast.Returned it.", "Date": "March 8, 2013"}], "ProductInfo": {"Price": "$924.95", "Features": "Full HD 1080p Resolution\nLG Cinema 3D\nTruMotion 120Hz Refresh Rate\nEdge LED\n4 pairs of Cinema 3D glasses included", "Name": "LG 55LM4600 55\" Class 1080p 120Hz LED 3D HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/312Zp6oDeJL._SY300_.jpg", "ProductID": "B00AJU7IBK"}}