{"Reviews": [{"Title": "Excellent picture and good sound.", "Author": "photonashville \"John\"", "ReviewID": "R20EBTMBOHR4DE", "Overall": "5.0", "Content": "I purchased this tv straight from Sony's website which just cost the extra amount of TN sales tax. They shipped it quickly with free shipping and received within 2 days.The tv is very lightweight for 32\" tv; remarkable how far the tech has come. Setup was very simple. Menu system is extensive for picture controls, PIP, connecting a computer and so on.Currently I use this connected to a Roku 2 for watching HD content from Amazon Prime. I use the custom picture mode. Picture quality is on par with my Panasonic 42\" plasma THX setting. Motion in movies is excellent even as a 60Hz HDTV.Sound is good by itself, but I use it connected to a Bose system via the audio out mini jack which is great for internet music.The bezel is thin and blends away while watching movies which is even nicer. Something I didn't expect or even notice from my other tvs until now.Nicely sized screen for viewing movies from 10 ft away or less.Very happy and would certainly recommend the tv and would buy again. Now considering my next tv to be a larger Sony LED. I've been extremely happy with Panasonic but Sony makes superb tvs with equal picture quality and equal or lower price.", "Date": "May 24, 2013"}, {"Title": "Excellent, sharp, vibrant picture. Minimal Physical presence.", "Author": "amazonreviewer", "ReviewID": "R3916BZ3SNS5IZ", "Overall": "5.0", "Content": "Love this tv. It's everything I remember about having a Sony. The picture is very natural and less \"digitally\" than other tvs I've seen. Setup, menus, remote, inputs, all well designed and thought out. I love the ability to watch content streamed from a USB drive. The feature worked nicely, though I did forget that my usb drive was Mac formatted and it took me a while to figure out why it wasn't working. The set is very minimal and elegant and compliments the room (as much a a tv can I suppose). Viewing angles are excellent side to side and top to bottom. I was worried initially since the angle of the set doesn't adjust vertically but this has been a non issue due to great viewing angles. I was also pleasantly surprised by the great sound of the built in speakers. I normally run everything through my stereo but hardly do so now except for serious movie screening. The speakers do great for most all content and I rarely have the urge to turn on the stereo to watch tv. The size is perfect for us. We wanted a nice big screen to enjoy but not a monster that takes over the whole room and this was a great compromise.Really, the only thing I can think of that I would change is how you adjust the white balance or \"temperature\" of the picture. You have cool, neutral and warm to choose from and to my eyes (and I am an artist and professional photographer with pretty keen sensitivity) the normal setting is too cool, almost as cool as the cool setting. This forced me to choose the warm setting which I found to be a bit too warm but much more to my liking. I have since visually acclimated to the setting and never give it a thought but it did bug me that they couldn't get the normal setting right or else give the consumer some control over this beyond three settings. White balance is a personal choice to a degree and you may prefer the normal or even cool setting so don't let it deter you from buying this stellar TV set. Highly recommended.", "Date": "June 19, 2013"}, {"Title": "Another Sony Outstanding TV", "Author": "Charlie Brown", "ReviewID": "R5GDLS5MIO0U7", "Overall": "5.0", "Content": "I bought this TV to replace a 24 inches, 8 years old Sony LCD 4:3 aspect ratio TV which ran it course (still perfectly fine, just obsolete). I have always being amazed by the picture quality of that non-HDTV, picture was crisp and perfect, colors real and the experience of watching that TV was always a pleasure. So naturally I thought of another Sony to replace it.  Even if Sony always charges a premium, I believe it is justified: I've seen Sonys running side-by-side with Samsungs, Sharps, Vizio, Philips, etc and Sony always have a edge on picture quality, substantial over Samsung for example and just slight over Vizio, but an advantage nevertheless.For this Sony, the price premium was small so for me it was no brainer and I'm not disappointed: image quality is superb, even standard definition programs look razor-sharp and clear, no blur, no lack of black, etc, it is just amazing. And the auto-wide function makes watching SD programming a pleasure, as it will always adjust itself to give you the best watching experience. I have it connected to an Apple TV, as some suggested here it is better to pay about $300 for this TV and $99 for an Apple TV than $400 for a smart or connected TV, you get way more functionality and flexibility with a separate streaming device I think, being it an Apple TV, a Roku or whatever you prefer.And it is when delivering HD content that this TV really excels: Netflix or HBOGo streaming looks amazing, this TV leaves nothing behind, quality is outstanding in every situation I've faced: TV shows, cartoons, movies, news, etc, etc, you name it. This is what Sony is about, straight picture excellence without too many bells and whistles, simplicity and focus on what's really important on a TV which is picture qualityHaving said this, apart from a solid, outstanding image delivery, the rest of this TV is pretty average and even below from what some of the competition offers: only two HDMI ports (at this price range, 3 or 4 ports is the norm), one USB port which I guess is enough, one component input and one antenna connection. That's it. Oh, and one optical audio out which is the bright spot of this simplicity as it sounds really good, even if not really needed as the quality of the built-in speakers is also very good. Taken aside the screen, the rest of the materials used are cheap, thermoformed plastic, it looks OK but not great, and when compared with my old Sony they look subpar. But it is not something that will stand out and being so slim it is not really an issue as it will blend with the rest of the ambient. And I guess all this plastic helps to keep the TV very, very lightLastly, is the issue I'm sure many of you have seriously considered or at least gave some thought about it: 720P vs. 1080p? I did think about  this issue, did some research and agree with most of the experts: at this size 1080p is not a must have unless you sit very close to the TV (I would say 4 feet or less) and even then it will be hard to appreciate a real difference in image superiority from a 1080p. Unless you're a professional or again, sit very, very close to the TV or have superior eyesight which is a possibility, some people do have it; the 720p offered by this TV is excellent. Besides, at this price point and screen size it will very hard t o find a 1080p 32 inches TV, unless it is a connected or smart TV, and those are $100-150 more", "Date": "October 3, 2013"}, {"Title": "High quality and good price", "Author": "Sam", "ReviewID": "R1XL2ON5OC01WJ", "Overall": "5.0", "Content": "Since It's a new product, I thought you might find this review a useful one.Despite the fact that sometimes Sony products are more expensive than other companies, such as: Samsung and Toshiba, I'm a big fan of Sony products because of the high quality in products and customer service. I've been using this TV for a month now and its amazing.The weird this is that its the same price as the older version of 32-inch Sony TV, so I preferred to take my chance since there were no reviews at all.So far I'm very satisfied with the TV.", "Date": "June 1, 2013"}, {"Title": "Solid Sony TV", "Author": "Taylor French", "ReviewID": "R3NH92KYSPUACO", "Overall": "5.0", "Content": "If you are looking for a nice, basic Sony TV, this is definitely your best bet. I bought both the 32\" and 40\" versions for my apartment because they were such a good deal! I've always been a big fan of Sony's minimalist design and high quality, and this TV series does not disappoint.While other brands' products scream \"I AM A FANCY TV - LOOK AT ME!\" Sony always does a good job of keeping things elegant and understated. In fact, the only thing on the bezel (other than SONY) is the energyStar certified logo. The controls are cleverly hidden in a recess on the back-right-hand side. This simplicity is also evident in the menu system, which is very easy to navigate, as well as the remote, which is laid out very intuitively with just the right amount of buttons.Picture quality is as good as I expected. I'm mostly streaming things off of my AppleTV, and I have no complaints of black levels or colors being off. I was very glad to see that this TV has a light sensor, which adjusts the TV brightness to the level of light in the room, as well as a digital optical audio out for my sound system. My only gripe is that there are only two HDMI inputs - one in the back and one on the side, but this seems to be par for the course in this price range.As a bonus, Sony Includes a USB port on the side, where you can plug in a thumb-drive or portable hard drive to play music, or view videos and pictures. In my testing, it worked pretty well. But I would highly recommend buying a $99 AppleTV if you don't want to spend a premium for a \"smart tv.\"", "Date": "July 22, 2013"}, {"Title": "Sharp resolution!", "Author": "R. Padilla", "ReviewID": "R5XK2ZMF0V0YG", "Overall": "5.0", "Content": "I bought this TV to use with an over the air antenna and was surprised with the sharp quality.  The features are pretty much standard and while it does not offer internet it is a great selection if you have other options for internet on your TV.  Overall this is a fantastic TV at a good price.", "Date": "July 14, 2013"}, {"Title": "Great TV for $", "Author": "Sandra", "ReviewID": "R3C2BO8VWWUHIB", "Overall": "5.0", "Content": "We bought a larger home and needed a new TV for our bedroom. We needed one with good enough built-in sound as we had a smaller Samsung with which we experience the very poor out-of-box sound quality many other reveiwers note as a negative.  The Sony comes with a MUCH improved out-of-box sound.  We do not external speakers hooked-up to this particular TV and they are not necessary.  The picture is also superb, which I expect from a Sony TV.", "Date": "September 7, 2013"}, {"Title": "Sony 32\" tv", "Author": "Mike McMahon", "ReviewID": "R17104EXWHXWO2", "Overall": "5.0", "Content": "Outstanding picture quality from all reasonable view angles. Very lightweight. Excellent value. We use this for over-the air signals on our boat and it works great.", "Date": "July 28, 2013"}, {"Title": "Good picture, good sound", "Author": "John H", "ReviewID": "R1GD9Q9JH9F83B", "Overall": "5.0", "Content": "Purchased the Sony KDL-32R400A as an extra TV for the Master Bedroom. Read the manual for setting it up - pretty straight forward. Tweaked the back lighting and tweaked the equalizer to reduce the \"background\" music so I could hear the dialogue better. (Reduced the 200HZ and increased the high frequency.) Mounted it to an articulating swing arm wall mount (VideoSecu #ML532B, about $26.00). It uses the 100mm x 100mm VESA Mount. I did have to use 4 (four) 1/4\" thick x 1\" outside diameter spacers (w/clearance hole for M4 screw or larger) on the base plate to clear the AC power cord in the rear at the bottom of the TV. The rest of the connections in the rear cleared the base plate with plenty of room. The back of the TV is flat, so no problem mounting the base plate to the back of the TV. Used the M4 x 20mm screws that came with the wall mount to secure the base plate to the back of the TV. We have ATT UVerse, so I set up the ATT remote controller to control the TV - no problem, just followed the ATT on-screen instructions to program in the correct code for the TV. I located the wall stud and used the ST8 x 50mm self tapping screws supplied with the wall mount to mount the arm base plate to the wall. Of course, I did this before mounting the TV to the arm. The TV weighed maybe 10 lbs. so it was easy to lift it and mount it to the arm. Used an HDMI cable to connect from the control box to the back of the TV. The distance of where the TV is to where I am sitting is about 15 feet - I can see the TV picture clearly. I can read the ATT on-screen menu clearly, also. Hope this helps.", "Date": "January 9, 2014"}, {"Title": "No Frills, Bright, 720p Display", "Author": "Brendan A. MacWade", "ReviewID": "RAPHIB7HZ7A6C", "Overall": "4.0", "Content": "The Sony KDL-32R400A is a thin, light, 720p HDTV that should satisfy most users looking for less than top of the line LED TV. It's an especially good choice for secondary TV locations, like a guest room or bedroom. Since the introduction of 1080p LED TVs, I have become spoiled. 1080P LED displays are amazing. They are crisper and brighter than the plasmas and florescent-lit TVs that have come before. I'm afraid that one you've seen a 1080p LED display, you won't want anything less. But budget TVs still exist. And \"budget\" today is 720p LED, which is still excellent, when you consider that more than half HDTV channels still only broadcast in 720p. Plus, LED backlights are super bright and can last 10 years or more. This is a lot of TV for under $300.This TV has cost cutting, to be sure. The stand does not allow the monitor to swivel. The speakers are small, and face down so sound is reflected off your furniture. There's not a piece of aluminum to be seen. This is all plastic, and that's fine.I would argue this is a great TV for a kids room, a home office, guest room, or bedroom. There are crisper displays out there (see the 32\" LED 1080p by LG), and there are displays that swivel (Toshiba has a 32\" model with a swivel stand). But if you are loyal to Sony, you know what your're getting, and this time around, it costs less than ever before.", "Date": "October 9, 2013"}, {"Title": "Excellent value for money", "Author": "Jason Davis", "ReviewID": "R3RYM7QQMV6XFS", "Overall": "5.0", "Content": "My old 26\" Bravia was stolen so I decided to upgrade to 32 and stick with Sony.  The old TV was incredible and this follows in its footsteps nicely.  There's no VGA input but if you want to hook it up to your laptop you can use the HDMI ports.  Picture is excellent.  Audio is incredible considering the speakers are nearly invisible. If I was gonna be picky I'd like a little more bass but it's not a big deal.  The nice thing is that this TV takes up the same amount of space as the previous 26\" but gives you a bigger screen.  Nice!  If you're looking for a decent sized TV for a small room (bedroom, game room, study) this is it.  Highly recommended.f", "Date": "November 11, 2013"}, {"Title": "An excellent TV", "Author": "Miriam Rubinoff", "ReviewID": "R3KPR98HG2MI4B", "Overall": "5.0", "Content": "This is my first flatscreen TV and actually the first TV I have ever bought, having received used TVs from relatives in the past. I had to do some research to know what to look for and what features I needed or didn't need. This Sony is excellent for my purposes. The other brands I looked at (mostly Samsung and Toshiba) had the TV sitting on a stand that was several inches high and attached in one place at the bottom center. They looked less than stable in the pictures, and reviews did say they were unstable. This is on a much lower stand, attached in two places, and it's very stable. That would not matter if you're mounting the TV on the wall, of course. The size is perfect for me as it's in a bedroom, being viewed from five or six feet away. It was extremely easy to set up and I have not had to make any adjustments in the sound, color, or anything else. It pulls in more channels than my old TV, using the same antenna. I do wish there were some way to disable the red indicator light when it is off, as it is in a bedroom and the red light bothers me. (You'd think it would occur to the manufacturers that people do put TVs in bedrooms, and you can easily tell if a TV is off, because it's OFF.) I had to put a sticker over it. But that is a minor annoyance and probably every TV made now has the same off light. Overall, I recommend this TV. Another great product from Sony!One more point: A couple of the other reviews said the product arrived in a damaged package, and one said the TV itself arrived shattered and they had to return it for another. Amazon certainly will exchange it in such a case, but I just want to say that mine arrived in perfect condition, both product and packaging. I have been using it for a couple of weeks now, and I'm still delighted with it.", "Date": "October 23, 2013"}, {"Title": "Great Budget TV", "Author": "LitWit \"Lacey\"", "ReviewID": "R2CAZ6TUVHZ2WY", "Overall": "5.0", "Content": "I am a currently a graduate student living in a small downtown Detroit apartment and I'm starting my review with this to give you an idea of my space and budget. I had an old RCA combo (tv/dvd) set and it just stopped working (only two years old) so I was in need of a new tv. I'm not super technologically inclined (English Lit PhD) so I did a ton of research about smaller affordable tvs and eventually narrowed it down to this Sony or an LG. I nixed the smart tvs because I have a Roku and that's fine for me...I don't need a remote control with dedicated buttons for channels that may not exist in a few years. I wanted to make sure I got a tv with an audio outlet port and the Sony edged out the LG with its speakers...plus, I ran my thought process by my two much more technology inclined brothers and they agreed. Got the tv and was shocked at how light it was (carried home under one arm) and it was ridiculously easy to set up on my little corner tv stand. The picture, to me, is amazing...much better than my RCA unit and another reviewer mentioned the edge beveling fading into the background as you watch tv...and while I had no clue what it meant when I read it, I now do...the beveling is so thin that it does seem to disappear into the dark background on tv shows and movies...which amazes me. I couldn't be happier with this purchase. If you're on a budget and need a smaller tv then this might be for you (+ it'll make a great bedroom tv or kitchen tv when I'm not so poor lol). Two things: I would add on an extra warranty AND be sure to check out the review on CNET for this tv. I'll update if anything significant happens. Cheers!", "Date": "January 28, 2014"}, {"Title": "Great HDTV!", "Author": "orion", "ReviewID": "R33MXQTPTYKVFW", "Overall": "5.0", "Content": "I paid a little more for this than many other 32\" TVs, but it was worth it. Very easy to set up, great picture after some fiddling and very nice sound.Sound is the usual weakness for the newer style TV's with the speakers in the rear. I was pleasantly surprised by how good the sound is with this set without using any external speakers. Very nice.You have to play with the video adjustments to get the picture the way you want it but this is the same with every set. Once you have it the way you like it the picture is excellent, just a tad below my Panasonic plasma, which has a  superb picture.Best of all, contrary to what other reviewers have said, this TV will pass through digital audio from a device connected by HDMI. So, for example, hook up a DVD player, ROKU, whatever to the TV using HDMI and then use an optical cable from the TV to your receiver and you will get 5.1 dolby digital sound. You do not have to have a separate feed from the device to your receiver. Apparently, most TV's will not do this - awesome. This feature made the TV perfect for me. I'm streaming Netflix as I write this. the picture is amazing and I have full digital 5.1 surround sound.If you want a great 32\" HDTV try this one.", "Date": "November 28, 2013"}, {"Title": "Sony 32\" TV", "Author": "Barbara L. Gayle \"Sockos\"", "ReviewID": "R3S9ZVEQDBADE", "Overall": "5.0", "Content": "After reading many positive reviews about the Sony 32\" TV, I was impressed, so I purchased it and have nothing but wonderful nights watching my shows.  The picture is and sound are very clear.  I would advise anyone that is in need of a new TV to check this one out.", "Date": "September 13, 2013"}, {"Title": "Great Sony TV", "Author": "James G. Curley", "ReviewID": "R3K835HD3Q6CXX", "Overall": "5.0", "Content": "I have owned Sony tv's for years, and this new model did not dissapoint me. It is super light, great picture and sound, and is a snap to set up.", "Date": "September 6, 2013"}, {"Title": "Excellent Picture and Great Sound", "Author": "John Roach", "ReviewID": "R2U450EQH3KX8", "Overall": "5.0", "Content": "The TV exceeds my expectations. I bought it for a home office where I escape when I want to watch a game when my wife is watching another RomCom. Clear, bright colors and crisp sound make it a tremendous bargain.", "Date": "July 8, 2013"}, {"Title": "Bought it for my Dad and He Loves It.", "Author": "Just Say Maybe", "ReviewID": "R3FOMRW35HVWUL", "Overall": "5.0", "Content": "Great sound and picture. The perfect size for his small apartment. Lightweight. Clean lines with classy Sony design. Easy set-up. What more can you want?", "Date": "January 22, 2014"}, {"Title": "Awesome HDTV!", "Author": "Jason Johnson", "ReviewID": "R88N1IMDK13EE", "Overall": "5.0", "Content": "I've always loved Sony products.  This may say its only 720p but because its a 32inch and its a Sony, the resolution looks amazing.  Its much better then most LCDS with 1080p that i've seen.  Also the border on the tv is so cool because it blends out so it seems like its not even there.  This is the best tv I've had.  Its gotta be totally worth it to spend a little bit more for this 32inch then getting a cheaper brand.  I can't wait to get an even bigger Sony tv.  Sony is always the way to go, imo!  Amazing, awesome HDTV!", "Date": "January 6, 2014"}, {"Title": "Sony KDL 32\" beyond my expectations.", "Author": "Victor Colacchio", "ReviewID": "R3HI9HMBBL3B41", "Overall": "5.0", "Content": "Lots has been written about the newest batch of TV's, many brands offering different configurations, I've always owned Sony TV's, I got rid of a 32\" CRT because it was too big, but wouldn't break, so I stayed with Sony.  I'm happy with this TV, I don't see the problems the Critic's are talking about as I'm not one of those people who can \"see, hear and smell\" better than others.  I like this TV and am happy with this product.  Sony makes TV's with accessories for what they believe you need and this TV has everything you'll need.", "Date": "November 25, 2013"}, {"Title": "For me, Sony has the best picture quality and I'm very happy with this TV", "Author": "Christine Rivera", "ReviewID": "R2ZOSYHUQ08W3U", "Overall": "5.0", "Content": "I've had this TV for about 2 months now, and I just love it. It is a perfect bedroom TV, and I'm so glad I bought a Sony. I've always owned Sony TVs and do feel they have the best picture quality. I have it hooked up to my cable box with an HDMI cable, and I realy like that I only need the single cable. I don't use my TV for Internet or games, just to watch TV, but I absolutely love the picture. A great value.", "Date": "November 14, 2013"}, {"Title": "Outstanding Value For The Money", "Author": "Christopher Hasbrouck", "ReviewID": "R3Q1D769ZG4ZIL", "Overall": "5.0", "Content": "Outstanding value for the money.  Minimalist aesthetic with clean, sharp lines.  Light weight.  Sufficient number of ports. Good picture.  Excellent sound.  Outstanding price.", "Date": "November 13, 2013"}, {"Title": "great picture for the price", "Author": "Ray A. Radvillaws", "ReviewID": "R21O63OOSB8ZHR", "Overall": "5.0", "Content": "Our 6mo visio died this replaced it ...better picture....great picture for the price Sony KDL-32R400A 32-Inch 60Hz 720p LED HDTV (Black)", "Date": "October 6, 2013"}, {"Title": "Wonderful TV", "Author": "S. Vogt", "ReviewID": "R15RY1XMRBY0FY", "Overall": "5.0", "Content": "I spent well over an hour in Best Buy looking at all the different TV sets. Basically everybody makes good sets these days but the Sony had just a minor edge in picture quality over the other 720p TV sets in its price range ($250-$300). Colors are vibrant without being too oversaturated and artifacts on the screen are minimal. Setup was a breeze. Very happy with my purchase.", "Date": "October 21, 2013"}, {"Title": "This is a nice little TV", "Author": "Dallas", "ReviewID": "R2WYETPQSRFTM", "Overall": "5.0", "Content": "I live in a little town, and I went to buy a TV at Walmart because that's all we have.  I waited for almost 30 minutes for someone to help me, then they didn't have the one I wanted in stock.  So I came home and ordered from Amazon.  I had the TV in two days with Amazon Prime.  It was very easy to set up.  I don't have much experience with electronics, but I had no trouble at all.  I also got a Blue Ray player, and I had everything up and running within an hour.  Amazon gives you help for 30 days, and I had a couple of questions, so I called.  The person who answered the phone was very knowledgeable, nice, and in America.  I am planning on getting another TV, and I will buy it from Amazon.", "Date": "September 14, 2013"}, {"Title": "showed up broken", "Author": "Edward Valdez", "ReviewID": "R2M3P2M8GUO0SQ", "Overall": "1.0", "Content": "If it was not broken on shipping I believe this TV to be great. I own two other Sony TVs and they have yet to fail to impress. Shipping on the other hand was the issue. It was shipped in the same box as you would see in the store which is not made for shipping. The screen was cracked like something heavy was placed on it. I am thankful Amazon has a great return policy! it was taken back the next day.", "Date": "April 27, 2014"}, {"Title": "Reliable", "Author": "JD", "ReviewID": "R33VH2R7MV3XT4", "Overall": "5.0", "Content": "We use these TV's as monitors for our companies CCTV's they run 8-12 hours a day 6 days a week. We have 8 of them currently no problems so far. Good TV overall", "Date": "March 21, 2014"}, {"Title": "Excellent Basic HD TV", "Author": "EmmJay", "ReviewID": "R2INWZI4HHMLI5", "Overall": "5.0", "Content": "I've had this a few months now and decided it was time for a review.I say \"basic\" because it does not offer some of the more advanced controls (like enhanced color temp) nor is it internet connectible, which I do not need as I already had internet connectable devices.One of my main reasons for looking at this was the 18 3/4\" tall space in the chest it was going into. Aside from this Sony and a no-name store brand, the largest screen size I was able to fit in this space was a 29\" diagonal. (The extra 3 inches is definitely noticeable).Anyway, this is a very attractive, no nonsense looking tv. Simple and straightforward in design and implementation.The picture is the big thing here. It is exceptional. Extremely natural. But I would not recommend using the pre-sets. Like every TV I have seen, the presets are too saturated, can have too much sharpness, etc. Manually adjust the various picture settings and you will be amazed what this set can deliver. Now room lighting, the picture source and personal preference play a definite role in setting the picture, but below are the settings I use. Try these as a starting point. Then play around a little to see the different effects. This works out well for my environment and if you are using a pre-set you should see quite an improvement. If more advanced users have some corrections/suggestions feel free to comment. I'm always up for experimenting.Backlight: 7Picture: 90Brightness: 50Color: 46Hue: R2Sharpness: 15Color Temp: NeutralEverything else is Off. In the Advanced Menu (you need to scroll down to get to it) everything is off except:Gamma: +1My main quibble is only 2 HDMI ports. This seems to be the increasing standard though so I can't fault Sony for that. I have a blu-ray player, Roku and laptop all with HDMI. I spent $10 for an HDMI switchbox so now I actually have 5 HDMI inputs. So no big deal there.I am a \"cable cutter\". I dropped cable a few years ago and use over the air for \"regular TV\". I live on a hill in San Francisco and apparently am in a good reception area. I made a homemade antenna from a coax cable. I stripped one end and taped it to an aluminum foil cardboard tube that had a few layers of foil around it. Ran it along the wall and placed on a window sill. It is essentially invisible. I ran through the channel scan and came up with 52 digital channels, many in HD. The channels come through rock steady with excellent resolution.I have the sound running into an A/V receiver so will not comment on the sound from the built-in speakers, but the majority of reviews seem to praise the built-in speakers. The sound from my receiver is excellent. One feature I love is the Pic Off button (just below Input on top left of remote). When you hit it the picture goes off but the TV/sound remains on. Since I have the sound going into a receiver, this is very useful when I want to play a CD on my dvd player.Overall I am beyond happy with the performance, size and looks of this remarkable little TV!", "Date": "March 4, 2014"}, {"Title": "Great picture!", "Author": "David R.", "ReviewID": "RN3RWMEEUNTSU", "Overall": "5.0", "Content": "I looked for several months at a variety of TV brands (i.e. Samsung, Panasonic, Toshiba, Sharp,...) and ended up purchasing the Sony for a couple of reasons.  No, it was not the cheapest but to me the combination of picture quality (clarity and minimal blur with action) in conjunction with the picture color seemed to me to be the best right out of the box.  I know many people like the Samsung TVs but I found them too artificial (over emphasized coloration and hues) for my tastes.  Thus far, I have no complaints with this TV set.", "Date": "February 14, 2014"}, {"Title": "Sony TV for kitchen", "Author": "Lynwood E.", "ReviewID": "R1YP0WXXVVJBGG", "Overall": "4.0", "Content": "Good value for the money.  I was buying a size to fit on the wall in the kitchen.  Sound quality is better than some other models", "Date": "January 28, 2014"}, {"Title": "It's great!", "Author": "Big G", "ReviewID": "R130M1W6VOJWYF", "Overall": "5.0", "Content": "I bought this for my girlfriend for Christmas, and she loves it and watches it every day.  The picture and sound are great right out of the box.  She uses it with cable TV, but we have also tried it with an antenna.  Both ways work well.  She's very picky about sound, and many smaller LCD TV's sound tinny to her, but she really likes the sound from this one.  The picture is superb.  We also like how light weight it is, making it easy to pick up and move.", "Date": "January 21, 2014"}, {"Title": "Great TV for Great Price", "Author": "Outdoor Photographer", "ReviewID": "R2H6Y3B5HPBA3A", "Overall": "5.0", "Content": "The tv has wonderful resolution, color, and I love these light weight tvs that I can move by myself.  Totally meets my expectations.  I think Sony makes great tvs.  I know have 3 and if I ever need another will buy another Sony.", "Date": "January 9, 2014"}, {"Title": "WOW!! Sony is the the best!!", "Author": "Colby C.", "ReviewID": "R1DB18BP76ZKMS", "Overall": "5.0", "Content": "I'm reviewing the 32\" model. All I can say is this TV is just awesome! I mean if your looking for a TV with fantastic picture quality without all the bells and whistles of a \"SMART TV\" then look no further you have found it. Now yes I'm discussing the smallest of the three TVs Sony has in this line and it is a 720p, I was worried about this even though I know its been said you can not see the difference between 720p and 1080p on 32\" and under. Well, this 720p TV looks better than the 48\" LED 1080p Samsung I have and the Samsung looks very good. Not only is the HD quality of the picture incredible on this TV, but the advertised 60hz with120hz motionflow XR absolutely makes a difference and I could notice it right away. So anyways this obviously wasn't meant to be a technical review but an honest review from my perception on how the TV looks. I'm a pretty snobby person when it comes to quality HDTV and this TV is just incredible and I can't believe I got it for $275.00! Easily better picture than the 400-500 32\" 1080p tvs i was considering before finding this. Don't hesitate, buy this TV if you don't need the smart features. I'm going to buy the 50\" version now to replace the Samsung. Oh and I didn't have to mess with the picture settings at all put of the box unlike every single other TV I've ever purchased : )", "Date": "December 13, 2013"}, {"Title": "Sony does it Again!", "Author": "Tom Barclay \"TB\"", "ReviewID": "R34HM5E7CJK99T", "Overall": "5.0", "Content": "Great TV, I wasn’t too sure about the 60Hz/720p format, but I have not noticed any issues on this size screen.  Sony always has good sound on their flat screens compared to the competition and the picture is very good.", "Date": "November 11, 2013"}, {"Title": "Great Bedroom TV", "Author": "V. M. Carbajal \"Viqui\"", "ReviewID": "RIXO0U62637SS", "Overall": "5.0", "Content": "Great TV for smaller bedroom if you are looking for best viewing.  Unit is very light so would highly recommend anchoring the unit to the wall if not going to wall mount it.  Easy easy no hassle set up.  Purchased the Sony super wifi DVD player and Sony Surround Sound  Wireless Headphones and connecting to TV was easy also.", "Date": "September 30, 2013"}, {"Title": "Great secondary room TV", "Author": "Beantown Jim", "ReviewID": "R1YUAHTZUSEIUR", "Overall": "4.0", "Content": "Just received the TV today.  Set-up is quick, but there are so many options that the experienced consumer like me can go back and tinker for a long time in all the menus.On the plus side: Only 2.2cents per day to operate; amazingly light(12 lb.s); slim cabinet; easy to use remote control.  It has 'Clear Voice' which is intended to emphasize speech but is helpful only in this function.On the negative side: It DOES work with computers but does NOT have RGB so it's useless for my PC at the moment. I could buy a PC-TV card, but am slightly surprised at this omission.  Also, compared to my Toshiba, it does not do well with 2nd rate signals.  Unless you have HDMI, you'll have an acceptable picture but nothing approaching 'hi def'.  I have it on a simple video/audio RCA connection and its picture is fine, but far from stellar...The major shortcoming on the set, and virtually all sets short of the premium large ones is sound.  A wafer thin plastic cabinet does not provide a means of resonance nor of having proper speakers. As a 2nd set for a room, it's OK; for a primary use set, you should add supplemental speakers, etc.The key thing to remember is no RGB computer hookup. Either you get a HDMI PC card or just use it as a simple TV...it does have USB capability though...", "Date": "July 25, 2013"}, {"Title": "Great TV", "Author": "Cornelia Nicolae", "ReviewID": "RD2DSBEI2AFTH", "Overall": "5.0", "Content": "It is lightweight. It can be moved around to watch shows together with other people. With the right connection I could entertain, off the Internet, my loved ones.", "Date": "May 3, 2014"}, {"Title": "Just ok.", "Author": "Brian Battocletti", "ReviewID": "R2D1XX6T2DQWPC", "Overall": "3.0", "Content": "Good value, but plenty of motion blur.  Ok for a less discriminating viewer, but I upgraded to the W650a and love it.", "Date": "March 3, 2014"}, {"Title": "LOVE this TV!", "Author": "autumnfalln", "ReviewID": "R66CUZHQZ05P5", "Overall": "4.0", "Content": "I did a LOT of research before making my final decision. After all, it's sort of a big and important purchase.Picture looks great- obviously you have to be watching something in HD for the TV to display HD, though, so keep that in mind.  Also, the hookups are really nice, I like that I can plug in my PS2 or my Wii without having to purchase adapters! The HDMI ports are also super nice. For me, one port is permanently hooked up to my DVD player, and the other I use to plug in my laptop if I'm watching something on Amazon Prime.The profile is SO nice. Very slim, very sleek, the TV itself looks really, really good. The TV comes with a stand that is super stable, so you don't have to worry about ruining your furniture by drilling in holes or anything like that. The only thing is that I really do wish the TV swiveled. It's a little inconvenient to have to angle your entire TV around sometimes.Other than though, I'm reallllly happy with this purchase! Highly recommend.", "Date": "February 11, 2014"}, {"Title": "Great Pic - Great Sound!", "Author": "Beth West", "ReviewID": "R3GA3D39KT4NIH", "Overall": "5.0", "Content": "What else would you expect from SONY though!  I have another. older Sony I I still like it too.  This one has good features and great sound even when turned way up.  I hate tinny sounds!  I never get that with with the T.V.  Love it!!!!!", "Date": "February 3, 2014"}, {"Title": "Great picture", "Author": "Robert D. Levy", "ReviewID": "R3FV16T8CUC9KA", "Overall": "5.0", "Content": "It's a Sony. Enough said. Perfect size for a smaller room TV - our kids use this in their playroom, and it's been a wonderful addition.", "Date": "January 20, 2014"}, {"Title": "Great deal", "Author": "Philip Douglas Curry", "ReviewID": "R20ER2HL7XT5I2", "Overall": "5.0", "Content": "Very nice TV with a great picture.  Anyone looking for a basic TV with an excellent picture should consider this.", "Date": "January 16, 2014"}, {"Title": "Very Happy with This Sony", "Author": "Earl Grey Rules", "ReviewID": "RO05JD5S2HK87", "Overall": "5.0", "Content": "I received this 32\" Sony KDL-32R400A LED HDTV as an early holiday present, ordered on Cyber Mon from Amazon Warehouse Deals.  Immediate love.  Set up easily with cable through HDMI, fits great in space, best stand among competing models (matters with rambunctious pets), great picture and sound.  Much better at 720p than the 1080p ViewSonic set it replaced and which was a few years old.  I have a LG Net box with Blu-ray, and Blu-ray looks fantastic as do normal DVDs.  I waited a month before posting this feedback to check everything out, but it's all good.Before going with this set, I compared with other brands and models, particularly with Samsung.  Glad I stayed with Sony, which has always made great monitors and teevees.  My old portable BR Trinitron is still going fine after more than 20 years.  I want to thank those Amazon customers who answered my Qs posted here before making the purchase and who were quite helpful.If you want a basic LED HDTV and don't need a lot of bells and whistles, this model is highly recommended.  The price is quite competitive for the quality and reputation of the brand.  There isn't much genuinely very good to excellent with resolution and sound, and overall style, in the 32\" and under size at a very good to excellent price.  Something else I considered is the release date.  As of late 2013, this model wasn't quite a year old.  The Samsungs and other brands were a bit older.  My sense is that they were marked down for the holidays, since new models will be released in early 2014.  The technology under the hood on this model is likely better for the price (given the competitive market and fast changing specs), since whenever Samsung updates their smaller sized sets again a higher price will result.", "Date": "January 8, 2014"}, {"Title": "Love my Sony!!", "Author": "toots", "ReviewID": "R1J8PDI4V3S4N9", "Overall": "5.0", "Content": "Best picture evar! I have this tv set up in my bedroom with a sony s3100 blu ray player. Fantastic. Sound is great too. You can't beat the amazon price of $272 shipped. Buy from Amazon and they will make sure you are happy.", "Date": "December 28, 2013"}, {"Title": "Great!", "Author": "jk", "ReviewID": "RKAUSQO7YWONA", "Overall": "5.0", "Content": "As expected. this Sony Bravia is as good (maybe  even a little better), than our older model. Gret deal through Amazon...thanks!", "Date": "December 26, 2013"}, {"Title": "Great sound for a thin panel...", "Author": "Faja4x", "ReviewID": "R15SQKXP25IALV", "Overall": "5.0", "Content": "This really is only being used in conjunction with an xbox and in that regard it works great.  Unit is impossibly light and base was easy to install.  Control is intuitive and had no problem setting up and running.  I mostly went with this tv because I had no intention of using a soundbar and in that fashion it works well.", "Date": "December 24, 2013"}, {"Title": "My neighbor has a larger size one of these KDLR Sonys.", "Author": "L. barthel", "ReviewID": "R9UH3RXSILKKX", "Overall": "5.0", "Content": "The picture is the selling feature.  So much better than the ones I looked at in Best Buy and Costco.", "Date": "December 23, 2013"}, {"Title": "Beautiful Relaxing TV", "Author": "Lalie", "ReviewID": "R1WDXK5SXZ1R8A", "Overall": "5.0", "Content": "This is an excellent 32 HDTV.  It is large and well centered.  We purchased this one for the bedroom.Our old one was one of those large heavy TVs.  The color is great, you can sit back and get a larger view!", "Date": "November 27, 2013"}, {"Title": "Sony did it again", "Author": "North Country", "ReviewID": "R29O6JOSX6EIBZ", "Overall": "5.0", "Content": "Sony did it again. I just bought this HD at a retail store because my 1988 Panasonic still works fine but I wanted to upgrade. I have a 2007 Sony Brava with has been a gem. After intensive research I didn't realize how much things have change in a few years. I am used to all the frills on the back of my 40 inch Sony and found the 32 inchs are fairly similar with ports, etc. After reading the manual there are 3 HMDI's. The one on the side has a duel function and can be used for smart phones or as HMDI. You need to turn off the Smart phone setting in the menu from what I gather. I did call Sony support this week end before purchase to make sure Windows DVD media from my computer could be played on it. No problem. The Sony DVP-SR210P DVD player compliments this TV if your not into blueray. The sound, picture, and look is beautiful. I like the fact it has an antenna port on the back for over the air Broadcasting. Antennaweb.org can be of help if interested. It's a keeper after looking at all the choices. I have only owned Sony with the exception of one Panasonic which that would be my second choice. Plan to buy a Roku as others say it will work and will check with Sony first before investing. Happy Shopping. For the money this TV will not disappoint you. My Aunt plays the 40 inch MANY hours a bay and it is unreal. This will be my bedroom TV. As for the smart phone feature I am not interested as I do not want one and this TV fills all my needs.", "Date": "November 17, 2013"}, {"Title": "Sony 32 inch TV", "Author": "L Charles", "ReviewID": "R2CYGNF4K7ZUKC", "Overall": "5.0", "Content": "What a great little TV!  Just fits into my space between a large cabinet and a chair. Great looking.  Totally streamlined in appearance.  When it first comes on it says in big letters SONY.  Only 11 pounds so it easy to clean and adjust.  In keeping with all the fine SONY products", "Date": "September 8, 2013"}, {"Title": "Those little features that make a big difference...", "Author": "brycen", "ReviewID": "R3CSP4W1A6VRSA", "Overall": "4.0", "Content": "Overall this is a solid unit with a good picture quality, and above average build for this price range.  The display is solid, but you will notice uneven lighting on solid areas of color.Downsides include: a limited number of inputs, a pretty cheap stand, and rather insubstantial remote control.PIP only works with PC inputs, you can't play a DVD and have a PIP window open with the tuner.Since I use a DVR that takes one input.  The Roku another.  Now I'm left with just component and composite inputs I can't use.The built in tuner is stronger than that on my DVR, but that's a moot advantage as I only watch through the DVR.The media playback and slideshow functions are weak.  You have to separately browse for pictures and for videos.  You can't readily pause/skip forward/skip back or zoom during a slideshow.  And you must treat each folder separately even if the pictures are all from the same camera taken on the same day.There's a light sensor, but you can't configure how sensitive it is.  I find it makes the screen too dark, but turning the feature off results in a screen that's too bright.I appreciate the buttons on the back for volume and input switching... however... the button I most often need to push is \"format\", which is a remote only feature.", "Date": "November 7, 2013"}, {"Title": "GREAT TV", "Author": "R. Bishop", "ReviewID": "RBCOWFQCT2WMH", "Overall": "5.0", "Content": "This Sony TV performs exactly as I anticipated.  The picture is fantastic and the larger than average speakers provide adequate audio. This was a good purchase.", "Date": "October 20, 2013"}, {"Title": "What a deal!", "Author": "Upstate New Yorker", "ReviewID": "R3APPRKNCNGR0G", "Overall": "5.0", "Content": "I never thought I would buy a tv off the net, but took a chance after researching a bit and picked this one. I love this one. I set it up with a ROKU and am watching tv shows, news and movies free with my amazon prime, and netflix accounts. Also fox news for free. I live alone and am not too savvy with electronics, but set up was a breeze, even though I had no experience with roku or an updated tv. My old 19 inch tv was abouit 16 years old, and not able to hook up anything other than cable!  Very user friendly to set up and use. The picture is so clear and even the sound is good. Am completely satisfied. Would definitely recommend it. I was so sick of my cable tv provider charging so much for tv, phone and internet, telling you one price and then changing the terms, plus the customer service was so bad, I finally stopped the cable and phone part and just kept the net. Have a cell phone, and internet now, but don't miss their services at all. This is way better and way more cost efficient. Thanks for a beautiful tv and a great price to boot.", "Date": "August 31, 2013"}, {"Title": "sony 32 inch HDTV", "Author": "Thomas Arietta", "ReviewID": "R19DHNYOSDORD6", "Overall": "5.0", "Content": "This TV from Sony what could I say I always feel confident when I buy sony products and this TV is perfect sony the one and only.", "Date": "June 22, 2013"}, {"Title": "Fabulously clear picture", "Author": "ckc59", "ReviewID": "R3R5C3PEOTPSCZ", "Overall": "4.0", "Content": "The size is ideal for the kitchen area.  The picture is sharp and clear.  Price was reasonable for the size.  There are lots of picture adjustments, which is great.", "Date": "May 24, 2014"}, {"Title": "Totally satisfied with quality and prompt service.", "Author": "mrirving", "ReviewID": "R32W6CE2OZJDMN", "Overall": "5.0", "Content": "My experience with Sony products has always been positive.  Therefore, I had no hesitation in choosing this TV with enhanced HD!  Very happy!", "Date": "April 5, 2014"}, {"Title": "Great Picture! Worth the extra $$$", "Author": "MK Reagan \"Mary Kay\"", "ReviewID": "R2QJQCTSS5OIAU", "Overall": "5.0", "Content": "We paid more than we'd initially wanted to spend to replace the TV in our guest room, but this was worth it. The Sony picture is great, even in this lower price model. Colors are true right out of the box. Buy this TV instead of the cheaper and less well known brands. You will not be disappointed.", "Date": "April 5, 2014"}, {"Title": "nice TV", "Author": "Don", "ReviewID": "R1NUH3Q0028HJX", "Overall": "5.0", "Content": "great TV for the price, i wish i'd gone bigger though, these new TVs are so small. works great with my Dish!", "Date": "March 15, 2014"}, {"Title": "SONY BRAVIA IS BY FAR THE BEST QUALITY TV", "Author": "Jamie Taylor \"Jamie Taylor\"", "ReviewID": "R297GX5J4183FL", "Overall": "5.0", "Content": "Works great in my son's bedroom.  There are tons of TV choices and brands but I've always trusted SONY! You will love it!", "Date": "March 10, 2014"}, {"Title": "So far so good.", "Author": "Marcos P.", "ReviewID": "R33WHZ00PH7XMJ", "Overall": "5.0", "Content": "Looks great, sounds pretty good as well, was surprised. Will update if anything goes wrong. Received the TV on mid august 2013. Still working like a champ with no signs of trouble. Will update.", "Date": "February 24, 2014"}, {"Title": "Nice", "Author": "Edgar G.", "ReviewID": "R3KFRNV4UAAHPW", "Overall": "5.0", "Content": "For under $300 you can't expect much for a 32 in LED but this TV is overall pretty nice. I just added some speakers to it.", "Date": "February 20, 2014"}, {"Title": "Sony 32\" TV", "Author": "Mark Weshinskey", "ReviewID": "R21NMYTAN2JW4", "Overall": "4.0", "Content": "It's a nice TV, easy to set up, with a good picture, but the color seems a little washed out.", "Date": "February 18, 2014"}, {"Title": "Beautiful Picture", "Author": "pdwinter", "ReviewID": "R2RNN86F1ISPHR", "Overall": "4.0", "Content": "Perfect for our small family/kitchen room.  Has wonderful picture and easy to use menu for customizing settings.  Love the audio feature that prevents commercials from blaring at loud volumes.  Great value.", "Date": "February 16, 2014"}, {"Title": "True to its Reputation", "Author": "AquaGal", "ReviewID": "R27P6GGIDDSG9I", "Overall": "4.0", "Content": "I purchased this set prior to moving into an apartment where I knew it would occupy a small corner.  The only negative is that I did not realize how spoiled I'd become by my older 1080p Sony.  The image on this smaller set, while acceptable, is not as clear as I would have liked.  But, within a few weeks I adjusted to it and and have no complaints.", "Date": "February 12, 2014"}, {"Title": "very good", "Author": "Carolina", "ReviewID": "R6U2GIZQOFMKL", "Overall": "5.0", "Content": "the product is of excellent quality and highly recommended is adequate and very good, comfortable, quiet, and friendly, everyone who wants one product of its kind highly recommend it without problems.", "Date": "February 12, 2014"}, {"Title": "love it", "Author": "J", "ReviewID": "R1JUFN4G36YJLS", "Overall": "5.0", "Content": "perfect bedroom tv. enjoy having it to watch when hubby is watching something else in the living room. nice picture.", "Date": "February 6, 2014"}, {"Title": "Works well Good picture.", "Author": "LQ", "ReviewID": "R3OU7NJI20N20X", "Overall": "4.0", "Content": "I have had it for 4 months.  It has a good picture for its size.  Good looking Bezel and Good sound quality.  Has everything you need.  Does not have WiFi or time info.  You will need a more expensive set for that.  The picture is as good as set with wifi and other features.", "Date": "January 15, 2014"}, {"Title": "Very Nice TV", "Author": "Peanut \"Abby\"", "ReviewID": "R97FVTUUCQE9P", "Overall": "5.0", "Content": "We gave this Sony TV to our son as a Christmas gift this year. It is a very nice TV.", "Date": "January 10, 2014"}, {"Title": "Awesome", "Author": "K&K Garriott", "ReviewID": "R1X3K7JWZHQWYP", "Overall": "5.0", "Content": "Awesome TV.The picture is great (after we calibrated it). It plays Game of Thrones like a champ. The sound was a little bit lacking, but we hooked it up to our surround sound, and it sounds great.We have a 58 inch Sony Bravia in our entertainment room that we have had for 3 years and still LOVE. I'm glad we spent the little extra money and got another Sony. We were not disappointed! 32 inch is great for the bedroom. All we needed!", "Date": "January 8, 2014"}, {"Title": "Great picture", "Author": "wlewan", "ReviewID": "R2LZ0JO8MGYXXO", "Overall": "5.0", "Content": "This is my second Sony Bravia in the house.  The picture quality and sound tone is very clear.  I had my first Sony 52\" for over 3 years and I'm very pleased with it.  When it came time to replace a bed room TV Sony was my choice.", "Date": "January 7, 2014"}, {"Title": "wish it had this feature", "Author": "Tanglewood \"Bill\"", "ReviewID": "R3G4JIL3U6ZZ1O", "Overall": "4.0", "Content": "We have this TV in our bedroom and are totally satisfied with it. The standard definition channels look better than most TV's I have looked at.If Sony is looking at this review, here is one feature that would be nice. You can store about 18 'Favorite' channels but getting to them requires a few remote clicks that make it a pain to use. You have to hit 'HOME' , then select (the small diamond in the middle of the remote) then the up and down arrows to browse thru your favorites. Once you have it, hit the select button to view it. If you want to go to another favorite, you have to repeat the whole process again. The 'nice to have' feature, on the remote, a button that would turn on 'favorites mode' and leave it on, the up and down arrows would display your 'favorite'  channels. Hitting the 'favorites mode' button again would turn the feature off.", "Date": "January 2, 2014"}, {"Title": "Beautiful picture, great sound.", "Author": "rsg", "ReviewID": "R3ENLK3NZCVJC1", "Overall": "5.0", "Content": "I cannot say enough about this TV. Normally we buy the high end Sony models, the XBRs. However, in this case we needed something for our kitchen counter and the maximum height we could take was 19\"  Once we hooked it up to the HD cable the picture was fantastic. The sound is so good it beats our 55\" XBR which we had to purchase a sound bar for to increase the sound. For the price and the quality you cannot beat this Sony 32\" TV.", "Date": "December 31, 2013"}, {"Title": "Excellent for the money", "Author": "qapd", "ReviewID": "R4A806XM1J3T", "Overall": "5.0", "Content": "We purchased this TV for a Christmas gift for father-n- law.  He loves the picture.  He would have never bought a Sony.", "Date": "December 31, 2013"}, {"Title": "Amazon has the best prices they beat all the Black Friday deals", "Author": "Candis", "ReviewID": "RF7TUIF1HZAMB", "Overall": "5.0", "Content": "My daughter loves it the picture quality and function are amazing and it was the best price that we found", "Date": "December 30, 2013"}, {"Title": "Great product!!!", "Author": "Phillip S.", "ReviewID": "R13A8BZWSAEWOZ", "Overall": "5.0", "Content": "Great product!!! Great product!!! Love the  quality of it. Would recommend this product to everyone , makes life so much easier, shoul have purchased years ago", "Date": "December 26, 2013"}, {"Title": "Great TV", "Author": "Butterfly", "ReviewID": "R2KL0VMF1PRH2H", "Overall": "5.0", "Content": "Great purchase.  Sony TV meets expectations, as Sony always does.  Good size for a bedroom.My family all love it.", "Date": "December 23, 2013"}, {"Title": "Best Deal in a Long Time", "Author": "Gail E Cash", "ReviewID": "R1R86OMW6M3MF8", "Overall": "5.0", "Content": "This TV really works well as a bedroom TV. It has an excellent picture and a good sound sound system!", "Date": "December 14, 2013"}, {"Title": "SLICK!!", "Author": "Fred J.", "ReviewID": "R1VN0HTCU0DMH5", "Overall": "4.0", "Content": "Exceptional value and excellent quality picture and sound with nice features,  New slim and light weight design.  This is my first Sony purchase and I am please so far with the performance of this television.", "Date": "December 8, 2013"}, {"Title": "Great tv", "Author": "John", "ReviewID": "R24R8N59X9YSE", "Overall": "5.0", "Content": "Its great tv. I have this tv for 2 months .I love it so far a lot better than my big 32\" cube tv weight as a car spare tires ( I have those sony tv for 15 yrs).the led graphic color design surprised me ,its great! Those tv is so light . I hope this tv will do 15 years like my old tv did . Amazon seller are awesome!! Shipping great on time as it said !", "Date": "November 29, 2013"}, {"Title": "Great, affordable Sony", "Author": "Huskerhawk", "ReviewID": "R3OTLRSBCVPA8E", "Overall": "5.0", "Content": "For the price, this is awesome.  I love Sony TVs, so grain of salt noted, but that notwithstanding, for the price (under $300), this is a really quality set that I trust the brand.  It's very light and feels plasticy, but that's why it's cheap...the internal components are what matter to me and the picture is as good as my 50\" Bravia, for the most part.  I would buy this again in a heartbeat.  It's not a smart TV, but I connect my kindle and my PC to stream...PS4 will arrive soon and that will take care of having to connect these devices anyway.  Another really nice bonus is that the sound on this TV actually is usable.  This is strictly a small bedroom TV and game console display, so I'm not going to ever connect a sounds system or soundbar, etc.  This TV has really good sound considering how bad most TVs are these days.  Considering how slim the display  is, they managed to get a better than average sound out of it...more than good enough for a small room.All in all, i didn't want to buy a cheaper brand, just because I like Sony...and it's worth it in terms of performance and picture.", "Date": "November 15, 2013"}, {"Title": "movie theatre in my living room!", "Author": "ThomE", "ReviewID": "R3VLTB3GZFPAHZ", "Overall": "5.0", "Content": "I love this big screen TV.  This is the first time I have purchased such a big screen and I now know what I was missing.  Plus, the Sony brand is the best, it has many fun bells and whistles, has crystal clear picture and sound quality, and the remote even works on my Sony Blu-ray player, without having to enter any codes.  Good price for excellent quality!", "Date": "October 29, 2013"}, {"Title": "Great TV", "Author": "MassCook", "ReviewID": "REEI37ABQJXQJ", "Overall": "5.0", "Content": "Simple, great picture, good sound quality.  Moderately priced.  A good choice for those looking for a small LED T.V. for home use.", "Date": "October 28, 2013"}, {"Title": "I love it", "Author": "Imashoein \"Imashoein\"", "ReviewID": "R1QHB4DO53PO2R", "Overall": "5.0", "Content": "Picture is perfect sound is great I just love it. the shipping was good there first ob arrived shattered I was devastated but there was no problem in returning the broke one it was a smooth experience.", "Date": "September 18, 2013"}, {"Title": "Great picture and sound is sufficient.", "Author": "Everett Garwood", "ReviewID": "R522R4BHUV6RW", "Overall": "5.0", "Content": "Got this little TV at a super price to hang on the kitchen wall. The sound is great and enough to fill the room without having to add a sound bar.", "Date": "September 16, 2013"}, {"Title": "college tv", "Author": "Lady Lynn", "ReviewID": "R2MP5SAUAHWGEF", "Overall": "5.0", "Content": "i gave this to my son to use in his apartment at college.  Works great and just the right size for his room", "Date": "August 28, 2013"}, {"Title": "Not disappointed at all!", "Author": "Bones", "ReviewID": "R2KX55IQ02AN55", "Overall": "5.0", "Content": "I had won an Element 32\" in a raffle and it didn't even work. I know Sony makes a good product from past experience so bought this model. Great picture and I am surprised at the exceptional sound.", "Date": "August 16, 2013"}, {"Title": "USB Video playback", "Author": "AlexA.", "ReviewID": "R1B95YUCGM3TI5", "Overall": "2.0", "Content": "It blows my mind this 2012 model TV doesn't support AVI, MKV or MP4 formats. I  didn't even bother asking before buying it. How stupid on SONY part this is!!!", "Date": "January 4, 2014"}, {"Title": "Good price, average picture quality", "Author": "Jilian V", "ReviewID": "R10AVA8RL75A2B", "Overall": "3.0", "Content": "I love Sony products and have a 51 inch TV in my living room. I bought this TV for my son's bedroom. So far I am on the fence about this TV. The picture is not what I expected it to be. It is a good picture, but the previous Samsung TV I had purchased outshot Sonys picture in the same price range. Another problem is that you can't switch from HDMI Input back to Cable. You actually have to go into setup and switch from Analog to Cable and the picture magically then pops up. I plan on calling sony again to try and rectify the input problem and if I can, I will keep this TV. If not, I will be on the hunt for a new one. If you want the Sony name with a \"good\"(NOT outstanding) picture quality, then this is a good TV. You can't beat the price, hence a slightly lower picture quality, although I think there is better picture quality TV's out there for the price, but you lose the Sony name.", "Date": "December 28, 2013"}, {"Title": "Can't go wrong with a Sony product", "Author": "Mendy", "ReviewID": "R572C8E4IC7IU", "Overall": "5.0", "Content": "My Sony KDL-32R400A 32-Inch 60Hz 720p LED HDTV arrived on time and in good condition.  Even though it is only 720p, the picture quality is excellent.  I have a 1080p television as well, and to be honest I really can't tell the difference between the two, they are both Sony and have great picture quality.  I just hope the television continue to manufacture these types of televisions, I am not looking forward into purchasing 3D televisions, which I see more and more of each day.  I recommend this product.  I rate this television set a 5 star.", "Date": "March 26, 2014"}, {"Title": "Okay tv", "Author": "Margaret N", "ReviewID": "R2GZKX3VKYJT1P", "Overall": "4.0", "Content": "Its a really good tv. I bought it after reading the reviews saying the picture quality is amazing. The tv is good and all but the picture quality is okay so I would just save my money and get a cheaper brand.", "Date": "December 13, 2013"}, {"Title": "Great TV", "Author": "Anthony B.", "ReviewID": "R13Q63AF5JRS1N", "Overall": "5.0", "Content": "This is my first Sony TV I really thought that the brand was all hype. This tv really performs well and has decent sound quality. I would definitely recommend this model to anyone. This will not be my last Sony tv.", "Date": "July 31, 2013"}, {"Title": "Nice TV", "Author": "Mildred L. Stevens", "ReviewID": "R2GBLJ9AB9JGZ7", "Overall": "4.0", "Content": "So far, the TV is great (only had it 2 months). On the other hand, my last 2 TVs (not SONYs) were fine at 2 months but died at 5 months (a Samsung) and 16 months (an Emerson). Here's hoping the SONY has a longer lifespan. My son in law says SONY is the best.", "Date": "September 6, 2013"}, {"Title": "FM RADIO", "Author": "Danny Toups", "ReviewID": "R1AP0YDSGIGWKU", "Overall": "4.0", "Content": "TV has a great picture, medium sound but for the life me I can not find the Emanuel or the FM Radio  can any tell me where or how to access the radio", "Date": "June 1, 2013"}, {"Title": "Good for casual use.", "Author": "John Kniat", "ReviewID": "R312PK2RZ8XBJP", "Overall": "4.0", "Content": "Good HD TV for casual use. I just don't understand why I can't have better picture control. I use straight cable line as input and picture is smaller than screen. So I set it to Auto WIDE and picture expand horizontally, but does not fill screen vertically. I gave up trying any more settings after nothing seemed to work.  It works well only if an HD signal is input.", "Date": "November 24, 2013"}, {"Title": "What would expect from Sony?", "Author": "Ed Underwood", "ReviewID": "R3A0JCVTGGVVHS", "Overall": "5.0", "Content": "A really nice tv - a good quality picture and good quality sound at a truly reasonable price It's a perfect tv for the bedroom. I will recommend it  EHU", "Date": "August 24, 2013"}, {"Title": "Terribly disapointed", "Author": "Tammy C.", "ReviewID": "R102HKMT5EPLQ", "Overall": "1.0", "Content": "I received this product in late October to give away as a door prize in early December.  The box arrived to me in perfect condition.  No rips or looks of abuse.  I did not open this box based upon the excellent condition.  When my Holiday party arrived December 7, 2013 it was given away as a door prize.  When my employee reached home he found the TV broken...as if it had been stepped on.  It was brought back to me at work and my IT Dept examined the TV and found it seemingly to be one that someone had purchased as new...replaced their old one in the box and returned it for a refund.  The TV that was in this box had scratches along the frame and looked very used.  I asked for a replacement; but I was beyond the 30 day marker due to the nature of the gift not being opened.  I had purchased the extended warranty and they do not replace \"that type of damage\".  I personally had to replace the TV since my work holds me accountable for not opening and examining it within the 30 day limit.  I will never purchase electronics via Amazon ever again.", "Date": "January 7, 2014"}, {"Title": "Standard Definition TV has black borders", "Author": "Jeffrey Eldredge", "ReviewID": "R1KXAN37QH4RCC", "Overall": "2.0", "Content": "I bought this TV because I have another Sony LCD and wanted them to be similar in the way they are used.Unfortunately, this 32-inch does not stretch a standard definition (SD) signal to full screen.Even when I put the setting on FULL WIDE MODE, I still get nearly 7 INCHES of black borders on the side (3.5 inches on each side).This is not acceptable.  My other 40-inch LCD Sony stretches SD to the full screen, but this one does not.The black borders make for a much smaller viewing area.  I am taking this TV back to the store and getting another brand.I am really disappointed.I will grant that when watching channels in HD, the picture and sound are great!  But let's face it, I don't always watch HDchannels, and with a TV this size, it probably isn't going to be next to the digital cable box, since it will be in the bedroom.If Sony could stretch the SD signal for my other TV, which is 6 years older, then I don't see why they couldn't do it for this one.", "Date": "February 14, 2014"}, {"Title": "Cheap set but is OK.", "Author": "Bing", "ReviewID": "RRMRSKIDJS4DO", "Overall": "3.0", "Content": "Purchased this set and when I got it, it would not work.  DOA.  Amazon was great, though.  I just filled out a replacement slip and sent it back.  In two days, Amazon delivered a new set.  I was expecting this set to be in par with the picture quality of a Bravia I have.  I was wrong.  It's not nearly as sharp or clear.  It's OK but not great.  TVs get junkier and junker as time goes by.  You'd think the Chinese would have it down by now, as the Japanese did years ago.  Nope.  Product quality keeps getting worse and worse on most things.  I'm sick of it.", "Date": "November 15, 2013"}, {"Title": "Somewhat disappointed in Sony KDL-32R400A 32-inch LED TV", "Author": "LIstening Ear", "ReviewID": "R2A4NLVHQ5JR71", "Overall": "3.0", "Content": "Well...it''s the same old story, even with Sony--you get what you pay for.The picture is fine looking straight on from no angle.  The angle view gets progressively more faded in color as the angle of view increases.Also, the sound is not what I expected and seems to be weak in amps.Perhaps this is all due to a smaller display?", "Date": "November 13, 2013"}, {"Title": "FM Radio", "Author": "Rick", "ReviewID": "R1UYPP2XT2YUFV", "Overall": "3.0", "Content": "This TV has a great picture and it is easy to set up but there is no FM RADIO like it says on the item description. This is one of the reasons I decided to buy this one since I like to listen to fm radio. The manual doesn't say anything about an FM RADIO so what is the deal AMAZON. I am an electronics technician and also have my FCC license, so I think I know how to tune in a fm radio. Otherwise, the tv is great. Would be a 5 star if it was as described.", "Date": "June 8, 2013"}, {"Title": "very few nos of ports available", "Author": "pop richards", "ReviewID": "R1RYCZGG9R7L0U", "Overall": "3.0", "Content": "The clarity is good, light weight, apps are fairly there but not android.There is no PC connection and only 2 HDMI ports. Composite / component ports are BAD.", "Date": "August 12, 2013"}, {"Title": "Above average", "Author": "Allen \"A. Z.\"", "ReviewID": "RQQHLOBAPP1VW", "Overall": "3.0", "Content": "I bought this at Best Buy as open box item, it was a good deal. I used it for about a week, then returned it.Here is why:This is a great product for Sony no doubt about that. At the first two days I loved it. Later on I started using is to play my PS3, watching Blu-ray movies, playing computer games, I realized there are few problems with this Sony TV.First of all, the color problem, the color is too bright for your eyes (like Sony always be). Personally, I feel Sony's color is not accurate as LG or Samsung.Second, if you use it as a computer monitor, that's brightness issue would bother your eyes.Overall, this is a decent product for Sony, stylish design, great picture quality, If you just use it watch TV or movie, this is the one for you. by the way the Blu-ray movies run amazing on this machine, it looks like it's 120 hz TV.", "Date": "July 7, 2013"}, {"Title": "It didn't work at all", "Author": "Michigan Fisherman", "ReviewID": "RUTPR4CXDT90G", "Overall": "1.0", "Content": "Received tv, opened the box and noticed the packaging styrofoam was broken on one corner.  When I powered up the tv, all I saw as hundreds of multicolored lines coming from the top of the screen.  When I closely examined the screen, I could see where there was damage internally to the screen.  Bottom line, the tv box must have been dropped on it's corner at some point in the shipping process.  The only good thing is, Amazon stands behind their items and are shipping me a replacement.  I certainly hope that the replacement is not tossed around and broken when I get it.", "Date": "January 12, 2014"}, {"Title": "Awful image!! Cheap Led tv!", "Author": "pamb", "ReviewID": "R10D5473GZSHV", "Overall": "2.0", "Content": "I bought this Led TV based mainly in Amazon's reviews, I was between this led and the Parasonic TC-L32XM6, or Samsung UN32EH4003.Image of this Sony Led TV is awful!! I tryed everything to make it improve but was worthless.It's a shame that I can't return it.", "Date": "September 23, 2013"}, {"Title": "The TV is Okay", "Author": "prakash", "ReviewID": "R1UHQA2VEOV48V", "Overall": "3.0", "Content": "The TV is nice functional TV it does not have WI-FI and internet connectivity, this is a drawback in today's world. A Great TV if the only thing you want is to see the TV channels , Nice picture and Sound.", "Date": "August 12, 2013"}, {"Title": "What a Nighmare", "Author": "S Stocks", "ReviewID": "R3AN4XUDSZ960O", "Overall": "1.0", "Content": "Amazon was wonderful about the delivery time.  The TV was easy to setup and very lightweight, however, got it hooked up to DirecTV High Def and the picture was somewhat blurry.  Amazon said it was an LED TV (more money than the LCD's).  The box said LED, the sticker on the back of the TV said LCD and the documentation said LCD.  I read some reviews that said to wait a day or two, which I did.  No better.  Also, the black was not a deep black, but faded in and out from black to somewhat darker grey.  No amount of color adjustment seemed to help.  Returned the TV, the Sony DVD Blu-Ray player, and HDMI cables that were also on the order, with it as well.  First Amazon CS Rep took the information and said she would check into it and call me back.  Two days later, still nothing, so I called Amazon.  Twice got someone from a foreign country and finally asked to speak to a rep in the United States.  Got Beverly in the U.S. and she was very helpful.  She immediately sent a return shipping label via e-mail.  Packed up the whole thing, with original packaging and took to UPS store for return but deliveries didn't go out until Monday (this was Saturday).  Since I was told that I wouldn't get a credit until the package was received in their warehouse, I wanted it shipped out ASAP.  Took to the Phoenix UPS hub early Monday morning and it was only open from 4-7 pm.  Really?  Ended up going back to the UPS Store.  The whole shipping thing was a nightmare.  Will just go to Walmart next time and physically see and buy the TV.  A lot less headache.", "Date": "October 8, 2013"}, {"Title": "TV no connection to internet", "Author": "giraldo", "ReviewID": "R37HWQ4X2BM8JC", "Overall": "2.0", "Content": "It cant be connected to internet.It is a nice tv set but no connection to internet.It can not be plugged.", "Date": "December 16, 2013"}, {"Title": "inflated price", "Author": "Edward Newman", "ReviewID": "R2Z99X6QM56LYD", "Overall": "3.0", "Content": "I had intended on ordering this TV but the price went up,so thats that. I dont need it I just wanted it.If the price comes down I will order it . If not I will maybe buy it somewhere else.After looking around I found out that WalMart is selling it for $278.", "Date": "July 30, 2013"}], "ProductInfo": {"Price": "$348.98", "Features": "Amazing picture quality with impressive 720p HD clarity\nDirect LED for a bright picture and slim design\nSmooth movement with Motion flow XR 120\nTV without stand (Width x Height x Depth): 28.9 X 17.4 X 3.2 Inches, TV with stand (Width x Height x Depth): 28.9 X 18.3 X 6.5 Inches", "Name": "Sony KDL-32R400A 32-Inch 60Hz 720p LED HDTV (Black) (2013 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/51kODX81mxL._SX300_.jpg", "ProductID": "B00AWKBZOI"}}