{"Reviews": [{"Title": "Great Gaming TV - Great TV for Anything!", "Author": "Jonathan J. Bobal", "ReviewID": "R2H1138N1Z9J8U", "Overall": "5.0", "Content": "Great Gaming TV - Great TV for Anything!I recently returned a Panasonic ST60 due to extreme lag while playing video games - and yes, I was obviously using \"Game Mode\" - It made little difference. You can verify this lag on YouTube video reviews.I bought this TV based off a review I found online stating that the input lag was superior compared to other models - despite the 120HZ nature of the TV, which is supposed to INCREASE the lag, as can be seen by the external site, all comparable tvs are all 60HZ.Regardless, this TV has great clear picture, and has exceptional lag that rivals computer monitors, allowing me, and you, to watch sports and play videogames without issues.Please take the time to \"Like\" this review, as that will be my only \"Payment\" for trying to help!Any questions, please ask away!Kind Regards,Jonathan Bobal - Piano Teacher - Hardcore Gamer", "Date": "June 12, 2013"}, {"Title": "The VERY BEST HD TV out there. I know I own 7 of them", "Author": "cjre", "ReviewID": "RPKKLWCUS1UF1", "Overall": "5.0", "Content": "This TV by far is the very best on the market. I am a TV buff and IT Doctor. I know TV's and computers very well. I also have a keen eye for detail and artifacts. This TV is very good 5 STARS. There are three major great brands of TVs in the world today and Sony is ranked high on the list. Sony beats Samsung in all areas. Please compare side by side Samsung is a cheaper made TV.Sony uses good parts from Japan. Samsung does not. I picked on Samsung because they are direct competitors with Sony. I do have Samsung TV's, but the higher end ones. Still Sony beats color, gamut, features, sounds and looks.The picture will blow you away. SIMPLY AMAZING!! BREATH TAKING!! The sound on this set is better than on most other TVs. The speakers are actually pointed in the front and not the rear like most LED TV's so you can hear the voices clearly. The base sounds great too.The stand is very strong.The Bezel is very thin, but strong and sturdy.The black colors are very dark in detail like in a plasma display and in fact the greys are perfect. The whites are super white.This is the way an HD panel should be.I am glad that I researched this TV for weeks before I bought it.", "Date": "June 10, 2013"}, {"Title": "Very good quality, worth the money", "Author": "WDZTony", "ReviewID": "R3RI38AGCAC26Q", "Overall": "4.0", "Content": "OK, first things first - this review might be a little biased, since I am a devoted fan of Sony LCD TVs. (though, I find my dedication well deserved). I'm not an expert, rather a regular consumer, however, for a couple of years now I had a chance to exmine a range of Sony KDL models of different lineups, so I decided to share my feelings about the newest one.I recently tested a 47-inch KDL-47W802A which replaces a 2012 Sony KDL-46HX750 (which was a middle-shelf model, presumably the most popular one, giving an attractive quality-to-price ratio). Most likely the new one will gain similar popularity.So to cut the stroy short:LOOKS:1. The TV itself is thinner and lighter compared to KDL-46HX750 model.2. The sreen frames are thinner, so the TV looks cooler (still not as cool as the frameless Samsung).3. The passive 3D glasses are lighter than the old ones and they give you a pair with the TV.4. The stand looks nice, especially compared to the last-year bizzare half-stand / half-lousy-soundbar. If you want to put your screen on the wall, you don't feel like throwing your money away for the stand with built-in speakers.5. They give you two remotes, a regular one and a small, basic-buttons one (with extra features - read below).SOUND:1. Forget about the built-in speakers and buy a decent speaker system (or a soundbar at least).PICTURE:1. Picture quality has not really changed for a couple of years now, which means it is still superb. The TV delivers live, bright, super-clear and sharp picture. In may opinion the best in the LCD segment. The only flaw with this particular model are the black levels, which are not as deep as you get in higher models - HX850, HX950 (or whatever they will be called this year) or as in Panasonic plasmas. In my opinion, this is the only real difference between this model and the higher ones. I am used to watch my HX900 (a 2010 model) and I really notice the difference in  black deepness. Anyway, at least you know on what you save buying cheaper model.2. KDL-47W802A has a X-Reality PRO engine, which KDL-47HX750 lacked. I don't see much difference, but my friend does, so you may count this as an improvement.3. The 3D picture is absolutelly superb. It much depends on the content of course (some 3D blurays are unwatchable), but this year lineup delivers the best 3D you can probably get on the market. I watched the Avenegers and Prometheus and I was astonished. Almost no ghosting.OTHER FEATURES:1. The menu navigation is much simpler and user-friendly than with previous models.2. The TV obviously has all the Netflixes, Hulus and Pandoras you need.3. The smaller remote supposedly has this extra feature that when you put your smartphone on it, it reflects the smartphone screen on your TV display. I have not tested it yet, so I'm just highlighting that there is such a thing.4. The other feature which I haven't yet tested (I will update this review when I do) is this double-view from different angles. This works with some PS3 games (or maybe other consoles as well) and allows two people to play games (for example car racing), watching simultaneously different scenes without dividing the screen. They must wear 3D glasses and watch from different angles in order to do it.OVERALLKDL-47W802A is overall a great TV, a top-class in its segment. I gave it 4 stars though, beacuse you can probably get comparable quality for a little less money. I also think that the black levels should've been deeper. Moreover, the new lineup is not a significant improvement over the previous-years models. On the other hand, however, the  competition also doesn't offer any great improvements. So, if you want a really big change, wait until 4K gets cheaper. If the black levels are really important to you - buy a higher model or a Panasonic plasma.", "Date": "April 23, 2013"}, {"Title": "Great Gaming TV - Great TV for Anything!", "Author": "Jonathan J. Bobal", "ReviewID": "R1OXL5V0S0N9J7", "Overall": "5.0", "Content": "Great Gaming TV - Great TV for Anything!I recently returned a Panasonic ST60 due to extreme lag while playing video games - and yes, I was obviously using \"Game Mode\" - It made little difference. You can verify this lag on YouTube video reviews.I bought this TV based off a review I found online stating that the input lag was superior compared to other models - despite the 120HZ nature of the TV, which is supposed to INCREASE the lag, as can be seen by the external site, all comparable tvs are all 60HZ.Regardless, this TV has great clear picture, and has exceptional lag that rivals computer monitors, allowing me, and you, to watch sports and play videogames without issues.Please take the time to \"Like\" this review, as that will be my only \"Payment\" for trying to help!Any questions, please ask away!Kind Regards,Jonathan Bobal - Piano Teacher - Hardcore Gamer", "Date": "June 12, 2013"}, {"Title": "Excellent TV for all forms of entertainment", "Author": "Jeff M.", "ReviewID": "R11I1O6PGYGAV1", "Overall": "5.0", "Content": "The design of this TV is fantastic. From the thin bezel to the subtle blue chamfer everything just works and it looks great hanging on my wall. In my opinion Sony has the best video/image processing available and it really shows with this TV. Motion is smooth, colors are accurate, and the TV allows you to tweak these settings to get it just right for you.I do quite a bit of gaming on this TV and let me tell you from doing my pre-purchase research this is one of the best TVs available for gaming. It has the lowest input lag on the market. Meaning gaming input translates to the screen in record time and translates into a smoother more enjoyable gaming experience.I highly recommend this TV.", "Date": "August 5, 2013"}, {"Title": "Skeptic... at first.", "Author": "KJ", "ReviewID": "R1Y56GPOWJMTA5", "Overall": "5.0", "Content": "At first i was really excited about this TV from all the great reviews for gamers. I had a decent samsung 42\" and this was my replacement. I started playing twitch based games like BF4 and COD right after setting it up. At first there was a difference in the feel of the game. It felt weird to play due to the 120Hz and even the 1080P (both of which my samsung didnt have, 720P). Maybe it was just me getting used to it but after a couple days I loved the definition this TV brings. I'm not a TV expert, but I have played video games a large portion of my life (sadly) and this TV is truely worth every penny.I have yet set up the TV with internet but I did try out the 3D features and WOW. just WOW. If this TV couldn't impress me more, it did with the 3D. Overall great buy. Highly reccomend this purchase for gaming, casual TV and movies.", "Date": "December 6, 2013"}, {"Title": "You won't be disappointed", "Author": "Prod1060", "ReviewID": "R1RXBNWHD2I38Q", "Overall": "5.0", "Content": "I purchased this TV for its exceptional input lag rating.  As a gamer, I put off making the leap from CRT to HDTV for many years due to the fact that most HDTV's have terrible input lag that affects response time and lag.  Then Sony released this model that was rated around .17ms of input lag, which is actually more in line with gaming monitors than it is with an HDTV.  When I got it home and hooked it up I wasn't disappointed.  I am hyper sensitive to input lag and I cannot feel ANY when playing Xbox on this TV.  Its almost unbelievable.  I only wish this TV had come out years ago.  As far as the picture quality goes I was pleasantly surprised.  The picture is sharp, vibrant and smooth.  I really cannot think of one notable blemish at all.  The only thing I can think of that isn't perfect is the sound, which isn't bad, just marginal (like most flat screens are these days).  If you are thinking about buying this TV, don't hesitate.  You will not be disappointed, especially if you are a gamer.", "Date": "November 17, 2013"}, {"Title": "Excellent quality, and sturdy.", "Author": "Richard J. Kirian", "ReviewID": "RYHSHNXGJRLIZ", "Overall": "5.0", "Content": "Excellent quality, and sturdy.  The Sony KDL-55W802A has an excellent picture. It is obvious the TV was designed for high definition.  I initially has some distortion when I turned on the TV.  Once the satellite company installed the HD service the picture was perfect.  Recommend with HD service for best performance.", "Date": "February 4, 2014"}, {"Title": "Great TV", "Author": "Amit Kumar", "ReviewID": "R310BLQ41W237A", "Overall": "5.0", "Content": "I really like the picture quality on this TV. I find the colors good and realistic, and the TV is plenty bright as well. I also own a Samsung TV and I would say that the picture quality of this Sony TV is better. The smart TV interface is easy to use, though I haven't used any apps besides Netflix, Amazon or Youtube. I have watched some short 3D content on this TV and it works well. Overall, I would say that I am satisfied with this purchase.", "Date": "January 26, 2014"}, {"Title": "Excellent picture quality", "Author": "Mr. Alan Clark", "ReviewID": "R34M8IANPU4OVN", "Overall": "5.0", "Content": "Although not as inexpensive than several other manufacturers, Sony has for many years been my choice. This TV is rich in features and lives up to my expectations. The picture is clear with excellent color and the 3D capability really does bring that added dimension to action movies.It was easy to connect and worked exactly as described. The on screen switching allows for easy selection of any of the various inputs. I have, with the use of the 4 HDMI inputs, along with additional RCA switches successfully connected a PS3 console, Roku unit, WII console, a VCR, a DVD recorder, 2 Blu Ray Players (one 3D capable) and my cable box. I can easily switch the sound output to a HI-FI receiver via the optical connection or rely on the TV's own speakers.My only negative comment on this unit is the relatively poor sound output from the built in speakers. However, I am extremely satisfied with my purchase and would have no hesitation in recommending it to others,", "Date": "June 27, 2013"}, {"Title": "For gamers and movie night, reflection a bit annoying", "Author": "ArtS", "ReviewID": "R10K6OCXVIZ25G", "Overall": "4.0", "Content": "When it comes to the picture it depends on the source. I think this tv looks amazing I got the 55in $1400 almost a year since it was released in 2013. What people say about reflection is true but it doesn't bother me, I got it for movie \"night.\" If I'm watching sports during the day it I'm not to focus on the blacks and stuff, I agree it could bit more blacker during the day but I don't know if that is a realistic expectation in a bright room. The viewing angle is pretty good, you may also rotate the screen a bit which is convient when I'm doing things in the kitchen. It's also great how seamless it is to go youtube. I know most tvs have youtube apps but I feel this tv beats them in the load time and navigationI also want to mention the reason why I chosen this over the popular plasma from panasonic is input lag. I am a gamer and I have been over people houses with beautiful tv but the input lags make fighters and shooters almost unplayable. I didn't do thorough side by side comparison for pictures and you can't really compare tvs in store because they are all set to full blast, you gotta do it in a dark room. When people talk about blacks and colors they may be a bit to picky about it, this tv is beautiful. I read on cnet that this tv is decent, if this tv is decent I'm really curious how amazing looks like. I have a slight regret I could of went a little more for the KDL55-900A, my budget was around $1k so I was stretching it going for $1400.Bottomline, reflection can be a bit annoying (just close your blinds, doesn't effect movie night), best tv for games (input lag), breathtaking picture IMOUpdateI just wanted to update how I still love this tv but now I can say it with confidence after viewing several tv shows and movies. I toyed around with the settings my only tip would be maybe backlight higher and adjust cinema color to normal instead of warm. Warm makes everything yellow.Reflection is annoying! It's starting to get to me, me and my wife have a joke that we wave to each other at the start of a movie cause its a mirror. You gotta turn the lights off and cover the blinds behind you. Why did they do this? The refection takes into effect when watching dark movies during the day. Sports games work fine because they are bright already bright.Blacks and colors on this tv is incredible. Pixar movies never looked better. The problem is the range with accordance to the black bar. If your watching a fullscreen movie your never going to notice anything. But during bright scenes the black bars don't hold because of screen dimming it raises the entire backlight to meet the colors. Thus when watching a bright movie the black bars stick out, this is a rare occurrence . I was putting in some of my older blu rays to test things out and the quality of image mostly depends on your source. So before you blame to the tv make sure your blu-ray picture rating is high.3D is dumb, everyone says this and I have to agree it is really dumb. I think when they developed 3d technology they fail to realized when you got an amazing picture, it looks real. At 55 in, you feel like you can touch it. My wife says we aren't watching any horror movies on this tv. 3D gaming is dumb as well, it adds nothing and gives you headache.Side note Picture In Picture is really slick - I can watch tv while I'm installing/downloading games on the ps3, also you can use your iphone as a keyboard to enter in data(tv side view).I wish i can give this tv 4.5 stars, it's near perfection. I would spend a bit more to get the 900A for the slightly improved picture. The only tv for gamers and with reflection, close the blinds behind you!", "Date": "February 3, 2014"}, {"Title": "Wonderful picture quality, compared to Samsung", "Author": "Larson Juhl", "ReviewID": "R17IOEYEPBZLOQ", "Overall": "5.0", "Content": "Today I returned a brand new $1300 Samsung UN46F7100AFXZA TV to Best Buy after my wife and I had spent more than an hour tweaking every possible setting to try to make the picture acceptable.  It proved to be impossible to get the Samsung's picture to look as good as that of a 5-year-old Panasonic HD TV located nearby, which was connected to the same DISH feed.  I then bought this Sony 47-inch TV, and the picture is gorgeous, at least as good as that of the old Panasonic, right out of the box, with no tweaking required.Yes, we had to give up on our idea of accessing Internet content easily with this TV - even the salesman at the Sony store admitted that the Internet experience is slow and frustrating.  However, like most people, we use our TV primarily to watch TV, DVD's and streaming video.  If a TV can't provide a top-notch viewing experience for that kind of content, what's the point of buying it?It seems that Sony is still far ahead of the competition in its ability to design a TV screen with just the right colors, light, contrast, sharpness and so forth.", "Date": "January 17, 2014"}, {"Title": "Very satisfied.", "Author": "aristophones", "ReviewID": "R3V5BTDFWCX5U7", "Overall": "4.0", "Content": "First ever review on Amazon.  My family just moved and it's been years since we upgraded anything so this was the time.  I read and researched all LED/plasma competitiors and decided for my viewing TV I wanted a Panasonic VT60, but I also needed a 2nd TV for a bright southern exposure room where the playstation was hooked up.  I didn't want plasma for a gaming TV and given the lighting conditions LED was the way to go.  It came down to this one and the LG 7400.  After oodles of research I chose this one.  Can't compare it to what I don't own, but I'm very pleased with the Sony.  Picture is great, I like the 3D and it's a great gaming unit.  My satisfaction with the set is five stars, but I gave it four as the Vizio M501-A2R is similar at a better price point.  For most folks that's probably the choice, but the differences were worth the $ upgrade to me.", "Date": "November 22, 2013"}, {"Title": "The best TV I've owned to date", "Author": "M. Daneker", "ReviewID": "R3RRP42NQ44WUQ", "Overall": "5.0", "Content": "Let me state upfront, I never, ever impulse buy a TV I put months into seeking cost  V quality / features before I buy.So first of all let me state that sony was an upfront option because it goes with my receivers and PS3 in the most effortless way, but that wasn't all. My first wide-screen was about ten years ago, a 42 Bravia 3LED LCD projection that still works and still looks great to this day. My second was a 46 LED LCD flat that suffered a crack in the top glass that sent some small slits across the glass (not the screen) but still looks amazing when viewed head on.So my idea was to get another 46 / 47 in to replace the one I lost, but at only $200 extra I got this and it's excellent.First of all you have to take the time, and tweak and tweak and tweak your set. Subtle difference in contrast, back-light and color temp (all of which can be set with 6 sliders, two for each color) until you just never think about the picture and are just enjoying.Second, forget 4K or 240hz, etc it's all bloated $$$ at this size range. From 5ft and further a 4k and 1080p look identical.Third, put on the the 3D. I got excellent 3D from my Fios service and mind-blowing from blu-ray. The passive glasses are 100X better than active, light, cheap and easy to obtain and replace and even the toddler gets a set that fit him. Shockingly the simulated 3D is a real wonder, it adds about 30% depth to ANYTHING. I tried Spongbob and Hellraiser on blu-ray with equally shocking results.This TV is LIGHTER than my 46\". I was able to mount it without help (now I do have a 74\" finger to figner span being 6'2\" tall so short people might need more help) and hang it in place in about 20 min.The aluminum bezel is an add-on. I think, litteraly, after the previous edge-to-edge glass design they realized a minor chip can splinter the entire screen (like mine!!!) and added the aluminum frame. I like the blue highlight but up close you can see the corners aren't folded and it overlaps a bit making it seem an add-on.Over all I paid $400 less than for my 46\" and am 100X more pleased.", "Date": "February 17, 2014"}, {"Title": "Great picture, excellent response rate for gaming", "Author": "CHW \"Hoarder of Fine Goods\"", "ReviewID": "R2MG27ZUWZ42Y7", "Overall": "5.0", "Content": "I picked up this TV from BB after doing tons of online research, in-store viewing comparisons, and asking around.  I originally got a Vizio M551d at $500 less, which has a sharper picture in my opinion.  However, the Vizio's menus were much laggier.  Oh, and the Vizio's picture went out 23 hours after I got it (apparently a common problem with Vizios using crappy capacitors).So I returned the Vizio and got this one after reviewing product quality reports and asking store employees about which brands are returned most.  Sony has a pretty consistent track record, and I don't own a single Sony product that's ever malfunctioned on me.  I think the main reason for a lot of the mediocre reviews on this TV is the price - sure, you could get fancier features for less money, but I'd rather have one decent set that will outlast multiple cheaper sets (my 32\" Toshiba LCD is still going strong after 8 years).Pros: solid build, very pretty finish. Menus are responsive, similar layout to PS3/4, PSP, etc. Smart features work great, very sharp picture for devices like DVD players, gaming consoles, etc.  Cable TV through hdmi is fuzzier, but that could be my crappy cable box and provider.Con: much more expensive for comparable TVs with similar features.If you don't mind replacing your TV every four years or so, by all means get a Samsung or cheaper TV that offers more features for the dollar.  If you're lazy like me and don't want to mess with all that, get a reliable Sony instead.  I'll update this rating if it gives me any issues down the line.", "Date": "December 25, 2013"}, {"Title": "Fantastic HDTV", "Author": "Bacchus", "ReviewID": "R3PMYPBIR9YFTB", "Overall": "5.0", "Content": "Awesome TV. Picked it up at Best Buy last weekend. Set up is dead simple and the picture quality looks fantastic right of the box. I did some research on settings on the internet and was able to tweak the picture to near perfection.HD is just insane on this TV. The picture just jumps right off the screen. Regular SD channels look ok but of course not nearly as good as the HD channels. The 3D is great and the TV comes with four pairs of light weight glasses that are comfortable to wear.Video games is where this TV really shines. It has the lowest display lag of any large HDTV and it makes a huge difference when playing games. Once you play using this TV you will never be able to go back.The TV is expensive but I really do think it is worth every penny.", "Date": "November 21, 2013"}, {"Title": "For a $1.2K 55' class, this thin mama can really cook.", "Author": "Alex Wurfel", "ReviewID": "R1FU4OP8XMRLGP", "Overall": "5.0", "Content": "I purchased this TV a few months ago for around $1,200, the delivery was fast and secure and the TV was a breeze to set up (like any other modern TV really, I mean... it's not the 80s anymore). I use it primarily for gaming, movies, and streaming services, and it delivers very well on all fronts for the price. The picture quality is highly adjustable, the speakers, for a flat screen of it's size, are very impressive, but as always you'll want something with more oompa.The color ranges aren't top of the line, but remember, this is a name brand 55 inch 3D smart TV for just a shot over 1K, so if you're that picky about how \"true\" your cyan is than this probably won't be for you, just spend the extra money. The 3D effect is on point, very crisp, I saw very few ghosts and the like and it seemed on par with most other high end 3D capable sets I've seen, and it's passive, so you'll save money on pain relievers to make those active bred headaches melt away.The sound again is impressive for a set this thin. It's got some bass to it and decent depth, but it's a flat screen all the same, if you have speakers, use em.As far as gaming performance this thing has no discernible input lag, even compared to my old CRT. I'm serious. Really. I've been playing Titanfall on it for the Xbox One and have had zero issues with the gaming mode on, it's smooth as butter and crisp as a piano key. If you're a gamer looking for a mid range set, this is your pony.The smart features are good. Not horribly intuitive, but they don't really have to be. It has a dedicated Netflix button, that's all 70% of us need to see. The other apps are accessible in a few ways, if you've waded through a windows folder full of pictures you'll feel right at home.The remote isn't anything to write home about, but I don't really use it anymore, I use my Motorola Droid Razr HD Maxx Super Crazy Verizon Mortgage Payment Phone as a remote and the integration is very nice, the app loads quickly and connects fairly fast, and of course has more features than a European capital city.All in all, I'd give it a 4.75, but we'll just round it up. For the price, especially if gaming is your bag and you enjoy occasionally watching an Australian hunter get eaten by a velociraptor face first in eye popping 3D (clever girl), you certainly will have a friend in this TV.Oh, and the stand is pretty.", "Date": "April 23, 2014"}, {"Title": "Retro game connoisseur? Fighting game enthusiast? First-Person Shooter pro? Look no further.", "Author": "Christopher", "ReviewID": "R2V34SSWSVNRJT", "Overall": "5.0", "Content": "The Sony Bravia model offers the lowest input lag on any television on the market, and just for that, it's worth the price of admission. At 17ms of lag on the \"Game\" setting, you will not find a better HDTV for those who consider lost frames an issue. This was the biggest factor in deciding on a TV, and I've not looked back since its arrival. It helps that the picture quality is fantastic, and the bezel is thin and super sleek.The sound can be better, but that's to be expected.Super happy with this TV.", "Date": "January 21, 2014"}, {"Title": "Love our new TV!", "Author": "Jackie Gililland", "ReviewID": "RRUHROXE9CHZJ", "Overall": "5.0", "Content": "Brighter pictures, more channels, 3D works great, can't believe we waited so long to get it!  Love, love, love it!", "Date": "October 5, 2013"}, {"Title": "Great HDTV", "Author": "Roberto Rivera", "ReviewID": "R300CLLOJUM2PK", "Overall": "5.0", "Content": "This is a great 3D HDTV. Very sharp image, 3D looks great with the supplied glasses. Sound could be a little better, but that is not a big deal. I play movies through my home theater system.", "Date": "September 23, 2013"}, {"Title": "Has major software problems that Sony still has not fixed", "Author": "Amazon Customer", "ReviewID": "R2XGSWJRN4R6RS", "Overall": "1.0", "Content": "Sony should fire it's IT programmers and quality assurance team. They put this TV on the market with major software bugs which they still have not fixed. You cannot stream movies from streaming sources such as Amazon or your local LAN media server. The movie will play about 25 minutes then lose the connection. They have a major memory buffer overflow problem that prevents streaming once the memory buffer is full. Their Blueray player works perfectly. So if you don't have a Sony Blueray player to pair with this TV you won't be able to stream to it. It's a shame because it's a pleasure to view the TV.**Update 1/10/14 - The streaming from Amazon has now been fixed with a new update to the software. I haven't yet retested streaming from the hard drive attached to my router. There have been some major bugs in accessing that network storage and the media players on my network PCs. I will report back once I've attempted to use them again.**Update 1/18/14 - Well so much for that software update. The streaming problem didn't go away.. After going back to using the TV for streaming Amazon the problems resurfaced. Restarting more than a dozen times during a one hour long show is totally unacceptable.  I've had to return to using the Blueray player for streaming. The TV software is still slow and broken.", "Date": "December 30, 2013"}, {"Title": "Mets expectations and then some", "Author": "Ron, ILL", "ReviewID": "RNUW8U0X34OSV", "Overall": "4.0", "Content": "I must admit I am very pleasantly surprised.  Picture is excellent, its easy to move around the different functions.  It looks rich and well made. The only thing missing and this is industry wide, and that's a keyboard. If you're going to give someone access to the internet then we need a keyboard.I would have to add the only \"CON\" which is a pretty BIG one. You can only steam videos from the few apps that are available. You can't just go to a web site and steam from the site, it has to be from one of the apps they offer, and the apps list is pretty slim.If you have a smart phone or tablet with a HDMI connection you can play thru either of them. But once again you have to connect and have cables which is one of the things I was hoping to get away from.I bought the same size TV made by a different brand \"Samsung\" and I can stream and watch whatever I want from any site I choose.Most sales people don't seem to be very knowledgeable about these products, so you have to do much if not all the research on your own.", "Date": "March 18, 2014"}, {"Title": "Nice picture", "Author": "Tommy Wu \"Tommy F.\"", "ReviewID": "ROX3NQD6WCEHB", "Overall": "5.0", "Content": "The picture was much nicer than I expected.  I have a 55\" Samsung, 8000 series in another room and although it appears to be slightly brighter, the Sony's picture is clear and more real life.  Connection to the web was easy and I have been able to stream videos from Netflix (wireless) without any issues.  My Verizon router is located approximately 25 feet from the TV.  It is thin and the stand appears to be very stable.  I have it set on a TV console.", "Date": "March 4, 2014"}, {"Title": "Great TV", "Author": "Chetan Kumar", "ReviewID": "RANYCTWGQCK2K", "Overall": "5.0", "Content": "I am big fan of Sony TV and this one did not disappoint...great picture, host of feature and looks really good in the living room", "Date": "December 18, 2013"}, {"Title": "Excellent tv for gamers", "Author": "Daniel Furcolo", "ReviewID": "R1M9N4FWBXTLG1", "Overall": "5.0", "Content": "Excellent tv, I have a ps4, ps3 and Xbox one and work perfectly whit all thisFully recommended and good price", "Date": "February 5, 2014"}, {"Title": "WOW! This TV is incredible", "Author": "Steven J Erber", "ReviewID": "R2TAF4PW8GH1AQ", "Overall": "5.0", "Content": "Two days before The Rose Bowl (MSU vs Stanford) my 6 year old Samsung decides it's had enough and won't turn on. Amazon Prime to the rescue. Not only did they stock the model Sony I needed to fit my custom made walnut cabinet, they shipped it next day air for $15.00!This was my first year as a \"Primer\" I'm hooked. Amazon really  came through in a crunch and I had my Sony installed before the big game on New Years and as a topper the Spartans won.You guys rock.", "Date": "January 13, 2014"}, {"Title": "amazing hdtv", "Author": "comcast hal", "ReviewID": "R2NU9JZ01V5SLA", "Overall": "5.0", "Content": "great hdtv. amazing graphics. while watching tv in 3d it feels like something will come out of the tv and hit you. make sure you hook the tv up to a good sound system. i have min hooked up to an onkyo receiver and paradigm speakers. WOW!!", "Date": "July 29, 2013"}, {"Title": "Great TV, It Exceeded My Expecations", "Author": "jemmedia", "ReviewID": "R2H0EALHTB822A", "Overall": "5.0", "Content": "Incredible picture, easy setup. I love this TV. The sound on mine is very good (even with the nearby door to the patio open), there is no need for a sound bar. The sound from my music and videos when I stream through my Apple TV from my computers or iPhone is loud and  clear stereo, not tinny at all.  I don't have any problems with reflective glare and it's in a room filled with light from large windows and a glass patio door.I had a professional service unpack and set it up. It took them all of 15 minutes, and in another 15, they had set up all the features, paired the remote, turned on home sharing and showed me how to operate everything. I have it hooked up to a Comcast box, Apple TV and a Sony blu ray player. It's really good looking  in my living room. It's replacing a 37 inch Sharp Aquos, which I loved, but after moving, I needed a bigger TV for the space.  It fits perfectly on the 42 inch wide stand that the Sharp sat on.I got it though Amazon, but first went to the Sony store to look at it. One sales associate told me several of the employees there had bought this TV. At least three raved about it. (I think they may be gamers, which I'm not, but still, they were right.) I haven't tried the 3D, and don't know if or when I will, but for regular TV watching, including sports, music, videos and movies, I think this is a great TV. I almost didn't buy it because of the reviews here about the sound and glare, but I'm so glad I did.", "Date": "November 15, 2013"}, {"Title": "Nice looking TV with some flaws", "Author": "DrReview12", "ReviewID": "RJUDSJ9X6P5OR", "Overall": "4.0", "Content": "It is a nice looking TV with some flaws. Pros: design, connections, colors, internet. Cons: reflective screen, noticeable \"blur\" when watching sports, complicated settings.This TV looks great and has plethora of connections. For me the colors a superb for this price point and the internet apps work well over wi-fi. However, the screen is almost like a mirror, which I am not a big fan of, and then watching sports with \"Standard\" mode selected there is an effect that I can best describe as fixed clouds on top of moving picture below. Settings are way too complicated for someone who is not \"into\" playing with picture setting and they are not easily accessible, not to mention that there are tons of them.I will need to research on the internet how to get better picture with this TV as standard settings a lacking.*UPDATE. Bumping the score to 4 stars from 3. Reason, Scene Select (look at comments) really helps out with picture quality, it is a must if you want proper picture. After Sony's latest software update I feel like the picture got even better. The only reason I am not giving 5 stars is glossy screen and average remote.", "Date": "November 28, 2013"}, {"Title": "Gamers buy this", "Author": "Zachary H. Davidson", "ReviewID": "R2XWBFGDCKOGB7", "Overall": "5.0", "Content": "Best TV for gaming love it and I'm not a big Sony buyer but good job on this tv game lag is like 16m", "Date": "October 18, 2013"}, {"Title": "Great TV", "Author": "B. Greenstone", "ReviewID": "RPZ9702W72ICL", "Overall": "5.0", "Content": "Really great contrast range.  The blacks are very black, and the brights are blinding.  The passive 3D works much better than I expected, and as long as the 3D content is of good quality you don't notice the resolution drop.  I think I like it more than any active 3D that I've seen.  The TV has lots of settings and modes, but I've found that the defaults are best in most cases.  Very sharp picture with good saturation, but not overkill.  My only beef with the set is the somewhat limited number of inputs on the back, and only one output:  optical audio.  There are no analog RCA jacks for output.", "Date": "October 4, 2013"}, {"Title": "Amazing tv", "Author": "Richard Carr \"Berry\"", "ReviewID": "R147G67ZOO7L4G", "Overall": "5.0", "Content": "This tv Is one of the best I've ever owned and I loved everything about it. I highly recommend this tv.", "Date": "September 15, 2013"}, {"Title": "Beautiful picture", "Author": "Ceney Dobler \"Ceney\"", "ReviewID": "RFTYUM4NSXCIC", "Overall": "5.0", "Content": "The clarity of the picture couldn't be any better!  We did find it a challenge to get it set up and discover all the features that are on the TV but then we are in our 80's and had the help of our cable company.  Now that we are familiar with the features we are enjoying watching the programs, especially the animal  and national geographic channels.", "Date": "May 23, 2014"}, {"Title": "Great color", "Author": "Kenneth S. Callicutt", "ReviewID": "RSE27KIYJ4N3S", "Overall": "5.0", "Content": "The color is great and it interfaces very well with an receiver and speakers.  it turns on the receiver when the Tv is turned on.  I have an Onkyo receiver.  The only drawback is if you have lamps or lights behind you on at night, it makes green and red balls of light from the reflection.  Turn off the lights and it is fine.  No problem during daylight with reflections.  Internal speakers were even Ok but I have a receiver with Bose speakers and the sound is great.", "Date": "April 26, 2014"}, {"Title": "Standard model", "Author": "Blumonte", "ReviewID": "R249JTHGZOY07I", "Overall": "3.0", "Content": "Received T.V in good condition,but was disappointed in it's performance.The T.V.has a blurring effect when adjusted with increased contrast and picture controls.Sport picture mode is not useable because of the blurring effect when sharpness is adjusted for a clear picture.I would return this T.V. for a upgraded model,but unfortunately the item is not returnable from this merchant.", "Date": "April 23, 2014"}, {"Title": "I LOVE THIS TV!", "Author": "C Stew \"sublyme guy\"", "ReviewID": "R3IJUFTB2ZKK5", "Overall": "5.0", "Content": "I bought this TV primarily to game on with my new Xbox One. It is exceptional in that regard as there is virtually zero input lag. It also excels for HD programming as well, but as another reviewer was kind enough to point out, you will want to disable ALL noise reduction features (regular, MPEG, Dot), then disable Cinemotion and Motionflow, because if you don't, you will notice some pretty bad jitter. I am very happy with my purchase. I did considered giving this 4 stars instead of 5 because the speakers suck, but you can say that about most built in TV speakers, and with the money I saved on this high quality but inexpensive TV (paid $1098), I bought the VIZIO S4251W-B4 5.1-Channel Home Theater system to go with it and now it is unbeatable!", "Date": "March 23, 2014"}, {"Title": "Very nice TV for the price", "Author": "DavidCT", "ReviewID": "RUO1MWEFWVO4S", "Overall": "5.0", "Content": "As a general use TV, I really enjoy this model.Once you make some adjustments, the picture is great.  When I installed it as part of the setup the updates were automatically downloaded and installed.The 3D is nice, but not as \"spectacular\" as the models with active 3D (the battery powered glasses).  However, I view 3D as a bit of a lark really, and something I will use rarely.", "Date": "March 22, 2014"}, {"Title": "First Day Using It", "Author": "iPcGameAddict", "ReviewID": "R3EQCRZGC5C1YU", "Overall": "5.0", "Content": "Great picture, Simulview feature is great for gaming, 3D looks great.  Very happy with the purchase so far!  I'll update this review if anything goes wrong...", "Date": "August 13, 2013"}, {"Title": "wonderful", "Author": "Captmike", "ReviewID": "R3PT81QA6JAJ9G", "Overall": "5.0", "Content": "Received it a week earlier than expected - simple to set up - great picture - we finally took the plunge and bought a flat screen - went with the Sony because our 'old' analog was a Sony.Wife picked it out on the wall at a local Electronics store - said it had the best pictureWonderful - wonderful", "Date": "February 27, 2014"}, {"Title": "Good buy for a tv", "Author": "kyky123", "ReviewID": "R3KTJF0JAMVTSP", "Overall": "4.0", "Content": "TV has a great picture. The sound is a little low. I have been playing games with my xbox one on it and the picture quality is is so sharp and clear.", "Date": "January 13, 2014"}, {"Title": "Excellent video", "Author": "Vo", "ReviewID": "R2NKIK6UI7KHM4", "Overall": "4.0", "Content": "Picture has depth and vivid color. HD DVD video looks close to the one of the 4k TV. Excellent !The area of the remote where one goes left/right/up/down is small and crammed with other command buttons. Several time, I activate inadvertently the return bottom and that sent me back to the beginning at my frustration. For that I remove one star from my rating.", "Date": "January 9, 2014"}, {"Title": "Great TV", "Author": "Linda", "ReviewID": "RGHJN79CASL36", "Overall": "4.0", "Content": "I really like this television, it has a great picture and was easy to hook up. I like the swivel base, I can turn it any direction. It's also very easy to get on Netflix, I have had so many problems with other televisions and devices that have been complicated for me to access Netflix that I wouldn't even get on it hardly at all. I only have one issue with this television that I do not like, it's the glare on the screen from light. I have to always keep my living room dark during the daytime with the curtains pulled together in order for me to see. I haven't had a chance to watch it in 3D as of yet, so I cannot review that feature yet.", "Date": "March 6, 2014"}, {"Title": "A beautiful TV!", "Author": "LaMar Barrus", "ReviewID": "R1V12NX695S54R", "Overall": "5.0", "Content": "A beautiful TV.  Wonderful picture and very useful Apps.  A great upgrade from our earlier Sony 40\", and we thought it was good.  Love the 3D Blue-ray discs on this TV.", "Date": "January 3, 2014"}, {"Title": "Excellent TV, but a bit pricey", "Author": "C. Eaves", "ReviewID": "R1IOGYDFODS3A7", "Overall": "5.0", "Content": "Thoroughly enjoying this TV.  Color representation has been excellent.  Off angle viewing is reasonably good.  Purchased the WOW calibration disk and found most settings for this TV were spot on.  Only difficulty we have had is with the Netflix app.  It sometimes get \"stuck\" in the closing screen and we have to turn the TV off and on again to clear it.Delivery was a few hours late, but the delivery guy did a good job of unpacking and setting up the TV.The price dropped a week after we bought it and Amazon immediately refunded the difference.", "Date": "October 16, 2013"}, {"Title": "sony KDL-55W802A 55-inch 120Hz 1080p 3D internet LED HDTV", "Author": "W L", "ReviewID": "R1D7OAK7XTU2K8", "Overall": "5.0", "Content": "This is a very nice Tv , it has a very good picture in HD , at the present I get my HD signal from an over the air  blade antenna,  I use a A/B switch for cable channel's,  I had another Brand 55\" TV the side to side viewing angle washed out as you viewed from off center angles, this TV does not washout, an Sony  list the viewing angle in the spec's, the other Brand did not,  I bought the Tv for the Tv factor, not other stuff, the Tv has  a internet setup , the setup is  somewhat different than some brands,it has movies etc. I wanted a Tv for the Tv and picture,  an viewing angle more than other stuff, it will do what I need a Tv to do, bottomline I am pleased with the Tv.", "Date": "October 22, 2013"}, {"Title": "Great TV! Great Picture!", "Author": "Michael Carlin", "ReviewID": "R229CTATGBPMMX", "Overall": "5.0", "Content": "Picture quality is great. Nice sleek design. Wifi connection is solid and Netflix moves along with no issues. They said that the Samsung TV provide more content streaming options, but once you do the initial update there are so many options I don't know where to start. We use Netflix and Pandora and they work great.I have always been a Sony guy. I read the reviews and asked various sales professionals their opinions. No one could tell me that the comparable Samsung was bettter.", "Date": "January 12, 2014"}, {"Title": "The Best", "Author": "Alvin F. Outarsingh", "ReviewID": "R2WQTXPR1P1YFS", "Overall": "5.0", "Content": "Sony is the best, I will always buy Sony. This TV meets and beats my expectation. Cost is a concern however the long term you will recouped.", "Date": "December 19, 2013"}, {"Title": "It is A SONY", "Author": "Amir shams", "ReviewID": "R2ZKAZNNXI1BQU", "Overall": "5.0", "Content": "very good HDTVlots of capability - fantastic internet TV- many HDMI port- easy to install-easy peasy japaneseyperfect Deep color", "Date": "October 24, 2013"}, {"Title": "Poor/non-existant documentation, useless features, horrible apps, and glitchy motion", "Author": "Izaak \"Izk\"", "ReviewID": "R2FEGFDXHLH2UU", "Overall": "3.0", "Content": "Pros: When it doesn't motion-glitch the picture is excellent.  Low-lag on input (for my Xbox 360).Cons: No documentation except for the \"on-TV\" stuff which is not useful when you're trying to tweak the settings (flipping back and forth is painful), poorly designed remote control (the home button is so close to the down button I always hit it by accident when moving through the menus), hundreds of apps, yet 95% are pure garbage and listed in a totally unorganized way (no support for Vudu or Ultraviolet which is the most useful since you get those versions free with BlueRays now), picture settings are totally obscure and undescriptive (and split into 2 sections), TV gets laggy at times (where menus won't work or it takes a very long time to move around -- usually when its first turned on), HUGE issue with motion glitchiness (when the picture is 720p or higher and theres a new scene with a LOT of action, the TV has huge issues processing the motion and you can see it lagging out/the motion is totally unfluid -- no settings have fixed this issue and I've tried them all).After being a Samsung fan, I wanted to try something different after hearing about Bravia's better picture quality.  Well that was a mistake.  The picture does look better, but its not worth the glitchy motion happens quite often (its like the processor isn't nearly powerful enough).  The other issue is I sat there tweaking and tweaking and nothing was fixing the darkness issue (the TV was so damn dark, I had to turn off all the lights in the room pretty much).  There are so many obscure and obnoxious/useless settings with such poor descriptions on this thing.  But basically there was an \"Eco\" section (not related to the picture settings) that tried to get the ambient light in the room and dim the TV to conserve power.  Once I disabled that, the picture was amazing (minus the motion glitch problems).", "Date": "March 1, 2014"}, {"Title": "Picture perfect", "Author": "Weste", "ReviewID": "R1LMCS05FIQDFN", "Overall": "4.0", "Content": "I never new a television could show that clearly , the pictures are just clean and perfect . I had no problem setting it up .", "Date": "November 1, 2013"}, {"Title": "Died after less than 3 months", "Author": "R. Dean", "ReviewID": "R21OTDH4LX26XU", "Overall": "1.0", "Content": "TV was was very nice and met my needs. But, it died just short of 3 months. I purchased a warranty with this purchase, hopefully Square Trade will repair/replace as they claim to do. Getting TV's repaired in Honolulu is not easy.", "Date": "December 28, 2013"}, {"Title": "Problems with memory and white scenes", "Author": "Bright White Lover", "ReviewID": "R31A11EGCH5YG6", "Overall": "1.0", "Content": "TV has Smudging, clouding on sides and bottom which appear dimmer (grayish) than the center which is extremely bright. This is extremely noticeable in white scenes. Unable to stream movies from a local LAN media server. Movies play 15 min then loose connection and buffering forever. There seems to be a problem with TV memory. Highly reflective screen although specs mention it's matte screen. Don't buy if you'll place it in bright room with windows, you'll regret. Other than that, the TV is OK as low/medium tier TV.", "Date": "January 5, 2014"}, {"Title": "Frustrating Sony KDL-55W802A 55inch HDTV", "Author": "Harjoon Heeralal", "ReviewID": "R1L8900KOKUOP3", "Overall": "3.0", "Content": "The volume behaves very randomly even whilst watching the same channel. Requires constant changing of the TV and Cable volume controls. Could be quite frustrating changing device. Example  from DVD player back to cable and back. The USB input is also quite frustrating in that the sequence of files seen on the computer is reversed on the USB. There seems to be no way to change the viewing sequence. The 3D element is very poor. The manual is very poorly-designed.", "Date": "November 26, 2013"}, {"Title": "The best", "Author": "Maria A. Atmadjaja", "ReviewID": "RN3KQCOYG0786", "Overall": "5.0", "Content": "The best Sony tv , iboutht this tv on Sony and they r giving a ps 3or ps vita with this tv  the frame is amazing", "Date": "May 16, 2013"}, {"Title": "Very Nice Colors BUT a very reflective screen", "Author": "ElectroRev", "ReviewID": "R2KAAM5GH8KR83", "Overall": "2.0", "Content": "The TV has great colors and very sharp picture,It is excellent for games, especially if you get the 55\",3D is very nice, but don't buy this TV just for the 3D,Not worth it,The sound is hopeless,Very sad to say this about a product from Sony,But this is my second TV from Sony,The previous one I had was an XBR,And it also had bad sound,Very disappointing from Sony,Big Concern: **************************************This TV is HIGHLY REFLECTIVE,Please pay attention to this,So if you are in a room with a window [big or small],If you are seated at an angle opposite to that window,The TV becomes one big WINDOW REFLECTION,****************************************************So be carful about this,I tried to return it,But unfortunately my mistake was I bought from a Sony store,And the guy said I have to pay for the free shipping and installment myself,$350 value,I usually by electronics like this from BESTBUY,Free shipping and installment,And they don't ask question when you return it,So I advice everyone to do research on this TV's reflective screen,And buy a TV from Bestbuy or Frys,Its much better, just incase you are not satisfied with your purchase,", "Date": "August 26, 2013"}, {"Title": "Wait,wait,wait.", "Author": "al from Lamanca", "ReviewID": "R2ZGLAT37NW85P", "Overall": "4.0", "Content": "I like the unit after several hours  of setting complicated control systems.and a couple of updates, but hurts the ego and pocketbook when price dropped $ 200 after couple of weeks. My fault, should have shopped, around and waited a bit longer, the man from Lamancha learns slowly.", "Date": "July 13, 2013"}, {"Title": "Broken on Delivery", "Author": "David Perry", "ReviewID": "RLV63I5MEW3SR", "Overall": "1.0", "Content": "I though I had orded new but it seems i got a used product from Warehouse Deals, Inc.The box got here torn, retaped, battered, dirty.  When I opened the box the Sony Nameplate wasn't attached and wouldn't stay.  4 of 7 screws needed where loose , not packaged, in the bottem of the torn box.  Parts of the Stand where free to float around inside the box.  Both bottom packing foams where busted, the top where repack expanding foam.  Powered it up and there was a 2 inch wide white line in the middle of the screen due to a crack at the bottom of the LCD.  Sure UPS can be rough, but the way this was packaged it didn't stand a chance.40 bucks to return a 950 buck box of trash.  It's otw back atm.  I will update when I see how well the return goes.", "Date": "March 13, 2014"}, {"Title": "They sent me a used TV", "Author": "Timothy Narby", "ReviewID": "RYILB9CVZ4WSS", "Overall": "1.0", "Content": "I thought I was getting a new machine, but it arrived partially assembled and set up as a retail demo. It took us a week to figure out that we needed to go through the setup again so that we could change the display settings.  We spent a week changing the settings and then they would revert after 15 minutes.  We thought the set was broken.  We will be way more careful with Amazon in the future.  We have been way to busy lately and thought we were saving time.  It took us 3+ weeks to get delivery and thought we had botched the order.", "Date": "March 17, 2014"}, {"Title": "Poor Support From Sony", "Author": "Henry Boureshrockn \"hboureshrockn\"", "ReviewID": "R2CRA84SSROG89", "Overall": "1.0", "Content": "We bought this TV from Sony Store in June and since day 1 it has not worked properly.It keeps losing connectivity to internet and drops the IP address.  I have replaced my routers 3 times as well as the cables and configuration.I have spent more than 10 hours on the phone with Sony and they finally decided to send someone to replace the motherboard on it.I asked Sony to come and replace this brand new TV and they wont do it.  The rep was so rude and hung up on me last week but another level of support called me today.I told them I will be putting a bad review on their website and when I went to do it there was one on my behalf with 5 stars? I am now really angry and will tell my whole family and friends to not ever buy another Sony product.My advice to you if you bought this TV and doesn't work properly, just return it and do not call Sony. I made that mistake already and now I am paying for it.two months later finally Sony has sent someone to replace the motherboard. The tech called Sony in front of me and reported that even with the new motherboard the apps do hang and Sony rep told him that he has the same TV and the apps, especially Netflix, hangs and there is nothing they can do about it.with the new motherboard the TV doesn't lose its connectivity to the network anymore.Sony has opened an investigation regarding the false review - I emailed them the screenshot from the page just before it was removed.Update 01-15-14 Sony finally sent a SW update and fixed the Netflix app. It does not hang anymore.  With the quality of this TV and if it had worked properly from day 1 I would have given it 4 stars.", "Date": "August 19, 2013"}, {"Title": "Very Dissappointed", "Author": "Bob", "ReviewID": "RM5L1ZH854HZB", "Overall": "2.0", "Content": "I am sad to say that this Television was a great disappointment for me ,after being a loyal Sony consumer for years. They appear to not produce as good a product as they use too. I ended up returning this TV in favor of a Samsung which has outperformed it in many ways in my humble opinion.", "Date": "January 28, 2014"}, {"Title": "They should take the internet ot from the internet tv", "Author": "Amit", "ReviewID": "R201GY8P1MKTO4", "Overall": "1.0", "Content": "I spent $ 1700  to buy this piece of crap and this is the 10th day.Most of the time the application wont load. It will show server not available. Dont understand why it always has to go to the sony server to load the apps.Error message: some applications are unavailable because server is downBest part I have amazon tech support for initial 30 days. When I called amazon they said it is a sony issue,. And Sony they only open till Monday till friday 8-8. They don't even have a 24 hr support how unprofessional it could be.Entire weekend and we do not have the netflix app in the TV.", "Date": "August 11, 2013"}, {"Title": "Definitely better TVs out there worth your money. Skip this low performing Television", "Author": "Richard Golfin", "ReviewID": "R87MESDESAQB9", "Overall": "1.0", "Content": "Had the worst colors EVER. I would skip this TV in a heart beat. Was never happy with the REDs which show up like pink. SKIP SKIP SKIP. Much better units out there for the price.", "Date": "November 20, 2013"}, {"Title": "Miracast work with LG Nexus 4 (Android 4.3 only)", "Author": "Arumuga Nainar", "ReviewID": "R2ADYQKWW0CI5U", "Overall": "4.0", "Content": "W802a has a very good functionsKey FeaturesUPNP works in Wifi Directdisplay looks good for meLG Nexus 4 Miracast function work from android 4.3.I tried in Sony World India", "Date": "May 10, 2013"}, {"Title": "Bad picture quality.", "Author": "Dani \"Dani\"", "ReviewID": "R1JE9LI9I5FEMM", "Overall": "1.0", "Content": "I bought this tv and I keep it for two days only.The picture quality in a bright room is decent, but at night, impossible to watch.Do not buy a tv with out local dimming, the 802a is one of those that you need to avoid.", "Date": "July 1, 2013"}], "ProductInfo": {"Price": null, "Features": "Pro-grade detail for discerning eyes: X-Reality PRO\nEnjoy ultra-realistic movement with Motionflow XR 480\nDynamic, full range sound with S-Force Surround Sound\nDynamic Edge LED backlight for amazing contrast\nTV without stand (Width x Height x Depth): 49.4 X 29 X 2.6 Inches, TV with stand (Width x Height x Depth): 49.4 X 30.3 X 11.8 Inches", "Name": "Sony KDL-55W802A 55-Inch 120Hz 1080p 3D Internet LED HDTV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51MTR%2BVga3L._SX300_.jpg", "ProductID": "B00AWKBZ1G"}}