{"Reviews": [{"Title": "2013 Best Value 32\" 1080p HDTV: The Sceptre E328BV-FMDC", "Author": "Ryan", "ReviewID": "R3347P0APYBNE7", "Overall": "5.0", "Content": "I was looking for a TV for that could also double as a nice PC monitor for a decent price.I found exactly that in the Sceptre E328BV-FMDC.I previously had an Acer 32\" 1080p tv that I used as an office monitor in my home. I have been thoroughly impressed with my Acer that I purchased in 2011 and has had no issues. I was pleasantly surprised when the Spectre arrived and was much more sleek and slim than my Acer. Another plus is it takes up less desk space. The Acer will be going up to my office and the Spectre will go in the home office. Pleasantly surprised with the thinness of this tv for the price range, the title should include slim as it is much thinner than other name brand models.The assembly of the TV is very easy. The stand installs easily by just snapping into place and there are 4 screws that are hidden from the bottom to install. Also included is a mini screwdriver so no hardware is required for setup. Very easy to install. From there it is typical install of plugging in your cables.This TV has 3 HDMI ports, and the first port supports Audio Return Channel (ARC) which is a nice feature if you are going to hook up an AV receiver. It also supports standard composite and component connections and a VGA PC connection (very nice when using as a monitor). Another plus is the headphone jack and audio in port which many TVs do not have in this size.I really like how the ports are facing down which is nice if the back of the screen is visible. Cord are jutting out the back of the ports but rather facing down.I use the 1/8 mini jack to hook up a nice pair of computer speakers for better sound and being able to turn off the TV speakers and still use the volume control from the remote to control external speakers is a great convenience.The picture on this TV is great. Clearly not the best out there but for this price I cant complain.Pros: The TV is slim, price.Cons: Not the best picture.Overall, best value for the money if you are looking for a entry level 1080p tv. Time will tell on reliability, purchased the SquareTrade 3-Year TV Protection Plan for $20 and I would recommend you do the same.", "Date": "August 17, 2013"}, {"Title": "Good for the price.", "Author": "JohnDoe", "ReviewID": "R3NXRK668SXI3T", "Overall": "4.0", "Content": "I was skeptical about ordering this TV due to low brand recognition, but upon initial use, I like it.The good: picture is good, it looks nice, has 3 hdmi inputs, price.The \"not good\":  sound quality. Had to turn down the treble and up the bass to get rid of the \"tin boxy\" sound.  Not sure why the factory default is so annoyingly high pitched.  The base is flimsy and required assembly (4 screws, but it does come with the screw driver/screws).  I may have put it on backwards and that's why it's flimsy, but once in place I don't plan to touch it.Overall Id say its good for the price.  You may need to tweak the settings for audio though.  If you feel uncomfortable doing so, I wouldn't recommend it then.  I got this TV to replace a 19inch second TV I have.  I'm not sure if I'd like it as a primary TV, but I think it would suffice.", "Date": "June 26, 2013"}, {"Title": "Worth every penny...", "Author": "Cevyn L. Miles-monaghan", "ReviewID": "R30O8IM2HBJ9LX", "Overall": "4.0", "Content": "To find a 32\" 1080P TV for less than $220 is awesome.  My particular specimen has no dead pixels, which is a good thing for someone like myself.  I bought this TV for use as a monitor on my gaming rig.For today's typical FPS, the TV is perfect, with very low lag.  There is some minor blur from black to color when playing retro games like Super Mario, but it's not noticeable during play unless you look for it.I recommend this display for use as a gaming monitor.  I used a DVI - HDMI adapter to connect my media PC.  Even the sound comes through, although you will absolutely want external speakers.  The TV's speakers leave a lot to be desired...not even an added subwoofer would make them tolerable.", "Date": "August 15, 2013"}, {"Title": "TV Looks fine, sound, well, not so much.", "Author": "Charles", "ReviewID": "R1XC5S7GZ2JUKM", "Overall": "4.0", "Content": "My first unit I received didn't work properly (remote would not register), but Amazon replaced immediately.  Second unit functions flawlessly.The picture looks good, the sound leaves a lot of room for improvement.  For the price of the TV though, there is room for a soundbar or stand alone speakers.", "Date": "October 30, 2013"}, {"Title": "Sceptre E325BV-FMD", "Author": "D. Christensen", "ReviewID": "R1CSDSCIPEZ4WH", "Overall": "2.0", "Content": "Note:  Sceptre E325BV-FMD is apparently the same model as E328BV-FMDC.  Having said that...This is a review of the E328BV-FMDC.Right out of the box, I had a couple of major problems with this TV.1)  The stand included does not fit right.  Yes, I am sure it was installed according to directions.  But it leaves the TV floppy, will not hold the TV up straight.2)  Factory default settings generate very obvious artifacts (noise) on the screen.I set this up on the stand first, even though I wanted to hang it on the wall.  I set it up on the stand to test it out before bolting it to the wall.  I was glad I was not planning to use the stand permanently though, as the stand is terrible...To me, it seems like the stand is not properly designed to hold this TV.  I am sure that I assembled it correctly, and firmly tightened the screws.  But the TV (on the stand) is very floppy.After confirming that the TV appeared to work OK, I mounted it to the wall.  One MINOR problem I ran into is that the design of the case itself does not leave much room for plugging in HDMI cables.  I was able to get it to work OK, but the cables are really tight / squashed...Also, the audio connectors are hanging off the left side of the TV.  So you can't really \"hide\" cables to make it look neat.Video:This actually has a pretty good picture (I'd rate it 4/5 stars) after it is properly adjusted.  However, the factory default settings have \"dynamic contrast\" enabled by default.  If you don't notice that, you are going to have a very difficult time trying to adjust brightness (black level) and contrast (white, in relation to black).  In fact, when I first tried to adjust brightness, I thought I might have to send this TV back to the factory as DEFECTIVE.  There were very obvious angles (triangles? arrowheads?) of light grayish lines that would swim up and down the face of the picture corresponding directly to how you adjust the contrast control.  Yikes...  (it looked terrible)Later, I figured out that the TV itself was adjusting contrast, or trying to.  For those who don't know, brightness and contrast are related...so when you adjust one, you also adjust the other.  If you (the human) are adjusting brightness while a computer (the TV) is adjusting contrast...that does not work very well!!!!For other owners of this TV, I will give you the \"shortcut\" directions to get the best picture out of this set1)  Go to advanced picture settings and turn EVERYTHING on that screen to OFF.2)  Go back to main picture settings menu, set picture mode to \"USER\"3)  Brightness 50Contrast 50Color 40Tint 5Sharpness 0 (ZERO)Color Temperature \"Normal\"If you set the picture controls as listed above, that gives you a pretty good picture, with a 1080P source.  The factory \"picture\" settings are actually pretty close to where they should be, AFTER you turn off the dynamic contrast...Sound:I've got good news and bad news, when it comes to sound.  First, the sound is kind of \"tinny\" / cheap sounding.  That's the bad news.The good news is that it can be adjusted to sound \"OK\" or even \"good\" (but not great).  No matter how you adjust it, it will still sound a bit \"tinny\".But I was pleasantly surprised to see all the adjustments available for sound.  Without getting into too much detail...the sound setup menus include two different graphic equalizers.  I'm not talking about SETTINGS for graphic equalizers (like \"pop\", \"rock\", \"jazz\", whatever), I am talking about graphic equalizers.  There are TWO of them!!!1)  The first one is near the top of the menu (it is just labeled \"sound settings\").  It includes a few simple presets that you can scroll through if you just want to make a quick tweak to the sound quality.  There is also a user adjustment here.  This is the menu for people who are impatient and/or do not understand how to adjust the more detailed graphic equalizer2)  There is another graphic equalizer near the bottom that can be set to off/rock/pop/jazz/user.  The \"user\" one is split out into 7-10 (going by memory) different frequency ranges that can be adjusted +/- 12.  This is a very handy equalizer for those who know how to adjust it.Once you get the sound properly adjusted, it is acceptable.  Not \"great\" but somewhere between OK and good...I should note that this works well with a Chromecast, as the (TV) USB port gives enough power to keep that running.  :)This TV will do fine if you are just looking for something cheap to give you good picture hanging on the wall in your bedroom.  That's what we use it for.  If you need to set it on a stand on your TV stand or entertainment center...pick a different brand...I actually like this TV, and think it deserves 3.5 or maybe 4 stars.  Picture and sound quality are (overall) good, once properly adjusted.  But the stand being wobbly?  Not acceptable, even for a cheap TV set.  So I give it 2 stars...", "Date": "December 29, 2013"}, {"Title": "GREAT PRODUCT FOR THE MONEY !!!!", "Author": "cookie", "ReviewID": "R3IR25M6M9GUP1", "Overall": "5.0", "Content": "This tv is all that it was advertised. I purchased it a few months ago and use it daily,it has performed to my expectations and more. I only have 1 suggestion to the mfg.co. that is to try to  get a better sound quality(bass) The picture is superb.  Thanks Roger", "Date": "September 3, 2013"}, {"Title": "No support", "Author": "Bill", "ReviewID": "R1JRHHQAF3W69E", "Overall": "2.0", "Content": "The sound goes crazy and all Sceptre would say is the warranty is over and it a problem with the control board.  Would not purchase another Sceptre product.", "Date": "April 27, 2014"}, {"Title": "I liked it so much that I purchased a second one.", "Author": "Nathaniel M. Boyea", "ReviewID": "R2VRZX5D01CVDG", "Overall": "5.0", "Content": "I purchased this TV to be used as a computer monitor for my son's computer build for Christmas.  I've waited four months to write this review to be sure that it is an honest review.This TV has three HDMI inputs, one set of Component inputs, and a VGA input.The picture is perfect.The bezel is not NEARLY as thin as the more expensive models.  This is NOT a problem to me.The setup was as simple as any other TV.The remote is fine...it's a remote.I seriously liked this TV so much that I purchased a second one.", "Date": "April 18, 2014"}, {"Title": "Sceptre HDTV", "Author": "Gary Hughes", "ReviewID": "RN3P7FJUP0BQC", "Overall": "5.0", "Content": "Finally, this household can watch sports with a nice sharp image with true-to-life colors. . .a welcome addition to the home.", "Date": "March 20, 2014"}, {"Title": "great tv for kids room", "Author": "rodney Anderson", "ReviewID": "R1RHS4QXSF213O", "Overall": "5.0", "Content": "I'd read reviews on this before buying for Christmas pressie for our son...  took a chance anyway.  But the reviews so far (the negative ones) haven't been proven true.  The sound is amazing (though it is in a small bedroom, so don't know if that would be diminished in larger room or not) -- in fact, to compare we bought a Samsung 46? inch hdtv 3d for our own bedroom and have to use a sound bar for that one... Not so on this Sceptre.  Poor kid's always hearing \"turn it down\" and the vol really isn't up above 2-3. Picture is brilliant too for a 60Hz.  Impressed!", "Date": "February 14, 2014"}, {"Title": "Daughter's Christmas Gift", "Author": "Dave Gordon", "ReviewID": "R3KLG5EJLPB82D", "Overall": "5.0", "Content": "Nice TV for the price.  She uses this to play video games and it works exactly as described. Nice TV.", "Date": "February 9, 2014"}, {"Title": "Great picture, terrible speakers", "Author": "Ron Lowenberg", "ReviewID": "R1GXYX77M1HGX1", "Overall": "4.0", "Content": "I bought this around thanks giving and I have been loving it ever since. It has a matte black screen which blocks glare wonderfully. The picture looks great especially for the price. There is only one down side and that is the speakers. I did not expect much, but they were even worse than I expected. They are the most tinny speakers I have ever heard. The way I got around it was I plugged my headphones to the headphone jack on the side and even thoses don't help it that much. I will be trying a sound bar soon. But other than the speakers, it is a great TV", "Date": "February 6, 2014"}, {"Title": "Good picture quality.", "Author": "George B. Haddock", "ReviewID": "R2BE7E87HBL4GR", "Overall": "5.0", "Content": "This tv is a good size, not overwhelming.  It is easy to hook up and the on screen menus are easy to follow.  Good quality at a good price.", "Date": "February 1, 2014"}, {"Title": "Nice picture", "Author": "Satish Janardan", "ReviewID": "R3E4NIS3JY8TO3", "Overall": "4.0", "Content": "Was easy to mount on the wall.  I has very nice picture.  I noticed at time channels will cause the sound to drop out.  Turnning the TV off and on fixed the problem.", "Date": "January 31, 2014"}, {"Title": "SCEPTRE E328BV-FMDC 32\" 1080 60Hz LED HDTV (Glossy Black)", "Author": "Mike Baucum", "ReviewID": "R3GZHNSMW44YBG", "Overall": "5.0", "Content": "This 32\" Sceptre tv was a Xmas gift for my 12 year old grandson.All I can tell you is that he loved it & has had absolutely no problems with it.Gr8 tv at a great price!!!", "Date": "January 29, 2014"}, {"Title": "Suits my needs", "Author": "John", "ReviewID": "R16BQ1SRTR6OD2", "Overall": "4.0", "Content": "Nice TV. Just what I needed. The sound, as others say, is nothing to write home about. They probably expect you to buy external speakers. But apart from that it's a great TV.", "Date": "January 27, 2014"}, {"Title": "great tv!", "Author": "Ruthann E. Langkamp", "ReviewID": "RBRNLPRHD1MKS", "Overall": "5.0", "Content": "my son loves it,. it was easy to set up,  good color, clear picture, we are very happy with this purchase.", "Date": "January 19, 2014"}, {"Title": "Great price and value", "Author": "jmfixitman", "ReviewID": "R19HLX0K3P8YIE", "Overall": "4.0", "Content": "I'm currently using this as a computer monitor and it works great!  Color as good and the display power saving with no signal input is awesome.  The only down side is no pip, but it was such a great value I'm not complaining.", "Date": "December 31, 2013"}, {"Title": "Nice Tv", "Author": "William Harris", "ReviewID": "R1P464LNSMWPUC", "Overall": "5.0", "Content": "All good..nice picture 1080.  Plenty of Hdmi hookups.  Good price.  Cant beat it for the money and the nice picture.", "Date": "December 31, 2013"}, {"Title": "Great picture", "Author": "Bob Martin", "ReviewID": "R3HLEGFPZA2ED1", "Overall": "5.0", "Content": "Best picture in the house and I have five other tv's. Easy setup and directions were clear. For the money u  can't beat it", "Date": "December 29, 2013"}, {"Title": "Television", "Author": "karen Wheeler", "ReviewID": "R32OKOK6IAW7V5", "Overall": "5.0", "Content": "For the money, this is a great tv, it serves the purpose that we bought it for. Very good deal", "Date": "December 29, 2013"}, {"Title": "Excellent picture quality.", "Author": "Gerald J. Wyckoff", "ReviewID": "R1SULRA8XI8ZX1", "Overall": "4.0", "Content": "This is an excellent purchase.Pros:  Great picture, good connection options, decent remote. Set up was easy and the base seems pretty stable considering the TV is very light. 3 HDMI connections, 1 USB port. One of the HDMI connections can function as an MHL port for your phone or very new (as of 2013) and specific Roku.Cons: The instructions could be better. Sound wasn't bad but was not optimal. There could have been confusion regarding the MHL port as advertised. It doesn't have 3 HDMI and 1 MHL ports, it has 2xHDMI ports and 1xMHL port, the MHL port can /also function/ as an HDMI port. So it does have a total of 3 HDMI ports, but if you were hoping to have the MHL port free, that won't happen.", "Date": "December 27, 2013"}, {"Title": "I'm Blown Away....This is for the X325BV-FMDR", "Author": "I'm The Metal Lord", "ReviewID": "RMPT7IMM0PPTH", "Overall": "5.0", "Content": "I am absolutely blown away by the quality of this item at this price point. Yes it's a no name brand and yes it's quite possible I may need to replace this sooner rather than later and but of course if you read any other reviews you know the sound isn't top notch HOWEVER the sound isn't near as bad as I expected from reading other reviews.If you go into the sound menu there is even an EQ with presets of rock, pop, jazz and user (100, 250, 500, 1k, 2k, 4k and 10k) as well as your basic bass and treble and balance controls. This allows you to tweak the sound the way you like it. Not to mention the basic sound settings with presets they have already (Dynamic, Standard, Soft, and user) I simply plugged in my computer surround sound speakers into the headset jack and the sound is above average but I did mess around with the sound before I added the speakers and it was passable and not as bad as expected.The picture quality on this is A MAZE ING! I have a 48\" Sanyo in my living room and I bought this to be a TV, PC, and Xbox Monitor in my office/bedroom. Those that feel a 32\" monitor is too large for a PC monitor don't know how to adjust the settings on their PC. I actually have 2 PC's hook up to it. One is personal and the other is for my work at home job. If I ever have to go back to using a smaller screen for work I think I would.....well I'm sure it will never come to that since I'll just buy me another one. It is so nice to have multiple windows open and easily accessible of all different sizes on my screen. So nice to sit back and work without having to be right up on my monitor. On the personal side I love using my wireless keyboard (I bought a Logitech K400) with Multi Touch Touchpad to operate all my browsing/movie watching that I do from my PC. And for the Xbox 360 it's perfect for gaming at 1080p. Not to mention the picture quality while watching TV. Now I'll be honest most feed from cable companies are not at 1080p BUT if you are like me you can access your cable channels through your PC or gaming console and there you get full 1080p on every channel. I only use the TV tuner when I'm getting ready to fall asleep and set the sleep timer.Having 3 HDMI inputs was one of the main reasons I bought this model but everything else has been great as well. For instance the different settings that are available for the picture size is PERFECT! You have full 100%, normal, wide, cinema and zoom. Depending on the source I have used full, normal and cinema so far but I can imagine a need for all of them.This TV has so many different settings and tweaks I couldn't even imagine talking about all of them here but I will mention a few others that I haven't mentioned yet. Blue or black background when no source. Auto off when no source. Internal digital tuner. Parental settings. Date and time. Five picture modes (power saving, vivid, standard, mild and user. Color temperature. Noise reduction. Just to name a few.If you are even considering this for TV or PC or gaming console and haven't bought it yet you should add to your cart now and pick it up before they run out.", "Date": "December 24, 2013"}, {"Title": "Found it on Amazon.", "Author": "-", "ReviewID": "R38WV6DXY7Y2C9", "Overall": "5.0", "Content": "It has a\" great selection of inputs.  The picture quality is better than other brands I have viewed.  Live in a rural area and still picked up 26 channels with rabbit ears.  Glad I found it on Amazon.", "Date": "December 19, 2013"}, {"Title": "Good picture, lousy sound.", "Author": "You can call me Mike \"Mike\"", "ReviewID": "RWFSL4ITP8JVP", "Overall": "4.0", "Content": "I'm happy with the picture.  I have this hooked up to my TV and two different computers.  Even though it will run 1920x1080 on one it won't support 1600x900 on the other.  I have to reduce it to 1440x900.  What's the deal with that?  I can get higher resolution but not lower?And the sound is more lousy than I expected.  I read the reviews all saying bad sound but I'm still surprised at how bad and tinny it is.  It sounds like a speakerphone or an old time car radio.But, for $200, I guess I can't complain.  It's an upgrade for picture anyway.", "Date": "December 16, 2013"}, {"Title": "Awesome", "Author": "Christopher Montalvo", "ReviewID": "R2G8P8VYTV4WIV", "Overall": "5.0", "Content": "Really cool TV, picture was awesome, which is what i was worried about. Sound is not very good but i had a surround system so it does not matter. I would recommend you to get a sound bar", "Date": "December 13, 2013"}, {"Title": "Great TV", "Author": "thebotti39", "ReviewID": "R2ZE6V6PJIP2VF", "Overall": "5.0", "Content": "I was unsure about the name, but that quickly disappeared after I hooked it up to my computer, A 32 inch computer monitor would be over a thousand dollars, this gets 1080p and also has a HDTV tuner and the picture is awesome. Pair it with the matching  sound-bar and your office comes to life.A great deal and a great TV.", "Date": "July 27, 2013"}, {"Title": "NEVER again !", "Author": "T. King", "ReviewID": "R3PRKG20EBS58Z", "Overall": "1.0", "Content": "I never pass up an opportunity to tell about my horrible experience with Sceptre.  The positive review that I saw for this television astounded. I bought the t.v for my daughters birthday. It took exactly four months of regular viewing before the t.v. stopped working and only made a weird sound when you tried to power it on.  I found out that my factory warranty was covered by a very small, very nonchalant, company in California. After sending back the t.v. and waiting about six weeks without a t.v. my replacement t.v. was shipped out. I thought it was cool that the t.v. they replaced it with looked a little sleeker and newer than the one I had shipped back. I was watching t.v. with my daughter almost two weeks after receiving it, and was amazed to see wisps of smoke coming from the back of the t.v.  Again, I contacted the same, lackluster, slightly warehouse or distribution place,tried to complain but was met only with transfers to voice mails and being told that of course,the only thing I could do was ship the t.v. back and wait another 4 to 8 weeks for a replacement.  I told them that if they were not willing to give me a refund, under the circumstances , so that I could at least put the purchase amount on a decent t.v. instead of to keep having to deal with understandably, pieces of crap televisions. Plus the inconvenience  having to lug flat screen t.v.'s back and forth from the post office. I thought that the least they could do was replace it with a bigger model like a 52\". Not only because if I were going to have to keep going through with the headache, at least they could make it worth my while. And I figured if I went through enough of them, eventually one of them would have to work.  The people who commented so positively must have only just purchased them. Ridiculous item, not worth the headache even for the cheapest price. I promised Sceptre , that if I could do nothing else to get justice in my situation, I would never pass up the chance to tell people about my experience and warn them about their product. As bad and terrible as the product and the situation is, I can't believe they're still selling these things. I know I cant be the only one with this kind of experience.", "Date": "September 22, 2013"}, {"Title": "Was all it claimed and great value", "Author": "Bryan", "ReviewID": "R2H4IZ4ZZZ0LMG", "Overall": "5.0", "Content": "If you are looking for a great value in a smaller set I think this is it. Now I am not a big electronics guy but was looking for a smaller set for the bedroom. This one had great features and was priced great. I opened box took it out and set it up. fast and easy and it has been great. no surprises. picture looks great sound is good with no assistance and price was better than most in my opinion. I would buy another", "Date": "September 14, 2013"}, {"Title": "Excellent for use as a computer monitor.", "Author": "D. C.", "ReviewID": "R2X6F2Q0K6GA1P", "Overall": "5.0", "Content": "Got the Sceptre 32\" on sale to use as a monitor after using a Sceptre 27\" monitor for the last couple of years so I was familiar with the brand.  Picture quality is great.  Very bright image.  Saw the concerns about sound quality but honestly I wouldn't be able to tell the difference so if sound is an issue do some more research.  The TV does not have a DVI connector so make sure you have the appropriate cables or adapters.  I am using and HDMI connection to my Radeon graphics card.  The included stand feels a bit flimsy and it is a bit loose which causes the TV to shift and slant slightly.  Also wish the stand had a tilting feature.  Not enough to downgrade a full star though.", "Date": "November 27, 2013"}, {"Title": "Good deal... but I spent an extra $30 for no reason", "Author": "Intense Stories", "ReviewID": "R3N3HFSTB45875", "Overall": "3.0", "Content": "This TV seems to be the best deal for a 1080p 32 inch HDTV on amazon. Unfortunately, I had to take off two stars. I saw this TV at $220. The next day when I ordered it, it was $250. Two days later it was back to $220. So one star is for the extra $30 I had to pay. The other star is for the mediocre sound quality. The difference from the quality on a pair of $15 dollar headphones to this TV is astounding. Compared to my headphones, or even my crummy laptop speakers to the audio from the speakers on this TV (dialogue especially) is extremely hard to hear. I think I might take another reviewer's suggestion and hook up some computer speakers to the TV.", "Date": "November 30, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Sleek & Slim 32\" LED 1080P HDTV\n3 x HDMI Port, MHL Port, USB Port\nATSC/NTSC/Clear QAM\n60 Hz Refresh Rate\nWall mountable 200 x 100 VESA Standard", "Name": "Sceptre E328BV-FMDC 32-Inch 1080p 60Hz LED HDTV (Glossy Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41cRxC5vkCL._SX300_.jpg", "ProductID": "B00ANJRYDE"}}