{"Reviews": [{"Title": "Panasonic Plasma, need I say more?", "Author": "Chris", "ReviewID": "R2X9WU4LICCH0E", "Overall": "5.0", "Content": "Panasonic as far as I am concerned is the best producer of television sets in the world right now. Nothing compares to the picture clarity and quality of a Panasonic Plasma TV and this model is no different. I replaced a 42\" Plasma from 5 or 6 years ago with this model and a week later I'm not even slightly regretting the choice.Update: Recently found out Panasonic has discontinued their Plasma models. If you're on the fence, make sure you decide before they are completely gone (I would NEVER recommend buying used Plasmas). Here is a great article from CNET with a summary of some very well spoken words regarding Panasonic and their Plasma line of TVs.[...]Presuming you do buy a Plasma this year from Panasonic, it should last you until the next generation of OLED TVs become reasonably cost affordable.Plasma technology has come a long way, you'll find that not only do you get the high refresh rate, deep blacks and crisp picture but you also get a longer lifetime now (~30 years of 8 hours a day viewing before the TV will begin to fade), much lower power consumption (CNET rates this model around $44 a year, Panasonic states $28, so figure it somewhere between $35-40 without using Eco-mode settings) and better picture control than in the past (multiple ratios, you can choose to cool/warm the picture in minute quantities and set different profiles for each input).Still, if you're sitting here trying to decide between a Plasma and an LED, you need to really only consider a few scenarios.If it is going to be in a family room that has bright lighting and won't be used for a lot of high action (sports) programming, you're probably better off going with a newer LED model for the screen reflectivity and to avoid the color saturation you get on Plasmas. If you want a Plasma and to avoid any serious glare problems, try stepping up a model to the ST60 or the VT60, each step up will dramatically improve screen glare (and add a crisper picture, which isn't terribly noticeable unless a side by side comparison is performed when in a scarcely lit room). Otherwise in a bedroom or somewhere you don't mind closing the blinds, this is a great buy. Update: Recently read about the P50S64 which has the anti-reflection coating on the S60 model here, try looking online to find your nearest dealer if this interests you.Trying to decide between the ST60 and the S60? Even I had a difficult time with that. The final decision really only came down to the fact that there isn't a noticeable difference in picture quality in the setting I have my TV and I don't need the Smart TV/3D ability.This model has Netflix, Amazon, Youtube, Hulu and a few other Apps. All of which are updated applications so the interfaces are more modern, which is nice. The Wi-Fi set up was very easy, so despite not being Wifi certified I wouldn't be concerned, it comes built-in and ready to go.Another great feature some Techies might find useful is full DLNA support with no complications. All I had to do was connect the network, pull up my DLNA apps on my Surface or Lumia 920 and boom, streaming right to the TV in all of its glory.Don't be fooled for other knockoff brands like Samsungs which just copy market innovators or LG/Sharp whom don't have the same technology built into their TVs like Panasonic does. The S60 is a great deal for the consumer, bringing affordable HD sets to the masses and backed by a brand that lasts, my TV still works from 6 years ago without ever needing a repair and I know of other people with Panasonics from 10+ years ago that never had problems.Update: I've seen a lot of people trying to find a magic configuration for their picture quality, but it's unlikely one settings configurations will match someone else's. Your best bet is to setup the TV and begin tweaking the main settings for your common programming. For instance, I watch a ton of hockey and like for the ice to be vivid and cool, I leave on CATS to dynamically adjust brightness from day to night, the human eye is only so precise so I wouldn't recommend obsessing over tweaks you can't actually recognize. Some people claim to see enhanced reds, pro settings can drop that level when you're in Cinema or Custom.", "Date": "April 20, 2013"}, {"Title": "Extremely good picture quality and performance", "Author": "Ace of Ben", "ReviewID": "R28UR39UE4SZY7", "Overall": "5.0", "Content": "After exhaustive research and subsequent comparison shopping, I decided on this TV in its 65\" form factor. I am extremely pleased with the purchase (and subsequent Amazon delivery), and can recommend it heartily, especially considering its price point.Another reviewer echoed an important sentiment in these reviews to note if you're upgrading from an older TV: the performance of this set will almost undoubtedly trounce your older TV for a fraction of its original cost. In my case, a 2006 Panasonic 42\" plasma that cost about $2,300 at the time; its picture quality and black levels don't hold a candle to this one.Also, going from 42\" to 65\" is like having a hallelujah chorus sing every time you turn it on. It's pretty glorious.Since picture quality is highly subjective, I will leave you to the professionals for their specific opinions and testing results (CNet has an informative review up). As for my personal opinion, the picture is stunning with Blu-ray and HD streaming content (Netflix, Amazon, and Vudu via the PS3). Gaming, specifically related to input lag and fluid motion, is an absolute joy to behold. The ST60 series was on my short list, but after the definitive input lag tests on those sets, I passed them up in favor of what I found to be a better deal in the S60 series.In terms of the visual aesthetic, this TV looks like a much more expensive model, with a particularly slim black bezel (it's about an inch) and understated stand. To quote one of my more eloquent friends, her first reaction to seeing the set when turned off was, \"Whoa...fancy.\"Prior to purchasing, I spent some time trying to figure out if this TV would be too big for the space I wanted to put it in, and ended up addressing that question with about $4 worth of poster board stapled to the measured dimensions of the TV (for each size in this series you can easily find its specific measurements). I simply took the measured, combined pieces of poster board and held them up over my existing stand, and judged accordingly. And then grinned for about five minutes. To those of you debating a larger vs. smaller model, I'll relate one of the forum threads I found in which one of the early S60 owners simply said, \"How often have you ever heard someone say they wish they'd bought a smaller TV?\"The one serious knock (and honestly, the only legitimate knock I've heard against this TV) is that it is highly reflective in well-lit conditions. That point cannot be over stressed; this TV is not for you if you can't control your viewing room's lighting conditions. I hung blackout curtains in my home theater room (which I'd recommend doing regardless of your TV choice), and in those low-light conditions, the picture really shines. This TV becomes a mirror (a good-looking one at that) in bright conditions, so keep that in mind.All in all, I cannot recommend this TV enough, especially for the price point. I would suggest you go for a larger size if within your price range, and do what you can to control the lighting conditions in your viewing area. That's one particularly minor stipulation for an otherwise outstanding TV.", "Date": "May 10, 2013"}, {"Title": "Great alternative to the ST60", "Author": "Hayden Lindwall", "ReviewID": "R2KONQ18WT167R", "Overall": "5.0", "Content": "After remodeling our basement and media room , we needed to find a nice TV. So the search began... We found that most of the LED options on the market were unacceptable. Horrible clouding and flashlighting, very poor black levels, etc... Plus, to get an LED TV that can compare to the picture quality of this S60, we would have needed to spend $3000+. At first we were hesitant to go plasma because of \"burn-in\", thickness, and some other issues on older models. I can assure you those issues no longer exist on modern plasmas.I was originally drawn to the ST60 instead of the \"base model\" that is the S60. However, the input lag is awful on the ST60. It is very annoying for any sort of video gaming. I found that with the S60, the difference in picture quality is negligible and the lack of input lag is a HUGE advantage. I realized that I will never use 3D and that my Mac mini and Xbox have all the apps I could ever want/need- so I picked up the S60.Let's start with the picture quality- it is fantastic. Turn off Eco-mode and you're set. There are some great settings on AVSForum if you want to dial it in and make it even better. But even the stock settings will look amazing to 95% of people. Blacks are extremely deep and colors are vibrant. After watching the S60, it is amazing how washed out picture looks on our LED TV. It's almost unbearable to watch after getting used to the S60. Not sure what else to say regarding PQ- you won't be disappointed.Other things:Design- I think it looks nice on the wall. Not the most beautiful TV ever made, but still very nice and the frame is very small. It has a nice profile.Glare- I was originally going to get the 65S64, which is the S60 with the anti-glare filter from the ST60, but they sold out everywhere. Glare has not been an issue even with all of the lights on in our basement. If you have it in a room with a ton of windows, and no blinds, or if it is going poolside in the backyard- this may not be the TV for you. Basically as long as you don't have direct sunlight that you can't control, you shouldn't have an issue.Overall, the S60 is a home run. We are picking up another S60 for the living room next week. I really believe it is the best value on the market today.", "Date": "August 15, 2013"}, {"Title": "Replacing Viera 50\" bought in 2006 for 1/3 of the cost", "Author": "mr engineer", "ReviewID": "R2BZGVRJ4FCD8N", "Overall": "4.0", "Content": "It replaces a 2006, 50\" Viera and seems to be the same quality product but a lighter and smaller set built around the same screen size.  It was delivered to my living room and set up and checked.  I was very happy with the delivery.  The set has an improvement that lets you directly access internet movies from several vendors by using my wireless network in-house server.  I am not much of a pay-per-view person but U-tube videos are free.  The only drawback compared to my older set is the lack of a reflection free screen.  The older model featured some type of coating that stopped the mirror effect of lighting on the screen.  The new screen acts like a mirror and reflects lighting brightly.  Not good. The preference and set up menus are more elaborate to walk through than the older system but offer more.  Overall I feel the reliability will be good in this set as it has been in the past with no service needed for 6 years.  I gave my old set to someone and it was working like the day it was delivered in 2006.", "Date": "March 20, 2013"}, {"Title": "Plasma as PC Monitor", "Author": "Lynn", "ReviewID": "R272M3MB4IF4IC", "Overall": "5.0", "Content": "Don't let the stories of image retention or burn in sway you from purchasing Plasma as your primary PC monitor. I currently use the 60S60 as a home theater PC monitor for gaming, movies, and internet. Picture quality and \"input lag\" were the only two concerns while I was shopping for a new monitor. IMO Plasma delivers the best PQ versus equivalently priced LCD, LED. Input lag was a concern of mine for gaming, particularly fast paced games and first person shooters. After much research I found the 60S60 to have one of the better response times on the market.A few things you must be aware of:- Plasmas can be \"broken in\" for maximum PQ. I did this by running color slides off a USB drive for the first 100 hours- Plasmas can be calibrated. I found some generic calibration settings on the Internet. Alternatively, you can purchase the \"Disney WOW\" calibration Blu-Ray - great product, cheap- Soap Opera Effect: If your picture is too sharp/giving you the Soap look, you can adjust the settings to look exactly like the standard television. Search the Internet for help here.- Plasmas have a slight buzz from the rear of the panel. Not noticeable unless I walk behind the panel- Plasmas infrequently generate a feint \"pop\" sound, similar to a house settling. This is normal- Plasmas run warm- The 60S60 has a very reflective screen, not great for bright rooms1 Month Later:After using the set for 1 month I am extremely happy. No image retention after gaming, even with set HUDs. No input lag on any game. Great picture quality. Thinner and lighter than I expected. Love the ability to set each input with its own picture settings.", "Date": "June 5, 2013"}, {"Title": "Great basic plasma with large screen for affordable price", "Author": "Bruno \"Bruno\"", "ReviewID": "R3BNGX6UIVMSJS", "Overall": "4.0", "Content": "This is our 3rd Panasonic plasma TV.  Two 50's preceeded it.  This 65\" model was a great value for the quality at $1500.  You must tweek the video settings to get the best out of it, however.  The standard setting is too dim and the CATS system just doesn't work well, so turn it off.  Play with it till you get it right and you'll be rewarded.  Our other units are 2 and 4 years old and have had no problems.  The built-in wireless internet and apps like Netflix/YouTube are awesome for the price you pay.  It's also surprisingly light for such a big screen (85 lbs!) and about 40% thinner than our previous units.Negatives:1.  On such a large screen, even at 1080p if you sit too close you may find the picture almost \"blurry\" compared to smaller sets.2.  Only two HDMI (fine with me), but it can be limiting with some setups.3.  No RCA audio out for older or more basic devices such as wireless headphones for Xbox, only optical audio out.  Work-arounds exist, though.4.  Some may not like the expensive looking metal trim on the edge if they want an all-black setup.  Again, I could not care less.5.  There is some reflection if you have a lamp on behind you or it's bright in the room.  Just place light sources further to the flanks of the unit and the problem vanishes.6.  Still tweaking, but picture may not be as sharply focused as our 50\" models.  This may also be due to the huge size of the image, where you notice flaws in the signal more than on a smaller TV.We went with it for the quality, reliability, and vivid image vs LCD/LED TV's.  We've had two of those and were disappointed with both, one of which died after a year of use.I would highly recommend Amazon's enhanced delivery and buying direct from Amazon.com rather than other sellers here.  They bring it in and set it up so there is no question about a broken unit being an issue.  We tried another 60\" unit from another (highly rated) seller and it arrived with a cracked screen.  It's been a hassle getting it picked up and a refund issued.  Also, there are some reports that warranties on non-approved sellers are not honored.  Amazon sends your unit out in a smaller truck that can actually get in your driveway manned by experienced TV delivery men.  Others just ship it freight in a huge semi truck  and hope for the best.  In our case they didn't even call first, but showed up at 10pm!!! on a Saturday night with a huge rig and we had to actually help them get it in.  In our case, even the seller recommended we not try them again, as shippping cross country such a delicate device there was plenty of chance of a box getting dropped or mishandled and I assume they were not relishing having to file a claim with the shipper again.", "Date": "April 11, 2013"}, {"Title": "Excellent TV, especially for the price", "Author": "Nicholas Decinque", "ReviewID": "R2H54KLCCKHOD0", "Overall": "5.0", "Content": "I ordered this tv for $669 with free shipping. CEVA did a wonderful job getting the TV to me and was right on time with everything they told me. I'm not sure what kind of complaints people would have with the shipping company, but from what I experienced they were wonderful. I also only live 10 miles from their distribution center, so maybe if you live very far away from a center they may be more difficult to work with. The TV came packaged in a very large shipping box, and inside of that box was the TV box. Everything was very secure and undamaged. Lots of foam protecting everything.Exterior:I have the 50inch TV. It's a good size TV. Weighs around 60lbs. It's rather difficult for one person to pick up and set up, but it can be done. The design is very nice, a little understated. It's thicker than a nice LED, but it's thin enough to not matter that much.Sound:I'm actually impressed with the way the speakers sound on this TV. They are much better than I thought they would be. Perfect for any normal circumstances and video games. For movies I still use my surround sound system. You have a myriad of sound options so you can tweak whatever you want. The sound comes out crisp, clear, and can get very loud. Of course if you need some good bass and multi channels then get a sound system.Features:It only comes with 2 HDMI inputs. I don't mind it that much, but I can see it being a problem if you have multiple devices that need to be plugged in. It has built in wifi and an Ethernet connection. It also has digital audio output which is nice. Nothing out of the ordinary as far as inputs/outputs go, but you can't expect a lot from a sub $700 TV. There are enough menu options to keep almost everyone satisfied. You can tweak every setting that you would possibly want. It does have a couple of internet apps. Netflix, Amazon, Youtube, a few more. The apps are a little slow, but work very well. We use our smartphone to control the youtube app on the TV. It makes it much easier and makes browsing youtube just as easy as it is on the computer.Picture:THIS TV WON\"T LOOK GOOD UNTIL YOU TWEAK THE PICTURE SETTINGS. This is a common complaint that people can't seem to understand. For starters, there is an eco mode on this TV (and a lot of other tv's). What this mode does is it dims the brightest and contrast down automatically, so it basically washes out everything and makes it look terrible just to save some power. When you go to a retail store (Best Buy etc...) and see this TV I promise that the eco mode is turned on and that's why the TV might not look so good. If you can ask an employee for the remote and turn the setting off. Once the stupid eco mode is turned off, you can make this TV look spectacular. There is a pre-loaded setting on the set called \"Vivid\" and it looks great. Colors are so pure and blacks are as black as can be. Seriously the blacks on this are as black as possible. This is the best picture I've seen on a TV under $1000, maybe even under $2000. An again, once you turn the eco mode off, the TV is plenty bright enough and the whites are very nice.Bad Stuff:The TV (like most plasmas) does make a little bit of white noise from the panel. You can't hear at normal volumes over the tv, but if you have the volume low then you can hear it. THE GLARE IS NOT AN ISSUE. If you have blinds of curtains, don't worry about the glare on the TV. If for whatever reason you always have light in the room then you may want to get the S64 from Costco (same TV with the antiglare coating). But the glare has never been an issue in my living room. However it does look bad at Best Buy with all of the bright overhead lights.Verdict:BUY THIS TV. As far as I'm concerned, this is the best TV under $1000. Don't hesitate to pick it up, and be aware that the TV will look much better in your living room than it does in the showroom of a store.", "Date": "September 2, 2013"}, {"Title": "SOMETHINNGS ARE NEVER WHAT THEY SEEM.", "Author": "PondKeeper \"PondKeeper\"", "ReviewID": "R17AEIMJI722VW", "Overall": "5.0", "Content": "I bought this set locally because I sell them at a retail store. Customers always run to the LCD or LED TV's because they are the brightest. None in my opinion are as black or as accurate in color as this TV or any other plasma set.  Next time you shop in a brick and mortar store always look at the colors green, and the flesh tones,  plasmas produce a natural greens, NOT a phosphorous looking color green and movies look like 35mm film not the appearance of being shot on a video camera. If they look like just a video than you will see that in the lack of good flesh tones. Look for blacks and greens if they are right chances are you will be happy with any TV. Brightness could be factor, but all plasmas are generally dimmer than other types. But way more accurate regardless of 60,120,240 HZ rates. Except blue ray disc and gamers will provide 1080P most are interlaced at 1080I.", "Date": "July 4, 2013"}, {"Title": "great tv", "Author": "anonymous", "ReviewID": "RIZJY27EVU2WC", "Overall": "4.0", "Content": "This is a great tv. The picture quality is amazing, and setup is really easy. I was looking for a no-frills tv, without 3D.  The tv connects to your wifi, and its ready to go. It connects to netflix, and has a connection to other online movie providers (Amazon, hulu, you tube,etc.).  The only slight issue is that there is no filter on the screen, so if there is light, you'll see a reflection on the tv. It doesn't bother me, but know that it happens. And it's really not too bad, but it might bother some folks.  For the price and quality, it's a good buy.", "Date": "April 2, 2013"}, {"Title": "PS4 and Xbox One certified!!! they both run amazing ..no lag", "Author": "Tara Soper", "ReviewID": "R3TCNBBISUQ8VB", "Overall": "5.0", "Content": "Seriously for the money you spend, you won't find a better deal on this planet. This TV only has about 20 hrs of usage time but Im already amazed of the out of box picture quality its outstanding. Then I looked the model # up on cnet .com and used their inputted professional picture settings, and was completely blown away with the black levels..sure their are TVs that are better but they'll have to cost a lot more to match . I strongly advise a look into this TV before they get discontinued. ( only because 4k ,UHD, OLED, are here and will eventually come down in prices with expansive models, plus plasma s tend to use more energy then modern day LCDs and LEDS", "Date": "November 29, 2013"}, {"Title": "Good Value For Dark Rooms", "Author": "J.T.K. \"Tony No Baloney\"", "ReviewID": "R2B57L3DEQV7PL", "Overall": "3.0", "Content": "This is a nice TV with a very good picture, IF, it is placed in a dark room and the lighting is carefully controlled in order to minimize the reflections. Otherwise the reflected images overpowers the programming and it is nearly impossible to watch. It has a pretty basic feature set as far as settings and apps but they were adequate for me since I would be happy with a true monitor because most of the sources for content require a second box anyway whether it be cable, bluray, satellite, or a Roku type box.  But a 65\" plasma in the $1300 price range is hard to ignore IF YOU HAVE THE RIGHT ROOM!", "Date": "July 29, 2013"}, {"Title": "Excellent picture once you spend time adjusting it...", "Author": "Stu Ross", "ReviewID": "R1GUSS55VZDP76", "Overall": "4.0", "Content": "This TV comes with three (standard, cinema, and vivid) picture modes but none of them were suitable to my viewing preferences.  As someone who watched a lot of live sports on an LCD TV for the past 6 years, I have had a bit of an adjustment to watching them on this plasma set.  Since getting the set about a month ago, I have spent a significant amount of time tweaking the contrast (94) and brightness (+20) settings in order to get the picture to be as bright as I am used to.  Once you get this right, the picture is outstanding and you get the rich black tones that appeared as a very dark brown on my old LCD set.I had heard that plasma is a better technology for fast motion video like sports as well as avoiding the \"wash out\" effect when viewing from an off center viewing angle.  Although the wash-out effect is no longer an issue, I have had significant issues with the glare from the windows in my room reflecting off of the screen when watching the TV on weekend afternoons.  If you are planning to use this set in a very bright room, I would consider a matte screen alternative set or look at an anti-glare screen product online.", "Date": "June 10, 2013"}, {"Title": "INCREDIBLY GOOD (Except For... )", "Author": "Scott E. Bruneau", "ReviewID": "R14QQI9Q0AR9AK", "Overall": "4.0", "Content": "I researched TV's on CNet and this Panasonic sounded great. The price was excellent and there was a bonus with it I will write of later in this simple review.I was at a loss about the policy that Amazon has of a shipping company delivering on a set date; carrying the TV into your home and setting it up to make sure it works right. That is what happened with me. CEVA did all of that and at a very convenient time. Set it up and made sure it was working and left. What was VERY IMPRESSIVE was no dings dents or rips on the box. The box was big enough to fit a shetland pony in (ok not THAT big but you got the idea). The TV itself was in a box within with much packing material. THAT I liked. ALL of the packing was good. Once I turned the TV on, the instructions were SIMPLE. It is very intuitive and EASY. I got the TV primarily for watching movies. I have set it to Theatre mode and it is an INCREDIBLE AWESOME PICTURE! I never believed any image could be so good on a TV let alone on such a big thing. \"Big\" is what this is. The narrow black margin around it makes it look even larger. There is a delightful humility to the TV. It fades in the background so you can focus on what you are watching. It is low key. It does not shout at your eyes that \"YOU ARE WATCHING A PANASONIC TV!\". It shows you what you want to watch and NOT the TV.I think this is a BARGAIN if you have Amazon Prime. Free shipping this way. I have no idea what it cost to send it via a great company like CEVA. I am sure it was over $30. Considering the cost of a year of Prime... it makes the purchase a BARGAIN in my view. CEVA did a great job handling the product.As CNet had noted, 2 HDMI and 2USB ports. This is fine. It lacks the NUISANCE of so much extraneous BS. In conclusion... so far one of the best purchases I have ever made in my life.(NOTE ADDED LATER: There ARE a couple of  Nuisance  NEGATIVES to some if you want to use headphones and listen to TV or use the net with it. There IS NO HEADPHONE JACK WITH THIS! PANASONIC ENGINEERS SCREWED UP! There is I think a work around for it in purchasing a converter box (B003XCHCLC I have ordered the latter an hopefully it will work. The other negative is that yeah if you want to get content off the net you have to have a wifi connection. A no brainer I should have thought of duuuuh! So... Apple Express for wifi an extra $100 + the converter which is another $42 + a cable... easily an extra $150. The Add on's add up) But the TV is fine if you don't want to use wifi or headphones with it ;-)", "Date": "July 1, 2013"}, {"Title": "This one is a keeper!", "Author": "Kevin Beuret", "ReviewID": "R2FAEAHU5U4POO", "Overall": "5.0", "Content": "A few months ago my first big-screen TV started tinting everything green, and since the fault couldn't be repaired I started shopping for another unit.  It took me a while to get past my reservations about plasma TV's--the early ones generated a lot of heat, and in time the picture faded--but once I investigated the newer models I became convinced that plasma was the way to go.  I was not mistaken.  This particular model is first-rate in every respect.  The picture is sharp and clear, the color is brilliant (though it will need adjusting when you install the TV), and, unlike my rear-projection TV, there's no light bulb to replace.  The only possible drawback to this TV is its reflective screen, but that's a non-issue.  Depending on its placement, you can easily draw the draperies during the day to avoid reflections, and at night a subdued light source off to one side accomplishes the same result.  With an HD source the picture is so good that, for example, when watching a basketball game you can see the crowd as individuals, and the tight shots of players in consultation with their coaches show everything--the texture of the uniforms' fabric, the beads of sweat on the players' faces, and even the stubble so fashionable among today's younger men.  I recommend this unit highly.  For such a great TV, the price is amazingly low, and to this point I have no reservations at all  about having purchased it.", "Date": "May 20, 2013"}, {"Title": "LCD vs Plasma", "Author": "Mark C.", "ReviewID": "R7C092MYF48H6", "Overall": "5.0", "Content": "My only comparison is a four year old Sony 50\" LED. I had to have a backlight or my eyes would hurt from the excessive brightness coming from the tv even with the brightness down. Still the tv was consider a very good tv and I had it adjusted to Cnet specs for the best picture short of professional calibration.  This new Pany TC-P65S60 is so different with blacks actually being blacks, with the colors being pretty amazing, the whole picture being very easy on the eyes with no backlight needed. Sorry I can't be of more help for comparisons to other Plasmas but I just know this is a very good price of $1499 purchased at Best Buy for a 65\" tv with such a good picture. I do have to mention the TV's reflection being great so if you have a bright room where you can't get a good darkness in your viewing area you might want to go with another tv. But for those who have good control of ambient light this tv rocks.", "Date": "April 24, 2013"}, {"Title": "Panasonic p60s60 Plasma HDTV", "Author": "Ronald D. Harry", "ReviewID": "R7Z0UZAUABIK8", "Overall": "5.0", "Content": "I did a lot of reading [CNET reviews, magazines etc], visited retail stores, talked to friends before deciding I wanted Plasma and without all the latest bells and whistles like 3D and I already have wifi internet.  More than one friend said they could 'see' remnants of 3D interlace [assume they meant passive] where the picture seemed more jittery without the glasses.  Then the active 3D actually manipulated the glasses to sort of 'unsynch' each eye through very fast shuttering.  Didn't understand the technology completely, but suffice it that I did not want to be 'locked' into having to use glasses just to watch TV.  Articles emphasized that normal 2D was not altered without the glasses, but then, as mentioned, some friends told a different story.  My lean on 3D is that it is a passing fad, but I could be wrong; but I didn't need it.So, I went after the very best Picture quality within my budget to replace my old Samsung 60inch DLP [the core dlp chip went bad and Samsung was not assuming any liability for what they admitted were 'bad' chips; hmmm...a $2000 TV should last more than five years shouldn't it].  Anyway, the Panasonic P60S60 was exactly what I was looking for, with high reviews [at that price level], 2013 technology, with just the right amount of wifi connectivity that would be useful to me.WOW is all I can say about this unit's picture quality.  Wow again.  This is what HDTV is 'really' all about. Everything looks like 'blu ray' crystal clearness...you know, where it just jumps out at you.  I wish I could articulate it better...but Crystal Clear is all I can think of.Now, before you buy this set, make sure of the number inputs you will need, as this one offers only a kind of 'bare bones' connectivity, such as only 2 HDMIs, one component, a opitical sound output...and that's about it [well, with the standard coax from cable box connection no one uses since HDMI came out].  That was PERFECT for my setup.  But if you have a blu ray player, maybe a computer, or some other HDMI device, well, only 2 HDMI's could be a deal breaker.But that picture quality...WOW; I cannot imagine it being any better even in top end models such as panasonic has such high reviews for. I got exactly what I wanted, paid what I consider a fair price, and Amazon delivered timely and all intact.  Since I've only had this unit several weeks, I can't comment on the longevity, but at this point, I am well pleased, a satisfied customer.  Wow again [on the picture clarity]; sharp.", "Date": "April 16, 2013"}, {"Title": "Incredible value.  And plasma has always been a challenge in bright rooms...", "Author": "GoBoSox \"nakiejakie\"", "ReviewID": "R2BECI6KUPK236", "Overall": "5.0", "Content": "I often wonder about the lack of common sense from reviewers with some wonderment about plasma technology.  Since its inception, plasma has struggled with reflection because of the glass panes used versus the LCD \"screens\" that have much less difficulty diffusing light.  Several generations in, plasma still and will always have that challenge.  Many of the higher priced plasma lines use filter to try to reduce glare but the fact is that some people say that in some way alters their viewing experience.  So pick your poison.Fact is that plasma comes the closest to duplicating the CRT experience that has traditionally produced the best pictures but cannot possible be made to work with flat screens. The most expensive LCDs struggle to match the almighty black levels that plasmas have used as their edge on LCDs for several years.  All that being said, I've owned several plasmas (at least 8) and have also owned a Sony SXRD that was considered ground breaking just 3 years ago.  I've had LGs (and still do) and several Pannys in the past.  Owned the 800U that was considered just second to the vaunted Kuro back in 2009.  I also have viewed Sammys in friends' houses.This Panny is by far the best value that I've seen bar none.  To get a 65\" plasma for a shade under $1200 delivered even two years ago was unthinkable.  Somehow, Panny has found economies of scale and removed the gimmicky and virtually useless 3D add-on to hit that price point.The picture has outstanding black levels.  Excellent corner to corner linearity.  And deep, rich colors that belie its price.I tried 3D and found so few titles actually worth watching with actual 3D that was worthwhile that I returned the unit for this unit and have never looked back.  For reference, it's hooked up to an Oppo BD103D (the newest Oppo), DirecTV, Roku 3, and fed through a Denon AVR 3313ci.  Not audiophile level, but not entry either.Overall I give this TV the highest recommendation without reservation.", "Date": "November 3, 2013"}, {"Title": "One week in...", "Author": "R. Alexander \"Tech enthusiast.\"", "ReviewID": "R37E26NJF4IJJR", "Overall": "5.0", "Content": "After one week I am thrilled with this TV. Months ago I spent a lot of time researching the GT & ST versions, thinking that the S60 would be too far down the totem pole for me to want. Fortunately, the GT & ST versions were too expensive for me so I put the whole purchase on hold.Then I came back for more research and started digging in to what the real-life differences are between the S60 and ST60. As it turns out, the differences are few and far between for my use.I use this TV in a basement with no direct sunlight hitting the TV, and recessed lighting; no light directly hits the screen. Because of this setup, I am not affected by any glare issues. The anti-reflective (AR) screens in the higher versions definitely came with a cost. I can certainly see that this TV is extremely reflective, though, but only when it's turned off (and looks like a mirror). Overall, the glare has not been a negative for me, because of my particular setup.Some of the other benefits of the more expensive models I was willing to live without. Years ago I bought a 50\" Panasonic Plasma from Costco - it was as low-end as they made them. But, I always thought the quality was amazing (even compared to other Plasmas and LCD TVs). I figured, if I'm going from a low-end Panny to a low-end (bigger) Panny, then I won't know what I'm missing. Sure enough, that has been the case. I've been very satisfied with the picture quality.I use an AV Receiver for sound, so I am unable to comment on the quality of the Internet apps (the sound for internet apps only goes through the TV, not the receiver). I can tell you that they work, but I have very limited experience with them.One word to describe the TV? Value!! I got the 65\"  TC-P65S60 for $1288.00. The higher models go for 50% and 100% more (and even more for VT). I am extremely please with my purchase and so glad that I took the extra time to look at the S Series, in addition to the ST & GT.", "Date": "July 31, 2013"}, {"Title": "Great picture, easy set up.", "Author": "Lathrop Bob \"Bob\"", "ReviewID": "R2BCVLNFYDSGOV", "Overall": "5.0", "Content": "This TV replaced an 8 year old LG plasma that finally died.I bought this same TV a year ago for a family room TV. That one was last years model. This TV has some great improvements over last years. The built in WiFi was a snap to set up. No external WiFi unit needed like the last one. Picture quality is sharp and amazing. The weight of this TV is about half of the original Panasonic 50\" plasma I bought about 6 years ago.", "Date": "May 27, 2013"}, {"Title": "Very Impressive T.V.", "Author": "RH45011", "ReviewID": "R3P2MBE23LLCG2", "Overall": "5.0", "Content": "We were upgrading from our expensive 50\" Toshiba DLP television after it gave out and we were tired of buying $200 bulbs every 8 months. This panasonic t.v is amazing. The picture is very rich (I'm a graphic designer, so having a great picture and true to color performance is important to me.) blacks are rich blacks and colors pop. This tv has really cool features and I'm sure a lot more that we don't know about yet since we just got it 5 days ago. We have watched Netflix straight from the tv, perused my pictures from my USB and played XBOX on here.Games are amazing on here. Call of Duty and NASCAR show so many details that we never were able to see on our old tv. We were both asking each other \"did you ever notice that before\" or \"look at those shadows!\" I could see people coming around corners on COD before they came! I never was able to do that before! Simply amazing. My husband ran the white screen after playing for several hours, so far everything is awesome. Burn in was the only thing I was afraid of with plasmas, so hopefully that won't be an issue.So far, awesome color, features and price. we love it.", "Date": "May 13, 2013"}, {"Title": "Amazing Picture - Best value out there!", "Author": "TW \"UTB!\"", "ReviewID": "R2D25KPRTMI921", "Overall": "5.0", "Content": "Firstly, I am not a big reviewer of products, but I am a research hound.  I was looking for great picture without all the bells and whistles.  I did not want 3D and already have a Roku3 for all the apps in the world.The quality of the picture compelled to comment on this great TV.First: $699 can't be beat.Second: the picture quality is amazingThird: Amazon TV delivery service is 1st class.Fourth: calibrate the picture as per the review from CNET.com and you cannot go wrong.Do be aware that the glass is very reflective, so be careful if you have a light source that will reflect on the glass (i.e. in front of the TV). We have found that side lighting does not interfere.I have set mine up with a Roku3 and together we have the best apps, the best picture quality and pretty good (definitely not great) sound.Highly recommend.", "Date": "May 2, 2013"}, {"Title": "great!", "Author": "T. Esmanech", "ReviewID": "R346ZBTR51JC1I", "Overall": "5.0", "Content": "I just received it, connected it and it works great, a big upgrade from my previous DLP one.It is the perfect TV if you are not looking for 3D and all the \"smart-tv\" features, though it does come with youtube, amazon and netflix.The contrast is super great, great blacks.I was initially worried about the reflection in a bight room, and I just have to lower the shades. It is more than acceptable.I do raccomende it.", "Date": "April 29, 2013"}, {"Title": "Awesome picture but screen is like a mirror.", "Author": "JFLY", "ReviewID": "R1HCR7IDP6JTAU", "Overall": "4.0", "Content": "Right out of the box the picture quality is awesome, great black levels, contrast and color. The thing that didn't work for me is that the screen reflects a lot (I posted 2 pictures in the product gallery). The tv was in a basement with no windows, recessed lights and everything reflects even is the scenes are not dark (refer to pics), so unless you plan on watching tv with the lights off all the time this tv is perfect for that. Unfortunately this was the deal breaker for me and I had to return it and got the ST60 which fixed the problem and I couldn't be happier.Oh yeah, another thing, the HD amazon streaming quality is lower than Roku's quality, same as the VT50 which I also have. The new ST60 HD amazon streaming quality is awesome and is just like the Roku's quality or even better. I only tested with amazon because that's all I have at the moment.Some people might be ok with the reflection and I thought I was going to be ok as well but that wasn't the case, the screen filter makes a huge difference. Obviously this is my personal opinion.Good luck everyone  :)", "Date": "April 18, 2013"}, {"Title": "Great plasma image, but dim compared to plasmas of the past--uses aggressive ABL", "Author": "M. Trotter", "ReviewID": "R3U5DQKAC3CBMD", "Overall": "4.0", "Content": "First, let me say I bought this TV to replace a Toshiba 50\" plasma that finally died after about 6 years, and I also have a 42\" Panasonic plasma in a guest bedroom.  The Toshiba plasma was able to achieve a pretty bright, contrasty image, even on bright content.  I also, 3 or 4 years ago, bought and installed a 55\" Panasonic plasma that has a fantastic bright and bold picture for my parents.  So, I do have significant experience with plasma TVs.  I ended up returning the 60S60 due to the below issues.The problem is that, in an effort to increase longevity and to reduce energy consumption, the new Panasonic plasmas aggressively utilize ABL, which will dim the screen whenever there is a lot of bright or white content on the screen.  This results in whites becoming sort of a light gray tone, and people's faces appearing dull and lifeless.  No amount of adjusting the settings was able to ameliorate this effect. Perhaps this would not be an issue for younger eyes than mine, but I found myself straining to really see the image well, and my eyes test out at 20/20.The Panasonic 60S60 does produce fantastic colors and black levels, so if one has a dark room, and mainly watches Blu-ray or streamed movies it represents a great value.  But if one watches a lot of news and sports programming, the constant dimming of the picture could be a problem.  Now, the Samsung 8500 series plasmas do produce a much brighter image and have less aggressive ABL, but are going to cost you much more.  I never thought it would happen, but at this point I am researching and trying to find a LED TV with a combination of decent blacks and brights, along with acceptable motion performance.", "Date": "November 27, 2013"}, {"Title": "Good tv but too hot", "Author": "Rob", "ReviewID": "RDY52VEGPO8JP", "Overall": "3.0", "Content": "Very nice picture and very bright. User friendly and overall looks great. The only problem was that it ran too hot. It was a big problem for me as I live in a warm area and the screen would get extremely hot. When the screen has a lot of white color, it gets super hot. Not so much when it is black or dark. The heat was noticeable and significantly warmed up the tv room. Otherwise it was a great tv at a great price", "Date": "November 15, 2013"}, {"Title": "Excellent Choice for a Large Plasma", "Author": "Jason O.", "ReviewID": "R3MKOXZUM767J", "Overall": "5.0", "Content": "I did a significant amount of research prior to this purchase.  I read a lot of reviews (Amazon, Crutchfield, CNET, and others), studied the specifications, filtered through the comparisons of plasma vs. LED/LCD, and ended up choosing the Panasonic plasma for the following reasons:1.  Our living room is not exposed to significant direct light (uncovered windows, skylights, etc.), and the majority of our viewing time takes place in the evenings in a darkened room watching either Blu-Ray discs or HD programming.  Picture quality took precedence over brightness offered by the LED/LCD displays.  This was a major factor in my buying consideration.  I would echo the warning of \"beware the glare\" if you have a bright room with a lot of reflected light / open windows and you plan on daytime viewing.2.  Picture quality was my primary buying consideration, and the color depth and image representation were extremely well reviewed.  Yes, there are TV's with higher resolution, but the majority of ratings and reviews put the picture quality on par with the flagship models from a number of manufacturers.  This is significant, given the price point variances.3.  The plasma had slightly better viewing angles, and was exceptionally well rated for uniformity, color, and deep black levels.  Again, you can find slight improvements in the quality compared to more expensive models, but to me the difference wasn't significant enough to warrant the increase in price.4.  I opted out of selecting a 3D TV (although available in the ST60 series) based on content availability, my lack of personal motivation to find and maintain the \"right\" 3D glasses, and the price difference.  Additionally, the Panasonic ST60 series was rated with higher input lag, a potential issue for game image rendering5.  The Panasonic offered a moderated version of the \"Smart TV\" - internet connectivity for my favorite providers (Amazon, Netflix, etc.) without a jumble of apps and advertisements to sift through.  Simpler being better, in my opinion.Enough of the research notes, though.  Let's get down to the actual review:I LOVE this television.  It stacks up to the excellent reviews and is a joy to watch.  The sheer scope of the 65\" screen is astounding, and it provides visibility to a whole new level of detail, especially with Blu-Ray movies.  This is especially evident with epic action-adventure movies like Pacific Rim, The Avengers, and the Transformers and Iron Man series.  \"Inky blacks\" and spectacular color bring a realism to screen images that elevates the entire viewing experience.  I paired this TV with an excellent home theater surround sound system and am enjoying re-watching my entire HD movie collection.There is some glare on the screen during mid-day from a sliding glass door directly opposite the television placement, but as indicated in # 1 above, the infrequency of day-time viewing was not enough to over-ride the picture / color quality trade-off.  Closing the blinds in front of the sliding glass door reduces the glare enough that it's not a distraction, but I recommend consideration of your viewing environment to ensure this isn't an issue.PS3 gameplay is smooth and the graphics are precise.  The opening image sequence from Injustice: Gods Among Us is nothing short of spectacular.  Fight sequences and cut scenes in God of War: Ascension are exponentially better.  Again, screen size supports a level of detail that changes the entire experience.  This holds true for games as well as the movies, where intricate details in character expression help \"sell\" the scene.If I could change one thing, I would add Rhapsody as an App native to the television, but I have access to the subscription service via my receiver.  All in all, I couldn't be happier with my purchase.  Affectionately dubbed the \"BFT\" (Big Freakin' Television), we love watching movies on the huge screen, are consistently in awe of the detailed imagery, and find it easy to get pulled into the stories.  It's great to have found a product that has such high quality at such a reasonable price.  Zero buyer's remorse.", "Date": "October 23, 2013"}, {"Title": "Fantastic TV", "Author": "Bill Chapel", "ReviewID": "R34BRAWIDZ12Q0", "Overall": "5.0", "Content": "Not much to say other than what has already been said. Picture is great.  I was a little worried about glare because my living room has a lot of windows, none directly across from the TV.  It works great. Just set it on vivid during bright days and cinema at night.The only thing I would suggest is that if you are flush mounting the TV, you buy some HDMI 90 degree elbows because the HDMI are set up to come straight out of the back of the tv, not on the side, if that makes sense.I run all HDMI through my receiver so I do not need more than one HDMI.  Its a fantastic television.", "Date": "September 11, 2013"}, {"Title": "Amazing TV if you have an Xbox/PS3.", "Author": "Metalmx", "ReviewID": "R1ZGH9F7ILBR6I", "Overall": "5.0", "Content": "So as a stand alone unit, This TV is still an amazing value for the money. All the reviews about amazing picture quality are true. Yes the reflective nature of the panel is a bit of a downer if light is an issue. However, for a bedroom tv that is watched 80% during the night time it's amazing (and a good set of curtains does the trick during the day). All the smart features on other TV's are great if you don't already pay for the use of them on a game console. However i pay for the Xbox and it's live services. So why should I pay 1k+ for a tv that is redundant in features I'm already invested in? Amazons delivery was great and easy. Tv arrived in perfect condition and tested by the moving crew. I have this hooked up to the new Vizio 5.1 sound bar kit at costco (which is on sale this month!!!!). I have Wireless 5.1 surround in my room with great sound and a premium picture for under $1000 out the door.Even if you don't have a game console...Netflix/hulu/and amazon are the big three i use 90% of the time anyway. The only thing i really need the xbox for now is HBOgo.", "Date": "June 13, 2013"}, {"Title": "Great TV for the money", "Author": "Dan", "ReviewID": "R2BWJDH0MYT5J6", "Overall": "5.0", "Content": "I have only had this set for a couple of weeks now, but so far I am completely happy with it. It is the perfect size for the family room. I watched Django Unchained in Blu-Ray and the picture is awesome. So far I have not experienced anything I would categorize as a con. It is a Plasma, so you should be aware that the screen is extremely reflective if there is any light opposite the screen, and it is much better viewed in a dark room. I bought it for watching movies in a darkened room. The TV is pretty  heavy, so if you plan to hang it, make sure you have a strong helper. I would definitely recommend this to a friend.", "Date": "May 10, 2013"}, {"Title": "Best value TV on the market", "Author": "Matthew", "ReviewID": "R1HU9FOQOE69EB", "Overall": "5.0", "Content": "This is my first plasma TV. I had been using a LCD monitor for gaming and a CRT TV nearly as old as myself to watch movies, but finally decided to bite the bullet when I heard about this TV.One major factor in choosing this TV was input lag. My grandparents have a $2000 Samsung LED TV that I've played some games on. The picture looks great but there is a 1/2 second delay between pressing a button on my controller and action happening on screen. Apparently this is a problem with almost all TV's... except the Panasonic S60. As soon as I had my TV hooked up I nervously loaded up a game and to my surprise there is 0 input lag! Its as good as my computer monitor!I put in a Blu-Ray and as advertised, blacks are completely black. Plasma TV's don't have a backlight like LCD/LED TV's so if a scene is dark it will actually be black instead of dark gray. Colors are also amazingly vibrant. Its like looking through a window. The only downside to the picture is if a scene is mostly white the TV will darken the picture slightly to avoid overheating. Its barely noticeable most of the time however.Protip: Turn CATS off and make sure the contrast is turned up to 100 for the brightest picture. I'd also disable all the anti noise filters, they remove some picture detail.One more thing to mention. The higher end Panasonic plasmas have an anti-reflection filter, which this one lacks. The screen is very reflective so its best used in a dark room.", "Date": "April 20, 2013"}, {"Title": "awesome tv", "Author": "tonywelp", "ReviewID": "R3V8ZV6LCGRFJP", "Overall": "5.0", "Content": "the picture on this tv is fantastic right out of the box. the only thing i had to do was turn off the c.a.t.s.the c.a.t.s feature makes the picture too dim for me.for $699 from amazon this set eats the competition can't say enough good things about the picture.it also has wifi.i guarantee this is the best set for the money.it also works great on fast motion ps3 games just an awesome set.", "Date": "April 8, 2013"}, {"Title": "Great television, Glare Issue is Overblown, Awesome Picture Quality for the Price", "Author": "William B. Woodrum", "ReviewID": "R28BTSQHIOCCEM", "Overall": "5.0", "Content": "Great television. I think the glare issue is overblown. I have the 60 inch version and it is just a great television with just enough smart features. Picture quality is very good for the price.", "Date": "November 29, 2013"}, {"Title": "Excellent Plasma TV", "Author": "Jtartaro", "ReviewID": "R1CB3CWIDV2UUO", "Overall": "5.0", "Content": "This TV is awesome. I got the TV when it was scheduled with no shipping damage. I installed in my bedroom and it worked perfectly. It is very easy to setup including WiFi. I did change it the network connection to wired, only because i get a full 100mb to the TV for streaming. Netflix, Amazon, HULU streaming is excellent and easy to launch and run. I installed a Samsung Blu-Ray player to it and the HD resolution on movies like Nemo and Toy Story as just superb.  If your thinking about getting a plasma, don't think about it, get this one. At 600 hz, the motion is floor-less.  The brightness has 4 setting for different light conditions in your room. I have not needed to set it on the brightest mode. My bedroom is on the east side of the house with 4 large windows and a 6x8 sliding glass door. During the day, I have no problems with TV brightness. One last comment, the view angle is just great. My bedroom is about 25 ft long by 18 ft wide. I can see a perfect picture from anywhere in the room. You will love it.", "Date": "November 29, 2013"}, {"Title": "Even better than advertised!", "Author": "Richard Staats", "ReviewID": "R1L4YDKX8PJ3PR", "Overall": "5.0", "Content": "The picture is crisp and beautiful.It was easy to set-up.I have nothing but great things to say about this Plasma HDTV.", "Date": "November 21, 2013"}, {"Title": "Best Tv I ever seen! No joke!", "Author": "gary purdy", "ReviewID": "RLCXBHG3WTO49", "Overall": "5.0", "Content": "First off I bought this tv along with my Playstation 4 and good god! This TV is seriously incredible! The colors are amazing and Picture quality made my jaw drop! This tv does reflect but I never notice it as the uniformity, brightness and screen quality eliminate this issue. If your a gamer then buy this tv! I swear you will be very satisfied with your purchase! I love you panasonic!", "Date": "November 19, 2013"}, {"Title": "Panasonic 65\" TC-P65S60 comparison", "Author": "Rodney N. Larson", "ReviewID": "R3UQTIVQSF8Y9O", "Overall": "5.0", "Content": "I had this sitting side-by-side for days with a 70\" Vizio LED/LCD, and hands down, the Panasonic Plasma 65\" was better.  Yes, in my living room with several windows, during the day, there is more reflection, but it doesn't really bother me.  Overall, I'd take the pana plasma over an LCD.", "Date": "November 6, 2013"}, {"Title": "Stunning picture quality, but no frills.", "Author": "Shawn Hagewood", "ReviewID": "R30E11Z3Q8ZS90", "Overall": "5.0", "Content": "I have owned this TV for about 3 months now and as an audio/visual enthusiast, I can tell you that it is one of the most beautiful quality pictures I have ever seen.  It does not have 3D or lots of internet apps, but I don't use those anyway.  I primarily use this TV to watch cable TV/DVR, streaming and Blu-Ray movies and Netflix.  The TV does have Wi-Fi built in which is nice and works wonderfully with the Netflix app.  For the money, this is such a beautiful TV and at 65\" looks amazing in our living room.1 CON:This TV is VERY reflective!  There is no anti-glare coating like on some plasmas and led TVs, but if you primarily watch TV at night or have a room where you can close the drapes, it's not too bad during the day.  However, even at night if you have lots of lamps and overhead lighting - you will have to turn them off or dim them down low... Unless you enjoy looking at your own reflection in the TV screen!", "Date": "October 21, 2013"}, {"Title": "Panasonic TC-P65S60 65-Inch 1080p 600Hz Plasma HDTV", "Author": "Testlight", "ReviewID": "RLT4ZJGJUBXE8", "Overall": "5.0", "Content": "All I can say is WOW. I must have searched & researched TVs for over a year before settling on this Panasonic. I will say that CNET reviews weighed heavily in my decision to purchase, along with the excellent price from Amazon! The TV is used in a well lit room with plenty of windows & outside light. While most of my viewing is at night, the daytime picture is still excellent, with minimal glare or reflections. After the 100 hour breaking period, I adjusted all picture settings with the Disney World of Wonder blue ray disc(also purchased from Amazon, & HIGHLY recommended). The picture is warm & life like. I am very satisfied with this purchase. It was worth the wait!", "Date": "October 20, 2013"}, {"Title": "Panasonic TC-P65S60 65 inch HDTV", "Author": "Narrah McCoy", "ReviewID": "R2HBSXZ35NEEXS", "Overall": "5.0", "Content": "Excellent picture. I have no trouble with reflection, as reported by some people.The only downer I have is the sound from the TV speakers. However this is to be expected.", "Date": "October 18, 2013"}, {"Title": "Consumer Reports #1 TV for 2013 Lives Up To It's Reputation", "Author": "Adam Mills Strom \"Due South Productions\"", "ReviewID": "R3EYJ3PK2RZIG8", "Overall": "5.0", "Content": "Consumer Reports rated this #1 so I bought it.  I don't have a lot to compare it to other than my 2007 Samsung 720p Plasma.  But it looks better than that and even though I've been diligent about turning on the burn-in protection after every use; I yet to see one ghost image even after leaving menus on for minutes at a time.  Very impressed.", "Date": "October 15, 2013"}, {"Title": "Fantastic Picture, low price, low lag for games. However, TV audibly \"pops\".", "Author": "Matthew", "ReviewID": "RM1H85VZFFXO1", "Overall": "4.0", "Content": "I wanted to buy the Panasonic ST60 but it suffers from extreme lag which is bad for games so I had to look elsewhere. I considered higher end Panasonic Plasma TV's but they have more lag than I wanted too. I looked at other brands, specifically the Sony KDL-55W802A and 55W900A. The 802A has an unimpressive picture and the 900A is unavailable in local stores to examine.I almost bought the Sony KDL-W900A sight-unseen but realized something. I could buy this TV (Panasonic TC-P50S60) for 1/4 the price, it has a great picture and there is no uncertainty in the purchase.Having owned this TV for a couple of weeks now, I decided to write this review. I won't bore you with details except to say I doubt there is a better TV anywhere close to it's price. The picture is fantastic. Way better than the Sony KDL-W802A I looked at in stores (or any of the other low-lag TV's I looked at in person).However, there are two caveats that keep me from giving it a perfect score of 5. The first is that the screen is extremely reflective. I knew this before buying it, but even in a light-controlled room I have had to make some adjustments to avoid reflections. The other problem I have with the TV is that it \"pops\" a lot. I believe this is heat expansion/contraction within the TV. It is annoying, but not so much to warrant a return. Periodically, there is a loud \"snap\" from the television, even after it has been turned off awhile.", "Date": "October 15, 2013"}, {"Title": "Great low cost TV", "Author": "Paulo", "ReviewID": "RWJ1BGUGD2DQO", "Overall": "5.0", "Content": "Great TV. The size does matter and the image is amazing. No reason to spend more on features you will never use. Very happy with the purchase", "Date": "September 17, 2013"}, {"Title": "Excellent Black Levels and Super Fast Latency for Gaming.", "Author": "Jeff D Mack", "ReviewID": "RSDK54B8Z93Q6", "Overall": "5.0", "Content": "I ordered this plasma tv based on cnet.com's reviews and I couldn't be happier.  The Picture quality when watching darker movies(The Dark Knight, Sin City, Tron Legacy)look amazing and my K/D Ratio in Call of Duty has improved as well.", "Date": "August 26, 2013"}, {"Title": "Don't look any further", "Author": "Savvy Shopper", "ReviewID": "R1I20R8PVJOL8R", "Overall": "5.0", "Content": "Not much to add to what has already been said. This TV reflects like a mirror but I knew this going in based on the reviews.  I have it in a basement with controlled lighting so that is no problem.  It will be an issue for you if you can't control lighting. The picture is awesome.  I own several HD TVs and this has the greatest picture so far. If you are like me and trying to decide between this and the next model up, save your money because this one does the job. I have a ps3, Xbox 360 w/hd player and they all look great. My kids do the gaming and there are no lag issues. Black levels are excellent.  Bottom line best value for my money which is what I look for in any product. Great TV.", "Date": "August 24, 2013"}, {"Title": "TV great. delivery poor", "Author": "Chris", "ReviewID": "R2EKL8CCRZR4DG", "Overall": "5.0", "Content": "The TV is great.  I love everything about it.  It was very easy to set up (you have to do that, the delivery people only turn it on to show it works) and it is very user friendly.  I was really buying the TV so I didn't let it affect my rating of the TV itself.  I'm sure Amazon uses all different delivery people, so you might have a better experience than I had.  My TV was delivered by Pilot.  They were terrible in their communications and shoddy in their delivery.  i have learned that Amazon simply reports what Pilot says.  Therefore, Pilot's website said the TV was \"out for delivery\" last Friday.  I then received a text from Amazon saying it was out for delivery and would come that day.  I took off an hour of work to be there.  Never came.  Pilot said it was actually given to a transfer agent or some such thing and would not be delivered that day.  Long story short, I got the TV Tuesday.  I received no communications not initiated by me until a phone call saying they were 2 minutes away.  They tracked dirt into my house, did not offer to take the box away ( i had already signed the checklist saying they had because I just wanted them gone).  Besides, I was fairly certain there were still items in the box I needed.  Very poor and not very professional.  Of course, there is no number to call Amazon on this.  All that being said, I love the TV, it is everything I wanted.  Beautiful picture, easy to set up.", "Date": "August 22, 2013"}, {"Title": "Beautiful picture quality", "Author": "Terry Weatherstone", "ReviewID": "RWRYRHNWOSABY", "Overall": "5.0", "Content": "This TV was in the top 5 recommended TVs on CNET.  It was the first of the top five with a price under 2500 dollars.It took some playing with the settings at first.  The picture was too dark and the brightness setting didn't seem to help.  We were on the edge of returning it, but we called Amazon tech support.  They identified the problem in about two minutes, and talked us through how to turn off the advanced black function.  Now we love it.", "Date": "August 6, 2013"}, {"Title": "Good value for the money", "Author": "Ralph Heimlich", "ReviewID": "R2J2X8CA4OPR84", "Overall": "4.0", "Content": "I got an open box deal on this and it's exceeded my expectations.  I use it in a pretty dark space (basement rec room) so the usual knock on plasma TVs doesn't in well-lit spaces doesn't apply.  The colors are very good and the sharpness at 1080p is great.  The internet connectivity to U-tube, Netflix and other services is fine, but it doesn't have a true browser.  That's ok because I have it hooked up to an old computer with an HDMI cable for surfing and other computer needs (just like a 50\" monitor).  Works great.", "Date": "July 29, 2013"}, {"Title": "This is a winner", "Author": "Bobby M.", "ReviewID": "R3HNO24HFNECCA", "Overall": "4.0", "Content": "Amazing picture and ideal for movies at night.  The glare can be an issue in the day, but that's the nature of plasmas.", "Date": "July 2, 2013"}, {"Title": "Great!", "Author": "Ed Lutterschmidt", "ReviewID": "RV7K7Z4SFM9JF", "Overall": "5.0", "Content": "I expected a good product from my research and wow, I got it.  This plasma HD is fantastic!  Picture, colors, ease of use, all are tremendous and can't beat the price.  Delivery was excellent also.", "Date": "June 29, 2013"}, {"Title": "Great TV", "Author": "Dan Bentley", "ReviewID": "R1FO7KR10YR16M", "Overall": "5.0", "Content": "I went from a 5 year old 720p 50\" pannisonic plasma that i thought looked great and this is quite a bit better. I watched Avatar and the colors and contrast are fantastic. The picture is vibrant and clear. I am also amazed how close i can get to it and the picture still looks great. I haven't watched any standard def content so i cannot comment on that but the multiple movies I have watched wheather on Blu-ray or HBO HD have been wonderful. I was concerned about the reflectiveness of the screen but don't have a lot of light to worry about downstairs to worry about upgrading to a ST60. There is still some noticable reflections which curtains will take care of over the one window depending on the seating location. Overall a great value for a big TV. The bezel is small and looks much nicer than my previous Panasonic. I would recommend this to anyone who can control the light in the room.", "Date": "June 28, 2013"}, {"Title": "I got exactly what I was hoping, really should be used with Blu-ray and FHD content", "Author": "Julian A. Lopez III", "ReviewID": "R1YW5XBNN4Q1CC", "Overall": "5.0", "Content": "This tv needs to be used with FHD(1920x1080) content to really see how good it is. It saddens me to see people put anything less than 720p on it, and those channels with black bars :( . Also, just to be safe, DO the Break-in of at least 100 hrs of full screen movie/motion content, contrast below 50 for that time. The speakers are alright, with some adjustment they are decent, but they don't produce anything intelligible below 150hz. Use it in conjunction with an AVR speaker system. Only two HDMI inputs, more of a reason to get an HDMI AVR  if you plan to connect HDMI cable+ blu-ray+ game console. Or you could just plug and unplug an HDMI each time. So, no screen wash-out, no ghosting, endless color adjustment, pixel shifter, screen wipe, its the best(looking,dependable) for the price in Plasma Tvs.", "Date": "June 14, 2013"}, {"Title": "Great TV", "Author": "lockedout", "ReviewID": "ROZ222DHBUA7I", "Overall": "5.0", "Content": "It arrived as scheduled, Amazon's people did a great job setting it up, and the picture is great. Really like the optical output for sound, allowing me to run audio through my stereo system. Would definitely recommend to others", "Date": "May 23, 2013"}, {"Title": "Just like the others", "Author": "Ricky", "ReviewID": "R29YRPVGSHNZRG", "Overall": "5.0", "Content": "This was my 3rd Panasonic Plasma and just like the others I love.  Its nice to know a product will be outstanding every time you purchase.", "Date": "May 5, 2013"}, {"Title": "What a Picture Right out of the Box", "Author": "Don Rich", "ReviewID": "R18P37YTVCBN27", "Overall": "5.0", "Content": "Fantastic!  I have no use for 3d or a smart tv so this is just what the doctor ordered!.  Easy to set up, and the picture was fabulous right out of the box.  I highly recommend this Plasma!  Amazon did a Best Buy Price match.  This is a Panny at its best!", "Date": "April 2, 2013"}, {"Title": "Excellent Television, don't buy the burn in hype.", "Author": "Anonymoose", "ReviewID": "R3CW7KKE7JYV4", "Overall": "5.0", "Content": "This is a fantastic set. When the price is considered it is an awesome value.I'm a gamer. I play a lot of games with static HUDS. Fighters, FPS, RPG, you name it. I spent time leaving this TV on with static images when I first got it to see if the burn in nonsense was true.The verdict: It is mostly nonsense. This TV WILL get very slight image retention. However it doesn't last long at all. Run the screen swipe, watch a full screen movie and it's gone. Also, when it is there it is very hard to notice. I was SO worried about this before I bought the TV but it is such a ridiculous scare tactic that I have to wonder if people right it because they are sociopaths that like to make other people sad. It is so ridiculous.The color reproduction in the set is pretty great. It beats my old LCD hands down. Black levels are impressive, colors are rich and accurate. I see no ghosting in anything.The only downsides:Only two HDMI ports. For real? This is just stupid.The screen has crazy glare. If you can't put up black out curtains covering black out blinds in the room  you have this TV in forget watching it during the day.Also, what people say about brightness in whites is true. Full white screens look dim. It sucks, but how often do you sit and stare at a white screen? While this a fair caveat I can't imagine it really means much to anyone.If you want BRIGHT during the day, buy an LCD. If you want an amazing picture and can control the light in  your room, buy this TV.Lastly, this TV has very few smart features which I personally thing is great. I find 3D and smart features to be worthless so it's refreshing to have a model that I'm not paying for that nonsense with.I can't stress enough how much burn in is NOT an issue. If someone is having burn in problems they are doing something wrong. Follow the break in steps when the TV is new. Create a DVD to run colors for a couple hundred hours after you go to bed. The color DOES improve when the phosphors are aged.Go to cnet to get calibration settings. It's easy and it makes a huge difference.Also, the picture is so good that at first you may think that it isn't. That sounds strange, but it's all about the source. If you are watching hi def, blur ray, playing an HD game, it's amazing. If you're feeding it a crappy signal it does not look good. However, if you're going to be watching SD content why are you buying an HD tv?", "Date": "September 7, 2013"}, {"Title": "Amazing picture, just make sure it sits far away", "Author": "Charles", "ReviewID": "R2L9DME9O7IYC0", "Overall": "4.0", "Content": "Just sent back my Samsung LED LCD TV and picked this up instead. The Smart TV portion of the Samsung just wasn't there, and no point in paying extra for something I won't use when a HTPC/set top box will do it better.Saw the amazing reviews here and decided to give it a shot.If you have a choice of getting the S60 or S64, get the S64 it has an anti-reflective add in the S60 doesn't. Otherwise it's the same panel.My impressions:Pros- The most amazing thing about this is the blacks. This is my first plasma but I never knew how much the LCD backlights ruin the blacks. If you ever watch a movie with the black bars on the sides, in a lot of LCD's you can see the backlight shining through (usually from the edges). However with this, it literally blends into the darkness in the room if you watch at night. Most of the time I forget there are even black bars on the sides for my old content. The night time scenes in a lot of movies are taken to a whole new level and everything just looks better with darker blacks.- Colors. I swear my movies never looked this good before. It's like they've been replaced and upgraded themselves. I don't really know how to convey it, but everything just looks richer (not saturated) from what I am use to seeing.- The size is great. This is my first 50 inch TV and it's almost too big.- Reasonable price. I don't need Smart TV bull built in to add to the cost when I already have a HTPC and Roku that does it better.- Input lag is low due to the plasma technology. Gaming is responsive.Cons- Remote isn't backlit. Minor gripe.- It's grainy closer up. The plasma has lots of sub pixels constantly being moved (I assume to avoid picture burn in) that creates a noise effect throughout the entire screen. I could see it from about 4 feet away and the effect diminishes as you get further away. (After about 7 feet I couldn't see it), so make sure your TV sits that far away. I was told this is inherent in plasmas. It's not the source as it does this even in the OSD.- Has banding problems, which I was told is normal in most plasmas. This is the \"Shades of Gradation\" that they have listed. (Search 'gradient banding', for an idea on how this will look.) It is noticeable.- Buzzing. The TV has a buzz coming from it. Not that noticeable, but if you are sensitive to such things, it might annoy you. Apparently normal.- Dithering problems. Again, normal with plasmas.Note: You have to 'break' this TV in so to speak. For plasmas you have pictures or video playing constantly for hundreds of hours to get the plasma to properly adapt it's colors. Not really a con, just kind of a note.All in all the picture and colors are amazing, but there are a lot more cons with this plasma TV than I thought. I wasn't completely blown away like All in all, for someone putting this in a living room and over 7+ feet away, and don't mind banding, this is an amazing television that you should get.", "Date": "August 5, 2013"}, {"Title": "Great TV!...", "Author": "Buy Guy", "ReviewID": "R1WV338CX18WAT", "Overall": "5.0", "Content": "Just as I expected. \"Plasma...there is no substitute\". So far so good....It's been hooked up for 3 days now and the picture is great!", "Date": "December 16, 2013"}, {"Title": "Brightness concerns are not a problem - buy this set while it's still available.", "Author": "Jeff Snavely", "ReviewID": "R215I5UEL22RIY", "Overall": "5.0", "Content": "Great value!Concerns I read about input lag, brightness in lit rooms and screen reflection are all non-issues.Works great with Guitar Hero/Rock Band games (didn't need to use in-game calibration).TV is 6 feet from two large windows on the side with wood blinds and even during the day with one open I can watch it just fine. It is not as bright as an LCD but that is expected with Plasma.YouTube feature is very cool - I can search and send videos from my Samsung Galaxy Tab 3 to TV with ease (iphone didn't work well).Built-in Netflix works well (slow to boot up initially) but not as good as Roku.When you first set it up the screen is very dim in the \"standard\" picture mode but the other modes are much brighter.", "Date": "December 10, 2013"}, {"Title": "Very impressive cost:performance ratio.", "Author": "Sloan Ranger", "ReviewID": "R1H6EPDAZ3OW3Q", "Overall": "5.0", "Content": "Great deal. Great Picture. Looks better than LED especially for sports. I find the picture to be warmer and very deep blacks, not to mention for 1/2 the price. Great Shipping and Handling.", "Date": "December 8, 2013"}, {"Title": "Happy Panasonic Plasma buyer, great picture quality. First Impression.", "Author": "Rohan", "ReviewID": "RZ12IXI69XVMU", "Overall": "4.0", "Content": "I bought this TV (50\") from Sears a day before thanks giving for $599+ taxes + recycling fee.  Very few people must have got this deal on this amazing TV. I had spent a lot of time researching TV on line and in store. I have spent hours in best buy looking at TVs.This is my very first foray into HDTV, and I am glad that I made this purchase. The picture quality is amazing, the rendering of colors is very natural as opposed to those LED tvs.Pros.1. TV is treat to look at, sleek design, nice metallic accent on top and bottom.2. TV is really easy to set up.3. Picture quality is really good as compared to other LED TVs (Not as good as 4K, which no one care at this time)4. Watch a blu-ray movie in dark room with home theater speaker system, you will never go to Theater again.5. I like the fact that it is not a full smart TV (it just has internet apps). I like to have pure TV experience. I have PS3 or WIDI for internet access and apps.6. Natural rendering of all colors.7. Blacks are really deep which makes it really good watching experience in dark room condition.Cons:1. TV is little heavy, which is not a problem for me, but might be for others.2. I use antenna, and this TV does not have good channel info feature.3. It does not show what programs will be coming next on my TV. (it used to show on my Samsung TV)4. Watching movie in bright lit room, gives you reflection.5. Netflix app is buggy(ask in comment why is it bad)6. Other apps are also not as good as they are on PS3.All in all very happy with the purchase.", "Date": "December 3, 2013"}, {"Title": "Great Value for the Quality of the Picture", "Author": "Rotary", "ReviewID": "RMI5HKTZB1WMF", "Overall": "5.0", "Content": "Great Picture, Easy to set up, & delivered in perfect condition. This was my first plasma TV. I have been buying LCD TVs before. Due to the good review in a consumer web site I found on this TV plus other reviews I found on the net I bought this. I was very pleased with the picture. The set up was easy also.", "Date": "November 27, 2013"}, {"Title": "Astonishing for $650", "Author": "A. Reviewer", "ReviewID": "R6NY0W3CZQZ9E", "Overall": "5.0", "Content": "Spent a lot of time researching TVs. Attracted to plasmas due to excellent black levels and good motion handling. Ideally you will want your room to be dark and not have a lot of lights reflecting off the screen. Picture quality is excellent, make sure to do some tweaking outlined on various avs forums. Panasonic is the Plasma of choice on the market right now, its sad they won't continue making them. Got this when it was $650 and don't have a single regret. Make sure you feed this the best 720/1080p content you have access to.Oh yeah, buy some bookshelf speakers and a receiver. Don't use the built in speakers! Try Dayton or Micca for cheap loudspeakers and a lepai 2020a+ as a cheap stereo amp.", "Date": "November 27, 2013"}, {"Title": "Only One Annoyance", "Author": "Ericka Kahler", "ReviewID": "RKTFZ1W9OJ0YY", "Overall": "4.0", "Content": "I am really enjoying my new television.  The picture on the television is great, but I had to adjust the display settings from the standard setting to get a decent picture.  The standard setting was too dim and the color quality was poor.  I also had to decrease the sharpness, since the factory setting was creating pixelation around the edges of objects.  It was well worth it to navigate through all the display options and customize the picture.I also like that this television is not a true Smart TV.  It makes getting to the apps I use most often easier, with a one touch button for Netflix right on the remote as well as on screen selections for Hulu, Amazon and You Tube.  I love to stream content and this TV has the ones I use most often without having to go through multiple menus.  The interfaces for the apps took some getting used to because I had a Roku box before and these interfaces are different than Roku's, but now I can find the content I'm looking for pretty easily.The television gets a 4 star instead of a 5 star rating because I find need to reconnect to the wi-fi signal frequently.  I tend to need to reconnect when I open an app for the first time after the TV has been turned off.  It doesn't usually lose the connection while I am using the television, but if I turn it off I expect I'll have to run the routine to connect to the internet again when I turn it back on.  I doesn't take long, but it is annoying.  If you do buy this television, I highly recommend using a wired connection rather than the wi-fi.", "Date": "November 23, 2013"}, {"Title": "Awesome! Best value for the money", "Author": "Theresa Greco \"Food lover\"", "ReviewID": "R1N9UUC16YFVP", "Overall": "5.0", "Content": "I cannot say enough good things about this television. I did my research before purchasing it. I went to cnet and winnowed down my choices; once I decided I wanted a plasma, I went with the Panasonic because of the picture quality reviews. I was not disappointed. This picture on this TV is simply incredible. I also went with the S60 because it has a basic version of Smart TV; I did not want to have to navigate through a plethora of menus just to be able to watch TV. I got exactly what I wanted. You turn it on, and you watch TV. You can access the Smart TV menu and select from six different apps; the Netflix app has its own button (which is the one I use 99% of the time, anyway). And, true to the reviews, there is a reflection issue (I knew that going into it, but wanted the picture quality). We have a rather dark room for it, so it's generally not too big of a problem. But if you have a room with a lot of sunlight, you might want some darkening shades; or maybe put it in another room. I have not had any \"noise\" issues with it. And, as some have stated, the Netflix app does take a minute or so to load up, but that doesn't really bother me. It only has two HDMI inputs, but that is all that I needed. I believe the newer models have four (not sure, but I think that's what I read), but I didn't want a newer one because I didn't want to have to work my way through the smart TV nonsense. If you watch a movie like \"Avatar\" or \"Thor\" on this with a good blu-ray player, the picture will literally blow you away. Also, like most new TVs, you don't really get the volume out of it. I bought a receiver to compensate for that; I think that's an issue with any of the newer flat-screens, though. Truthfully, I am pretty sure you could spend a lot more money and not get this much TV.", "Date": "November 22, 2013"}, {"Title": "Excellent quality and value for the price", "Author": "Petra Zales", "ReviewID": "R3IP4SD02RYEW4", "Overall": "4.0", "Content": "Upgrading from a 32\" 780p to the Panasonic TC-P50S60. Picture quality is great; although required some time adjusting the settings. Out of the box the image seemed to be too dim in a dark room. But after making minor changes it is prefect. I am a little disappointed with the sound quality; however with additional adjustments to the sound settings I was able to bring the sound to an acceptable quality. I haven't tested the built-in applications as I have a PS3 that already has all of the provided applications and more. I am really disappointed with the Android Remote Control application that can be downloaded from the play store on Google. However I do not hold that against the TV itself.  Excellent", "Date": "November 15, 2013"}, {"Title": "Great TV!", "Author": "Todd Griggs", "ReviewID": "R3IBH3CJ0L5T2H", "Overall": "5.0", "Content": "After significant research, I decided to give Panasonic TV's a try and very glad I did.  I have a 60\" Samsung PN60E7000 that I am comparing to.Pros: Good picture, good price, easy menus, simple setup, very quiet (no buzzing like some have), 65\" is nice and big, optical audio out works great with sound bars!  Shipping company was prompt, on time and tested the TV before leaving to make sure it worked.  One reason I chose to purchase from Amazon was that you can easily choose what day to deliver.  With a TV this size, someone has to be there and to make sure everything works!Cons: Only 2 HDMI ports, thicker that Samsung.  I have 3 HDMI devices so I purchased an inexpensive Kinivo 501BN Premium 5 port High speed HDMI switch with IR wireless remote to switch between devices  This works well, is expandable and I use just one HDMI port now on the TV.  The picture is not quite as good as Samsung and there are not as many options for 1080i.  However, the differences are minor, 1080i looks beautiful on the Panasonic TV and it is not worth spending hundreds of dollars more.I highly recommend this TV!", "Date": "November 15, 2013"}, {"Title": "Plasma tv is a pleasure to watch.", "Author": "Emanuele E. Nordone \"Manny\"", "ReviewID": "R3OYMLMVQSQYSW", "Overall": "4.0", "Content": "Outstanding picture but sound needs to be supported by a soundbar to boust the sound.  The 50 inch screen is clean and bright.  Would definitely recommend it to someone who is in the market for a excellent television with a fair price. The remote covers all bases and covers the needs of the tv.  Would purchase it again.  Love the plasma.", "Date": "November 7, 2013"}, {"Title": "Great picture and awesome price!", "Author": "Amazoniac", "ReviewID": "R12C6MM91TWMHI", "Overall": "5.0", "Content": "Like the title says the picture looks great and the price was awesome! ive tried it out with my HD movies and games and so far its been impressive. Cant wait to try out with Blu-ray. Ive only had it a short while so I cant really say too much more than the menus are very easy to navigate, set up was a breeze, and getting this on my base was easy! its very light weight and thin! The only thing I did not like was the amazon insta-video app. It was quite sluggish and did not like the User interface. I just use my amazon insta-video app on my ps3. Also the youtube app sucks, it was also sluggish and the user interface wasn't very good either. Did not try the other apps. I will update my review over time to let you guys know how its held up!", "Date": "November 4, 2013"}, {"Title": "Great value plasma tv", "Author": "Paula L.", "ReviewID": "R1C9GT1V7NGCBV", "Overall": "4.0", "Content": "Please note:  The four star rating is only for the product and does not include the enhance delivery.This tv is a great value if you don't need features such as 3D and Smart TV.  The picture quality is a good as the professional ratings say it is.  One thing I noticed is that the black is not inky black during scenes that are mostly shadows or completely black such as just before the credits role.  Also I noticed that the picture appears wavy when the color is solid gray such as a sky at dusk.The internet features are easy to configure.  Remember to set the tv date and time.  Netflix and Amazon won't connect without it.I ordered this product with enhanced delivery.  The delivery went well even though they didn't show up during the estimated time frame and didn't call to let me know they were going to be late.  Also, the delivery date was changed because the product was shipped earlier than estimated.  CEVA told me I had to contact the company that actually delivered and set up the tv.  I had difficulty getting through to them.  No one answered the phone after 4:30pm even though they didn't close until 5:00pm.  I was finally able to get someone to answer after 8:30am the next day, was transferred, then hung up on 3 times.  The fourth time I called I asked why they kept hanging up on me, and he said \"we've been having problems with the phones.\"  Really.  I don't fault Amazon or CEVA for the communication issues between customer and the delivery service.", "Date": "November 3, 2013"}, {"Title": "TV for the family room", "Author": "Jerry Jones", "ReviewID": "R2RZBPNDT448WS", "Overall": "5.0", "Content": "The picture quality is outstanding.  We use this set to watch sporting events most of the time.  The plasma picture is almost 3D with it's high quality.  I am sorry to hear that Panasonic will stop producing these products in 2014.  The quality of the picture on this plasma set is much better that what we have observed on LED Liquid Crystal sets.", "Date": "November 1, 2013"}, {"Title": "The HDTV was everything we thought it would be", "Author": "Debbie Evano", "ReviewID": "R3770PXKA2HPNV", "Overall": "5.0", "Content": "We chose the Panasonic TC P65S60 65\" to replace our 42\" which is still working great after 10 yrs.  The 42\" is in our spare bedroom now.  I would recommend a Panasonic to anyone who ask about it.  The delivery was on time.  The only thing was about 6 hrs after we ordered from you we were at Sams and the exact one was there for $111 cheaper and we couldn't cancel our order with you.", "Date": "November 1, 2013"}, {"Title": "Picture quality is great and it was easy to set up.", "Author": "James E Pierce", "ReviewID": "RQJ78B62A4UG3", "Overall": "5.0", "Content": "The unit arrived in good condition. The TV set up instructions were clear and easy to follow. We would recommend tis product to a friend.", "Date": "October 31, 2013"}, {"Title": "Exactly as I had wanted", "Author": "Dr. Prakash A Karpe", "ReviewID": "RWN81V17UH7KH", "Overall": "5.0", "Content": "This TV is just what I wanted. It has great picture quality, good quality sound (although I do plan to install a home theater system), and easy controls. The Internet connection is fast and WiFi set up is a breeze.", "Date": "October 31, 2013"}, {"Title": "Awesome TV with not a single problem", "Author": "Tractorman", "ReviewID": "R3OW0LG6BM6DRI", "Overall": "5.0", "Content": "I was worried about buying a TV online, but the price was too good to pass up. It was delivered fast and in perfect condition.  This is my third Panasonic, I will never buy another brand if i can help it.", "Date": "October 30, 2013"}, {"Title": "Solid Quality", "Author": "B. Valentine", "ReviewID": "R32SVKQQFFIH6W", "Overall": "4.0", "Content": "The picture is great and the motion handling is awesome. One complaint is a lack of inputs. Unfortunately the WII is a composite output and the current DVD player is component. It needed to be upgraded so I could hook up via HDMI. huge hassle from that perspective and the real draw back is there are only 3 HDMI inputs so if this isn't for your home theater it could be an issue for you too.", "Date": "October 30, 2013"}, {"Title": "Insane value for a 60\" plasma", "Author": "SciroccoTDI", "ReviewID": "R3D66M8ZAZWBMH", "Overall": "5.0", "Content": "Amazing picture - incredible brightness...and just minor buzzing if you get your head near it (and I live at 5000+ feet, where the pressure of the gas tends to push the glass plates apart and cause problems).  PS - I got this when it was 999.99 - don't know why the price shot up since my purchase.", "Date": "October 27, 2013"}, {"Title": "Great Purchase.", "Author": "A. Bates \"shopping diva\"", "ReviewID": "RTGCN8M9UB5R6", "Overall": "4.0", "Content": "Great tv. Like my Sony, it has apps like Cinema Now, Netflix, Hulu Plus, Vudu and Amazon Prime for wi-fi streaming of movies. The remote is quick and responsive with a dedicated Netflix button (too bad I canceled my Netflix a year ago.) I'm not crazy about the glare. The only negative is, the screen is not matte like my Sharp, Sony,Sanyo or TCL. So be aware of a slight glare when viewing.", "Date": "October 22, 2013"}, {"Title": "Very happy with this purchase", "Author": "Top Ten Top Ten List", "ReviewID": "R2AJNZSP9VBE1S", "Overall": "5.0", "Content": "I've always been very happy with my Panasonic purchases, and this is no exception. The picture is great, the controls are intuitive, the tv itself is sleek and simple. But by far, the best part about this purchase was the team that delivered it! They went above and beyond- moved our old TV, unpacked and connected the new tv, set up the new remote, and took all the packaging with them. I had no idea we were getting \"white glove\" delivery with this purchase - what a pleasant surprise!", "Date": "October 16, 2013"}, {"Title": "Big TV for a Big Room", "Author": "Spectre", "ReviewID": "R1KEZ6Z2PBIOON", "Overall": "5.0", "Content": "If all you are after is a big plasma display without the fancy features, this is it.  It has all the picture quality you expect in a plasma from Panasonic, at a great price.  It is sad to know they won't be making them much longer...", "Date": "October 15, 2013"}, {"Title": "I absolutley LOVE the Quality of the picture on this TV!", "Author": "G1yp4.1337", "ReviewID": "RJ4PZ5ZKCGGEL", "Overall": "5.0", "Content": "I have been looking at midrange TV's for the last 2 years. I have looked at LCD, LED-LCD, and Plasma.  I fell in love with the quality of plazma when my parents bought one that i recomended. Even looking at the TV's at wal-mart, any plasma outshined the LCD's in quality every time.  I never saw this TV in real life till i hooked it up, but i know panasonic's Flat pannels were allways very crisp and of good quality. When this one went on sale, I jumped on it.Now, About the Tv:  First, i want to address the elephant in the room. If you have read the reviews like i have, MANY complained about the glare on the screen.  It IS a glossy screen and it WILL reflect light. That said, im looking at the screen right now and i do have some glare from my window on it, but its not enough for me not to enjoy the picture.  If i was watching tv all day long, then i could see it being a problem during the day, but not at night.  At night, i will get a reflection of a light thats about 30 feet behind it, but again, its not a big deal.  If your gaming, i could see it being a little bit of an issue but my solution was to wall mount the tv, and tilt it down.. Its enough to remove any washout.  This is a problem with MOST plasma's that have a glossy screen.. The Glossy screen provides a clearer picture as a matte screen blurs it a bit. Its a personal choice. And if you get the tv and its a rather big issue for you, with the price point of this tv you can buy the 100 dollar screen overlays that reduce the glare and still have a great valuethe smart tv..  Netflix, Amazon prime and youtube are what i use.  I love that these are built into the TV, freeing up an HDMI port (which there are only 2 on this tv, but that is easily expanded with a 10 dollar HDMI switch with remote from amazon).  My bone of contention here are the speed in which the services work when going through the menus (especially youtube).  Sometimes they lag.. quite a bit. (Its not my internet as i have a 50/2mb pipe). My other issue is amazon instant video.  There is NO OPTION FOR YOUR WATCHLIST!  This was my biggest feature on my ROKU that i loved. Now i have to search for my movie every time instead of queing up movies or tv shows to watch in the future.  This software version was only released a few months ago and maybe they will patch itThe DLNA option works great as well. I have a media server on my network were i stream my movies instead of disc searching.All in all, this was a 5 star purchase for me, and i would buy another in a seccond if i had that kind of money :)  If you are VERY sensitive to light on your screen when you watch TV, Then dont buy this tv, Go look at the S64, or get a plasma glare filter.", "Date": "October 15, 2013"}, {"Title": "Excellent TV", "Author": "scouthoward", "ReviewID": "R23BCDH93H45WV", "Overall": "5.0", "Content": "This is the best tv I've ever owned. The picture clarity is beautiful and I like the smart tv features. I would highly reccomend this tv because you get a lot of tv for the money.", "Date": "October 2, 2013"}, {"Title": "Exceptional Picture - Great Price No Frills Plasma", "Author": "Brian Maloney", "ReviewID": "R1RD7OT3GLAHH1", "Overall": "5.0", "Content": "Like most, I researched the purchase of a new tv quite a bit.  I was already sold on plasma over LCD from my previous plasma (an LG that was messed up in lightening strike).  Amazon had the best price ($300.00 lower than Sears).  Probably the best bang for the buck in the 65\" range.  And a GREAT picture.I know many have mentioned the glare...I find Panasonic no different than any other plasma screen from a glare standpoint.  The picture is very, very good.  Excellent and as describe by the others that have reviewed.  Set up of this t.v. was very, very easy.My only caution would be that it has only two HDMI inputs.  This was fine for me as I feed the t.v. with an A/V receiver that has 6 HDMI inputs.  However, if you don't have an A/V reciever, realize that you will only have two HDMI inputs.  One for satellite/cable...if you use the other for a DVD player...you're out of inputs!Great delivery by Amazon.  Great price.  Super picture!", "Date": "September 22, 2013"}, {"Title": "Great TV", "Author": "Adam Neel", "ReviewID": "RXMCO0CLTWLF4", "Overall": "5.0", "Content": "Things to consider when buying any TV.Do you care more about the TV's relative brightness or ability to see shadows in dark scenes of movies?If you care more about the 1st then get an LCD. If you care more about the 2nd get a plasma.I had an Samsung LCD for the last 5 years. It had a good picture quality for sports and regular shows. However, when it came to watching movies. Especially movies with dark scenes. I could not make out anything in the picture. (think the Dark Knight).I bought this TV a month ago and I am very impressed. I read the reviews and went with the S and not the ST. Here is my feedback on the reviews.Is the screen glossy/reflective?Yes it is glossy, but I personally do not find it distracting at all. The picture quality is amazing. This TV sits in a room with windows on three walls and lots of lamps and I have never once been distracted. I think the people who see reflections on the screen out showing the TV's picture are wanting to see the reflections. My wife and I have both tried and focused so as to get distracted and the TV just wins out. In fact I am sitting in front of it right now as I write this review with a lamp turned on and the sun out and the picture is as clear as day.Is it very bright?No its not as bright as my old LCD but it looks great the picture is much more accurate, real to life. Things do not tend to look neon or blind you when the TV is on in a dark room.Black LevelInfinitely better than my last TV or any other LCD I have ever looked at myself. The big problem with LCD is even when they get close to plasma in black level they cost $2000-$3000 more and they still do not look as black. This TV essentially looks like it is off when it is at black screen. I know that CNET has calibrators that can tell how much light comes out but if you do not have one you will not notice that it might not be as black as the VT.Apps/InternetThis is the part I cared about the least. I was very happy it had amazon instant video as I am a prime customer and this made it much easier to access. However, I do not care if my TV runs tons of apps. That is what my Apple TV, iPad, iPhone, Laptop... etc. are for and it always seems the TV versions are clunky. If I really want to run those things its easier and faster to just use airplay.Bottom LineIf you want a big TV with excellent picture quality for not much money... this is your TV. If you want to spend more for an LCD be my guest. You will not be sorry you purchased a 65\" TV. I was nervous at 1st to get a TV this big. It has double the area of my old 46\" but I have not once regretted it. My wife who could not possibly care less even said that the TV is a good size.", "Date": "September 20, 2013"}, {"Title": "Great TV", "Author": "Debbie", "ReviewID": "R2R4CSPQ1VLAYY", "Overall": "5.0", "Content": "We have certainly enjoyed our new 65\" TV! The picture quality is wonderful. I am not all that impressed with the sound on the TV but it is ok. We need to get a sound bar and that should take care of the situation. I feel like we got a very good TV for a nice price. We researched on CNET and Consumer Reports and found that Panasonic was one of the best rated plasma TV's. I would recommend this to anyone. The color is great and the clarity is wonderful. I will say, it is tough to watch a smaller TV now!", "Date": "September 12, 2013"}, {"Title": "Great TV, no pointless bells & whistles", "Author": "Buffalo", "ReviewID": "RTDMB7X6WVJF9", "Overall": "5.0", "Content": "This model shone in all the reviews, and it's easy to see why: high quality and great value. The only downside is the amount of TV I'm now watching.", "Date": "September 5, 2013"}, {"Title": "Nice work, Panasonic. No complaints here.", "Author": "Scott Pezza", "ReviewID": "R3BDIOENFJE0UP", "Overall": "5.0", "Content": "This TV is very well priced, has a nice picture, has better sound than I expected, and hooked into our wireless network easily. I think that the omission of an integrated webcam is actually a benefit.A few notes: - The glass screen can be subject to some glare. Even in bright conditions, it's fine for me up to about 45 degrees from center. As you get farther to the side, you can still see the picture but the glare really kicks in. For settings with a lot of direct light, you may be better off with the higher model that has an anti-reflective screen. - The sound is not going to blow you away. It's fine -- better than I expected, but nothing groundbreaking. - It you use a slimline mount, make sure you wire everything ahead of time. Since the inputs are in the back, rather than on the side, they will be very difficult to access after mounting. The USB ports are on the side, though, so there's no worry there.", "Date": "September 1, 2013"}, {"Title": "I took a risk", "Author": "Alix V", "ReviewID": "R3NACR4EXU89W0", "Overall": "5.0", "Content": "So I've been wanting to get a new tv and a motorcycle so I didn't want to break the piggy bank getting a tv.I did a lot of reading and settled on several Tv's from plasma to LCD and below what this tv cost to above.After reading quite a bit of reviews all over the net and seeing this model in person I honestly was impressed by reviews online but not impressed by the picture quality in person. I'm not sure why but the picture looked horrible!So I went with the reviews and purchased it in hopes I could mess with the settings and make it look great. So guess what it is friggen awesome!Watching bluray movies the picture quality was good but not great. Where the tv shines is when I play video games and watching Hulu, vudu, or the other services provided on the tv or ps3.I'm honestly blown away and after very little tweaking the last of us look really good.So if I would recommend this? Totally!As for the cons?Yes as of all plasmas or most you will have a reflection and if you set the tv in a great location with medium light or the ability to control light levels like I can then this purchase would be a great one... If you can't control the light then you will honestly hate it.", "Date": "August 18, 2013"}, {"Title": "best money, i ever spent", "Author": "steven howell", "ReviewID": "R1ERT5AX29X13V", "Overall": "5.0", "Content": "I know there is better hdtv's out there, but I dont care about 3D, and Ive have a light controlled room (a must with this tv), just awesome!", "Date": "August 18, 2013"}, {"Title": "Amazing TV for the price!", "Author": "MadJoe", "ReviewID": "R6DEO81HY8YD4", "Overall": "5.0", "Content": "Enough said.  But I have to type at least 20 words, so I'll also say: at this price buy two.  And I'll add some cons since the review would be way to long to read if I listed everything I like about this set.There are only 2 cons I have found so far:1. There is an LED on the TV that lights up when it is on.  This isn't unusual, but it is red and constantly grabs my eye when watching TV when it's dark in the room.  I have recently become acutely aware of all the LEDs manufacturers are putting all over their products in an attempt to look cool, or modern, and it's annoying.  When the TV is on, I am aware of it by the picture being displayed on it.2. The only Audio output is Fiber Optic.  I would have preferred a digital out RCA jack, but at least there is one.That's pretty much it.", "Date": "August 16, 2013"}, {"Title": "Absolutely Beautiful Picture - Great Price!", "Author": "Kevin Miller", "ReviewID": "R2OW3GSBFRK73G", "Overall": "5.0", "Content": "First things first, the picture on this tv is absolutely beautiful.  Darks are dark, colors are vibrant - By far the best picture you'll find at this price and beats most of the more expensive tv's as well!Smart features are nice to have but pretty much useless for me as they take quite a while to load and my blu-ray player does a much better job of handling apps, etc.Sound quality (as is the norm with today's televisions) is not great so I would definitely recommend investing in other speakers if you don't already have them.All-in-all, the picture is really what is important to me and I must say that the picture on this tv blew me away.. Highly recommend!", "Date": "August 16, 2013"}, {"Title": "Awesome", "Author": "Sahib S. Dhindsa", "ReviewID": "R3PVPPKFT34FI6", "Overall": "5.0", "Content": "Awesome TVThere is a reflection like some of the other reviews say. But, I honestly don't notice it too much once you get used to it. The TV speakers are pretty good also.", "Date": "August 12, 2013"}, {"Title": "NO Anti-Glare coating....SO WHAT?", "Author": "Edwin Sanchez", "ReviewID": "RINPVIGK2D5AJ", "Overall": "5.0", "Content": "I received my TC-P65S60 from amazon 3 days ago. Maybe is because its in my room, but don't see the big deal with the no \"anti-reflective\" coating. To me this TV is awesome!!!!!  Previously i had a panasonic 50\" plasma that i bought in costco 7 years ago, it came with the AR coating, after comparing both, didn't need it. 1st test drive was with Tron Legacy and Batman The Dark Knight. MAN!!! The picture is amazing. Don't watch from up close though, you can see a bit of grainy pictures, but from 7 feet back, WOW just WOW.Currently doing my break-in routine, no black bars and no logos for 100 hours. Yet everything looks amazing.Plus the applications are.... VERY GOOD! I play a lot of MKV video files and this tv plays them well.  I've never seen a tv that provides this level of support for MKV files. I mean you can change language, subtitles, fast-forward and rewind. I'm extremely impressed and happy with it.", "Date": "August 12, 2013"}, {"Title": "Great Picture", "Author": "cnhurley", "ReviewID": "R26B6MJQ4DEPCI", "Overall": "4.0", "Content": "Love this TV.The deliver was excellent. I would recommend this plasma television to anyone interested in a new television.", "Date": "July 23, 2013"}, {"Title": "Nice picture", "Author": "hankthecowdog", "ReviewID": "R3B7OIJFLVKOCN", "Overall": "4.0", "Content": "I like the smart TV features, easy to use, but sadly no HBOGO.  My last TV was an 8 year old Samsung 40\" and I gotta say the sound was vastly superior.  The sound on this TV is totally unacceptable, really ruins the whole experience.  So now I have to invest in a decent sound bar.  I'm guessing this is kind of the norm now, but something to consider when it comes to bottom line price.", "Date": "July 23, 2013"}, {"Title": "Picture Quaity Will Knock Your Socks Off", "Author": "M. Balthrop", "ReviewID": "R2QTSEJ6AXPNYZ", "Overall": "5.0", "Content": "The picture quality is fantastic. The built in DLNA with built in wireless is also very satisfying. It streams 1080p across my WIFI with minimal setup. The only gripe is that it has only 2 HDMI ports and no headphone or audio out other than digital out.", "Date": "July 21, 2013"}, {"Title": "It's shiny", "Author": "Matt", "ReviewID": "R3VVC6BU5R4NHT", "Overall": "4.0", "Content": "The picture is great when you're sitting in the right spot to avoid the glare. The screen has almost a mirror like finish which is very shiny. Other wise, it's been fine so far. Probably have to put up some dark curtains in the living room to block out the light.", "Date": "July 18, 2013"}, {"Title": "Dim", "Author": "Marshall", "ReviewID": "R18UQSWB2Y0BB", "Overall": "3.0", "Content": "I bought the 42 inch version of this TV (P42S60) and no matter what changes I make to the picture, I can't get it as bright as my 2008 Panasonic Plasma. Picture is too dim in my opinion. CATS off, panel brightness high, contrast turned up, etc. Am I doing something wrong? Unfortunately it may have to go back.UPDATE 8-19-13: I ended up returning the TV because of the brightness issue. I bought a used 2009 model and it's much brighter.", "Date": "July 2, 2013"}, {"Title": "Spectacular color. Amazing price for a plasma of this quality.", "Author": "Dao Shen", "ReviewID": "R35A4T4QC81R0I", "Overall": "5.0", "Content": "I deliberately picked this model for the bright screen as i use this unit mostly at night.Glare in the day is noticeable but not unwatchable.Refresh rate for gaming is perfect. I plan to buy 2 more at this price to create a surround display gaming setup.", "Date": "July 1, 2013"}, {"Title": "It does well what i can see", "Author": "Rhea Wheeliums", "ReviewID": "R3205L4H9LINYA", "Overall": "4.0", "Content": "I have this television in my bedroom and it is working well. I have no complaints.  The first set that was delivered was cracked.  Amazon replaced it promptly without any difficulties.", "Date": "July 1, 2013"}, {"Title": "Everything I wanted", "Author": "S. Weilacher", "ReviewID": "RE7F5JZXJZI43", "Overall": "5.0", "Content": "The Panasonic Plasma TV is wonderful. Very clear picture. Good clear sound. Better sound that any other TV I have had.Easy to set up. I am very pleased.", "Date": "July 1, 2013"}, {"Title": "flawless picture.", "Author": "john mc", "ReviewID": "R3D6YQ4O88Q5WU", "Overall": "5.0", "Content": "iv'e owned panasonic plasmas for nearly seven years and they keep getting better. outstanding blacks and colors even on network tv broadcast over satellite. blu rays are pristine too. btw, none of my plasma tv's have ever suffered from image retention, all of them still look beautiful, even my old 42 inch non hd model which had many hours of video games has no issues. this model is a \"mirror\" though, so don't put it in a room next to a window if you do a lot of daytime tv watching. some people gripe about only 2 hdmi inputs, but for me running it though an av receiver makes it a non issue. shipping was great too. this is a set that would make your home theater really shine.", "Date": "July 1, 2013"}, {"Title": "Love it!", "Author": "Myona Baser", "ReviewID": "R37SU13H3RBA4X", "Overall": "5.0", "Content": "Met with all expectations. Great picture and the smart capabilities are easy. I have and would recommend it to my friends.", "Date": "June 28, 2013"}, {"Title": "Upgraded to Panasonic TC-P50S60 50\" Plasma from Vizio 37\" LCD", "Author": "pixelPimp", "ReviewID": "R32C9O5J7G7G94", "Overall": "5.0", "Content": "Extremely happy with the TC-P50S60 50\" Panasonic Plasma. We were in need of a TV on our enclosed patio so I convinced my wife that we should move the Vizio on to the patio and buy a new display for the living room. The living room has a large bay window on the left side of the room and a regular window in the back of the room which is parallel to the TV. Room is about 14' x 18'. I feel the 50\" tv is a perfect fit for the room, I wouldn't buy anything larger. The room is fairly bright and we are not experiencing problems with reflections or the images not being bright enough. Blacks are black like most of the reviews you read. Skin tones are great and not over saturated. Angle viewing is great as well. I'm not a big sports guy but having this TV makes me want to watch sports because of how clear and sharp things are. Downloaded the Panasonic app to swipe and share images/videos from Apple devices and it works well. Bought a Sony BluRay player with this unit as well and they play nice with each other.Sony BDP-S3100 Blu-ray Disc Player with Wi-FiDelivery service was a nice addition. They setup a window from 9am to 12pm to deliver. Service un-packaged the unit, plugged it in so I could inspect the display. FYI - They do not plugin your audio/video equipment or hang it on the wall, they just fire it up to allow you to view that the unit works and there aren't any issues with the screen.Highly recommend this unit.", "Date": "June 24, 2013"}, {"Title": "Incredible bang for buck", "Author": "Samuel D Mertens", "ReviewID": "R26P8XVEUSY8CO", "Overall": "5.0", "Content": "Great display, integrates well into my home theater system. This *is* a budget system, so beware that there are a limited number of inputs (two HDMI, one composite/component).  You'll need a receiver for more.  The screen is kind of glossy, which is not a problem in my setup but something they address in higher models.  Another minor caveat: when using a wireless network connection, it takes a few seconds (30?) to come online after power up.  So if you just hit the power button then try to go directly to Netflix, it will complain about a lack of network.  Go wired if you can.  Note that if you start the network setup wizard in an attempt to fix things, it'll nuke your existing WPA settings, including the passphrase which is probably a real pain to input via remote.", "Date": "June 23, 2013"}, {"Title": "Love this TV", "Author": "BJS_ATL", "ReviewID": "R2PGRLLMPE5NJ6", "Overall": "5.0", "Content": "This is my first foray into the flat-screen TV world. I searched around for several seeks and found the Panasonic TCP50S60 to be far and away the best value for the money. I wanted a new TV primarily to watch movies. My priorities fare sharp picture, Smart TV, and price. This TV was at least $200 cheaper than any alternative.The picture is fantastic. There are five main picture settings (standard, home theater, etc.). I haven't played around too much with them, but I've been able to get a great picture watching sports, movies, and TV with one of the base modes. There are many more picture options, like changing RGB colors in different modes, if you want to get into all of that.It's easy to set-up and light-weight. I mounted it above my fireplace. The mount weights twice as much as the TV. It had two HDMI inputs, which is fine for me. One goes to my Roku, one to my Blue ray player. I haven't used the USB ports yet.The sound is pretty good on its own. My living room is pretty small, so the TV fills the room with sound very well.My living room is also pretty dark, so I haven't had any complaints about glare or poor quality in high light settings like other reviewers have mentioned.The set-up and remote are straightforward. Once mounted, I got everything connected and hooked up to wifi in about 45 minutes.I love this TV. I honestly have no complaints. I'm not a gamer or in need of extra HDMI ports or in need 3D, so this was perfect for me.Best purchase I've made in some time.", "Date": "June 18, 2013"}, {"Title": "Dynamite Picture!", "Author": "William Bretz \"Bill Bretz\"", "ReviewID": "R3BP3CC8NSZD9M", "Overall": "5.0", "Content": "Had the TV for about a month now.  It replaced a aging Samsung DLP that was developing problems deciding what input it wanted to use.  I was always very happy with the picture on the Samsung, and was actually a little apprehensive about going to a plasma.  But, wow!  Out of the box...  Much, much better picture.  The contrast ratio is much better, particularily on the black side.  Also the viewing angle is better (although this wasn't an issue with the Samsung).I do have two small negatives.  One is that there isn't a headphone jack, and the other is that the on-board sound isn't even close to spectacular.  Looks like an updated sound system is in our future!UPDATE:  September 9, 2013.Bought the Panasonic SCHT370 2.1 sound system for it.  Now I have spectacular sound and picture for an investment of less than $900!!", "Date": "June 10, 2013"}, {"Title": "incredible picture", "Author": "Speed Freak", "ReviewID": "RXY2KQLNIY0QK", "Overall": "5.0", "Content": "I replaced a Hitachi director series 55\" and this plasma ROCKS! Right out of the box she looks amazing. I have only had her a few days but for now I am stoked. I only wish the auto off function without signal was shorter than 10m but i cant be critical. I love the smoothness and flow of plasmas!", "Date": "May 18, 2013"}, {"Title": "Great TV Great Price", "Author": "jeeper87", "ReviewID": "RQEF7O18PXC9G", "Overall": "5.0", "Content": "Its a great TV and with no tax and free sipping, its a steal. I would recommend it to anyone interested in a Plasma", "Date": "April 6, 2013"}, {"Title": "Stunning experience that rivals a movie theater in my living room", "Author": "M. Rose", "ReviewID": "R2LNRUZRRUNFV7", "Overall": "5.0", "Content": "I don't fret endlessly over specs and reviews, but I did a fair amount of looking around before buying this TV.  I felt 3D was a gimmick that I would not use very much, if at all, but I did want plasma picture quality.  Of course, Panasonic leads that plasma group, so this TV just naturally rose to the top.  I bought it on the Panasonic reputation because not many reviews were in at the time, but this TV has exceeded all of my expectations by a wide margin.  Zero ghosting (and I tested it some--like hours), does not get very hot and the picture quality regardless of the source is unbelievable.  I have a very large living room and this TV was mounted over a gas fireplace, and it fills that void very well.  Skip the more expensive and somewhat fancier Panasonic plasmas and just buy this one.  It has all of the same picture quality, none of the features you don't need, all of the ones you do and the 65\" size is something to behold.  Highly, highly recommended!", "Date": "June 23, 2013"}, {"Title": "Best tv for the money", "Author": "Brock E Wilt", "ReviewID": "R3AXKA5VVIQZRO", "Overall": "5.0", "Content": "I bought the 65 inch in the S series. This tv replaces my 2008 Panasonic 50px80u. I always thought my 50px80u had a great picture. No motion blur, nice blacks, and accurate colors. So when it came time for a new tv I knew I was buying another Panasonic. I would of liked to buy a higher end model, but when it comes down to it your just paying for 3d and some picture quality upgrades. For me I don't need 3d and can't justify spending another 800-1000 for a slightly better picture.The65s60 has a very good picture. Colors look life like and real. The blacks are also much deeper then on my old tv. I used picture settings I found on the owners thread for the S Series from the AVS forum.I will say this tv is more reflective then my old tv, but that doesn't bother me and for the most part I don't even notice it. Once the sun goes down its a non issue.I enjoy having Netflix, YouTube and a few other apps directly on my tv. But like most people I already can access these apps through my ps3 or cable box.Overall you won't go wrong buying this tv. You won't find a better tv for the price.", "Date": "April 14, 2013"}, {"Title": "Not bright enough", "Author": "David L. McCormick", "ReviewID": "R17HSH4HG5C10A", "Overall": "3.0", "Content": "I bought this to replace an older Sony LCD TV, and I am disappointed in its very limited maximum brightness.  It is hung on a wall in my basement, so there is little natural light to overcome.  Hockey games are not bright enough, and i expected better for baseball.  Wouldn't buy this or any other plasma TV -- will stick to LCD, LED, or other technologies.", "Date": "July 28, 2013"}, {"Title": "Good Buy", "Author": "cyncynj", "ReviewID": "R2VQPL1Z9OXB6P", "Overall": "4.0", "Content": "So far I like the TV. It has been hard for me to get used to having a plasma versus an LCD. I am missing the brightness of the screeen (due to the LCD having lighting behind the screen). The blacks and vivid colors are great. I also LOVE having access to You Tube, Amazon Prime, Hulu, Netflix directly to the TV via wireless connectivity to my router. The setup was relatively easy. The most difficult part is trying to get the picture set to where I like it. I must say that as other reviewers have said. The screen is HIGHLY Reflective. My tv is directly opposite windows which is not a good place. I will be installing some room darkening curtain or blinds to combat this issue.", "Date": "July 17, 2013"}, {"Title": "Exceeded my expectations", "Author": "Bainmeister", "ReviewID": "RYQ9VX8ZHXUV5", "Overall": "5.0", "Content": "I bought this model because I wanted a great picture and I did not want to pay extra for all the frills. I had already visited sears and best buy and determined that the panasonics plasma is by far the best picture on the market. To my surprise, the TV has plenty of exciting features:1. The user interface: extremely easy to use and navigate, a 6 year old could work it2. Easy wifi setup, the remote has a Netflix button, again real easy to use3. Dlna technology made my smartphone come alive. Buttons now appeared on my smartphone's apps that let me broadcast straight to the TV . If I am watching youtube on my phone , touch a button and the TV switches over to YouTube and plays for all to see. I can stream music from my phone to the TV and the TV has a digital audio out to go to my receiver. I can also display pictures and videos from my phone to the TV . Absolutely satisfied. Word of warning , if you buy a TV mount with an arm that says it can hold 100 lbs, it will hold this TV (75 lbs) but it is scary and struggling . I ordered a better tv mount with dual arm that holds up to 165 and because of the dual arm , it should keep the TV straight all the time, no matter how you manipulate the tv. Oh yea, the amazon price drops a good $65 when you are in final stages of checkout, at least it did for me .", "Date": "June 20, 2013"}, {"Title": "Great picture, amazing value", "Author": "R. Williams", "ReviewID": "R1NCJ9XIOCJO0M", "Overall": "5.0", "Content": "I've never owned a plasma tv before and am blown away by the picture on this set. It connects seamlessly to my wireless internet for youtube and netflix viewing.  I didn't need a huge screen for my smallish tv room and this is just right.  It will pay for itself by my not having to subscribe to cable anymore.  I have more tv than I'll ever watch with the internet channels which have their own button on the remote. I also got the remote ap hooked up on my phone so searching is much easier than using the remote. That would be one thing that may be a little gripe.  If you do a search with the remote, you have to bounce the curser around on a keyboard with the up/down/right/ left arrows.  Thats a pain but having the phone hooked up with it as the remote eliminates the problem. I just ordered a blue ray surround system for it and am anxious to see how that works out.", "Date": "June 11, 2013"}, {"Title": "wonderful television", "Author": "E. ELLIS", "ReviewID": "R21GXS646DVLV3", "Overall": "5.0", "Content": "Once I decided that I was picking plasma over led/lcd my research took me straight to Panasonic. I eventually got this gem on a black Friday deal and have been extremely happy with the performance. Picture quality is outstanding (picked plasma for the high contrast and lively colors). Extra features aren't bad either, haven't had any issues with the onboard YouTube app if I want to quickly show a video on the big screen. It syncs to my Google account seamlessly. I did have some trouble connecting to Wi-Fi but opted to plug in since my model is in my entertainment center anyway. The sound is decent, but getting a solid 3.1 system will out the icing on the cake. The built in color settings are just fine, no extra tweaking was need to meet my satisfaction.Very happy with my purchase, couldn't have made a better decision.", "Date": "May 9, 2014"}, {"Title": "Outstanding Picture", "Author": "Sparky", "ReviewID": "R3C4I7BGN5IZJJ", "Overall": "5.0", "Content": "Purchased this product based on several reviews. Did not see the product prior to ordering. This unit has an outstanding picture quality. I have only made minor adjustments to it from out of the box. Many reviewers complained the  picture is not bright. I have no issues once I turned off the auto dimming feature. The screen is reflective but I have not had glare issues that could not be corrected. It is in my living room and can view during daytime with the blinds open.", "Date": "May 6, 2014"}, {"Title": "Awesome tv...use mostly for ps4", "Author": "P. Suarez \"Soul Surfer\"", "ReviewID": "R2XFAGKMQWGJZX", "Overall": "5.0", "Content": "Amazing tv, has to be in very dark room.  Black out curtains during day, etc.  The color and clarity is fantastic.  Grab them if you can while the last! no burn in issues, over 500 hours on it so far easily.", "Date": "April 29, 2014"}, {"Title": "Panasonic p50s60", "Author": "W. Hue", "ReviewID": "R1LK3NN1RTXG3Y", "Overall": "5.0", "Content": "Well I've lived the last 10 or so years without a television in my home.  I decided to upgrade because I was tired of streaming Netflix and Amazon on my 15in laptop.  After extensive research, I decided I wanted to try out a Panasonic plasma - just in time for them to have been officially discontinued and no longer in stock.I was able to snag the last Panasonic plasma in stock from my local Sears.  I got a 50in version of this model at a closeout price of ~$560.  I must say it's bigger than what I was originally looking for, but the 42 inch models were nowhere to be found locally or online.  For my first HDTV I am impressed - it delivers quality picture that seems to be lacking in a lot of the LCD/LED TVs I've seen.  Smart features are very basic and I really wish there was a Pandora app, but Youtube is free and easily paired with your computer or smartphone to make navigation/interface easier.  HuluPlus allows some free sampling of content.So far I am very happy I grabbed the last one of these available in my area and look forward to years of HD experience with this screen!", "Date": "April 14, 2014"}, {"Title": "Audio output blocked for netflix", "Author": "N. Shields", "ReviewID": "R3P1GHR6B0RBSQ", "Overall": "2.0", "Content": "Panasonic and Netflix got together and blocked the audio output.  You can watch Netflix and listen on the TV speakers but if you want to output to your stereo system or headphones, you can't.  Everything but Netflix works fine.", "Date": "April 6, 2014"}, {"Title": "Amazing Television Reasonably Priced", "Author": "Joel", "ReviewID": "R3FIAV8FCR2Y4I", "Overall": "5.0", "Content": "I bought the TC-P65S60 about four months ago and I'm honestly amazed by the picture quality to this day when I turn the TV on. I seems like the picture is just as good as a family members Samsung 64\" plasma. While it May not have all of the features of the samsung like 3D it's picture quality is right up there. Every time someone sits down they are amazed by the picture quality. I'm sure glad I bought this TV when I did because about one month later I heard that Panasonic isn't making plasma anymore. Which is a bummer because I would definitely buy from Panasonic again.", "Date": "March 27, 2014"}, {"Title": "TV works well", "Author": "James Moore", "ReviewID": "R2LRXQ9M635F50", "Overall": "4.0", "Content": "TV works just fine.  Have no problems with picture; however, wouldn't bother with another internet connected TV.  DVD player and other accessories come with internet connectivity and do the job.", "Date": "March 23, 2014"}, {"Title": "This is a Great TV", "Author": "Matthew E. Mazur", "ReviewID": "R1KIT7Y9JLP8GW", "Overall": "5.0", "Content": "I'm so glad that I purchased this when I did as Panasonic announced that they were getting out of the plasma game. Since that time, the price for this set increased by 60%!The picture quality, internet connectivity and speed to navigate menus on this set are second to none.", "Date": "March 17, 2014"}, {"Title": "Incredible Picture Quality", "Author": "Victor M Garcia", "ReviewID": "R19O7RMCJ3H0WR", "Overall": "5.0", "Content": "After calibrating the plasma and setting it in a low light environment I was blown away by the picture quality. If you can still find this TV at a reasonable price I highly recommend it.", "Date": "March 2, 2014"}, {"Title": "Great picture quality, fairly good as PC monitor.", "Author": "Michael Robinson", "ReviewID": "R74V4D37J3GWG", "Overall": "4.0", "Content": "I don't have much to add to the conversation about this display for watching movies or playing games, the response time and quality are both excellent for the price.However, I do use this TV as a computer monitor and that has created some issues. Mainly, I have yet to find a totally satisfactory solution to the ultra-sharpness you see on text and window/image borders when hooked up to a PC via HDMI. There are dozens of suggestions to mitigate this problem (dropping Sharpness, changing the input label to \"Monitor\", etc), but none really eliminate it.My solution thus far lies in the HDMI Content Type settings. You can change this setting via the television (Menu > Picture > Advanced Picture > HDMI content type) or your PC's graphics settings, at least with Nvidia cards. When set to \"Photo\" mode, oh my goodness, the difference is night and day. The odd halos surrounding text and edges disappear and everything is so much easier on the eyes. The downside? Video as well as games are a little blurrier.The Nvidia software offers some dynamic control over HDMI content type, but I haven't been able to achieve the desired result from it (soft desktop, sharp fullscreen video/games). So if I want to eliminate the blur while playing a game or watching a YouTube video, I have to manually change the HDMI content type. I don't bother, I just live with the blur since it's not that severe, but if anyone has any better solutions I would love to hear them.", "Date": "February 23, 2014"}, {"Title": "Love this TV!", "Author": "Jenny DB \"Jenny DB\"", "ReviewID": "R12JD5D727PCDR", "Overall": "5.0", "Content": "Great picture, phenomenal sound quality. Love this TV and found the best price on Amazon. Was a better deal than Costco, BestBuy, etc.", "Date": "February 18, 2014"}, {"Title": "Have been very pleased with this TV", "Author": "CAC \"caccool15\"", "ReviewID": "R2RRP95ZYSQAZM", "Overall": "4.0", "Content": "The ordering and delivery process were fantastic and smooth. Delivery was scheduled and arrived quickly. The guys who brought it were professional and checked to make sure the TV worked and was not damaged before leaving it.I really like the picture quality which is nice, and the built in Netflix and Amazon apps are appreciated. It isn't as bright as LED/LCD, but for me it is bright enough, even with lights on. That said, there is some reflection if you have lamps in the room behind the TV, they sometimes are visible in the reflection. Most of the time you don't notice it unless you are looking, but occasionally one will catch your eye. I considered paying more for the next model up which is also a Panasonic Plasma, but with more of a matte finish to reduce reflection/glare, but it was quite a bit more expensive. In hindsight, I'm glad I made the decision that I did. I've been satisfied w/ this TV, and the glare/reflection aren't bad enough for me to wish for something else.", "Date": "February 12, 2014"}, {"Title": "LOVE THIS TV!", "Author": "Alicia", "ReviewID": "R3L75E9JNPZRT6", "Overall": "5.0", "Content": "This is our first plasma and we love it! We keep it in the basement where there isn't much natural light. Love the color quality and the Amazon delivery is free, they set it up and it was cheaper than at big box stores!", "Date": "February 8, 2014"}, {"Title": "Great! Excellent plazma.", "Author": "Guy", "ReviewID": "R1YOG4RO7APD0O", "Overall": "5.0", "Content": "I actually bought a Vizio LED at Costco and took it back the first week.  Picture quality was poor.  Stand was so weak, it would not hold the TV square to the floor.  I had previously purchased a Panasonic plazma and was very happy with it, but could not find any locally.  I was skeptical about spending $700 for a television on-line.  It was delivered by motor freight.  The price was varying seemingly by the hour--going up!This is a great product.  If you watch sports, there is no better TV, regardless of the money. Settings are available for the demanding people we have become.  Having said that it is amazing to see how much lighter this TV is over the one I bought 5 years ago.  One draw back to plazma is that the screen is reflective in sunlight.  This is particularly noticeable when the TV is off, but some will notice when it is on.  The quality of the picture more than makes up for this.", "Date": "January 16, 2014"}, {"Title": "Love our Panasonic TV", "Author": "Mary ann Klubek", "ReviewID": "R3VPGTGSV932F0", "Overall": "5.0", "Content": "Great picture quality. Our second Panasonic TV and never had any problems  Very reliable.  Never had to call for repairs.", "Date": "January 10, 2014"}, {"Title": "You got to love it!!!!!!!!!!", "Author": "Carlo", "ReviewID": "R3LGYHRTZEBHTC", "Overall": "5.0", "Content": "I love my tv. I chose panasonic because is just the best out there. Worth every peney of it and QUALITY.", "Date": "January 7, 2014"}, {"Title": "Price meets Value", "Author": "Mark Twain \"John Hancock\"", "ReviewID": "R1V9YP8V58GH2N", "Overall": "5.0", "Content": "Great quality and color. if you can live with just two HDMI jacks then no reason to pay an extra 500-1000 bucks for a bunch of extra complexity.  Easy to set up Netflix and Amazon Prime and stream movies/shows.  Amazon delivery was great too. Brought it up stairs to my bonus room, unpacked it, made sure it worked and took away all of the packaging.", "Date": "December 26, 2013"}, {"Title": "So Pleases", "Author": "Michael Kwaiser", "ReviewID": "R3DUGX05JNZRIY", "Overall": "5.0", "Content": "This is not only the best TV I have ever owned ( I am 63 yrs. old)  The delivery men were superior. Not only did that take great pains in being careful, but they set it up and made sure everything was working. They then took all the boxes  and cleaned up their mess.The TV is superior in everyway and your price and the price of extended warranty were unmatchable.Amazon, keep up the good work.", "Date": "December 26, 2013"}, {"Title": "perfect for 2D home theater in darkened room", "Author": "exclaim!", "ReviewID": "RTWB5L3L7B0DR", "Overall": "5.0", "Content": "The picture is wonderful, especially fitting for a home theater, as long as you have a fairly dark room. It is true what others have said about the reflectivity of the screen - it is very reflective and will not work well for viewing in daylight nor with anything but a dim light in the room. If you have a bright light in front of the room, you will see yourself in the screen, and if you have a bright light in the back of the room, you will see the walls and bookshelves (whatever) in the screen.Luckily, my viewing is almost all at night (and certainly all my premium viewing time is) and I prefer a darkened room with the full home theater treatment (4\" acoustic panels, heavy curtains, 7.2 surround), so this is PERFECT for me. The color and blacks just blow me away.It's an amazing TV, and an incredible deal  at a bit over a grand (open box, nothing wrong with it, probably returned because of the reflectivity issue), and I'm sorry to hear Panasonic is leaving the plasma market, but happy I was able to get an upgrade of my first plasma (2009-era 54\" Panasonic Viera, which was great too).Get one if the conditions are right for you and enjoy an incredible bargain. If you don't have the right conditions, do not buy this.", "Date": "December 24, 2013"}, {"Title": "Very good larger size (50\") HDTV", "Author": "Cranky old guy", "ReviewID": "R1TMTL7EYECLV2", "Overall": "5.0", "Content": "This is a very nice, very inexpensive HDTV. The \"smart TV\" function is good if limited. Of cours, I'm a Roku head, so the limitations are irrelevant in my case. The set is highly recommended.", "Date": "December 23, 2013"}, {"Title": "Excellent product", "Author": "Al A", "ReviewID": "R26TKW5U3TOSOS", "Overall": "5.0", "Content": "Product was easy to assemble, clear directions great color, clarity, detail.  Fits in with my location so I do not have reflection issues, angle viewing is great, HMDI and internet connection all easy. Sound is fine, but i do intend to get a sound bar.", "Date": "December 23, 2013"}, {"Title": "Great screen", "Author": "Julie \"juliedolls\"", "ReviewID": "R1KXNMJ8O31MGB", "Overall": "5.0", "Content": "It's a plasma TV. We chose it over the LED model because it is more easily viewed from an angle. LED units must be viewed \"head on\" for best picture quality. We still have not explored all of the features in the set, but we like what we have seen so far.", "Date": "December 22, 2013"}, {"Title": "Very nice picture quality, but....", "Author": "ErPort", "ReviewID": "RDXF0DF3HXLEO", "Overall": "4.0", "Content": "I am very satisfied with the TV. Only two issues: When the screen is showing a lot of white or brighter colors, it begins to flicker. Not bad, but noticeable. It also makes a humming sound when the screen is bright, but that's easily drowned out by the sound from whatever you're watching.Overall, it's worth the buy for the price I got it.", "Date": "December 20, 2013"}, {"Title": "Great out of the box", "Author": "Dan Anderson", "ReviewID": "R2JQMBT04R7J2E", "Overall": "5.0", "Content": "The Panasonic replaced an older Sony CRT TV. The quality of the picture is much better but the best feature for me was the weight. The old one weighed almost 300 pounds! It was a snap to set up and I love the all of the features such as internet access with Netflix and You Tube. It was priced right also!!", "Date": "December 20, 2013"}, {"Title": "Outstanding value and generally excellent, though does have some flaws.", "Author": "Randall J. Wetmore", "ReviewID": "RGE1O9QFPVF8T", "Overall": "4.0", "Content": "Overall, the picture quality is excellent and can be very finely adjusted via 'Pro Settings', but it is somewhat dim and there is noticeable banding in some content due to the limited steps of gradation (6144 vs. 12288 on the ST60).  It is quite reflective due to no A/R filter, but I'm one who thinks an A/R filter slightly reduces the transparency of the image, so I prefer none.Definitely recommended if you can still find it in stock somewhere (these are disappearing fast).", "Date": "December 15, 2013"}, {"Title": "Gamer's Delight", "Author": "Mario A. Gallardo \"OmegaWari0\"", "ReviewID": "R1BSWSH4KIQUWL", "Overall": "5.0", "Content": "After countless hours of research i found this TV to be the ULTIMATE BANG 4 UR BUCK! There are lot of reviews that have lots of details let face it, if ur looking at this TV ur a gamer like me so your inpatient. Here are bullet points of what you should consider b4 buying.1.The blacks are like batman taking in a bath with JET black ink, while being surrounded by a black hole.2.Input lag : 29.2 ms ( 1 of the fastest there is)3.Plasma Will always bet LCD when it comes to picture quality.4.Very affordable ( i bought at 599$) before black Friday at black Friday it was 899!CONS:1. Mirror image screen, Definitely not suitable for a room with windows or lights!2. Sound quality is bad like all TVSSummary: A must buy IF you can control your lighting otherwise i would avoid at all costs.", "Date": "December 12, 2013"}, {"Title": "King of the Plasmas", "Author": "Ken Balog", "ReviewID": "RMSRS0VUYJP4K", "Overall": "5.0", "Content": "Fantastic Pictire, great looking TV, brilliant colors with deep blacks and no jitter for  fast sports., Very easy setup, Can't imagine a better TV", "Date": "December 11, 2013"}, {"Title": "Stunning TV. Plasma is the way to go!", "Author": "VegasRPh \"VegasRPh\"", "ReviewID": "R1LCABI1HGA35N", "Overall": "5.0", "Content": "I have owned this awesome Panasonic 60\" plasma TV for about 2 years. I paid $949 plus tax for it at a local store. The picture quality is just so perfect and can be viewed at different angles without any problem. 600hz refresh rate = NO MOTION BLUR what-so-ever. NFL Football looks amazing on this plasma, so does gaming systems (PS3/Wii). I did use a picture calibration DVD and fine tuned the picture to a point that anytime people see the TV they always comment on how SHARP the picture is. BLU Ray DVDs will blow your mind......just awesome.Panasonic makes the BEST plasma TVs in my opinion. I hope this set lasts me another 5-6yrs and then I can get a 70\" Panasonic plasma Smart TV for cheap in the future. By then, a 70\" TV should be around $800 or less. YEAH!", "Date": "December 10, 2013"}, {"Title": "Best Tv I've ever owned!", "Author": "Tim Dye \"Mat\"", "ReviewID": "R17T772BHD2JRG", "Overall": "5.0", "Content": "I've owned this TV for two years, perfect! Never had a problem with it! Going to buy another for my wife soon!", "Date": "December 9, 2013"}, {"Title": "Great TV.", "Author": "Bodie Correll", "ReviewID": "R13T7R5NHIJMIJ", "Overall": "5.0", "Content": "Great tv. Good picture. Easy setup. Internet apps easy to use and setup. Best tv out there for the price.", "Date": "December 6, 2013"}, {"Title": "Great budget big-screen plasma with several caveats...", "Author": "Christopher Bryant", "ReviewID": "R1NGPD5DQG58QR", "Overall": "4.0", "Content": "Great value plasma HDTV as long as you can accept the tradeoffs.  The two reasons I returned this model (ultimately for an ST50 from last year) were the excessive plasma buzz (audible on a white screen even at high volumes because it's so high pitched, but I may have gotten a lemon, who knows) and the mirror-like reflectivity of the screen.In a (very) dark room with your surround sound turned up loud, the picture quality of this tv will amaze you for the price, and I'm not sure I would have considered another tv had those conditions satisfied me.  Unfortunately I don't want to watch tv only in the dark and I also like to watch tv at reasonable volumes, so this model wasn't for me.  But if you're on a budget and don't have windows or lamps shining light anywhere near the screen, you'll love this television.", "Date": "December 6, 2013"}, {"Title": "Amazing television", "Author": "JSmith", "ReviewID": "R26XRHXUCRBO1N", "Overall": "4.0", "Content": "Well, I dont know if I got lucky or what. I ordered this TV about 5 weeks ago and it was priced at $999.  Then it jumped to $1499 two days after I ordered it.  Now it's at $1599.  Are Panny Plasmas becoming more valuable because they announced they're not going to make them after 2014? Couldn't tell you.The skinny -- at $999 this TV is an AMAZING value.  At $1599 it's more like a very good value.  As others have said, in a dark room, movies and video games are just an absolute joy to watch.  The darks are incredible.  PS4 games look amazing.  The two HDMI  is, at least for me, not the least bit problematic.  And I've actually found that general lighting in a room does not degrade the picture much at all -- HOWEVER, direct light facing the screen is an absolute no-no. If you have a lamp or a window that is facing the screen it will cause serious mischief.  If you can control this one variable, however, it is a GREAT TV. Period.The other big knock is that plasmas cant produce whites and bright images like LCDs/LEDs.  This is my first plasma and I can say: that is clearly true.  If you really value bright whites or use your TV primarily for, say, watching hockey, this is probably not the TV for you.  I was worried about this myself, but found out very quickly that the ability to produce darker blacks has a much greater effect on image quality than the ability to produce bright whites. It's hard to explain, but there's a reason every cinephile and tech website (like CNET), raves about Panny plasmas and the darks they produce.", "Date": "December 4, 2013"}, {"Title": "Awesome tv..minus one thing", "Author": "Patrick", "ReviewID": "RQRVCDFWB6Z1A", "Overall": "4.0", "Content": "This television seriously needs more HD outputs as well as RCA outputs especially being a plasma. Biggest disappointment with the tv, other than that a seriously nice tv with great picture and color!", "Date": "December 4, 2013"}, {"Title": "Great TV with one minor issue...", "Author": "EddieInAZ", "ReviewID": "R14MRSI54PTD1I", "Overall": "4.0", "Content": "I rate this HDTV 4.5 stars even though their systems only allows whole star ratings.  This is my third Panasonic Plasma and second from Amazon.Our 42\" and 50\" Panny Plasmas were rock solid and had no problems for 5 years.  This reliability and great picture is the reason I sold our 42\" inch and bought this 65\".  Movies and sports are great to watch on this behemoth.The picture, built in wireless and apps are fantastic, and Amazon's price and service are second to none.  It would rate 5 stars, but the screen glare (from windows and lights) is noticeable.  I'm told there is this same TV with a no-glare screen (with a different model number), but that is not what Amazon sells.", "Date": "December 2, 2013"}, {"Title": "Too much reflection", "Author": "Lawrence Seymore", "ReviewID": "R16F23DL2V3IR2", "Overall": "4.0", "Content": "Beautiful picture is ruined by the highly reflective screen. My older 50\" Panasonic plasma does not have these reflections. Why is it built this way?", "Date": "November 28, 2013"}, {"Title": "Great picture, quality product.", "Author": "Patrick J Devor", "ReviewID": "RD2VXF18ADO1P", "Overall": "5.0", "Content": "Upgraded from the 50\" Panasonic that I bought 3 years ago. It too, works like a champ.  Love this TV, picture is awesome, quality is great, even the sound is not bad. I bought a sound bar b/c I thought it would need it, but in reality, the speakers are adequate. Like other people have stated, there is glare if in a bright room-turn the lights down, close the blinds, etc. For the price, this unit can't be beat. I'd buy another one tomorrow. No regrets.", "Date": "November 27, 2013"}, {"Title": "Perfect - for me", "Author": "David J. Silver \"davyboy\"", "ReviewID": "R1XCO5FFV6BD25", "Overall": "5.0", "Content": "Great right out of the box.  The display was too vivid for my taste, but with the Panasonic super easy menu system, it took a moment to correct.  The TV is smart enough to have several streaming choices available with very little setup - due to the excellent wireless internet built-in.  It automatically detected my Note 3 and I was able to stream music, photos, and videos with no effort on my part.  I paid $679 delivered for it.  If you can find it anywhere in that range, snatch it up - it's definitely a keeper.  Don't put much stock in the problems people note about the TV reflecting light too much.  If you watch a lot of TV during the light of day, close a drape or 2 - no  big deal at all.  The quality of the picture is just awesome - you can't go wrong buying it.", "Date": "November 27, 2013"}, {"Title": "Excellent picture", "Author": "Ken Kundrik", "ReviewID": "R2IW124G81BKKZ", "Overall": "5.0", "Content": "EXCELLENT picture, very good viewing angle, loads of features. Set up was easy hooked to our network very simply. I have not connectedto our computer yet.", "Date": "November 27, 2013"}, {"Title": "Great picture, yes light reflection can be an issue", "Author": "David Dare", "ReviewID": "R2UJ0FN8PH75KY", "Overall": "5.0", "Content": "Yes, the screen reflects a lot in heavy light conditions, as reported.  The picture, the settings, are all spectacular for us.  We are very pleased with the picture.  A very nice television for the price.  We wish we could have purchased the 42\", but it was unavailable.  The resolution is noticeably better with all of our DVDs, not just the blu-ray discs.  (Coming from a 720p Panasonic)", "Date": "November 25, 2013"}, {"Title": "Defective", "Author": "Ryan Rumbaugh", "ReviewID": "RASTR6ZPD6XVJ", "Overall": "2.0", "Content": "Got the infamous 7 red blinking lights which causes the TV to power off randomly. Naturally this started happening after the 'enhanced' delivery guy left. :(", "Date": "November 21, 2013"}, {"Title": "Beautiful picture!!!  (sound is also very good)", "Author": "M.W.", "ReviewID": "RJAW5ZZC0PHZ3", "Overall": "5.0", "Content": "We've owned this for about 2 months now.  picture quality on HD movies is outstanding, sound is very good, easy to set up if you have a friend to help.  would definitely buy again.  love how you can see picture from almost anywhere in the room.  only downside is limited number of connections.  could not hook up all the other things we had hooked up to our old TV, but it worked out fine.  We moved the Wii downstairs and switch the cord back and forth between the regular xbox and the 360.", "Date": "November 20, 2013"}, {"Title": "Fantastic picture for people who don't need top of the line home theater equipment.", "Author": "Daniel", "ReviewID": "R20FPDL3B4GO8V", "Overall": "5.0", "Content": "After doing a lot of online research, I picked Panasonic because it's plasma screens consistently were rated highest quality image. I picked this particular model because it seemed to be the right balance of price and technology. It does have internet capabilities but only for Amazon Prime and Netflix and a handful of other pre-determined providers. However, we use a Roku 3 so I didn't need a lot of internet streaming capabilities. I thought for the price this is a great 50 inch TV with crisp theater quality picture and 1080HD. The sound is okay so you probably want to invest in speakers or a soundbar in addition to your TV. Ours seems too list a little to the L side on the base they provide. I'm not sure if other people have that same issue (most of the internal components seem to be on the left) but it's hardly detectable. I think 50 inches is rapidly becoming the lower limit of screen size but if you can afford a 60 in it would be nice depending on your space but the price point does go up dramatically (almost 100%). We have friends over regularly for movies and we're all please with the picture", "Date": "November 13, 2013"}, {"Title": "Problems At Outset", "Author": "Haydenks", "ReviewID": "R23QTEUZ1M1JEB", "Overall": "3.0", "Content": "The Bad News is:  I ordered my S60 from Amazon & it went on the blink six days after I set it up. Panasonic tech support had me describe the problem (no picture, three blinking lights) & sent a new board to the local appliance dealer. A week later, the repairman came out with the part & found it was not the right one for the problem!  Another week went buy & they came out again & installed the correct board.Now the Good News - the S60 has a great picture & was easy to setup. Unlike my Sony Home Theater, the internet was easy to set up & works flawlessly. With some more tech support from Panasonic, I was able to route my audio via my home theater to receive 5.1 sound!Regretfully, I just heard that Panasonic will be getting out of the Plasma tv business next year.  Hopefully, replacement parts will be available for years to come (if needed!).", "Date": "November 8, 2013"}, {"Title": "Outstanding TV that meets all that i need", "Author": "jc", "ReviewID": "R1X1C5QZ6BRYJF", "Overall": "5.0", "Content": "Outstanding TV that meets all that i need.  this was an upgrade to a 42 inch plasma that i had for a long time.  It allows me to connect to internet but not surf the net.  I can stream in HD all the movies i am willing to pay for.  Picture is perfect in a relatively well lit room with minimum reflections off the screen.", "Date": "November 7, 2013"}, {"Title": "Amazing for the price", "Author": "Saint Tardamus", "ReviewID": "R10H8XPZ0HFP38", "Overall": "5.0", "Content": "We have had a lot of HD tvs.  We always lean towards the bargain side of the market, and this one is both a bargain and very, very good.I expected a great picture, but the smart features I didn't expect to work as well as they do.Can't go wrong.  Works great for gaming, for movies, for TV...on and on.", "Date": "November 6, 2013"}, {"Title": "Great plasma tv with top notch picture, in a dimly lit room.", "Author": "D. Woods", "ReviewID": "R2N8GPKN1UPEOO", "Overall": "4.0", "Content": "I love this tv, but i am not giving it five stars due to issue with reflection and washed out screen.  Has one of the best pictures on any tv in a dark room, but if you want this for a bright room you need to go with an LED/LCD or a higher end plasma.  I was also very impressed with the sound in this tv...unless you want a lot of bass and surround sound, it does the job.", "Date": "November 5, 2013"}, {"Title": "Wonderful Plasma HD TV", "Author": "CPB \"Retired Army\"", "ReviewID": "R3MVO4WPUZ1AWQ", "Overall": "5.0", "Content": "Love this TV. It has phenomenal colors. Great for viewing sports. Panasonic makes the best plasma televisions and this one is one of their best. Great price.", "Date": "November 4, 2013"}, {"Title": "Great TV", "Author": "L.J.", "ReviewID": "R3HMC82YTMYR6Y", "Overall": "5.0", "Content": "Great TV for the price. If you arent looking for alot of frills, 3D, \"smart\" Tv get this Tv. Works best in dimly lit room. Awesome picture, hurts my eyes because HD is so brilliant and clear. Plenty of settings to suit your display preference, very user friendly!", "Date": "October 29, 2013"}, {"Title": "So far so good", "Author": "Liza Rockwood", "ReviewID": "R19CQWK6MQZDWA", "Overall": "4.0", "Content": "Delivery was faster than expected (they will not install the base, so it will be left in the bottom half of the box), they plugged it in and test for power (nothing else).  We love the picture quality, but purchased a sound bar to improve it...big difference.  Very happy.", "Date": "October 29, 2013"}, {"Title": "Great, I mean really great product.", "Author": "Bruce Brunelle", "ReviewID": "R3J6E4IZVUFKL9", "Overall": "5.0", "Content": "This is second Panasonic Plasma tv I have owned. What can I say, it's a Panasonic. Nice with the small border frame. So much easier to set up now. Stunning picture! Concerned with the initial dark picture in a dark room, but a quick call to Panasonic solved the issue. Loveit! too bad it will be the last plasma they will make!", "Date": "October 28, 2013"}, {"Title": "Perfect picture  No Audio-Out Connections", "Author": "Heyduck", "ReviewID": "R3ZMSMNX556W6", "Overall": "4.0", "Content": "I purchased this 50\" S60 for quicker/easier Netflix connection. This is my second Panasonic plasma and, once again, the picture is near perfect. The first plasma is simply going to the den for continued use.  The only complaint I have about both TVs is that there is no audio output connection.  This means I can watch a Netflix movie but can't use my surround system.  If anybody has any ideas I would love to hear them.", "Date": "October 26, 2013"}, {"Title": "Best Value at 65inches", "Author": "J. Bewley", "ReviewID": "R37MEZYXUT6M89", "Overall": "5.0", "Content": "If you're in the market for a large plasma, this is about as good as you can do at the moment.....keep in mind, I dont care about 3D, so that was a non-factor for me....this tv has an excellent picture, is relatively thin, and does have smart TV functions like Netflix and Amazon prime (though we have playstation and chromecast so it doesnt matter that much) I comparison shopped all over and still settled on this as the best value per inch.  If you're in the market for a large plasma, this is hard to beat", "Date": "October 14, 2013"}, {"Title": "GREAT PRODUCT FOR THE PRICE", "Author": "Lisa Davis", "ReviewID": "R39N4HA7EZA5LG", "Overall": "4.0", "Content": "When this TV first arrived and we hooked it up -- I was less than impressed.  It took A LOT of tweaking on picture settings.  Once I got over the initial freak out because I thought the picture was always going to look like it did with the factory settings (which was HORRIBLE - apparently it's the \"energy saver\" setting)... I was quite happy.  We have a great TV (wish it did have Pandora on it... my only real wish now) and we didn't break the bank in purchasing it.  Just be prepared to tweak those picture settings before you make your judgment!  ;)", "Date": "October 11, 2013"}, {"Title": "great picture, great tv for money", "Author": "Wilson Alers", "ReviewID": "R33KWTIIIRTK19", "Overall": "5.0", "Content": "Although glare/reflection is an issue dependent on the lighting - if you're not obsessed with having zero glare, this TV's picture quality on sports, movies and normal everyday tv watching is head and shoulders above a LCD/LED at the same price point (I paid $650 in September 2013).I had no interest in 3d capabilities and although I didn't look for a smartTV, just having Netflix and youtube is a nice plus although for most people I am sure the smart features are lacking.", "Date": "October 11, 2013"}, {"Title": "Nice picture", "Author": "Randall G. Robinson", "ReviewID": "R1WS9ITXT5CAE6", "Overall": "4.0", "Content": "We enjoy the picture, and the built in Smart TV options. Only downside is the TV is a little slow transferring to different functions.", "Date": "October 9, 2013"}, {"Title": "Excellent in dark rooms", "Author": "DMG", "ReviewID": "R2REVXXVHMHF30", "Overall": "4.0", "Content": "The TV is beautiful in a low light room!  The TV is worth the price if you plan to put it in a theatre room. No 3D", "Date": "October 7, 2013"}, {"Title": "Terrific TV!", "Author": "L. Davidson", "ReviewID": "R1FULYT44QJMWP", "Overall": "5.0", "Content": "This is our first big, flat-screen TV and I love it! I though 50\" would be too much, but it's not at all. The picture is great, even though we don't have HD service, and the Netflix button takes you right to your queue so you can watch your movies on the big screen. Nature shows are especially wonderful to watch. And for the price, you just can't beat it!", "Date": "October 6, 2013"}, {"Title": "BEST PICTURE EVER", "Author": "Martha Abraham", "ReviewID": "R1J7T10NRFNJ05", "Overall": "5.0", "Content": "Stop looking for the best picture and take my word for it. We are amazed at the picture quality. Compare it at any price and you will not beat it. We are thrilled with our purchase.", "Date": "October 4, 2013"}, {"Title": "Exceptional.", "Author": "husimon", "ReviewID": "R9AYYCS6SX204", "Overall": "5.0", "Content": "Exceptional product, as all the TVs I've had from Panasonic have been.  Exceptional price and delivery from Amazon.This TV doesn't have every internet capability and is not 3D.  We have it in a rather dark room.  For us, all those things make for a much better value than one with more than we want or need.  The picture and sound are truly superior to anything else on the market except for perhaps the Panasonic VT or ST models", "Date": "October 4, 2013"}, {"Title": "Panasonic Plasma only way to go!", "Author": "boB", "ReviewID": "R1L3T1UF1NIL76", "Overall": "5.0", "Content": "This was a replacement for a 46\" version of the same set. Which was broken by accident. This as good a TV as you will ever own. Plasma uses more electricity but is well worth it. The picture is beyound believe. Much better then other types of TVs. There was no question what to replace the 46\" with. Also nice the way I can put my Sony cam movies on a usb drive and watch them in HD on the tv. We use a roku with it for Amaqzon Prime, The blaze, Acorn and a few freebees. Also put an ant up on the roof for about fifty local ant stations. Saving lots of $ after we dropped Directv. LOVE IT.", "Date": "October 4, 2013"}, {"Title": "Fantastic", "Author": "CurtMan", "ReviewID": "R2IAXL8ICEBLG6", "Overall": "5.0", "Content": "My first flat screen! Old 36\" CRT worked fine but after watching my cousin's HD for a week I needed a life improvement. This Panasonic Plasma is unbelievable for it's picture quality and features. I couldn't be more pleased. Amazon's delivery and install service was great and NO CHARGE. Buy your flat screen through Amazon, not one of the other re-sellers. You'll be glad you did.", "Date": "October 3, 2013"}, {"Title": "Easily one of the best picture for 2013 plasmas", "Author": "Mike P.", "ReviewID": "R14SREVG9AIQDX", "Overall": "5.0", "Content": "This Panny has an outstanding picture deep blacks, beautiful colors and a nice sharp clear picture! Can't believe this was less than a grand at 60\". Easily one of the best bargains I have purchased. With very little tweaking this thing will put a big grin on your face!!", "Date": "October 2, 2013"}, {"Title": "Awesome Display", "Author": "Billy gentry", "ReviewID": "RS4CYCNLKAN6O", "Overall": "5.0", "Content": "'ve got the TV hooked up to a PS3 for Netflix and Amazon Prime, as well as OTA Antenna.The picture on this thing is ridiculous. I've got it set in my back room, which is full of windows. For the most part, this isn't an issue, except when watching a darker movie/show. But, also for the most part, I'm watching in the evening. Windows are east, so, once again, for the most part it isn't an issue. I've had a 37\" Visio LED back there for a couple of years, which is a decent enough TV. In my living room, I have a 60\" Mitsu DLP, which I understand if I had it professionally calibrated, would also have a fantastic picture.It had arrived before the Cowboy (I know) Game Sunday night, so I was thrilled about that. High Def OTA is fantastic, by the way. Much better than the Satellite companies and my local Cable provider. Watching that, and now rewatching a few blurays, (Avatar, Fifth Element) have been a great pleasure. When I got my first Blu Ray Player, one of the first discs we purchased was Bram Stoker's Dracula with Gary Oldman and Anthony Hopkins. We've watched a couple of times over the years, and were really disappointed with it, as a lot of the scenes were too dark to make out even on my DLP in my very, very dark living room. So we tried it on the Plasma a couple of nights ago. First of all, the picture wasn't anything to write home about, as it seems that the just put the DVD master on a Bluray, if that makes sense. But aside from that, it did look very good, and we were able to truly enjoy the movie as we had remembered it in the theatre, years ago.Anyway, as soon as this puppy is paid off, I'm getting the 60\" of 65\" for the living room.RIDICULOUS!!", "Date": "October 2, 2013"}, {"Title": "Good TV for Price", "Author": "Joey", "ReviewID": "R12ZIGNYSNEMHV", "Overall": "4.0", "Content": "I'm by no means an expert, but I really like the TV. Picture quality is very good, I'd like it to be a little bit sharper. My friend got one of the upgraded versions of this TV with Smart and 3D and it seems to have the better picture quality over all, but the comparisons not apples to apples (not in the same house when viewing). Overall I'm very happy, for the price I don't think I could have done much better", "Date": "October 2, 2013"}, {"Title": "Just what i need", "Author": "lobatt", "ReviewID": "R2LAR7956NX6OZ", "Overall": "5.0", "Content": "Forget about 3D, Smart TV, blahblah...I just need a big 1080p HD screen to work with my Chromecast/Apple TV/Roku/you name it....And it has built in WIFI(I am looking at you, LG), with WPS, I connected it to my wireless router with just 2 click.Although I believe that any built-in smart stuff are just junk that cost you more, it is nice that it has Netflix, Amazon Instant Video, Hulu plus, Youtube built in with 1 click on the internet button, without adding much to it price. The operation is less smooth compares to streaming boxes, but with only 1 remote, I can just watch what i want from the internet, that is convenient.Also the graphic quality is great in my dark living room.", "Date": "September 25, 2013"}, {"Title": "Amazing Picture!", "Author": "Aaron K. Alldaffer", "ReviewID": "R14SF60LCDKUEA", "Overall": "5.0", "Content": "I have had this TV for about a month now and have to say I really enjoy it. I had a LED before this one and I have always liked the plasma look better. The initial setup of the tv is very easy and connection to your WI-FI is also simple. I don't use any of the smart apps because I have a Playstation. The apps seem simple to use and perfect for a bare bone smart tv. Blu-Rays looks amazing on this TV have to say this is one of the best looking TV's I have seen in a long time. Everything is crisp and colors are bright. The only problem I have is the blacks. The black are very strong, sometimes to strong. If I change the brightness or try and make the colors brighter it becomes to saturated and loses its good picture. I have it set to my best ability at a good balance, just wish the blacks could be handled easier. Netflix also looks really good but you can see some distortion once the internet buffers the video or it catches up. Video games is where this TV surpasses others. There is noticeable lag when playing online games or regular games. Everything is very responsive and PC's look really good playing through this TV. If you are looking for a good size TV for games I would definitely recommend this one.", "Date": "September 23, 2013"}, {"Title": "Love it.", "Author": "Hussein", "ReviewID": "R1DFP3ZVOMO20V", "Overall": "5.0", "Content": "The quality of the picture and the options available on the tv are phenomenal. The quality I got for the price I paid is incomparable. One of my all-time favorite amazon purchases.", "Date": "September 20, 2013"}, {"Title": "The best TV I've ever owned.", "Author": "Steven Hallmark \"Human\"", "ReviewID": "R1PDQAQ36FH4TD", "Overall": "5.0", "Content": "This TV provides a beautiful picture, easy operation, basic smart TV functionality, and a handsome slim profile. I have had zero issues with any aspect of this TV's performance. I have owned several other HDTVs, including LCDs, LEDS, and other Plasmas, and this Panasonic display is head and shoulders above any of them. There is no noticeable ghosting, motion blur, zero short term image burn in, deep blacks and vibrant colors. I only have one issue with this TV...2 HDMI inputs. Other than that, it's flawless.", "Date": "September 14, 2013"}, {"Title": "Amazing TV", "Author": "d.hamen", "ReviewID": "R2WDCGV1YCEVRG", "Overall": "5.0", "Content": "We are finishing our basement and we decided to move our old 56\" DLP downstairs for TV and gaming. We are also putting built-ins around our fireplace so we needed a TV to mount over the fireplace. I did a lot of research and read a ton of reviews on TVs in the 47\"-50\" range. I didn't want to spend a lot on a TV and I want the best bang for my buck. This TV is amazing. Great quality picture, brightness is spot on, and because of the location the TV is in the reflections aren't that big of a deal to me. I pondered going to Costco to get the AR version, but I think I made the right choice. I wanted a Plasma for sports and gaming because of the refresh rate, and I wasn't disappointed. I'm not a TV expert, I'm sure this TV has it flaws, but I am nothing but impressed so far.The company used to deliver the TV was far less desirable. The TV was set to be delivered last Friday but the local delivery company did not have it that way. I called the HQ and the lady on the phone helped get me connected to the local store. They ended up having to deliver the TV the next day. When they showed up and older lady and young man got out of the van and the lady asked me to help unload the TV and get it in the house.Then I had to unbox the TV and set it up. I thought the delivery companies were supposed to set it up and make sure it works, but the lady kept saying no. Not a fan of this company at all!", "Date": "September 12, 2013"}, {"Title": "Great TV", "Author": "Barbara", "ReviewID": "R3F6RLKGNO2I0A", "Overall": "5.0", "Content": "So far this TV is working great.  We were advised to get a plasma TV by someone who knows, and we're glad we did.  The picture is sharp and colors are good.  We don't seem to be bothered by the reflection on the screen, which some other reviewers mentioned.", "Date": "September 8, 2013"}, {"Title": "No issues with this TV", "Author": "Bruha48073", "ReviewID": "R1XUDAXDOIZ426", "Overall": "5.0", "Content": "The TV arrived quickly. Great price, no shipping charges and the delivery crew set it up and turned it on to make sure it was working for free. Some reviews have complained about the reflection. Yes, there is some reflection but I don't consider it any worse than others TV's I've seen in stores. I adjusted the settings to some that I found online and the picture is crystal clear viewing with Blu-ray.", "Date": "September 6, 2013"}, {"Title": "Fantastic buy", "Author": "Mike Kanavos", "ReviewID": "R2O36AI7O1LOF9", "Overall": "5.0", "Content": "Fantastic set!  Go to cnet for \"optimal\" picture settings - and do be careful re: a very bright room.....But if you can keep a room relatively dark - this set can't be beat for the $$$", "Date": "September 4, 2013"}, {"Title": "Amazing picture and quality!", "Author": "SM23", "ReviewID": "R21GEUU0ZCKJ9L", "Overall": "5.0", "Content": "I researched the best 60\" flat screen & after reading reviews for this one, I must agree that it's a wonderful TV!  Great picture, sound, and quality....I'd highly recommend!!", "Date": "September 1, 2013"}, {"Title": "quality TV", "Author": "Ross", "ReviewID": "R23LWNLP2CDBPK", "Overall": "5.0", "Content": "Great TV quality for the price. Not a better deal out there for the quality of TV like this 1", "Date": "August 31, 2013"}, {"Title": "Great service", "Author": "Timo  Wadhawan \"TimoV\"", "ReviewID": "R1NO3PHDIKPM29", "Overall": "5.0", "Content": "Works well have all the features I need. Recommend it highly, price too. My last TV lasted 12 years. Expect this to last 5+ before I get a 4K.", "Date": "August 30, 2013"}, {"Title": "A lot of TV for a low price", "Author": "Ellen Cohen", "ReviewID": "R2K937LM1RXV0C", "Overall": "5.0", "Content": "Picture great.  A lot of TV for a low price.  One of the best televisions we own.  Panasonic is excellent", "Date": "August 23, 2013"}, {"Title": "600 hz plasma tv", "Author": "Thomas M O'Brien", "ReviewID": "R26L1RIMTB8767", "Overall": "4.0", "Content": "everything is great except it needs one more hdmi port for the sound bar thats all i got to say.", "Date": "August 13, 2013"}, {"Title": "great", "Author": "sally durham", "ReviewID": "R1CUKQSDCGJN2O", "Overall": "5.0", "Content": "very nice tv we bought it for our bonus room and i love the picture quality the sound is good  and loved the price protection from amazon", "Date": "August 11, 2013"}, {"Title": "Great quality HD plasma at a great price", "Author": "Rafael J Diaz-Garcia", "ReviewID": "R36YB56YIOK2KG", "Overall": "5.0", "Content": "Very pleased with my purchase.  I shopped around and this was by far the best price for the TV.  Delivery was quick and the well-packed.  Would recommend to anyone looking for an entry level plasma price but mid-range quality.", "Date": "August 3, 2013"}, {"Title": "Great TV", "Author": "Cajun Boy", "ReviewID": "R9PC6IQR0WJ5O", "Overall": "5.0", "Content": "This TV has a great picture and even the sound is OK.  The price was outstanding and with free shipping it is a great buy.  It arrived in excellent shape and the delivery person set it up very quickly.  ...a great TV!", "Date": "July 29, 2013"}, {"Title": "Wow what a TV", "Author": "Georgia Man \"Georgia Man\"", "ReviewID": "RBW07936PO71Q", "Overall": "5.0", "Content": "Ex wife wanted a new tv for her new house. Now hanging on the wall over the fireplace. Great from all angles. Wireless if you need it. Great picture and easy to use.", "Date": "July 26, 2013"}, {"Title": "Exceeds expectations", "Author": "Will Earnest \"Will\"", "ReviewID": "R2I9P95V5DTIE4", "Overall": "5.0", "Content": "I wanted a large(r) screen TV for the lower level where we have the room to enjoy one (on the main level, constrained by furniture).  I didn't need \"smart TV\" and it seemed many implementations weren't that good in any case.My natural tendency was to another brand which I've had good luck with.  However, after some research (and Amazon's guides) I looked at plasmas in addition to the LCD/LED's.  I went to a local retailer (big box) to see what the various models looked like and ended up with the S60 (not ST60) as an open box item - hence a good price.  The alternative was a Samsung but I thought maybe I needed a change if only to preclude crosstalk.In any case, so far at least, this TV has proved to be an excellent choice.  There's no problem with lighting (and reflections) on this level (mostly overhead if on) and on the \"Home Theater\" setting it's pretty close to perfect.  I hadn't realized how much difference there is in color between this type of TV and the LCD/LED's.  The color is rich, with flesh tones that look real for example.  I've gone back to some DVD's that I've used on other TV's and it's noticeable closer to how I remember seeing them at a theater.  So +1 for color fidelity and presentation as intended.We have (enough) capacity for Netflix, Amazon and Hulu.  With this TV, the Netflix button makes it pretty easy to access.  Very slick.  On this model not a lot of extra apps but if I wanted, there's another HDMI port if one wants to explore (I have PS3 attached as well).  Setup is super simple, and works (for me) first time.  The setup (via menu button) is very simple - much better than the last time I set one up (a few years make a difference).  I downloaded Viera2Remote on my tablet - also works seamlessly.  The swipe/swap from the tablet allows very easy slide shows (haven't taken the time to figure out how to change the default music yet).  +1 for easy connectivity.  I've yet to try DLNA - it appears there's a temporary problem with Plex that I use with a Roku box (also an excellent product).All in all, very pleased.  Very simple to set up, works as expected with little extra effort.  Great color.  Actually a great price (I think) given comparable models.  It's early yet so I may find something later on but for now, simply enjoying it.  It seemed that the big box was closing these out even though this set was built in April.  Shows you how fast this market moves.", "Date": "July 24, 2013"}, {"Title": "Very pleased", "Author": "Killa McGrill", "ReviewID": "R20WS2FJV06YWW", "Overall": "5.0", "Content": "Amazon really came through for me on this purchase.  I tried to save $50 and order this from some New York based reseller, but shipping was 10 days out and they added $100 insurance charge on my \"free\" delivery.  Canceled the sale when they tried to sell me $80 HDMI cables.  Amazon's purchase experience was just the opposite.  Free delivery and the guy even plugged it in and tested the remote.  Color and picture quality are supreme.  Inky blacks.  Built in Netflix button on the remote is so easy that my 5 year can use it.  Thumbs up all around.", "Date": "July 24, 2013"}, {"Title": "Awesome.", "Author": "Justin A", "ReviewID": "R1PCTMA5F2N3CT", "Overall": "5.0", "Content": "I have a media room where I can limit ambient light to zero, and a tv mount that allows me to angle the screen away from any glares if I choose to leave lights on or windows open. But seriously, for the price, I love this tv.  Picture is incredible. I would still be wary of putting it in a very bright location. For correct plasma tv locations though, no need to get a more expensive tv.", "Date": "July 20, 2013"}, {"Title": "Good TV, Good price", "Author": "Steve", "ReviewID": "R18EEPJESZS1XH", "Overall": "5.0", "Content": "I bought this to replace a 2010 model Panasonic plasma that my toddler broke.This one is practically half the cost of the one it replaced, and the picture is every bit as good. Everything works as intended, and I'm satisfied with the purchase. I'm using wired internet with this, which works well. I can't comment on WiFi connectivity.", "Date": "July 16, 2013"}, {"Title": "Nothing short of incredible!", "Author": "PaleRider", "ReviewID": "RRPMCGLY9SOCT", "Overall": "5.0", "Content": "This set replaced my Panasonic 50\" Plasma  HDTV that was damaged by an electrical surge during a thunderstorm. That 50\" Plasma  was awesome, and this 60\" Plasma takes that awesome and makes it even better with the increased viewing size. This set has built in wireless as well, perfect for firmware updates, etc. If you want the best picture, get Plasma --- you won't be disappointed!", "Date": "July 14, 2013"}, {"Title": ".tv", "Author": "vinnycaz", "ReviewID": "R2SIQ47OC88230", "Overall": "5.0", "Content": "great plasma , had one prior to this was not nearly as good great color and very sharp, good options on this one and its easy to work no brainer great product. ready for some football", "Date": "July 13, 2013"}, {"Title": "Panasonic TC-P50S60", "Author": "Shaun", "ReviewID": "R11ON4X209YGX2", "Overall": "5.0", "Content": "I bought the Panasonic through Amazon.  I know they back their products so I felt very good ordering through them.  CEVA delivered it.  They moved my old TV out of the way for me and put together my new one.  Turned it on and made sure it was ok. They did a great job.  The Plasma has great color to it.  There is some reflection on the screen, from light sources.  I can live with it, but it might bother some people.  If I had seen that in person I might have gone with an LED or LCD.  They don't show it as much.  I was worried that a 50\" screen size might be too big.  It isn't.  I was going to get a 42\" but they sold out.  This was the same price or less.  I believe I paid $699.99 including shipping.  Seems like a great deal to me.  I also researched and the Panasonic plasmas were getting some of the best ratings.  I am happy with it so far.  It did have a snapping or cracking sound.  Panasonic sent out a repairman to check it out.  He tightened some loose screws. Said that another one had the same problem.  So no big deal.  I would recommend it to anyone for the price and picture quality.  No blurs with fast action.  Just the reflection that may bother some people.  I am glad to have it.", "Date": "June 18, 2013"}, {"Title": "Great Plazma 65\" TV", "Author": "mike zowie", "ReviewID": "R12GIO8CZXE9BU", "Overall": "5.0", "Content": "Great Plazma TV  and panasonic is one of the best for plazma  fits my living room and got shipped very quickly.  Great BUY", "Date": "April 24, 2013"}, {"Title": "So far LOVE it!", "Author": "S. Otradovsky \"healthy mama\"", "ReviewID": "RHAVBMMTZRBJI", "Overall": "4.0", "Content": "Got this from some other store, but it was between this and a Vizio 50-inch E500I-A1. I visted a big box store to compare the two and decided on this because it would be in the basement entertainment area where there were no windows nearby (plasma tv). The sound and picture quality is amazing and I like the internet feature where you can go to netflix, hulu plus, amazon and youtube. For youtube stuff, you can pair your device w/the tv and play trailers, movies, etc. Currently have it paired w/iphone4 and nook color/android side. Got a google app for the panasonic tv so I can keyboard searches for youtube internet or whenever I need to use a keyboard. I'm still exploring all the possibilities with it. Super-easy set-up w/wifi. Right now I'd rather stay home and play with the TV than go to work. That sad or what? lol! One thing I need to do is get a code so I can operate the TV using my Dish remote.  Codes can be found on the Dish site. We'll see how well that works. I didn't want to spend a million dollars on a TV, but wanted the best value for the best price and believe I got it. We'll see later if I'm still satisfied with it. That's why I gave it 4 stars instead of 5. It's only Day 2.10/2013: On the internet side of the TV, on youtube, I was able to pair it with my tablet (Nook color with android added), my son was able to pair with Iphone5 and I was able to pair it with my laptop (Lenovo IdeaPad). However sometimes it didn't work well with my laptop, unsure why. Also you can get a remote control app on Google Play. It's still a nice TV. Wish all the other TV's in our house were smart tv's as well. Oh and the Tilted Kilt in our city uses this TV all over their restaurant.", "Date": "May 3, 2013"}, {"Title": "Best Picture Quality Ever!", "Author": "Robert", "ReviewID": "R15KW0G7ZJEQ17", "Overall": "5.0", "Content": "This is one awesome tv. Picture quality is beyond fantastic. Sound is lacking a bit. But I already have a killer sound bar. Why Panasonic is getting out of the Plasma TV Biz Is beyond me. I HIGHLY recommend this set.", "Date": "November 26, 2013"}, {"Title": "Fantastic picture quality", "Author": "Lisa Chapman \"RNC\"", "ReviewID": "R10CT462945VRO", "Overall": "5.0", "Content": "My old tube (Sony tritron) finally died so I went out and replaced it with an LED TV. I purchased a Vizio that got stellar reviews. Took it home and instantly was disappointed. Everything was blurry and way to white washed. I did some further research and discovered that Plasma was the way to go. I was concerned that my bright room was to well lit for a plasma but I went for it anyway. I was able to get the Costco version with the anti-glare screen ($500). This TV is amazing. I applied some setting recommendations I found and now that the TV has properly warmed up over 100 hours, it looks superb. I do not even have a bluray player yet and I'm already blown away by the picture quality. Love this TV. The apps work fine but its not why I got the TV, any DVD player will do the same. If your looking for a budget quality screen, this is an excellent choice. The only think I would say I do not love is that bright white screens look more like a muted white and there is a hum from the screen when it is mostly white. The hum is super low and almost ignorable when the TV is at normal volumes.", "Date": "October 22, 2013"}, {"Title": "Pleased with TV performance", "Author": "Douglas G. Smith", "ReviewID": "R3F7W5HKUJK2U9", "Overall": "4.0", "Content": "Once I had the cable-control issue resolved, the set-up and subsequent use has been pleasing.  Apparently the remote control can't  be used with the cable connection and one must use the far more rudimentary control furnished by the cable supplier.  I'm concerned that switching back and forth between cable and other inputs may present complexities that could render the television unusable without additional assistance.  As long as the TV is used as a cable connected receiver, I suspect we'll continue to be pleased with the performance.", "Date": "October 18, 2013"}, {"Title": "Can't go wrong with a Panasonic - but you do get what you pay for", "Author": "Olozbal", "ReviewID": "R3FAHOG9K0PB4L", "Overall": "4.0", "Content": "Had this model about 2 weeks now and it's a great TV for the price.  I previously had the top of the line Samsung 64\" 3D plasma a few years ago until my 7 year old decided to introduce the Wii remote to it.  We recently moved and I decided to give it another shot.  I realized with the Samsung all those whiz bang features were useless to me and the 3D was something we put on once for people to look at then everyone got bored.  So this time I went with the low frills Panasonic 65\" plasma and for the price this is a nice TV.Two things to highlight - the first delivery we unboxed it while the delivery guy was still here.....screen was smashed.  Since he was still here we just had him pick it back up and return it.  Called Amazon and they shipped another one no questions asked.  Lesson here - don't let the delivery guy get away until you know you have a good TV.  Note my Samsung a few years ago came the same way.  I can't imagine how many TV's get lost this way.Also, this is a low frills TV and the picture is nice for sure, but we did have the top Cnet rated TV for a while and it is pretty noticable.  20/20 hindsight I'd probably have thrown down a few more hundred bucks and gotten a midrange Panasonic plasma but overall I'm happy with this TV.", "Date": "October 13, 2013"}, {"Title": "Don't buy if you like hockey...Great otherwise...", "Author": "Jon", "ReviewID": "R2EFII3GUC9AX6", "Overall": "4.0", "Content": "For everything else this TV has been great, vivid picture, football, movies, regular TV, even in my tv room with windows. There is a lot of glare/reflections on the TV, you need to be careful where you place it. If you sit directly in front of it, you'll see yourself(and all your other crap) in any scenes with dark colors...However if you watch any hockey the ice is greyish colored and the screen is really dark. You can try tweaking all the color settings, turn of power saving mode but none of them will help. The odd thing is, when your adjusting the colors/settings the picture looks perfect, but once you exit settings and the white ICE is shown on the screen the power saving kicks in and darkens everything(even with no light in room it's too dark). This is not a brightness issue, rather power saving issue, when screen is filled with anything supposed to be white this happens the screen will darken...Good thing I saved the box, it'll be going back... :(Update...I've kept the TV, picture is great, I spent a few days messing around with all the settings, trying to improve the hockey ICE picture. I ended up calling support, they walked me thru a few settings, that didn't seem to make much difference at the time. I think either I've gotten used to it, the TV has \"burned\" in a little more, and I've noticed it really depends on where the Hawks are playing has the biggest impact. There is a difference in the picture coming from my really bight DLP and I think it's just the adjustment.... :)", "Date": "October 2, 2013"}, {"Title": "HDMI port doesnt work", "Author": "Thao Mac", "ReviewID": "R17QHZQXJPHLIC", "Overall": "2.0", "Content": "I connect my HD Box or XBox 360 to the TV via HDMI port , the screen just have message \"No signal. Ensure that the external device is turned on and property connected to the TV's input\". I kept trying to turn off and on the external device, change another HDMI cable and it still doesnt work. I have to get it fixed at expert's place. Just used it for about 1 week", "Date": "October 1, 2013"}, {"Title": "Love it, love it, love it!!!", "Author": "calgal", "ReviewID": "R30IFHQMHZL12R", "Overall": "5.0", "Content": "This is the best TV I have every owned! The picture is phenomenal - even after a few months, I still marvel at how beautiful the colors are and how clear the picture is. All the TV features work great, as well as the remote. I highly recommend this TV!", "Date": "July 20, 2013"}, {"Title": "A Fine TV.", "Author": "Richard B. Herold", "ReviewID": "R2SLXY76VK0MY3", "Overall": "5.0", "Content": "I bought this tv in december, after learning about improvements in plasma technology and wanting a tv with solid blacks on a budget.7 months later im happy to report that it performs perfectly. Great image, slim enough design (bezel and width) and viera connect make it so that i do not think about this tv anymore and can focus on whats on it: which is the highest compliment you can give for a tv.", "Date": "July 12, 2013"}, {"Title": "Good TV for the price", "Author": "Nevits", "ReviewID": "R1Y3YT2IATU73I", "Overall": "5.0", "Content": "I bought this for my Mother-in-Law and she happy with it. For the price, it's a great TV. I'd buy it again.", "Date": "July 7, 2013"}, {"Title": "Pretty nice picture!", "Author": "J. East \"Music coniseur\"", "ReviewID": "R3II29ZPF15ED6", "Overall": "5.0", "Content": "So, after many hours of research and more hours at local retailers (Sam's and Costco included), I couldn't find a better \"bang for your buck\" deal. I made my girlfriend more than slightly annoyed with my fervent search by the way. LOLBut nonetheless, this is the best TV for the price ($699 @ Best Buy). I had returned plasma's twice previously over the past 8 years but this one's a keeper. I had a 55\" Vizio Razor LED Smart/3D that I had bought 2 weeks prior and returned it as I was getting more in product reliability with the Panasonic. Plus, they own all the original tech stuff from Pioneer who perfected plasma technology. So there you have it. Of course, what looks best to you may not be what looks best to me.", "Date": "July 6, 2013"}, {"Title": "nice picture, easy set up", "Author": "Palomo \"Palomo\"", "ReviewID": "R20P2LKWNCBNTB", "Overall": "5.0", "Content": "ordered the Panasonic tc-p50s60 through Amazon, they had the best price.  Delivery was through CEVA shipping and they emailed to set up a delivery appointment.The delivery people offered to set the tv up.Hook up was a breeze and the set up menu was relatively simple, though I do own a couple other Panasonic tv's so I am familiar with the menu's, etc. I was able to sync up the TV to my wireless which is nice since it automatically set up the time.The picture is clear,easy to navigate.Over all very pleased with this tv especially in this price range.", "Date": "June 23, 2013"}, {"Title": "Huge Step Up!", "Author": "R. Parsons", "ReviewID": "R31HN1N13GO1W3", "Overall": "5.0", "Content": "Ok, I must first confess that I bought the TV off of another website instead of Amazon; who I typically get my TVs from. The other site had the TC-P60S60 for $1099 delivered and no tax. Can't beat that price, so hoping Amazon gives it their best shot to come down a little.But onto the TV. First off, I have a lot of TVs, and they are ALL Panasonic Plasma's. (save for the glare issue, these TVs really can't be beat)So, I have a TC-P55GT30, and a TC-P65ST50, and a TC-P60U50. I read up on this TV and it has been mentioned in a number of professional reviews that the TC-P60S60 has better picture than the TC-P60VT50. Considering that the P60VT50 is still about $2500 today, it makes the TC-P60S60 a no-brainer.And boy what a difference! First off, this TV SMOKES all my other TVs. The picture (I calibrated it to CNET spec) is incredible, and even without calibration (just put it into Cinema Mode) I was blown away while running through a selection of HD Amazon movies. (I love to use Rango for testing). The contrast is insane and there are times when the light just pops right off the screen.As an added quirk, Panasonic has updated their Viera Menu, and it is very clean and simple to use (way better than my ST50). The profile while looking at the TV directly from the side -- when are you really ever doing this -- is actually deeper than all my other TVs. But the bezel around the screen is actually thinner and cleaner than the older models (it looks professional). I'm thinking the slightly larger depth measurement is why Panasonic was able to keep the price on this TV so low.In the end - I can't believe how good this TV set is, and I do plan on buying another once Amazon brings down their price a bit.", "Date": "May 22, 2013"}, {"Title": "Nice TV", "Author": "Jazzfan", "ReviewID": "R3MLQSCBOQS96I", "Overall": "4.0", "Content": "I have the top of the Panasonic plasma TV from 2008 and can tell you this screen has a much brighter picture than my older one. Very satisfied with this new one, although the screen is pretty reflective. I was raised on tube TVs so I'm used to a reflective screen. The price is great, the picture is great, what more can you ask for. Oh, I wasn't sure how the silver trim would look, but it's tastefully done and actually looks pretty good.", "Date": "April 25, 2013"}, {"Title": "Great TV with one issue", "Author": "HandymanJD", "ReviewID": "R3LILIQJH8G1D7", "Overall": "4.0", "Content": "We bought the non-internet version of this TV in August of 2011.  On Friday it lost power to a 2 inch wide pixel band right down the middle.  Yep, big black band.  Luckily we'd bought the extended warranty.  We were able to upgrade, since the prices have gone down, and chose the same tv, stepping up to the WiFi version.  Why?  The picture quality is incredible.  The menu's are also easier than ever to use.There are other reviews here with more detail on what the tv has to offer, so I won't repeat all that.  Suffice it to say we had a choice and bought another one just like the first one.", "Date": "June 25, 2013"}, {"Title": "Awesome", "Author": "NBJohn", "ReviewID": "R3333S0LXWZLAV", "Overall": "5.0", "Content": "Had it for a month now. Picture is great, built in internet apps work excellent, no complains whatsoever about this TV. The glare, even in my well it living room, is pretty minimal. It's there if you're super picky about it, but it doesn't interfere with my TV watching.", "Date": "June 6, 2013"}, {"Title": "Great", "Author": "wrkrbeee", "ReviewID": "R18GFJM7FC9870", "Overall": "5.0", "Content": "Shipped in a very durable box with significant cushioning.  Very easy to set up, great picture! Would recommend to a friend.", "Date": "May 18, 2013"}, {"Title": "Incredible Picture for a Good Price", "Author": "J. Wallace \"Zerb\"", "ReviewID": "R22RLZXT25Y3I2", "Overall": "5.0", "Content": "PROS* Incredible picture quality after proper calibration (see [...]* Good streaming (Netflix, Amazon, etc.) from the built-in wireless support; excellent streaming when you connect an Ethernet cableCONS* Although new plasma units don't have the burn-in/image retention problems they once had, you may want to be careful to avoid static images during the first 300 hours of use* Internal speaker lacks dynamic range* Only has three HDMI inputs", "Date": "December 27, 2013"}, {"Title": "lacks an IR input so looses a star", "Author": "J & M's mom", "ReviewID": "RZVWKU9O219E5", "Overall": "4.0", "Content": "We want a soundbar to improve the movie-watching experience, but unfortunately (for our setup) a sound bar will block the TV's remote sensor on the bottom frame of the TV.  The TV does NOT have an IR input so we can't buy an IR receiver extender \"eye\" to put elsewhere on the frame.  DARN!!", "Date": "December 14, 2013"}, {"Title": "Almost Great", "Author": "Raymond Fung", "ReviewID": "R367H4NBEPK0DT", "Overall": "4.0", "Content": "This tv is almost great and would be deserving of 5 stars if it weren't for the very grayish whites, especially when most of the screen is white, this is even in a dim room.  There is just not enough dynamic range in the picture.  Otherwise the picture quality is stunning with vibrant colors and good skin tones at the same time, deep blacks, and a velvety smooth image.", "Date": "December 13, 2013"}, {"Title": "Best TV for the money", "Author": "Grey Bull", "ReviewID": "R30V6U8N4Z5EH4", "Overall": "4.0", "Content": "If all you're after is a great picture, this is the best value I've found.  It's only the 3D it lacks - I don't watch enough 3d to justify twice the money.  Maybe it should get 5 stars but from a true videophile standpoint, the more expensive Panasonics beat it (barely)", "Date": "October 17, 2013"}, {"Title": "How Do You Use This Thing?", "Author": "Joseph Giordano", "ReviewID": "RIPMOKEG8RF1Q", "Overall": "4.0", "Content": "On the one hand, this is the best TV I have ever had.  On the other hand I'm upgrading from a giant 1990's era projection screen so I lack savvy. Beautiful set.  The darks are too dark so I cranked the brightness way up, but I don't really know how to use those settings and the instructions are useless.  There is substantial glare when the lights are on, but that's apparently normal for plasma.  Awesome tv, unfortunately the actual tv shows are terrible.  Two Broke Girls????? America's Top Model???? Maybe I should read more.", "Date": "October 2, 2013"}, {"Title": "Great price for a great TV", "Author": "latemom2000", "ReviewID": "RADJVTAZUHP5T", "Overall": "4.0", "Content": "Although plasma is probably on its way out this TV was perfect for the room we were putting it in (low light).  Beautiful picture and nice smart TV features.  More HDMI and component hook-ups would be nice.", "Date": "September 23, 2013"}, {"Title": "Great deal! Excellent service!", "Author": "Eli", "ReviewID": "R2K7WW38NZ6YXP", "Overall": "5.0", "Content": "What a great deal and everything promised by vendor was top notch! I would buy again. Amazing picture quality and sharpness. Best TV for the money!", "Date": "September 5, 2013"}, {"Title": "Awesome", "Author": "Jarred Welborn", "ReviewID": "R18UBH7F67UT91", "Overall": "5.0", "Content": "Great resolution.  Great picture, easy set up.  cant wait til football season cant believe what a great price this was", "Date": "August 13, 2013"}, {"Title": "Initial Impression Of The Panasonic 50\" S60 Plazma Television", "Author": "Alvin Ferguson \"beastly1\"", "ReviewID": "R3J0BHVIC4R6JG", "Overall": "5.0", "Content": "I've had the S60 for a week now and I'm really impressed by it!  This television is situated in my bedroom that is hung on my wall with a soundbar as it replaces a Samsung 32 incher.The blacks and color detail are impressive to say the least and the built in aps are sufficient enough for me.My next planned purchase is one of the VT60 series that will be situated in the living room but I must say these Panasonic plazmas are a great value especially the S60 series.I highly recommend the S60 as an excellent all around TV especially for bedroom viewing.Update: 8/20/2013:The S60 is still great but I wanted to provide an update about my future purchase of one of the VT60 series plasmas.  Initially, I had stated that my next purchase was going to be the one of the VT60 series in Panasonic's line.  However, I bought the 60\" ZT60 instead and it is a marvelous piece of technology!  It is simply reference quality!  My ZT60 was not bought on Amazon because I bought it from another store at an absolutely fantastic price.", "Date": "August 4, 2013"}, {"Title": "Incredible TV", "Author": "Jacob", "ReviewID": "RV5KM4Y4FE98X", "Overall": "5.0", "Content": "Some highlights...controlling the TV from my smart phone, watching You Tube from my iPad, incredible picture, seamless connectivity with my Panasonic Home Theater system...what an amazing TV!", "Date": "July 31, 2013"}, {"Title": "Excellent Value", "Author": "John R. Blasius", "ReviewID": "R3CCRD88EG3UWW", "Overall": "5.0", "Content": "The quality is as expected and overall, the value is excellent.  It may be \"last year's model\", and there may be newer, better pictures, but you will pay considerably more for features I don't need and wouldn't use.", "Date": "July 12, 2013"}, {"Title": "Great price, great plasma TV, with some smart tv features.", "Author": "Nikki", "ReviewID": "R1R2ET7WA4TKHY", "Overall": "5.0", "Content": "I own 3 Panasonic TV in my house VT30, DT30, and now S60. The S60 is the cheapest TV, but picture quality is about the same. If you don't care about 3D, smart TV features, or a lot of HDMI ports, than this TV is perfect for you.Pro: Cheap, Great picture/sound quality, Built-in Wi-Fi, Remote control.Con: Only 2 HDMI ports.$699 for this 2013 TV is a great deal.", "Date": "June 29, 2013"}, {"Title": "Not cool Panasonic", "Author": "Dillard Roosevelt", "ReviewID": "R34FQ0N9YSV15B", "Overall": "2.0", "Content": "The TV itself looked great for all of 1 hour before it shut itself off and started blinking the power light 3 times. After trying to disconnect the digital antenna and trying different electrical outlets, per instructions from Panasonic's support line, it still wasn't fixed and they said it would take a minimum of a week before a tech could come replace the part that needed to be replaced.Amazon was great about allowing a return and scheduling a pickup, but made me severely question Panasonic's reliability.", "Date": "October 19, 2013"}, {"Title": "Absolutely awesome, but...", "Author": "krees", "ReviewID": "R1UY04E5GNDQMV", "Overall": "4.0", "Content": "Picture quality is outstanding,Sexy thin bezel, Media center feature is great, Bright room performance is ok, Glare from shiny screenAND after 2 different TVs from Amazon, they both make this noticeable buzzing noise when powered on.  Come from the actual screen and not the speakers.  Seems to fluctuate depending on the picture being shown.  Noticeable in quiet scenes or low volume.  I will try to get the warranty to take care of this.", "Date": "September 2, 2013"}, {"Title": "TWENTY DOLLARS LESS THIS WEEK THAN LAST?", "Author": "Bax", "ReviewID": "RQQ1JCULTUBN1", "Overall": "5.0", "Content": "The good news Thursday afternoon was that my TC-50S60 had arrived at JAX airport; the bad news is that Pilot Freight didn't have a truck coming to my island until next Wednesday - but I could drive to JAX and pick it up myself, the lady said. After seeing the Gamecocks hammer my Tar Heels at a bar Thursday evening, and knowing I would suffer dire consequences if I missed opening weekend of the college season and probably depression, as well, if I went another several more days without Pandora, I cranked up the old Tacoma early Friday, threw Ben Rothelisberger, my Boston, into the back, and left at 0500 for the airport. Two burly guys were waiting on me at Pliot's place, and loaded me immediately, laying the TV on its side - face down. The box said it weighed 66.6 lbs. When I got back to my island cabin, I backed the Tacoma up to the outside stairs and thought, how am I going to get this big babe up to my second floor man-cave without help? Hey, no problem - just lift it by its \"box handles,\" and proceed only about 3-4 steps at a time.  Piece of cake, and even at 92 in the shade, I was up the stairs and inside in a jiff.Everything from there was cake....  Base assembly is only 7  larger screws and 4 smaller screws (use your magnetic phillips for alignment ease, or a magnetic drill bit, but not the drill). Machined holes aligned perfectly, and if not, chances are you need to turn the base \"neck\" 180 degrees, as you've got it backwards.  Base is heavy steel, machined beautifully, and is finished in black, which you DO NOT want to scratch. Use rubber surgical gloves, and tighten the screws only fingertight.  That's plenty tight.  Twenty minutes later I had the base installed and lifted up easily to the top of my receiver cabinet.  Hooked up the power cable, HDMI cables from my receiver and bluetooth, installed included batteries in the remote, and clicked the unit on.  No problem, and after loading clicked input on left side of panel, moved to HDMI on screen, clicked, and began uploading DirctTV, as I had been on vacation in Idaho for a couple of months breathing smoke.Perfect plasma picture and surround sound - far better than I've had previously with LEDs - appeared almost immediately for me to questions asked by Panasonic.  Only pic adjustment I made was to try and handle the shock of the Oregon Ducks in all white - and back and forth all night - had a perfect pic also for Alabama, then Ga. v. Clemson., all of which I taped on DirectTV's DVR-receiver - GOD BLESS DIRECT TV - and, tonight my girl friend comes over for the Downton Abbey and Foyle's War specials on PBS.  Direct TV remote programmed to operate TV on first try, and connecting to my NETGEAR 90 network was simple and immediate, once I understood password had to be in lower case letters.  PANDORA is now all over my place... and tonight we tap into AMAZON's PRIME library, as well, for no cost movies that I haven't seen.  This Panasonic Plasma is programed for that, which was an added snd very pleasant surprise for me.This Panasonic plasma - first one I've had - is 5-Star, and I'm gonna wallmount it next week before Gators v. Miami suresure. I just don't understand why it's $20 bucks cheaper than when I bought it.  Were it me, I would have raised the price, not lowered it.  And, no shipping cost for PRIME members, either....  J.Bezos rocks!", "Date": "September 1, 2013"}, {"Title": "Just spend the extra for the ST60", "Author": "Aaron", "ReviewID": "RKNUG6TSUD23W", "Overall": "3.0", "Content": "Bought this and returned it for the ST.Picture was great but had too much of a buzz for me.  A bit of banding in the screen and black levels were adequate, but the ST looks 100 times better.", "Date": "July 11, 2013"}, {"Title": "Great so far...", "Author": "Amazon Purchaser 2010", "ReviewID": "RG8QJKS0H9HGX", "Overall": "5.0", "Content": "We haven't had the tv for very long, but so far so good. I like the screen formatting functionality and the pseudo-Internet capabilities (we've got prime and that interface works very well). I would like to see the ability to cuatomize the \"apps\" though. We have the tv mounted on the wall in a bright room, but the screen clarity/brightness overcomes this.", "Date": "June 26, 2013"}, {"Title": "wow", "Author": "Ronnie Hotz", "ReviewID": "R2M052Q0NIEOAJ", "Overall": "5.0", "Content": "Best plasma for the money.  It blows away any led I've seen.  I love it.  The picture is captivating.  Settle for nothing less!", "Date": "June 25, 2013"}, {"Title": "Great set for the money", "Author": "Wordsmyth \"Peter\"", "ReviewID": "R2MJCD56Z4CLFC", "Overall": "4.0", "Content": "Pros: Easy to set up and use, excellent picture and decent sound. The smart features are terrific - I cancelled my cable TV subscription and the money I'm saving will pay for the TV in less than a year. I'm using a run of the mill router to stream and haven't noticed any problems, though I did upgrade my internet connection to 50 mbps download speed.Cons: Picture is a little too dim in daylight, but my living room gets lots of light and I knew that going in, since it's a plasma set. I think the (very) slightly higher power usage compared to LED units is not a consideration overall unless you're fanatic about conservation.", "Date": "May 21, 2013"}, {"Title": "Decent enough plasma", "Author": "Roc", "ReviewID": "R2X5SH4PRPIYWG", "Overall": "4.0", "Content": "Got this from Amazon; shipping and set up was a breeze. The color was great after calibration, perfect for media content, but not very good as a monitor (LEDs are better). I am very satisfied with the sound; and the form factor is very attractive. The glossy screen is quite reflective so you'd better not use it in a bright room. Panasonic plasmas are gradually out of the market, so I am glad that I picked this up.", "Date": "December 22, 2013"}, {"Title": "TC-P65S60 Review", "Author": "Nate", "ReviewID": "R3J5UJK35FO631", "Overall": "5.0", "Content": "This product from Amazon exceeded my expectations.  It arrived on schedule with the driver delivering it inside the house and leaving it wherever I wanted it.  It was packed in a box that allowed for a safe trip from point A to point B.  I would order another one if I ever needed another TV!", "Date": "August 2, 2013"}, {"Title": "Seven blinks of death 4 months after we received", "Author": "S. Pisani", "ReviewID": "R1JK41R3K2POGL", "Overall": "1.0", "Content": "Do not buy!!! After only 4 months, and we barely watch tv the tv is broke, 7 blinks of death does not come on we have to unplug for hours before it works again - no fix availableRead all the other reviews!!!", "Date": "January 3, 2014"}, {"Title": "Totally bummed...", "Author": "TK", "ReviewID": "R1U4S7GLNEZ4KW", "Overall": "1.0", "Content": "The picture is terrible and whatever I do to it makes it worse. I was going to buy a more expensive and better rated television. Now I wish I did not look at the reviews on here and went with my instincts. I am totally bummed!! At least Amazon makes it easy to return which is why I use Amazon.", "Date": "November 21, 2013"}, {"Title": "Buyer beware", "Author": "JohnH6161", "ReviewID": "R1GI6OOVVR2LQ4", "Overall": "1.0", "Content": "Unfortunately this appears to be a common issue developing with these Panasonic sets i.e the '7 blinks of death'! Several customers are complaining about it. The problem is caused by one, both, or all of the following boards: SC board, SD board, and SU board. Most commonly, the SC board is the one that has failed and because Panasonic have received so many complaints about this issue.I am growing tired of no reply, no call back or if a call goes thru care rep only leaves 5-6 second message that is cut short with no information off v-mail message. Heard multiple time that my emails and faxes a have not been received by Panasonic even though fax receipt shows successful transmission.Repair costSS BOARD $178.49SC BOARD $182.33CHEMICALS & MATERIALs $18.50TAX $22.76LABOR $190.00TOTAL ESTIMATE $592.08", "Date": "September 16, 2013"}, {"Title": "Mirror mirror on the wall...", "Author": "J Wall", "ReviewID": "RV2XP2LHRDSSZ", "Overall": "2.0", "Content": "Bought this in the 60\" version from a local big box retailer because it was out of stock on Amazon to replace a 5 year old 50\" Samsung plasma. Having had a plasma before, I was not concerned with the glare I saw in the store, as the store had tons of light overhead and coming in through the windows...Boy was I mistaken! This S60 is a MIRROR on the wall! I could see color reflections in any dark areas of the screen that I had never experienced with the Samsung. I do not have a lot of direct light coming in the windows. Reflections could be seen even with the drapes closed and one small lamp on. ANY light in the room turns this S60 into a glorious mirror and washes the screen out. Luckily, the big box had a 30 day no hassle return policy. After packing this beast back up in the original packaging and securing it in the bed of the pickup, we began the journey again. This time we went for the BIG one! Purchased the 65\" ST60 with only 7 left on Amazon and free enhanced delivery. Wow! What a difference! The ST60 is everything you read on CNET and more! The ST60 has a bonded anti-reflective coating. Reflections are minimal, you have to look hard to see any even with all windows open and lights on. The picture quality is amazing! Color is consistent, does not wash out like the S60. Save yourself time and buy the ST60 and get enhanced delivery. The delivery was smooth. They scheduled a three hour delivery window, called before they arrived and hung the tv on my existing wall mount. Exceptional service! Thanks Amazon!", "Date": "August 18, 2013"}, {"Title": "Still has heat issues", "Author": "VS", "ReviewID": "R2VNBQZQ7QKJ5I", "Overall": "4.0", "Content": "I bought this tv in June 2013...i was so nervous about buying a plasma and not an LED...which is what everyone is buying. I did months of research and a friend suggested that I buy the plasma. \"More for the money\" he convinced me. He had the 2012 version and he said it worked great so I went ahead and bought this 50\" for $999. When i got the tv and we opened the box, with my luck, I expected it to be broken, but it came in the original box in great condition. The set up was very simple and it looked stunning...the size as well as the picture. After having it on for several hours I was uncomfortable with the amount of heat it generated. I asked my friend who has the 2012 version of the Panasonic if his tv gave off as much heat and he said he cant touch his tv if its been on for 8 or more hours. The heat issues with his version is tremendous!!! Now he did tell me the heat is a problem and that the newer version is much much cooler but he didn't tell me its still a problem...I don't game but hours of watching can be a problem. I ended up having to keep a fan on the tv when it in use for several hours...i am still fearful that it would overheat and just blow up. Other than the heat, the only other problems I experienced was that the Seagate external drive that I bought for it just did not work...it worked on the computer and on the LG but not on the Panasonic. I ended up having to exchange the new Seagate for a used WD Passport and it worked fine. Comparison: Last month my sister bought the LG 47LA4700 and after setting up the LG we compared the difference with the plasma and the LED...it was obvious who was the winner...the LG. The screen was like liquid so clean and clear. There was absolutely NO heat issues and the pointer mouse remote is the bomb!!! I love that you can use the mouse to click on the screen. It made my dumb remote seem like a 1960s version. I really hate that about my Panasonic...its like comparing an android phone to a blackberry 9300...it sucks. What I did not like about the LG is the tv stand. With kids I feel like it would just topple over. The Panasonic has a sturdy flat base. All in all i did get what I paid for which was size as opposed to functionality. Honestly if there was some way I could get a pointer remote for my Panasonic I would gladly buy it...Don't get me wrong I really like my tv but i hope that plasma people work on the issues customers are having and take note for the next version maybe I would still buy a plasma in the next ten years if they keep on improving...who knows.", "Date": "December 29, 2013"}, {"Title": "Picture Quality", "Author": "J. Smith", "ReviewID": "R1T9AYWCWEQUS8", "Overall": "2.0", "Content": "Disagree with Cnet.com's comments on the picture quality being the best. Maybe if I were a technology wizard, I could have adjusted for a better picture. Found the picture to be too dark. The details in shadows were completely eliminated and it got worst in night scenes. Found color control not fixed. Had to adjust color when channel was changed and the process for adjusting the picture is too cumbersome, confusing and lengthy. My assumption is one needs a degree in the process designed for the TV to get it done right and fast, or it could just have been a defective TV.", "Date": "January 29, 2014"}, {"Title": "Good Picture, bad Viera app", "Author": "Zo", "ReviewID": "R3TEBJND2OB54N", "Overall": "3.0", "Content": "TV has a good picture for a midrange plasma, good functionality of the adjustments, but the Viera app for iphone and android was very spotty.  The Viera app did not like swiping to the TV, only 1 in 20 times did it function.  The TV's video is connected through a great Denon AVR-X2000 receiver, DirecTV, AppleTV, PS3 and a Windows PC.  Switching the sources through the Denon's HDMI connections is very quick, very little lag time.  I like the set.", "Date": "September 5, 2013"}, {"Title": "great tv with a issue that I can't resolve", "Author": "Massimo Osti", "ReviewID": "R2BMG9K1TF0M85", "Overall": "4.0", "Content": "Just got delivery of my Panasonic from Bestbuy. The setup was easy and fast. Great picture, great look but: I connected my sony playstation to the TV via HDMI cable and the digital box via another HDMI cable. Every time I turn on my TV with its own remote, the sony playstation turns on as well automatically. Any suggestion on how to deal with this issue. Thanks", "Date": "July 11, 2013"}, {"Title": "TV great enhanced delivery not so much", "Author": "theagle", "ReviewID": "R2WYHGX6MXSHIQ", "Overall": "5.0", "Content": "Beautiful set looks great and work fine. The delivery is a big problem however.  They missed the appointment of 9 to 12 am and arrived about 3.30. The driver was at the house across the street. The driver was in the truck preparing to depart when I got to the truck. Yes it was for me. The 65 inch set was loaded onto a hand cart and wheeled to my door. The problem was this , How does one person carry about 100 lb. TV set down six stairs by himself?  I am 72 and no longer should be doing this but we got it in house. The genius the came up with enhanced delivery maybe need to consider what is being delivered. Someone or something is going to get damaged. Maybe you need to do something. JWW", "Date": "June 27, 2013"}, {"Title": "DOA", "Author": "Christopher Tripas \"Chris\"", "ReviewID": "R6PL640FLSDQM", "Overall": "1.0", "Content": "Within one hour it died. It was a gift,  very embarrassing to say the least.  Took one more week to get someone there to repair it, and I'm not sure if they were able to or not.", "Date": "September 14, 2013"}, {"Title": "Very disappointed", "Author": "John M", "ReviewID": "R2WUP9L71HDMYH", "Overall": "1.0", "Content": "First the pros. I love the picture.Now the cons. Only one set of RCA connectors, Everything is USB with HDMI cables on one end and whatever your component needs on the other. Good luck figuring it out. It claims it has internet capabilities when actually all it is is youtube , netflix, Hulu and another movie provider. You CANNOT surf the web on this thing. No swivel or tilt base, Not at all user friendly.We have only had it a couple months and are going to deal with it for a few more before putting it on Craigslist and trying to re-coup a little bit of our money. I'll NEVER buy another one!", "Date": "December 17, 2013"}, {"Title": "two stars off for poor codec implimentation", "Author": "Steven G", "ReviewID": "RD33HNWRGYW6", "Overall": "3.0", "Content": "A decent value at about $640. The Netflix / Amazon / Hulu / Youtube streaming works great over the built-in Ethernet connection, and I found about 60 over-the-air stations by plugging in a $9 flat panel antenna. I also could play movies served from a hard drive plugged into my LAN router, but the TV was rather disappointingly limited in the file format types it could handle - rejecting about half my library (no .AVI!). So in the end I had to spring for an $88 Android-based set-top box with a more complete (and upgradeable) set of codecs in order to access the full range of LAN & Internet based services I wanted to use. Which means paying a premium for a set with an internal Internet connection was unnecessary since the Android box outputs to an HDMI. I also expected that a set with a full Internet connection would provide for some means of navigating to additional sites not pre-programmed at the factory. The equivalent size & quality Samsung set without the Internet interface was going for $500.", "Date": "November 14, 2013"}, {"Title": "Worst purchase EVER", "Author": "macruadhri", "ReviewID": "REC17V4XRP84E", "Overall": "1.0", "Content": "Bought this TV just over a year ago. Just after the warrantee expired, the TV refused to power on. Panasonic found the closest repair service to be over 60 miles away from my home ( no, I'm not in the boonies -- southern California not far from Los Angeles ). The repair facility wanted $185 just to drive to my home with no guarantee of repairing it AND no guarantee of when they would arrive. I passed. Panasonic has lost at least one potential customer.", "Date": "September 16, 2013"}, {"Title": "Its really just a bit flat and odd colors", "Author": "D.S. Davis", "ReviewID": "R18V14PMXRPWO3", "Overall": "2.0", "Content": "Its just a very lackluster  despite positiver review.. sound is a bit weak as well.  Every time I look at it, I just go... eh", "Date": "November 14, 2013"}, {"Title": "Great picture muddied by horrible judder", "Author": "Gadget", "ReviewID": "REQF6GOR1U8H0", "Overall": "1.0", "Content": "I am on my second one. I wanted this to work. Picture is great. However picture judder is atrocious and makes watching sports or any 1080i video difficult. Also there is an audible snapping sound that has been there on both of my units. It continues even long after tv is turned off. I consider myself a panasonic plasma guy. I have their reference 65\" that I paid $2,500 for. That one is hard to beat. This one just isnt up to standard and I am surprised by this. As like the first one I tried, this one will be going back also.", "Date": "July 30, 2013"}, {"Title": "Never got it...", "Author": "Staci", "ReviewID": "RKHWFJFMW37YD", "Overall": "1.0", "Content": "I wish I could rate this tv, but I never got it... So I will have to rate the experience. I was charged and given a tracking number... And as I watched (what I thought was my purchase) travel towards my address, it stopped a few states away and the status showed it was delivered.  I called the shipping carrier and as it turns out, the seller gave me a made up tracking number, so I was watching someone else's package travel to its destination.  When I contacted the seller, they told me it was a computing mistake and that the would provide the correct tracking number ASAP.  Over a week went by with excuse after excuse until I found out that my tv was never even shipped, and that they did not even have it to sell.My credit card was refunded, but I would never try to purchase an expensive item like this from this particular third party seller ever again.  It was a very stressful experience.", "Date": "January 2, 2014"}, {"Title": "just like the old one", "Author": "pamela goldsmith", "ReviewID": "ROYFFQ7X17V2A", "Overall": "4.0", "Content": "This was a replacement for a previous Panasonic 50\", and it is just like the old one, no improvements that I can see", "Date": "August 5, 2013"}, {"Title": "Great screen, bad electronics", "Author": "pseudoscience", "ReviewID": "R2PY048D6GQZLQ", "Overall": "2.0", "Content": "It seems a shame that the screen is so capable, but the supporting electronics seem not up to the task. If all you're watching is antenna television through the RF input, or images streamed over the built-in wifi connection, the picture is great, although there was noise, and it looked better streaming from my Playstation 3. The problem seems to be in the HDMI inputs and the way the picture is translated from, say, my PS3, to the screen, or worst of all, from my computer to the screen.The problem is that the brightness changes, and it seems to change based on how much brightness is being demanded by the input device. As the image should be getting brighter, it instead gets darker, as if a choke were being applied. My primary purpose for this television was as a monitor for my Mac Mini. Whenever I filled the screen with a window with a white background, or other bright colors, the screen would dim to the point that my eyes hurt from straining to see the picture. Pictures on web pages were barely discernable, and text was barely readable.I own a digital copy of The Hobbit on Amazon Prime, and I streamed it through the television's wifi connection. I watched the Rivendell scene with Galadriel and Gandolf standing on the cliff with the sunrise in the background. The wifi connection produces a great picture, and it didn't seem to suffer from the brightness issue, but there were other kinds of noise. I switched over to my Playstation 3 and streamed the same scene via HDMI input and there was absolutely no noise, the picture was beautiful, but the brightness changed dynamically. I then watched the Riddles in the Dark scene, where Bilbo meets Golum for the first time in his cave. This dark scene looked superb. The blacks were perfect, even in the shadows, but at the end of the scene when they run out from under the mountain into daylight, the blacks were suddenly crushed (crushing is when you loose detail in the dark areas and it looks like a clump of dark black).I played Red Dead Redemption, which is a cowboy game that puts you on a horse in the Mexican desert with the sun blasting you during the day. At high noon, when the sun is brightest and the whites are nearly blown out, I loose all detail in the blacks. Then, the game switches to night mode, and the blacks suddenly come alive. The starry sky looks beautiful.I spent an hour talking to the Magnolia guy, and I learned that to get a picture that lives up to my standards, I will have to spend a couple thousand dollars at least. Apparently, what I need is something that not only has a beautiful screen, but circuitry that is strong enough to properly translate the video from the HDMI inputs. I thought $700 would be enough, but it isn't. I almost bought a $2000 Samsung instead, but the whole point of this was to treat myself because I got myself out of debt, but I am not about to get myself right back into debt by buying something beyond my means, so I am going back to my old tv. It is a 32\" Dynex (Best Buy brand), and it has served me well for a couple of years. I would rather have this small tv with a perfect picture, than a big plasma that changes brightness. I might buy a larger version of what I have, like a 42\" Dynex LCD. I've really been surprised by how great the picture has been on this Dynex 32\".", "Date": "May 18, 2013"}, {"Title": "Disposable tv no repair parts.", "Author": "Ronald Mcleod", "ReviewID": "R2R19VLSEW7ABP", "Overall": "1.0", "Content": "I loved my 50\" plasma for 3 1/2 years with no problem until 2 months ago Essentially the exact same TV as this newer model....then the power light started blinking in a sequence of seven.  This code means one of the boards has gone out.  Google seven flashes of doom (or death.)  Tried to get it repaired but guess what...Panasonic does not make replacement boards for this TV making it junk. The repair shop tried everything to get one but they just aren't available.  The reason is they figure that by the time the TV fails out of warranty you will want to replace it with the newest thing. Bull I don't need the newest thing I need a TV that will last longer than 3-4 years and have repair parts available for at least 10 years especially for a part that is well known for failure.  It's just a circuit board that costs them next to nothing to make and they can make 300% profit from it.  So aside for a bill to the repair shop .( they were sympathetic and only charged $50.00) I now own a $1200.00 boat anchor after 3 1/2 years of light to moderate use. Good luck.", "Date": "October 11, 2013"}, {"Title": "New plasma tvs only putout pcm 2.0-TERRIBLE", "Author": "RICHARD", "ReviewID": "R2IL6SRO6CBBB3", "Overall": "3.0", "Content": "Literature says 5.1 just passes digital audio thru unlike older sets was suppose to be changed in 2010 but wstill just converts to pcxm 2.0 instead of passing signal thru.", "Date": "June 5, 2013"}, {"Title": "google 7 blinks", "Author": "Charlie", "ReviewID": "R39F1O1M637QAK", "Overall": "1.0", "Content": "google panasonic 7 blinks, then decide if you want this tv. panasonic is having a lot of issues with the \"a\" board and the tvs are failing after a year. no warranty has been extended.  but they do work great for the first year so if you replace your tv every year...", "Date": "June 29, 2013"}, {"Title": "Poor quality and customer support.", "Author": "Wayne", "ReviewID": "R15FWN5F1ZAZAQ", "Overall": "1.0", "Content": "Two years ago I bought a Panasonic Viera TCP55GT30 from Amazon.  Paid $1566.90.It is my second Viera and had a beautiful picture.Last week it refused to start, showing the \"Seven Blinking Lights of Death\".Look that up in Google. Panasonic first said they would not service it, and offered a \"Loyalty Discount\" on a new tv.This is a two year old set!Later they called me and said to have an authorized service center evaluate it and they will see if they will pay for part of the repair.I did that and the SU and SC cards are bad.$300.00 just for the parts.  $515.00 total repair cost, plus $95.00 for the evaluation.Also the SC card is on back order.I don't know when I will get my set up and running.I don't know how much I will have to pay.If it is 50% or less and the SC card arrives soon, I will probably have it fixed.It is all very annoying.But I have seen similar complaints about other brands.May end up just replacing it with another brand and hoping for the best.One week later:This is to add additional info on this product.I heard from Panasonic, and I will credit them with being prompt.  It only took them  2 days after they received my paperwork to give me a call with their verdict. Of the $515 it is going to cost me tto fix this TV, they will eat only $175.  Not even half.  So, I am faced with spending $340 more to fix a 2 year old set.I am going to do it, since the alternative is four figures to replace it.But, this is strike two, one more, and it is a new TV for this house.So, the one star remains.  Panasonic should spend more on engineering, and less on advertising.", "Date": "July 30, 2013"}, {"Title": "Prepare to locate a service center", "Author": "seth harris", "ReviewID": "R265CRJXZ9IXSS", "Overall": "1.0", "Content": "I bought this Panasonic Plasma after reading consumer reports just like the rest of you. I purchased in 10/2011. Loud buzzing was intermittent from the get go. Set died with the 14 red light blink code after 9 months. Drug it down to the electronics repair station after opening a case with panasonic. They replaced a board and we were back in business a week later. I am now at month 16, out of warranty, the set has died with seven blinking light code now. They tell me it is a different board this time. It is back at the repair shop as I write this. Panasonic says it may cover part of the repair based on their discretion. I thought I was pretty smart throwing out my old bulky tube tv, meanwhile the tv repair shop has built a new building and stopped leasing. I wonder how many of these disposable flat panel televisions I will buy in my lifetime. I should go down to the trashdump with a shovel and find my old tube television, I bet it still works.", "Date": "August 8, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "600Hz Sub Field Drive\nOnline Movies\nGlossy Black Pedestal\nTV without stand (Width x Height x Depth): 59.1 X 34.8 X 3.15 Inches, TV with stand (Width x Height x Depth): 59.1 X 36.9 X 14.2 Inches", "Name": "Panasonic TC-P65S60 65-Inch 1080p 600Hz Plasma HDTV (Discontinued by Manufacturer)", "ImgURL": "http://ecx.images-amazon.com/images/I/41FOQFQ3oxL._SX300_.jpg", "ProductID": "B00ARAHBK0"}}