{"Reviews": [{"Title": "The Current Industry Standard In Picture Quality", "Author": "vqworks", "ReviewID": "R1DT0D0XU3CPZI", "Overall": "5.0", "Content": "As a consumer who actually bought the ZT60, I think I can put a few things into perspective. Back in '09 I saw a demo of a 50\" Pioneer Kuro plasma (the industry reference for black level quality until now) at a store with the lights switched off. Yes, I was impressed. Blacks looked visibly black. A couple of months ago I went to a Magnolia (Best Buy) store to see if the ZT60 could live up to its hype. The ZT60 was not in a controlled demo room but was placed on a wall directly under a VT60 with a lot of ambient store lighting. Under such lighting conditions, I honestly couldn't see the difference in black level between the VT60 and the ZT60. The main advantage of the ZT60 under bright lighting was somewhat less reflectivity/screen glare. I asked for a demo in the dark demo room but only a VT60 was in the room. I checked out the blacks using night scenes off my own \"Taxi Driver\" and \"American Werewolf in London\" BluRay discs. Blacks were inky black. Since I couldn't do an A-B comparison between a VT60, ZT60, or the Pioneer Kuro TV for black level using the same material the best I can do was base my comparisons of black level on memory. Given the Kuro's already impressive performance, can anything else \"blow it out of the water\", as some posters on CNET put it? I'll just say that the Kuro has finally been laid to rest. But let me say that when a black screen appears on the VT60 it looks extremely dark already.When looking at a black screen on my ZT60 at home at night with the lights off, it appears that the unit is practically turned off (really). At that level, it's just an exercise in futility to compare it to a Kuro and split hairs. It's plenty good enough for me.In overall performance it handily beats the very best LED backlit LCDs I've seen, including the current Ultra HD 4K sets (except in resolution) I've seen (since all of them use LED backlighting). At this point, you may be wondering why I would compare a 1080P HDTV to a 2160P (4K) set.  Based on the demos of 4K sets that I've seen on 60 to 65-inch screens, the difference (really just resolution) between 1080P and 2160P is only visible when you are standing several inches in front of the screen.  Most people would rather view from several feet away in a living room setting.  Also, the 4K demo material is video-based.  I can't imagine seeing any more detail even from a transfer of a 70mm film print when seated at a normal viewing distance in a living room.  In terms of 4K sources, the Blu-Ray format does not support that resolution, leaving Sony to offer a $600 4K media box that only works with their own brand of 4K TVs.  There's another alternative in the form of an even more expensive source component.  But all this points to a shaky start for yet another format that provides little benefit to consumers.  In fact, 4K is just a transitional format for the 2nd tier of the Ultra HD standard, 8K.  So why buy 4K at all?  Anyway, I digress.Back to the subject of overall picture quality.  With all the statements about black level, you'd think that that was the only important picture parameter. I'll say that one of the first things I noticed about both the VT60 and ZT60 were the great reproduction of different shades of gray (maybe better than the Kuro set which had a tendency to crush dark shades of gray to black). On the ZT60 there seems to be, if anything, also a noticeable advantage in the reproduction of red. Reds are reproduced with a natural purity I've never seen before. I can't comment on the 3D performance of the ZT60 because I don't have a 3D BluRay player but I briefly converted a 2D Blu-Ray to 3D. The motion seemed to appear with the \"soap opera\" (video) effect. That said, 3D performance is not important to me so I consider the feature to be a \"throw in\" anyway.My only pet peeve about all the professional reviews I've read about the ZT60 is the statement that SD sources look great. While it's true that DVDs appear extremely good on the ZT60 when using an HDMI connection, the aforementioned statement is obviously based on the reproduction of DVDs (which occasionally look like HD sources) and broadcasts. I say this because there is no support for legacy sources that use the S-Video connection. I've seen so many professional reviewers trash this connection by saying that making an S-Video connection was awkward (well, you don't do it often, do you?). Yet, there is no criticism of the old composite video connection's quality. I don't think a professional reviewer would mind putting up with the minor inconvenience, given the composite connection's dot crawl from inherent crosstalk between the luminance (black & white) and chrominance (color) signals.  As expensive as the ZT60 is, you'd think that an S-Video input would be included. How much can such an input cost?  I make a big deal about this because I have a lot of S-VHS recordings of material I simply can't buy or don't care to buy again in another format and I also have some laserdiscs. The composite input of the ZT60 rolls off the high end of the video signal. Looking at an S-VHS recording of a standard definition Snell & Wilcox resolution test pattern through the composite connection shows a horizontal resolution of well under 300 lines. Yet looking at the same recording through the S-Video input of my old old SDTV shows roughly 410 lines. So what to do? The receiver connected to my ZT60 doesn't have S-Video inputs either so I can't use it for any handshaking between the S-VHS VCR and the ZT60. Fortunately, I have a D-VHS machine that has S-Video inputs and HDMI outputs so I can either play my S-Video recordings through this machine or use its S-Video inputs for my S-VHS VCR (which does a better job playing S-VHS videos) along with the HDMI outputs to the receiver. Result? The 410 lines of resolution appears on the ZT60 and the recordings closely approach DVD quality.Despite the S-Video omission, I still believe the ZT60 is a 5-star product. Its reduced screen glare/reflectivity, its practically perfect black level, the great reproduction of shadow detail, and extremely accurate colors have seduced me already. In fact, these performance parameters are unrivaled. As I've already mentioned, the first parameter cannot be matched by the current generation of higher resolution Ultra HD TV sets, given their use of LED-backlit technology.To make the most out of the ZT60, I switch to the THX Cinema mode, load a Spears & Munsil Blu-Ray calibration disc then adjust the black-level, contrast, sharpness according to the disc's test patterns and set the color temperature to the normal setting. I didn't find the recommended picture adjustments of CNET reviewer, David Katzmaier, helpful. In fact, the settings seem to appear way off when looking at the results when using my OPPO BDP-83 Blu-Ray player as a source.In a nutshell, I'd list the Pros vs. Cons as follows:Pros:Unrivaled picture qualityExtremely accurate colors/color temperature in the THX mode/EBU modes right out of the boxBeats The Pioneer Kuros black level and gray scale reproductionLow screen glare/reflectivity compared to all other plasmas to dateCons:ExpensiveNo S-video input to make the most of S-VHS sources; composite video input rolls off high-end and makes SD sources appear duller than they areComment |Looking for voting buttons? Sorry, we don't let customers vote on their own reviews.2/28/2014 Update Regarding 3D viewing: Initially, I commented on a \"soap opera\" effect when switching to the 3D viewing mode.  Upon closer examination, I realized that the motion-smoothing circuitry was turned on by default in this mode.  Once I went through the \"Picture\" menu options to defeat the motion smoothing, the \"soap opera\" effect disappeared.  Be that as it may, unless you have genuine 3D source material (mine is simulated from a non-3D Blu-Ray player), you may quickly grow tired of the 3D viewing mode.  After about 30 minutes or less of viewing in 3D mode, my eyes felt a bit fatigued.  So I just watched in 2D mode.If I were to sum up the appearance of the 3D mode, the results are not unlike what you would see when looking through old \"Viewmaster\" 3D slides (remember those?).  Rather than seemingly palpable images, objects appear to be 2D cutouts layered at varying depths.  The appearance isn't unpleasant but it's not realistic either.  I'm not faulting the ZT60 for this because this is a characteristic I've noticed with all the 3D sets I've watched.", "Date": "August 5, 2013"}, {"Title": "Panasonic's Flagship Reference TV", "Author": "Simon", "ReviewID": "R2HOPF1W5AZ0HG", "Overall": "5.0", "Content": "I got my ZT60 in May, so I guess I am one of the grandfathers. I wanted to get a good TV last year, but VT50 wasn't quite there yet. This year was very exciting for all AV enthusiasts with Samsung F8500, VT60, and ZT60. Samsung was released earlier, and it was quite promising, but I hold up until the release of ZT60 when I could compare them side-by-side. Although VT60 is very close to ZT, it was never on my list; to explain, one critical decision point for me was the air-free panel, and VT has the air gap between the glass and plasma screen which may produce unwanted shadows. Samsung is a very good TV, and let's face it, it's a fantastic TV, but I chose ZT because of a few personal reasons. In my opinion, ZT has better pedestal, it has better black levels and shadow details, and it is THX certified. Some may disagree, but I wanted the closest to the reference picture that I could get, and that was the ZT. Samsung has the advantages of being super sharp, super bright, and having no \"Fan Noise\" issue.The only problem I had with my ZTs was the \"Fan Noise,\" and I exchanged my sets a few times. Thankfully, Panasonic has a \"Foam Fix\" now. Fan Noise is something different than the well-known Plasma buzz, and not too many people will experience this; however, if you are one of the unlucky ones, this will eat you to the bone. Fan noise first identified by the European AV website on the VT series, and they found out if the back panel is removed, there is no noise. So, the noise is not coming from the fans per se, but from the airflow they create in relation to the back panel. The noise is like pulsation and whirling that some people have described as having an old fridge running in the room. It has been reported that Panasonic has a fix now that reduces the noise, and it contains a set of foams that will be installed underneath the fans. A service call to Panasonic will send you a technician to install the foams.Picture quality of ZT is fantastic. If you have a bright room though, you may also consider F8500, since it can go much brighter than ZT. As a matter of fact, according to the shootout, ZT is the dimmest of all, and even VT has better brightness compared to ZT. However compared to VT, ZT has a superior antireflective filter that should help with ambient lights. I also like the slimmer form factor of ZT without the side speakers.I came from LCD, so I was a complete stranger to Plasma technology. It seems that Plasma phosphors age exponentially in relation to time, so the first 100 hours is extremely crucial to a steady picture quality. It is advised that you run the slides--like D-Nice's--for at least 100 hours so the red, green, and blue phosphors age evenly. After this period, you should be fine with any contents. I have tested this myself, and it really makes a difference to run the premade slides. You can search for D-Nice's 2013 Panasonic settings, and download the slides. If you are really serious about PQ, you should also consider a professional calibration to get every last bit of the reference picture out of your set. The slides will also help you prepare your panel for the required initial 300 hours for a professional calibration. If you ever need to check the panel hours, you need to go to the service menu, which also can ruin your TV if you are not careful and voids your warranty. However, if you need to access the panel hours anyway:*** WARNING: use it at your own risk. Changing settings can void the warranty ****  Press and hold the {VOL -} key on the side of the set, and without releasing, press the {INFO} button on the remote 3 times.*  After a few seconds you are in the service menu.*  Press {2} key on the remote to select \"SRV-TOOL,\" then press {OK} key.*  Go down to \"PTCT: 00.00.00.00.00\" and move right using remote's cursor keys.*  Press and hold {MUTE} button on the remote for 3 seconds.*  Time and number of power cycles will be shown in red.*  To exit, just hold down the power button on the set (not the remote).The apps on the TV are pretty basic, but all the important ones are there: Netflix, Amazon Instant Video, Hulu, Vimeo, YouTube, and etc. The DLNA Server app can only play x264 files from my NAS, and it doesn't support DivX or Xvid. Web browser app is pretty basic, but it works. I used my Bluetooth keyboard and it connected without any problems. Overall, this TV is nicely packed with apps, and there are a few extra ones that you can download within the TV. One annoying thing for me was the Viera Connect Banner which is a fancy name for unauthorized advertisement on your TV. You can turn it off from: {Menu}->\"Setup\"->\"Display Customization\"->\"Viera Connect Banner\"->\"off.\" Just make sure you are on the full screen home page on a normal HDMI input, since the option does not appear in every apps/inputs.I've never owned a 3D TV before, so this is my first. I immediately ordered the IMAX: Under the Sea 3D and IMAX: Deep Sea blu-rays to check out the 3D, and it was impressive. Although they are active shutter 3D, the provided glasses are pretty lightweight and comfortable, and they use a non-rechargeable user replaceable battery. You can also get Panasonic TY-ER3D4MU rechargeable 3D glasses, and they are compatible.If you are looking for the best picture quality, there is always OLED with its current hefty price. However, if you want to get the best reference picture for the money, ZT is the best of all in my opinion. Even right out of the box, the THX settings are good enough to show you what this TV is capable of. Give it some time and age the phosphors evenly, and you will end up with a picture that has the deepest black levels and color depth that make the 2D pictures almost like 3D. I don't know what 2014 will look like, but if you need a TV now, you can be very happy with the ZT.Compared to VT, ZT has:* No Camera* No Side Front Firing Speakers* Less Brightness* Better Filter* Studio Master Panel with No Air GapCompared to F8500, ZT has:* No Camera* Less Brightness* Less 3D Resolution* Less Overall Sharpness* Fan Noise (before the foam fix)* Better Black Levels* Better Shadow Details* THX Certified", "Date": "August 16, 2013"}, {"Title": "Panasonic P65ZT60 review and comparisons with P65VT60 and Sony 65W850A", "Author": "SciRe", "ReviewID": "RVHPOLJLHEQX7", "Overall": "5.0", "Content": "P65ZT60 Highlights:Incredibly good picture quality from high-quality HD inputs; the best picture quality of any TV for watching 1080 HD programs at home from usual viewing distances; exceptional black levels and picture contrast; great picture details even in dark and mixed scenes; very natural, accurate and truly deep, solid, rich and smooth colors (including white color); natural and smooth skin tones; 2D picture looks almost 3D in high-quality scenes with edges of people and objects clearly defined and separated from the background; great motion handling; great for watching sports, movies and any other programs; no color blooming or light bleed that is observed on LED/LCD TVs; very good picture brightness and lowest screen reflections of any of today's TVs (plasma and LED/LCD) which makes it suitable for brighter rooms as well; excellent picture quality also from all side viewing angles (immensely better than LED/LCD TVs); very good picture adjustments and factory pre-set picture options; THX certified picture settings; standard definition (SD) picture quality (via HDMI input) is as good as on any other high-end TV; nice and discreet TV frame and stand without noticeable light reflections; very thin TV profile - as thin as most LED TVs; nice and intuitive TV remote control.P65ZT60 Possible Concerns:Like with any plasma TV image retention might be a concern for some users (see the full review below for details and how to minimize this concern); although not a big concern, some low level TV buzzing noise could be heard occasionally during some quiet, brighter scenes in a quiet room from some of these TVs; the TV speakers are adequate for most general use but a sound bar or a separate sound system is recommended for movies (for sound effects) and music shows; the TV cost and availability - at $2,800 (for a 65\" set) it was a great value for the picture and overall TV quality, especially when compared to the other more expensive but lower (by comparison) picture quality TVs - however it may not be available much longer at an affordable/reasonable price for most people.See the full review below for more details and how to adjust the TV settings for optimum TV performance.==========I looked for a few months for a high-quality TV to replace my almost 6 years old Sony 52XBR4 (52-inch 1080p, 120Hz) LCD TV in my family room. This XBR4 LCD TV has CCFL backlights that were used before the more recent LCD TVs moved to LED backlighting. Today's LCD TVs are usually called LED TVs because of their LED backlights. The old Sony XBR4 TV is still one of the best 2D TVs of any kind today, with precise picture details, strong colors and good viewing angles, but mine developed some intermittent display panel issues that cannot be fixed.  For me high quality of 2D picture is by far the most important attribute of any TV, with everything else far behind. I had never owned a plasma TV before. Knowing the Best Buy's good return/exchange policy (no extra cost to me, plus very good and free home delivery and TV stand assembly every time) I decided to try some top plasma and LED TVs at home before I settle on the best one for me. I did not want to go for a 4K/UHD TV mainly because of their still extremely high price (for a 65-inch or larger TV), the picture quality with 1080 i/p HD sources was not visibly better from my normal viewing distance, and no meaningful quantity of 4K/UHD programs is or will be available any time soon. Also, all current 4K/UHD TVs are LED TVs that similarly to the today's 1080p HD LED TVs suffer from limited viewing angles as their picture fades significantly when viewed from more than 20 degrees or so away from straight in front of the TV.I don't have a preferred brand but do consider the company commitment to product performance, quality and support. Product performance (picture quality for TVs) is more important to me than the price, within a reasonable and affordable price range. I first purchased a Panasonic P65VT60, 65-inch plasma TV from a local Best Buy store. I returned it about two weeks later and replaced it with a Sony 65W850A, 65-inch LED TV. I returned it as well and replaced it a week later with a Panasonic P65ZT60, 65-inch plasma TV, which I still enjoy very much. Although I bought all these three TVs from a local Best Buy store, I posted my reviews here on Amazon. I like Amazon reviews, use them often before buying things, and I can update my reviews later if I want or need. I also considered and made some comparisons with the Samsung's top 64-inch plasma TV, PN64F8500, and its 65-inch UN65F8000 LED TV, but that was based on in-store evaluations only.To some readers it may be useful to know that all these three TVs (the ZT, VT60 and W850A) were manufactured in October 2013. They were used and evaluated in my family room that has large windows on one side. My open-style kitchen is behind me when sitting straight in front of the TV. The room does not have any direct sunlight but normally receives enough daylight to read a book. In the evening and at night there are usually ceiling lights in the kitchen behind me when watching TV, and I often have ceiling lights on above me and the TV. The TV sits on a floor stand about 2 feet from the floor. I usually sit about 12 feet from the TV straight in front of it and occasionally about 6 to10 feet from the TV and up to 50 degrees to the side from straight in front of the TV.My typical TV watching is via an HD cable (1080i) through an HD DVR connected to the TV via a high-quality HDMI cable. The programs my family and I normally watch are: NBA, soccer and NFL games, movies, news, business news, golf, music concerts, TV shows, all mostly in HD but some are 4:3 SD with vertical black side bars. Some HD movies I watch are wide, 2.35:1, with horizontal black bars at the top and bottom of the screen. The HD source content is usually of good quality, but there are still many shows and movies on HD channels that clearly are not of 1080i HD quality although they are labeled as HD. I also watch Blue-ray movies and concerts from time to time, all via a high-quality HDMI cable.<< Detailed review of P65ZT60 Picture Quality >>It's difficult to describe how incredibly good picture quality (PQ) is on the ZT with optimum picture settings when fed with a high-quality 1080 i/p HDMI input without seeing it for yourself. All colors look very deep and strong/solid, not just the predominantly mentioned (in online reviews) inky black color. The screen brightness is very good.  Picture details, including the edges of people and objects are so well defined and separated from the background that the picture appears very real and often almost 3D deep in high-quality scenes. I did not notice this as much when watching this TV in the store, so if you want to check it for yourself you may need to buy one, feed it some good 1080 HD source content, adjust the picture settings to your liking, and enjoy it. Buy it from a store or online seller that has a good return/exchange policy, so your only risk is that you may like it a lot and keep it like me. Keep in mind though that lower-quality video content will look lower quality like on any other TV, so don't expect miracles. SD shows look just OK like on my XBR4 LCD TV. Good SD DVDs look very good though.Color reproduction looks superb on both VT60 and the ZT, and the overall picture quality looks great from virtually any viewing angle. The ZT's picture appeared slightly better in a dark room than the VT60's (this could be subjective) and noticeably better in a room with some lights or daylight - probably mainly due to the ZT's much better handling/reduction of screen reflections.  Unless you increase the vividness related settings, the colors look very natural. All professional online reviews that I read said that the factory preset ZT's THX Cinema setting already had very good color accuracy (it's THX certified by Panasonic as well) and that further calibrations produced only minor color accuracy improvements that none of us would probably notice when watching this TV.  The color accuracy also depends on the cameras used for the recordings and on video processing, which may affect the TV picture.  Never having a plasma TV before and recently watching some new and much more vivid LED TVs, I initially thought that the picture colors were too subdued on plasma TVs. That also got me to feel that my old XBR4 LCD TV picture colors were subdued as well, as they looked similar to plasma colors (I had my XBR4 in the factory pre-set Standard picture mode). Then I started paying attention to how things I see on TV look in reality, like local NBA team jerseys and the basketball court markings, hoop rim color, etc. Unlike as displayed on in-store LED TVs (and many at home ones), the actual jerseys were not as bright in their color but had deep solid colors, the basketball floor markings were not shiny red but more dark red and the hoop rims were not red but orange. On both VT60 and the ZT these colors looked to me very close to the natural colors I saw directly with my eyes.There seems to be some truth to the color gradation claims for the ZT and VT60 and to other advanced picture processing/producing features. For example, faces and skin in general look realistic and smooth from pixel to pixel not just in large camera close-up views but also in normal views. The W850A LED TV and to a lesser extent my old XBR4 LCD TV sometimes had small flat-looking patches of seemingly same color pixels, apparently not being able to properly process/display subtle color gradations/changes from pixel to pixel. Another example of this was visible while watching golf. The W850A TV often displayed the grass at mid and farther distances as patches of seemingly same green color. I could not improve this much even with numerous picture setting adjustments on the W850A. On the other hand, both VT60 and the ZT showed a natural green grass with a lot of detail in similar situations.To really see fine details in dark scenes you may need to adjust the picture contrast and/or brightness levels while playing, or even better pausing on some dark scenes. Otherwise the picture may lose some details in dark scenes, or even be too bright, depending what picture setting you select. I did need to adjust my short-time owned VT60 TV in its THX Cinema settings like this. It often felt a little too dark in the default THX Cinema settings. My ZT brightness looks optimal in the THX Cinema mode with or without the room lights or daylight being present. Like with any other TV the picture brightness also depends on the brightness of the source content, not just the TV settings. However, I don't feel I need to change the picture settings when viewing different programs. Different brightness settings may be more suitable for your viewing contents, conditions, or your liking. You can also have two or more different picture settings to use with different programs if you want, like the THX Cinema Bright Room picture setting if you like a brighter picture. Keep in mind that each video input, e.g., HDMI1 for your cable, HDMI2 for your Blue-ray player, etc., has and keeps its own picture setting, so you need to select/adjust their picture setting separately at least once, if you want to change their default setting.I changed the picture settings for all my viewing from THX Cinema to the Professional calibration settings recommended by Sound and Vision in their online review of P65ZT60.  Those Professional settings produce virtually identical picture quality to the THX Cinema factory preset on my ZT60, including brightness, sharpness and color accuracy, and they are much friendlier to the TV regarding image retention (IR).  THX (and EBU) settings lock Pixel Orbiter to the Auto mode (not changeable), while the Professional and other picture modes let you set the Pixel Orbiter in the constant \"On\" mode, which makes a big difference regarding image retention (I discovered this recently).  See more info about this in the IR section below. Thus, I highly recommend the Sound and Vision Pro settings with Pixel Orbiter set to \"On\".  You can just adjust the contrast and/or brightness in those Pro settings based on your viewing environment and programming you normally watch, if you feel you need any picture brightness adjustments.When watching some rock concerts on Palladia HD channel (1080i) the stage and instruments often look so real on the ZT that you feel you can reach inside the TV. The sense of depth is often so good that when the camera shows the stage over the outdoor crowd's heads, it feels like you are there at the concert. Lights at night and indoor concerts look superb, and all different colors look vivid and focused as they should be, which also confirms that these plasmas can display truly vivid colors. This is also noticeable in animated movies where computer generated colors are used to enhance the vividness in the source material. Madagascar 3 - 3D movie looked awesome even via 1080i cable, with amazing colors and with objects (and animals) flying realistically at us from the screen that made us jump instinctively few times, as it looked like we were going to get hit.Sports also look great on the ZT when the video source quality is very good. The motion handling is great and smooth on both plasmas with all extra picture processing help in the picture settings disabled. Movies, especially from Blue-ray discs, are a true treat with this TV. This is where all decent TVs are usually very good, but not as good as the ZT (and the VT). It's hard to imagine how a high-quality Blue-ray (1080p) movie can look any better on any other TV, including 4K/UHD TVs when viewing from farther than few feet. The W850A is also very good with Blue-ray content but only up to about 20 degrees away from being straight in front of the TV (the picture fades when watching from farther to the side). Current 4K/UHD TVs had similar off-angle viewing issues when I checked them in local TV stores, with some of them little better than others. Nobody in my house is or will be using this ZT TV for video gaming, so not feedback from me in that domain. This room has always been free of video gaming and will stay that way; nothing to do with the ZT.As for the concerns that white colors don't look white enough on these plasmas, e.g., the ice in the ice hockey rink; well, the ice in the hockey rink is not truly white, especially not bright white like displayed on LED TVs when set to high brightness. White clothes, jerseys, walls, paper, text, etc., look real white on both the ZT and VT60. They just don't look glowing white on these plasmas, as they are not glowing white in reality either. You can easily adjust picture settings on these plasma TVs to make their colors more vivid if you want, but that would make them look less natural and probably remove some details from the picture like it would on LED TVs when set to high brightness or vividness. However, this is a matter of personal preference, and everyone can choose what they want. At this point I can say with confidence that the ZT (and VT) can produce outstanding picture for any type of HD TV content as long as the original recording and the incoming video signal (via HDMI) are of high quality. I have seen this on various types of TV programs. So if your ZT does not show a great picture don't blame it; blame what's fed into it, unless your ZT unit is defective.ZT vs. VT60 - I returned the VT60 after two weeks mainly because it sometimes had noticeable light reflections on darker scenes; nothing bad but enough for me to consider other TVs. Otherwise the VT60 is one of the best TVs, especially for a darker room. On the other hand, the ZT has the lowest screen reflections of any TV (plasma and LED) I saw at Best Buy (see more details below). The ZT appears somewhat brighter than the VT60 in my home environment when both are on the same factory preset THX Cinema picture setting. The picture on the ZT looks better than the VT60 picture when ambient light or daylight is present - probably mainly due to better handling of ambient light/daylight. Only the ZT incorporates a Studio Master Panel with a unique air gap-less panel technology that helps with these advantages. Each ZT TV is manufactured one unit at a time (unlike any other mainstream TV) which limits the number of ZT TVs produced. Thus, somewhat higher price of the ZT vs. VT60 is justified based on these performance advantages and extra manufacturing cost. I think that the ZT screen panels are manufactured in Japan using the above-mentioned special manufacturing process, but the final TV sets for North America are assembled in Mexico (mine has Assembled in Mexico on it).ZT vs. W850A - I wanted to try at home what seemed to be one of the best 65-inch 1080p LED TVs. The W850A is a very good TV overall, especially if you watch it from straight in front of it and up to about 20 degrees to the side. My VT60 had better picture quality than the W850A in my viewing environment where visibly worse screen reflections of VT60 were not a big problem. As for the ZT vs. W850A, it does not really feel fair to compare them directly. The ZT is the top plasma TV, and really top any TV, while W850A is Sony's second or third tier down, although price-wise they are not that much apart (the ZT currently costs only $300 more). All main aspects of PQ looked better on the ZT than on the W850A - more realistic/natural colors, better depth of all colors (not just black levels), better picture details (no color blooming or light bleed on the ZT), clearly defined edges and separation of people and objects from the background, smoother motion, better and smoother skin tones, incredibly better viewing angles, somewhat lower screen reflections, etc. You can have the W850A brighter than the ZT, and some people may prefer it that way, but to me that usually means sacrificing some picture quality.<< Screen reflections >>Besides comparing screen reflections from ambient light at home on these 3 TVs, I did some side-by-side comparisons of screen reflections at a local Best Buy Magnolia department that had medium-level ceiling lighting. I did not have any side-by-side comparisons between these 3 TV at home because when the new TV got in the previous TV was taken away. However, my in-home evaluation of each TV is in agreement with my side-by-side comparisons at Best Buy. All evaluated TVs were on a single straight wall with the lower row on TV stands and the upper row hanging on the wall. The VT60 was immediately above the ZT on the wall. Next to the VT60 was Samsung's PN64F8500 64-inch plasma TV (Samsung UN65F8000 LED TV was below it), and a 65W850A was in a second spot away from the ZT. A sales associate was very nice and helpful to pause the Blue-ray player feeding all these TVs on a fairly dark scene. Reflections are normally not a problem on bright scenes on any TV. While all TVs were paused on the same dark scene, I moved from TV to TV at a distance of about 8-10 feet from each TV and stopped shortly to memorize my own reflection on each TV, and on different passes to compare reflections of other things in the room. I repeated this many times. The VT60 appeared to have the worst reflections of me and the other things around, while the ZT eliminated most reflections reasonably well and even appeared slightly less reflective than the W850A. In fact, the ZT looked less reflective than any of the TVs on the wall. There were about 10 other high-end TVs on the same Magnolia wall, mainly LED TVs, including 4K/UHD TVs. Samsung's PN64F8500 plasma was noticeably more reflective than the ZT and the W850A but noticeably less reflective than the VT60.I repeated this evaluation also when all TVs were completely off and the screen reflection comparisons were the same. Interestingly, all TVs appeared to have somewhat worse screen reflections when viewing from an angle than when viewing from straight in front of the TV. Although Samsung's PN64F8500 plasma TV can be visibly brighter than the ZT or VT60, if you want to have strong colors on it, especially strong blacks, it will still be more reflective on darker scenes than the ZT, which is where most screen reflections happen. I did consider buying the PN64F8500 but there was no price advantage over the ZT (the ZT is currently $300 less expensive) and the picture quality on the ZT looked somewhat better to me in mid ambient light at Best Buy. Also, the PN64F8500 stand is as wide as the entire TV, and I would have to spend hundreds of dollars on a new floor stand. I sometimes notice some subdued reflections on my ZT at home on very dark scenes during the day or at night with the room lights on, but they don't bother me. The ZT is clearly much less reflective at home than my VT60 was.<< Image retention (IR) and burn in >>Originally, I used my ZT60 (and the VT60) in the THX Cinema picture mode, until I discovered that having the Pixel Orbiter set to \"On\" makes a big difference regarding image retention. Both THX Cinema and THX Cinema Bright Room modes have the Pixel Orbiter setting locked to \"Auto\" and you cannot change it in these picture modes. I am not sure what \"Auto\" exactly means or does here, but having the Pixel Orbiter set to \"On\" instead makes a big difference for IR. How big? Here is one example. After watching the NBA channel on my ZT for about an hour in the factory pre-set THX Cinema mode, with the NBA information ticker at the bottom of the screen on all that time, the wide and strong static \"NBA TV\" text from the ticker and the ticker static horizontal lines were visible on closer look on lighter backgrounds even hours after watching other channels. The retained text was relatively faint and eventually, after 10+ hours of watching other channels, I could not see it any longer. Interestingly, I could not see any retained text while running the Screen Wipe (which is white) although it was visible on various lighter color backgrounds.  I repeated the same scenario with the ZT picture in the above mentioned Professional mode with the Pixel Orbiter set to \"On\", and I could not see absolutely any IR at all from the moment I changed to a different channel - no text or line retention at all even on very close examination. My additional similar experience with static text, lines, boxes and logos also confirms that having the Pixel Orbiter set to \"On\" instead of to \"Auto\" makes a big difference with regard to the image retention (and possible burn-in, if the same IR is repeated long enough) so I highly recommend having it set to \"On\".  I never notice any difference in picture quality or any image movement because of the Pixel orbiter being set to \"On\" compared to \"Auto\". I don't know how the Pixel orbiter on the ZT (and VT60) exactly works, but it does not appear to be just changing the adjacent pixels around each other, because it works well also on static text and other static objects that have 5 to 8 or more adjacent pixels of the same color in all directions, and often there are many static, same color pixels in the horizontal or vertical direction.You have to use a picture mode different from the THX (and EBU) to set the Pixel Orbiter to \"On\". Knowing that THX Cinema on the ZT is certified to the THX standard for color accuracy, I am now using the Professional calibration settings from Sound and Vision that make the picture quality on my ZT look virtually identical to the THX Cinema PQ, including brightness, sharpness and color accuracy. Just google \"Sound and Vision ZT60\" and you will find their Pro calibration settings details in their P65ZT60 review. Make sure that you enter them exactly in one of the two Professional picture modes on your ZT, not in Custom or some other picture mode; because each factory Picture mode on the ZT has some different embedded settings that you cannot change, although the detailed color settings that you can change look the same (zero) in all of them. I had entered the Sound and Vision Professional settings initially in the Custom mode settings and the picture looked different than when entered in the Professional mode. You will also need to enable the Professional calibration setting on the ZT in Menu / Setup / Professional mode (isfccc) - On, before you can enter these recommended settings back in the Menu / Picture / Picture mode / Professional 1 (or 2). Make sure you set the Pixel Orbiter to \"On\".If you still want to use the THX Cinema picture mode, I suggest some caution if you have same static text or images for a long time (continuously or repeatedly). While checking these TVs periodically at a local Best Buy Magnolia store I noticed some image retention on all 3 in-store plasma TVs (VT60, ZT and F8500). They had some IR even after 3+ weeks, like some BD menu text and the two horizontal lines at the black bars borders from predominantly displaying 2.35:1 movie clips. In addition to watching predominantly (day after day) 4:3 SD content or 2.35:1 movies, sport channels could be big IR offenders, more than other channels, because they typically keep their information tickers at the bottom of the screen even during commercials. Other channels usually run 4-minute or so commercials every 10 or 20 minutes during which all static tickers, text and network logos are normally removed, and the plasma TV phosphorus can refresh frequently.  Video games usually have static image parts that may increase IR with prolonged use when the same static image is displayed repeatedly at the same screen spot for a long time. Based on my above experience, the Pixel orbiter set to \"On\" should help with this, but I have not used the ZT (or VT60) for video gaming so I cannot be sure.My ZT screen is still clear like when it was brand new, although it had some IR in the past as described above. I have not done anything different or extra with regard to the TV break-in. No running of any break-in slides, no avoiding of any channel, content or anything else. My family (including my young kids) and I watch diverse contents on this TV like we watched on our Sony XBR4 LCD TV it replaced. None of us play video games on it though, as no video gaming has been played in this room in the past either. My ZT is almost never on the same channel for more than 3 hours. I also enabled the TV setting to automatically turn the TV off \"when no operation of the remote and side panel keys continues for more than 4 hours\" (just in case). This setting is in Menu / Setup / Eco Navigation.<< TV noise >>I sometimes notice some slightly elevated buzzing for 2-3 seconds occasionally on some quiet scenes and when the room is very quiet.  It appears to be related to some brighter scenes but only sometimes, and I never hear it on darker scenes. The buzz may also be amplified by the wall cavity behind the TV. This occasionally elevated buzz is not noticeable when there is some room noise or when the TV volume is on more than about fairly low 12 (out of 100) and there is some sound coming from the speakers. The buzz is similar to a desktop computer buzz - more of a mechanical vibration type.  It's different that the occasional whirling (fan spin-up) noise that I sometimes heard from my VT60 while I had it. Otherwise, the ZT makes some constant low level buzzing noise (like from a low noise computer) that I don't notice while watching TV, as it is not audible from in front of the TV even when everything else is very quiet and the TV is muted.<< TV Sound >>The speakers on the ZT are quite adequate for general listening. They often feel too loud when the volume is set on more that 25 (out of 100). I normally have the volume between 15 and 25 for most programs. While the sound volume from the TV speakers can be high, the quality of the sound is just OK for movies and music, and I often use my home audio system there instead. The sound from the VT60 felt somewhat stronger (from its front pointing speakers) but was also just OK in quality. The W850A produced somewhat weaker sound than the two plasmas (I needed to set it to about 35/100 for normal listening) but was still adequate enough for a flat panel TV.<< TV Set Appearance >>The ZT has a nice and discreet screen frame and TV stand that do not reflect the ambient light much or in any distracting way. The ZT looks similar to the VT60 but somewhat sleeker, and the red power-on light indicator at the bottom of the screen frame of the ZT is smaller and its light much more muted than on the VT60, so it does not divert your attention at all (you can barely see it). The W850A has a very shiny/reflective and thick TV stand that I felt at times I wanted to cover with something. Even the screen front frame on the W850A, being essentially shiny black, was visibly reflective in my room setup.<< Summary >>The Panasonic P65ZT60 plasma TV, in my opinion, has the best overall picture quality for typical home viewing compared to any current TV of any kind. You can get a brighter, higher resolution, or larger size TV, but for usual home viewing of today readily available high-quality (1080i/p) video content from usual viewing distances, including off-angle viewing, the ZT's picture looks the best overall, including 4K/UHD TVs. A different TV may be better suited for your own situation or preferences though, so do your own research. Also, keep in mind that to achieve the ZTs outstanding picture quality you need to feed it with good quality HD content. Sadly, Panasonic is getting out of plasma TV manufacturing, and soon there will be no new ZTs made. Being manufactured one unit at a time in limited quantities for only about a year, there will not be many used ZTs either.I know that there are still concerns out there about possible plasma screen image retention and burn-in issues. My recent experience has nearly eliminated these concerns for my diverse ZT TV use with the recommended TV settings (as in the above IR section). There also may be some concerns that in few years it may be difficult to get spare parts if something goes wrong with the TV. I purchased the Best Buy's 5-year warranty ($600) that also covers image burn-in and a full TV replacement if it cannot be repaired. I really want to be able to do everything I reasonably can to enjoy this TV and protect my investment for at least 5 years. The ZT is that good, especially when compared to the other currently available TVs.", "Date": "December 25, 2013"}, {"Title": "Fan Noise Very High -- Picture the best on the Market", "Author": "C. James", "ReviewID": "R3F041DKDVL8ZX", "Overall": "3.0", "Content": "Note: I exchanged the Panasonic 65ZT60 for a Samsung 64F8500 due to the fan noise that for me and my setting was excessive, however I had it for a week while they arranged the exchange. The fan noise is why I gave it a 3 and not a 5, and the picture was why I just could not give it a 1 even though I exchanged it.When I wanted to move from a 50\" to a 65\" Plasma TV I had little doubt that it was likely going to be Panasonic Plasma, I have been using them since the second year Panasonic made consumer Plasma sets, however for this kind of money I did some pretty deep comparison shopping and research. The selection very quickly came down to the Panasonic 65ZT60 and the Samsung 64F8500, they both have an outstanding picture and roughly equal smart features. The Panasonic is also now the #1 Plasma picture on the market, near perfection to the reference standard. Which sounds great but as they say, a picture is worth a thousand words. After many side-by-side viewings with my own selection of Blu-Ray discs I went with the Panasonic.However, it did not give the best picture under all conditions, in low light to ideal lighting, the Panasonic has to me a better picture and this is untuned out of the box. Tuned up it gets even better. However in a normal sunny day lit room the Samsung was equal and then in a bright room, like curtains open on a sunny day, the Samsung well out performed the Panasonic amd also on 3D, the brightness of the Samsung gives new life to 3D.  The Samsung is a little brighter than the Panasonic so it holds the color better in a room light enough to read in. Also note that to get the near perfect reference picture from either of these requires a professional calibration, but do not worry if you don't get one, they look great out of the box.The delivery guys put in on the stand and I put in the HDMI from the cable box, turned it on, and even before the picture pops up, I hear the fans, and not a steady whirr but an undulating woo-woo sound that some describe as a refrigerator sound.It turns out that it is not just the fans, but also the air flow through the case, there is a rather long discussion on the issue on the AVSForums (they host Audio-Video equipment forums). Panasonic has an official fix which most report as reducing the noise a lot but not eliminating it.To be fair, the ambient noise in a lot of settings may be high enough that you would not hear it, and even if you do hear it, it might not bug ya, but if you are in a quiet setting like I am, make sure you can retuned based on being \"unsatisfied\", it really did bug me so in the end I exchanged it for the Samsung.", "Date": "October 18, 2013"}, {"Title": "One of the best TVs ever made", "Author": "Peter DeMars \"repete66211\"", "ReviewID": "RTNX10VW6J3W5", "Overall": "5.0", "Content": "My primary concern with a TV is first and foremost picture quality (PQ).  For my intended use, apps, peripherals, features, etc. are all secondary to PQ.  The ZT60 has the best PQ of any TV I've ever seen.  All the key features of PQ--color accuracy, saturation, contrast, shadow detail--are fantastic and the blacks...well, all I can say is if I were asked how much blacker the TV could get I'd have to say, \"None more black.\"  :) Unlike many (most?) TVs, the ZT has two picture modes (THX Cinema and THX Bright Room) that look great right out of the box.In my house 3D won't see much use but I did watch a movie with the supplied glasses and, again, no complaints.  Most of the apps are gimmicky.  I have no interest in watching YouTube on my computer.  The ZT includes the usual suite of streaming options (i.e. Netflix)but due to the interface (keyboard not included) navigation isn't very efficient.  Additionally, since Audio Return Channel (ARC) is so buggy, if you have a surround sound system, as you should with virtually all TVs these days given their weak speakers, all of the streaming apps are better accessed via an external Blu-ray player.How does the ZT fare versus the competition?  It compares well to the less expensive VT60 if 100% of your TV watching is in a very dark room but the filter on the ZT does a better job blocking ambient light.  The VT does have beefier speakers and a pop up camera for Skype, two features which don't benefit me personally.Shortcomings and limitations: ARC is finnicky.  Sometimes it works and sometimes it doesn't.  In online a/v forums some have complained of excessive noise from the cooling fans.  Mine compare to the noise level you get out of a PS3 (slim) or a desktop PC.  (As of early August Panasonic has a fix in the works.)  As with all plasmas, the screen is glass so if you're in a very bright room or if there are windows opposite your TV you may want a TV with a matte screen.  Burn in really isn't a concern for plasmas anymore but some do still have image retention (IR), which is the short-term retention of a given image, usually a static TV channel logo or the ticker that runs along the bottom of ESPN.  I have 200+ hours on this unit, in which I've watched letterbox, pillarbox, ESPN, static logos & gaming and have yet to see IR of any kind.", "Date": "July 8, 2013"}, {"Title": "Spectacular. Really.", "Author": "Enzo M.", "ReviewID": "RLN09ZNEQ99M8", "Overall": "5.0", "Content": "I'm an electronics entusiast and although I never got the chance to own one, I love most things about the much heralded Pioneer KURO. I remember the print ads and I think I remember a few of the comercials but at the time, although I really wanted one, I sadly couldn't afford one. The contrast, the color reproduction and THE BLACK LEVELS. I know this isn't a KURO review and I only state the above to give an idea about how performance oriented I am when it comes to the electronics I would consider buying/owning (up to what I can reaslistically afford of course). OLEDs look great but no way can I spring $9,000 for a TV.Anyway, before getting my 65ZT60 home I happily lived with a 2011 Panny 55VT30. That set was, at the time, one of the top three TVs you could buy following the nearly $6,000 Sharp ElitE and it was either tied with or ever so slightly better than the comparable Samsung plasma depending on who you spoke to.I expected a lot from the VT30 when I purchased it, maybe too much as it turned out. It delivered the goods on most of my expectations but like so many others out there, I wanted KURO like performance or better which I didn't get. No set at that time was considered as good as those damn KUROs long since gone, not even the fantastic but very expensive Sharp ElitEs. My trusty VT30 may not have completely fulfilled my expectations but my new ZT60 certainly does.By comparison the VT30's picture is much dimmer than the ZT's. It lacks the ZT's achingly beautiful color reproduction (partly due to it's lower light output), the ZT just seems to look crisper overall and the images from all sources seem as lovely and richly reproduced as they can possibly be given whatever source the ZT is receiving. In some respects I can't even justify comparing the two because the ZT easily out handles the VT30 performance wise in my opinion. In fact (to state the obvious), I'm only listing comparisons between the two here because the VT30 was my previous set.The ZT is plenty bright also, brighter than I thought it was going to be as I was expecting only a little added brightness over the VT30. Wrong. Images have a lot of punch and vibrancy to them and I don't mean the cartoony, unrealistic kind you get by using the 'vivid' picture setting. Both my ZT and VT are professionally calibrated so I only use the ISF day/night modes for both 2 and 3D viewing. I can't imagine this TV not being bright enough for someone except for maybe if it's placed in the very brightest of rooms.Everything I've watched looks appropriately fantastic on this thing keeping in mind the quality of the source. By that I mean standard def content via cable only looks ok, not great but its standard def to begin with so I don't expect an HD like picture with such a crappy source. On the other hand, HD cable channels look great with vivid colors and pinpoint resolution. Streaming video via Apple TV looks awesome too except when my internet service can't keep up the putthrough and the signal degrades occasionally (not the set's fault). Blu-ray, WHOA, blu-ray looks spectacular. Period. Football and other sports look perfect on the ZT as well. Details abound but never in an exaggerated, over sharpened way and motion is liquid smooth.Speaking of motion, motion with 24p sources is much improved over the VT30 with smoother panning especially with the motion smoother feature set to the \"weak\" or \"low\" setting. I don't see any negative side effects while using it in the weak setting. I haven't tried mid or strong and likely won't. 24p sources simply look great although not absolutely perfect in smoothness (part of the whole 24p debate). Still, much better than the VT30 so I'm more than happy with the ZT's performance in that area.3D also looks much better on the ZT60 than on the VT30. Watching TRON Legacy 3D and Avatar 3D I don't remember seeing any ghosting on the ZT60 while on the VT30 I can remember seeing it during both movies to a small but noticeable degree. On both sets I use the 96Hz setting for 24p sources(60Hz on the VT in 3D mode because it doesn't have a 96Hz option for 3D) but I only used the motion smoother on the ZT with it set to 'low' or 'weak' because with it on I don't notice any \"soap opera effect\" but do get the benefit of smoother panning. I have no complaints at all with the ZT. It's everything I was hoping it would be in regard to performance and I can't think of any negatives to state here. I'm very satisfied with it all around so far. I don't use any of the smart features so I can't comment on those.FAN NOISE FIX - Also, for those that may need it. Panasonic has issued a free in home fix for the fan noise issue some owners have had or are having with their ZT60s. Contact Panasonic support online or by phone to schedule an appointment to have it completed if you experience the noise. The fix was applied to my set at the dealer before I picked it up and I haven't heard any unusual noises from my ZT. No fan noise and no excessive buzzing. Beautiful. I love this thing.", "Date": "September 5, 2013"}, {"Title": "CNET was RIGHT!", "Author": "Amazon Customer", "ReviewID": "RTD3AEPIU92X1", "Overall": "5.0", "Content": "The royal we (meaning my husband) did a mountain of research for our next TV purchase and this is the TV we settled on and in the 60 inch.  We have not been disappointed at all and the clarity in viewing this TV is beyond belief.  It is so clear that it almost looks 3D without the glasses since there is so much depth to the picture.  The 3D is pretty cool as well and as is true with all 3D movies it is always better in animation than a regular movie.  Despicable Me 2 was awesome!  Also, one of the things that we found is that with the \"Costco Affect\" having the TV's turned up so bright in warehouse situations, at home you do not need this and we have our TV in a very bright room with floor to ceiling windows (not in a media room) and we have it on Home Theater setting which is plenty bright enough even during the day.  It is an expensive TV and compared to the new 4K TV's out I would still pick this TV over them.  A other thing that is very true with plasma the colors are very vibrant and correct.  Our last TV was the Sony XBR and I loved it, but this is hands down a better TV than the competition.  Here is the link to the CNET review [...]  Get this tv while you can, you will not be disappointed in the least.  The other thing to note is we are not gamers but avid movie watchers so I can't comment on the gaming aspect of the TV.  This is also a smart TV and does come with many apps if you are interested in this, but we do not really care about the apps.  The other great thing about this TV is that it is Bluetooth and not RF making it much easier to pair to the TV devices that we like to use with it.", "Date": "December 29, 2013"}, {"Title": "A great upgrade from my original Panasonic plasma!", "Author": "J. McWhirter", "ReviewID": "R1S9QBVO8R4WX4", "Overall": "5.0", "Content": "UPDATE 12/27/13After tying several video settings from various sources (CNet, D-Nice, soundandvision, etc), I found I liked the 2D video setting from the soundandvision web site...[...]I find these settings to produce the most accurate skin tones using the two sources I use, which is Apple TV and Cable...As stated in my review, this plasma produces the best picture I have ever seen, and I would highly recommend it to anyone!_________________________________________________________________IMHO, the Panasonic ZT60 is the best TV on the market...I was planning to hold out for 4K / OLED technology...but once I heard Panasonic was getting out of the plasma business, I decided to upgrade my original Panasonic - and I'm glad I did!After I made the decision to upgrade, I spent several weeks going to various video stores and reading various articles, and was pretty excited to see Panasonic still made one of the best plasmas on the market.I settled on the ZT60 model for several reasons -1-Panel : Panasonic is the only manufacturer to make panels of this type.2-Blacks : After looking at various models - including the VT - the ZT looked like it had better black reproduction. I can't say if it was sources, or if it was how the video stores had them displayed, but the ZT looked better to me...3-Previous Panasonic ownership : I have had no problems with my original Panasonic whatsoever...I purchased it in 2005, and it has performed flawlessly.4-Features : There were a few features that I like about the ZT60 that others did not offer...such as being able to have independent video adjustments for each source (gaming video adjustment for one, movie video adjustment for two, etc)...and being able to copy video adjustments from one input to another is quite the time saver...5-Ethernet / WiFi capability : I like the idea of being able to update the TV software / use the TV itself for various sources...such as sharing pics, etc etc. Though we have been doing that for several years using Apple TV and Airplay, it's nice having an alternate source...How I am using the ZT60 -I currently have an Apple TV, cable box, and Xbox One plugged into the ZT60.Video adjustment for the Xbox One set at Picture THX Cinema, Advanced Picture>Game Mode>On.Video adjustment for the Apple TV and Cable as follows (from CNet) ---------------------------------------------Picture menuPicture mode: CinemaContrast: 70Brightness: 0Color: 50Tint: 0Sharpness: 0Color temp: Warm 2Vivid Color: OffColor remaster: OffPhoto enhancement: OffC.A.T.S.: OffVideo NR: OffMPEG remaster: OffResolution remaster: OffCaption smoother: OffBrilliance enhancer: OffMotion Smoother: Weak-- Pro settings submenuPanel brightness: MidAGC: 0Black extension: 0Color Gamut: Rec. 709W/B detail adjustment menu:W/B high R: -4W/B high G: 0W/B high B: -2W/B low R: 3W/B low G: 0W/B low B: 0More detail adjustment menu:[listed as Red, Green and Blue gain, respectively]100 IRE: 0, 0, 090 IRE: -2, 0, 080 IRE: -2, 0, 070 IRE: -2, -1, 060 IRE: 0, 0, 050 IRE: 2, 0, 040 IRE: 0, 0, -230 IRE: 0, 0, -120 IRE: 0, 0, 010 IRE: 0, 0, 0Color detail adjustment menu:Red hue: 0Red Saturation: -4Red luminance: -5Green hue: 14Green Saturation: 10Green luminance: 1Blue hue: 0Blue Saturation: 0Blue luminance: -7More detail adjustment menu:Cyan hue: 5Cyan Saturation: 0Cyan luminance: 2Magenta hue: 12Magenta Saturation: 8Magenta luminance: -10Yellow hue: 5Yellow saturation: 0Yellow luminance: 3Gamma detail adjustment menu:Gamma: 2.2More detail adjustment menu:100 IRE: 090 IRE: -280 IRE: -270 IRE: 060 IRE: 050 IRE: 040 IRE: 030 IRE: -820 IRE: -810 IRE: 0--Advanced picture submenuGame mode: Off24p Direct in: 96Hz [grayed out at 60Hz for non-1080p/24 sources]3:2 pulldown: Auto [often grayed out depending on source]1080p pure direct: Off [often grayed out depending on source]HDMI content type: [all Off]HDMI/DVI RGB range: [all Standard (16-235)]Black level: Light-- Screen settings menuScreen format: FullOverscan: OffH Size: Size 1[no other changes]-----------------------------------------The depth and detail on movies is amazing - I'm watching 1080p movies that I've watched over the years, and finding details I didn't even see before (admitting my plasma was on the old side)...but, the difference between the two has been mind blowing...There are some 'extras' on this TV that others might like or use - such as being able to setup 'home pages' for various household members, surfing the web, TV apps (such as YouTube, Netflix), etc. - but I find I have these sources on so many other devices (Apple TV, X1, iPad, iPhone), I'm not really using any of them...I do find it's pretty cool to see the local weather, time, and date, when I first turn the TV on...In closing, I find the ZT60 to be a great upgrade from my original plasma, and would recommend this product to anyone thinking about getting a new TV - and if you're thinking about getting a Panasonic, better get it now!", "Date": "December 15, 2013"}, {"Title": "I replaced a last generation Pioneer Kuro 60\" with this set and so glad I did!", "Author": "C. Wang \"C\"", "ReviewID": "R30PCC82BBJJ8G", "Overall": "5.0", "Content": "I am one of those who owned a last generation (9G) Pioneed Kuro 60\" set.  I did not believe that any current TV technologies, except OLED, which is still prohibitively expensive, and some local dimming LED sets, could beat the Kuros...  UNTIL now.  I won't go into all the technical details, but all the technical reviews from multiple sources, and user reviews from here, are accurate.  This set is markedly superior to the Kuro sets.  I do not think any sets will even come close as far as quality until OLED of similar sizes are as affordable.The noise issue?  I have not experienced ANY (and this is in a quiet room with the home theater on mute.)HIGHLY, HIGHLY, HIGHLY recommended.  If you care about picture quality and manufacturing perfection: get this set.  You will not regret it.  It is the Kuro of 2013...", "Date": "November 24, 2013"}, {"Title": "Top Notch Delivery & An Excellent 1st Movie", "Author": "RMAGPILE", "ReviewID": "RRJTQ4L2N9MIL", "Overall": "5.0", "Content": "I researched this TV extensively before purchase and the one I got does not disappoint.  It is as good as the sets I've seen on different stores I visited since this TV went on sale many months ago. I'm pleased on how nice and large it is in my room.  Very nice! Very very nice!Interest started since the review came up on CNET.  Some reviews I came across even claimed \"Kuro Killer\".  I've never owned a Kuro, though I was aware of its reputation and somewhat envied those who had one.  Even with more research (including repeated readings of reviews in Amazon), I decided to hold off in getting this highly rated Panasonic TV.  The price was higher than what I was willing to pay.  In addition, numerous nightmarish delivery issues were reported by others who ordered from retail sites that sold the set at a fantastic discount.  Finally, Amazon had a holiday sale (approx 2K below MSRP after taxes & free delivery).  This and together with a long history of hassle free purchases from Amazon (perhaps I've been lucky), I clicked the button on Christmas day 2013.  Delivery was scheduled on Dec 31 between 9:00 am to 12:00 noon PST.Amazon sent a delivery notification e-mail the following day.  Half an hour later, Pilot Freight Services sent an e-mail with a link to track the shipment from their site.In the morning of Dec 31st, I woke up early and called the number on Pilot Freight Services site to confirm.  A lady picked up the phone and confirmed the delivery window (delivery is on schedule).  At approximately 10:30 am, the truck arrived.  Two guys picked up the huge box and carefully set it down in the 2nd floor living room without complaint after climbing 15 steps and 4 sharp turns.  I showed them the outlet and the top portion of the box was expertly removed.  The plastic wrap that covered the huge screen was gently set aside and the power plug was installed in the rear.  I connected the other end to the outlet and one of the delivery guys already had the remote control out and batteries installed when I turned.  He clicked the power button and the TV came on.  I examined the TV with emphasis on the glass as the setup appeared.  No issues.  Big sigh of relief.  One of the guys smiled and handed me the delivery form.  I signed with a bigger smile on my face.  The truck left 15 minutes after it arrived.  In my book, a flawless delivery.My brother in law and I moved the TV to my room in the 3rd floor that night, replacing my old Pioneer 40\" Elite.  Even with the two of us, it was freaking heavy.  I also had to attach the stand (8 screws).  The cables were attached after setting it up on the old glass stand.  Thereafter, I opened  one of the new Blu-Ray movies I had on hand - Apocalypse Now Steelbook and fed it to my OPPO player.  Lots of shadows.  Lots of blacks.  I saw them all with mouth slightly open.  I saw many layers of black.  I expected that.  The experience, however, did not match expectations.  From a 40\" to a 65\", combined with clearer sharp pictures, the scenes blew me away.  Marlon Brando  utters the words \"The Horror\".  An explosion follows from outside.  A firecracker signals the new year.  It's 2014.  Excellent!Waiting a bit for burn-in and will apply adjustments in the future.  Excellence continues to be achieved with every movie watched, but perfection will take time.  I am happy.  That is the point of it all.", "Date": "January 4, 2014"}, {"Title": "The best TV I have ever seen.", "Author": "Ryan", "ReviewID": "R201TSI39ZRAMT", "Overall": "5.0", "Content": "So I recently upgraded from an old Pioneer PDP4280, a 720p plasma they offered as their Elite's gained traction.  I held onto it for so long because, even at the the lower resolution as plasma, and Pioneer, owned the market share in terms of picture quality.  So, why now?See back when I read about Pioneer pulling out of the home video market, my heart broke a little.  Here was the one company dedicated to giving consumers the BEST not the shareholders.  Up to the release of the ZT60 I had deeply regretted taking a pass on a last run NIB Pioneer Elite 50\".  Timing just wasn't right.  So I waited, my sole trigger being the TV that trumps it. Nearly six years later, the ZT60 entered my life.First, I'll rate the buying experience.  I waited for a Black Friday deal on Amazon.  I knew it was coming. So when I saw the price drop well below what I would have paid earlier that week I was really excited. So when the price dropped twice more the day of, I was overjoyed. When it came time to checkout though my internet crapped out and I lost a time-sensitive deal. No biggie, as I explain below in rating the value.  Delivery was prompt and easier to deal with than any other electronics company I have dealt with past-present. Final price was about $2900.00Next, performance.  There are tons of video tuning guides out there for this TV. We chose to slightly alter the one available from CNET for use in our house.  To say it is amazing is selling this thing short. In daylight viewing, there are better performers, I won't argue that.  But one does not simply buy a ZT60 to just watch anything.  This thing literally takes picture quality, and Hoyce Gracie's it into submission in all other viewing conditions.  In the dark, blacks melt into the background.  Inky is an understatement.  It's unfair to others how we'll this thing handles all aspects of picture quality.  Even from lesser sources, images appear livelier.  I know there are a thousand gimmicks out there to entice you, all of which seem rooted in the LCD market.  It's a shame that more American consumers are going to lose out on this level of quality chasing gimmicks meant to mitigate LCD's inherent flaws, e.g. Refresh rates, local-dimming, and 4K.  Anyway, if you are set to buy a TV to be the best at what a TV is meant to do, i.e. reproduce images, then this is the absolute best at it.Lastly, value.  As I said before, the deal I received was still well below what I would have paid for THIS TV.  I had anticipated spending about $3700.  Even then a deal, considering it is the top of every list in terms of picture quality, again what TVs are SUPPOSED to be good at, and many of those residing on that list cost far greater.  Considering it took YEARS for someone to unseat the renowned Pioneer ELITE, and that set in all it's infamy still fetches on average $7500+ used, I'd say this is a steal at less than half.  Couple with that the top next-gen sets, OLEDs and UHD LCDs, still aren't performing as well and cost up to 3x as much.In closing, this is a undoubted BUY.  If I could squeeze it out of the wife I would have a second or third.  This TV should EASILY hold me over until OLED picks up, the only thing with a chance at unseating plasma as a whole for picture performance.  On a final note, I will say the 65\" is heavy and is limited in what mounts are compatible.  I had to do some digging but the Chief XTMU mount met our needs and is rock solid.", "Date": "January 27, 2014"}, {"Title": "Great Picture. Great overall user experience. Subtle fan noise.", "Author": "Rustin Jessen", "ReviewID": "RKJA54Y5B7GW0", "Overall": "4.0", "Content": "Wonderful picture. With just a bit of tweaking the color is perfect, blacks are deep and wonderful, it's very very nice to watch.The menus are snappy and quick to respond. Love the Netflix button on the remote, and really the whole Netflix experience.  It's my favorite way to watch Netflix now. Quick & responsive... and looks just wonderful. Better than the app for Xbox, Wii, TiVo, iOS (with the exception of not being able to list by genre). It's really the only app I use. I tried the others, but just don't need them.There is something to the fan noise complaint. It's quiet but present. In a small room it's fairly noticeable when you first power up. After watching a bit, you don't notice it. That said, it's quieter than my TiVo Premier and way quieter than the Xbox360. Overall, it doesn't bother me.If I had it to do again... I'd buy this TV again. I really love it.", "Date": "December 2, 2013"}, {"Title": "No Reservations - An Incredible Monitor", "Author": "FW", "ReviewID": "R24CDPU5U3YQE6", "Overall": "5.0", "Content": "To date, everything about this set has been great. Delivery, ease of set up & most importantly the deep, beautiful accurate image.Blu Ray, Amazon Prime & Netflix (roku), & DirecTV have been stunning. I run all sources through an AV preamp so set up literally involves 1 HDMI connection. Easy set up with a Harmony / Logitech remote made it easy to integrate the set into a family friendly home theater system.3D is not important to me, but I did try it & the image is better than competitive LED & plasma sets. No point of view on sound or web apps, as I don't have a particular need for either.Also there is a panasonic android & ios app for sharing pics & other files via wifi from your mobile device. (Samsung sets may be comparable, but won't play nice with ios so why limit your options on a long term purchase)There is a pre-set option for THX Cinema mode, which is near perfect for video sources & broadcast in both dark & moderately bright rooms. I used those initially, but have recently switched to the CNET test settings. Great input, other setting options, calibration advice, as well as the usual paranoid observations are readily available in some of the online forums.Have had the set for a month and am still floored by the picture.", "Date": "September 2, 2013"}, {"Title": "Best TV I have every owned or seen", "Author": "moman", "ReviewID": "R1I4ZSQR0OOZG1", "Overall": "5.0", "Content": "I like panasonic plasmas ever since my very first 42\" 500U which I still use in my bedroom.  They are high quality, last a long time and look good.  I bought a 55\" VT30 when it came out, it was ok.. maybe a little bit dim, and was too small for my room.  So then I bought a 60\" GT50.  This was an excellent TV and an improvement.  Excellent picture, quality.  When I saw that the ZT was the last from Panasonic, read the reviews and that it beat the Kuro, I had to have it.  I wish I had bought it was 2799.99 on Amazon, but again I had to have it.  I had my doubts, could this TV really do that good.  I just got it delivered yesterday.  The quality of the item is amazing.  Really well made, nice looking, elegant.  Then I started watching movies with THX cinema mode.  Colors fantastic, sharpness/resolution sig better than my other tvs.  Dark scenes are black, makes the picture pop.  I tried 3d, I didn't really like it, but who cares.. it just causes headaches anyway.  What I'm saying is this TV will last for years, and will keep me happy until OLED comes out.  I HATE LCDs/LEDs.  The viewing angle sucks, they feel cheap and I don't like blooming.  Im very happy.", "Date": "February 13, 2014"}, {"Title": "Fantastic TV (If it works)", "Author": "Amazon Customer \"henryy23\"", "ReviewID": "RZ6RVK4O5N2NM", "Overall": "5.0", "Content": "The first ZT delivered to us was defective. High pitch noise when first plugged in. After a somewhat frustrating exchange delay mainly due to the holiday weather and delivery delay, the 2nd TV was flawless. No noise whatsoever, contrary to my worst fear. The picture quality is excellent. Black is superb. I leave it on the THX default for now until I get a few hundred hours on it to stabilize.", "Date": "January 3, 2014"}, {"Title": "Simply the Best TV out there by far !  This is finally the TV that beat the industry standard the Pioneer KURO", "Author": "Mark A Simoncelli", "ReviewID": "RGWBQD15IDTYU", "Overall": "5.0", "Content": "Ok guys and gals if you want the very best TV and willing to pay for it this is the best Plasma out on the market !I have had a Pioneer KURO for many years, Pioneer was the industry standard for best Blacks and great contrast and this TV finally beats it !Ok this is the very important part !If you do purchase this Plasma TV you MUST do what is  called a (Break in procedure) to make sure the picture is uniform with no Burn-in! (  I will point you to the direction on how and why to do this at the end )Please I urge you to do this,  because I have a friend who purchased this and didn't tell me, He did NOT do the 100 hour -150Hr break in and destroyed the TV!!He purchased the TV plugged it in and left it on the sports network where there are bright graphics in the Same Location all the time every day for like a week  !!!  He finally turned the tv on a week or so later  this time deciding to watch different channels and he said to me I think I'm getting ghosting from the sports channel  ???  I went over and almost PASSED OUT  the screen was so badly burnt in with the White boxes and Logos that he ended up Trashing the TV,  We were able to get some of it out but it was shot !!!  So please if you are going to spend that kind of money be patient and do it correctly !What the Break in procedure consists of is running a set of slides from a thumb drive for at the Minimal 100Hours Day and Night non stop is best, but you can turn it off at night and just restart it during the day, but do at least 100hrs  150 if Possible !Go here and read the procedure and you can also download the slides there also....[...]Use the top post and make sure you set the (Picture Mode: Custom ) from the Slideshow menu ...I know is sounds like a LONG wasteful Process but here is what it does ..Buy running the Colored slides for that long period of time it sets the phosphorus warm the colors, and helps prevent any image retention, it says a minimal of 100 hours but if you can do 150 hr I would totally recommend that !After the 100 hour process read the 2nd post and apply the Reference Settings as he describes and you will see a simply beautiful picture !Now one last thing ...This is one of those TVs that you want to have professionally calibrated to see its full potential !Only have it calibrated after 300 Hours of use,  because it takes that long for all the color temperatures to settle become warmer and become stable..Here is a tip ..You can count 4 days of constant running to reach the 100hrs or you can check how long the set has been running by going to the Menu - Help( at the bottom ) - Version and look at the line Status4  you will see something that looks like C0297-00000  see that 297 in the first part that means my set has been running for 297 hours that wont show minutes just hours !You don't want to spend $200 dollars on a Calabration and a month later be annoyed because the picture changed !!So wait to at least 300 Hrs  then have it done!  This ZT60 is what's considered a Studio Panel, meaning its color reproduction is extremely close to what Hollywood calls their Movie Standards or Hollywood standard..I know a lot of you are looking at the Picture of the new 4K Tvs and are very impressed what you see in say BestBuy but don't be fooled, what they are showing you is Yes, a Full 4k Signal and the resolution is Crazy Beautiful BUT !There is very limited content to take advantage of this new 4K signal Also its only 30 MHz th not  60 MHz that  are coming,  but they will charge you a premium to upgrade the TV Hardware to support it when its released.. for instance the Sony set I looked at they quoted me a price of roughly 500 - $800 to update the hardware when it comes out, that's even after spending the $4.000 dollars on the TV initially !The Price on this TV varies Widely so Shop around !  I paid$2,700 for mine, Brand New so watch for sales because this is a 2013 Set so If your a smart shopper deals are out there !Here is a great article explaining how amazing this TV is:[...]The Forums are very helpful and full of information so do read around the web.So if you are looking for a TV with simply the most amazing picture this is for you, I promise you wont be disappointed !Good luck with your TV..Steve", "Date": "January 24, 2014"}, {"Title": "True Reference picture, can be noisy", "Author": "A R", "ReviewID": "R395W38TXX40AF", "Overall": "4.0", "Content": "Cannot add any more to what others have already said.  This panel is the current king of the hill, and even knocked off the mythical Kuro.  I was stunned by the picture.  Only draw back is the \"noise\", it took me a couple of days to even know that I had it, I kept thinking it was a bathroom fan or some other appliance running upstairs.  I only hear it during quiet parts in movies, and is annoying enough to detract from the move.  Your set my or may not have it and if it does, you may or may not notice it.  I am in process of getting the \"foam fix\" from Panny, I really hope it works.EDIT:  If you havent seen in other reviews, Panasonic is out of the Plasma biz.  Get one if you can, the fan noise is not reason enough to not buy, if you are in the market, and can still find one hurry up and do it!EDIT 2:  Finally got a tech out to address the fan issue.  It appears my TV was shipped with the \"fix\" already in place, so I am stuck with a slightly noisy TV.  Again, this is not enough to not get this panel.", "Date": "November 3, 2013"}, {"Title": "Excellent product", "Author": "TNV", "ReviewID": "R1A1ZBH5HW5HUS", "Overall": "5.0", "Content": "If you've read reviews regarding the ZT60, you already know the black levels are great, the picture is no better in a dark room than the VT60, it is better than the VT60 in a bright room, and the Samsung F8500 is brighter than the VT and ZT (blacks not as good as Panasonic though), the speakers are not the greatest and it's expensive.  So, maybe it's time for a subjective review.We moved up from a 50 inch Panasonic that is about 6 years old.  Subjectively, for what it's worth, this is a gorgeous television.  Couple it with a nice home theater receiver like the Denon X4000, a nice center channel (after all, most of your sound comes from the center channel, and good quality front and surround speakers, and you have a system that will put you in home theater heaven for the next 10 years.Yes, you can nitpick the products in comparison to death.  But, Panasonic has always made a great plasma television.  For my money, again subjectively, I would never purchase an LED tv.  Black levels are just so important and I've yet to see an LED with great black levels.  Of course, I haven't seen them all.All I really know is what my eyes tell me.  Since getting the ZT60 they've been telling me \"nice decision\".I did not buy this from Amazon.  I bought it from Magnolia (Best Buy).  I really appreciate the Magnolia stores because they cater to customers interested in higher quality audio and visual gear.  Prices are fair, the salesman (Richfield, MN) was knowledgeable, the installers were pleasant and competent.  Not necessarily what you've come to expect in the past from Best Buy.  Magnolia of course is a separate store within selected Best Buy stores.This stuff is not cheap folks!  Because of the expense, we as consumers would like to \"future proof\" our AV investment as best we can.  If you have the money, shop wisely, don't cut corners, and build a great home theater system.  Otherwise, you buy lower end brands in the name of saving money, with disappointing results, and just have to replace the stuff in a relatively short period of time.Lastly, it is absolutely impossible to judge the quality of a television picture in any showroom.  You just need to trust fellow reviewers, buy the best equipment you can afford, and enjoy!", "Date": "August 19, 2013"}, {"Title": "Fantastic picture quality", "Author": "Robert W Finley", "ReviewID": "R2ASWFI1A6QX8S", "Overall": "5.0", "Content": "This TV is no longer being made by Panasonic. They have stopped manufacturing plasma televisions. That said, if your room is not super bright or is dimmable, and if you have an external sound system (because the internal speakers are mediocre), and if you can still find one, you should buy it immediately, because the picture quality is the best available unless you spend $9,000 on an OLED. Just one TV nut's opinion!", "Date": "January 30, 2014"}, {"Title": "A thoroughbred in every sense", "Author": "Big River Explorer", "ReviewID": "R3EDOX80TJFICP", "Overall": "5.0", "Content": "I'm coming from a TH-58PZ800U purchased in 2008.  I loved the pz800u and had there not been a faded blacks issue would not be in the market for a new display at this time.  As the finality of the Panasonic plasma lineage became a reality I knew I would be kicking myself if I missed this last model (a la' Kuro).  I was happy to purchase for under $3,000.  Having spent so much time tweaking my old set I knew there would be a temptation for buyer's remorse when first turning on the zt60.  Indeed the out of the box \"standard\" setting is appalling!  Having done my research and being a long time plasma owner I just squinted my eyes, plugged in an SD card of \"break-in\" slides.  I began \"real\" viewing after 150 hours and I am blown away.  I find myself just staring distractedly at detail (a tie's pattern and texture, the perfect representation of flowing water, trying to find where the black bezel begins and the picture ends).  Just a delight.  The AFC and NFC championships were a beautiful pop of color and motion.  I'm a bit of an obsessive should I perceive a deficit and I'm happy to report zero buyer's remorse.  I have an October build and have not experienced excessive fan noise (my TV ran nearly 200 hours before the first power down) nor pixel issues.  It is important to note that this display presents itself as a \"panel\" and the installed speakers are nigh on useless.  Not a knock on the set, just a reality of it being a display monitor and at the very least anticipate the need for a sound bar.", "Date": "January 27, 2014"}, {"Title": "In love with zt60", "Author": "Sweet Swe \"Swe\"", "ReviewID": "R2EI6J4GS58PH1", "Overall": "5.0", "Content": "panasonic : why are you guys stopping production of plasmas? Please don't :( I hate hate hate led tv picture quality. This is the best TV out there. Picture quality wise none can beat it. The picture is just spectacular. Fan noise is okay, you really don't hear it when this beauty is running a video. The other day we were watching the movie \"The impossible\" in thx cinema mode, the colors were so beautiful, deep & rich. The black is the blackest black. Zt60 is the super star of all TVs, in my opinion. Well done panasonic team.:)", "Date": "January 24, 2014"}, {"Title": "Perfect TV", "Author": "Trenton Chorba", "ReviewID": "R1ICDX62V8SHUB", "Overall": "5.0", "Content": "This TV is noticeably better than my old Panasonic TH-50PZ800U plasma. Most noticeable thing is the blacks and the smoothness of motion. Also having the option to watch 24p at 96hz with bluray is a great improvement over my old 50PZ800U's 48hz (slight flicker). Also the TV looks very slick on my wall, the airless gap panel really makes the TV look nice, even when off. Sure, 4K is nice, however the advantage is only noticeable closer viewing distances. I'd rather have the truer colors and blacker blacks of the plasma any day (all 4k's are LCD panels), since I don't watch my tv from 6 ft away. The fan noise doesn't really apply to the newer production units, and if for some reason you get one without the fan fix installed supposedly Panasonic will install it for you if its under warranty. Its sad that this is the last plasma Panasonic will ever make, but they definitely went out with a bang with this model. No regrets about this purchase. Let everyone else have those faded out LCD/LED's! :P", "Date": "January 13, 2014"}, {"Title": "Incredible!", "Author": "Jorn", "ReviewID": "R27SYMCXG5F5UT", "Overall": "5.0", "Content": "I cannot add anything to the reviews that other people made, this TV has incredible picture. I don't care about the apps or sound quality because I don't use them so I have no comments. I compared this to a Samsung PN60F8500 directly in my house before either one was calibrated and I had a hard time telling which had a better picture. The Samsung was obviously brighter, but for my room (with large windows) both TV's were fine even during the day. The colors on both were amazing. 2 things sold me on the zt60, one was when I watched the IMAX hubble blu ray movie in 2d, the Panasonic was noticeably better with the blacks which made the picture \"pop\" more, the second was the fact that I couldn't put the samsung on my tv stand because its stand was too wide (really annoying). I have 1 recommendation for the zt60 before you really judge it, please get it calibrated professionally. The original picture was great, but a calibration made the tv so much better. When I first got the zt60 I felt like the whites were a bit off (along with the rest of the colors), but after calibration everything looks the way it is supposed to look.", "Date": "January 12, 2014"}, {"Title": "Buy this TV before they are gone for good, rivals the Kuro TV king", "Author": "Whisperkill", "ReviewID": "R3FGV5DNTZ92AY", "Overall": "5.0", "Content": "Its unfortunate that Panasonic is not going to make Plasma TVs anymore, eventually OLED will be the king, but do yourself a favor and buy this one, awesome black level and color.  If you like sports 600hz refresh rate will trump LCDs refresh rates and all the tricks they have to do in an LCD to get those rates (inserting frames etc.).  Plasmas always look dim in the big box stores due to LCDs being brighter, but you don't like in a store and these TVs are way bright enough (I run mine at about 50% and the color is perfect and black levels are great.)Read the review at Sound and Visions website and get a professional to calibrate your TV for the best picture.", "Date": "December 31, 2013"}, {"Title": "An amazing viewing experience", "Author": "Mohammad S. Rahman \"Carpie Diem!\"", "ReviewID": "R383XAUOQS41D", "Overall": "5.0", "Content": "We got this TV toward the end of June and have had a few months to watch various content on it including TV shows, Netflix, movies (BD, DVD, and 3D), and PS3 games.  The viewing experience on this TV is absolutely phenomenal.  The fans on the TV are audible, but they are no louder than our Onkyo receiver or the PS3.  So, unless one is watching a silent movie with no other components running, the noise does not detract from the experience.The colors are fantastic and the blacks on this TV are unbelievable. The 3D experience using the included glasses was pretty nifty as well (PS3 games and BD 3D movies).I will admit that there is a bit of image retention on the TV from static elements from Netflix etc., however, they are not very obvious.  We run the screen swipe every now and then and that seems to have helped.If I had to go back and choose again, the only choice I may have made differently would have been to spring for the 65\"-er.This TV is a phenomenal addition to our home theater.", "Date": "October 20, 2013"}, {"Title": "One very impressive TV", "Author": "Dub", "ReviewID": "R1SK0KI42UGZII", "Overall": "5.0", "Content": "After owning a professionally calibrated 60\" Pioneer Kuro Elite for the last 5 years, I was a little skeptical about the ZT60.  I wanted a slightly larger screen than the Kuro offered and I also wanted 3D capabilities.  However, I was not willing to sacrafice picture quality to have those 2 things.  After reading countless reviews on the ZT60 and how it had finally surpassed the Kuro on PQ, I had my justification to hit the 'Buy it now\" button on Amazon.The TV arrived after having the typical hassles with Amazon's large item home delivery carrier.  They were supposed to be here between 3 and 7PM.  No showed with no phone call.  I called them.  They said they would look into it.  Door bell rings at 9PM.  One small driver is standing there.  He says his truck broke down.  He was polite and apologized.  He said he is by himself and I will have to help him unload the TV and carry it upstairs into my HT room.  This is not dissimilar service from the last TV I bought from Amazon.  So if you buy from Amazon, expect the delivery service to be a real hassle.  Good selection, good products, good prices, but not very good delivery service.  Oh well.  The delivery guy helped me put the base on the TV and insure it was not damaged and in working order.Now for the TV itself.  Simply awesome!  I loaded the same calibration settings used by Cnet's David Katzmaier in his review of this TV.  The Panasonic really does outperform my old Kuro Elite  by a significant margin.  The colors are so deep and real looking it is like looking through a window at live things.  The black levels are deep and shadow details are amazing.  Flesh tones seem perfect.  I have nothing to fault this TV on at all.  Some reviewers complain about the fan noise.  I have only noticed it when the TV is silent.  If there is any volume at all, it covers up the very slight cooling fan noise.  I did discover a tiny dimple in the aluminum base and I have asked Panasonic for a new one.  I am waiting to see if they will take care of it and I am so far optimistic they will do so.All in all, the best TV I have ever owned.  If you want the best PQ currently available, get this TV.", "Date": "September 21, 2013"}, {"Title": "This is one great TV", "Author": "Daniel Farrell", "ReviewID": "R2JLFER9CV2OW3", "Overall": "5.0", "Content": "All the great reviews this set received are right on, in my opinion.  The blacks are inky black and the colors are simply luscious.  I've paired it up with an Oppo Blu-ray player and a high end home theater sound system & I am one happy camper.  Too bad Panasonic got out of the plasma business - but if you're going to exit, I suppose it is best to go out on top, with a unit that sets the bar for others to aspire to!", "Date": "March 1, 2014"}, {"Title": "Love It!", "Author": "Herman", "ReviewID": "R1DF64EHVZ8GFL", "Overall": "5.0", "Content": "This is a great plasma tv. I have a 60\" pioneer kuro as well and this is the first tv i've seen that compares with it picture wise. I have them in 2 separate rooms so I can't play them side by side but I would say that the picture is equal once they are both adjusted. There may be a bit more detail in shadows with the panasonic but it's really hard to tell. This is a great choice for anyone looking for the best picture available but when they're gone panasonic won't be making any more.", "Date": "February 24, 2014"}, {"Title": "Last of the High Quality Plasmas", "Author": "Cyclemaniac \"Dan\"", "ReviewID": "RGJ5PTGQOV74B", "Overall": "5.0", "Content": "I have a 8-year old 50\" Pioneer plasma (5060HD), which has an exceptional picture despite its 720p resolution.  When I read that Panasonic was getting ouf of the plasma business, I decided to purchase the 60\" ZT60 after reading all of the rave reviews in well respected magazines and websites.  I was not confident that my Pioneer had many more years of life, having already having had to replace two different boards during the past few years at considerable cost.  The final factor was the highly discounted Amazon price of $2499.My impression is that the Panasonic is comparable to the Pioneer in picture quality but is obviously superior in size. Although the \"pro-settings\" were not easily found on the menu, once I found them, I was able to tweak the settings to my satisfaction.  Aesthetically, the Pioneer was a more elegant set, with all piano-black finish.  Unlike the Panasonic, the Pioneer has no chrome to be seen.  The Panasonic silver stand was initially distracting, but it's no longer something I notice.  I hear no fan noise, like others have commented but agree that front-facing speakers would have been preferable to the rear -facing speakers.All in all, I am pleased with the purchase and am sorry to see Panasonic abandon plasma, which is far superior to LED technology.", "Date": "February 23, 2014"}, {"Title": "60 Inches of Optical Ecstasy - Simply The Best", "Author": "Robo21", "ReviewID": "RQSFGEUW7XTDF", "Overall": "5.0", "Content": "I had been reading reviews, looking at various models and types of televisions, studying specs, etc., for a year and zeroed in on the VT60 as the perfect TV for me.  I decided that price was irrelevant but I did want maximum value.  So at the beginning of December I bought a VT60.I was very impressed with the set and thought that I had invested in the best TV for me, but yet, in the back of my mind there was the ZT60 and it was haunting me.  I happened to come to Amazon's Website on Christmas Day and Amazon had marked down the ZT60 to $2,099 from $2,499.  Bang, I pulled the trigger on the spot and never looked back.The ZT60 is a subtle improvement over the VT, it is not by any stretch a night and day improvement.  However, there is a lot of satisfaction knowing that it is the state of the art in plasma technology and undoubtedly the best picture quality I have seen to date.  It will compete favorably with OLED for a fraction of the cost.  And then there is the hardcover book that outlines the ZT technology and the \"hand built,\" one-at-a-time care that goes into this TV's construction.I was a little concerned by other reviews that warned of \"fan noise,\" and I can say without hesitation that it is not at all an issue for me.  It is barely audible and then only with the sound muted.Since then the price has jumped $1,200 over what I paid back on Christmas Day.  Would I buy one at the current price?  You bet!  The ZT60 is still a bargain and this is proven simply by comparing this TV to the underwhelming offerings at the CES.If you can still find one, buy one, you will love it.Post Game Edit: The viewing of Superbowl XLVIII on this TV was absolutely stunning, too bad the game wasn't better.  This is the most immersive TV viewing I have ever experienced.", "Date": "February 1, 2014"}, {"Title": "A HDTV that is no longer available. If you can get one, you better", "Author": "Sage", "ReviewID": "R20VUO3PE9AI6Y", "Overall": "5.0", "Content": "I have owned many HDTV's and this is the finest picture I have seen so far. Plasma is pretty much leaving us but it has been and still is the finest HDTV picture that you can get. I have had Sony's, Samsung, Fujitsu, and more. I never bought cheapies like Vizio, Sharp, or bottom of the line models. I just replaced a SonyXBR that I had for 7 years and it still looked very good and sounded great. I did want bigger screen so I got this one. I care very little about the 3D crap but when properly set up and calibrated if you need to, a finer picture cannot be found. The strive for manufacturers to get everyone to move the \"4K\" LED's is just another push to sell more items. 4K makes little difference to the naked eye unless you have enough room for a 60\" or larger screen and you are sitting very close. It will just be a stepping stone until the OLED format has been perfected and come down to reasonable pricing.This TV runs warmer than LED's and weighs a bit more. But if that isn't an issue, get this one. You will be very pleased for ten years or so until the OLED come out. Another thing, the \"smart\" TV issue matters little to me also. This has it, but I don't use it. The remote has a Netflix button right on it and you can get AMZN prime if you wish. I would recommend getting a ROKU 3 and/or an OPPO BDP-103d to match with anything you get. If you want plasma, you are left with the Samsung 8500 model.", "Date": "January 27, 2014"}, {"Title": "Wonderfull color", "Author": "BigFoot", "ReviewID": "R2EYBD285U8ZNP", "Overall": "5.0", "Content": "This Plasma TV has the best color I have ever seen on an HD TV and it does very well in my bright living room. The 3D is also excellent. The sound is good but the speakers fire backwards and the sound reflects off the wall behind it. The only disadvantage of this set is that it only has three HDMI inputs and one Component input.Panasonic has really done a fantastic job on picture quality and the thin frame and sculptured base look great in my living room.", "Date": "January 27, 2014"}, {"Title": "Fantastic picture. WOW!!", "Author": "AC", "ReviewID": "R3LRMACRL7565G", "Overall": "5.0", "Content": "This is a great TV. Picture is stunning; since 4K is still out of reach, this is the best you can get. Perfect size for the MAN CAVE!!", "Date": "January 6, 2014"}, {"Title": "Love it.", "Author": "Warren Alston", "ReviewID": "R36WYV4BOHSPR8", "Overall": "5.0", "Content": "So far so good.  Delivery and setup went great.  We have had the TV for a little over a month and so far, I could not be happier.  Panasonic's' Plasma TVs have fabulous black levels and this can make for a darker TV in a bright room.  So far, most of our TV viewing is at night, so this is not a problem and our two previous TVs were Panasonic plasma.  If things change, I will update this review.", "Date": "December 29, 2013"}, {"Title": "Simply amazing - don't wait too long to order (you snooze you lose)", "Author": "Kenneth K. Rivera", "ReviewID": "RK30IZE5AKH28", "Overall": "5.0", "Content": "I upgraded from a 6-year old Panasonic 50\" 1080p plasma.  I always thought my other set had a good picture, but doesn't come close to the ZT60 unit.  The depth and richness of the picture is astounding.I ordered beginning of December - received the unit on 12/16.  Mine had an Oct. 2013 build date.  I would say that since production ended this month the pipeline of new units will be gone pretty fast.  If you're considering buying a unit I would wait too long - this unit is too good to miss out on...", "Date": "December 23, 2013"}, {"Title": "Same picture as my Kuro but bigger", "Author": "eric martins", "ReviewID": "R3ZX0EISHZFFG", "Overall": "5.0", "Content": "Coming from a 50 inch Kuro I wanted a TV with the same picture quality, just bigger. The 65ZT60 did just that and more. My TV build date was Oct 2013 and no fan noise like others have reported. The Plasma buzz is but its no louder than my older TV. Only can hear it if you are near the TV.", "Date": "December 23, 2013"}, {"Title": "The Ultimate in Picture Quality", "Author": "Michael Stevens", "ReviewID": "R2UGBEB3YGIKMU", "Overall": "5.0", "Content": "The ZT60 caught my attention at this year's HDTV shootout where its picture matched that of the fabled Pioneer Kuro. Initially planning to wait and see what next year would bring, instead we were greeted with Panasonic deciding to end their plasma tv line altogether. I grudgingly moved to get this before it was gone and am so glad I did, and realizing its such a shame that these didn't sell better.One I got it set up (after a four hour war setting up a stand to support this 136 lb behemoth), I adjusted the picture mode to THX cinema for daily (keeping it on Standard when watching tv) torture tests via the blu-rays: Sin City (for black and white), Tron Legacy (for the blacks, color palette and reflections), Star Wars - Attack of the Clones and Pacific Rim to test the color rendition. It was like seeing each my favorite movies for the first time again, the colors and black levels are superb. Tron and Pacific Rim especially looked like works on art on this thing. The black level on this tv is as black as its body, you may not be able to tell where one ends and the other begins.The one sheet of glass design produces significantly reduced glare. My living room has four windows that always catch sunlight plus a lamp is usually on but even with all that, I really had to squint to find any glare or reflections.The speakers aren't the greatest but in a smaller room they'll suffice. Panasonic likely assumed anybody willing to pony up $3000 for a tv will probably have external speakers.The 3D capabilities and smart functions are present and work fine - I'm not big on using either so really can't tell you how they compare with other sets. I set out to find the best picture quality available, and firmly believe I found it and based that, I rate this as 5 stars.", "Date": "December 29, 2013"}, {"Title": "Subjective in home comparison of the VT60 vs ZT60", "Author": "Steve", "ReviewID": "R1B0S4Y8RBW9KW", "Overall": "5.0", "Content": "We had a VT60 on loan for 3 months waiting for our ZT60 to be delivered. Our experience may help some decide. The short version: ZT60 4-3/4 stars, VT60 4-1/2 stars.Environment:  We have our TV in a very bright room with a full west facing window wall on one side, and also windows on the back wall but to the side.  Even at night, ambient light enters so dark is never theater dark.  Glare is a big factor in any TV decision. Our TV service is Verizon FIOS which I have found to be excellent quality providing a 1080i HD feed, and also a 50mbs internet speed.We now have the 65inch ZT60 installed. Comments on it in a moment. Previously I had two Rear Projection TV's in this spot; a Pioneer Elite (a good pre-HD soldier for quite a few years) and a Mitsubishi Laservue (sad story) for 3 years. Both RP's had no reflection other than a very muted bright area in some viewing angles. When the Laservue non-repairably died I started looking for a replacement.It was immediately clear that a non reflective screen is not an option offered today as LED (VHS?)has won the market with plasma (Beta?) holding on, and both seem to have found that a non-glare screen doesn't work(sell?) Possibly a projector might have worked but that was not an option for our room. Early reports of the ZT60 were just appearing and I was immediately intrigued. Best ever PQ with special construction and filter to reduce glare in a bright room.  Now I have never bought a TV without seeing it, but this time I did. I rationalized: TV showrooms are a terrible place to evaluate a TV. My preferred retailer is an independent and we soon found we were shut out by an exclusive agreement between Panasonic and Best Buy. While disagreeing with my choice, my retailer offered to loan/sell me a VT60 for the interim and take it back when she could get the ZT60.  Done (and at a discount off list and free delivery and set up as well).The VT60 was VERY good. I selected the THX Bright Room setting and used that 90% with THX Cinema 10%. At night there were no reflections and the PQ was excellent. Movies streamed in 1080i were excellent but to my eye BluRay and 1080p streamed (VUDU) were better..wow...perfect. Daytime is primarily for watching sports. It took awhile to adjust to ignore the reflections. In one \"angled\" seating position the reflection was too much to ignore. Picture Brightness is fine in the THX BR setting. PQ is VERY good. I would be a happy customer.Now the ZT60 has been here for two weeks. Its better. Night: Reviews have said the VT and ZT are identical in a dark room. Obviously I didn't see them side by side, but the ZT PQ seems even better to me. Daytime: Disappointed that reflections didn't magically disappear. On the other hand they are reduced. Its a little easier to ignore the reflections and the PQ seems better than the VT. BTW: no fan noise on my set, but I think it has the foam fix.Summary: I am a very happy ZT60 owner.", "Date": "September 29, 2013"}, {"Title": "Love my Panasonic", "Author": "TPars", "ReviewID": "RZ4736KI0R79K", "Overall": "5.0", "Content": "Super picture, but like reviews say sound quality lacking.  Love It !! Bought a sound bar and now best of both worldsThe Best Service also Thank You Amazon!!", "Date": "March 12, 2014"}, {"Title": "Awesome Colors", "Author": "Anand15", "ReviewID": "R2PCW1ET0G4ZQE", "Overall": "5.0", "Content": "I am coming from 40inch Sony XBR 7. I really pleased the colors on this TV. Watching 1080i content over cable it self makes so much difference. Initially i hesitated to plasma but after reading so many reviews i put big money on this model and its really worth it. I didnt done any calibration on this yet but am probably do it in couple of days. But without calibration i can see very big difference over my older sony TV.", "Date": "March 6, 2014"}, {"Title": "Deep blacks", "Author": "David", "ReviewID": "R3740SONBAQFBR", "Overall": "5.0", "Content": "To bad Panasonic is not making plasma's anymore. Best TV ever made. Awesome black levels. Feel sorry for anyonewho thinks LCD are superior.", "Date": "February 25, 2014"}, {"Title": "Best and Last Plasma", "Author": "Paul Stevens", "ReviewID": "R2XSO73X6FXBAC", "Overall": "5.0", "Content": "After an ISF calibration the monitor performs better than most professional units I have used in the broadcast industry over thirty-two years.  Worth the extra cost.", "Date": "February 21, 2014"}, {"Title": "From XBR's, to a Kuro, and now.....", "Author": "John T", "ReviewID": "R3DUCVAPTAYHBC", "Overall": "5.0", "Content": "I pulled the trigger on mine yesterday, after lots of viewings, comparisons, research, and the customer reviews here on amazon. After owning the Kuro for the last 4 years, I was set on a new sony 4k LED, but became somewhat dis-enchanted for the following reasons: 1) with current technology, I do not believe that LED/LCD can match the zt65 in PQ,  especially motion. With my eyes it is the best picture currently attainable, subject to future 4K processing. 2) the build quality on the zt65 seems to be extremely good, whereas all the sony's are built in Mexico. I had a few japanese made XBR’s and one from Mexico.... no comparison. 3) 4K .... the mantra of the industry to boost sales... and its a good one because a 4K signal is astonishing...but it is a technology in process and the availability of 4k material just isn't there yet. its coming.. which brings me to point 4). LED/LCD TV's are much less expensive to produce than plasma... which is the #1 reason everyone is getting out of the plasma business. the manufacturers want you to believe that 4k is the be all, end all, and it may be, but not with LED/LCD as it is inferior in picture quality to a plasma, in my own opinion. I also think about this... Sony is offering their 65\" 4k at approximately $4,900, yet vizio comes to CES 2014 with a $1000 65\" 4k. I know vizio is pure entry level merchandise, but 65\" 4k technology for a thousand bucks... and they're still making money? 5) until a better format comes out (OLED?), and/or until LED/LCD takes a quantum leap in PQ technology, which given the time will cause 4k prices to reduce, there is absolutely no reason to spend 5K on 1st generation 4K technology, when a set as good as this  zt65 is still available, for less $$$. Read some of the in depth reviews posted here by some very intelligent people, then see if any of these sets are still available............. you wont be dis-appointed..", "Date": "February 2, 2014"}, {"Title": "P60ZT60", "Author": "Jesus", "ReviewID": "R3U539PLRMHNM", "Overall": "5.0", "Content": "Absolutely love this tv.  In-laws kept getting on us for not upgrading our tv (had other priorities) from the old 2005 Sony KDF50A10.  Never wanted to get a plasma ever due to many \"inaccurate\" facts and representations.  Well the burn-in can still be a problem but it's nowhere near what it used to be when we last shopped for a tv.Researched a ton and had to decide between the Samsung and the Panasonic plasma.  Looked at them both in a similar-sized room with some ambient light and the choice was easy.  Panasonic all the way.June build date, doesn't have the fan fix but it also doesn't appear to have excessive noise from the fans like a few of the earlier in the year production models had.  Using the CNet settings and am appreciating just how much of a better picture we now have compared to the old Sony.  Blacks are black, the detail is sharp, and the damn thing is taking up much less room than Sony (also got rid of the stand and can put it on the shelf where a big 36-40 inch CRT was originally supposed to go.Am hoping this tv lasts for at least as long as the last one we had (8 years and still going although the picture is darker).  Run, don't walk if you're seriously thinking about upgrading your tv to a 60/65\" and don't want to pay the overpricing of 4k tv.  This set will be talked about for years to come.", "Date": "January 7, 2014"}, {"Title": "Great TV, Especially for Sports", "Author": "Sharon A. Pesselato \"DoxnLovr\"", "ReviewID": "R2F3AMOB6EI3M4", "Overall": "5.0", "Content": "Panasonic continues to be the stand-out for plasma televisions.  We have two others but keep upgrading size.  Can't really get much bigger above our fireplace.  Feel we will be just as satisfied this time as we have been in the past.", "Date": "January 1, 2014"}, {"Title": "Great TV", "Author": "tom in mpls", "ReviewID": "R2U59HZ87JO0CF", "Overall": "5.0", "Content": "Fan noise? What fan noise? I've had the TV for 2 weeks, and have never once heard any fan noise. The picture is astounding. I should give it fewer stars, though, because it causes me to watch more TV than I did previously because everything looks so great. Colors appear to me to be extremely accurate. Flesh tones to me are always the hardest, but this television nails it. Movies and sports both look fantastic. I'm very pleased with this set.", "Date": "December 28, 2013"}, {"Title": "One Of the Best TV's Ever Made", "Author": "RB60", "ReviewID": "R326PWLQ7G1KFL", "Overall": "5.0", "Content": "If you are considering purchasing this TV, then you probably have read the reviews (cnet, digitaltrends, avforums, etc.) on the colors and many features so I really can't add more, but I'll try. I didn't have plans on spending this much money on a TV. I wanted a Panasonic Plasma ST series but they were sold out and I was reluctant to spend the extra $1000, but I did. Well, this TV came solidly packaged and set up was rather easy. Now to the picture quality. Right out of the box, with a few simple adjustments and setting it on THX mode, it looked pretty good. After about a 150 hour \"break-in\" watching normal TV programs and movies using common sense not to allow static images (station logos, those dreaded black bars, etc) on too long, the picture has become outstanding - I have never seen a better picture on a television. There has never been any distracting \"buzz\" or fan noise as some have mentioned and not a trace of \"image retention\" or \"burn-in.\" I ordered Disney's WOW Blu Ray disc to fine tune this TV, and will after about 200 hours, but I am wondering if the picture can get any better.So, the bottom line is I am glad I spent the extra money on this TV. If you are considering this Plasma TV, I would highly recommend it. So far, it has given me nothing but pure TV viewing pleasure.Update (3-9-14):Did a calibration and found my TV was pretty close \"out of the box.\" I did make a few minor adjustments and they were slightly noticeable, but probably only minor to those who are looking for absolute perfection - and to those I would recommend a professional calibration. The Disney WOW is good enough for me, and I gained a little more knowledge. Well, I finally broke down and purchased a 3D (Under The Sea) Blu Ray movie. As stated above, I really didn't want to purchase a 3D TV as I just wasn't that interested in 3D. WHAT A PICTURE!! I was amazed at the clarity and the way things looked like they were floating in your room. The depth, the colors, and the realism are incredible. I will be purchasing more 3D movies in the future. This TV has worked flawlessly in the 350+ hours I have on it and I am quite satisfied with it. Get one while you still can!", "Date": "February 15, 2014"}, {"Title": "This saved me $500! Sound. . .", "Author": "Douglas Hawley", "ReviewID": "R2XCMOWKRE86UF", "Overall": "5.0", "Content": "Everybody is talking about the picture quality being \"amazing\" which is very true, but nobody has mentioned the \"other\" goodies that come with the ZT's. Have seen mediocre reviews about the sound and I have to agree. But, on-board sound quality is good enough for everyday use and not for that high impact flick. Which put me into a predicament. What to do about getting the sound to my AR9 speakers through my old HK pre and power-amp which I used on my older plasma Panasonic which had RCA outputs that connected to my existing sound system? Even this was problematic, because we couldn't control the volume without getting out of our seat!  ZT has no \"older\" connectivity, only newer HDMI or optical for connecting to HDMI/optical equipped  receivers/home entertainment systems which cost if you have to connect to high power speakers! We did use the RCA outs on the Panasonic Blu-ray player, which is top-shelf, but \"normal\" impact broadcast, we had to use the internal speakers! Not knowing the answer was right under my nose, we started looking for a new sound system to drive the AR's. Quite a few to select from, but we really didn't want to spend another $500 on top of the $2500 we just spent for the ZT60, which is a story in itself!  What to do? Spend $500 to connect/upgrade and shelve our HK system, or. . .The rest of the story. . .  Now, if you're a \"surround\" sound type audiophile, using more than \"stereo\", then the rest will not apply? To us, the AR9's driven to capacity are more than efficient  for any high impact sound capabilities produced by today's DVD movies and broadcast. So, after several months of highly enjoying our \"new\" investment, I was fumbling through the setup menu and noticed \"Bluetooth\" as a selection. Never really focusing on this added feature and not knowing it's capabilities, I clicked on \"connect\" and all of sudden the ZT did a little musical tone and read \"connected\",  then little remote speakers we bought at Costco, came alive! I suddenly had the TV coming to my coffee table and I could adjust everything about the sound using the TV controls! Could even shut the TV sound off and only have the sound to the remote speakers! Even has a \"sync matching\" feature so you can balance all the sound coming from all speakers! What a surprise! I could walk around the house listening to the TV! Men, you know what that means!So, got to thinking how far can we take this? I knew most of the equipment we were looking at had Bluetooth capabilities. I knew there is Bluetooth speaker systems and sound bars, so is there a device that will receive the BT single that has RCA connections? Did a little Amazon search, and . . .  bingo, the HomeSpot NFC-enabled Bluetooth Audio Receiver for Sound System!! 30 bucks! Ordered it, got it in a couple of days, took me 5 minutes to set it up. The ZT60 connected, turned on the stereo, a second bingo! The old sound system up and running in all it's glory! $500+ saved!!How does it sound? Couldn't tell the difference between HDMI directly connected to the DVD or this device! No wires no fuss. Just connect the unit to your receiving device (RCA - other connections included with this package), power it up, adapter included, you're in business. Again, truly amazing for Panasonic! Thought of everything. . .For advanced users, there maybe devices that will do the whole surround sound thing if it fits. We are only interested in stereo and this device is \"perfect\"! This device will do a lot of other Bluetooth connections and if you want to use older sound systems in a different area, i.e. deck, etc., it's perfect!Observations about ZT60 picture quality. Obviously the best I've ever seen. I guess there should be a ZT members only club seeing that plasma is a dying technology? You have to remember that plasma is the closest technology to CRT and there's no mask's or heavy duty processing power to get that image to your face! Speed isn't an issue. Each plasma element is either on state/off state so no back/edge lit LED to show through or section off. Therefore black is black, where it's supposed to be black and the rest is history! So, picture quality - TOP SHELF! The problem is the media. Example: Compression enters a lot is certain media, i.e., Stazs;  Black Sails fed through cable. Macro-blocking is an issue on a fine tuned TV such as the ZT60. It's like the difference between a LP recorded on high quality vinyl or a LP recorded for quick sales. When you have a \"high\" end turn table with high end moving coil pick-up, the differences will be present! Same for a quality TV. Crap in, crap out! Blu-ray can't compare, perfect. Standard broadcasting even has issues. Banding and macro-blocking can be seen, especially in dark scenes and scenes with lots of movement (oceans, clouds, etc.). Now, for some reason, PBS, it seems,  doesn't have this issue coming in at the same resolution and same cable? Especially, if you view Mr. Selfridge. Tremendous colors and detail are apparent! A lot different than the previous mentioned? A joy to watch!This pretty much says it all. Everything else these testimonies cover, totally agree! For those who have the ZT series and those who stocked up to make a buck - SMART! Think about it, maybe it'll be like the saga of Twinkies and we all know how that story ended!Good luck!", "Date": "May 16, 2014"}, {"Title": "Love!", "Author": "Amy Kline-Rodriguez", "ReviewID": "R2GQO3RN3KRALN", "Overall": "5.0", "Content": "We researched TVs for awhile before deciding on this one. I won't go into all the technical stuff because plenty of people know more and have already done that.I will say that I didn't even want a new TV. My husband got the itch and I went along with it. I'm so glad that I did. This is the best TV I have ever watched. It is so beautiful to watch that it makes even old stuff look like new movies. I was speechless when we finally hooked it up and fixed all the settings (THX cinema is amazing but does not work for movies streamed through the TV--we stream through the PS3).I didn't really care about 3D. It was just an extra perk. But once I tried it out I was blown away! It is actually better than the theater.Sad that they are not making these TVs anymore. No wonder some people bought more than one before they stopped production of plasmas.", "Date": "May 13, 2014"}, {"Title": "Beautiful picture quality.  Good sound.  Plenty of features.", "Author": "Cynical Nymph", "ReviewID": "R2PQK0M96I0I2E", "Overall": "5.0", "Content": "We've always preferred plasma TVs.  The deep black creates vibrant colors for excellent picture quality.  When it was time to replace our TV, looked up reviews on CNET only to discover plasmas were being phased out.  Couldn't find this one locally and had to order online.  Shipping was a bit slow but worth the wait since my TV arrived in perfect condition.  Since these are discontinued, there was no guarantee I could get a replacement if it was damaged in transit.  So far we've tested with TV shows, various sports, 3D blu rays, and video games.  Excellent picture quality on all of the above.  We have separate receiver with surround sound for audio.  Since the receiver is too old and doesn't recognize 3D signal, had to use TV's sound for the movies and sounded great.  Very pleased.", "Date": "April 26, 2014"}, {"Title": "Best picture", "Author": "L.Adams \"L. Adams\"", "ReviewID": "R3FF9RBPLRO4BY", "Overall": "5.0", "Content": "This is our second tv like this which we ordered while it was still available. By far the best picture available for the price.", "Date": "April 22, 2014"}, {"Title": "unbelievable tv", "Author": "robert hand", "ReviewID": "R3I8D1D0ZH8MVF", "Overall": "5.0", "Content": "since the days when flat srceens came out, the question was always lcd or plasma. always went with the lcd because . \"everyone else did\".but the ratings on the Panasonic ZT60  were over the top. lcd always had the angle issue and occasional odd artifacts now and then depending on the picture. once I turned on the Panasonic, I knew I had reached the promised land. the picture is  unbelievable!  the apps and internet connectivity were excellent. the bad part is they stopped making them. it will be awhile before OLED is tweaked and ready for the mass market so I will enjoy this tv with its incredible picture until then.", "Date": "April 18, 2014"}, {"Title": "Great TV", "Author": "hige82", "ReviewID": "R2KWBRMYWRXTXD", "Overall": "5.0", "Content": "most awesome picture quality I've ever seen. Everyone that has come over is blown away. It is on the expensive side but all of the features and quality are worth it. I've had absolutely no problems at all. It may not be great in a room with a lot of natural light, but that is not an issue for me.", "Date": "April 1, 2014"}, {"Title": "Best TV I've owned", "Author": "James Liedeka", "ReviewID": "R33UU2MIU74NYU", "Overall": "5.0", "Content": "I bought this to replace a 4 year old 50\" v10.  This was a huge step up, not only in size but in picture quality.  It's sad that the unnecessary 4K is pushing out the best current video technology.When I heard Panasonic was getting out of the plasma business, I decided to buy this now because OLED is several years away from replacing plasma at a reasonable price point.  I think new technologies like OLED or possible Quantum Dot will eventually be superior but they aren't here now in the size I want.In addition to a good picture, there are some fairly good apps.  I have only used Netflix, Amazon Video and the DLNA client.  Those worked great.", "Date": "February 8, 2014"}, {"Title": "Incredible TV", "Author": "teetime99", "ReviewID": "R2WDU2JZ5TXDZE", "Overall": "5.0", "Content": "Have been very impressed.  Fantastic picture.  Easy to set up.  Comes with a good set of apps.  Able to use wi-fi to play content from other devices.  Great for streaming.", "Date": "January 19, 2014"}, {"Title": "Remarkable!", "Author": "MusingCrow \"ZQuilts\"", "ReviewID": "R15UW4CGTJDT5K", "Overall": "5.0", "Content": "This technological delight was derived to us yesterday - as promised and within the time frame indicated. That's a goos way t begin,Our last television was - 54\" rear projection Hitachi that we bought in1997. It's been awhile ! Technology has damaged so much that I found myself with a lot of research to do!I wish that I had been able to access Consumer Reports ,but I read a lot of information and reviews about this TV, and CNET gave it very high marks.When we first plugged it in the color was kind of \"...meh...\". Once I found how many things about the color, contrast! tint ATC that I could teak we were all set. Now all I can say is WOW! This is one amazing image with superior quality. Amazing! I have heard no fan noise at all.Learning about the latest television technology was a good thing to do, and it provided me with a bit extra confidence in my selection if this modern marvel!  I would never wish that something would break so I can spend money, but in this case I am very glad to that the old TV broke so that we could enter the modern world of television technology!", "Date": "January 14, 2014"}, {"Title": "the panasonic viera tc-p60zt60 is everything expected", "Author": "william s. surratt", "ReviewID": "R3C3U5HQDAX7EK", "Overall": "5.0", "Content": "the picture quality is great and I had been told about a plasma tv for quite awhile. Looked at all the reviews on this tv and decided to spend the money for this particular one, and was glad that I did. This tv is capable of so much, and I will probably not use all of its features. If you want to spend the extra money, I highly recommend this tv.", "Date": "January 13, 2014"}, {"Title": "Excellent picture quality. Love this TV.", "Author": "Angage Perera \"Angage\"", "ReviewID": "R1V2N0WTXQHNIJ", "Overall": "5.0", "Content": "This TV has the best picture quality I have ever seen. This is bit expensive when compared to the LED/LCD but worth for the money. You will not regret buying this.Ceva delivered the TV. Yes, it is true White Glove delivery. The two guys delivered it did an excellent job. They brought the TV to the upstairs, unpacked, kept on the TV stand and switched on. Really happy about the delivery as well.Looks like all TVs gone by now or increased price. I'm happy about the decision I made.", "Date": "January 9, 2014"}, {"Title": "Black is Black!", "Author": "Katz", "ReviewID": "R337EOFKVKOQ1A", "Overall": "5.0", "Content": "I've had the Panasonic TH-50PZ850U plasma since 2/2009. Great TV except for the black level rise of the 2008 - 2010 product line. I always wanted a Pioneer Kuro because of their black levels but they were out of my price range. Then, they went away. I started hearing about the Panasonic VT & ZT series and their Pioneer like blacks. Then the bad news, Panasonic too, was getting out of the plasma business! Well, I couldn't let this one get away. With some encouragement from my wife, I put in the order. It was delivered Dec. 20th and WOW! The deep blacks really do make a difference! Now I understand what the experts mean when they say \"the picture pops\"! The 850U is now down in my man cave, and the ZT60 is in my upstairs home theater. Anybody that ever wished they would have gotten a Kuro should do what I did before it's too late!", "Date": "January 8, 2014"}, {"Title": "Something to Behold", "Author": "Sean", "ReviewID": "R38O8IQQJQRIPF", "Overall": "5.0", "Content": "I upgraded from a Panasonic 60GT30.  I loved the GT30 but wanted to buy Panasonic's last flagship TV, the 60ZT60.  The upgrade was well worth it!The ZT60 is an outstanding TV.  It is located in my living room which is very bright during the day.  I set the TV to THX Bright Room and all is well.  The Studio Master Panel does an excellent job reducing glare.  However, I did notice the panel's glare reduction dwindles the more off angle you are.Night time viewing set at THX Cinema is something to behold.  The TV produced deep blacks and vibrant colors.  I have never seen colors pop like this.  I have only watched TV channels including the premium channels.  No blu-rays so far since I am concerned about image retention with the letter boxes during my first 200 hours of use.  There is about 40 hours of use currently.The TV is loaded with features and comes with two 3D glasses.  I have not used the glasses yet so I cannot comment on the 3D picture quality.I highly recommend buying this TV.", "Date": "January 27, 2014"}, {"Title": "When only the best will do, go Panasonic ZT Plasma", "Author": "Ken", "ReviewID": "R18L39OFG0O4BI", "Overall": "5.0", "Content": "Outstanding, the best of the best of Plasma TV's, anything less is just not the same. The picture is THX theater with the deepest colors. This is built to last, not list others. If you want thee best, Panasonic is built in Japan and an innovator. I like that I have their support for this Plasma with updates and support for a lifetime.", "Date": "December 27, 2013"}, {"Title": "WOW!", "Author": "Jere", "ReviewID": "R1FYYNNHXKWQIB", "Overall": "5.0", "Content": "I have always purchased LED until I purchased this Plasma.Fantastic colors and deep blacks.I simply love watching movies on this TV.", "Date": "October 23, 2013"}, {"Title": "As good as it gets...for now.", "Author": "Pixx", "ReviewID": "RWN2PEN4XIQCW", "Overall": "4.0", "Content": "Missed a 5 star mostly due to the fan noise, even after the fix by Panasonic.  The noise you can get used to andits inaudible with any kind of volume, the picture I wouldn't trade.  It is so natural.  No motion issues, great adjustabilityfor personal viewing tastes. So much better than the eye-tiring over emphasized colors on other tvs.  This is definitelya keeper.", "Date": "November 4, 2013"}, {"Title": "A beautiful experience", "Author": "Frank Meringolo", "ReviewID": "RKIMH4CCVUXCS", "Overall": "5.0", "Content": "So my 65 inch Panasonic has been mounted for a week.  I can honestly say that this is the best TV I've ever owned.  I am not into all the technical stuff that some reviewers post; honestly it's all very confusing to me, but I do understand beautiful picture quality and this TV has the best picture quality I have ever seen.  I bought this TV because CNET stated that it has the \"best picture quality we've ever reviewed.\"  Let me say it is simply stunning.  The blacks are so deep, it's hard to imagine there could ever be any improvement.  The colors are vibrant and the 3D experience is amazing.  This is my second plasma.  The 54 inch Panasonic plasma, which this TV replaced, is now in my bedroom.  I now understand why sites like CNET prefer plasma TVs over LCD or LED TVs.  In my layman's terms, all I can say is that when I look at the LCD TVs of friends and family and compare them to my Panasonic plasma, the picture looks fake.  The colors aren't right, it's too bright, and it seem unnatural.Now I know this TV is expensive and it won't be for everyone.  But for me, it was worth every penny.  If you have the money, and you want the absolute best TV out there, I urge you to select this TV.  You won't be disappointed.", "Date": "August 27, 2013"}, {"Title": "Awesome TV", "Author": "Kieran", "ReviewID": "RK9PR688ZXAHW", "Overall": "5.0", "Content": "Awesome picture.  I still have our Pioneer Kuro, by far my favorite TV to date.  Panasonic picked up Pioneer's techs and team when they closed up shop on plasmas, and I can't decide if this set is quite as good picture-wise (still need to calibrate), but it's a much sleeker package and more up to date in terms of electronics, features, etc.  Have it mounted on the wall, looks great with the metallic sides.When I saw this at Best Buy, they talked me through the no-gap design, and even illustrated that a knock sounded very different on the set than any other.  Clearly makes an impact.  The set is also great in dark or brighter rooms.Figure I should mention -- it's totally ridiculous that the set arrives with automatic ads.  It's easy to turn them off so don't lose a star, but whose idea was that?  Can't have been that many extra bucks to cause annoyance on a very premium purchase.", "Date": "January 24, 2014"}, {"Title": "Best HDTV!", "Author": "Jesse Hernandez", "ReviewID": "R3EBRZP0QUAIR4", "Overall": "5.0", "Content": "Voted best Plasma in 2013 by the experts, how can u go wrong? Best black Level you ever saw, and with the 600MHZ refresh rate gaming is no problem, no lag! Blu rays are simply amazing on this TV at 1080P. If u can afford one get one!", "Date": "January 3, 2014"}, {"Title": "Best TV I have seen, much less owned", "Author": "Philip A. Kochenburger", "ReviewID": "R1MDEB019INJ4I", "Overall": "5.0", "Content": "Picture quality is far superior to any TV I have ever seen. Rich colors, deep blacks, superb image processing. 3D works extremely well; picture is bright and clear with great depth. I have never experienced 3D like this - absolutely remarkable. Rich array of special features will take me a while to use and fully appreciate, but so far the apps and internet features work smoothly and are integrated seamlessly together. Took only a few moments to set up and start using. Excellent product.", "Date": "September 17, 2013"}, {"Title": "I waited 4 months to proclaim this the best!", "Author": "DavidW", "ReviewID": "R8EEJH42MJ5KW", "Overall": "5.0", "Content": "This review is unfortunately a moot point. You can't buy this TV anymore except used. Panasonic cruelly pulled the plug on the best plasma TV ever made for consumer use after just one year of production. I would heartily recommend anyone consider all the recent Panasonic plasmas over the current crop of LCD's. The realistic color, perfect motion rendition, and overall sharpness just can't be beat. You really need 1080P source material to see the full benefit of the display. They're not as blindingly bright as most LCD's, but in my bright room this picture still kicks butt. There are dozens of professional reviews of this TV online. I'll just add that it's all true what they say about it.", "Date": "June 4, 2014"}, {"Title": "Great buy", "Author": "Thomas Everson", "ReviewID": "R2FQGAH64KXUE7", "Overall": "5.0", "Content": "No problems with delivery or tv. Good price. Picture quality excellent. No noise as some other people complained about in other reviews. Very quiet tv.", "Date": "February 4, 2014"}, {"Title": "Panasonic TC-P65ZT60 Plasma TV", "Author": "P. Bennetts", "ReviewID": "R36AIHM2HK0O5Q", "Overall": "5.0", "Content": "Since September, 2006 I have owned a Panasonic 50 inch plasma TV and with around 25,000 hours on it, it was performing admirably. I didn't intend to replace it this soon, but when I heard of the demise of Panasonic's plasma offerings, I jumped at the chance to get one before they were gone forever. I don't care for LCD/LED TV panels because they don't look the cinema like to me, with a certain graininess that I prefer. The LCD's are more like a video recorder, very smooth but to my eye not what I prefer. I don't like overly bright images in that they appear artificial. But that's just me.This new set has visibly deeper blacks and a beautiful color contrast straight out of the box. I use the Cinema THXa  setting and it is just what I prefer, although I do have the Disney WOW and the Spears and Munsil discs to try and calibrate the settings even further, although I'm told I may not see much further improvement short of a professional calibration. My point is that with no further fuss the picture is remarkably better than what I have been used to. Now then, I wouldn't pay the latest, what I think to be exorbitant prices, for the last few sets remaining. Anything north of $3500.00 for the ZT65 wouldn't be worth it, but that's only to me.My set is from June, 2013 and looks to have the foam fix to the somewhat noisy fans already applied. I checked with a flashlight through the vent holes to the fans and noticed the gray foam fingers were already in place. I then added 12mm sheets of computer case noise abatement pads to the wall behind where the TV was to be mounted and the fan noise is completely camouflaged. The screen has two tiny 1/4\" scratches to the black outer screen coating and one extremely small dimpled chip that is very, very shallow and does not in any way detract from the overall experience. I noticed these by carefully going over the screen with a flashlight in a darkened room and accept them as probably a manufacturing artifact. I was really searching for micro fracturing of the screen glass, but fortunately did not find any. I'm okay with not having perfection in the screen as long as it doesn't detract from the viewing experience. The TV was brand new on arrival with 0 hours logged on the set. You can check yours through the set up menu.This was well worth the purchase and a testimony to Panasonic's Plasma engineering prowess, and is really a continuation of the Pioneer Kuro development since they picked up many of the Kuro engineers when Pioneer left the plasma TV market. It's a pity that Panasonic lost so much money on Plasma TV's and had to leave the plasma TV market, but they left the market with a great final product.", "Date": "February 3, 2014"}, {"Title": "Panasonic TC-P65ZT60 65-Inch", "Author": "Fleen", "ReviewID": "R2P5RHG71H92UY", "Overall": "4.0", "Content": "The picture is great on this TV...!!!I would give it a 5 star rating, but the flash software already needs updated, and there is no way to do it.... Also you cannot browse the internet using the full screen!!! What's going on with that???????The 3D is awesome!Also, I do not hear any fan sounds coming from this TV. Maybe this issue has been taken care of on this latest built set...???", "Date": "January 9, 2014"}, {"Title": "Excellent plasma TV", "Author": "aggieann", "ReviewID": "R1KO64FSKPD3HT", "Overall": "5.0", "Content": "What a great picture!  For those who really want black blacks and true colors, this particular Panasonic may be YOUR set!It also is so beautiful when turned off that it almost appears to be a wall hanging.  Service from the seller was quick and itarrived without any damage to the box or the set itself  Packed extremely well, which we appreciated.", "Date": "December 16, 2013"}, {"Title": "Totally amazing !!!!!!!!!!!!!!!!!!!!!!!!", "Author": "Smart Shopper \"R.S.\"", "ReviewID": "RPUFOYKL30LQ6", "Overall": "5.0", "Content": "I can't say enough good things about this amazing TV. I've tried everything it has to offer except 3D andface recognition. Top CNET review is no lie!!!!! Trouble is, I never want to leave the TV room now!!!LOLRS", "Date": "September 27, 2013"}, {"Title": "Best TV on the Market", "Author": "garyanders", "ReviewID": "R3JX7ZB3GU6YDQ", "Overall": "5.0", "Content": "Inky blacks, excellent contrast and brightness, color pops out of the picture.  I looked at a lot of TVs and this is the best.  No wonder CNET ranked it #1 overall, but am surprised they did not give it a 5 star rating.  I have mine set on THX Cinema, with the contrast turned down to 50 and the brightness down to a -20.  Excellent picture on these settings.  I will eventually have mine calibrated.  Not even the new Sony 4K can touch this TV, the black levels are just far superior.  Buy this TV and you will not be disappointed.  Just hope Panasonic does not get out of the plasma business as they make the best product.  I have always owned LCDs but so glad I made the switch to plasma.", "Date": "August 10, 2013"}, {"Title": "The Best TV Ever Made", "Author": "Erich", "ReviewID": "R1FJXA1Q8IQ5FD", "Overall": "5.0", "Content": "Check out the reviews. Do your homework. Or just buy this.The result will be the same: EPICThe black levels are so deep that you will have a hard time distinguishing between the bezel and the screen. Inky is the word...I'd say every bit as good if not better than a Kuro.My only hesitation was that we have a wall of 22 foot windows on one side of our livingroom and I don't normally pull the blinds for watching regular TV. I'd heard that the brightness might not be as strong as others and visibility was not optimal in a bright room. These fears were wholly unfounded. I've never found myself having any issues...even watching dark scenes during the middle of the day. Granted, we do have two screen settings configured. Pro1 and Pro2. The latter does use a higher brightness, which makes everything pop a bit more when the sun is up...but I cannot imagine needing a brighter screen. Pro1 is picture perfect, having a flat line for RGB, spot on CIEs and sub 1 across the board for the rest. Color me impressed (pun intended).A few caveats for the wary:1) If you don't plan on having your set ISF calibrated, or don't know what that is, then you'll likely be just as happy with the VT or ST. If you do, expect the best.2) Similarly, I cannot  tell you how it sounds...we have a rather nice 7.1 setup for much the same reason as we'd want a picture of this caliber. In short, if you are satisfied with stereo sound from a couple of speakers attached to your set, then you are likely spending more than you should here and again should go for the VT.3) Ok...I can't think of 3. This thing is amazing.Eye popping color, inky blacks, total viewing satisfaction. The End.", "Date": "December 18, 2013"}, {"Title": "i love this tv", "Author": "danny", "ReviewID": "R3PDLWU1BBE1SA", "Overall": "5.0", "Content": "excellent picture. easy to set up. love it. very light and thin. almost dropped it while mounting it (had nothing to do with the tv or tv design)too bad panasonic won't make any more plasmas.", "Date": "February 22, 2014"}, {"Title": "Great TV, But Buyer Beware!", "Author": "Heath Bittel", "ReviewID": "R4VPW1EQJEAMX", "Overall": "3.0", "Content": "First off, the picture quality is amazing...if you don't get a defective unit. Mine had a dark horizontal line on the screen and a broken optical port. Panasonic is not supporting their plasma line anymore. They sent a technician, who confirmed it had a manufacturing defect. Now their customer support is claiming that they cannot replace or repair any of their plasmas. They are going to provide a refund, but that doesn't do any good since their isn't another tv out their that meets the picture quality of that panel. Now all the models still out there are being marked up. Hope everyone else has better luck than me. The picture quality really is the best, but don't think the warranty really means anything if you develop an issue!", "Date": "February 8, 2014"}, {"Title": "Far better than my 2004 Hitachi DLP", "Author": "Upton O'Goode \"Upton\"", "ReviewID": "R33LURNHYYORZQ", "Overall": "4.0", "Content": "Unlike most of the other reviewers, I'm no videophile.  I rarely watch TV.  But, when my old TV started biting the dust, I did some research.  People much more knowledgeable (or at least, far more opinionated) than I were raving about this set.  CNET, who rated it 4 stars, like I did, said it had the best picture quality of any TV, while other reviewers raved that it would become one of the legendary TVs of all time.I am giving the ZT60 4 stars, like CNET did, and I'm going to stick to that rating, despite that this has apparently ruffled a few feathers here on Amazon.The ZT60, like all other plasma TVs, is not being made anymore.  I must have bought one of the last on Amazon, because after I did, the price jumped up by $1100, and Amazon was no longer the seller.  Time will tell if I made a good decision by buying a TV that represents the pinnacle of an extinct technology.  (Risks include service, replacement parts, software updates and accessories.)I guess I got a decent deal, even though twenty two c-notes is a lot for a TV, no matter how good it might be.I ordered it on January 9, and it was delivered and set up a week later, by APEC, who must be Amazon's white glove agent in my area.  They arrived within the window they promised, unboxed it, put the stand on, plugged it in, turned it on, and hauled away the box.I don't have a cable or satellite receiver.  It was easy connecting it to my home network with Ethernet (also does WiFi, but for me, Ethernet is faster).  Once that was done, just a few more steps got the ZT60 registered with Amazon Prime video and with Netflix.  With the ZT60 on my network, I can send music, pictures and video to it from my Microsoft Surface Pro 2 (right click and \"play to\"), and from my iPhone.Like any high end item that attracts connoisseurs, there are entire internet forums filled with conflicting opinions about maximizing the performance of the ZT60 line.  Major topics of heated debate are break-in, calibration and avoiding burn-in and image retention (and even whether those exist).  There are examples of some pretty elaborate rituals for breaking in plasma TVs, but I opted for the path of \"watch HD at normal settings, avoiding any top or side bars and any static images for the first 100 or so hours.\".  I am also avoiding connecting the Xbox and the Wii during this time.I have to admit to being a bit stymied about special settings.  Others mention things like turning the pixel orbiter on or off, but my menus don't seem to be set up like theirs.The picture IS really good, to my untrained eyes.  Maybe too good?  It's film-photographic good.  I watched Falling Skies in HD, and compared to watching on my Surface, the ZT60 was so faithful that I actually perceived that the show was being shot on a set (kind of like watching a soap opera -- what is that? Some kind of depth of field effect?)The sound quality of the ZT60 line was panned by several pros.  I was going to run out for a Yamaha sound bar, but after listening to the TV, I don't think my ears need any help.Unlike others, I do not hear any cooling turbulence noise (also called \"fan noise\" or \"running fridge noise\".I agree with other reviewers that the home screen interface is a bit clunky and stodgy compared to what I have been led to expect from things like Xbox, Wii, Kindle or iPhone.  The two apps I use, Netflix and Amazon, are functional but not luxurious (for example, there is no way on the Amazon app to bookmark a series that I am currently watching so I can go back to it, instead of having to search for it all over again).", "Date": "January 19, 2014"}, {"Title": "Unbelievable", "Author": "David Dirubbo", "ReviewID": "R27SM52X294M0U", "Overall": "5.0", "Content": "Forget LCD, led, etc.  plasma is the way to go and this flat screen sets the bar!  Set the picture to vivid and your eyes won't believe it.  Picture clear and vivid and the 3d is just a bonus.", "Date": "January 13, 2014"}, {"Title": "very nice tv", "Author": "Mihai Petre", "ReviewID": "R3H3E1AC9OT9HF", "Overall": "5.0", "Content": "very nice tv. Very good picture, colores, 3d. I don't know how good the 3d is for 'jumping' into your face staff (not a lot choices out there), but from what I've seen is great. Down size it's very expensive, but the deal I got through Amazon and the finance it's a good choice, I think, for the long run. Buy the time I'm done paying it they should come out with new staff to start paying again :)", "Date": "September 29, 2013"}, {"Title": "Excellent In A Dark Environment; Fair In Bright", "Author": "Joe", "ReviewID": "R3UNO184C28FQM", "Overall": "4.0", "Content": "I rate this TV as an average of 4 stars.  I would rate this set 5 stars in a dark environment; 3 stars in a bright environment.I think the anti-glare filter marketing is a bit exaggerated.  The filter handles glare well compared to lower tier plasmas.  However, depending on the angle, I will still see reflections.  With windows and/or lamps opposite the screen and behind me, I see those reflections on screen.When the screen fades to black, I see the reflections of myself and the windows.  As stated, the anti-glare properties are better than I have seen on lower tier sets, but it is still a glass panel and reflections still occur.  Setting picture mode to 'THX Bright' or 'Vivid' helps a bit but, it will not eliminate reflections when a dark scene, or portion of the screen, occurs or when the screen fades to black (in that case you momentarily have a very expensive mirror).  In my opinion the issue of reflections is the most negative aspect of this set.I largely agree with many of the positive reviews of this TV (when my room is dark).  However, there are probably better alternatives for bright rooms where reflections cannot be controlled.(I did not purchase this set from Amazon.)", "Date": "February 16, 2014"}, {"Title": "Image retention an issue", "Author": "Jason R. Hall", "ReviewID": "R4HBBQCFPMQLO", "Overall": "4.0", "Content": "Overall I'm very happy with the ZT60. However, I have noticed skin tones can be a little too 'green' for my taste. I also would HIGHLY RECOMMEND you BREAK IN this tv before using it on a regular basis. I have about 100 hours on my tv so far and I have A LOT of burn in. I can see several 'logos' on my TV when the screen is white or some light colors. Generally speaking I don't notice it, but I know it's there! Watching a couple of hours of a channel with a logo in the corner is all it takes when this set is brand new. I would advise people to break in the TV without watching normal TV or movies with black bars.Be VERY careful with this TV the first few months. I tried the Disney WOW calibration DVD to reduce the image retention, but it didn't help at all. Maybe if I left it running for an entire weekend or something it might help? I left it on all night for 3 days and it did nothing to fix the problem.", "Date": "March 27, 2014"}, {"Title": "purchasing tc-p60zt60", "Author": "Clarence Powers", "ReviewID": "R3296KC2NYUJNW", "Overall": "4.0", "Content": "The only negative part of this purchase was that the tv was damaged in the transit. I had to returned to the tv because the glass was cracked in two places. Everything else about the purchase was positive and met my exppectations.", "Date": "March 6, 2014"}, {"Title": "Delivery comunication was bad.", "Author": "Amazon Customer", "ReviewID": "R38ANVBK2S7GY7", "Overall": "4.0", "Content": "The product is great.  I was told that they would deliver on Jan 7th with a person to help unload it.  They tried to deliver it with no noice.  Then they showed up a week and a half later with no notice anod just the driver.  I had to get a neighbor to help unload it.", "Date": "February 17, 2014"}, {"Title": "Best TV picture ever!!!", "Author": "Elena Marie", "ReviewID": "R2GE3LL3TGIUMP", "Overall": "5.0", "Content": "Even though the first two units I received were defected, the wait was well worth it. It's just an amazing TV!!!", "Date": "October 15, 2013"}, {"Title": "Great TV for video purists..but delivery service was terrible", "Author": "Alan Buck", "ReviewID": "R1S9O20NA46D80", "Overall": "5.0", "Content": "Probably the best EVER tv made to date according to most reviews. Even better than the Pioneer Kuro which held that honor until the 2013 Panasonics came out (VT and ZT 60 models).  Blows all LCD/LED TV's away for serious viewing in a fairly dark to dark room.  If you watch tv in a sunroom buy the LCD models. Blu-rays are just incredible on this set with it's inky blacks.Amazon dropped the ball on delivery though.  The carrier was CEVA and they were supposed to arrive between 3 and 6.  At 4:45 they called me and said they were running late and probably wouldn't get to me until 8pm.  They finally showed up at 8:45 pm...so far all Amazon did was say sorry.  I think when I buy a 3 grand product sorry isn't enough to make up for ruining my plans and coming almost 3 hours late!", "Date": "September 23, 2013"}, {"Title": "The Plasmatics", "Author": "Sanford L. Schantz \"sandyseeworld\"", "ReviewID": "RF2NBTRNZKBXD", "Overall": "3.0", "Content": "I like the picture on my Pioneer Kiro better than this Panasonic although this picture is quite good.  Unfortunately, plasma TV's are going to be a thing of the past because most people prefer non-plasma's.  I am a hold-out for plasma TV's and the price is getting better.  If you have a room where you can control the light buy a plasma since they're better.  If you have a bright room buy an LCD or whatever they call them.  I also have a Samsung LED TV which won't work with my SAMSUNG Sound Bar once I had a DirecTV Genie installed.  What's nice about this Panasonic is that the screen (panel) takes up virtually all of the viewing area so all you're looking at is the screen and no large border to reflect ambient light.", "Date": "January 23, 2014"}, {"Title": "What an awesome TV!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Author": "Alyssa Esquibel \"Dasanii19\"", "ReviewID": "R2JC2MMN6BD0QY", "Overall": "5.0", "Content": "Buy it! You will not regret it!! AMAZING!!!!! I bought this a few months ago and my jaw still drops open with amazement! Very impressive TV, I have never seen anything alike. This is the BEST TV YOU CAN BUY on today market. Stunning picture quality.", "Date": "August 17, 2013"}, {"Title": "Awesome", "Author": "651nickm", "ReviewID": "RQBSYFBDMDNBF", "Overall": "5.0", "Content": "I've had this. Tv for four months  and. It is the best all around tv out there ! I've owned 8 tvs in the last 5  years. Five.  LEDs  three plasmas.  All top of the line vt30 samsung d8000 sony xbr65.  Ect. And. People quit the 4k. Thought. I also wanted to buy one but the content isn't.  There yet ,so do what I will do ,enjoy this tv fours years and when the panasonic oled 4 k tv is  perfected then buy away till then this is the best tv out there deep blacks great color the contrast ratio Is close to oled buy buy buy this tv", "Date": "September 29, 2013"}, {"Title": "Left My Professional Calibrator Stymied....", "Author": "snyderman2 \"dsnyder917\"", "ReviewID": "R16KHUIHKZ9R8B", "Overall": "1.0", "Content": "Bought this TV and let it run to get my 100+ hours on it.  Made an appointment with a professional THX calibrator and that's when the fun began.  When he made adjustments at 20 IRE, his graph for 30 IRE moved.  Then when he adjusted the 30 the 20 graph moved.  Fine tuning in the color management system also revealed wiring or software that was working incorrectly.  He said he experienced similar problems on the only other ZT60 he tried to calibrate.  He did say he has had great luck with the VT60 though, so if your deciding between the two my calibration guy recommends the VT60 (he has calibrated two dozen of them with no problems).  I'm giving up on Panasonic and switching back to Samsung LED.  Too bad because I really wanted to love this TV.  Amazon was nice enough to take it back for a refund.  Amazon is absolutely the best in the business as far as returns go.  Love Amazon.", "Date": "December 15, 2013"}, {"Title": "panasonic getting out of the plasma business", "Author": "D. Burke", "ReviewID": "R82428STVXXME", "Overall": "4.0", "Content": "im torn buying this set.....i was told panasonic is now out of the plasma business and down the road parts for this set will be impossible to find....even though this is the best looking set in the 60 to 70 inch range i cannot justify buying a set that parts will not be available for......guess i will have to look into the samsung 64 inch 8500 series or their 75 inch lcd", "Date": "December 7, 2013"}, {"Title": "HOPE THIS HELPS!!", "Author": "Janine", "ReviewID": "R2NJMCUBP39IRU", "Overall": "5.0", "Content": "I will post this in different places I.e Samsung, Sony, and Vizio sections.OMG, choosing a car is much easier than a TV. As most people here, I have spent about 4 weeks solid; reviewing tv's, and stalking them as well. I have been to BB, HHREGG, as well as a few other specialty stores, and spent 2 to 4 hours in each store. (i'm retired so i can afford to do so).I have asked the sales people to insert proprietary 3d disks. The only thing that has not been possible is to attach my Xfinity/Comcast cable box to these tv's to compare the difference in picture quality.The first thing that needs to be said is that none of these stores selling said tv's have calibrated them. So some tv's that are highly rated on the internet, look terrible in the store.One example is  the Panasonic 65\" ZT Series Plasma HDTV, which was placed directly in bright lights in the hhregg store. The poor tv looked lousy and dark...Sniff.Another thing that you should know about the reviewer (me) is that I have been actively creating 3d objects and graphics for years. Resolution and color representation are so important to me.Couple this with the fact that I have light to moderate Aspergers. I can focus on microscopic details and differences for hours. Idiotic perfection of sorts. It's a blessing and a curse.The contenders we have selected for purchase (within our budget) as of today are :Sony 65\" XBR Series LED Ultra HDTVSamsung 75\" Series 7 LED HDTV - UN75F7100Sony KDL-70R550A 70-Inch 120Hz 1080pVIZIO M801d-A3 80-Inch 1080pPanasonic 65\" ZT Series Plasma HDTV.As of this writing, we have eliminated the Sony KDL-70R550A. Although it is by far the most affordable ($2100), the colors and picture quality are simply inferior to the others above.We are also probably going to eliminate the Panasonic plasma for whatever reason, the 3d was not amazing, and it's only a 65\" screen.If you mention the name VIZIO to me, I will start getting cold sweats. Although the Vizio M series affords plenty of great reviews, I still have a psychological barrier towards stereotypical cheaper brands. Quite frankly, I also have a barriers towards Kia and Hyundai, although they are great cars.I have had plenty of time to observe the vizio M801d-A3 and the Vizio M701d-A3 in action. Despite my mistrust in the brand, the picture both in 2d and 3d is excellent. Many reviewers  have said that the screen is too reflective and that there are problems operating the remote control on these models though. The screen on the Samsung 75\" Series 7 LED HDTV - UN75F7100, is also just as reflective. The color representation and picture quality of the Samsung is superior to the Vizio though.Anyone who is considering the purchase of a Sharp Aquos should definitely compare/study Vizio M models as well. Personally, I would buy the Vizio over the Sharps, I prefer the Vizios image over the Sharps, and the Sharp 80\" is very expensive too compared to Vizio. If anyone here is considering a Samsung 7100 or 8000 LED, do not even bother checking out the Vizios or the Sharp models.I hesitated a long time Over the Samsung models, and when my research was over, I invited my wife to review the results.The 3 models we studied were the Samsung 4k ultra @ 65\" and both the UN75F7100 and UNF8000 both at 75\".I saw very little picture quality difference between the UN75F7100 and UNF8000, however the 8000 series is much more expensive. For this reason we eliminated it.My wife and I have Apple Tv at home, so we are less interested in Apps and gaming. We like watching movies both in 2d and 3d.Next we compared the 4K ultra Tv's, the sony Xbr and the Samsung 4k. Both have a 65\" screen.For some odd reason we did not find the Samsung 4k impressive. We played a few Sony Demos on it as well as watched a few 3d movies on it, and It was marginally better than the Samsung UN75F7100. Also the 4k is more expensive by $2000.The 3d movies we watched were nearly just as good on the UN75F7100. We also found that the UN75F7100 had better COLOR REPRESENTATION...wait let me explain !!!The sony XBR 4K.If money were no object, I would buy the 85\" model of the Sony XBR 4 K ULTRA, right now.The sony XBR is by far the best picture quality and especially COLOR representation we have seen. By far!!!If you do not believe me, get a few 2d~3d movies you guys like, and go and force the sales people to play them on the Sony.Sony is reluctant to allow third party content to play on their demo Tv's because they want to show you their demo stuff (that looks exceptional BTW. But if you are going to spend 5k on a TV it's your right to be anally retentive.The picture quality, the perfection of color, and the passive 3d blew us away. This tv does an amazing job at up scaling content to a higher a definition of clarity and color.For me, the difference between the Sony and most of the other Tv's was like creating a picture in Photoshop at 72 pixels per inch and then creating the same picture at 300ppi, then comparing the two. Forget the fact that there is little to no real 4k content yet. This tv has by far the best picture.The huge dilemma we now have is. Which of these two tv's are we going to buy? The samsung UN75F7100 or the Sony 4K. The samsung is much larger +10\", but the Sony is better quality in picture and color.We found that the samsung UN75F7100 was not far behind in color, but there was still a visible difference. The sony image is much crisper/clearer. A higher definition, no doubt.The samsung screen is much like the vizio, extremely reflective to any object that may be in front of it.We preferred the sony's screen.Another dilemma we have is that we view tv from 12 feet away, so logically the 75\" samsung would be a better choice. Price wise they are more or less the same given a few hundred dollars.We did find the Samsungs stand quite unpractical. Due to the relatively long TV one needs two small tables at either end of the tv. We cannot wall mount it.The speakers are no doubt better on the sony which has speakers on either side of the screen. Anyhow, all these tv's warrant an added sound bar, so who cares about the original factory sound?Sony is coming out with the same tv in a few weeks without the speakers, So i may wait until I finally decide which of these two to purchase.Hope this review helps you guys choose a tv.Update 09/20/13I spent 5 hours with the panasonic zt tv today in 3 different places.I desperately wanted to find a reason to buy this tv over the sony 4k and the samsung 7100 @ 75\".The problem is the overall lack of gamma...then when you put on the 3d glasses it's even darker.I admit the picture quality and the color representation is exellent...but i really have a problem with the 3d and the darkness of the lenses.All these 3 tv's excel in one area and are terrible in another.The sony excels in simulated 3 d, and 3 d. It also excels in color depth.The samsung exels for 2d viewing. The screen is nice and bright and crisp. The 3d is ok, nothing fantastic.The panasonic excels in overall picture quality, but is too dark in 3d.So what is the solution?", "Date": "September 17, 2013"}, {"Title": "TV is awsome once you set up picture settings, BE WARE OF HIDDEN SHIPPING COSTS!!", "Author": "Brant", "ReviewID": "R2LDLBX6LUEENL", "Overall": "3.0", "Content": "The TV was just what I was looking for. I had a Vizio and I did not really like it so I bought this one.  The TV comes with two remotes.  One is a touch pad remote and is a great remote, everything else with the TV was as expected.  I would however be cautious where you buy this TV at though!  The \"Free Shipping\" is most definitely not free! The white glove delivery for me was nothing but my TV coming on a wet cold freight truck with the bottom of the box rotting out from being wet for a week and skidded around!!  White glove delivery means a company delivers your TV in a small delivery vehicle on a schedule set up by you, then brought to your house, unpackaged by them and inspected, they are supposed to put power to the TV and inspect it again. I had to beg the truck driver to help me unload it in my truck and then beg them again to help me get it inside my house. Then they left with no inspection, I had to inspect it myself and if there had been something wrong, the driver was long gone.  From the documentation the truck driver accidently gave me, I actually paid Paul's TV to deliver it for over $800.00!!! $800.00 to deliver a package that weighed 108 pounds!!! I have things shipped in the exact same freight trucks for $200.00 that weigh up to 400 pounds all the time any where in the U.S.!!!!! On shipping papers the driver accidently gave me the Total Value of the item is $2,365.81, that is right on the shipping papers!!!  I paid $3,196.99.  That is $831.18 for their  \"White Glove Shipping\" that I definitely never got!!  I have contacted Paul's TV several times via email and they have responded a few times denying all of this of coarse, so I thought that I would let all of you know.  I would just find this TV in a store and save yourself a lot of money!!!  I could have driven many hours from my house to get this TV and saved my self the embarrassment of being ripped off and the head ache from this shipper!!!  Why can't every one do business the honest way anymore?!", "Date": "January 1, 2014"}, {"Title": "Amazon claims they are helping me by saying they cannot help me.", "Author": "FREDDY R VILLARREAL", "ReviewID": "R3HFJTXYUQY0TM", "Overall": "1.0", "Content": "Offer said 24 month 0% interest. Sold and fulfilled by Amazon. I was charged interest. After 30 minutes on the phone I was told I needed to use a different Amazon card. The offer made no mention of Chase vs GE Capital. Amazon's response is try to return the tv. I give the tv a 5 star and Amazon 0 stars.", "Date": "February 14, 2014"}, {"Title": "Great but noisy", "Author": "jnzz", "ReviewID": "R1071HONH1Q2V8", "Overall": "5.0", "Content": "I had 2 ZT60's and returned both to a local store due to the fan noise. PANASONIC makes GARBAGE nowadays, that's it. They sent a tech to fix it. Same hoover noise on both sets. I will never accept mediocrity! I still have a 5yr old plasma monitor from Panny and will use it until OLED comes down in price. Picture quality is better but not much really. The AR filter is not very good as it shifts light pattern vertically - just like moving your head up and down in front of cheap TN LCD you will be unfazed...", "Date": "October 12, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "One Sheet of Glass Design. Eliminate gaps to produce optimized picture with elegant aesthetics\n30,720 Gradation Steps. Superior shadow definition allows for a richer viewing experience\nDCI 98% Color Space. Enjoy cinema-quality picture and color reproduction\nViera Connect with My Home Screen, Swipe & Share 2.0, Voice Interaction\nTV without stand (Width x Height x Depth): 55.3 X 32.6 X 1.82 Inches, TV with stand (Width x Height x Depth): 55.3 X 36.3 X 12.2 Inches", "Name": "Panasonic VIERA TC-P60ZT60 60-Inch 600 Hz 1080p 3D Smart Plasma TV (Discontinued by Manufacturer)", "ImgURL": "http://ecx.images-amazon.com/images/I/51PZ3U5ttLL._SX300_.jpg", "ProductID": "B00BC4SL18"}}