{"Reviews": [{"Title": "Fantastic picture, once you remove the Soap Opera Effect", "Author": "John Saylers", "ReviewID": "R2NF8YRJYY01YP", "Overall": "5.0", "Content": "Purchased this TV about 2 weeks ago, based on the good reputation of it's predecessor (the 640U), and after a couple tweaks, I'm very pleased overall with it.HOW TO GET RID OF THE SOAP OPERA EFFECT:Turning off the Motion Enhancement alone will NOT solve it. You also have to go to Picture Settings -> Advanced -> Film Mode, make sure Film Mode is on, and turn down the \"Advanced\" item. I turned it down from 7 to 0 and viola - The Walking Dead no longer looks like General Hospital. Although it's not labeled on the menu, the manual indicates that this setting is the Judder Reduction.PICTURE: Right out of the box, Sports looked great, but all of our usual shows and movies looked very strange. Upon Googling the \"Soap Opera Effect,\" I found plenty of info on how to correct it, but when turning off the Motion Enhancement didn't do anything, I was pretty worried. I was almost ready to return the TV, but after playing around a little more with the settings, I discovered the above, and now everything looks AMAZING! We have it set on Standard Mode, and with the above adjustments, movies look like you're in the theater and basketball looks like you're IN the arena!SOUND: This is my only complaint. I was prepared for this after reading a lot of reviews - apparently the sound is bad on all of these new giant LED TVs. But it's really bad - sounds tinny, like it's coming out of laptop computer speakers. I just figured it couldn't be THAT bad, but the sound on my 37\" Toshiba destroys it. I paired the TV with the Sony HTCT260 Sound Bar Home Theater System which I got on sale for $250, and it sounds phenomenal! True home theater setup - couldn't ask for anything more. I'm not taking off stars for the sound issue since I knew what I was getting into going into it and had planned on buying a sound bar system.INTERNET: Wifi was easy to set up. I skipped it in the initial setup and went back in and did Manual Setup, and I was able to easily find and connect to my wireless network, just like connecting any other device. We don't have Netflix, so I haven't tested that, but I watched about 15 minutes of YouTube videos on there and it didn't freeze or buffer a single time. Pandora also works nicely for party music. I do wish it had Amazon Instant Video as an app, but I'm able to get this through my Blue Ray player anyway.MOUNTING: I mounted it on the wall with a Cheetah Mounts Plasma LCD Flat Screen TV Articulating Full Motion Dual Arm Wall Mount Bracket For 32-65\" Displays Up To 165LBS With 10' High Speed HDMI Cable With Ethernet Fits Up To 24\" Studs, and it feels solid and looks great. I love the thin frame and the fact that the Sharp logo isn't huge on there. Wish the power cable was a smidge longer - it was *just* long enough to get through the wall, out the bottom, and into the power strip.WARRANTY: I got a 3 year extended warranty directly from Sharp (that starts after the 15 month manufacturer warranty ends) for only $110.", "Date": "April 1, 2013"}, {"Title": "(EDITED) Good TV, but inspect upon delivery and look at the bottom of the screen...", "Author": "Michael 3:15", "ReviewID": "RMDSDRMWZKW9O", "Overall": "2.0", "Content": "First TV that arrived was only carried in by a single delivery guy. When you test this TV, use a WHITE screen and be sure to view the edges. Mine had black flares on the bottom which I noticed while viewing a hockey game. Sharp's customer service was OK, but Amazon's has been great so far. Replacement arrived this AM and it seems better but I still need an hour or so with it to adjust the settings. The repair guy that Sharp sent said that the black flares were caused by \"pressure points\" in the frame which were probably caused by the television being dragged while in the box during delivery.Update:I have adjusted the settings based on what the other reviewer had posted. For my tastes, that picture is a little too dark. I increased the brightness and sharpness a little bit. However, those settings are a great place to start.For the price, this seems like a good tv. You definitely have to tweak it a bit to get good results though. I still notice some slight light distortion at the very bottom which goes up about an inch and a half. This could be caused by the weight of the television upon the bottom of itself. It is only really noticeable on a plain white screen, and it is much better than the previous one I had. Hopefully this will fade in time once the tv settles in.In regards to support from Sharp, well, it was OK, but they made me send them pictures. Amazon simply said, \"OK, we will replace it, no charge for shipping, no problem.\" You can't beat customer service like that. Everyone I spoke with at Amazon was very kind and professional. Thanks Amazon for putting customer satisfaction first and making the whole process as painless as possible.2nd update:After a few weeks, I am still noticing light flares at the bottom of the screen, they aren't really visible during dark scenes, but it certainly is taking the enjoyment out of watching my hockey games. Contacted Sharp and heard nothing back. Seriously debating returning. It's kind of like buying a new car and noticing a scratch on it you missed when you picked it up. Frustrating. Sharp...where are you? If anyone has a solution to the light flare problem, let me know! To return or deal with it...after a year will this still drive me mad? Will it get worse?3rd update:TV is going back on Friday. Sharp actually was very nice on my last few dealings with them, gotta give them credit for trying. But they said the lighting at the bottom of the screen was \"up to specs.\" It's really a pity because aside from this issue, it is a decent set. LCD does not have the brilliance of plasma though and the bottom of screen during hockey games looked like (and I'm quoting my gal here) \"the bottom of the screen is a crumpled piece of paper that got jammed.\" It didn't do it on the top or the sides, just the bottom. The cause is very likely the weight of the TV upon itself.Well, here's hoping that the new set I ordered is better. But now I'm reading that set has \"lag issues\" on gaming.I love Amazon, their customer service is top notch, but buying TVs through them is challenging because you can't see the model for yourself in person. You have to rely on reviews and research, which can be a blind buy. Luckily, their return policy is very lenient so you can find the right fit for the dollar and your needs.Goodbye Sharp, hello Panasonic I guess.", "Date": "April 25, 2013"}, {"Title": "Solid TV", "Author": "Yuppers", "ReviewID": "R1C8FEOUKNZF0X", "Overall": "5.0", "Content": "After semi-seriously researching new TVs for a month I finally decided to purchase the 60LE650U.  I auditioned it locally along with competing TVs I was considering (Samsung UN60EH6000 and Vizio e601I-A3 to name a couple).  The first things that stood out with the Sharp were the superior contrast ratio and deep black levels.  Picture coloration seemed quite natural...it didn't appear to be skewed towards any color.  Viewing in the store was enough for me to make my decision.I observed the same \"soap opera effect\" out of the box that other reviewers commented on and followed thier instructions for how to eliminate this.  After a little tweaking, motion seemed natural.  The first thing I tried out was the Netflix app.  After downloading an update, it launched Netflix no problem.  After initial buffering of 5-10 seconds loading a movie everything played smoothly with zero lag whatsoever.  I had previously been streaming Netflix from my computer to my old 720p Sony LCD TV.  In short, I had no idea the kind of resolution I observed on the Sharp was even possible through Netflix...I was blown away by the quality of streaming content (Thor was impressive to say the least).  I haven't made it through all the apps yet, but the ones I have tried and the interface are very nice.In dark viewing with very dark scenes a little edge bleed can be seen originating in the corners of the screen and progressively fading extending about 3 inches out.  This is quite faint however on my unit and is nearly impossible to notice under average viewing conditions.  That is my only minor complaint about the screen.  Otherwise the lighting and picture are very uniform and the overall quality of the set seems quite impressive for the price.So far, zero regret about this purchase & would make again...", "Date": "April 3, 2013"}, {"Title": "Phenomenal set, and great value, but not 100% perfect...", "Author": "W. Hunt \"SegWayne\"", "ReviewID": "R2VXS0PCPUDMD6", "Overall": "5.0", "Content": "I upgraded from a Samsung 50\" Plasma which only lasted about 2 1/3 years (4 months out of extended BB warranty) that had suddenly developed the dreaded \"vertical blue lines\" down the center.  Originally, I thought to just bite the bullet and buy the 60\" Samsung LED that they now had on sale, but noticed that -- for $100 more than what I paid for my new Sharp -- it only had two (2!!!) HDMI inputs and no extended \"SmartTV\" functionality at all.In the first review I read here for my new Sharp 60le650 TV before buying, it was all about the \"Soap Opera Effect\" and how to turn that unintential setting off/down...  I'd point people to that review and say it's almost 100% on the money.  Once I turned off that \"feature\", the picture I get is just outstanding.What I can tell you about the Sharp 60LE650 sitting in my living room is this;- PICTURE QUALITY : Yes, out of the box, you'll want to tinker with the picture and sound quality settings.  You'll also need to turn DOWN the Picture Settings >> Advanced >> Film Mode to ZERO (not off, just down).  Because of the great reviews here, setting up my TV to my likings (and the DVD calibration thing) took about an hour.  Now that it's adjusted, I could not ask for a better picture quality.My one potential issue is the automatic dimming (Energy star settings?) of the screen to accommodate light or dark rooms.  In the older analog days, when a light turned on or off in a room, the TV set would adjust gradually (within a few seconds).  My Sharp (and I'm hoping it's only a setting) seems to be so sensitive that in a dark room, the image goes bright or dark instantly with changes to the scene on the screen itself.  Even a white screen being shown causes the TV to go a little wonky trying to self-adjust the brightness.I tried turning off the energy star auto dimming features, but then the screen got unbelievably bright/washed out and I couldn't figure out how to fix it.  As annoyances go -- as I said -- all TV's do the same, I'm just maybe a little unaccustomed to it on this set, having gone from Plasma to LED overnight.- SOUND : If you're used to massive, theater-level surround sound and 20hz to 20khz bass response, you will be disappointed by the built-in speakers.  There's just now way around that, but I'm honestly surprised by the idea that ANYONE could possibly be surprised by this.  Apples and Oranges.If you're like me (apartment dweller, courteous to my neighbors), the built-in speakers are just fine.  I turned on the automatic volume leveling -- to help with the annoying commercials -- and bass improvement options and *I* believe it'll suit me well.  It's certainly no worse than my former Samsung.  That being said, I've never really done surround sound receivers and such as it really freaks out the pets... :)- SMART TV options : The Sharp 650 series comes with built-in functionality for Netflix, Hulu, and seemingly a \"dozen\" other features including a web browser.  I tried the Netflix functionality out as soon as I got the picture sorted, and the best I can say is \"it works\".  I have to confess that I'm a bit spoiled, as I currently use an AppleTV unit almost exclusively for my TV time.  The AppleTV simply does it all better, faster, and more conveniently than the built-in functionality.  The only thing my AppleTV doesn't have is a web browser, but I could honestly never see using the TV's web browser for anything unless I bought a bluetooth mouse and keyboard or I was desperate and didn't have my iPad (or laptop) nearby.In summary, and all in all, Let me say this.For the price I paid (NIB, on sale), this is an incredible TV set for the money.  Unless you're expecting a $5000 TV for around the $1000 mark, you will not be disappointed.  Just know that you'll have to spend a little time getting it \"tuned\" to your own ideal picture.  Overall, I'm extremely pleased with almost every aspect of the Sharp 60LE650.As for long-term life expectancy of the set, I can only hope it's better than the 2-year-old Samsung plasma it replaces, or that the extended warranty is worth more than the paper it's printed on.", "Date": "June 28, 2013"}, {"Title": "Great TV at a good price...for games, blurays and more", "Author": "The Darker side of Light", "ReviewID": "R38XS2WD9853OZ", "Overall": "5.0", "Content": "I spent hours and days and looking into TV's. I wanted a 70\" without spending more than $2k total! I game every now and then and watch blurays. After extensive research and lots of questions....Here's what  I found out and why I choose this model:For starters, there is NO perfect tv. Just like all other products, it comes down to personal preferences and money. If you are looking for the hands down uncontested winner with no equal, be prepared to spend $8k to $100k  (that's right 100k!) on true perfection. So don't kill yourself and waste your valuable time, instead look for the most \"bang for your buck\" you can get based on what is important to YOU.Refresh rate... 120mhz is fine and works great for this tv. The Truth is , the human eye can't even see \"refresh rate\" happening because it's to fast. Also this feature is only as good as other technical features in a tv. You could buy a cheaper tv with a 240mhz rate, but if it doesn't shine in other technical aspects, then it's just a waste and a gimmick to get you to buy it. Also , when it comes to gaming , don't believe for a second that your games will lag, run slow, and be worthless unless on a 240 or 600mhz (plasma) set....they won't!Smart-ness.  Ok if you have a smart bluray player with wifi, netflix, facebook...etc etc, then save yourself some serious money and get a tv that has all the same technical features but is not \"smart\" . But if you just have to have it, then let me say that all the smart features are great on this tv, the layout, the streaming and wifi all seem to work well, now...is this tv a PC??? no! Will surfing, browsing , chatting...etc be as good as with a pc....no! Are tv's as \"fast\" as your pc....no!!  Computers are better at computer stuff than tv's are, hands down.  Are they acceptable  on this tv....yes! But no tv is going to give you the same experience as your laptop, desktop or even tablet...not yet anyway but in the future im sure they will all be one in the same.You can put music, pictures ..etc on a usb and this tv does a good job of playback and the \"standby slideshow\" thingy with your pics on usb is neat!Gaming-- Stunning! I grew up playing games on CRT...black and white ones at that! So when I read about the difference in gaming from LED vs Plasma....I just wanna slap somebody. This tv has game mode, but I have seen no differences or delays between modes. If you have some settings turned way up or maxed , you may experience slight nunances in picture BUT game mode takes care of that and once you get the settings just the way you like them, you will be amazed. the quality is so clean and crisp4,000,000 to 1 contrast ratio - this has a lot to do with clarity, crispness and cleaness of the picture. by contrast compare a top seller like Vizio...cheaper tv , has alot of neat features ...and that magic 240mhz refresh rate...buuuuut  has 1000000 to 1 contrast ratio! 75% less than this tv! So again, what good is that 240mhz if you don't have the technical goods to back it up. This tv looks better than the 60\" or 70\" Vizio's that I was comparing it to. I went to wal mart and saw a big differencePicture -  Outstanding, blurays look jaw dropping. You can shut off the soap opera effect and the images will still look brilliant. I actually ripped a segment of one of my blurays , put it on usb and nobody could tell that it was being played from a usb stick and NOT a bluray.  it looked that goodI recommend that you get the Disney WOW bluray to calibrate the tv. You can calibrate each mode and then adjust it to however you want afterwardslike with all flat tv's ....you will need a sound bar. the speakers are in the back and it sounds crappy. but they all do.there is minimal glare from the screen and that's a huge plus living in sun drenched south!It's light and energy efficient....DNLA compatible !!tons of connections!I can go on and on... this tv is just plain great. It does everything I want it to. I couldn't care less if it's not 3D, I can't stand 3D anyway so it works for me.", "Date": "December 24, 2013"}, {"Title": "Great TV!", "Author": "TexasDave", "ReviewID": "R2FTY1XMMJIB9F", "Overall": "5.0", "Content": "First off I want to thank the person who gave instructions on how to remove the \"soap opera effect\".  LCD TVs never looked right to me and I could never really put my finger on what was wrong but when I heard that term it explained it perfectly. That issue was the main reason I have not upgraded my DLP TV sooner.  I figured it was just something I would have to get used to like projection TVs and bright rooms.I have had the TV for a few days and I am extremely impressed.  I upgraded from my 65\" DLP which had gotten to the point where it couldn't be seen with much light in the room.  I never realized how bad it was and how much of the picture I was missing until I saw this TV, the colors and picture are amazing.  One thing that impressed me coming from a projection was it seems to have a true black which I thought only plasmas were capable of.  I don't care much about smart apps but the Netflix one works great over wireless.  For the money you can't beat this TV and I can' think of anything I could get with a more expensive TV that I would enjoy.The only real issue I have with the TV is the remote, it works but its cheap.  Its not back lit and isn't really a true multi-device remote.  The TV relies too much on Aquos Link so if you don't have a Sharp soundbar forget about controlling volume on an external sound device with this remote.  I have a Logitech Harmony remote but sometimes I just want to touch one button to do what I need to do.  For those of you concerned with the sound of the TV, TVs with decent sound went away with tubes and rear projection which were basically gigantic heavy TVs with room for big speakers, get a sound bar or receiver with speakers.  If you buy a big screen HDTV and don't have some kind of real surround sound you are missing out.", "Date": "June 8, 2013"}, {"Title": "Great picture, fair price, unique Wallpaper mode", "Author": "John White \"weasel rancher\"", "ReviewID": "R3QGSLZ771WUVG", "Overall": "5.0", "Content": "I got the 60\" Costco version of this TV a few months ago. As long as you put it into \"Game\" mode, you won't have the Soap Opera effect, which is obviously terrible. You can turn off a lot of options to try to get there, but Game mode is the only sure way to escape it. I've played a small set of video games and it looks great. Can't comment on other fast action since I don't do sports.Built-in web browser, Netflix, etc. apps are slow and terrible. I have an AppleTV, with a massively better Netflix interface. Apple TV also let's me AirPlay my Mac screen so I don't have to use Sharp's awful web browser.Remote is fine. Audio out is weird because when you switch it to \"fixed\" to play from a separate speaker system you still get the volume slider, which will even decrease the volume as you drop below \"0\" on the 0-100 range. So that's dumb, but benign.I'm really a fan of the gimmicky feature of Wallpaper Mode on this thing. Only models 60\" and higher have this. You load images you like onto a flash drive, leave it plugged into the back, and when you turn the TV \"off\", it instead goes into very low power (they won't say how much) mode and rotates among your chosen images every 3 minutes. After a set period (24 hours max), it goes fully off. The TV doesn't exactly look on since the images have low brightness, and it's really nice to see some art pics I grabbed from Wikipedia rotating on shuffle in lieu of a giant black rectangle. Nice feature that maybe uses the energy of a 20 watt bulb by my guess. When the TV is fully on, I think it uses ~ 120 watts, so the same energy cost of a very bright incandescent bulb. They have a YouTube clip detailing this feature.I guess some TVs are better, but the marginal returns of extra expense seemed irrelevant to me. I looked at sets that were 50-100%+ more expensive, and couldn't see the difference. Nice price, very bright display if you want it to be. Unique Wallpaper mode. Very thin profile. 60\" model is only about 67 pounds. Soap Opera effect escapable. Clean plain black appearance with one very subtle brand logo. Even the power-on light can be deactivated. I'm happy.", "Date": "October 10, 2013"}, {"Title": "MOST BANG FOR BUCK!!!", "Author": "ryan bailes", "ReviewID": "R373WW6CUY8Z3M", "Overall": "5.0", "Content": "I love the tv it is big and beautiful on my wall. The smart apps are nice and quick. Really thin too. I do not regret my purchase although I was skeptical because I am a Samsung and Sony man and have never owned a Sharp. I would buy another Sharp TV", "Date": "August 21, 2013"}, {"Title": "Top notch picture, internet trouble", "Author": "Ryan", "ReviewID": "R89LJDO1P6AJS", "Overall": "4.0", "Content": "If you're simply looking for the best picture, look no further.  The picture on this TV is second-to-none.If you're looking to use all the goodies that come with the TV, such as YouTube, Netflix, and the web browser - be ware!  This TV has issues with network connectivity.I will try to call Sharp tech support.  If they're helpful, I will come back and update this review.Update 6/3/2013After speaking with Sharp technical support, the TV is now connecting to the internet.  The tech asked me to change the encryption algorithm in my router to TKIP for WPA2 (I was previously using AES).  I spoke with two techs, both of them were in the U.S., which was nice.  They also provided me with a direct number should I have to call again.I am updating this review from 2 to 4 stars and will definitely recommend it to others.", "Date": "May 31, 2013"}, {"Title": "Great TV", "Author": "Moffet", "ReviewID": "RBP2ZIGL0TQE0", "Overall": "5.0", "Content": "Sharp LED Aquos made in Japan with LCD panels made in the new Sakai factory.  Hard to beat the quality!!!", "Date": "June 27, 2013"}, {"Title": "Beautiful Picture", "Author": "Jack", "ReviewID": "R2XBBMCGKBBANK", "Overall": "5.0", "Content": "I received this Television last week. I ordered it on Tuesday afternoon and it arrived via Eagle Trucking on Thursday morning. The drivers unboxed the set, attached the stand and placed it on my credenza. They plugged it in, attached the HDMI cable and ran the initial setup. They did all of this in less than 20 minutes. I would rate ordering and delivery as exceptional.Setting up the Wi-Fi connection was a little confusing, but on my third try I succeeded. Most of the problem was me not following directions properly.I was upgrading from a 6 year old Samsung 50\" DPL, the difference in the picture quality was tremendous. Right out of the box, without any adjustments, the picture looked good. However after watching for a few hours I noticed some scenes seemed a little washed out and others seemed a little over saturated. There are a total of 41 adjustments you can make to the picture quality. I made a few tweaks, and oh my lord, the picture was terrible, I totally screwed it up. Sharp does offer dedicated AQUOS advisors to assist and help you by phone and through Wi-Fi. Instead I decided to try to find the proper settings on-line. I went to the [...] and found a lively discussion about this TV's immediate predecessor the 640U. (my set the 650U had just been released) Sure enough someone had posted a complete set of tweaks. I applied them and they pretty much worked. The picture was almost beautiful! I made one minor adjustment changing the AV Mode from STANDARD to USER and my wife and I are happy campers. I just came from a friends house where he had just installed a 60\" Samsung that cost over a $1,000 more than my Sharp and I believe my picture is as good if not better.As to the SMART features, NetFlix and Hulu Plus are very good. When I first tried to log on to NetFlix a message on the screen told be to upgrade the firmware, I clicked a button or two and within 5 minutes the firmware was up-to-date and NetFlix was working. I can't say much for the included games or for the Browser, and the other Apps are OK. I do wish they had an Amazon App for viewing Prime movies.The remote is OK, nothing special, the keys are a little cramped and it is not back-lit. I use a Harmony One so a lackluster remote is not a big concern.All in all I would make this purchase again. I think at the price this Television is a very good buy.UPDATE: 4/13/13After two full weeks with this TV I am happier than ever. The picture is sharp and very clear. The colors are brilliant but not over saturated. Blacks are very dark with just very minor light bleeding at the corners, nothing to get upset over. The only quibble I have is the \"Apps\" are just so-so. The browser works but typing with the on-screen keyboard is simply not worth the effort. I have an AppleTV I use for Netflix and Hulu so the Apps are not really a concern, and I never intended to use the TV for surfing the internet.At the price, this TV is worth every penny.", "Date": "March 31, 2013"}, {"Title": "Absolutely LOVE it!!", "Author": "CaptnInsano \"Ryan\"", "ReviewID": "R34FQHNVN0ZUEL", "Overall": "5.0", "Content": "Fantastic TV! I did many hours of research before deciding on this TV. Trust me, this is your best bang for your buck, The picture looks better than my parents 832u and it looks better than the 7 series.  I have not experianced the white marks people have been experiencing in dark scenes.  I just watched The Hobbit on BluRay and the dark scenes looked spectacular I was blown away by this picture.Pros:Best picture for the price range of $1000-1800, no comparison.CRISP gorgeous pictureSports look GREATFAST UISmart apps are greatSleek lookingCons:Awful speakers, definitely get a soundbar with this.Friends and family will be jealous and may come over to watch TV unexpected.I'm very happy with this purchase and would do it again and again. I will update if I have any problems with this TV, otherwise she is still hummin' along! Shoot me any questions..", "Date": "December 16, 2013"}, {"Title": "Audio/Video Sync problems", "Author": "Jim", "ReviewID": "R2D1KIJHHNYM19", "Overall": "3.0", "Content": "This is a nice TV, the picture is fantastic but the audio and video go out of sync on occasion.  I contacted Sharp about this, and they had me change some video settings.  This helped but did not totally eliminate the problem.  I'm hoping that a future software update will resolve this issue.", "Date": "September 8, 2013"}, {"Title": "Great Picture and Controls", "Author": "S. Baer \"Steve\"", "ReviewID": "RE7HA3HA0REAA", "Overall": "5.0", "Content": "Update 7/9/13On 6/24/13 a vertical blue line (one column of pixels) appeared near the center of the screen. I called Sharp and got through rapidly. They had me reboot, push several buttons, and read them the data from the screen. Then they had me take pictures. Shortly thereafter, they called to say that they will replace the set, including delivery and installation. I will update once this is done.Update 5/3/13The set is still working perfectly. Pictures from DVD and Bluray are superb!! We are watching Homeland on standard DVD from Netflix. It looks like we are in the studio!  On Bluray, my favorite test is the Rolling Stones IMAX disc. Wow!!On the web side, I am now using a Microsoft K800 wireless keyboard and mouse. It works perfectly. I did add an 18\" USB extension cord so that the wireless dongle attached to the set now hangs a bit below the TV and hence has a clearer RF path to the keyboard/mouse. I was able to use the TV's browser to stream the Sanford/Colbert-Bush debate the other night. The off-the-air TV is great also. Picture is superb. The sound exposes the problems at our local TV stations in Savannah. Most insist on transmitting fake \"surround sound\" instead of pure stereo or mono.I asked Sharp about forcing the set into pure stereo or mono mode per the instructions on page 17 of the manual. They indicated that the TV can only toggle between sound modes actually sent by the station. Since our local stations only send \"surround\", I am stuck with that. (BTW - The Sharp online question services are great. They provide good answers in a day or so via email.)Overall, I would say that this set is so good that it exposes problems in poor source material.______________I bought the 70LCLE650u about 2 weeks ago, and it is fantastic! I'll write a longer general review when I get more experience with it. I used the Amazon free delivery, and it was here in SC in about 5 days.I don't have HD Sat or cable, but off the air HD from NBC (Savannah)is outstanding. I also tried a Bluray disc of the Rolling Stones on IMAX (via a separate multi-channel sound system)and picture quality is superb.The sound from the built-in speakers is poor (as expected), so I rigged up a homemade sound bar using a Lepai 2020a amplifier (about $25 from Amazon) and a Zuni ($15 from Amazon) smart strip that turns on the amp when the TV comes on, and off when the TV goes off. That drives a pair of ancient AR2ax's for normal TV news watching. A normal sound bar will also do the trick. I especially like that the set remembers separate volume settings in each input mode.Wireless setup was easy, although I had to turn on my wireless beacon or the TV would not detect the SSID. It did not want to accept manual input of the SSID.I tried a Logitech K520 wireless keyboard (from my main PC) on the browser, and it works as expected. A real keyboard such as this is far,far superior to using the Sharp on-screen keyboard. This rig is not a replacement for a PC, but Google searches and movie data look-ups, and news work just fine. I'll now buy a smaller wireless keyboard.My two pearls of wisdom thus-far:1 - Be prepared to use outboard speakers. The sound of the built in speakers on any of these flat-screens, especially with thin bezels is wretched.2 - If you are going to use the browser, buy a real wireless keyboard.So far, so good. This set offers a tremendous picture for a good price.Thanks all for the soap opera info. That is my next step.Steve", "Date": "April 17, 2013"}, {"Title": "Good picture, good Netflix app, no real app expand-ability", "Author": "Concerned Citizen", "ReviewID": "RKNQ584M3TKSA", "Overall": "4.0", "Content": "Good picture, good Netflix app, no real app expand-ability.  Good value. I have the TV in a room with lots of windows and the picture is very clear.  At night, in darkness, picture is also very good.", "Date": "August 25, 2013"}, {"Title": "Love This Thing!", "Author": "dyle51", "ReviewID": "RCSICWLAQA3LA", "Overall": "5.0", "Content": "This is my first flat panel tv and it is great! I had buyers remorse because it's so huge! Good picture quality.  Only two minor drawbacks; the sound sucks, and the picture doesnt handle darkness very well. Neither of these bothers me though since it's such a huge improvement over what I had before. I've had this tv for several months and still love it. Maybe not a great tv is you're a tv geek, but for the rest of us it's a heck of a good tv. Love it!", "Date": "December 6, 2013"}, {"Title": "Nice TV!", "Author": "Lav Pachauri", "ReviewID": "RWTH0ELVMZ7ED", "Overall": "4.0", "Content": "Was very easy to set up. Wi Fi receiver is not very strong, but is working well once I extended the signal from my modem. Sound quality is just about OK - definitely need an external sound amplifier. Very satisfied with its picture quality and operation.", "Date": "July 31, 2013"}, {"Title": "Consider other options before buying this unit...", "Author": "Viqq", "ReviewID": "R18ZKPHUN1LFQ6", "Overall": "2.0", "Content": "I purchased this unit in January 2013 (from costco.com); within approx 2 wks of arrival the unit began to display severe lip sync problems (the picture and sound did not line up).  I worked with Sharp customer service for several wks and approx 4 tech service visits (including firmware updates and motherboard replacement).  When this did not solve the problem, Costco agreed to replace the unit with another new one.This second unit has been in place for approx 9 months and developed a dark line horizontally across the screen approx 8 inches from the top (like a line of dead LEDs).  I again went through Costco concierge to troubleshoot.  They put me in contact with Sharp Aquos customer service. Sharp asked me to take photos of the problem and upon receiving them have agreed that the unit is not reparable.The options now given me are replacement with another new one (but none are in stock as the device is no longer being manufactured, or a refurbished unit).  As you can imagine, following the decline of two new sets, bringing a refurbished set is not an attractive option. As it has been >90 days since purchase, Costco declines return to them.So, I'm stuck with a broken TV and the option of replacing with a refurbished one.  I have two other Samsung devices that have been bullet proof since I purchased them years ago.  Lesson learned, stick with Samsung if possible...", "Date": "October 20, 2013"}, {"Title": "Great Tv!", "Author": "Chris", "ReviewID": "R2JLR9QJK0F202", "Overall": "4.0", "Content": "I did a lot of research on this TV and it lived up to the hype. The Cnet review is pretty dead on with this TV. It has great picture big and bright. Some of the downsides with the TV is it doesn't handle blacks very well and movies aren't the best. I didn't have to calibrate my TV I just turned it to Dynamic. This TV has many different modes you can set it too. This TV works great in my bright living room. That was my main problem with my plasma TV is it had a horrible glare! You can buy other 60 inch TVs that have better picture than this Sharp. For the money this is the best 60in available and highly recommend it.Amazon Customer Service:I had a issue with the first TV delivered. My worst night mare was receiving a damaged TV! I called Amazon and they were very helpful with sending me a new TV with no trouble. My new TV was delivered within a week. They picked up the damaged TV with the delivery of the new one. I just wanted to write about this experience since it was one reasoning was skeptical about buying a TV online. Amazon is the way to go.", "Date": "June 25, 2013"}, {"Title": "Good tv but.....", "Author": "ETOMN", "ReviewID": "R3MDJTU2Q6ATQX", "Overall": "3.0", "Content": "I bought this tv on amazon about 4 months ago, haven't been using it a lot (average 5 hours a week), and today it showed a blue line from top to bottom which is clearly a panel defect(according to amazon tech support). And i am in contact with sharp now.But other than this, the tv is great, 4 hdmis.I use my apple tv and chromecast on it and it was awesome.Good tv with decent price.", "Date": "March 31, 2014"}, {"Title": "Sharp 60\" LED tv - questionable", "Author": "Paul H. Bowen \"PaulB\"", "ReviewID": "R2UHSCNHIW0MJH", "Overall": "2.0", "Content": "Poor image quality - lower contrast and blacks than my Sony.  This set arrived with an objectionable artefact (horizonatl lines in upper 25% of image).  Sharp is dragging their feet about servicing / replacing the set.  Apparently do not have any service in North Georgia ... anywhere.  They want photos of the set, the image, the serial number... I've sent them in twice, spent long wait times on the phone, long times troubleshooting with service representatives (some rude, most very agreeable)  Promise service calls didn't happen.  Delayed return phone calls, or none.I've had it with Sharp.  OK. so buy the TV, but don't count on Sharp service.After a month of telephone tag, ONE phone call to Amazon arranged replacement - no hassles.", "Date": "January 10, 2014"}, {"Title": "A great TV for the price", "Author": "Jeff C.", "ReviewID": "R1PZ2W5A9TD5B7", "Overall": "4.0", "Content": "I purchased this television about two weeks ago, to replace an aging 42\" Panasonic plasma. Knowing that I didn't want to break the bank, I looked at both this 70\" Sharp and the 70\" Vizio. While I haven't seen the Vizio in action (wasn't able to find it at any local stores), I'm quite happy with my choice.Out of the box, the picture settings need a fair amount of tweaking -- something I don't recall ever having to do with the Panasonic, but so it goes -- but I found CNET's recommended settings online and used them to get rid of the soap opera effect and balance out some colors, then I adjusted the brightness and sharpness a bit further to account for my own tastes. When I'm watching something like Sportscenter, the faces of the anchors still seem to have a bit of a pinkish hue, but I'll eventually get around to trying to fix that as well. Even if I can't get it perfect, I'm happy. Everything else looks great, and high-definition nature shows in particular are downright hypnotic.The sound on this TV is not great (but after reading so many negative comments, I expected worse). I had to rely on it for a few days until I realized that my old analog audio cables wouldn't work and I'd need to order a digital audio output cable. Like all large TVs these days, the speakers on the TV are a bit tinny, so I would certainly recommend connecting it to a surround sound system at some point (I use the Panasonic BTT190).I love having 4 HDMI ports (up from two on the old TV), enabling me to connect the cable box, a PS3 and the Blu-Ray player and still have an extra slot. I have not yet used any of the other ports on this TV, but there are several.All in all, I'm quite satisfied. For the price, I'm not sure you could get a better TV. I guess the only thing stopping me from giving it five stars is the amount of work required to get the picture to look right, but perhaps that's just a fact of life with all of these large LED televisions.", "Date": "December 12, 2013"}, {"Title": "Great value", "Author": "Marathon Freak", "ReviewID": "R32LI6XOPQAWS8", "Overall": "4.0", "Content": "Really a great TV for the money.  I had a four year old 46\" Sharp Aquos LCD TV that I replaced with this one simply because I wanted a bigger screen.  I was satisfied with the picture of the old Sharp and this one didn't disappoint me either.  And that's where this TV's strength lies.  I didn't need to make any adjustments out of the box but I haven't run any special calibration software against it either.  It just looks good.  I mounted mine to the wall.  I thought it might look too big up there but it doesn't.  Sharp's wallpaper feature is pretty sweet.  Turn the TV off and it goes into a low power standby mode and displays some canned art making it look more like art in the room that a giant black rectangle on the wall.  Put some of your own pictures on a USB stick (in a folder named \"WP\"), and it will cycle through those.With 4 HDMI ports, 2 USB ports, and other connectivity (component, composite, etc.), this should meet all your connectivity needs right out of the box.I didn't have any issues with the speakers but I generally run everything through an AV receiver.  When I do use the speakers, they're just adequate.  Nothing special; nothing terrible.I'd definitely recommend this TV.Buying from Amazon is easy but shipping can be dicey.  My delivery was less than seamless and the shipping company (Ceva Logistics) was extremely questionable.  Their 800 number had a message saying their long distance was disconnected and the number you get from Amazon to call them is always either busy or disconnects after multiple rings.  After 7 calls I never actually talked to anyone at Ceva Logistics but 3 calls to Amazon got everything straightened out.  What a pain though.", "Date": "December 9, 2013"}, {"Title": "I did my homework and this was the one for me.", "Author": "Oliver", "ReviewID": "R108K1EPGN2G48", "Overall": "5.0", "Content": "Had this for a few months now and I am very happy. Picture is awesome. Internal speakers are rubbish but i paired it up with a Sony sound bar and sub-woofer. A great buy. No remorse. Also a quick shout out to Sharpe for their excellent customer service. They could not be more helpful and their patience with me in setting up this TV was second to none.", "Date": "December 6, 2013"}, {"Title": "Excellent HDTV !", "Author": "Larry D. Walker \"Ldw\"", "ReviewID": "R2VRYRLII8T9IX", "Overall": "5.0", "Content": "I searched for a long time and did my research.  I was looking for a large screen HD TV that did not have 3-D capability because my significant other has vision problems and did not care about this feature.  I am very pleased with my choice and the picture and other features are excellent.  The only possible quibble is with the audio.  As others have mentioned, the sound volume is a little shallow.  However, this is a complaint common to ALL the new ultra slim HD TV's as they all have sacrificed speaker size for a smaller cabinet.", "Date": "November 18, 2013"}, {"Title": "Absolute Bargain!", "Author": "Street", "ReviewID": "RJ8PEZ11B1FU9", "Overall": "5.0", "Content": "I love this 70\" TV.  The picture is razor sharp with 1080p material, and very bright and vibrant.  The design is minimal but not understated.  I download movies and transfer them to my 64GB USB 3.0 flash drive, and this TV plays them flawlessly in all of their 1080p glory.  Since the TV is placed between large book shelves I ran a USB 3.0 extension cable down through the back of my TV stand into one of it's shelves for easy access to plug in the flash drive.  Another great feature of this TV is the matte screen.  I had a glossy screen with my last TV and the thing picked up every refection in the known universe.  This Sharp is night and day though, even in afternoon sun it picks up no reflections.I was able to get this as a used \"Like New\" deal through the Amazon warehouse deals for only $1400.  In my opinion that was a TOTAL STEAL.  This TV was brand new for all intents and purposes, still had all of the sticker plastic wrapped on it everywhere, none of the packaging was open and such.  Considering that I saw this side by side with a Samsung in the store that cost almost $2000 MORE than this TV and the pictures were pretty much the same, you can't lose with this TV.  Highly recommend..", "Date": "November 16, 2013"}, {"Title": "Really 'SHARP' TV", "Author": "sarvjeet singh", "ReviewID": "R2VLXIIXYH7633", "Overall": "5.0", "Content": "Ok, almost a week after owning the television (60 inch version) and trying to find things that I did not like about the TV, I have to give it five stars. To summarize: (1) Amazing picture (I can only speak for Blurays and Netflix either via PS3 or through TV's inbuilt Smart Central). THANKS A TON to other reviewers like Mr John Saylers without whose tip regarding the 'Soap Opera Effect', I would have spent a lot of time trying to get rid of it. The colors are crisp, picture sharp and simply amazing with the Blurays. (2) I found the sound of the TV to be great; unlike some other reviews that claim poor sound quality. Not only is the loudness decent but the overall quality of the sound from the TV itself is pretty good (I am used to watching TV with my Onkyo home theater and hence can distinguish between quality sound profiles). (3) The TV is slim compared to most other comparable models that I saw and the bezel is reasonably thin. (4) The concept of a dedicated Netflix button on the remote is simply amazing and I personally find it of great use.For the price, I do not think I would have found a better TV.", "Date": "October 12, 2013"}, {"Title": "Amazing", "Author": "California Dentist", "ReviewID": "RQY3TAGE9457E", "Overall": "5.0", "Content": "Ok this TV is amazing! it way smarter than other TVs at the same price range! Overall I give this TV a 9/10, everything is perfect aside from one thing. They didn't really provide too much room for you to attach you USB Flash drive, it didn't matter to me since I connected my external hard drive and wont be unplugging it too often.", "Date": "July 1, 2013"}, {"Title": "Goes out right after warranty", "Author": "Lorretta Rowan", "ReviewID": "RXDHHNI0KFUZR", "Overall": "1.0", "Content": "This tv has a great picture but I would never buy it again. It lasted 14 months and went out. Sharp will not stand behind it. Don't buy any Sharp tv. Research error codes and you will see how many people have had the same thing happen. The service costs more than a new tv. The only reason I give it 1 star is because 0 is not available.", "Date": "April 25, 2014"}, {"Title": "Awesome TV - at a Vizio price", "Author": "Meng Qi", "ReviewID": "R3OCY6708V8IFS", "Overall": "5.0", "Content": "If you are looking for a 70 inch major brand TV around the $1500 price range, this TV is probably your only choice - and probably best value.The TV is heavy but manageable if handled by two people.  I assembled it in 5 minutes with the help of a friend.The menu is a bit unwieldy compared to the smooth, slick menu of LG and Panansonic.  But you get used to it after few minutes, and once you finish configuring the settings you will rarely use the menu again.The TV has zero dead pixel and the BEST screen uniformity of any LCD/LED TV I've seen, even though it is an edge-lit TV.  Screen uniformity is better than my direct-lit LG LN5700.I selected Game picture mode and tweaked the settings.  I recommend using game mode only.  Game mode has very low lag and no soap opera effect.  When watching movies in the dark, simply dial down the brightness.  If you like film effect, choose a warm color temperature.The black level feels like night and day compared to my LG TV which has an IPS panel. IPS panels offer great color saturation and viewing angle, but at a price of light black level.  This TV has inky blacks, but shadow details look slightly crushed.  Also, skin tone sometimes looks slightly unrealistic.Color reproduction is great. Coupled with excellent black level, the picture (especially nature scenes) looks almost real.I ordered a Sharp 757 before.  It is a lot worse than the cheaper 650.  The 757's game mode has a ugly red tint.  The Quad Pixel technology (adding a yellow pixel in addition to the standard red, green, blue) does nothing to improve picture quality.  If you do not need 3D (which I assume most people don't), then just pick up the 650.  The 7 and 8 series would be a waste of money.", "Date": "December 8, 2013"}, {"Title": "BUYER BEWARE!! TV HAS BEEN BROKEN 6 MONTHS UNDER WARRANTY AND SHARP SAYS THEY DONT HAVE A WAY TO FIX OR REPLACE IT IN PHOENIX AZ", "Author": "Jeff Mitchell", "ReviewID": "R3E5BEBXAN04TG", "Overall": "1.0", "Content": "BUYER BEWARE!!! The worst customer service of my life. Several thousand dollars for a tv that lasted 3 months. We have called Sharp over and over and gone to the top and they do not have a contractor who will work for them in a city as large as Phoenix and have not offered to replace or ship the tv. We are stuck with a new broken tv and they simply don't care. I don't see them being around long with this level of quality and service. My employer has the same tv and it also only lasted a few months before the screen blacked out. They also could not get Sharp to repair it and ended up throwing it out for an LG.", "Date": "December 25, 2013"}, {"Title": "Huge tv, average picture quality and motion processing", "Author": "Matt Blevins", "ReviewID": "R3IQ0XZZZL7QMK", "Overall": "2.0", "Content": "I cannot give a really thorough review on this tv because the one I received from Amazon was sent back due to serious a light bleeding issue along the right side of the screen. A few things I noticed right away, motion looks very choppy when watching sports. (the set was calibrated using cnet's settings at first, then sharp tech support made adjustments to try and eliminate the motion blur and light bleeding) I also felt that the picture quality was just average. The picture on my 4 year old LG LCD looks much better IMO. I was extremely disappointed with this set as a whole thankfully Amazon was great allowing me to return the unit with no hassle.I exchanged this unit for the LG 55la6200 and could not be happier thus far. The 5\" difference is slightly noticable but its superior picture quality makes up for it.", "Date": "August 10, 2013"}, {"Title": "It's like a theater in my house", "Author": "UrbanBushcrafter", "ReviewID": "R1WIWFRYZ5X4I7", "Overall": "5.0", "Content": "Movies are one of my favorite things in the world.  There is little I love more than going to the theater and getting lost in another world for two hours, watching the hero get the girl and ride off into the sunset.  Accordingly, I am ever working to improve my home viewing experience.  This TV has greatly contributed to my personal cinematic experience (that, and my 700W surround sound system).As a cinephile, one thing I want is total control over my viewing experience, and the LE650 delivers on that.  The amount of features, settings, and adjustments you can make to the picture, frame rate, color, sharpness, etc., are staggering.  Although it drove my wife nuts, I spent nearly a half hour one night adjusting every color setting the TV had until I could hardly distinguish between a photo and real life.  The movement is smooth, with no ghosting or afterimage.  The blacks are very rich, and the TV gets surprisingly bright, though if you're like me, you'll probably want to disable the adaptive lighting feature which seems to serve only to make sure the TV is always just a little too dim for current conditions.The sound isn't bad as TVs go.  The dynamic range is decent, though like any built-in speakers, you'll miss out on some bass, and some of the crisper, higher pitches (like dialog) will get lost in busy scenes.  If you're an audiophile like I am...I would highly recommend dropping a few extra bucks on an external sound system, even if its just stereo sound and a subwoofer.  I will say, however, that this TV gets surprisingly loud.  It goes up to 99 for volume, and I don't think I've ever had it beyond the teens.There are copious inputs, including 4 HDMI inputs.  My favorite feature about the HDMI ports (aside from there being 4 of them), is that they are side facing in the back of the TV and recessed enough to make cable hiding easy.  Additionally, there is a digital out (S/PDIF), USB in, HD component in, composite video, and many others.Perhaps most importantly for modern viewing, the TV sports both an ethernet connection and built-in Wi-Fi.  I have not hooked up the ethernet, but the Wi-Fi works like a charm.  Less than 30 seconds after the TV comes on, the Wi-Fi is online and I'm watching the latest episode of House of Cards on Netflix.There is a decent lineup of built-in software, including YouTube, Netflix, Hulu Plus, and others, though Amazon Video on Demand is lacking (fortunately I am able to get that through my Blu-Ray player).  There is a web browser built in, but it is kind of clunky to use with a remote.  I do not know if the TV can take an external mouse and keyboard, though these would be welcome.  Consequently, browsing YouTube videos without a remote app or trying to surf the web can be a pain.  Also, I found that some plugins don't work properly on the Aquos' web browser.  When trying to make an embedded video go full screen, it would pop-out for a second, then back.  I bought it to be a TV, though, not a computer, so this doesn't detract from my rating.This is a very nit-picky item: the Aquos has \"Aquos Link\" which gives it the ability to control other devices, but the execution is somewhat inconsistent.  There is no way to manually tell the Aquos which devices you have, so if it doesn't detect or is not compatible with your devices, oh well.  Even if it dos connect to/control your devices, it doesn't seem to have the ability to turn them on and off with the Aquos remote, so if you were hoping to thin the remote herd on your coffee table, it's not going to happen.  Also, the button functions on the Aquos do not necessarily line up with other devices, i.e., the fast-forward/rewind buttons on the Aquos remote actually make my Blu-Ray player chapter skip.  Again, though, it's supposed to be a TV - not a media center control system.Overall, after about two months, dozens of HD TV episodes and movies, I can unequivocally say this was a fantastic purchase.  My wife and I have always loved curling up on the couch and putting in our favorite movies, and this TV has only made us more of a pair of couch potatoes.  Highly recommended overall.", "Date": "April 16, 2014"}, {"Title": "Great TV Sharp LC-60LE650 60-inch", "Author": "Joan Lavoie", "ReviewID": "RIC4ELKV2KEQ0", "Overall": "5.0", "Content": "Easy to setup and this tv has all the connections to hook up multiple game systems,surround sound and dvd player, Once i adjusted the picture settings and turned off the film settings per another user here, No soap opera effect or lag. I used a combination of settings from other user's i googled, IE.. game and movie to make adjustments for my room and i still am in the process of adjusting as on some tv shows i still get a little red on the flesh tones but not on every show, I will probably get the Disney WOW disc to calibrate. Even with this i still have a great picture and gaming on this 60\" is fantastic!", "Date": "February 12, 2014"}, {"Title": "Excellent Budget TV for a Modern Home Theater", "Author": "Jetsu", "ReviewID": "R36VHL8EJHV7D4", "Overall": "4.0", "Content": "PROS:-Lots of ports-Supports ARC (if you turn the TV off or on, or change the volume, your receiver should do the same)-Excellent picture quality-Supports Game mode-If you're hooking up your PC to the TV, there is an option called Dot-by-dot which will let you see the entire screen.  Most of the TV's I've seen are always zoomed in a bit.  (One of my friends just bought a Samsung and we couldn't find a similar option)-Was only $900 at CostcoCONS:-When the screen is completely white, there are some weird dark areas to the bottom left and right.  This is unnoticable 99.9% of the time but may bug some people.-When playing Uncharted 3, the voice acting doesn't appear to match the lips of the characters.  I might be able to fix this if I hook it up to my receiver first, not sure yet.  Same problem when using Netflix from the TV app.-Upconverting video quality could be better (If your receiver doesn't do that for you).  Next-gen consoles and PC's look great though.With its large number of ports, I'm creating the simplest HT setup of anyone I know.  Everything gets hooked up right to the TV, then one HDMI is going to go to the receiver via ARC so I can change the volume via the TV.  I don't have cable, so I can get away with only having one remote!The xbox 360 passed 5.1 without me having to setup anything but the PS3 was a lot trickier.  After switching to bitstream on the TV, I had to set the audio settings to HDMI -> automatic and in the Bluray settings I had to change it from Linear PCM to bitstream.  Using Game Mode is a must if you are playing action games, the other picture settings have too much lag.  For movies I'm currently using Movie Mode with the Film Mode turned down low.  This helped with some of the motion problems movies have.EDIT:I found that it take a bit to long to turn on by default.  I turned on a setting called Quick Start Mode (and on my receiver I turned Standby Sync to On) and it turns on much faster now at the cost of a few watts.Also I found while I can pass through DTS and Dolby Digital encodings through the TV, I could not get Windows to configure the speakers as 5.1.  I'm guessing this is because the EDID of the TV is wrong or it only has the bandwidth equivalent of optical.  I didn't bother trying to work around this so my PC is now the only connection to the receiver.  I'm okay with this as it frees up another HDMI slot and my receiver is quick enough to always display it.  Now all speakers are used when playing stereo and uncompressed 5.1 sounds from my PC.", "Date": "January 19, 2014"}, {"Title": "Good TV for the price", "Author": "Stan_in_TX", "ReviewID": "R2SP1WF0B1FH1S", "Overall": "5.0", "Content": "I have to give this 5 stars due to Amazon's RMA process.  I ordered this and the first TV had weird waves on the screen (hard to explain).  Called Amazon to see what options I had and they sent a new one out.  Got the new set in less than a week later.  The new TV it flawless.  For being so thin, it is really heavy.  The picture is clear and the integrated NetFlix is a big hit at the house (the interface is kind of slow though).If it werent for Amazon, I would rate this TV 2 stars. TV is good for the price.", "Date": "September 12, 2013"}, {"Title": "Could Not Calibrate", "Author": "Bri", "ReviewID": "RZOWZTD5CH9LO", "Overall": "2.0", "Content": "I used both the CNET calibration and the Disney WOW disc to calibrate the picture. In my opinion the color looked off. The price and 4 HDMI inputs are amazing, but I couldn't sacrifice the quality of the picture for a cheaper price. I opted for a 55\" Samsung for about the same price. The Samsung was so much better out of the box.", "Date": "April 5, 2014"}, {"Title": "Audio delay....", "Author": "l.larra", "ReviewID": "R69NHIW4M3OV2", "Overall": "2.0", "Content": "We bought this back in june when it was on sale.  It was delivered within a few days and the delivery person unwrapped it and turned it on to show us everything's in fine condition before he left. everything seemed to work fine. We couldn't hook it up right away as we were renovating, so it wasn't until over a month later when we finally installed it onto the wall and started actually watching Tv with it.  Well, the screen and visuals were really great - no complaints.  The sound was too low but we knew that going in and we got a soundbar so that's fine.  However, the problem is when watching cable tv there is an audio delay that happens every....30 minutes? an hour?  changing channels or using the freeze button will get rid of it, only to have it happen again....shortly.  If we weren't past the 30 day return period we definitely would have tried to return it.  Well that was 5 months ago and its still happening. We're way past the return period now so i guess we're stuck with it.  you can say that its the cable box's fault not the tv, but why does my other TV (a samsung 55\") work perfectly fine?  bottom line is something is wrong with this tv. It's otherwise perfect but this problem really drags it down. a lot.", "Date": "December 4, 2013"}, {"Title": "Great tv", "Author": "bobby", "ReviewID": "R24WGIRQKLHHWC", "Overall": "5.0", "Content": "I went to purchase the lc-70le640 but when the salesman went in the back he can back and said he had one 640 in stock and one 650 in stock. The 650 model was 70 dollars cheaper. When we compared the features it identical to the 640 except it had the duo-core processor and better smart features plus the bezel around the TV was has as think.  It was a no brain er for me to get the newer model for 70 dollars less. The tv has one of the nicest pictures I ever saw. The smart feature works flawless. Like almost every other new led TV, the sound is not great but I don't care because I'm going through a yamaha receiver anyway. Sometimes I think the picture is actually to clear bc when you watch a block buster movie it's like the actors are in the next room. I had the tv for almost two weeks and it has performed flawless.  if your in need of a good tv for a really good price, give this tv a look.", "Date": "March 13, 2013"}, {"Title": "Exactly 3 months of use", "Author": "Bob", "ReviewID": "RFAXBIJ5LVBN1", "Overall": "1.0", "Content": "This Sharp 60\" was a great TV for the 3 months that I've had it.  However, last night while I was playing video games, a narrow, bright green line appeared running vertically through the screen.  It's there as soon as I turn on the TV, and shows on every input.  I can't watch anything without noticing it.  I called Sharp and after doing a couple of resets, I was told to email them pictures of the line, screen, and the back of the unit.  Even if they make it right, I don't know that I'll ever buy another Sharp TV... This was my first, but if it has problems this soon, will it make it another year or two even after a fix or replacement?!?  Meanwhile my Panasonic plasma looks as good as the day I bought it 4 years ago.  I should have stuck with the brands I know and trust.  Tread with caution.", "Date": "January 9, 2014"}, {"Title": "Great TV", "Author": "Patches56", "ReviewID": "R174KZDHRZ4EO1", "Overall": "5.0", "Content": "I love this TV.  The 2 men that delivered it were so nice and helpful, they put the stand on for me and were so very polite.  The TV had a glitz and I called Sharp and they were very helpful.  We were not able to fix it on the phone and Sharp had a tech at my house the next day and it now has no problems.  I took the advise of others' comments from Amazon about setting up the picture and it is beautiful.  I love the smart apps, so easy to use.  I did buy a Sharp sound bar so I would not have to have wires going everywhere, which is also great.  The next thing will be a wireless keyboard because I don't like taking the time with the remote, too much up and down putting in the letters.", "Date": "March 1, 2014"}, {"Title": "Great big TV", "Author": "bluraven", "ReviewID": "RTEVR2BL4GJ82", "Overall": "5.0", "Content": "Picture quality way surpassed my expectations with the color and clarity from a blu-ray that it can display so beautifully but I do notice one oval shaped shadow in the backlighting in the center of the screen but it's only noticeable in bright daylight panning scenes and most of the time I do not see it but it can be annoying when I do see it but you really have to be looking for it to see it.  Coming from a 55 to a 70 inch I was floored by the size.  The motion enhancement I actually really like and it makes everything look and move like real life to me, which I much prefer to looking at judder in a panning scene (which the motion enhancement also eliminates).  I like all the features it has but will never use them as I prefer external devices rather than built in apps any way.  Love that it has a quick on feature too, you turn it on and picture is displayed in less than two seconds with the logo disabled in the options.  Overall I am impressed by the quality for the price and am very happy I chose this one.", "Date": "January 7, 2014"}, {"Title": "The Best Deal of 2013 Holiday Seasaon", "Author": "David Huang", "ReviewID": "RNCVHX5V01KQB", "Overall": "4.0", "Content": "I was very Happy to make the adjustments in the settings to turn down the clearness of the picture so I don't have the \"soap opera\" look.  This was by far my best television purchase.  I love the internet smart search features that comes with this set, although I am struggling to utilize the web broswer I am sure I will get a custom to it.  Like earlier reviews the set has a lower than expected remote to pair up with this fantastic TV.  To those who are looking to buy this TV I suggest you buy the 80\" because once you sit in front of this set you will realize that it is not that big and wished you could have gone bigger.  Great TV no problems so far thanks to the tips from prior buyers who gave great advice.", "Date": "December 28, 2013"}, {"Title": "Great value if you don't mind the picture motion", "Author": "Chris", "ReviewID": "R3270E8DVIHGGP", "Overall": "4.0", "Content": "TV is an excellent value if the \"soap opera effect\" does not bother you. My husband did not notice but I was extremely bothered by the picture motion.  I tried another reviewers advice with the settings but it I still noticed it and called customer service.  The representative I spoke to stayed on the phone for around 30 mins talking through different fixes for the problem but when I was still dissatisfied they said they would send out one of their technicians to my house and have them set up the picture to where I like it free of charge (and they came in 2 business days).  Unfortunately I decided I cannot get used to the \"General Hospital\" images and am returning the TV.  After further research this is a common issue among LED tv's so I going to go back to a plasma.  I bumped up the score to 4 stars because of the excellent customer service given by Sharp, also Amazon was wonderful setting up the return.", "Date": "December 11, 2013"}, {"Title": "Non-Techie A- Review", "Author": "FAL", "ReviewID": "R14X03V3BRI13N", "Overall": "5.0", "Content": "Overall, this Wifi TV set is A-. Some apps do have some bugs,but the tv runs clear.PRICE-Sale $700-Open Box $500PROS-Very Clear Picture( A-), True Color, Deep Black, Sport 120Hz Friendly Motion-Built-In Sound is Very Good( B+ )when you adjust the setting.  Set Treble & Bass to Max. Turn ON ClearVoice, TrebleYou can improve sound with 2.1/5.1 speakers-Very Energy Efficient( A+ ) 65-180 Watts using Auto Brightness and Quick Start OFF-Easy to use(B-) and adjust without needing to read the manual-Integrated SmartTV( B- ) is fast enough, easy, and feature rich with Dual Core CPU.-IR Remote(A-) has 4 quick app launch buttons with Auto HDMI remote programming.-Boots up very fast on Quick Start ON and average speed if Q.S. OFF.NEUTRAL-Viewing angle(B-) is about 100 degrees or 5 people wide then it starts grey shifting colors-Anti-Ghost setting are semi-hard to find under Film Mode in Picture Setting-Limited Wifi Remote Phone App Support.  Get a Sony BR Player or WDTV Play.CONS/Easy Solutions for CONS-TV isn't ready set go. You have turn Film Mode down to below 2 and turn up sound settings.-TV Factory Settings are awful and use the picture setting tips to make setup easy.-Missing some online video apps like Amazon Prime. Get a Amazon Fire TV or other fast media boxes.-Youtube HD, USB port, DLNA player is buggy,but they do work.  Get a Sony BR Player or WDTV Play.BONUS-DLNA Player, Many Online Apps-Simple Gaming and Kids AppsPICTURE SETTING TIPS-Update the TV app firmware like Youtube HD(Chromecast)-Use Auto Picture Setting and adjust color/sharpness-Use 120hz/60hz NR and Film Mode OFF for SportsLow Cost Useful Accessories-$100 Amazon Fire TV, $50 WDTV Play,$75 Sony BR Player-$50 2.1 PC Speakers.  FREE Serviio or Plex Media Server PC App.-$16-65 Folding Wall Mount, $20 DIY Protective Shield for Kid's Flying Wii Stick", "Date": "April 18, 2014"}, {"Title": "Picture is A+ Sound is C-", "Author": "Steven Strozeski", "ReviewID": "R3JQLP7WYNRINE", "Overall": "4.0", "Content": "First off I know you buy a TV for picture quality so it gets an A+ from me on that.  You have to turn off some of the settings (Light Sensor for Sure!) to get a better picture, but once you do its nice.  The sound out of the speakers isn't that bad.  You can adjust the settings (Turning on some features) and I say it's better than expected. The big problem I'm having is on a sound delay. I continue to get a sound delay (Lip Sync) issues on regular DirecTV watching.  I haven’t been able to adjust my delay settings to sync up, because the issue isn’t consistent.  Change the channel and flip back and the system will be in sync again… for a while. :(", "Date": "March 30, 2014"}, {"Title": "Great TV for great price", "Author": "PGMS \"PGMS\"", "ReviewID": "R1C7SHY8K6BHWS", "Overall": "5.0", "Content": "Good picture, sharp. Only disappointment is HBO Go is not an available app. Do not bother with 3D or paying 100s more for other brands.", "Date": "July 4, 2013"}, {"Title": "Audio / Video SYNC issues - Using Direct HDMI from Comcast Cable BOX", "Author": "gradyfly", "ReviewID": "R1D3PFZFIBMEOU", "Overall": "2.0", "Content": "Picture is decent but not amazing...sports looks most clear so if you want it better than thepicture when LIVE Sports is playing, it's not going to happen.Speakers are weak at best -Smart Central is slow but works -LARGEST PROBLEM:  AUDIO / VIDEO sync SLIPS OUT and is REALLY annoying and it happens atleast 1 a month easy.THE FIX:  Go to MENU - picture settings and scroll down to bottom -MASTER RESET Y / N - Hit Y - It still saves your adjustments for whatever reason.It's that or COMCAST CHANNEL UP/ DOWN for about 20 minutes...Not the best, sorry Sharp 70'", "Date": "January 9, 2014"}, {"Title": "Disappointed", "Author": "G. Thoms", "ReviewID": "R1K5DIHKTAFVQX", "Overall": "2.0", "Content": "Bought this tv and I have had it for about 4 days now.  The picture is grainy and the colors are not vibrant as I would of expected.  I have tried tons of different settings, but none of them seem to work.  Maybe I got a bad T.V., but this is going back and I am going to pony out some more Money for another T.V. and hope I have better luck with it.  Amazon has been good about taking the TV back, only draw back is I gotta pay $65 dollars of the return shipping even though I am buying a more expensive TV from them.  Anyways, just my 2 cents of this set", "Date": "December 22, 2013"}, {"Title": "Nice TV", "Author": "A. R. St Jean \"ARS\"", "ReviewID": "RLE5P3NW9MMMK", "Overall": "4.0", "Content": "Everything about this tv is excellent except that the wifi connection is too weak to work. Contacted the Aqous people and they informed me that if the tv is not in the same room as the modem it may not work at all. (the tv is in an adjacent room about 20 feet away). All my other devices (Kindle, Wii, laptop)work fine even outside. I have a very fast broadband connection with a top of the line modem but it doesn't seem to matter.", "Date": "May 23, 2013"}, {"Title": "Lip Synch Problems Unfixable", "Author": "Robert Jones", "ReviewID": "R2F7Q78IZO1JZP", "Overall": "2.0", "Content": "I really wanted to like this TV.  Great brand with a long history in making LCD displays, great price, nice looking.  I have its little brother at my office so I already knew the UI.  But I don't watch movies at work, and I couldn't notice the problem with a delay between audio and video.  This is especially noticeable on the B's and M's on the speaking parts.I first noticed it on an external BluRay DVD player, which was brand new.  Then I tried a Roku and of course the internal smart TV.  Problems everywhere until I tried the X Box.  I used the component outputs from the X Box 360.  Hmmm.After reading the forums, they basically said to turn off all the video processing or put it into game mode to speed up the video decoding.  This did help, but it was still noticeable.  I thought about just using the X Box to relieve the CPU in the TV from decoding the HDMI, but component out s a dying technology.So, I took it back to the store where I bought it.  The crew was incredulous, so they set it up with a DVD player.  The process was painful, as it took them nearly 10 minutes.  Finally, they got it running and two of the three people from the store who were apparently just there for the entertainment of it all said - yep, I see it, and walked away.  The third guy gave me my full refund.My lessons learned.  A great display brand does not necessarily a great TV brand make.  Slow video processing on HDMI inputs can cause the audio to be decoded much quicker than the video, resulting in a lip synch problem.  Since most sources don't allow you to set a delay, you have to deal with the problem in the TV.Which is where my story ends.  I picked up a Samsung 6300 series in its place which does not exhibit the problem at all.  It even has a programmable audio delay.  Nice touch.  It also has Amazon Prime which the Sharp did not have, which is one of my favorite streaming sources.", "Date": "May 11, 2014"}, {"Title": "Love This TV", "Author": "mmmoritz", "ReviewID": "RUN7EX3G73DM2", "Overall": "5.0", "Content": "I ordered this TV via Amazon Prime.  I was a little anxious; I have never ordered a big ticket item via the web.  I have to tell you, Amazon has customer service down to a science.  What an exceptionally pleasant experience.  The shipping company, Pilot, worked with me to get the TV delivered two days early and their customer service rep and the delivery personal were all very polite and conscientious.  What a great experience!  The TV is absolutely awesome!  Great picture, Good sound.  All in all, a perfect purchase.", "Date": "May 4, 2014"}, {"Title": "Best TV I have ever owned and 5stars for value", "Author": "Jesse Muoio", "ReviewID": "RD756GZYXNRH", "Overall": "5.0", "Content": "The short and sweet! If you are looking for the best 60\" hdtv for under 1000$ you have found it.Out of the box the settings for picture and audio are bland but when you set them to your liking this set comes alive!I have owned it for over a month now and absolutely love it!", "Date": "April 22, 2014"}, {"Title": "Awesome Tv", "Author": "john e.manages", "ReviewID": "RZQLQ5HCW3QP1", "Overall": "5.0", "Content": "I'm Impressed! Great buy, exceptional product for the price, I'll highly recommend to anyone, only made one phone call to customer service for wifi setup, that's it.", "Date": "April 21, 2014"}, {"Title": "3rd Sharp Aquos HDTV, not disappointed as usual", "Author": "CincyAmazon", "ReviewID": "RR2XO06VU915O", "Overall": "4.0", "Content": "Great picture.  I watch a lot of sports, mainly basketball, football and golf.  I own a 240HZ Aquos as well and while the picture is slightly better on the 240, you really have to be looking for it and comparing fast action sports (like a golf ball in the air) side by side, not worth the extra $1,000 in my opinion.  The picture is excellent and the price can't be beat.  I bought and open box from Amazon Warehouse deals, the items was in pristine condition, other than coming in an Amazon box, I couldn't tell any difference from new and saved over $300.", "Date": "April 5, 2014"}, {"Title": "Great TV but!", "Author": "Mystic Rhythms", "ReviewID": "R1SN0J1N17VRP2", "Overall": "3.0", "Content": "I will never purchased a used or refurbished television again. This TV is great and love all the extra features but 3 months after using a small line appeared on the screen that is there all the time now  and since this is refurbished I'm stuck with it. Guess what ever happened to it before I got it wasn't really fixed so now it's my problem. Pleased with the low price I got it for but not the line that now appeared \"magically\"!It is a great TV but always buy NEW!", "Date": "March 6, 2014"}, {"Title": "So far so a great TV", "Author": "Chris R. Winters", "ReviewID": "RYSZ9SZIV898T", "Overall": "5.0", "Content": "I bought this TV after a lot of research, I was back and forth between plasma and LED.  I did not have any need for the 3D and decided the 240hz was not worth the money.  I am using this TV for a media room and so far I have no complaints.", "Date": "February 28, 2014"}, {"Title": "Sharp LC-60LE650 60\" LED HDTV is AMAZING!", "Author": "Richard Goulmassian", "ReviewID": "RJXURBIYCP28B", "Overall": "5.0", "Content": "The colors on my Sony 47\" HDTV look dead in comparison to the Sharp! Super rich colors, razor sharp resolution, and fantastic price from Amazon Warehousedeals - what more could you ask for!Just as a side note - I got this set from Amazon Warehousedeals and even though the description said that the set was used, I have yet to be able to find even a scratch anywhere on it! VERY happy with the purchase and the huge savings over buying it new!If you are looking for a 60\" HDTV, this is the one to get!", "Date": "February 27, 2014"}, {"Title": "Satisfied with Sharp Aquos LE650", "Author": "Kenneth Blumenthal", "ReviewID": "R1SUMJWD6IFLRY", "Overall": "4.0", "Content": "Bought this to upgrade my family room TV from a 47 inch Toshiba.  I am generally very satisfied with this TV.  The virtual mouse is virtually useless, so I connected a USB wireless keyboard and mouse that are much easier to use.  The web browser seems quirky, but usable.  It took me a bit of tweaking to adjust the picture to my liking.  Picture adjustment is complicated due to certain menu items changing settings made on other menu selections.  I guess it's just a matter of learning this particular TV operation.  I like the automatic firmware update feature.  Setting up this TV to connect to my home network was easy, and I like the way I can view all my photos with background music of my choosing.  I find the picture quality is inconsistent from program to program and channel to channel, but after optimizing my settings of brightness, contrast, back light, and color, I am relatively satisfied.  Also it helps to get used to this picture for a week or two.  It is certainly capable of better 1080 i or p HD picture quality than my two year old 47 inch Toshiba, but perhaps not as good with lower resolutions.  I almost regret not getting a smaller size 50 or 55 inch since I view from about 10 feet away and 60 inch screen might be too big.  Handle with care to avoid introducing light bleed from edge lights.Forgot to mention that sound is better than every other flat screen I have owned over the last ten years though it is not great.  One thing I really dislike is that since I watch broadcast TV, this TV does not display start or stop times of programs, and it does not display program information or following program schedule.  Also the various \"stretch\" modes of viewing give very strange distortions when the screen image pans horizontally.  Without using these stretch modes, the picture sometimes shows a top edge that is very annoying.  There is no vertical centering adjustment.", "Date": "February 12, 2014"}, {"Title": "beautiful picture, good buy", "Author": "Lauren", "ReviewID": "R250QI38NX3ZOF", "Overall": "5.0", "Content": "All the reviews about the soap opera effect were helpful, very easy to turn off, no problems. Happy about my purchase!", "Date": "February 8, 2014"}, {"Title": "Really good no frills TV.", "Author": "Kal", "ReviewID": "R2K1BNPLYX0XEO", "Overall": "5.0", "Content": "I really enjoy this TV. When searching for a television I wanted one with the least amount of junk as possible. 60\" Minimum, Good screen and colors, and that's it really. I don't care for Ethernet, 3D, Apps, etc. This TV does include ethernet and apps but it lacks the expensive and in my opinion worthless 3D function which saves me a few hundred dollars. I do not watch much cable television and mostly stream shows or movies.This television has 4 HDMI and I use it as a multimedia TV for gaming or computer use via HDMI. I've owned it for 6 months and couldn't be happier.", "Date": "February 4, 2014"}, {"Title": "Love Love Love it!", "Author": "Ben", "ReviewID": "R1757DRECGMNQE", "Overall": "5.0", "Content": "This is my first flat screen and I have had absolutely no issues whatsoever in the first 30 days. I thought about mounting it but it looks just fine on my temp tv stand. The picture adjust itself to the light in the room and it has every feature you would expect in a modern TV. I suggest getting an HDMI cable right away for the best resolution. We watch alot more movies now and Xbox looks incredible too. The sound is pretty good from the TV but I do plan on getting a sound bar on advice from friends. No flaws that I can tell.", "Date": "January 27, 2014"}, {"Title": "Great Price and love The picture", "Author": "anthony caravantes", "ReviewID": "R3EV9RFYHGUE43", "Overall": "5.0", "Content": "TV is great and very happy with the picture quality, only one little thing is that some sports has the effect of a streak at times because of how fast the motion is and the processor is not fast enough of 120HZ, but really is not that noticeable. I am satisfied for being a 70\" flat screen and the price. The sound is not the greatest, but i have speakers and amp so it does not effect me.", "Date": "January 13, 2014"}, {"Title": "it is like you can step into the screen", "Author": "watchguy2007", "ReviewID": "R1ASPSNQD1O2W3", "Overall": "5.0", "Content": "This set has the best picture I have ever seen. In some shots it is like you can step into the screen and join the action -- honestly.  The viewing angle is generous so no worries there and the controls are pretty straight forward although there are more setting than most humans will ever use. The most worrisome aspect of this purchase was the though of receiving a 60 inch tv in pieces but the delivery was flawless.  All in all the best purchase in a long while.", "Date": "January 12, 2014"}, {"Title": "70 inches of nice picture", "Author": "Delaminator", "ReviewID": "R12V9Z0Y8NT2R1", "Overall": "4.0", "Content": "I'd give it 5 stars if it could play Amazon streaming videos, but it only has Netflix.The built-in DLNA app is slow and cumbersome. But the built-in TED app was an unexpected bonus, so those two cancel out.The audio is underwhelming, which is not really surprising for such a thin screen and narrow bezel. Bass demands bigger speakers that could possibly fit into something like this. But the picture is quite nice, and the remote and the menus are very user-friendly. It's nice that unused inputs can be disabled and skipped, so there's no flipping through unused inputs when changing from cable to video games to whatever else.Overall, I'm pleased.", "Date": "January 9, 2014"}, {"Title": "70 inch Sharp TV", "Author": "BOBBIE P.", "ReviewID": "R21DXJOBN8XID4", "Overall": "5.0", "Content": "Purchased for our 33 yr old son for Christmas. Outstanding TV for the money. Considered next one up but compared side by side could not justify expense. From order to delivery was outstanding.", "Date": "January 1, 2014"}, {"Title": "Great for the price", "Author": "AZ Music Fan \"Music Fan\"", "ReviewID": "RDO8APSF3YKKO", "Overall": "5.0", "Content": "This is a great tv for the price.  It is very easy to set up/use.  The picture quality is great.  I use surround sound/sound bar, so I am not sure about the sound quality.", "Date": "December 30, 2013"}, {"Title": "Not as good as my Sony", "Author": "Jim Palmer", "ReviewID": "R2INV148DC7Q0N", "Overall": "3.0", "Content": "Not as good as our 52\" Sony that is 4 years old.  And, it is not as good as our 42 inch Sharp that is 6 years old.  Picture is somewhat jerky, movement is just not perfect.  Seems to have difficulty with focus, however that may be in the camera and not in the TV.  But, when it is good, it is very good.  Added the Sony Sound Bar for a theater like listening experience.  I failed to get the TV at the lower price when I ordered; for the difference, I wish I had gotten the Sony with the DirecTV connect feature.", "Date": "December 24, 2013"}, {"Title": "fabulous tv", "Author": "david", "ReviewID": "R2LHI3GJ993EAR", "Overall": "5.0", "Content": "the sharp aquos led tv is the best sound and picture quality I could hope for.  Easy set up and operation.", "Date": "December 23, 2013"}, {"Title": "Great Value", "Author": "Tim", "ReviewID": "R2T2G019UHJHIM", "Overall": "5.0", "Content": "With so many good reviews already written about this TV, I'll keep mine as short as possible.I love the quality of the picture once it's properly adjusted. We found using the settings offered by CNET poster \"tpendlebury\" (Google \"Sharp LC-60LE650 picture settings\") worked the best for us, with the exception that we used Amazon reviewer John Saylers' advice and turned film mode on and then turned the advanced setting down to 0. After going through the picture adjustment process, everyone who's seen our new TV agrees that the picture is absolutely awesome.Sound on this TV is pretty bad, but I'm not gigging the rating for it because it's a problem with almost all slim design HD TVs. I bought Sony's HTCT260H Sound Bar with Wireless Subwoofer to go with the TV and the sound is absolutely amazing.One thing I really don't like is the remote. It's \"line of sight\" so anything placed in front of the TV will interfere with the remote's operation. Additionally, the remote has no QWERTY keyboard. I'm not gigging the star rating for this shortcoming because most similar TV's in this price range come with the same low tech remote.All things considered, we're very, very happy with our purchase.", "Date": "December 21, 2013"}, {"Title": "Great bargain price 60 inch tv!", "Author": "Brian Gartland", "ReviewID": "R1QMZEWWLPTHI4", "Overall": "4.0", "Content": "Great tv. If you update the tv software, the custom picture settings from cnet will not be correct.  Viewing angle is not as good as anticipated.", "Date": "November 30, 2013"}, {"Title": "Great TV", "Author": "John G.", "ReviewID": "R2HEFOOT9O34QV", "Overall": "5.0", "Content": "We love our TV.  We have had it now for a year.  It has a great picture and have had no problems with it.", "Date": "November 30, 2013"}, {"Title": "Pleased!", "Author": "CAT", "ReviewID": "R2WWNQEPGPELWY", "Overall": "5.0", "Content": "Not a tech geek so in laymen terms, great picture quality after removing the soap opera effect. Did not tweak with any other settings; only turned motion enhancement off and film mode to zero as advised by previous reviewers. Weak sound but I don't mind raising the volume to 50 or perhaps investing in a surround sound system later on. Speedy power on and off. Smart Central with wifi, apps and split screen capability (for tv and internet browsing at the same time) are a plus. Keep in mind, a 70 inch will visually spoil you and your family. You'll have a hard time re-adjusting to smaller tvs elsewhere. Video games are graphically stunning. I don't think my boyfriend will ever enjoy playing on any smaller screen. If you're planning on getting the 70 inch, just get the 80- what I wish I did. No regrets whatsoever though. A beautiful, consistent tv thus far and Amazon has probably the most competitive price. Paired it with Mount-It!'s Full Motion Swing Out Tilt and Swivel Articulating Dual Arm from Amazon as well. Installed professionally however (using Anthony's Professional Tv Mounting Service based out of NYC, Yelp-able). Shipping was quick and as scheduled. Arrived undamaged thankfully. Overall, very pleased.", "Date": "November 29, 2013"}, {"Title": "Fabulous detail on big screen", "Author": "Mark K. Goldstein", "ReviewID": "RCK6C210RJ3ET", "Overall": "5.0", "Content": "We replaced an LG 47\" and got this 60\" Sharp about 4 months ago.  Now sitting 11ft away is ok , We dont have to use our old Panny projector, After turning off motion enhancement and adjusting the brighness down a bit,  this Sharp is fabulous.", "Date": "November 19, 2013"}, {"Title": "Amazing, Amazing, Amazing!", "Author": "Richard P. Skagerberg \"Trooper TK-692\"", "ReviewID": "R3UKKK2GSLRW8O", "Overall": "4.0", "Content": "It gets the job done. It has a slight lean forward but that's easily fixed by propping something underneath it. While top heavy, whoever thought putting more of the base (behind) the tv was smart. Should be fired. I'd feel safer using the base if the front had more protection since it does lean that way more.Definitely worth the money, for how cheap it is.If I could mention anything, don't use for gaming if you don't use a Headset OR surround sound. Sound on this is not what you'd expect, too loud and you will discover sharp static.", "Date": "October 9, 2013"}, {"Title": "amazing", "Author": "lynn", "ReviewID": "R22E6PWKJE7TUU", "Overall": "5.0", "Content": "this tv is so amazing!!!! We switched from a 42\" tv, to this 70\" tv. What a difference. Now, we want one of these for the bedroom, because it makes all out other tvs look pitiful< I recommend this tv 100%", "Date": "September 28, 2013"}, {"Title": "Great TV.", "Author": "Richard H.", "ReviewID": "R2GCUHG85M6JHC", "Overall": "5.0", "Content": "I have had this TV for four months.  Clear picture and reliable product. Sound is weak as expected. Really love it.", "Date": "September 26, 2013"}, {"Title": "Sharp Aquos TV", "Author": "jt", "ReviewID": "R21TXX6ZDJ4FN0", "Overall": "5.0", "Content": "just as advertised. works perfectly . The picture is out of thsi world once you fine tune it. So many bells and whistles for the price. Like having a huge PC montor and I couldnt be more pleased. Shipped and arrived quickly", "Date": "September 4, 2013"}, {"Title": "Looks great!", "Author": "Robert L. Hamilton", "ReviewID": "R3TBNR6EB6E8UV", "Overall": "5.0", "Content": "Just received it a couple of weeks ago.  Looks great.  One thought for improvedment -- allow swivel to base for more flexibility.", "Date": "August 26, 2013"}, {"Title": "good price", "Author": "R. Collins", "ReviewID": "R3UNKWM1W2G0RI", "Overall": "4.0", "Content": "have been contemplating buying a sharp tv for a while;  works great and really good sharp picture; have some trouble getting on internet, but not TV's fault", "Date": "August 25, 2013"}, {"Title": "Great TV", "Author": "Rod", "ReviewID": "R6Q46HL8M7SG", "Overall": "4.0", "Content": "This is a great TV for the price. Very slim and fairly easy to use. I recommend this TV highly.", "Date": "August 19, 2013"}, {"Title": "We love our new TV!", "Author": "D. Coleman", "ReviewID": "R1XMVQJS2K2MN9", "Overall": "5.0", "Content": "We recently upgraded to this TV from a 42 inch old school plasma. It was a big decision for our family and we don't regret it one bit. The picture quality is amazing and it looks good on a credenza or hung on the wall. I took the advice of removing the soap opera effect (thank you to the previous reviewers) and it looks great, however by leaving that alone sports still look incredible. After researching several TVs it was between this and the Vizio. I know the Vizio is a great TV as well but we went with the Sharp Aquos based on reviews of reliability and access to customer service, if we ever need it. The smart TV features are neat - feels like home with the rest of our household technology (phones, tablets, etc.) I'm not a \"techy\" but can definitely say this is a good TV if you are on the fence about it.", "Date": "August 19, 2013"}, {"Title": "Solid Value", "Author": "Dalip Singh", "ReviewID": "R2B9JF2OM9OQ29", "Overall": "4.0", "Content": "Color accuracy appears a little saturated but consider it excellent for the price.  Would recommend to anyone looking for a reasonably valued, large SMART TV", "Date": "August 18, 2013"}, {"Title": "Perfect product !!!!", "Author": "oli", "ReviewID": "R1JPARHZDGVY7L", "Overall": "5.0", "Content": "Received my TV all the way in HAITI, everything was great , TV sound of TV is not the best but added a 9.1 LG surround and made it lol. Love it", "Date": "March 30, 2014"}, {"Title": "Great TV with room to improve.", "Author": "trevorj", "ReviewID": "R2MTUBY95W0XFN", "Overall": "4.0", "Content": "First I just want to say how great Amazon has been through this tv purchase. I was a little hesitant purchasing such a large item from anyone other then a local brick and mortar just in case there was something wrong. Well the first tv purchased arrived with a crack on the bottom plastic by the speaker. They sent out a replacement which arrived a week later. Unfortunately i noticed a narrow block of what appeared to be dead pixels along the side of the screen that was about an inch long. The second tv was replaced and received this one which is great. Through the process the price had dropped and they credited me that as well.As far as the actual tv I've owned it for several months now. For the most part I love this tv although there are a few hiccups. I think the picture quality is pretty good for such a large screen at this price point. You just have to be aware of what the actual source material is. The tv isn't a magician it's not going to make standard definition look spectacular. I do occasionally see a glimpse of the soap opera effect but it's not horrible over all. The screen is matte which does a great job of not reflecting the light in our living room. Our previous tv was a Samsung 55\" LCD which had a glass front panel and was horrible in the middle of the day to watch. The smart tv features are pretty basic but I wasn't really looking for that because we have a Apple TV and PS3. I actually was looking at the model below 550 but this was the same price and it had wi-fi to do any of the firmware upgrades. The one thing it's missing is Amazon Prime video which would make it great. I can't say much on the audio as I've only heard it through the tv speakers  few times but I'd suggest a surround system because it's a night a day difference. Overall glad I made this purchase and great experience.", "Date": "October 1, 2013"}, {"Title": "The Right TV", "Author": "Peggy L. Duckworth", "ReviewID": "R1ITNPFNMTY9EO", "Overall": "5.0", "Content": "Did a lot of research on LED HDTV's and narrowed it down to two but I really needed a matte screen since my room is flooded by daylight.  The Sharp was the best choice.  Great picture.  This is the second TV I've purchased from Amazon and I couldn't be any happier with their service.", "Date": "August 10, 2013"}, {"Title": "Samsung has nothing on Sharp", "Author": "Richard A. Porter", "ReviewID": "R3CQ0YZNEA954W", "Overall": "5.0", "Content": "Our new 70\" Sharp looks every bit as good as our old 46\" Samsung.  The Samsung goes in the bedroom.  The bedroom 40\" TCL goes in the guest room and the 32\" Phillips moves to my wife's office.  Diverse collection with all performing welI would recommend each depending on what size you need and what you want to do with it.  We only hooked up the Cable DVR and the Sony Blue Ray w/wifi to the Sharp--so we have not used the Wifi on the TV.  It's really just used as a monitor as we also have Onkyo 7.1 w/Procinema 800 system for sound.  The Onkyo amp is older and I would NOT recommend a new Onkyo amp.Update.  The old Onkyo was not up to the task.  We did use HDMI cabling but it was not pass thru so cabling was everywhere!..  We have replaced the amp w/Yamaha RX-v473 (yes it is an older model) but we have one cable to Sharp and everything else goes to the amp.", "Date": "August 10, 2013"}, {"Title": "Great Value, Great Features", "Author": "Bryan Geruntho", "ReviewID": "RC99HB9B0XC6T", "Overall": "5.0", "Content": "Have had it for 3 weeks so far...very satisfied.  Tons of features.  I'm using 20MPS cable modem, all smart features work great.  Blu-Rays look fantastic...follow others' instructions on getting rid of the SOE.  No idea about audio as I have it hooked to a full 7.2 sound set-up.  Built in browser is a little awkward to use, but that's not why I got the TV...I have enough devices for that.  If you're on the fence, I say go for it.", "Date": "May 1, 2013"}, {"Title": "Excellent TV for the money", "Author": "Macjoubert", "ReviewID": "R1U9N4KM69UXGX", "Overall": "5.0", "Content": "Got this TV over the weekend, and so far I am happy with my purchase.A few things that pop out.They dont mention this in the instructions, but you may have problems connecting to your WIFI based on your wireless router encryption. I painfully tried everything under the sun to finally get this working and not having to use the ungodly LAN cable.Basically the TV will connect only to WEP, WPA (TKIP encryption) and WPA2 (AES encryption). I played around the various modes until WPA2 worked. Problem with WEP is , with Verizon FIOS it dramatically reduces your speed 50% so you might want to be careful choosing this option.Customer service was okay but the only key word she said was AES , thats how I started localizing the problem until it was resolved.The TV itself is very sharp (no pun intended lol) and I especially liked the Movie picture setting, watching Game of Thrones has never been better, especially since you can see all the different terrains in fantastic splendor in the same show.Ill update through the year.", "Date": "May 6, 2013"}, {"Title": "I am not an expert but I think it is great", "Author": "Kira", "ReviewID": "R2BA8N63B5JU1B", "Overall": "5.0", "Content": "I have had the TV for a month or so now. It looks great to me. I don't like the normal mode which is much too bright for my tastes. Once it was changed to game mode though the flesh on people's faces looked much more normal.The TV weighs nothing at all and is easy to move around. The sound is awful, but I don't count that against the TV since it doesn't seem like any manufacturer puts decent sound in these LCD panels anymore.The apps that come with the TV are nice. I tried netflix for the first time because there is a netflix app on the TV. The web browser is kind of useless because using the remote as a keyboard will drive you crazy. Hooking it up to the internet was trivial.The TV seems like it has been there forever and is part of the house, so I guess that means that I like it so much I don't even think about it anymore!", "Date": "July 16, 2013"}, {"Title": "Excellent TV at a great price", "Author": "Eugene E Noyes", "ReviewID": "R3DYT3SC7G43S0", "Overall": "5.0", "Content": "Arrived 6 days ago via Pilot shipping.  The shippers did a great job, packaging show no damage and TV was in perfect condition out of the box.  The driver unboxed and tested the TV and the remote while I watched.  After I installed the small stand and placed the unit on the TV table and hooked up the set top box; we turned  it on a everything looked quite good.  I used the setting from the CNET review, made 1 small adjustment to the hue.... and WOW - it has and outstanding picture.OTHER:  Amazon lowered the price $65 after the TV shipped and when I called for a price match I request was handled prompted and I left the call a happy guy.If anything changes in the next 30 days or so I'll amend this review, ut right now I could not be more pleased.", "Date": "June 5, 2013"}, {"Title": "great at first", "Author": "Greg Miller", "ReviewID": "R1OMO3CAQQKIXC", "Overall": "1.0", "Content": "When I first bought this TV I loved it, sound was a little inconsistent, but other than that VB pretty good. After owning just under two years pixels started burning out. If.bb you did not buy extended warranty, you might as well throw away and buy new according to sharp. It is the last sharp product I will ever buy.", "Date": "January 15, 2014"}, {"Title": "Great 70\" TV", "Author": "luetk01", "ReviewID": "R1U13VTDR8TZMD", "Overall": "4.0", "Content": "Picture is amazing (once you turn off the automotion feature) and movies/sports look great on the tv. Sound wasn't great but didn't matter to me because I hooked it up to a soundbar. My only compliant is that the wifi feature doesn't work the best. I think the wifi from my other devices (PS3 and bluray) interfere with it, which the manual does say is possible. I haven't tried disabling those, but I don't really plan on using the internet features much.", "Date": "June 7, 2013"}, {"Title": "Great TV for the Price!", "Author": "WORKOUT JUNKY", "ReviewID": "R10ZDKZOS0O28E", "Overall": "5.0", "Content": "This is the 3rd Sharp I have in my house.  They all have great picture quality.  I see there are some reviews on here that claim the picture quality is poor.  I seriously have no idea what they are talking about, another thing to keep in mind is that some cable providers make you purchase HI Def channels, (DISH is one of them) if this is the case then the TV wont display in Hi Def.  Another thing to keep in mind, I have DISH and only the TV the is directly connected to the box will get the Hi Def, the other TV will not since the box controls 2 TVs.  I am just putting this out there for people to keep in mind when it comes to the other reviews, because the picture quality could be circumstantial, or they are TV snobs.... If you are not picky, and just want a quality picture without paying a higher price for like with Samsung or LG.... and get the smart TV option for less, go with Sharp.", "Date": "May 24, 2013"}, {"Title": "Audio and Video is out of sync.", "Author": "A. McGonigle", "ReviewID": "RT5PM6Q8G6SKC", "Overall": "5.0", "Content": "I purchased this TV less than a week ago.  The audio has about a 1 or 2 second delay behind the video.  I didn't want to go through the hassle of returning it immediately, so I contacted Sharp customer service.  They took me though the process of resetting the TV (which takes two people).  A couple of hours later I noticed the same thing happening again.  I gave this an extra star because the problem is intermittent and only happens for a short time before it corrects itself. I'm going to return it and buy a Vizio along with a 5 year warranty for the same price.  After reading reviews on these large screen LEDs I've come to find out that this issue is not exclusive to Sharp TVs.Update...I did purchase the Vizio as stated above and am now having the same problem.  Therefore I changed my review to 5 stars because the issue is not with the TV.  I'm still trying to determine what the cause is.", "Date": "May 1, 2013"}, {"Title": "Made Wife Happy", "Author": "K. Schultz \"Grandpa\"", "ReviewID": "RZOVCEP26X88I", "Overall": "5.0", "Content": "She can see the fine print on the screen now - I do not have to tell her what the scroll on the bottom is reading.", "Date": "March 29, 2014"}, {"Title": "Fantastic at any price unbeatable at what I paid", "Author": "Stephen O. Huntley Jr.", "ReviewID": "R126O5NH46YADP", "Overall": "5.0", "Content": "I bought this TV a few months ago and wanted to use it enough to review it fairly. I is a wonderful TV clear picture very clear 120hz is more than enough today. I have mine hooked up to multiple inputs xbox one, xbox 360, cable, bluray all look stunning, almost not motion blur even during fast pace gaming.", "Date": "March 16, 2014"}, {"Title": "Dissapointed", "Author": "joesupra", "ReviewID": "R1389XZG37JEAV", "Overall": "2.0", "Content": "I purchased this TV based on the reviews and the price for a set this large. Unfortunately the sharpness (no pun intended) or clarity of the picture when compared to my four year old 55 inch Samsung is obvious. The best way to describe it it inconsistent. Sometimes the picture looks better then other times. It's almost as if I'm willing myself to believe the picture is as rich as the Samsung when I know it's not. Sometime cheap is expensive as I will be stuck with this TV for a while. Spend the extra bucks go for a Sansung or Sony. Even my LG in the lanai is better then the Sharp.", "Date": "January 28, 2014"}, {"Title": "BEST TV ON THE MARKET. JUST DONT BUY IT FROM", "Author": "glenn frerker", "ReviewID": "R31TRPRTXC45S0", "Overall": "5.0", "Content": "After previously buying the 80 inch from local retailer. I looked around to find this 60 for the best price for in our sunroom. after checking around I found them cheaper then amazon, but decided to order from them because I thought they were more trusted. The picture is amazing and clear, and this tv is fairly easy to navigate. setup was no problem as directions get you up and running in no time. I love sharp tvs and will only buy them. However, I will not be trusting amazon for any more purchases. I was guaranteed a delivery of December 6th, after not hearing from delivery company I called them to find out that amazon didn't ship it as promised and it wouldn't even get to the local warehouse until late December 6th. If this is what they do with their guarantee shipping date I will not be buying from them ever again. Great tv. just don't buy it from here", "Date": "January 3, 2014"}, {"Title": "great TV, but where is the user guide for the remote?", "Author": "auroragb", "ReviewID": "R23KDJCNECIMOO", "Overall": "3.0", "Content": "The picture is excellent on this TV. I got this TV Friday and was able to set it up pretty quickly. The manual didn't give too much information. My biggest frustration is that this comes with a universal remote, but the remote doesn't have a users guide. So, the remote is useless except for controlling the TV. This is extremely annoying. Would have been at least a 4 star or 5 star otherwiseWith regards to sound, maybe I'm just not an audiophile or maybe my media doesn't have extreme demand on dynamic range, but it sounds just fine to me. Volume level is fine and not tinny. While I have heard better, but it serves fine for TV watching. To be fair, bass is a bit weak, but I'm not expecting TV speakers to shake the floor. So, I guess if you like watching a lot of action movies, be prepared to buy dedicated speakers. But that's kind of obvious, isn't it?", "Date": "November 9, 2013"}, {"Title": "Great TV", "Author": "CC", "ReviewID": "R1H1C21X11UIE5", "Overall": "4.0", "Content": "Great Customer Service. I had a miscommunication with the delivery time/date and the company was quick to resolve the problem  much to my delight.  I would order again from this supplier.  TV came in perfect condition and was exactly what I had hoped for!  Great picture and quality.", "Date": "July 29, 2013"}, {"Title": "Very Smooth Delivery from Amazon", "Author": "ESVK \"SVK\"", "ReviewID": "RZ7B5Z0UIMKYS", "Overall": "5.0", "Content": "I am an avid Amazon shopper, but I was a little hesitant to buy such a large electronic piece via freight shipping.  But, I decided to give Amazon a try and everything went very smoothly.  I am a prime member and could have had the TV in two days, but I elected to set up a time later in the week when I knew someone would be home.  The freight company showed up with the TV at the very start of the 3 hour window and brought the unit all the way into the house.  They also called me about 20 mins beforehand to let me know they were on the way.The TV is great.  I had viewed it at a Costco before I purchased it so I had an idea as to what I was getting.  The unit weighs about 100 lbs and my wife was actually able to help me lift it onto the stand temporarily.  I then bought a retractable mount and put it on the wall.  It really isn't that hard to do and you can DIY with the weight of this TV if you have someone to help you.  Also, I highly recommend getting a retractable mount - even though they are a little more expensive.  Mount-It! LCD TV, LED TV Wall Mount Bracket with Full Motion Swing Out Tilt & Swivel Articulating Dual Arm for Flat Screen Flat Panel LCD LED Plasma TV and Monitor Displays That way you can easily pull it out from the wall to get at the connections in the future.", "Date": "July 5, 2013"}, {"Title": "picture problems already", "Author": "Charles Mccollin", "ReviewID": "R1BQC0N740JW31", "Overall": "2.0", "Content": "the sharp aquos picture is just fine....my problem is with the manufacturer........the tv developed white spots on the screen about 4 months after purchase.....sharp has agreed to replace the tv.........problem is they dont have one in stock to give me.....i have been waiting for about a month now and they tell me they cant find a set to give me.....almost comical except for the fact im watching a tv with white spots all over screen.......before this issue i must say the picture itself is great....its just very slow customer service....getting frustrated....dont know if i will be a return customer with sharp...they are not taking care of problem in a timely manner", "Date": "June 5, 2014"}, {"Title": "Awesome TV!", "Author": "Pili115", "ReviewID": "R14G38E0IKDX2Y", "Overall": "4.0", "Content": "We purchased the 60\" TV. The delivery and set up was very easy. Delivery was earlier than scheduled as they were in the area and called me to find out if they could deliver early in the day.The only issue is the sound from the TV is very low but we have surround sound so this was fixable.Easy to change the display and AV settings. Great product for a reasonable price. I highly recommend.", "Date": "June 2, 2014"}, {"Title": "Great buy I think", "Author": "Steve H.", "ReviewID": "RUJCMAD0YCR07", "Overall": "5.0", "Content": "This tv is everything we expected.  Has great  color, we have no problems owning this tv.  I think was a good choice for the price.", "Date": "May 29, 2014"}, {"Title": "Wonderful Picture", "Author": "Jeremy Rhett Howell", "ReviewID": "R1Y2K2E0OIPJCV", "Overall": "4.0", "Content": "I would give five stars if the sound quality was better. Had to buy a sound bar to keep up the TV I replaced.", "Date": "May 28, 2014"}, {"Title": "Great TV", "Author": "STEVE V \"TRAFFIC\"", "ReviewID": "R2GU6A2O0Y416H", "Overall": "5.0", "Content": "Easy to set up. Amazon delivery person brought it in, set it up, and made sure it worked properly before leaving. The screen is bright and vivid. No problems with it and I've had it for almost a year. Very pleased with it.", "Date": "May 24, 2014"}, {"Title": "Great value", "Author": "Thomas Dungan", "ReviewID": "R29G4BRYY7WY7S", "Overall": "5.0", "Content": "Huge TV for a very reasonable price.  It has a very sharp picture and only took minutes to set up.", "Date": "May 23, 2014"}, {"Title": "WOW!!!", "Author": "Demetrio O.", "ReviewID": "R3IMRTSA4UJOUU", "Overall": "5.0", "Content": "This TV is the bomb...my room is now a movie theater!!!...all I need is surround sound and im all set", "Date": "May 16, 2014"}, {"Title": "I would definitely recommend", "Author": "Montalguy", "ReviewID": "R2ENV6R5ASH0SJ", "Overall": "5.0", "Content": "When my old projection television died, I had no idea what to buy.  I knew nothing about the new generation of HD televisions.  So, as always, I went to Amazon.  This television popped up at the top of my choices.  Being a smart shopper I had already done some research on pricing at the Clubs and other big box retailers.  I didn't even know what a Smart TV was.  I took a chance on this Sharp and couldn't be happier.  It has features that I never expected, including the ability to connect to my wireless network and built in Netflix.  The manual is on the screen.  There are minor things here and there that I would tweak if I could, but nothing significant.  Mostly I am dazzled by the HD picture.", "Date": "May 15, 2014"}, {"Title": "HAPPY HUNTER", "Author": "DONNA D'AMICO", "ReviewID": "R15WBXKSAZ7W8O", "Overall": "5.0", "Content": "MY HUSBAND IS THRILLED WITH THE FACT THAT HE CAN HUNT THROUGH THE CHANNELS AND ACTUALLY SEES AND CAN READ EVERYTHING ON T.V. WHILE HE LAYS ON HIS BACK.  GREAT TV. EXCELLENT PICTURE, VERY CLEAR YOU CAN SEE SCARS AND PIMPLES ON SOME OF THE FACES. FITS WELL WITH OUR DECOR.  WE ARE HAPPY WITH OUR PURCHASE", "Date": "May 12, 2014"}, {"Title": "Great TV", "Author": "Q. Jurin", "ReviewID": "R187U2TH0U1LW4", "Overall": "4.0", "Content": "After extensive research, I finally settled on this TV. The reviews were good, and I was very excited to receive this thing.When the TV finally arrived, I eagerly unpacked the TV from the box and began to set everything up. I couldn't wait to turn it on. It was beautiful out of the box--I was sure it would be spectacular once displaying its picture. So I'm setting everything up and get to the part where I need to arrange the stand. I get the metal pieces that connect the base to the TV, and realize I don't see the screws that fasten those plates to the TV. I check the box again. I check all the styrofoam pieces. I check the floor. I check everywhere. But no screws. Since I wasn't going to wall mount the TV, the stand was my only option, so I was stuck with no TV, and really nowhere to put the 70\" screen.Frustrated, I called the Aquos product support, and they quickly rogered up to sending the screws. Now, after spending all this money on a TV, I expected to hear \"our fault, so sorry, these are coming to you overnight, you should see them tomorrow.\" Instead, when I inquired how they were being shipped, I was told normal ground. I almost blew my top, but calmly asked to speak to a supervisor. I wound up having to call back and waste a day. When I finally did speak to a supervisor, she quickly agreed to overnight the screws. So, I'm taking a star off for hit and miss product support, and lack of screws in the first place. To the guy or girl whose job it is to get those screws in the boxes--dude, you had ONE JOB TO DO!The TV itself, once I finally got it secured to the stand (a two-person job, is awesome. There was some motion jitter at first during sports and scene panning, but we got used to it. After making the setting adjustments to get rid of the soap opera effect, we have completely enjoyed the TV. Sadly enough, one of the features that tipped the balance for me between this and other contenders--the ability to use the TV like a digital picture frame--is a feature that my wife will not let me use, since she doesn't want people looking through our window while we're not home and realizing we have a nice TV. Come on!Anyway, my only other minor complaints are the sound (adequate, but not great, but we expected that since it's a well-known issue), and the clunkiness of the web interface. Not much you can do about that, though. Bottom line: Love the TV and would absolutely recommend it.", "Date": "May 10, 2014"}, {"Title": "pretty nice for the price", "Author": "Luz E. Soto", "ReviewID": "R3HGSXBXA5Z75K", "Overall": "5.0", "Content": "The quality pictures i pretty good for the price. The apps and internet service, is really good. I love because he accept all video formats. The size of the screen is perfect for my family room. The only issue what i have with all LED is when on some movies or tv series the quality of image is extremely good and sometimes you can see some errors and mistake on movies and tv series, this specific effect i don't like, but on sport is awesome!! I love it..", "Date": "May 8, 2014"}, {"Title": "Liquid crystal", "Author": "Lawrence A Ribbron", "ReviewID": "R3LTSGI7XWMN9R", "Overall": "5.0", "Content": "I never seen liquid crystal before. It is very clear and it arrived with no damage. It was easy to assemble and sometime I can tell it is a liquid.", "Date": "May 4, 2014"}, {"Title": "Great Quality", "Author": "MN", "ReviewID": "R32PCDUJTA43VR", "Overall": "5.0", "Content": "Love our new 70 inch TV. Great picture and features. I do recommend getting a sound bar but not necessary depending on size of your space. There are several Youtube videos on line by Sharp that explain how to setup your settings including internet/wifi. Overall great initial quality and product.", "Date": "May 4, 2014"}, {"Title": "Picture and sound reset every hour or so", "Author": "Kristen Ecklund", "ReviewID": "R3Q5VNBTH4S50L", "Overall": "3.0", "Content": "The first tv we ordered came damaged by the shipper so we had to send it back.Second tv came, set up was not that great, very complicated for a smart tv.  We can't use an optical cable with the sound bar we have, actually we can use the Samsung and had to stop using it all together we just could not get them to work together.The picture is excellent, sound ehhhhh, not great. The picture setting are very dark so darker shows and movies are very difficult to watch, still configuring those settings.The TV picture goes out ever hour or so, sound drops first, then 3 seconds later the picture goes black, the Sharp logo shows up and all goes back to normal.  It's unfortunate that we've learned to tolerate it.  If anyone has any idea what that is, by all means comment.As with other tvs the soap opera effect takes some getting used to, but can be adjusted.  Overall a decent tv, not sure i would buy a Sharp ever again. Way too much hassle compared to previous TVs (Phillips, Sony).", "Date": "May 2, 2014"}, {"Title": "Great bang for the buck", "Author": "Island Tractor", "ReviewID": "R2SVPNU3KBPDF1", "Overall": "5.0", "Content": "Yes, there are Samsung models that are better but they cost at least $500 more.  This TV is excellent generally and a superb bang for the buck (well under a grand from a major warehouse store).  Setup was easy though there could have been better instructions on setting up wifi/internet (use the manual mode).  Picture quality is excellent though I did note that more expensive Samsungs had even better picture quality when displayed side by side with this set but at home it is perfectly excellent.  Way better than my 5yo Sony.  No disappointment at all with picture quality.  I'm not so impressed with the \"smart\" features although they do work.  I will probably end up getting an Amazon Fire to take advantage of Prime material anyways so don't expect to use the native smart features anyway.Again, there are smarter and better sets out there (mostly Samsung models) but none of those comes close to this set in bang for the buck.", "Date": "May 2, 2014"}, {"Title": "Great tv", "Author": "Steven P. Tenebruso", "ReviewID": "R3VLH9BAXTOY8V", "Overall": "5.0", "Content": "No complaints what so ever. One of the best rated led's of 2013 through various test sites and shows y.", "Date": "April 26, 2014"}, {"Title": "Great picture, poor digital out capabilities", "Author": "Tony Clark", "ReviewID": "R15KHCMLRSWZOI", "Overall": "4.0", "Content": "We bought this TV when it was on sale for $999.00.  This was to replace our old 42\" plasma TV.  The picture is amazing.  The TV is very lightweight and thin and even though I doubtfully will use the Smart TV features, since this was the same price as the non-smart TV, I opted for this one.  I have a Bose 3-2-1 surround and along with this TV I have an XBox 360 and a Playstation 3 hooked up to it.  The PS3 is my BluRay player as much as my main gaming system. I also have DirecTV.  With my old TV I had my PS3 hooked up to my digital audio input of my Bose so I could watch BluRay disks in surround sound.  Everything else was hooked up stereo since there is only 1 digital input on the Bose.  This Sharp TV has a digital out as well, and according to the documentation you can hook up all of your external devices to it via HDMI and then use the digital audio out to your surround sound system.  I did this only to discover that Sharp, as well as most other TV manufacturers, do not send Dolby Digital signals out of the digital output of the TV if the signal comes from an external source (such as the HDMI input from DirecTV).  This completely defeats the purpose of having a digital audio out.  I believe Vizio, Sony and Toshiba TV's will pass the Dolby Digital signal through their digital audio out, but Sharp does not.  At least not on this TV.The other thing I discovered is that it also will not pass the Dolby Digital out from external sources from their Smart TV offerings such as Netflix and Hulu.  Again, completely defeats the purpose of having a digital output.  So unless I am capturing HD video and audio over the air and sending it through the digital output of this TV, the best audio I'll get is PCM 2.0.  Looks like I have to hook the PS3 back up to the Digital input of my Bose system and go back to using stereo connections from the Xbox, DirecTV, etc.This is really the only negative thing I could say about the TV, which is why I gave it 4 out of 5 stars.", "Date": "April 25, 2014"}, {"Title": "Buy it !!!", "Author": "Paul Despres", "ReviewID": "R20YTQE9AP3LNE", "Overall": "4.0", "Content": "Buy it !!!We love this TV.  For the price there's nothing better. The picture is outstanding once you configure your way out of the weird Soap Opera Effect.We found the delivered apps sufficient for all we need to do.", "Date": "April 23, 2014"}, {"Title": "Blow me away", "Author": "Thomas", "ReviewID": "RWGVFNX02DJAR", "Overall": "5.0", "Content": "It... Looks... AMAZING! I can not believe how good this TV looks! I got it for the family as A gift and it is worth every Penny.The shipping was good. They came A bit early but that was fine. They put it in the room I wanted (they will not set it up but its not very heavy with 2 guys and its very easy to put the stand on.) They unboxed it and plugged it in to show it got power. plus they where very fast to. In and out in no time.There was one hiccup thoe when trying to update it to use youtube and netflix it locked up and I had to unplug it which it says not to do as its updating. but it was not to big a deal you then need to mess with some of the reset settings to re-update it. But then on its been great. Nothing wrong with it.", "Date": "April 17, 2014"}, {"Title": "Everything You Expect", "Author": "Allan Anthony", "ReviewID": "R163H63UJUH1AV", "Overall": "5.0", "Content": "I'm been totally happy and didn't have to change any settings.Big. Pretty.  Nice.I would suggest an external \"sound bar\" if you have a living room.Decent sound, but surround would be better.", "Date": "April 16, 2014"}, {"Title": "Great television. Great price!", "Author": "Blake Wilson", "ReviewID": "R2DUTSSHHVOOLL", "Overall": "5.0", "Content": "This is a great television. I've had it for almost a month and I can say I love it. I don't think the sound is all that great by itself but we make due. The picture is great. The interface is great. I only wish it had the option to view amazon prime on the tv.", "Date": "April 13, 2014"}, {"Title": "Sharp LC 60LE650U", "Author": "B. Hargrett", "ReviewID": "R2BLWN9WDWB07Y", "Overall": "5.0", "Content": "We have been nothing but pleased with this television. We had a little difficulty with the wireless keyboard and mouse that we purchased to use with it. Seems it would not recognize the mouse. However about 3 days ago there were some upgrades and \"shazam\" the mouse began to be recognized. We have been extremely happy ever since.", "Date": "April 11, 2014"}, {"Title": "Just what the doctor ordered", "Author": "Al Grotewold", "ReviewID": "R3EKGU90UQWA0P", "Overall": "5.0", "Content": "This set far exceeded my expectations.  It is without a doubt the most bang for the buck you can buy.  Got mine for $1499 delivered from Amazon with the shipper putting the TV where I wanted it in my basement.  Like others, I've turned off all motion enhancements and am very happy with the set for sports events.  I have a 7.1 surround system I'm using with the set, so I don't care that the TV has crappy audio quality.  The fact this Sharp set has less smart features than others models was a plus for me - less to go wrong.", "Date": "April 10, 2014"}, {"Title": "Awesome TV/Awesome Price!", "Author": "Kevin David Wyatt", "ReviewID": "R299G2U2JKR0MJ", "Overall": "5.0", "Content": "I was reading the mixed reviews on this and a couple other TVs. I ended up buying this because for the price, it's a steal! It has everything you want from a smart tv and more. I love that I can stream movies off my HDD right into the tv via the network.", "Date": "April 10, 2014"}, {"Title": "Great picture for it size!!!!", "Author": "Timothy M Margetich", "ReviewID": "R3DC9V82SMT8OE", "Overall": "4.0", "Content": "The tv came in on time. I had a little difficulty putting the stand on the tv. Better directions would have helped. The netflex option was hard to get set up but it works well now. You need a strong router signal to access the netflex options. The picture was great, like being right there in the movie or sporting event.", "Date": "March 20, 2014"}, {"Title": "excellent tv", "Author": "G. Johnson", "ReviewID": "R1E79G9U552CFU", "Overall": "5.0", "Content": "This is my 4th Sharp TV. Each one has been rock solid reliable with an excellent picture.  This one is no exception.  While most slim tv's have substandard sound, I find Sharp sound better than most.", "Date": "March 20, 2014"}, {"Title": "No complaints", "Author": "David A Thomas", "ReviewID": "R1RFKWJ7RHBO2W", "Overall": "5.0", "Content": "This TV was a big upgrade from my old rear projection television. I'm not super up to date on the latest TV's and features, but this one looks beautiful and was just the right price.", "Date": "March 18, 2014"}, {"Title": "Cant beat the price.", "Author": "Bob", "ReviewID": "R2TYIFE492XNT7", "Overall": "5.0", "Content": "As all the reviews say make the adjustment to get rid of the ghosting. I must be getting old because I don't the sound is all that bad. Picture is great, and I am three months into this thing and not a single problem.", "Date": "March 16, 2014"}, {"Title": "Picture", "Author": "Bandit007788", "ReviewID": "RF0MMVRG8MYOF", "Overall": "5.0", "Content": "Had this tv calibrated from best buy service tech. Made a huge difference would recommend doing this . Now have the wow factor on my tv", "Date": "March 14, 2014"}, {"Title": "Great TV for the money", "Author": "Mountain Momma", "ReviewID": "R4AQR4JIR5FI", "Overall": "4.0", "Content": "The TV has a very good picture and a lot of features of a much higher priced unit.  My biggest complaint as with other reviews is the sound, it really needs some type of additional sound system to make it bearable.  Also refer to prior review for soap opera effect, it works.", "Date": "March 12, 2014"}, {"Title": "Awesome Picture", "Author": "G. A. Long \"Music Lover\"", "ReviewID": "R1BRM5QWBGU05X", "Overall": "5.0", "Content": "I love this TV! The picture quality could not be any better. Hooked the tv up to my surround sound and love it!!", "Date": "March 12, 2014"}, {"Title": "Great picture and size for the money, but be ready to tune in picture settings.", "Author": "Chris Sporrer", "ReviewID": "R3SDW5DWUTRWG2", "Overall": "4.0", "Content": "The picture is crisp and clear. Settings are easy to navigate and the Smart TV apps work pretty fast. Out of the box, the colors seemed dim and kind of washed out. This was easilly fixed with some picture settings tuning. Its not as bright as a Samsung LED, but for movies and a dark room, this is a good thing.", "Date": "March 11, 2014"}, {"Title": "Lucky Me", "Author": "Gary", "ReviewID": "R2T8QAZYY2G9F9", "Overall": "5.0", "Content": "Sharp still has the best electronics anywhere and this TV is way super cool and I am such a happy camper. Best buy around.", "Date": "March 7, 2014"}, {"Title": "Good tv with lots of features", "Author": "Sven Zethelius", "ReviewID": "R3P75G07FWXD7P", "Overall": "5.0", "Content": "I've been happy with this TV since I bought it.  I bought it for the good picture quality and the network features.  Sharp was one of the only manufactures that published the IP control protocols (the codes used by mobile apps, etc) in the TV's manual, so no hunting on the internet to find obscure codes that might work.  Youtube and Netflix work well, especially compared to my Pioneer BluRay player which makes those services feel slow and clunky.  I've had technical difficulties getting HDMI audio return channel working with my receiver.  If that worked, my bluray player would probably be getting craigslist'ed.", "Date": "February 24, 2014"}, {"Title": "Fantastic Television", "Author": "R Carr", "ReviewID": "RS7EWMIBLBYOF", "Overall": "5.0", "Content": "This is a fantastic television, excellent picture great size. I could not be happier with my choice, and that I got for three hundred dollars less than my other friends bought it for.", "Date": "February 17, 2014"}, {"Title": "just magnificent!", "Author": "Sean Best", "ReviewID": "RBGKDZ3XYD9XW", "Overall": "5.0", "Content": "This product exceeds my expectations. I am so comfortable and happy with it that I am anxiously awaiting the start of the 2014 fifa world cup", "Date": "February 6, 2014"}, {"Title": "I'd purchase again.", "Author": "Jacquelynn Harris", "ReviewID": "R2W2ZL1P42UK6X", "Overall": "5.0", "Content": "Love this TV great price. Would like a qwerty keyboard remote. I have it mounted on a swivel tv stand in the wall it works great and it very light.", "Date": "February 4, 2014"}, {"Title": "Great except for viewing in a bright room.", "Author": "Barbara \"a book lover\"", "ReviewID": "R2AKIUC94YRHCN", "Overall": "3.0", "Content": "A great delivery experience.  The TV has a great picture and I love the Netflix option.  I bought the Sony sound bar which enhances the viewing experience.  My only complaint, and a big one considering how bright the room is where it sits, is side viewing not good and lots of reflection.  I had a Samsung previously in its place which was much better.  He it been the same price at the time, I would have gone with the Samsung.", "Date": "January 26, 2014"}, {"Title": "Very Nice, Excellent Picture, Great Design, Nice Looking TV", "Author": "Todd V. Evans", "ReviewID": "R14C9MH8Y8IUEG", "Overall": "5.0", "Content": "Picture quality is excellent, nice looking cabinet.  Many inputs and wifi is working great.  Was going to go with Samsung but decided to go with the Sharp as it was $400 less.  Couldn't be happier, will probably get another for the basement.", "Date": "January 19, 2014"}, {"Title": "Hated it at first, but then once you figure out how to fix the display", "Author": "R.N. \"Stigmata\"", "ReviewID": "R25C0XWBE0PLX7", "Overall": "5.0", "Content": "Several other reviews mention the soap opera affect. It's like watching a home movie almost.  These TVs must be preset to display that way, and it's terribly annoying.  I was ready to call customer support but decided to read the reviews on Amazon.  They were very helpful in explaining the problem and how to fix it. Once I did that, I love the picture.  Took a little bit of time getting the TV - it was late on delivery, but Amazon's excellent customer service made up for it.", "Date": "January 17, 2014"}, {"Title": "Great TV", "Author": "EYE FOR DESIGN", "ReviewID": "R1WXK10EBOEGRA", "Overall": "5.0", "Content": "this is a great TV.  i now have 3 of them.  two in the office and one at home and could not be happier.  the only downfall i have found is that they just dont put out much sound.", "Date": "January 17, 2014"}, {"Title": "Great Quality!!!", "Author": "Jane Kreymerman", "ReviewID": "R320U1FJQGQUKA", "Overall": "5.0", "Content": "This TV has great quality, depending on the view mode you prefer it can be life like, vibrant, soap opera style, or just like a movie theater. Smart TV capabilities are fun to play with and easy to use.Truly recommend this TV.", "Date": "January 16, 2014"}, {"Title": "It's an OK LED HDTV...Probably 3.5 stars", "Author": "Mikey B. \"Mike\"", "ReviewID": "R30YZQ5HE4VLNQ", "Overall": "3.0", "Content": "Ok, first I'm a Plasma fanboy. The main issue I have with this TV is that you cannot shut off the motion smoothing in any video setting other than \"GAME MODE.\" Why can't I shut it off in Vivid mode? You can turn it off in all the settings, but it's still there. Once again, why? Why do I not have control to do that? So, I watch everything in game mode which doesn't have the same vivid color with pop as other settings. I have tried to calibrate it, but I can't get it where I want it. Other than that, the TV's features are good and quality is ok. If Sharp would allow me to turn off the motion smoothing, I'd probably give it a 4 star rating.", "Date": "January 14, 2014"}, {"Title": "Love watching sports and movies now", "Author": "Ahernandez", "ReviewID": "R2RZEBVFE5HNQ1", "Overall": "5.0", "Content": "Sports and movies are great to watch will be looking at getting another sharp probably the 70 inche for the Super Bowl", "Date": "January 10, 2014"}, {"Title": "Good not great picture", "Author": "ED 24", "ReviewID": "R1IIDFNZB7ERTF", "Overall": "3.0", "Content": "The consistent quality of the picture is not as good as I hoped out of the box, there are faded specks of black on close up shots and/or views sometimes, but on other times  you get a view as if you are at the game.  Maybe I could use some additional advice on adjusting the settings and capturing a crisp clear picture 100% of the time", "Date": "January 4, 2014"}, {"Title": "60 in aquios smart TV", "Author": "Russ", "ReviewID": "R9593Z6FW4S1M", "Overall": "4.0", "Content": "It is a good TV so far. The picture is great,with a little tweaking.  Delivery was very good.  Like I said it is very good so far,  I will keep  you posted.", "Date": "January 3, 2014"}, {"Title": "Great TV.", "Author": "Jason J. Spaetti \"Casual Techie\"", "ReviewID": "R2UYAHEGQQMSI4", "Overall": "5.0", "Content": "I've been waiting to upgrade to a 60\" TV for two years.  I waited and waited, research and researched.  This TV is a great non-3D display, with plenty of settings to adjust to get the picture the way you like it.  I'm no videophile, so I'm sure there are TVs with better picture quality, but in two years of putting eyeballs on various plasmas, LCDs, and LEDs in this price range on display in stores, this one immediately grabbed my attention.  I didn't need a Smart TV, but I did set up Netflix so my wife could use it without having to involve my Playstation.  Netflix was easy to setup and looks great streaming HD.  If you catch it for $1,000 or less, it's a fantastic deal.", "Date": "January 2, 2014"}, {"Title": "sharp  Sharp", "Author": "Ronald L. Mccrea", "ReviewID": "R1TWEQIH3KR8K6", "Overall": "5.0", "Content": "this is an awesome tv with a great picture and more features then I have figured out so far.  I highly recommend it to anyone wanting a bigscreen with beautiful color. The price was right, delivery was quick and it was a merry Christmas!!!", "Date": "January 2, 2014"}, {"Title": "Summary of Review", "Author": "Timothy Liu", "ReviewID": "R3ELGQCMBJZZ35", "Overall": "4.0", "Content": "The tv has excellent picture quality. The smart feature was poor and difficult to use for internet, especially the key board.", "Date": "January 2, 2014"}, {"Title": "Very Pleased", "Author": "OldGuy", "ReviewID": "RV4HTM5X9EECB", "Overall": "5.0", "Content": "Excellent TV --- no need for more at my age. The direct internet access is very nice. Picture quality is all we could hope for. The delivery was a pleasant surprise -- opening it up and setting it up was smooth and a plus. The TV has MANY input ports; including USB. There is no keyboard sold WITH the TV -- however; it DOES support a wireless keyboard using a dongle in the USB port. I use a Logitech wireless K-750 keyboard --- works great.", "Date": "December 31, 2013"}, {"Title": "Love this TV", "Author": "AS", "ReviewID": "R3UKXFFCGW6EXR", "Overall": "5.0", "Content": "The TV arrived per Amazon's delivery estimates, the delivery company was courteous took the TV to the basement and let me examine the TV for damages.Mounting the TV to the wall was a breeze though the Sharp TV manual instructions were terrible.Based on other reviews removed the Soap Opera effect. The TV sound is weak but it didnt matter as I had it hooked up to surround sound.I have been using the Smart App every day - Netflix and Youtube. You should try out Youtube pairing with your tablet or Smartphone. The web browser is hard to navigate and I stopped using it.All in all 1 month in I am very happy with this TV.", "Date": "December 28, 2013"}, {"Title": "Grate T V", "Author": "Cason", "ReviewID": "R28B62A5E8NYCZ", "Overall": "5.0", "Content": "This is my second Sharp as I  also own a 40\" Aquos 120HZ Smart HDTV had it two years, love it also this new 60\" model is just the right size for our 20' X 20' living room couldn't ask for a better picture", "Date": "December 26, 2013"}, {"Title": "excellent choice", "Author": "Gloria S. Brotchner", "ReviewID": "R1GNX0YUT8OSCJ", "Overall": "5.0", "Content": "Just what we wanted!  It has a web browser as well as sharp, clear visuals and should be trouble-free for years to come.  Amazon made the choice easy- great price, great delivery option, all in all a good experience.", "Date": "December 26, 2013"}, {"Title": "Finally figured out how to reboot TV without unplugging TV", "Author": "Keith Ho \"Amazon Shopper\"", "ReviewID": "R1MIOIP9N2CW3N", "Overall": "4.0", "Content": "Sometimes the apps \"freezes\" the TV.  This happens a few times a week when I'm watching content from USB or Media stream from my home network.  I called customer service and they told me to \"unplug\" the TV.  I thought this was a primitive solution.  The user manual didn't specify how to reset the TV.  I just accidentally discovered how to reset/reboot.  Just press and hold the on/off button on the TV for 5 seconds.  The TV will reset automatically and reboots from start.  If you do it from the remote, it will not work.  Problem solved.Other thoughts:  I enjoy using and watching this TV for the past 6 months.  Picture quality is excellent.  Youtube is great!  Great thing about watching Youtube is that the commercials are almost non-existent.  Maybe it's a contractual thing with Youtube and Sharp.", "Date": "December 23, 2013"}, {"Title": "Brilliant Picture", "Author": "Cat", "ReviewID": "R3UP036YT3TUY4", "Overall": "5.0", "Content": "Went to several stores to check out the TV options in person. Loved this one and bought from Amazon because it was the best price, FREE SHIPPING, and a better extended warranty price. Only negative is the sound quality but pugged the stereo into the TV (yes it has that feature also) and it is perfection. I would recommend this product for price, quality, and features.Wallpaper feature is a nice plus!", "Date": "December 14, 2013"}, {"Title": "Amazing quality for a great price!", "Author": "Just me", "ReviewID": "RDMGE0ENIWOEH", "Overall": "5.0", "Content": "Love this TV. It is very thin and has a great picture. If you haven't seen some of the new hd led tvs in action, I would recommend checking them out at a box store before, because the quality of the picture was almost too strong for some of the family.", "Date": "December 12, 2013"}, {"Title": "Nice picture, TV not as Smart as expected, integrated web browser functionally deficient for viewing tv episodes online", "Author": "Pamela S. Campbell", "ReviewID": "R2TTM5KBETGXGE", "Overall": "4.0", "Content": "I have been using the TV for about a week now. The TV has a very nice picture. My only disappointment so far is that the integrated web browser is not as full function as expected. I tried to watch past episodes of shows from abc.com. The picture will not fill the full screen and squeezes down narrower such that the proportions are off (tall/thin people/objects). Also, when the point in the episode is reached where an ad is shown, the ad does not play and the show never resumes. I asked Sharp if they would be updating the browser to resolve these deficiencies, but received no answer other than the web browser isn't full function.Thus, my assumption is they have no plans. I would think they would integrate a standard browser such as Chrome rather than implementing their own proprietary browser. Using the integrated web browser for viewing past episodes was what I believed to be one of the advantages of this Sharp TV as I would no longer need to connect my laptop to the TV. Unfortunately, this is not the case :-(", "Date": "December 2, 2013"}, {"Title": "Reliable product", "Author": "Sharon Miao", "ReviewID": "R3DLJ36M65H9JM", "Overall": "5.0", "Content": "The quality of the product is consistent. We are still learning to use the different features of the TV. We are happy with the purchase.", "Date": "December 2, 2013"}, {"Title": "A+++", "Author": "Amber0187", "ReviewID": "R1CJXDKDK39CGH", "Overall": "5.0", "Content": "After looking around at local stores we fell in love with this TV. The picture is beautiful. It's super thin. Mounts to the wall beautifully!", "Date": "November 7, 2013"}, {"Title": "Love it", "Author": "Spunk \"DaveN\"", "ReviewID": "R1MN7LTQ2JLE46", "Overall": "5.0", "Content": "1/2 the price I paid for my rear projection 65\" in 2002 and a million times better picture. Picture is perfect from every angle and tv is easy to hook up. No sales tax and got it in less than a week........", "Date": "November 5, 2013"}, {"Title": "great item", "Author": "jason from indy", "ReviewID": "R18HA2P7J4YR87", "Overall": "5.0", "Content": "love this TV. Colors are great. The only complaint is the sound could be a little better. But with a sound bar it sounds great. Purchased this 60 tv to replace a 46 Sharp tv that we have had for 4 years. Moved the 46 inch upstairs and hung the 60 inch above fireplace. Looks very nice. Colors are very bright and picture is clear from odd angles as well. We went with the Sharp, becuase with my experience, they last. I have purchased 3, 65 inch Sharps for at work and one of them has been on non stop for about 4 years now and no problems. The other one is going on 6 years old and have no problems as well. The last one i purchased for work is only about 2 1/2 years old. I have also purchased a RCA and a Dynex for work and the picture on the Sharp blows those out of the water. The price for this 60inch was right at the price I wanted to spend. Plus it is a smart tv, so netflix on it is a plus. Kids are always trying to take the remote from me to watch cartoons.", "Date": "October 29, 2013"}, {"Title": "Okay after the return", "Author": "Sue Light", "ReviewID": "RXFUGTLWZGDKN", "Overall": "3.0", "Content": "Had issues with the first one, had to have it replaced, second one is ok, Wish I had looked a bit longer I would have purchased another brand, one that was not as dark.", "Date": "October 7, 2013"}, {"Title": "best overall price picture support size", "Author": "lucke3er", "ReviewID": "R2I7K9CYP1LD03", "Overall": "5.0", "Content": "Bought mine at best buy for little less but was an opened box item for the first two weeks this tv did everything i could ever dream of watching breaking bad season 5 and my favorite movies born to race,fast an furious, and so on paired this with my samsung sound bar and i seriously got people saying my living rooms feels like being at an imax. Even throwing a breaking bad party this sunday!Pros, awesome tv, huge, slim, sounds good, nice featuresCons mine got a red line through it, and the remote is sensitive.I sent the picture to sharp they were amazing enough to upgrade my tv to the next model up 75eu and which is just amazing for a company to give me a tv worth quite a bit more. Im very happy with my purchase!", "Date": "September 27, 2013"}, {"Title": "Bautifull TV", "Author": "Quan Nguyen", "ReviewID": "R2R6HZ6JLDYK21", "Overall": "5.0", "Content": "It nice TV, only problem that the smart funtion does not work very well it limit to many funtion from internet like no flash to get some movie.", "Date": "September 22, 2013"}, {"Title": "Great tv", "Author": "Choongki Lee", "ReviewID": "R1AVSQ980H5JEE", "Overall": "5.0", "Content": "Wow Great tv. Nice price and appearance. Sharp is the best tv maker i think. I recommend this tv to everyone.", "Date": "September 19, 2013"}, {"Title": "quality tv", "Author": "william kerman", "ReviewID": "R2D1LFTEPUAOVS", "Overall": "4.0", "Content": "great tv for the price, love the smart features, easy set up, sound a little weak needs sound bar or suround sound", "Date": "August 26, 2013"}, {"Title": "Untimely Demise...", "Author": "Chuck", "ReviewID": "R1TNI1Z4RBUYZM", "Overall": "1.0", "Content": "Two Months after the warranty expired on my 70 inch Sharp Aquos , vertical thin lines appeared on the screen. They are about an inch apart and they cover the entire screen. Other reviewers have complained about this. It appears this is not an isolated incident. I’ve tried unplugging and resetting but to no avail. It looks like I will have to call a service tech. I just hope it doesn’t cost as much as a new TV!Take this into consideration before you decide to buy a Sharp.", "Date": "February 15, 2014"}, {"Title": "Was Great For 3 months  & heres Why..", "Author": "LAVENDER \"P. S.\"", "ReviewID": "R9RNT8QFVZXLZ", "Overall": "2.0", "Content": "I was thinking  Hmmm  Sharp is  The Best,And It was for 3 Months,,,,I only Moved it ONCE…. Very Very Carefully….I guess  Sharp  is Sensitive ?Anyways  One day I was Planning to watch a Dvd I just Bought.I turned on The Tv,  colored Lines  ( Real Pretty ones  Haaaa)  gotta joke or Ill Cry,Anyways,I have 4 Year warranty  on it,Called  it  & they Said to e mail them a Picture  of  it  WHICH I DID,took 5 Days to get a AnswermCalled them Back  & they said It was DAMAGED  HMMMM WHAT?thats Funny.  Only Moved It 2 Feet…I have No  Kids,I watched It  Every Night,it was Off In day time,,,So Now  They said I have to pay 8 Hundred Bucks  & they will bring me a Used 60 Inch  Tv.what a Joke and a Half….Please Be aware Of What Is What,,,Im Not saying its not a Good Tv, Its who I was Dealing with,,,,,Live N learn I guess,No More Sharp for Me……Ill Live with the Used One they Bring…Then a Sony Or any Kind…If goes Out Again……….I have  No Company  either,So I dunno  Live N learn  …Please Be Carefull ….", "Date": "December 24, 2013"}, {"Title": "Wonderful picture", "Author": "Katherine J Oppenheimer", "ReviewID": "R15WQD117R7IQV", "Overall": "5.0", "Content": "We were completely surprised at how beautiful the picture is on this TV. As Visio owners, we were pleased with our experience, but in the future, we will purchase Sharp. White glove delivery was wonderful. The delivery guys moved our old TV, unboxed the new one, put in on our stand, attached the cable box, and cleaned the area. Wow!", "Date": "February 14, 2014"}, {"Title": "tv is great would give it 5 stars but for a few small problems", "Author": "Bobby Faulkner", "ReviewID": "R1U6FMWSHXF0DK", "Overall": "4.0", "Content": "first i got a 55 inch samsung 3d tv about two months ago from amazon and the picture is pristine and fabulous no complaints decided to upgrade to something a little bigger and read nothing but great reviews about this tv and read that anything over 60 should be a sharp because of the color quality I will have to say the samsung picture is way better dont get me wrong it has a great picture but the samsung tv picture just looks better MAYBE i need to tweek the color i dont know will continue to play around with it other than that i would of given it five stars", "Date": "January 15, 2014"}, {"Title": "Great overall, serious sound problems", "Author": "007 \"cmyth007\"", "ReviewID": "R1EC6RYOL11R00", "Overall": "4.0", "Content": "Very nice TV overall, with a few small'ish complaints. The picture is great. Setup with the internet was easy as pie and it streams my content from my home network and other computers with ease. I have virtually no complaints about anything with this TV, aside from the sound....I was told that the sound quality on these new, large TV's was bad. As TV's get thinner, the quality of the speakers suffers. This is certainly understandable. But what really blew me away was how loud it was BEHIND the tv. Yes. It is incredibly loud behind the TV, more so than in front, I think. So when I have the volume up, it blasts through the rest of the house instead of toward me on the couch. It is very irritating. The quality of the sound, though, is actually not as bad as some reviewers have said. I think it sounds reasonably good, it's just going in the wrong direction!The other option I may try is to attach the optional sound bar. What I don't know is if you can bypass the TV speakers completely when using this option. If so, I'd buy them tomorrow because this is really annoying. If any of you know the answer to this, please let me know!Aside from the sound, this is a darn good TV. Setup was a snap, streaming is gorgeous and effortless and it has PLENTY of extra connection options in the back for all of your devices. You won't be disappointed.", "Date": "November 28, 2013"}, {"Title": "It doesn't get any better!", "Author": "Keith Harris", "ReviewID": "R26X0WR6OGOKAS", "Overall": "5.0", "Content": "I'm a believer that Sharp has nixed the market when it come to TV sizes larger than 50\". This TV is incredible and fits my personal need. I can't wait for football and basketball season.", "Date": "July 20, 2013"}, {"Title": "Love this TV!", "Author": "Steve", "ReviewID": "R74GK9CNNADKG", "Overall": "5.0", "Content": "I finally got this TV yesterday (May 28th). After I got it set up (which was really easy) I love the picture. Great colors and extremely clear picture. I strongly recommend this TV to anyone.", "Date": "May 29, 2013"}, {"Title": "Horrible tv", "Author": "ooha", "ReviewID": "R1UJ5GON7USHTR", "Overall": "1.0", "Content": "1.The picture is dull compared to the panasonic 50 inch that I was planning to replace.2.the picture had to be adjusted many times to remove the soap opera look3. The voice and picture don't sync - this happens randomly4. The audio out and the tv audio have a time lag. So you hear echoing effect using an external ampThis is a horrible tv", "Date": "January 3, 2014"}, {"Title": "Nice tv", "Author": "max", "ReviewID": "RCO4Q17NY2X5O", "Overall": "5.0", "Content": "This tv has a very crisp image and the built in apps work very well. It was not too difficult to configure it for a home network.", "Date": "May 31, 2014"}, {"Title": "Better than described..", "Author": "Danny Buentello", "ReviewID": "R2WJKWU5SB7TNQ", "Overall": "5.0", "Content": "Can't believe the quality of the picture.  A great buy.  You can do no better for the $$$.  Lives up to reviews..", "Date": "March 23, 2014"}, {"Title": "Are We At the Movies", "Author": "YG", "ReviewID": "R3W1GBY496ZM63", "Overall": "5.0", "Content": "What a great picture quality.  I purposefully sit on the loveseat which gies a side view of the tv.I can see the picture just fine. It waseasy setup.  I would recommend that Amazon instant videos app be added", "Date": "March 18, 2014"}, {"Title": "Sweet TV", "Author": "Nathan Risto", "ReviewID": "R1HLCGR93MAQX6", "Overall": "5.0", "Content": "Got to say I was really impressed with this TV for it's size at the price point. It was my in-laws who actually received the TV.", "Date": "February 8, 2014"}, {"Title": "Great TV, great value", "Author": "Nicholas Lipple", "ReviewID": "RWR1QK52PCW6I", "Overall": "5.0", "Content": "This TV gives a fantastic image. It required a little bit of adjustment, i used Disney's blu ray calibration disk (http://www.amazon.com/Disney-WOW-World-Wonder-Blu-ray/dp/B0045ASBLG). Just using it out-of-the-box i was losing detail in extreme whites/blacks.Sometimes on an all black screen I can see slightly \"whiter\" areas where the backlight is brighter but it is impossible to see if there is any content whatsoever on the screen so it doesnt bother me. I want to stress how hardly visible these spots are, product still gets a 5/5 from me.", "Date": "January 23, 2014"}, {"Title": "bad picture and glare", "Author": "Tina Coppock", "ReviewID": "R10X9W49YTIJPW", "Overall": "2.0", "Content": "I already had a 52 inch Sharp and thought this 60 inch would be just as good.  It is NOT.  The picture quality is not nearly as good as my 52 inch (I have tried adjusting the picture settings numerous times to no avail). I also have two big windows in the room and there is a constant glare on the screen.  I did not have this problem with my other Sharp. While the picture is a little better at night, it is still not nearly as good as my other TV. I am very disappointed.", "Date": "January 12, 2014"}, {"Title": "A very good product, misses some little features...", "Author": "Federico Francioni", "ReviewID": "R1XEGGA3HG37ME", "Overall": "4.0", "Content": "... like a turning/rotating base, cause it's pretty heavy to lift and turn every time.Smart Central is a bit slow.", "Date": "January 6, 2014"}, {"Title": "Great TV, especially for the price.", "Author": "Tony", "ReviewID": "R33IW9GRSYVE9J", "Overall": "5.0", "Content": "After shopping around in this price range for a few weeks, I am very pleased with this TV. Picture is great, the TV is very slim and lightweight for a 60 inch, and the Smart options are definitely nice to have. Like with many others who have written reviews, you should go into the advanced settings and make a few adjustments to get rid of the soap opera effect. Overall I am very pleased with this purchase.", "Date": "December 24, 2013"}, {"Title": "Awesome Tv!! This is my second one.", "Author": "Jesse Ramirez", "ReviewID": "R16VTBF2NE0DWD", "Overall": "5.0", "Content": "I've had my TV now for one week and love it. Fix the Soap Opera problem as recommend by other reviews and now picture is awesome even after the updates. Of course everyone is different and setting up thier tv will be different. Really a great TV.", "Date": "December 17, 2013"}, {"Title": "Almost perfect", "Author": "ld", "ReviewID": "R3W1M5S6QNQPK8", "Overall": "5.0", "Content": "This is a truly wonderful television. the picture is great as well as the smart tv functions. The only issue is the speakers are on the bottom of the television facing down so the volume has to be turned way up to hear it.", "Date": "December 16, 2013"}, {"Title": "U can't bet it", "Author": "Lee First \"la1st\"", "ReviewID": "RSWDCU2Z76VFL", "Overall": "5.0", "Content": "I love it great color pic nice remote need to by a sound bar ( Bose )  then u b set", "Date": "December 3, 2013"}, {"Title": "BAD BOY MONSTER", "Author": "Enrique. B", "ReviewID": "R1C888AAUE14MR", "Overall": "5.0", "Content": "This is the centerpiece to our basement and it is STUNNING. Have it hooked up to an HDMI matrix that runs to the 42\" at the bar. NO DEGREDATION OF SOUND OR PICTURE. The soap opera issue was solved easily and without problem. The ONLY complaint I have is that the wi-fi receiver in the TV is VERY weak. My router is centrally located and I have two other TVs in the basement that are linked to the same router. This TV has issues with signal strength and I have failed to connect. Amazon support helped me but I need a wi-fi extender I guess. Amazon even BEAT the price on a competing site AND I got a rebate of 2% which paid for a BluRay player. CAN'T BEAT THAT.", "Date": "September 24, 2013"}, {"Title": "Very good", "Author": "Mike", "ReviewID": "R1BZG4PP2LXISL", "Overall": "5.0", "Content": "Excellenct TV. Exactly what I wanted. Perfect picture great color. All the smart features work great. The browser isn't real great for some things but it does the job. All around great tv though.", "Date": "September 13, 2013"}, {"Title": "DO NOT BUY SHARP - HORRIBLE CUSTOMER SERVICE", "Author": "Aram Mirzadeh \"aram535\"", "ReviewID": "R2NLN2JZDO165B", "Overall": "1.0", "Content": "HORRIBLE CUSTOMER SERVICEThe TVs these days are not made like they used to be.  You won't hang on to your TV very long so customer service is very important.  Having recently purchased a 60\" Aquos I was very sad to hear that the unit had to be replaced completely, even more when they told me that it took take up to 3 WEEKS+ to replace.  I had the problem on a Monday, Called in Tuesday and didn't even wait for the email (which came the day latter) I photographed and emailed Sharp with the information they wanted.  4 days after  that I called in to check and they were just getting approval for the replacement -- and IF they approved it, it would take another 7-10 business days to ship a unit to Long Island (NY).  Right around Thanksgiving and Christmas ... which means I'll be out of a TV for a month+.  I called and called they had nothing for me, except this is now our process and has been for a while, nothing we can do to change it.", "Date": "November 22, 2013"}, {"Title": "Great value", "Author": "BA", "ReviewID": "R1WTPD8FESSSRV", "Overall": "4.0", "Content": "Easy setup and operation. Web browser is fairly useless and clumsy to use. The super Bowl was great on the set(unless you were a Denver fan)", "Date": "February 7, 2014"}, {"Title": "Smart functions really bad", "Author": "Ernest Scinto", "ReviewID": "R1V130DKCOZRHD", "Overall": "2.0", "Content": "As a TV it's fine. Picture is good. Sound is good. But the Smart functions are just terrible. Takes minutes to switch between a video signal and Netflix. Sometimes it doesn't work and you need to turn it off before you can get into Netflix. Buy a different one if that's what you're looking for.", "Date": "January 16, 2014"}, {"Title": "You get what you pay for (Updated Rating)", "Author": "Uranus Speaks \"Uranus\"", "ReviewID": "R251DP0VMFRRV5", "Overall": "4.0", "Content": "It's \"GOOD\" in the world of large screen LED HD TVs, especially for the price.-  Presentation of human faces is slightly harsh, like too much contrast, and looks like a TV picture rather than realistic facial presentation one would expect viewing 1080P resolution.-  The overall picture quality and viewing experience is slightly inferior to that of the Quattron version of Sharp's products, but that's about a $1000 upgrade.In conclusion, the Sharp LC-70LE650 70-inch Aquos 1080p is GOOD for the price, but when compared to the older Sharp Aquos LC-70LE732U, there is a picture richness penalty.", "Date": "December 26, 2013"}, {"Title": "Mostly Good", "Author": "ezra zalayet", "ReviewID": "RQR6FN28ADVO5", "Overall": "4.0", "Content": "Great TV but there have been some issues with the sound.  Once in a while it gets out of sync with the video and sometimes even gets static-y.  But it only happened a few times and may be cleared up.", "Date": "June 1, 2013"}, {"Title": "Nice!...", "Author": "Gene K. (aka Tyronious Ledbedder Beaver-Bottom)", "ReviewID": "R2AKAA0D1XQMU6", "Overall": "4.0", "Content": "The TV arrived when it was scheduled, it was in perfect condition and the delivery guys were very pleasant and friendly. At first I was somewhat disappointed by what I will call \" motion artifacts\", with the picture looking as if everything had been filmed with a handheld camera.  I am familiar with the Soap Opera Affect, but this was somewhat different than that. However, since I had connected the TV with a Cat 5 to my network when I set it up, it immediately told me that a software update was available. I somewhat reluctantly clicked \"OK\" and the update downloaded quickly and was applied flawlessly. And after some additional adjustments the picture is great!  As with any high quality HDTV, the picture is only as good as the source material, so with both cable and streaming sources the picture quality varies a bit from program to program. I am looking into having it professionally calibrated, as I think that will make it even better. I will post an update if and when I get that done.", "Date": "March 20, 2013"}, {"Title": "Exceeds expectations", "Author": "Bill Gatewood Jr.", "ReviewID": "RYISBSI8JJRNY", "Overall": "5.0", "Content": "I purchased this to replace a 50\" plasma.  i was looking at the 640 but saw the 650 had just been released.  The picture is exceptional, the smart functions are robust and the initial setup was simple.  So far, I am very impressed.  When watching sports during the last few days, I almost thought I had a front row seat.", "Date": "March 17, 2013"}, {"Title": "Lousy wireless connectivity", "Author": "Rajendra Kanuru", "ReviewID": "R1120PL6YVWZDT", "Overall": "2.0", "Content": "The remote is a bit more complicated than necessary. Also, it gets lousy wi-fi signal. All other devices and another smart tv I have work easy with good internet signal from my router. This tv can't pick the signal up at all. I have to use my roku box to get streaming content on the tv, which defeats the purpose of buying a smart tv. Called service and their only advice was to try buying a signal booster or relocating my router within 10 feet of the tv. If having wireless internet feature on the tv important to you don't get this tv.", "Date": "March 27, 2014"}, {"Title": "I wish I din't install those updates", "Author": "newvoodoo \"newvoodoo\"", "ReviewID": "R2UTL1RLV3BQX5", "Overall": "3.0", "Content": "The TV as hardware is fine and met my expectations. What exceeded my expectation is that you can update the firmware with a click of a button.. if only those updates made sense. After the last update my TV got slower, sometimes just unresponsive, my Logitech wireless keyboard stopped working, and after smoking some substance they decided that typing a text using on screen keyboard is better with a single lines of keys instead of a matrix. But hey, why would you use on screen keyboard if you can use your cell phone to type? mmmmmm..... why would I use a TV if I can watch it on a cell phone?", "Date": "August 1, 2013"}, {"Title": "Poor design quality (audio delay, bad backlighting, soap opera effect)", "Author": "Thomas", "ReviewID": "R1NMBMJGIFF047", "Overall": "1.0", "Content": "I am sorry to say I returned the costco version (LC60C6500U) of this model today. It has lots of features, but... there are a few glaring issues.1) The soap opera effect is present in every mode except game mode. So why pay for 1120Hz refresh when you have to disable all of the 'advanced' features?2) This model had a terrible issue after watching any source of HD video after about 1-2hours the audio would lag the video by over 1 second! This is a deal breaker for me. How can anyone tolerate this? It is like watching old badly dubbed kung-fu movies. How can this pass any quality testing at Sharp? How can the engineers design such an abomination? Very bad job Sharp, shame on you. Yes, I tried to updated the firmware, no change.3) This particular model is apparently edge lit with LEDs. Well, when watching credits after a movie the credit text will exhibit streaking on the screen immediately right of the text on a black background. This is the easiest way to see this problem. It is a very poor back lighting scheme.I was happy to get this TV and use it at first. The 'smart' features I barely used and were not too smart.I am so glad to be rid of this thing. I switched to a 50\" plasma and the picture is a world better! Be careful about looking at a screen in a well lit big box warehouse. They generally have excessively back-lit content that does not show black level issues. You also will not see the audio delay issue here.I am hopeful that Sharp can get their grindstone out and sort these problems out by sharpening up on their embedded software and hardware development engineering skills. Guys, you are not looking too sharp with this model.", "Date": "March 2, 2014"}, {"Title": "SHARP IS QUALITY", "Author": "Sharon Ables", "ReviewID": "R1EQ7D3T3URB3Q", "Overall": "4.0", "Content": "ONE DAMN GOOD PICTURE SO I WILL KEEP IT FOR A LONG TIME THE DELIVERY WAS OK BUT THEY DIDN'T WANT TO OPEN IT BUT THEY DID AFTER I INSTITED", "Date": "May 19, 2014"}, {"Title": "Great Delivery", "Author": "J. S. Nelson", "ReviewID": "R169HSFF17RS5T", "Overall": "5.0", "Content": "After ordering the TV we were given a delivery date and a time frame. Pilot Delivery was excellent as they delivered on time, were very nice and unpacked the TV and verified it worked correctly.  As for the TV, I have had it a day and all seems good.  The picture is great.", "Date": "April 9, 2014"}, {"Title": "Nice TV", "Author": "Jeff Malott", "ReviewID": "R1AE8T3QBRGZUC", "Overall": "4.0", "Content": "This is my first LED over 55 inches, and I'm very impressed with the picture.  Along with the size, the price point was the original attaction.  Time will tell how long the value stands.  The family likes it right now!", "Date": "December 9, 2013"}, {"Title": "So far so good, except for the stand!!", "Author": "Bethel mom \"ReaderWriter'nMom\"", "ReviewID": "RYTICC3HS4Y4D", "Overall": "3.0", "Content": "Well, the TV seems good, but we thought we'd put it on the stand until we get a wall mount up. Don't do it! This thing is so flimsy the pets could knock the TV over. We had to leave it on the floor with a couch propped up against it to hold it up. Yes, it's all screwed in.", "Date": "October 26, 2013"}, {"Title": "Warped Bezel?", "Author": "robk64", "ReviewID": "RUF3YANZQENYH", "Overall": "3.0", "Content": "This was a manufacturer warranty replacement for the 640u that started to have LED bleed-thru on the bottom of the screen.  The screen itself is noticeably more reflective than the 640u, but what really has me concerned is the top of the TV.  Looking from one side, across the top, to the other side, the TV bows out.  It's mounted on the wall, and the wall mount brackets are flush (not canted which might induce the bending).  Strangely enough, the TV still works, even with the bend.  Not sure how long that will last, though.  It took 8 months for the light bleed-throughs to appear on the bottom of the 640u.  At $300 less than what I paid for the 640u, I'm not sure if the 650u is a better buy, or just a lighter-weight, cheaper version of the same TV.", "Date": "April 24, 2013"}, {"Title": "awesome", "Author": "tommygun", "ReviewID": "R1K59QZEH036WG", "Overall": "5.0", "Content": "Very happy with this purchase. Love the ability to use phone with tv. I was able toount solo its so light remote is ok.", "Date": "July 6, 2013"}, {"Title": "TV Sucks", "Author": "Ruth Mitchell", "ReviewID": "R1DR1O5W6OSWGO", "Overall": "1.0", "Content": "Purchased the TV less than 6 months ago and it broke. The picture started to get distorted until we had no picture but just a bunch of discoloring on tv not able to distinguish anything on it.  Called Sharp to try to get it fixed its been already 3 weeks and my tv still not fixed. Horrible customer service and no one is able to help. Very disappointed overall experience.", "Date": "October 3, 2013"}, {"Title": "Terrible TV... DO NOT BUY", "Author": "Jake Vigliotti", "ReviewID": "R3C4IRMOV4O2KP", "Overall": "1.0", "Content": "TV is a piece of garbage.  Sharp's \"help\" was useless.Short version; TV worked for 23 hours, then it 'locked up'.  A factory reset didn't fix it, so called Sharp.  The hard re-boot (holding down buttons on TV with it unplugged) got it working, but the \"Smart\" features then suddenly stopped feeding audio out to the receiver.  Sharp couldn't fix it, and even hung up on me after 25 minutes on hold.Default settings are dumb; defaults to \"Film\" - which makes video look choppy.  Default color schemes are too bright, you really have to tinker with it to correctly set it.  \"Smart\" features are difficult to set up; even the Sharp rep told me on the phone not to set it up the way the on-screen instructions tell you to.There's nothing more annoying than boxing up a TV and sending it back, but that's what I did.  Giant waste of 10 days for me... tried everything to get it back to as it was the first day, but nothing worked.  Save yourself the hassle; buy a different brand.", "Date": "February 27, 2014"}, {"Title": "Red line down the screen!", "Author": "David Shane Grieb", "ReviewID": "R2GWMHTYFS9G1G", "Overall": "3.0", "Content": "I have contactaced Sharp after attempting to fix it over the phone and photos sent they will replace with a new one. It has been in transit for over 10 days and still not here.", "Date": "July 31, 2013"}, {"Title": "LAG", "Author": "BRIAN R.", "ReviewID": "R1X0XGYQHMBPIM", "Overall": "1.0", "Content": "On 1300x768 I don't really have an issue playing games via hdmi, but when I kick it up to 1080p this thing has like a 59ms input lag which makes gaming completely impossible. There is no \"Game mode\" on this tv that I can find, and I bought this tv primarily to play games from the living room. If I could give it 0 stars I would.", "Date": "May 5, 2014"}, {"Title": "Decent TV depending in your use", "Author": "Katrina F", "ReviewID": "R1PCSHHPOZSG1U", "Overall": "3.0", "Content": "I got this TV as I was told it would be fine for gaming on, and unfortunately that isn't the case. My boyfriend likes to play Madden and NHL on our PS3 and this tv just couldn't keep up. You should see the puck jump across the screen instead of gliding smoothly (sometimes leading to the other team scoring because of it). Same thing would happen on Madden when the ball was thrown. We ended up returning it because even on one of the playoff games it had an issue. If you're a basic tv watcher and don't play video games this tv is for you. However if you are looking to take full advantage of it, look elsewhere. We ended up going with the sharp 60LE755 (I think that's it) and it's been great. Even got a PS4 now and haven't had a single issue.", "Date": "January 26, 2014"}, {"Title": "knarly raw view", "Author": "derek sippy", "ReviewID": "R2XGYNDGTW3O66", "Overall": "3.0", "Content": "freaking love it far exceeded expectations just needed more screen size adjustments  and the sharpness feature under the menu adjustments gets way too sharp turned all the way up other than that raw and stupid fresh good work.", "Date": "March 20, 2014"}, {"Title": "Not as big as you think", "Author": "Daniel Konkel", "ReviewID": "R2Y9FRCXL2W37F", "Overall": "5.0", "Content": "I found it to be a great unit at a great price the picture is great as is the sound", "Date": "July 20, 2013"}, {"Title": "Sharp 70", "Author": "Vincent Fernandez", "ReviewID": "R1H48CJ5GUGEJR", "Overall": "4.0", "Content": "Great buy! TV requires a lot of time spent adjusting settings. Everything had \"soap opera\" look to it with factory settings. Smart features and picture after adjusting settings are great, sound is not the best quality.all in all very happy. Saved couple hundred through Amazon, no sales tax or shipping.", "Date": "July 9, 2013"}, {"Title": "OVERPRICED, SELLING CHEAPER EVERYWHERE ELSE", "Author": "PC", "ReviewID": "RSFFABM98GPO7", "Overall": "4.0", "Content": "I just purchased the exact same model television for $899.99 after in-store credit at CostCo.com normal CostCo price is $999.99 but if you watch their special offers, I am sure this TV will be on sale again for the low price of $899.99. Why pay 100-200 dollars more when you're supposed to be getting it cheaper online than in the stores? I think amazon should adjust their pricing to be competitive with this.", "Date": "August 5, 2013"}, {"Title": "Bad, but cheap?", "Author": "John B.", "ReviewID": "R70UWMX7X54AE", "Overall": "1.0", "Content": "The picture makes even blu-ray movies look like cheap soap-opera video tape of last century.  The motion blur technology on a full picture scan looks okay, good in fact, but if a single character runs across the screen, his perimeter breaks apart like some cheap FX.  Same with rapid hand movements.  I suppose it's too late to exchange it for a Samsung?", "Date": "October 2, 2013"}, {"Title": "TV missing threading for screws to attach the stand", "Author": "Amazon Customer", "ReviewID": "R1UHPJN1Z6OV9K", "Overall": "1.0", "Content": "The stand that comes with the TV attaches via two legs. One of them is unable to attach because the metal part in the TV does not have any threading on one side. It looks like a simple problem with having the part improperly machined. One side is properly threaded and the stand will attach, and the other side has holes that are completely smooth inside instead of threaded. This prevents you from securely attaching the TV to the stand (just one leg of the stand will attach).This wouldn't be a problem if I knew that I would never want to use the stand. I was intending to wall mount this TV anyway, but I'd like the option of attaching the stand somewhere down the road. This seems like such a glaring oversight that it also gives me second thoughts about the TV in general.Now I have to box the thing back up and take it back to the store. I'm 50/50 on whether to get the same model or look at something different.", "Date": "April 7, 2014"}, {"Title": "Headline", "Author": "HaitianHova", "ReviewID": "RYD6T09353S8G", "Overall": "5.0", "Content": "The in-law wont leave my tv alone..lol... watching the HEAT WIN THE CHAMPION FOR A 2nd TYME IN A ROW ON IT Was WORTH THE MONEY SPEND lol love it man", "Date": "June 21, 2013"}, {"Title": "Nice when it work", "Author": "T. Pauley", "ReviewID": "R32E0PRG3W27C0", "Overall": "2.0", "Content": "First off we bought this refurbished from another site.  All of our televisions are refurbished and this is the first we've had issues with.  Within a few days we started getting lines down the picture, but because of our work schedules we didn't get the case started soon enough.  Sharp admits the television is not repairable, but they want us to pay an addition fee to replace this television with another refurbished one.  The additional fee would put our costs over the price of a new one.  I would stay away from this model (and Sharp as well to be honest) in the off chance you get a defective one like I did.  If you do, they won't stand by their product.", "Date": "August 31, 2013"}, {"Title": "Shuts off every couple minutes", "Author": "G Lyman", "ReviewID": "R224YATUWBZTOB", "Overall": "2.0", "Content": "The t.v worked fine for awhile and now it continuously shuts off every 2 minutes and then turns back on.  It does this repeatedly.  I called Sharp about it.", "Date": "July 2, 2013"}, {"Title": "Buyers Beware!!!!!!", "Author": "kenneth oehmke", "ReviewID": "R37Z9OPN3IIMDJ", "Overall": "1.0", "Content": "After dealing with my multiple Sharp Aquos TV's I will NEVER buy SHARP again. Subpar quality, horrible customer care. Please think twice before spending your hard earned money on a Sharp product. Shop around!!!!!!!!!!!!!!!", "Date": "February 11, 2014"}, {"Title": "Worked for a while", "Author": "Paul E. Marvin", "ReviewID": "R2HR9YGADFXCXJ", "Overall": "1.0", "Content": "piece of garbage... Worked just until the warranty expired.  Don't trust reviews from new buyers.  I would have rated this high as well initially but after seeing MANY others with similar complaints (motherboard failure) I would avoid Sharp products like the plague.", "Date": "November 17, 2013"}, {"Title": "Online and netflix", "Author": "Stephen J Dryer", "ReviewID": "R15NFJ6VS4IEOC", "Overall": "1.0", "Content": "I purchased smart tv so I could do streaming. It took many calls to sharp to finally get netflix to work. When it did many movies and series were not in HD clarity.  Missed entire Olympic steaming.", "Date": "March 10, 2014"}, {"Title": "Just about satisfied", "Author": "Asharma", "ReviewID": "R1KBNLU6RDNGEL", "Overall": "3.0", "Content": "Bought first 640U and then 650U and now planning to return for the second time for a Samsung. I already have Samsung 46\" for the last five years and I guess once you get used to Samsung colors, sharp does not do the justice. I keep struggling to bring out the best colors on every channel as we flip between the Dish TV, Optimum, Netflix and DVD mode. Not sure if I am doing something wrong, but do not have the time every time to struggle with the best picture quality. Samsung is on the weekend to do list.", "Date": "April 30, 2013"}, {"Title": "Hosed", "Author": "Muhammad Khan", "ReviewID": "R249CKF4CJOJ76", "Overall": "2.0", "Content": "2 Weeks after I purchased the TV, Amazon informed me that there had been a price reduction. They made me fill out a bunch of forms and nothing happened.I have 38 emails from them and each time I responded to them, I was told that this email doesn't accept messages!Why would you send me a message and then blow me off? This is how they treat PRIME customers!!!I was a huge fan of BEZOS but and I own stock in Amazon but I felt fuzzy when their stock took a hit !!!You don't get to keep customers in this manner and expect them to be your patron!!!", "Date": "February 12, 2014"}, {"Title": "Worst picture ever!", "Author": "Sipeish \"SD mamma\"", "ReviewID": "RBM1V7Q9A6JKE", "Overall": "2.0", "Content": "The TV itself is nice, the color however is horrible!! It seems the reds, and yellows are too prominent and stand out too much. The color, and quality also vary by show and it's freaking annoying! There's a foggy look to the picture that I can't fix even after adjusting the colors, and contrast. I hate that there's not swivel option like there was with my Samsung. I guess I'll be returning it and getting another Samsung tomorrow. I'd rather pay more for a Samsung than be stuck with this junk.", "Date": "April 5, 2013"}], "ProductInfo": {"Price": null, "Features": "Refresh Rate: 120Hz (Native)\nBacklight: LED (Edge-Lit)\nSmart Functionality: Yes - SmartCentral\nDimensions (W x H x D):  TV without stand: 62.6'' x 37.3\" x 3.3'', TV with stand: 62.6'' x 38.3'' x 14.2''\nInputs: 4 HDMI, 2 USB, PC input, RS-232C, MHL\nAccessories Included: Universal Remote", "Name": "Sharp LC-70LE650U  70-inch Aquos HD 1080p 120Hz  Smart LED TV", "ImgURL": "http://ecx.images-amazon.com/images/I/51Mo48cW8%2BL._SX300_.jpg", "ProductID": "B00BG5M94S"}}