{"Reviews": [{"Title": "Great tv but crappy remote", "Author": "Sean Paiz", "ReviewID": "R18HODXCCHWB8N", "Overall": "4.0", "Content": "i bought this tv for 300, which was a great deal but out of the box the remote did not work and i had to contact amazon, who sent me to proscan support, who sent me to another support line, just to try to get it replaced. the tv is great and works fine, the amazon support is good, but the proscan support itself is s***", "Date": "July 29, 2013"}, {"Title": "amazing Tv with huge screen for a shocking price", "Author": "kevin mccorriston", "ReviewID": "R6EH1BZAJQ7FK", "Overall": "5.0", "Content": "Not sure why or how I got such a great price on this tv.  never heard of this company but have had luck with amazon endorsed procucts and happy this one worked out tpp", "Date": "November 16, 2013"}, {"Title": "Not impressed.", "Author": "Roelvis", "ReviewID": "R1DDXW3QJ6C29J", "Overall": "2.0", "Content": "Just got received it yesterday, played Avatar blu-ray and there was A LOT of ghosting, picture is not very clear and any scenes involving movement look grainy/blurred. Any scenes that are focused and dont involve movement look like what an LED tv should look like. Also, I cannot hook up my PC using HDMI because any time I open a browser or play a video the screen goes black and I have to change inputs back and forth every 5 minutes.For $299 I cant complain but I have already placed it on craigslist to try and make a profit, if not it is going back to Amazon due to the poor picture quality, usability issues and it also came with 3 dead pixels.I should also note I am comparing this to my 50\" Samsung plasma and there is a WORLD of difference between these 2 TV's in picture quality alone. Spend the cash and get a name brand with good specs.", "Date": "July 10, 2013"}, {"Title": "Good for the price", "Author": "Amitkumar Mane", "ReviewID": "R3OD1LBBO35FBU", "Overall": "4.0", "Content": "Its good for the price. Its not a smart tv; but I have a PS3, so it was fine. Clear and pretty nice picture.Only one issue: It doesn't have USB connection. It has three HDMI inputs, no input for the USB. Would have been nicer to have at least one.But oeverall happy with the product.", "Date": "August 12, 2013"}, {"Title": "Great product!", "Author": "Trey", "ReviewID": "R2ZTQBV2TRM5R0", "Overall": "5.0", "Content": "Fast shipping! Great tv! Clear picture, slim, very classy looking! Glass base is a nice touch goes great with any modern decor housing style.", "Date": "July 17, 2013"}, {"Title": "What I don't like!", "Author": "richard reynold pendergast", "ReviewID": "R33TXQSUF9BG41", "Overall": "4.0", "Content": "I have not had it long enough to give a fair report. One thing I don't like is the set-up or adjustment Menu, not enough control orease of control. Another is the picture distortion on Wide setting. The people are all short and fat. On normal size why have a40 in. screen and only use part of it? So far I can't get the sound set right either.", "Date": "August 7, 2013"}, {"Title": "proscan led 42", "Author": "paul  carmichael", "ReviewID": "RV4AWGKHQ6U7Q", "Overall": "5.0", "Content": "This is the second proscan LED tv I have bought. This tv has a clear picture. I have encountered no problems at all. The sound is not bad for this Type of tv. I am really impressed with this name . I would highly recommend this tv. Amazon has the best price on the 42 inch LED tv. I Also purchased the 4 usar r square trade service plan.", "Date": "April 30, 2013"}, {"Title": "Gift", "Author": "Jolene A.", "ReviewID": "R1PZ3U3MI1ECX5", "Overall": "5.0", "Content": "Bought this for a gift for my grandmother.  She is very pleased with the TV.  We mounted it on the wall, it is very thin design and looks great.", "Date": "May 13, 2013"}, {"Title": "stopped working after 3 months", "Author": "Kathy S", "ReviewID": "RH1QSSK3H1YB3", "Overall": "1.0", "Content": "Have only had the product for a month or so, but it was exactly as described. Nice picture and sound quality. If it lasts, then I will be extremely pleased. Great TV for the money!September 21, 2013  3 months after purchase...TV won't turn on. Called manufacturer and talked with a lady from India. Need to return the product to Illinois for repair or replacement (at my expense). I've changed my 5 star to 1 star. Hope my replacement lasts longer than 3 months! Standby....", "Date": "July 29, 2013"}, {"Title": "Bad quality", "Author": "penny", "ReviewID": "RUDGT3VXP1CFA", "Overall": "1.0", "Content": "Do not buy it. This is not a real HDtv. It is so so hard connect with HD box, and can't connect HDMI well.", "Date": "July 30, 2013"}, {"Title": "pretty good tv.....", "Author": "tanerexic", "ReviewID": "R28I4B7BW1B22Z", "Overall": "5.0", "Content": "Works great iv had mine for 5 years and still is going strong!! It even has been knocked over a year ago and still works...i paid 800 for it too so 419.00 is a steal..", "Date": "May 6, 2013"}, {"Title": "Beware the dreaded \"Soap Opera Effect\"!", "Author": "J. Cristobal", "ReviewID": "R2115939X25JCB", "Overall": "2.0", "Content": "If it weren't for this one issue, it could be a great TV. The Soap Opera Effect doesn't bother everyone (like my roommate, for instance) but its basically ruining all my favorite shows and movies by making them all look like they were filmed with cheap digital camera. I guess some people just get used to it or something but I can't stand it. I'd rather watch movies on an old box TV or on my computer. First I thought it was just this TV but when I searched for a fix online, I found this was a common problem with HD TVs and you can't necessarily \"fix\" it. All you can do is play with the picture settings until it looks little more normal. On this Proscan, I think turning off the \"MFC\" feature under picture settings>advanced settings.", "Date": "June 26, 2013"}], "ProductInfo": {"Price": "$499.99", "Features": "Proscan 42-Inch Edge LED HD TV, 1080p - Full HD\nAspect Ratio - 16:9; refresh rate - 60 hz\nConnections include: HDMI X 3, VGA, YPbPr, Coaxialm AV Audio/Video/PC Audio, Headphone and RF\nDigital Comb Filter; Wall Mount Ready\nFull function Remote Control", "Name": "Proscan PLED4274A 42-Inch Slim LED 1080p HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41cTkTO%2B93L._SX300_.jpg", "ProductID": "B00BF9MXB4"}}