{"Reviews": [{"Title": "Great Picture, Good Sound", "Author": "B. Graver", "ReviewID": "R1QNRDV3SVULD8", "Overall": "5.0", "Content": "The picture is PERFECT and the sound is very GOOD, there just isn't anything to complain about with this TV. Setup is easy with Phillips guided setup. I always buy Phillips and am always pleased with the features and picture quality.I tried  Spectre 29 inch and  Emerson 29 inch TV's, both had poor picture quality compared to this Phillips. The Spectre also had terrible sound.Pros : Easy setup and perfect picture along with good sound qualityCons : None!", "Date": "December 24, 2013"}, {"Title": "Excellent TV & Monitor", "Author": "Mohamed Bhimji", "ReviewID": "R1XSLVJOMTAWV9", "Overall": "5.0", "Content": "If you are looking for an inexpensive LED TV to power your PS4 or PC then you need to look at the Philips 29\" LED TV.The TV is available from several box retail outlets, but is about 25% more than what you will pay for it on Amazon, and if you are an Amazon Prime member you also get FREE SHIPPING on this LED TV.  It may even be worthwhile at that point purchasing a 3-year ($19.55) or 2-year ($10.99) warranty for the TV.The TV was purchased for my PS4 because my HDTV (a monstrosity from the days of projection screens) does not have HDMI (only DVI) and no amount of fiddling or forcing the PS4 to work on it would do the trick.  I searched for something inexpensive (read cheap in price, but NOT cheap in quality) and actually found something less expensive but larger screen and tried that at first.  Ran the first LED I bought for two days and got headaches from the fuzzy screen, poor blacks and really just a lack of quality from a 39\" LED (it was lighter than the 29\" that I eventually purchased).When I bought the LED from a retail outlet it was $228.00 + enviro fees (in Canada) + taxes, and recently the price has jumped to $248.00 so the Amazon deal on this LED at $204.94 (as of this writing on 1/28/14) is the lowest I've been able to find.Unboxing the TV was a breeze, there is a stand that comes with it but if you want to mount it on the wall you will need to buy the hardware separately but as the TV would sit on the desk, didn't have to spend another $50.00 or so.  There are three screws which attach the base to the TV, which were a bit of a pain to get in but needing only a few minutes worth of work.  After taking off a ton of packaging, finally got the base on, wiped it down with some cloths designed for electronic devices and was ready to plug it in.There is no external brick type adapter required, it's all in the thinish TV so all you have is a power cord that you plug into the wall or power bar.The TV was being used for a PS4 and PC, so I hooked both items up and proceeded to turn it on.  I went through the very intuitive set-up and within 3-minutes was ready to test it out.First we tested with PC.  Running it as a PC MONITOR was superb!  I'm used to using 19\", 22\" or 24\" wide screen panels and after using the 29\" -- I don't ever want to go back!  I'm not running a high-end video card in my PC so using HDMI out from the PC resulted in a very poor picture, so I resorted to using the standard video output from the computer into the LED.  The result - an outstanding image, which is very crisp and clear and will not give you headaches.  I would say that the image quality is about equal to the LCD panels that I use at work or on my laptop, it almost seems that Philips had the PC in mind when they developed this LED.UPDATE: Spoke to someone I know about the HDMI situation and they suggested tinkering with the resolution.  The TV would be \"forced\" into the highest resolution, so playing with the settings on the PC I was able to run HDMI at a somewhat lower resolution but the display is absolutely stunning!I have not tried to run a HD cable signal through the TV, mostly because my son doesn't want to part with it (in case we happen to like it and decide on replacing the TV in our bedroom for this one) but I don't see any reason why it would not display just as well with a HD cable signal.Things I noticed right away (I'm not a videophile, TVphile, audiophile etc., because I honestly cannot tell the difference):- Brilliant images with no ghosting, or blurring of text or image.  Mind you the PC is only used for browsing, the (occasional) homework and playing Minecraft so I am not really testing it out.- Easy picture setting using the built-in Setting Assistant- Auto picture mode- SRS TruSurround -- haven't really tested this much as it's hooked up to a PC, but sound quality when using the PS4 is more than acceptable- Energy Star - Philips rates this TV as costing about $6.00/year however I've hooked up a Belkin Energy Use Monitor and its telling me around $12.00 per year... but that' splitting hairs as it's a lot less expensive than my big monstrosity of a rear projection screen.- 3 (THREE) HDMI inputs, typically only the more expensive LED/LCD will provide this many HDMI inputs plus you get COMPONENT IN, HEADPHONE, USB (!!!) and PC-IN RGBRunning this on the PS4 and it works great.  Images do not blur and it is very pleasant to look at and play the games (we played Call of Duty Ghosts and Assassins Creed Black Flag).Overall we're very happy with the TV for what we paid for it.Did some additional research on Philips and this brand is very popular in Europe, the name and brand has jut not caught on in North America.", "Date": "January 28, 2014"}, {"Title": "Great value for the Price!", "Author": "Ben Gregg", "ReviewID": "R35ALC9N0B3H8N", "Overall": "5.0", "Content": "I already have a Phillips TV in my living room (36-inch) that I bought 5 years ago, so I gravitated to this one with the thought that at least I could use the same remotes!  I have to say, I was pretty amazed at how much faster, brighter and snappier this one performs.  Super easy to mount to my wall (standard kit) and paired with an AmazonBasics flat antenna, I'm able to pull in every single channel local to Boston, including some channels in New Hampshire!  Really happy with this purchase!", "Date": "March 19, 2014"}, {"Title": "Good deal", "Author": "Larry Chapman", "ReviewID": "R2KJZGKK16RVBF", "Overall": "5.0", "Content": "Bought this as a Christmas gift for my wife's parents and they were able to set it up without problems and it is working fine. We've had a Phillips 42\" for five years and it's been problem free. Good products.", "Date": "February 18, 2014"}, {"Title": "TV/Monitor", "Author": "tkd1123", "ReviewID": "R3SNRS0867U9H2", "Overall": "5.0", "Content": "We use this for a large computer monitor and a TV. It does double duty quite well, and we are very pleased with this purchase.", "Date": "February 3, 2014"}, {"Title": "Philips 29\" TV", "Author": "April L Decker", "ReviewID": "RT8CIDJDG7R07", "Overall": "5.0", "Content": "The TV is great and working fine. The color is magnificent and we are truly happy with our purchase from Amazon. The deal was too good to pass up.", "Date": "February 2, 2014"}, {"Title": "Weak performance", "Author": "Matt", "ReviewID": "R3FP6MT2ADVUY2", "Overall": "2.0", "Content": "For the price, I guess you could do worse than this TV.  However, it has a lot of issues.  For one thing, the menus start to perform slowly or won't respond at times. The Hulu app is a weak version of the regular app found on other TV's and tablets.  It won't keep track of the shows you watch, so when you want to see a new episode of one of your favorite shows, you'll have to search for it or try to browse the menus. Hulu also used to freeze a lot during commercials, and I would have to exit the app and reload it.Well...none of that seems so bad now.  One day I got a message that Philips had a firmware update to install.  After the upgrade, Hulu wouldn't play any videos.  It just freezes with a message saying \"Your video will resume in 1 second.\"I had this problem once before with a Samsung TV, and all I needed to do with that one was change the clock settings. Unfortunately, the Philips TV doesn't have any clock settings.  I tried to reset the TV to its factory settings, which was a drawn out process requiring me to use a pin number.  After resetting the TV, I found that the firmware had NOT reset.  There is no way to go back to the old firmware.  Hulu won't work anymore.  Plus, they added some stupid Target app that I didn't want.I tried to contact Hulu for help with this and they were not very helpful either.  They suggested I try using a lower quality setting or unplug the TV for 60 seconds.  Neither of those things helped. I bought this TV specifically because it had Hulu Plus, and now I can't use it.", "Date": "January 20, 2014"}, {"Title": "complain", "Author": "Nelson Jahin Angulo Mendoza", "ReviewID": "RZC8H9MR4RGDP", "Overall": "1.0", "Content": "The television isn't working, what can I do? I'm in Dublin and I have a convertor but when I connect it doesn't do nothing. Thanks", "Date": "April 16, 2014"}, {"Title": "No audio input for the VGA", "Author": "Keith", "ReviewID": "RKOBENJK0AT94", "Overall": "2.0", "Content": "I bought this to also use with my laptop that has only has a VGA output and not an HDMI. Well, there is no separate 3.5mm audio jack for the VGA input and only a headphone jack in the rear. When I plugged in the audio cable attached to my VGA cable into the headphone jack, there was no sound out of the TV speakers. The picture quality was also quite bad from my DVR using an HDMI cable oppose to a really good picture on my much older 26\" TV. The power cord is also to short.", "Date": "January 18, 2014"}], "ProductInfo": {"Price": "$238.99", "Features": "Brilliant LED images with low power consumption\nSRS TruSurround XT sound performance for unmatched audio\nSeamless connectivity with 3 HDMI inputs and Easylink\nHigh Definition Resolution\nEnergy Star rated for low power consumption", "Name": "Philips 29PFL4508/F7 29-Inch 60Hz LED HDTV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/316yIHSRNrL._SX300_.jpg", "ProductID": "B00BBDKYP6"}}