{"Reviews": [{"Title": "84lm9600 Review", "Author": "Marvin L. Ostermiller", "ReviewID": "R2JVRHVM8LI6ZY", "Overall": "5.0", "Content": "I set up the television four days ago. First, you can find it on the internet for less than $11k. The Sony tv's have come down about $1k after being on the market for two weeks.I received mine in a heavy boxed crate that took about 1/2 hour to take apart. This tv is a beast. It takes two strong men to carry as it weighs 155 lbs without the stand.It is large and bulky.Secure it on the stand and it weighs 180 lbs by the time you place it on a stand. The stand swivels 6-8 inches so you can adjust the viewing and get behind the tv for easier access.Set up- the magic remote works great. Think of it as a mouse that you can use to get through the initial set up and on-going use. The only issue I had with set up was getting my WiFi to work. It took me 5-6 tries before it recognized my network. Adding components is a simple process. I upgraded my components (Samsung BD-F7500 DVD player, Denon AVR-X2000 receiver, and Mediabridge cables. The DVD player and receiver are capable of 4K and 3D throughput and upscaling. The only other issue, my Comcast cable box didn't like the 4k cable- video quality was great but sound quality was downgraded.Results- My seating is 10-12 feet from the tv. I think this is ideal for this tv. The general rule is seating take the height of the tv times three. This tv is nearly four feet high so 10-12 feet would be right. According to some sources, reduce the distance in half for 4k tv. I don't recommend as it feels you are in the front row of the movie theater.Blu-ray (regular, 4-k mastered, and 3D) viewing is exceptional. People have used terms such as lush, brilliant, astonishing, and 3D qualities (when not it 3D). I would agree. I have never seen a tv or a movie theater this good. My family agrees. There is no doubt the upscaling makes a big difference. I was watching on a Samsung 61 Inch LED which I thought was excellent before. No comparison. Compare the 4k with any non4k on upscaled media- the 4k tv will blow it away. I played around with the color adjustment and found the Vivid to my way of liking. Other than the crystal clear picture, the color range has more shades and is more brilliant than any tv I have seen. One reviewer, made the comment that off angle viewing led to considerable drop off. I haven't notice much.I viewed the recently released 4k mastered original Spiderman. These are a bit of a ripoff. The original is 4k but the purchased copy is maybe 2K according to my DVD player. Even so, the picture is exceptional- crystal clear and brilliant colors.3D viewing is a huge bonus. I have never been a fan and would never have bought a 3D tv. This tv will blow you away. It comes with six pair of passive glasses. You can buy more them for $3 each or less. The picture quality is cleary 1080P quality at a minimum. The 3D effects are amazing. I viewed 6-8 top 3D movies (Avatar, Jurassic Park, Titanic, MegaMind, and others). The viewing is exceptional. I have seen a number of 3D movies at the theater and almost always go away dissapointed. Not so with the LG. The 3D effects are smooth, precise and \"in your face.\" The passive glasses are a big plus compared to the active glasses. Cheap, lightweight, and easier on the eyes. The active glasses shutter on and off real fast. Your eyes can't see them but I think your brain senses something is not right. I know active glasses fatigue my eyes.Comcast cable HD viewing is fine but not exceptional. I don't know if there is any noticeable upscaling going. The cable viewing is better than comparable large sets. However, it begs the question when will 1080P to 4K viewing be available for the consumer.If you looked at the tv, you have seen a huge bundle of features built (Google apps, Smarttv, etc.). I won't comment on those as I as still trying to wade through these but that is not why you would by this tv.Cons- Lack of 4k content. I have talked about this with LG customer service and they are waiting word from the Korean headquarters. I have tried downloading 4k content from YouTube with limited success. LG has provided some additional instructions so I will try again. It looks like others (Sony, Intel, Red, and Apple) might take the lead in 4k and LG will follow but it is too early to know.", "Date": "June 11, 2013"}, {"Title": "Better than a movie theatre", "Author": "jeff e marks", "ReviewID": "R28BF8UADLFVS5", "Overall": "5.0", "Content": "I've been working on my home theatre for about 8 years and now it's complete . Now it's a true theatre. The 84LM9600 is in a word just simply jaw dropping. Me and my friends just keep watching it and saying wow.the other day we watched avatar on it in 3d and it was a better 3d experience than we had at the theatre when it first cme out. It was like watching for the very first time. It makes me want to rewatch my entire bluray collection all over just to see what it will look like on this amazing tv. I am so glad I got this set. It comes with some great per loaded apps like amazon so you can take advantage of amazon prime in a whole new way. If your considering this 4k tv you will not be disappointed. And you will blow your friends away when the see it in action. Everything from breaking bad to football is simply amazing like noting you ever experienced. I couldn't be happier.", "Date": "September 5, 2013"}, {"Title": "Amazing", "Author": "PAULO JORGE C PEREIRA JR", "ReviewID": "R28VKYYO0DFR1W", "Overall": "5.0", "Content": "At first, the resolution wouldn't go up. Everything was connected properly but it wasn't upscaling. Then we tried a 3D movie and bam! It was all there, gorgeous. Best image I've ever seen.After that, it worked right every single time. With iTunes, Netflix, Comcast, Blue Ray... whatever I threw at it, it totally delivered.Movies and even TV look like a gigantic, moving, well printed photo. Really. And I'm not even talking about 4K content, just HD content, upscaled. Colors are bright, motion is crisp. Can't think of a single criticism.The 2D to 3D feature is cute - makes regular tv and movies have a certain dimension, mind boggling. A good trick, but probably not worth the hassle of wearing the 3D glasses. Especially if you already need help to see the real world like me. But real 3D movies look impressive, even if you are not a 3D fan, like me. I heard about how you can use the 3D feature and glasses to allow two people to play videogames, full screen (each person using one of the channels. If you are a gamer, go for it. Sounds like fun.An advice: for your first movie, try Life of Pi and you will be up for a treat.PS: I have never done a review here. But this one deserves it.", "Date": "September 17, 2013"}, {"Title": "What a great way to be entertained!", "Author": "Bobbbo \"Bobbo\"", "ReviewID": "RANBCKXRJQNQK", "Overall": "5.0", "Content": "I got this set about 1 week ago. This TV takes you to a new level in entertainment. My biggest interest in getting this TV was to watch sports, but any show completely changes your experience. The picture is so big and so clear and that you feel like the people in the shows are right in your room. You feel part of the show. Something both my wife and I noticed this after watch the first show. Sets of this size that are 1080p have to be viewed from a farther distance or you start seeing the individual pixels. Since this set up scales the 1080p to 2160p quite well you can sit much closer bring the content into your room.The edge back-lighting issue the Pros seem to complain about as the only drawback to the TV's performance appears to be fixed. Blacks are Black everywhere on the screen.As for the 3D Experience, LG uses the passive process, so the glasses are light weight, comfortable, and inexpensive. The passive technique uses every other line of the 1080p for each eye, meaning your picture is 1920 by 540 per eye. But since this TV is 2160p the 3D is the full 1920 by 1080p. So the short coming of this technique is solved.I have just started exploring all the Smart TV features of this set, but I did notice you will want a hard wired Internet connection as the WiFi is just not fast enough to stream HD content.", "Date": "November 11, 2013"}, {"Title": "Best TV", "Author": "Neal Singh", "ReviewID": "RSJ6DYTIPU70U", "Overall": "5.0", "Content": "I got this TV in Feb 2013.  I had it shipped to me from a freight company and it arrived inside a full wooden crate.  Once unpacked, the stand and the TV look amazing (turned off).Once the picture is on, it was perfect.  I have viewed Sony's 4k TV's side by side with the top selling Samsung LED, and it didn't compete.  This TV, at 84 inches, looks nearly as good as Samsung's 75 inch for 1080P signal.  There is something about Samsung motion control that outperforms this though.I have had the pleasure of watching one 4k film, through a 4k compter that I have attached to it.  It is the film Timescapes.  It looks great, but only lasts 30 minutes and has no speaking.  Visually, it is stunning.  For everyone who hates on 4k, once you see it in action you will be wowed.  Everyone who has seen it has said woh.GAMING is the one thing that is not the best on this TV.  I have been able to adjust the settings to being it to par with other 1080p TV's but with the technology in this TV and the upconverting of signals, it can create lag.  In a shooter game, it makes It unplayable.  In order to undo this, you must play in game mode, which sacrifices much of the bells and whistles to make it exceptional.  Just remember to put it back into your regular viewing mode when done with games.The passive 3d is much much better than active.  It does not work at a 180 degree side angle, but almost any other angle can see it well.  I would not buy another active glasses TV as I do not like the dimming (might as well buy a plasma)The remote is good, but the new more modern smart remote from LG is far superior.  There is something to say about having the first one though.The TV has been through a move, and still is running.  You really cant find anything close to this in quality or size.  If you want the best TV that is out, get this one.  I have done extensive research on televisions and have owned many TV's in this same class.", "Date": "December 17, 2013"}, {"Title": "Hands Down, Best large format TV!", "Author": "Jedi Knight \"Jedi Knight 1975\"", "ReviewID": "R1P3S9EMDKAY0I", "Overall": "5.0", "Content": "After trying out a few large format tv;s over the past years, I have finally found the best. I am extremely happy with the picture quality and the 2D to 3D feature for all programming..Must buy TV", "Date": "August 16, 2013"}, {"Title": "Beautiful picture quality, stunning!", "Author": "Usher Morgan", "ReviewID": "R9OWYT0RB4J1U", "Overall": "5.0", "Content": "I am amazed at the quality and image clarity of this monstrosity. Wanted to set up a screening room and this was the best and largest TV I can find for the price, so I ended up paying around $9K at \"BestBuyPSC\" and got it delivered in 3 days. I can't get it to recognize my Wifi yet, but still - so far, the image quality is just amazing! I really enjoy watching 4K projects on this baby. If you're job includes screening films and 4K films - this is much better than any projector you can buy for that amount of money.", "Date": "December 21, 2013"}, {"Title": "LG 84LM9600 84 inch 3D 240hZ", "Author": "Eugene H. Tate", "ReviewID": "RYCWDW1W3TPZP", "Overall": "5.0", "Content": "Just buy it, you will not regret it! It is everything you will want, I mean everything!! I love mine, very good quality!", "Date": "February 7, 2014"}, {"Title": "Well Worth it", "Author": "K. J Sund", "ReviewID": "R1ESQDQ8MCKLKB", "Overall": "5.0", "Content": "I sold my wife's car and cashed in our retirement to get this tv and it was totally worth it. Granted she has to get up a hour and a half earlier to catch the bus but we're saving on has and insurance so that's good. The picture is so clear and life like. It's just as if I'm looking out a window. Only a much nicer window then the ones we have since they're kind of dirty, and the view from them sucks. I've also found it helpful to cover all the windows in my living room so no gets any ideas about stealing my tv. It's ok because I hung shades on either side of it and now I can pretend I live where ever I want! The picture is THAT GOOD!!!!!  I can't recommend this TV enough. If I could give it 14 stars, I would. It's that good. And all the educational programming my daughter can watch on it should help her get a schoralship (at least I hope if will cause we can't afford college now). Again, don't hesitate, just buy it. Plus it's Prime so you get free shipping!!!!!!!!!", "Date": "January 30, 2014"}, {"Title": "This tv cannot accept 4k!!", "Author": "Quentin Tarantino \"Quentin Tarantino\"", "ReviewID": "R21ML96KSHXWZY", "Overall": "1.0", "Content": "Until hdmi 2.0 enabled devices tvs will not even be able to accept 4k.  This will just up convert 1080p.  Don't buy until hdmi 2.0 devices are out", "Date": "February 6, 2014"}, {"Title": "Looks amazing over my fireplace.", "Author": "Jill", "ReviewID": "R3AT9H0YQA1G59", "Overall": "5.0", "Content": "We got an amazing Black Friday deal for only $14,000.  We feel like we are at the movies!  We had to choose between this and a unicorn for the same price and decided that a $14,000 TV was a wonderful idea. Since unicorns don't like the snow and cold, we would be unable to ride it all year long. The TV we can use everyday!", "Date": "December 14, 2013"}, {"Title": "It can change your life!", "Author": "The Best is Yet to Come", "ReviewID": "R7F9C4O1XDB40", "Overall": "4.0", "Content": "TV is Fantastic!  Unfortunately it would not fit through the maze of doorways into main Family room.. Currently sitting in the garage plugged in, next to the snowmobiles.  Wanted to knock a wall in to fit the new set, but the wife just had some very expensive wallpaper installed, lifted from some old Library in Ireland, so that's out.  Can't have it in the Living room, as it does not match the decor of Elk Heads and Italian Marble.Fortunately, a neighbor who is a contractor saw my dilemma, and offered to enclose part of the garage as an entertainment/media/snowmobile room.Currently debating that addition, or just returning the monster and giving everyone an iPad Air for Christmas.", "Date": "December 11, 2013"}, {"Title": "Great but", "Author": "Kendall Garcia", "ReviewID": "R25YOVUVSKUZBI", "Overall": "5.0", "Content": "I sold my wife to a stripper bar sold both card and my dad's home for this tv now I'm leaving on the street with a shopping cart with nothing but my tv the. I realize where am I suppose to plug it in at? But the box is big enough to sleep in :) I be damned $20000 tv smh", "Date": "February 19, 2014"}, {"Title": "Great buy!", "Author": "Michael DeMaio", "ReviewID": "R9L3W18L1DOXN", "Overall": "5.0", "Content": "I was really happy with this tv so I bought one for each of my 5 homes. I'm normally on tour 6 months out of the year, but when I'm in my L.A. pad, or my house in Malibu, I always enjoy sitting back with my friends and enjoying the quality that this tv puts out.", "Date": "March 12, 2014"}, {"Title": "Wish someone had shown me this tv before i bought the samsung 4k", "Author": "Speshl J \"Justin\"", "ReviewID": "R1HY1DW88B5YBC", "Overall": "5.0", "Content": "I sold my home and my kids to buy the Samsung 84\" 4k tv for $40lk.  I definitely could have still stayed in my home had I seen this one first. Probably could have had monthly visitation rights with my kids too...oh well", "Date": "December 25, 2013"}, {"Title": "amazing", "Author": "Silvestor thyon", "ReviewID": "R2NM3QHSELBP62", "Overall": "5.0", "Content": "My grandfather recently passed away and he left me and my brothers exactly $14000.00. At first i thought about splitting the money with the rest of my family but whatever they where planning to use the money for wasnt as good as this purchase. Thanks to amazon prime i got free shipping i couldnt believe it.  I had to go into my kids college fund to get the $2000.00 in tax but they could always get there ged or watch hooked on phonics on this amazing 4k tv. im watching the news as we speak.and i feel as if i am with the newscaster capturing this shootout. The tv was delivered in a huge wooden crate and didnt go through my door so we had to rent a piano crane take out the windows and bring it in. I still havent been able to open the box but i can just tell the tv is amazing. Hopefully by the middle of the summer i can get this crate open.", "Date": "January 30, 2014"}, {"Title": "FANTASTIC TV! BUT WILL LG BE COMMITED TO 2.0 HDMI ( NO FIRM COMMITMENT)", "Author": "Edmund E. Meyer", "ReviewID": "R1PSJKOMII9MJK", "Overall": "2.0", "Content": "I'm thinking of purchasing this TV but LG has not made a firm commitment to 2.0 HDMI for this 4K set as of yet.Sony has a firmware upgrade and Samsung has a external device that will convert their sets by years end. Panasonic does have their 4K with 2.0 built in their 65 inch set.THIS TV COULD BECOME OBSOLETE IN ONE YEAR IF LG DOES NOT STAND BEHIND THE STANDARDS OF 4K TO COME!EVERY ONE NEED TO CALL LG EXECUTIVE SERVICE AT 877-543-8325 REGARDING THE NEED FOR 2.0. FOR THE 84LM9600.THERE IS STRENGTH IN NUMBERS AND NOTING WILL HAPPEN IF CONSUMERS DON'T DEMAND FOR A SOLUTION FOR A TV THAT RETAILS FOR $20,000!!!!!!!!!!!!!!!!!!!!IF SONY AND SAMSUNG HAS ALREADY TAKEN ACTION WE NEED TO DEMAND ACTION BY YEARS END LIKE THEY HAVE COMMITED TO. CALL TODAY !!!!! LG EXECUTIVE SERVICE AT 877-543-8325 REGARDING THE NEED FOR 2.0. FOR THE 84LM9600.LET OTHERS ON THIS LINK KNOW YOU CALLED", "Date": "October 18, 2013"}, {"Title": "Wife was not impressed", "Author": "yvonne mcnamara", "ReviewID": "RZEMZ74F9QJKA", "Overall": "2.0", "Content": "The second I saw this beauty on Amazon I knew I had to have it. I mean I only have to take out another mortgage on the house to afford it, but what's another 20 years worth of debt?Sadly my wife disagrees and after purchasing the item she insisted that I returned it. Unfortunately I had misplaced the receipt, lost my job and am living on the street.I was going to give it 1 star for ruining my life, but thankfully it came in a rather large box, which I'm currently using the house myself in. So I'll give it an extra star for that.", "Date": "April 28, 2014"}, {"Title": "MEH", "Author": "Kevin P. Odonnell", "ReviewID": "R2K1C3CDSL99G9", "Overall": "2.0", "Content": "I really don't think the pictutre is that great.  Maybe I need GOLD PLATED MONSTAH CABLES!!!!  FROZEN DVD!!  YA GOTTA WATCH FROZEN, YA JERK!", "Date": "March 21, 2014"}], "ProductInfo": {"Price": null, "Features": "Enjoy 4K resolution on LG's 84-inch class Ultra High Definition TV.  Now you can experience entertainment that's larger than life.\nLG Ultra HD TVs are 4 times the resolution of Full HD for an ultra clear picture, even on large screens.\nAccess premium content providers like Amazon Instant Video, Hulu Plus, Netflix and YouTube direct from your TV with the fun and easy to use Magic Remote.\nLG's Cinema 3D technology uses lightweight, battery free glasses to deliver an immersive 3D experience for movies, TV shows and gaming, all with amazing picture quality.\nTV without stand (Width x Height x Depth): 75.4 x 44.1 x 1.6, Inches, TV with stand (Width x Height x Depth): 75.4 x 47.8 x 15.7 Inches", "Name": "LG Electronics 84LM9600 84-Inch Cinema 3D 4K Ultra HD 240Hz LED-LCD HDTV with Smart TV and Six Pairs of 3D Glasses", "ImgURL": "http://ecx.images-amazon.com/images/I/41MHDxikLpL._SX300_.jpg", "ProductID": "B00B10UAAS"}}