{"Reviews": [{"Title": "Great TV, Takes a little setup to get a great picture, but looks amazing once it is done!", "Author": "Zachary Dunklee", "ReviewID": "R2IGY0Z61U3HLO", "Overall": "5.0", "Content": "The setup was very quick and it had no issues connecting to my Wi-Fi. I had the TV up and running in about 15 minuets after its arrival at my door. Netflix is much better than it is on my xbox and loads quickly even with my slower DSL connection. I have not tried the 3D settings yet, but 2D looks great. I also have it hooked up to my surround sound and so I have no idea what the TV audio actually sounds like. I'm sure it isn't any better than any other flat screen TV.Here are the settings I used for picture quality:Start in Movie mode and change these settings:Color Temperature:Red Gain: 84Green Gain: 90Blue Gain: 100Red Offset: 110Green Offset: 100Blue Offset: 100Advanced Picture:Color Enhancement: Rich ColorAdaptive Luma: StrongFilm Mode: OffSmart Dimming: OffAmbient Light Sensor: OffThe only other change I made was to increase the backlight from 55 to 65. This just causes a brighter or darker screen. These settings take care of the yellow tint that the TV starts with and makes pictures look great. If you want it darker or lighter you can cut the color temps in half or increase them by the same ratio in order to keep quality colors as well.", "Date": "January 31, 2013"}, {"Title": "VIZIO E420d-A0 - Best Vizio 3d 42\" Tv", "Author": "mb8873", "ReviewID": "R3OKVDS45NGDG8", "Overall": "5.0", "Content": "Wow. I am totally blown away by this 500$ 3D Led flat screen Vizio tv. It has exceeded all my expectations. JD Power and Assoc calls Vizio the gold standard in flat screen affordable tv's and now I can totally see why. Vizio makes another 42 inch LCD 3d tv which also from what I have seen is a great set as well but I have to say this model is the better of the two. The LED which to me outshines the Lcd model and 2 million contrast ratio ( the other has 200,000) make this 120htz tv really pop. The color and clarity will really shock you too. I have seen alot of great tv's, my family owns all the hi end 2500$ tv's including a couple of 3d's and this tv can hang with them all. The 3D is so rich and clear and the black levels are the best out of any tv ive owned (my previous set was a sony 42\" Bravia 1080 60htz flat screen for 800$). I did alot of reading before I bought a new 3d tv and really didnt feel like spending a 1000$ to get what i wanted and I have to say I am one happy guy and so will you be. The one thing you hear alot of negative reviews on is usually the audio , not on this set it is outstanding. I purchased a soundbar when I ordered the tv because of the ongoing sound issues with flat screens but when i connected the tv the quality srs surround sound that came out of this 3.5 inch thick 30lb tv blew my mind. When i eventually hook up the sound bar it will only be that added bonus but the set does not require it as most models in its class absolutely do. I am watching green lantern in 3d as I write this review and i must say it was worth the research and waiting to purchase such an overacheiver!", "Date": "January 25, 2013"}, {"Title": "great product", "Author": "GeetarJake", "ReviewID": "R3MXQE1AKM7167", "Overall": "5.0", "Content": "The picture on this TV is amazingly good. 3d looks great, I've used it for watching blu rays, netflix, and playing ps3, and with a few little picture tweaks you can really get a great image. There's no motion blurring at all, and the contrast is just awesome.My ONLY complaint is that the manual says to use an 8M 1.0 pitch 20mm screw to install the set onto a wall mount, however, after several trips to the hardware store, multiple conversations with Vizio Support(who also gave me those same screw specs) and some trial and error, I discovered that it's actually supposed to be 1.25 pitch. That would have saved me a few bucks, and lots of time and looking like a jackass going to the local hardware store half a dozen times buying different screws. Other than that, I couldn't be happier with this set, it works great.", "Date": "August 29, 2013"}, {"Title": "Nice Picture, Terrible Apps, Clueless Vizio Support", "Author": "Refuge Denied", "ReviewID": "R2R8I4N2RQK2KQ", "Overall": "1.0", "Content": "Ordered Wednesday, May 29, 2013.  Received Friday, May 31, 2013.On Amazon this TV seems to have great reviews so I purchased it a few days ago.  This was to go into a bedroom mainly for Netflix use.When I received it I immediately started to get it set up.  I hard-wired it to my router, plugged in an HDMI cable from my cable box to the TV, plugged in the power.  After the initial setup, I tried to use the Netflix app - no option for \"Yes, I have a Netflix Account\", just \"Unable to connect to the Netflix service - Try again or Exit\".I tried the YouTube app and it worked fine.I reset the TV to factory defaults (Menu > Help > Delete Memory (Factory Restore)), but this didn't help.  In fact I tried this twice over the next 12 hours.After a search of the problem it seems Vizio has a lot of problems with Netflix.  Even if your TV works fine now, a future update (that you have no control over) may bork Netflix or other services until a new patch is released.  This can be weeks or even months in some cases I found online.I called Vizio support this morning (Saturday, June 1, 2013) and the guy gave me 2 different and unrelated reasons Netflix won't work properly.  He had me factory reset the TV a third time and still no luck.  He said it was probably a problem with my router or that Netflix was down.  I told him both my Roku and PC can view Netflix just fine yesterday and this morning and that the TV could stream HD YouTube videos just fine.  Then he said it might be a bandwidth issue.  I said the last speed test I did showed 52 mb/s down and 6 mb/s up.  That couldn't be the problem.He then asked me to plug the TV directly into my modem and let it sit over the weekend.  What??  I said I use my internet connection for work and that wasn't an option, but I reminded him that it is wired (not wireless) into the router and it CAN connect to other online services.  He then told me to send it in to Vizio (on my dime) for warranty repair.No thanks.  I told him I would just return it to Amazon and get a different brand.  This was my first experience with Vizio.  I'll stick with Samsung, LG, and Panasonic.I called Amazon right after.  The tech at Amazon had me try a few things and eventually said its faulty and he set up a return.  UPS will be out to pick it up on Monday.  Amazon is awesome!All that said, this TV DOES have a nice picture out of the box.  Tweaking it using the settings that another reviewer posted here just makes it better.  The picture looks just as good my LG LCD and almost as good as my Panasonic plasma.If you are looking for a TV with the convenience of apps, look at another brand.  If you think this is a good price for an LCD and don't need the apps, this might be a good buy for you - again, the picture is great with an HD source.** UPDATE June 05, 2013 **I ordered a Samsung UN40EH5300 the day I setup the return for this Vizio.  I received the Samsung yesterday (arrived in one day with free shipping) and everything works great out of the box.  A couple of setting tweaks and the Samsung has an outstanding picture.  I will leave a review for the Samsung after I've had it for a while and follow up with any problems if I encounter them.", "Date": "June 1, 2013"}, {"Title": "Amazing picture. Okay 3D", "Author": "TheDaywalker47", "ReviewID": "R56GZDFRVLE6Z", "Overall": "4.0", "Content": "The picture on this TV is amazing, once you can get the settings that you like (I will post mine at the end). The 3D on this TV on the other hand is probably the worst I have ever seen. You pay an extra $20 for this version over the non 3D version and believe me you get what pay for. I also have a 47\" LG Cinema 3D LED TV as well and it is half the thickness of this one with much better 3D and I only paid $650 for that one at Walmart because it is not a smart TV. The apps on this TV are okay the Netflix and VUDU work great but the amazon instant video is worthless if you have prime because it is hard to find the free movies.  It also has M-go which is completely useless if you have an amazon or VUDU account. There about 80 other apps (music, movies, news, social, sports, and games) but I don't have a use for any of them on my TV.(if you are looking for a good smart TV go with LG or Samsung they are the best). if you are looking for a LED TV with great picture for a great price than I recommend this one; however, if you do not already own a 3D TV do no make this one your first one. Plus all video and audio settings must be adjusted for each input plus 3D mode and for any smart TV video apps. Now for the best picture quality uses these settings:Picture mode: CustomBacklight. 55brightness. 50contrast 75color 60tint 0sharpness 12 (can adjust to your liking)color temp: choose custom but leave the defaultsadvance picturenoise reduction  lowmpeg nr  lowcolor enhancement offadaptive luma strongfilm. autosmart dimming  offambient light sensor  offthis will give you white whites without the yellow tint with good darks and clear edges. note: you will need to change this for each input plus 3D mode. as well as for any smart tv apps that play video (its annoying)", "Date": "August 15, 2013"}, {"Title": "AWESOME TV!!", "Author": "Dahlya", "ReviewID": "R308ELJR22DIEI", "Overall": "5.0", "Content": "This television exceeds all my expectations many times over! The quality of the HD was to be expected, love the smart tv features, but the 3D is just outstanding!! Price was fantastic. Arrived quickly. Would definitely purchase another!", "Date": "May 12, 2013"}, {"Title": "Great TV but not so smart.", "Author": "Dusty", "ReviewID": "R1LIXUVL351QX1", "Overall": "4.0", "Content": "I just received my TV today.  Unboxing and setting up is easy enough.  Power on and follow the screens... the first thing you're prompted to do is connect the wifi.  It took 3 very smart friends, 2 hours, and 1 lengthy call to tech support to get it connected. It seems the TV only responds to super simple passwords... so we had to reset my wireless router back to factory defaults and configure from scratch to get the TV to accept the password.  More trouble than I've had from most devices.That said, Tech Support was very helpful and a pleasure to work with.  Once connected though, I find the built in apps are pretty much worthless.  The Amazon and Netflix apps are tedious to navigate.  To use the Hulu app, you need to subscribe to HuluPlus.  There's no Pandora, no YouTube.  There are a bunch of Yahoo apps that are a decade past their prime.  I don't recognize, or care about, any of the others.  Bottom line... I'll be hooking my laptop up via the HDMI and using that for web access, just like I did my non-smart TV.  So the Smart TV aspect of this box is worthless unless all you care about is streaming Amazon, Netflix or HuluPlus.. and you have the patience to click endlessly to navigate the interface. I have a USB wireless keyboard I'd like to use, but so far can't get it to work.  I think you're limited to using the remote for input.On the plus side... the image quality is awesome.  The styling is beautiful.  Sounds great.  Previews of some 3D movies are very promising... I think I'll love the 3D.  I did try the 2D to 3D function.. though I haven't figured out how to get it to work yet.  I'm thinking it will be more complicated, and less impressive, than it's worth to figure it out.I'd get this TV for the image quality and 3d alone.  The Smart functionality is just a small bonus.  I'm happy based on the price I paid.  If I paid full price, I'd expect more from the wifi capabilities.", "Date": "January 31, 2013"}, {"Title": "Love this TV", "Author": "Jeremy", "ReviewID": "R1FVSTB505JWLM", "Overall": "5.0", "Content": "Gave this to our son for a graduation gift.  The 3d on this thing is amazing and the apps built in are fantastic.  The remote is laggy though and sometimes seems to not work at all.", "Date": "May 7, 2013"}, {"Title": "Best TV I've ever owned.", "Author": "Karlos Kistaman", "ReviewID": "R35PZYCY3GQMJV", "Overall": "5.0", "Content": "As the title states this is the best TV I've ever owned, and I've owned over 10 flat screens.  3D is perfect, WiFi is flawless, screen is amazing...sound is excellent....LOVE THIS TV.", "Date": "January 25, 2013"}, {"Title": "Good TV, Software is glitchy and freezes.", "Author": "Mike W.", "ReviewID": "R2Z3CHNGX8G0RA", "Overall": "4.0", "Content": "Pretty good picture.  Software is a little glitchy, sometimes will freeze and ignore the remote and buttons.  The only way to restart it when it freezes is to pull the power plug from the back.  Not a huge deal, but it happens about once a week.  It might be a pain if your TV was mounted on the wall or something.  Netflix and Amazon prime work well, not really many other useful apps.", "Date": "November 21, 2013"}, {"Title": "Awesome gaming tv", "Author": "jro2020 \"James to you\"", "ReviewID": "R3LK1FLTTF9MMF", "Overall": "5.0", "Content": "This may be the conformation bias talking but I really like my tv.  My only real complaint is that the number of smart apps that you can install at once seems very limited and it doesn't support dlna or any sort of streaming protocol for local network based content that I can find.  The 3-d is very good and not having to charge glasses is wonderful", "Date": "November 8, 2013"}, {"Title": "Best choice", "Author": "Andrea Hill", "ReviewID": "R30NVHLY0DLPZL", "Overall": "5.0", "Content": "I spent a great deal of time researching a new TV after making an impulse purchase on a Samsung 39\" TV at Walmart(Took it back due to poor picture quality and price.) I was reluctant on getting this TV because some of the reviews. I am super glad I did  because the picture quality is superb, Vizio support is awesome, the 3D feature is great, the sound is very good, and it works super awesome as a computer monitor via HDMI. If you are on the fence about this TV I have to say I have zero regrets on this purchase. The quality and price far exceed my expectations.", "Date": "October 25, 2013"}, {"Title": "Great price on a full featured TV", "Author": "Marc K.", "ReviewID": "RHKGNUWYM65WY", "Overall": "5.0", "Content": "My Tv just arrived today and this is a great deal. Amazon price matched Dell's price of $508 so i got an Awesome price on an already inexpensive Tv.Pros: Great price, decent selection of apps, the remote has an Amazon instant video button(and a Netflix button). I tested the 3D function with Crysis 3 and was quite pleased. The 3D causes little to no eyestrain versus the active shutter type Tv's which can become very uncomfortable during a movie. The buttons make a very satisfying \"click\"(not a noise, you feel the button click) when pressed and have a very grippy rubberized finish(the remote itself is glossy plastic on the top, and matte plastic on the bottom.)Cons: Remote has very small buttons but can easily be used with one hand. For size reference, the remote is 5 3/4\" by 2\" or slightly skinnier but a little longer than an iPod touch. The apps are a little laggy. You have to wait a few seconds for the app bar to open, sometimes the apps freeze for a few seconds. The amazon instant app takes a long time to initially buffer(about a minute-vs 20 seconds on my computer), but it does not stutter at all while playing. I am running over Wifi, but all of my other devices are much faster when used in the same location as the Tv. The Tv has a yellow hue but Zachary's settings fixed that(they are a great starting point but i might tweak the settings a little). The glossy finish is a literal dust magnet, but now i have an incentive to clean more often.Even though the remote is tiny, it is still very usable but i wish the buttons were slightly taller(are wide and skinny. 4mm tall, 10 to 14 mm wide. The volume, channel, amazon, Netflix, and directional buttons are a little larger though.If you are still using Composite or component video, note that you can only have 1 type plugged in at a time since the jacks are shared between those two types.Finally, my Tv did have 1 stuck or dead pixel, but 1 in 2.7 million is a really small failure ratio, and it is only visible if you are within 2 feet of the screen.If you are on the fence about this, buy one, you won't regret it. The colors are rich and vibrant, the bezel is very slim(1/2\"), and the 3D works great. Why pay more for the same features? Even my listed cons are minor enough for me to not even think of knocking off a star.", "Date": "February 28, 2013"}, {"Title": "why did I wait so long?", "Author": "Percy104", "ReviewID": "R26A1192AFAQMI", "Overall": "5.0", "Content": "This is my first flat screen hdtv and I guess I waited until now to purchase one since the price and value reached a very attractive point.  It was easy to set up and the picture, like many others have said, was terrific...and this is with an over the air signal!  The recent PBS Bocelli concert in Portofino was extremely enjoyable to watch. Wonderfully vivid detail. The only quibble I have, and it's a small one, is that the on-screen program information doesn't allow you to see what's coming up on that channel later in the day/evening.  All told, I'm very happy with this tv and highly recommend it to anyone looking for an excellent  quality picture and features at a very attractive price.  Thank you, Amazon!", "Date": "March 24, 2013"}, {"Title": "Great Value", "Author": "christopher overton", "ReviewID": "RM5KJETGFQ4BP", "Overall": "5.0", "Content": "I don't right reviews but in this case I made an exception, this is the most bang for your buck that you can find. Crystal clear picture if your signal is 1080 I or p. smart features are ok and the 3d is nice but the quality of the picture rivals,Sony,Sharp,LG,Samsung at a better price for the consumer.", "Date": "May 11, 2013"}, {"Title": "Fantastic product, fantastic features, fantastic price", "Author": "Timothy M. Price", "ReviewID": "R38LZRUA0XQUL7", "Overall": "5.0", "Content": "Vizio is a great brand with yet another great product.  I have owned a Vizio plasma for years and it is still going strong.  This is my first venture into 3D and web-enabled TV, and although I have yet to try out all the features, this TV is impressive.  The colors are comparable to my plasma (after making the adjustments Zachary mentioned), but it runs SO much cooler.  (Need things to run cool in my part of the country!)  I have mine mounted on the wall, and it looks great.I did order a second remote to have one with a keyboard on back.  Glad that I did that, and yes, it works with this TV just fine.I would order Vizio again in a heartbeat.Pros:-Price-Cool Features (3D, Web, SRS)Cons:-Power cord is a little short-No QWERTY keyboard", "Date": "February 7, 2013"}, {"Title": "My wife loves it!!", "Author": "TMC", "ReviewID": "RJ05AKWX4JI95", "Overall": "5.0", "Content": "My wife has been hounding me to get her a 42\" 3d television. After many months of agonizing research I opted to select this model. Set up today went well, the only hiccup was trying to figure out how to use the Vizio remote (non qwerty) to input letters during the process (either the \"V\" key or the OK key brings up an onscreen keyboard). TV works like a charm, wireless connectivity is excellent. The \"apps\" updated automatically once the initial set up was completed. The picture and sound are terrific, my wife is ecstatic that I purchased this television for her (it is her Christmas present). I will update this review after my wife has spent some additional time with her gift.", "Date": "December 24, 2013"}, {"Title": "Everything I Hoped For", "Author": "MattC", "ReviewID": "R1OCMJM6C7LQC2", "Overall": "5.0", "Content": "I must say that buying this Vizio about a month ago was one  of the better decisions I've made regarding electronics.  I like everything about it.  I even like the remote even though I did order one that can be used with this model but also has a keyboard on the backside.  I like it very much too.  This set just has a great picture. There's just no other way I can express how I feel. The sound is so good that you don't have to run it through a home theater system.  I watch it sometimes using the built in sound and other times with a home theater system. Sometimes you just want to hear all the sound effects that are contained in some of the newer movies. I think this Vizio has great contrast and I like pretty much every channel that I subscribe to.  They all look good. Of course dvds look great too. They don't have to be blu rays. Blu Rays do look even more wonderful though.  I do want to mention that I bought another model for another room. It was the 40\" model with a different model number. It doesn't have 3d. I ended up taking it back because it didn't have the picture this model has. This set can be placed in a room with bright light and you can still see the details in the picture. The other model was terrible in bright light conditions.  If you buy this model you will be glad you did.  I guarantee you will love it.", "Date": "November 30, 2013"}, {"Title": "A Very Smart Smart TV with Great Features and Picture", "Author": "C. Johnson", "ReviewID": "R361PDYI4VQ88H", "Overall": "5.0", "Content": "Fantastically featured TV. A very 'smart' smart TV. Really is plug and play in all aspects and features, from connecting to your cable and internet, to picture and sound settings, to pushing a button to instantly switch to Netflix or Pandora, to pushing a button to go from TV to DVD or PS3. Gorgeous picture. Awesome 3D with three 3D modes. Good connectivity if you won't need more than 3 HDMI inputs. The one down side?  The buttons on the remote really are too small.", "Date": "November 22, 2013"}, {"Title": "Great Potential, But Serious Flaws", "Author": "Chet T.", "ReviewID": "R9X8PK5GIWJX4", "Overall": "2.0", "Content": "First off, I purchased this TV from another retailer for their convenience of site to store pickup because I didn't trust them sitting it outside of my house all day.Now, normally I don't review anything I purchased but I felt this was necessary. I purchased this TV mainly because I am in college and I had a pretty poor quality TV that didn't have HDMI capability. I am planning on purchasing a Playstation 4 which only outputs HDMI so an upgrade was necessary.The TV is beautiful. I didn't really know what 42 inches looks like, but it is definitely plenty big for my apartment. The few times I've used the 3D, I had good experiences. It can get a little blurry, however, so I'd give the 3D function a 7.5/10.I've never had a problem with the sound output and it definitely sounds good enough for me. I'd give it a 9/10.However, there is one big problem with my TV. It is especially noticeable when I am playing video games such as Grand Theft Auto or Fifa on PS3. Based on my research, it appears to be some sort of clouding/bleeding. In some areas of the TV, it is darker. It just doesn't look good. It is a big distraction when playing video games. Fortunately, I have a warranty and will get around to potentially getting a replacement.I will post back here when I get my replacement and see if my TV just shipped with it's own problems or if it's all models.Update:My TV was within the 90 day return policy and I have returned it for this Vizio 40 inch M series TV which I am much happier with. I think it has a better picture for sure and is thinner. I didn't use the 3D much because it wasn't super great, but I will miss it a little but the picture on my new TV is fantastic. VIZIO M401i A3 40 Inch 1080p 120Hz", "Date": "November 8, 2013"}, {"Title": "Great TV except for the remote", "Author": "Amazon Customer \"Creative Cook\"", "ReviewID": "R19EI32QTA1UJI", "Overall": "4.0", "Content": "I really like this TV in that you can access things more directly right from theremote in one step instead of 2-3 steps like the TV's before.  The onlycomplaint is the remote is so small its hard to see the printing on the controls.", "Date": "October 30, 2013"}, {"Title": "Pleasantly Suprised", "Author": "Michelle B.", "ReviewID": "RFUQ07A61GNF6", "Overall": "5.0", "Content": "My husband wanted a new TV for the bedroom, and this is the model he settled on.  I liked it because it is WiFi so no wires to hook up to the internet.  He likes it for the additional features like YouTube, Netflix, Amazon Prime, and, of course, the 3D.The only downside (if there is one) is that it uses Yahoo.  I'm not a fan of Yahoo, so there are features that we don't use at the moment because we really don't want to open a Yahoo account JUST for a TV.", "Date": "October 18, 2013"}, {"Title": "Bang for the Buck!", "Author": "Melvin Dawson", "ReviewID": "R1GSCK9OSLKNNP", "Overall": "5.0", "Content": "I got a sweet deal on this feature packed TV. This baby has it all: 3D, 1080p, 120hz, great contrast ratio, wireless connectivity. Everything a big boy needs for the 2014 football season. :) The picture is spectacular, with a gauntlet of adjustable functionality. I haven't tried 3D with it yet, but I will soon. Setup is easy, but with so many options it can truly test a fellow. Nevertheless, once you set it up, you won't be disappointed. I also love the thin border.After signing up with Netflix through the unit, I was stoked on how fast it loaded my pages. Network freeze-ups were none existent (depending on the speed provided by your ISP). I had no problems at all with FiOS.BTW - You can also purchase the remote control with built-in keyboard on the back. A true \"must have\"!", "Date": "September 11, 2013"}, {"Title": "ALL STARS FOR VIZIO TV", "Author": "Laura  Cantrell, Miss", "ReviewID": "RHG6LPKP6OXDI", "Overall": "5.0", "Content": "The 3 D aspect is blowing my mind!!!  It is just fabulous.  Company did a great job.Thank you very much.", "Date": "August 19, 2013"}, {"Title": "Excellent TV.", "Author": "Jim Thomas", "ReviewID": "R1MDV6AON1B11L", "Overall": "5.0", "Content": "I did not need or want a larger TV as my living room is a bit on the small side. However, I did want a 3D Smart TV with WiFi. And this unit fits the bill perfectly. It is crisp, and clear, and the 3D effect is breathtaking. I have yet to use the WiFi as I cannot get it to connect to my home network. However, I think that is an issue with my current password, and not the TV's fault. I would highly recommend this unit to anyone looking for a mid size TV.", "Date": "August 1, 2013"}, {"Title": "Setup Difficult for Non-techie -- Not Your Father's Old TV", "Author": "Noname", "ReviewID": "R2PG99WC2C57VT", "Overall": "4.0", "Content": "My husband chose this Vizio TV because of all the TV's at the warehouse store that fit our cabinet, he liked the picture on this one.  Now, we're not AV geeks.  We just want to watch TV, so the 3D feature is just a bonus we may never use.  Most of the other smart features will go by the wayside, but I have Amazon Prime and was excited about that.My husband put it up after we got it home and promptly declared that it \"doesn't work.\"  Now, if you're old school and just want to plug in the antenna, it's not that easy anymore.  I didn't see whatever he saw at startup because I wasn't there.  He said it was just a blank screen, though the quick start guide said there would be a setup screen.The fix was easy.  He hooked up the cable box, but he didn't scan the channels.  That's all it took to make it work.Connecting the TV to Amazon was super simple.  First, I set up the network through the menu.  Then, I hit the Amazon button on the remote and it took me through all the steps to set up my account on Amazon.  I was up in minutes.  I am so happy I can finally watch my Prime Instant Videos on TV.The audio was set to TruVolume On by default.  I think it was meant to keep the volume steady and not so loud during commercials, but it doesn't help so much as annoy.  My daughter complained that the audio kept getting louder and softer all over the place.  I fixed that by turning off TruVolume.Lastly, I wish the TV would just turn on.  Instead, it now has to boot up.  I guess that's the cost of it being smart.  It needs to think, but once it's on, it's great.Overall impression: good picture, may be a problem to set up for the less techie crowd, turn off TruVolume, love my Amazon Prime Instant Videos!", "Date": "July 26, 2013"}, {"Title": "Nice budget buy", "Author": "Ching-feng Au", "ReviewID": "R3KBK4670K81J0", "Overall": "4.0", "Content": "I just moved to a new place and decided to get a second TV for bonus room. After some survey, I pick this one. After place the order with free shipping, it actually arrived my door the 2nd day it shipped! Amazing.The set up is easy. There are 3 screws on the stand. Easily installed with the hex wrench come with the package. Turn on the TV with remote, answered some questions, that's about it.* ok, have to mention one thing here. The remote is not the most sensitive one and to enter information like e-mails did take some effort. I wish it support usb keyboard *I was surprised that although it has the logo of Youtube on the box, I didn't see it on the app list. I tried netflix, easy enough to use. Turned off.The next day when I turn on the TV, I found that are several more apps being pushed to the TV, including Youtube and Skype. Youtube is easy to use, skype... totally unusable unless you buy the expensive Vizio webcam that is actually discontinued on VIZIO web site.I'm not a big 3D fan but I tested the 3D function with some youtube clips (search yt3d and you can find a bounch). It works ok. If you sit on the couch facing the TV, it feels like in movie theater. But if you stand in a bad angle you see double images.For the price I still think it's a good buy. And one of my friend who is a designer praise the thin edge design.", "Date": "April 8, 2013"}, {"Title": "OMG - Wish I had purchased sooner", "Author": "Ron Coleman", "ReviewID": "R1A0E6SL951VBE", "Overall": "5.0", "Content": "I am on the 3rd day of the great TV and can't believe the quality. Setup, including WiFi, took a whole 5 minutes. Picture quality is outstanding so I thought it could not get any better until I fired up the 3d and watched the world come straight toward me. I had previously purchased a 3d BluRay player for the day my old TV went out. I popped a 3d disk in and all I can say is WoW. Netflix also has 3d streaming and it works beautifully with this great TV. The Apps are plentiful and you can download more via on screen prompts. The only issue I have at all is the cheap 3d glasses. They have a center seam which is rough and begins hurting your nose, looks like they need sanding...however they are the same style as you get at the movie theater and since I forgot to turn in a pair one day, they work the same with more comfort. Buy this one, LED, 3D for under $500, you just can't beat that.", "Date": "October 31, 2013"}, {"Title": "Great TV but no wall mounting bolts included", "Author": "dg113", "ReviewID": "R18VVMRYSD9CA3", "Overall": "5.0", "Content": "The TV is incredible value for money. Found mine at a local big box store for $699. That would be a great value for any 1080p 120hz 55 inch LED, let alone a Smart one with 3D to boot. Setting up Wifi and watching Netflix in HD took all of 30 seconds. So much easier than going through an Xbox/Roku/bluray player. Interface is nice and fast. What more could you ask for for the money?Well, 4 $.50 bolts, actually. If you want to mount this on your TV, you'll have to find them yourself. There were none in my box. Neither the instruction manual nor the back of the TV specify which bolt size you need, either. If you try to look it up, a few sources say to you need M6x20, 1.00 pitch. So that's what I went out and got. Wrong! M6 is too small. After another trip to the hardware store, I got the right size.The CORRECT size is M8x20, 1.25 pitch.TV is mounted now and I couldn't be happier. Really makes you question dropping more on a Sony/Samsung. It is that good.", "Date": "August 3, 2013"}, {"Title": "No frills 3D.", "Author": "Nobody", "ReviewID": "R163G80OWWP6CU", "Overall": "5.0", "Content": "This has a sharp, clear picture and the 3D is not hokey in the least.  I was amazed at how far this technology has come.You still need the glasses (included) for 3D but the effects are truly stunning.  As for regular 2D viewing, the picture is great and easy to see in a wide variety of lighting.  This was a good TV, especially for the price.", "Date": "May 4, 2013"}, {"Title": "Great TV @ a great price.", "Author": "Jerry Isbell", "ReviewID": "R3MQ8TWZG3CKDU", "Overall": "5.0", "Content": "Purchased this last year and it has been great. The passive 3D is awesome. Glasses a very light and comfortable. I have a 73 inch Mitsubishi  DLP that requires active glasses and the 3D is just as good. I would defiantly buy again.", "Date": "March 6, 2014"}, {"Title": "Ok with Caveats", "Author": "3d home theater", "ReviewID": "R1RR2MYHSBAKK", "Overall": "3.0", "Content": "I didn't get mine through amazon, this is just about the TV, but wanted to share my experience.  I've had one of these in my bedroom for some time, hooked up to an inexpensive sony 3d blueray/surround system.  In the bedroom the results were quite good.  We keep the intensity pretty low at night, but the few times we have bumped it up it seems very bright, I get almost direct sun near the TV in the morning and it overpowers that well.  Images are sharp and clear and when it works (see below) the 3d is really good.Since we have had it Netflix has done system upgrades a couple times and in two cases it took some time to see a firmware update on the TV to catch up.  it's always getting to the first Netflix screen that causes issues so I learned to simply move past it by returning to something previously viewed.  Works, but it's a bit quirky.The real issue with mine is that about 2 months after it I started using it with a couple HDMI devices, and then after a short time they quit working.  Since it was just sporadic use I didn't really notice, but then later I wanted to watch a blue ray and discovered that the HDMI port the sony was plugged into was also dead.  I am still using it as a TV and to watch Netflix in the bedroom, but there are no working HDMI inputs.  I've not had a piece of equipment fail in any of our systems (I have a couple large projector/theater rooms in the house and a couple large screen TV setups running with multiple device systems, so I think I know what I am doing.  (course what do I know).  Anyway, I'm not sure if I'd buy another one based on my experience with that, but then it is still serving it's primary intended purpose so I will give it three stars.", "Date": "February 1, 2014"}, {"Title": "vizio tv", "Author": "wilfredo cortes", "ReviewID": "R36WXLL5BT87AU", "Overall": "5.0", "Content": "I absolutely love my new vizio 3D tv. I can't get over how good it actually looks, the 3D effects are just like being in the theater and the price I paid (528.00) was amazing. highly recommended!", "Date": "December 25, 2013"}, {"Title": "These Visio T V's are without a doubt the BEST quality in television making ever", "Author": "Lynne  LL", "ReviewID": "R2AQ4HNQTYTNTQ", "Overall": "5.0", "Content": "These Visio T V's are without a doubt the BEST quality in television making ever.I love everything about them, starting w/ the best and clearest pictures possible.Set up was a breeze, including the WiFi.The manufacturers have done everything possible to make owning and viewingyour Visio a Dream.I will always buy a Visio in the future without hesitation.", "Date": "December 12, 2013"}, {"Title": "great tv", "Author": "jimmy p", "ReviewID": "R1MASMA3E42Y9R", "Overall": "4.0", "Content": "This TV is great so far the 3d is cool and are cats are having a blast watching fish tank video's and other animals on YouTube . It has some cool features and we buy another one for our living room", "Date": "December 7, 2013"}, {"Title": "Love this TV!", "Author": "Jae Y. Cho \"J.C.\"", "ReviewID": "R4DAO7UM3PH8K", "Overall": "5.0", "Content": "love this tv!  I just replaced my 32\" insignia from last year.  I wanted to get a passive 3d tv, since I didn't want to spend a lot of money on special 3d glasses, I've looked at many samsung models but decided to go with this model after reading all the reviews and researches.  I am glad I went with this TV, picture on 3D is unreal, better than the theater, and I like the fact that the same inexpensive 3d glasses that you use in the theater works.  that means all my friends can come over and i don't have to break the bank for everyone to have a movie night in 3D.", "Date": "December 5, 2013"}, {"Title": "Great TV and value!", "Author": "OhLiz", "ReviewID": "R1NWVTI6Q7DNFY", "Overall": "5.0", "Content": "Great TV and value! Beautiful clear picture and rich colors, easy to setup and use. Sound is very good! You can't go wrong with this model!", "Date": "November 26, 2013"}, {"Title": "Good for price. compare to expencibe TV's", "Author": "Jose Roberto", "ReviewID": "R1XOERJ2E5IMVV", "Overall": "5.0", "Content": "grate product for price. actually is my pc monitor and my family entertainment. the 3d look amazing. and whit the 3d Games like nvidia 3D TV Play works grate.", "Date": "November 10, 2013"}, {"Title": "Glad I Bought It!!!", "Author": "SWY11389", "ReviewID": "R3WD06SISDEYF", "Overall": "5.0", "Content": "Just got this this tv two days ago and I can't stop watching it! Picture is amazing and I love the thin frame around the screen. I am still waiting on the wall mount I ordered but the stand works quite well. WiFi works great for my netflix, amazon prime and pandora which is key for me. I owned a roku before I bought this so I will be re-gifting that shortly :) Checked out the 3D on a couple netflix 3D shows. I was impressed but I would recommend being at least 12 ft. from screen not 8 ft. like it says. I have a home theater system so I cannot vouch for the speaker sound on the tv itself, but regardless this is a beautiful fully functioning TV for a GREAT price!", "Date": "November 8, 2013"}, {"Title": "Great TV", "Author": "Mai Vang", "ReviewID": "R3JF3N65J17UXS", "Overall": "4.0", "Content": "Only thing I don't like is that I wish it could auto detect whether or not i was viewing 3D and change as needed vs having me to manually do it.", "Date": "October 1, 2013"}, {"Title": "Absolutely wonderful", "Author": "Bruce Kaufman \"Bruce G Kaufman\"", "ReviewID": "RIMSHWIQJKQ2K", "Overall": "5.0", "Content": "This TV, cheaper than other TV's in its class has a magnificent picture and that has to be the single most important thing about a TV.  There are a multitude of controls to make fine adjustments of all aspects of the video.  The built in speakers are reasonably good, but I often direct the sound to my surround system.  Hookups are simple and easy.  There are 3 HDMI connectors which for me will be enough.  The TV is \"Smart\", which means it connects to the Internet and offers you a series of apps supplied by Vizio, some with familiar names, like Yahoo, Netflix and Amazon.  The streaming works very well including for 3D.  The TV comes with 2 pair of passive 3D glasses that have worked well off of streamed You Tube 3D videos as well as on films like Avatar 3D played through the connected Blu-ray player.  I have but one caveat.  The remote must be aimed quite accurately to the sensor on the TV to get a response, though this is not annoying enough for me to lower the five star rating.  I have learned that Vizio is an American company with stateside tech support which is a big plus for me as well.  A 42\" hi-def 3D TV with Smart for under $500.  I am elated.", "Date": "September 5, 2013"}, {"Title": "Nice surprise", "Author": "Anil", "ReviewID": "R2R3N0YE11XNMU", "Overall": "4.0", "Content": "Amazed by its picture and 3D quality.Very happy to own this TV.Sound quality could be better but overall very happy customer.", "Date": "September 4, 2013"}, {"Title": "Big bang for the buck $", "Author": "good4damoney", "ReviewID": "R3ATA2I19LNFSU", "Overall": "4.0", "Content": "3d works awesome.Ive seen lots of vizios go bad when i go to bars so make sure you change some settings and turn some off.Its downfall is  the remote control has a weak signal.I cant surf onlline just internet through apps.Its a great starter for things to come.Most shows come through as 720p.1080p if its 3d or dvd.The price is fair for what you get.3 hdmi ,3D,internet apps,120Hz,.Im still not convinced that vizio can build long term tvs but it ok for now.", "Date": "September 1, 2013"}, {"Title": "The picture is fantastic and the features leave me speechless.", "Author": "Mable  Thomas", "ReviewID": "R1IPBQTQTBAOU3", "Overall": "5.0", "Content": "Being someone not good with today's techniology it has been somewhat easy for me. I am really enjoing it, daily.", "Date": "August 14, 2013"}, {"Title": "Review for 3D PC Gamers", "Author": "Stephen Sedita", "ReviewID": "R2QP1GHI8ZQE1O", "Overall": "4.0", "Content": "The only thing I have attached to this TV is my computer.  First off, screen quality is good but not great.  Compared to a $400 Samsung 40\" 5000 series the picture quality was clearly better on the Samsung with much less adjustments needed.  That being said, with some adjustments the TV still looks good, just not great.  I had an older version of this same TV, E3D420VX, which unfortunately did not survive a recent move.  The only thing better about the older model was the remote, which had a full keyboard on the back and is much easier to use for the smart TV apps than the remote included with this TV.  Just like the old version though the user interface is somewhat sluggish in response and the remote has to be pointed directly at the TV to work.  The smart apps can also be a little sluggish or clunky to navigate, but I only ever use the amazon video app anyway and with my old qwerty remote I can search for stuff easily enough.  I definitely recommend either buying a universal remote that has a keypad or trying to find the one that came with the older Vizio model.  I've read some people have success with wireless USB keyboards but haven't tried that myself.3D on this unit is actually even a bit better than my old one.  I've got a few 3D digital movies and the depth seems just a touch better on this unit.  3D gaming has a ton of caveats.  I have an AMD 7950 so for 3D I'm limited to using an HDMI cable and its stuck at 24FPS.  That is noticeable for fast paced games that weren't designed for 3D.  But for games designed to support 3D, like Batman Arkum Asylum or Crysis 3, the 24 FPS limitation is significantly less noticeable.  And its simply freaking awesome.  I've used active shutter glasses in the past and noticed serious eye strain after more than 15 minutes of use.  With the passive tech from these glasses I experience no eye strain, none at all.  Some will point out you lose resolution, but honestly its hardly noticeable if even at all.  The immersion you get from the 3D totally outweighs the barely noticeable loss of resolution.Bottom line is that for games designed to support 3D, PC gaming with this TV is awesome (if you're video card is powerful enough).  I'd suggest for 1080p resolutions the 7950 or something in that class in bare minimum. For example I can run crysis 3 smooth as silk at high settings in 2D but if I want to turn on 3D I need to drop down to 1600x900 to stay smooth.  But I can run Batman Arkum Asylum at full settings @ 1080p in 3D and its smooth as a baby's butt.  For games not designed for 3D there can be all kinds of issues but in general most games are acceptable after tweaking.", "Date": "August 7, 2013"}, {"Title": "Good price for the quality", "Author": "sixsigma", "ReviewID": "RYD62O85EO4MM", "Overall": "4.0", "Content": "It is not overpriced but the picture is of superior quality. a must-buy for anyone who likes smart 3d led tvs", "Date": "August 5, 2013"}, {"Title": "My first Smart TV", "Author": "Icondreams", "ReviewID": "R29ZYV021YLGU3", "Overall": "5.0", "Content": "I am so excited about this TV. I used the settings Zach suggested and my TV looks amazing. I love how netflix plays on this box. It auto plays the shows in a series, on my blue ray this was not the case. So, as a first time smart TV owner... I couldn't be happier!", "Date": "July 19, 2013"}, {"Title": "AWESOME", "Author": "Jim", "ReviewID": "RKO5D6ODLPPNF", "Overall": "5.0", "Content": "The best TV I ever had - the 3D jumps right out at you - the USB jack can play movies from a thumb drive  - 3D movies and HD can be transfered to a thumb drive and played on the TV - Internet is flawless -  sound is strong - tuner is powerfull - Vizio is doing a very good job  -", "Date": "June 22, 2013"}, {"Title": "great TV", "Author": "G", "ReviewID": "R2QWQRYQZX0C6U", "Overall": "4.0", "Content": "I have used the TV for about a week now.  The 2D picture is very good and the 3D quality has exceeded my expectations.  The 3D picture is better than what you experience in the theater.  I like the apps on the set; they are better than the apps on my older Bluray player.  Even the Netflix app is better. The only problem I had with the set was during setup.  It would not allow me to enter my password for my Wi-Fi.  Eventually I had to reboot the TV to allow it to enter the password.  For that reason alone I give it 4 stars.", "Date": "June 15, 2013"}, {"Title": "Nice TV if you can ignore minor quirks", "Author": "J. Negron", "ReviewID": "R1MHQ1Z0JFOCSH", "Overall": "4.0", "Content": "Decent Set. The only cons I have found so far are that the included mount doesn't swivel, and the 3D function is not adjustable (which is really helpful in getting the best pic). Colors look good and sound is pretty good too.. I do not regret purchasing this unit. Overall a good TV for an excellent price!", "Date": "September 16, 2013"}, {"Title": "2 faulty tvs in a row", "Author": "unpleased", "ReviewID": "R5C2P4GMKI269", "Overall": "1.0", "Content": "TV came in on time and on first glance it looked alright. The picture clarity was very grainy and I never got the \"soap opera effect\". Day 2 there was a greenish-yellow tint in the bottom corners that was present on any dark screen. I called Vizio and they said my the backlight was bleeding and it was a faulty tv so the sent out for a replacement. The new TV came in yesterday it looked perfect when i turned it on. The next morning the backlight was bleeding again and it needed to be replaced again!!! 2 faulty tvs back to back. Im done with vizio.", "Date": "March 15, 2013"}, {"Title": "Great Tv", "Author": "Rysport \"Rysport\"", "ReviewID": "R2M9WNMLD89JDQ", "Overall": "5.0", "Content": "Great price for this TV.  I love that it has WiFi built in and it was perfect for the workout room.  Vizio is definitely coming out with some great TVs.", "Date": "May 7, 2014"}, {"Title": "Not what I expected", "Author": "Raul", "ReviewID": "R1GP6IIKHHTBUG", "Overall": "2.0", "Content": "A lot of the apps do not work. Vimeo has been unavailable for a year. The Wifi doesn't connect to the internet automatically, everytime I want to use some of the apps like Netflix or Youtube I have to manually connect to my network. Sometimes when I launch the Netflix app the TV freezes, I have to unplug the TV and plug it back in so it can function again .The remote control that came with the TV did not work properly so I bought another remote control and I still have to get close to the TV to get it to work. I think the TV has a weak IR signal. This so called smart TV was not a good purchase.", "Date": "March 24, 2014"}, {"Title": "Beautiful TV, Finicky Netflix App", "Author": "J. M. Taylor", "ReviewID": "R3DNIC4O7Q50XL", "Overall": "4.0", "Content": "The TV has a very nice picture that you can tweak in a variety of ways to suit your needs. It also has a decent amount of presets too. The screen has a bit of a semi-gloss finish to it unlike the matte finish of my last TV, so I often have to close the blinds in the room to play a game or watch a movie.The on board sound is sufficient, but the speakers do face downwards so they don't have a bunch of depth or projection to them (at least in my apartment with the furnace running a few feet away from my living room).My issues have been mostly with the Netflix app. My router is about a foot from the TV, yet the Netflix app will randomly and frequently crash, sending the TV back to whatever input I had it on before. When it works, it works great - clear picture, good sound, responsive to control input from the remote. Tech support from Vizio has been mostly by email and it has been slow and somewhat lacking. The only thing that worked (briefly) was to do a factory reset of all apps. But it soon reverts to its old issues.The Wifi appears to register strong reception, so I'm guessing the app has some inherent stability issues. I don't know if Vizio or Netflix needs to tinker with it, but sooner would be preferable.", "Date": "March 4, 2014"}, {"Title": "1 Month Review + Good", "Author": "DC", "ReviewID": "R3K5VNNMY6SNYU", "Overall": "4.0", "Content": "I don't have any problems or complaints about this TV. Picture quality seems great. It's physically light so it wasn't a pain to set up. There are plenty of HDMI ports (I noticed that the Samsungs only have 2). Also, the smart TV features work very well, Netflix and Amazon Prime were both really easy to set up and picture quality is good. I haven't used the 3D yet because I don't get any 3D channels. The only knock is that it was a little on the expensive side, but for all the features it has (including 120hz) I felt like it was worth it.", "Date": "March 3, 2014"}, {"Title": "The best", "Author": "Dennis Cook", "ReviewID": "R1YMOPXPVENLV5", "Overall": "5.0", "Content": "Now all the TVs in my home are Vizio plus one in the camper. I enjoy the color and the price", "Date": "January 29, 2014"}, {"Title": "42\" Vizio tv", "Author": "Mario F.", "ReviewID": "REPXK0G24IIT6", "Overall": "5.0", "Content": "I do have 4 Vizio televisions in my house, and all of them are working very good, that 's why I keep buying this branch.", "Date": "January 11, 2014"}, {"Title": "Fantastic TV", "Author": "Buckf", "ReviewID": "R1B6EP4SRCNI1I", "Overall": "5.0", "Content": "I am really enjoying this TV. Bought for our bedroom. Haven't tried the 3D yet but other features are many and a pleasure to use. Very good picture quality. Easy set up. Still learning things. Find something new every time I turn it on.", "Date": "December 23, 2013"}, {"Title": "Great price for what you are getting.", "Author": "osvaldo", "ReviewID": "R375OQ7N24ZHSF", "Overall": "5.0", "Content": "I love everything about the tv set except for its remote. The remote is horrible, its something you would find at the 99cent store. I also havent watched anything on 3d yet. I would highly recommend it.", "Date": "December 7, 2013"}, {"Title": "Awesome tv!!!", "Author": "Colby", "ReviewID": "R58JTW0QBHO6K", "Overall": "5.0", "Content": "Love everything about this tv!!!, had Vizio tv before never had any problems out of it seen this was sale and decide get it while I had the chance, love the smart  features the 3D is awesome and makes an awesome gaming tv!!!", "Date": "December 3, 2013"}, {"Title": "a great leap forward in consumer Television !!!", "Author": "Richard O Bauer", "ReviewID": "R1Y1SF3ONIJIWS", "Overall": "5.0", "Content": "This is my first Digital HDTV. The picture quality is the best. The internet streaming is great.The 3d feature is great. Set up was quick and easy.I am totally satisfied with this HDTV!!!.I reccomend it to anyone.", "Date": "August 28, 2013"}, {"Title": "Easy set up. Some sound delay", "Author": "Mark  Makowski", "ReviewID": "R2ZXNOOZ5M408D", "Overall": "4.0", "Content": "Very light weight. Replaced another older 42 inch tv and the outside demensions on this one is much less.Notice some sound delay when compared to a tv in a neighboring room.", "Date": "June 20, 2013"}, {"Title": "Excellent TV - Great Price", "Author": "Hagar", "ReviewID": "RIBBIXI30423T", "Overall": "4.0", "Content": "Pros:  Terrific picture  Built in sound better than any similar TV I have heard  Good remote - Includes Netflix and Amazon Prime buttons  Terrific valueCons:  Doesn't seem to be any provision for new Web content (What about Pandora and HBOGO?)  This, of course, is a widespread industry problem.  Takes up to 10 seconds to 'warm up' after you turn on the powerHave not used the 3D yet.", "Date": "June 17, 2013"}, {"Title": "Incredible value for the money", "Author": "Bob S.", "ReviewID": "R1C5TJDQQ7Q8I5", "Overall": "5.0", "Content": "Like many, I suspect, I have high-end tastes but a low-end budget. I have had a 30in Vizio TV that has been a real gem for four years now so didn't hesitate to commit to Vizio again.  I'm glad I did.  The TV is just beautiful.  A very tiny (roughly 3/4\") trim surrounds the big, crisp, lovely screen and doesn't get in the way at all.  Easy to set up, out of the box to watching tv took all of 10 minutes to slap on the base and plug it in.  Turning it on sends you to a nice set of screens that guide you through connecting to the internet, registering and finding your input source with no lag or delay at all.  I don't use the WiFi feature as I have my router in my entertainment center and an ethernet connection will always be much faster than wifi so I have no desire to slow my self down or add headaches with Wifi.  Out of the box the image is stunningly sharp if a little yellow.  I recommend using the settings from Zachary Dunklee in the reviews on this page for a good starting place.  His settings tend to mute some of the overly hyperactive TV Store settings and cures the yellow hue, balancing everything out nicely.  I am very happy and am eager to recommend this set to everyone I know who may be in the market for a new TV.  The price is insanely low for this set, the look of the set even when it is off is slick and attractive, image quality is beautiful and transitions are very fast with none of the pixellation of older flatscreens, settings galore allow you to dial in your flavor, 3D is sharp and retains color well in spite of the gray glasses, smart functions are fun (but will soon be replaced by the Xbox One), I'll never listen to the internal speakers because this is a 42 inch tv and I have a surround system - duh (that said I've heard people are happy).  Buy this TV, you can't go wrong.", "Date": "June 1, 2013"}, {"Title": "Excellent TV for the price.", "Author": "g", "ReviewID": "R37HHSFZCCEK21", "Overall": "5.0", "Content": "Lightweight, easy to use Television.  Setup was a breeze.  Thank you Vizio.  This item is priced to sell and has all the bang for the buck the more expensive sets have.", "Date": "May 28, 2013"}, {"Title": "A great bedroom TV!", "Author": "zzt", "ReviewID": "RW35LBTPTD9RI", "Overall": "4.0", "Content": "I'm the guy that all my friends come to when searching for new electronics.  I've always recommended the bigger boys when asked about TVs, and I'm especially partial to Panasonic plasmas.  However, when it came time to fill my bedroom with a new TV I chose this one and haven't looked back.For the price, size and list of features it's a great fit.  The bright, colorful picture could benefit from better black reproduction, but I can't complain too much at this price.  3D is just an added benefit.  Fun for kids movies with my daughter.", "Date": "April 2, 2013"}, {"Title": "Great TV, wonderful picture", "Author": "Stephen Ganske", "ReviewID": "RE6C63ID4JMUW", "Overall": "5.0", "Content": "This TV works very well.  The picture is fantastic, but without the PAL (British TV) sort of look you get out of most 120Hz LED's.  My only complaint is that it that's a particularly long time to start up.  Not horribly upsetting, but annoying. Could use a couple more HDMI ports, but 2 it usually enough. The web services are fantastic, work quickly and easy to add more apps through the yahoo app store.", "Date": "March 27, 2013"}, {"Title": "Great Picture, but some other features are lacking....", "Author": "J. Weber", "ReviewID": "RYKYK5OFM22A5", "Overall": "2.0", "Content": "Purchased primarily for gaming.  First, the picture quality is fantastic, i have no complaints at all on the image this tv has -- it's excellent.  It's currently hooked up to an XBox One and the graphics are outstanding.  The 120Hz refresh rate is great for gaming.Okay, the downside (and why i give it 2 stars).  The firmware (the software that runs the tv) is agonizingly slow!!  At times it takes up to 15 seconds to switch between inputs!  That's simply unacceptable on a TV this day and age.Additionally, the wireless network connection will not stay connected.  When you go in the menu and select a network, it connects with no problem.  However, later on, if you press the Netflix button....you get an error saying that it cannot connect.  You can go back in the menu, re-connect to wireless, then back to Netflix and it \"usually\" works.  Again, unacceptable for a \"Smart TV\".The 3D feature seems to work fairly well -- nothing like the big screen in a theater, but definitely watchable.If I had it to do over, I would spend the extra money and go with an LG or Samsung.", "Date": "December 27, 2013"}, {"Title": "Very Pleasantly Surprised!", "Author": "Patricia Ranney", "ReviewID": "R3HZ7IH92LK4F9", "Overall": "5.0", "Content": "First, let me start by saying that my main TV is high-def LED SONY, which I love. I had a 26-inch VIZIO in my bedroom, and it had a great picture, but I often use closed captioning and the on-screen channel guide, and I simply couldn't read anything because the print was too small. I didn't want to spend a lot of money on a second TV, but I needed something a lot bigger than a 26-inch, so I suspected that VIZIO was the way to go. It was definitely the right decision. The picture on this set is brighter and crisper than my SONY -- the quality is certainly as good as the SONY. The sound is better than the SONY. It weighs less than the 26-inch VIZIO, which is about 3 years old at this point. It was extremely easy to set up -- and I am NOT a technical person. The inconvenience of not having a QWERTY keyboard in order to do set-up is just that -- an inconvenience and nothing more because you won't need to do it again. The Netflix app is fantastic -- much easier to simply push a button than work your way through a Roku box procedure, which I have to do with my SONY. I had called VIZIO support for what turned out to be a problem with my cable box, and the woman at the support center was wonderful. She also registered my TV. Again, this is a second set, and my demands are few other than a great picture that allows me to read words and good sound; and the sound is much better than I would have ever expected. Because it was less than another $50 to upgrade to a 3-D \"smart\" TV, I did the upgrade, and it's well worth it, as I can access news from the internet and use the pre-installed Netflix and Amazon apps. There are 4 ports that allow me to hook up my cables from either the side or the back. I haven't tried watching anything in 3-D yet, so I can't comment on that, but the set did come with 2 pairs of glasses, and if I need extra glasses, I only need the cheap ones, not those expensive electronic glasses. I bought through the Amazon Warehouse -- just like I did with my SONY -- and buying \"like new\" meant that there was a VERY slight scraping on the original box! Quite frankly, with both of my TV Warehouse purchases, the boxes were in better condition than any box I've seen in a store! I wouldn't dream of buying a TV any other way, as the price is outstanding, and the service is great.Unless something goes terribly awry in the next few months (and I do expect that this TV should last me at least 5 years in order to maintain my 5-star rating), I wouldn't hesitate to recommend it to anyone. I've been a SONY advocate for more than 30 years, and the VIZIO is solid competition.", "Date": "May 24, 2013"}, {"Title": "Amazing!!", "Author": "Luis Javier Mijares", "ReviewID": "R2KQHWAEG1ZJK0", "Overall": "5.0", "Content": "This is my forst Vizio TV ever... And I tell you, it is amazing. And the price is more than worth it for a 3D smart TV... I am very glad with it", "Date": "May 5, 2013"}, {"Title": "awesome.", "Author": "Don", "ReviewID": "R14YIBE8QHFKA6", "Overall": "5.0", "Content": "This is the best TV I bought so far. Having owned previous Vizio TVs I was a bit hesitant on purchasing this one. The early Vizio LCDs had poor picture quality and I was taking a risk on this one because I wanted to give 3D TV a shot and didn't want to spend too much money on it. This is on par with similar Samsung and Sony models that cost significantly more. I can play movies directly off a hard drive without any problems. The built in wifi and apps are excellent and the digital tuner works great with my Mohu leaf.I like the fact that it has passive 3D and the glasses don't cost much. The only thing I would change is having a QWERTY remote standard with it. Entering details during the initial set up was a drag when you have to select every letter using the arrow keys. Also a softer touch remote would be great. The buttons on this are a little stiff and noisy.Other than that minor flaw, I have to say that this is the best TV I've owned. So far only watched side-by-side 3D movies off a hard drive but will be getting a 3D Bluray player so that I can experience the true capabilities of this.I don't see the picture quality other reviewers are complaining about and the presets work fine for me.I have to say that Vizio really impressed me this time and I will not hesitate to purchase another TV through them.", "Date": "April 9, 2013"}, {"Title": "Vizio TV", "Author": "Jeanne Alexandere", "ReviewID": "R3N1586R62VQE8", "Overall": "5.0", "Content": "After twenty years with an \"old fashioned\" tv (I remember when there were only radios), I love our new vizio  Crisp color, high definition-you can't beat it.  We had difficulty however, getting clear instructions from anyone (Vizio, Amazon, Dish Network) on how to set it up.  Ultimately, Dish Network announced that we needed a new receiver and a new dish on the roof.  After that, smooth sailing.", "Date": "April 2, 2013"}, {"Title": "Off the Chain!", "Author": "kelvin", "ReviewID": "R23PB0SXYVCFQE", "Overall": "5.0", "Content": "This is an excellent buy great smart TV with cool apps It is like another computer in the home  I also got 1month netflix free. i did not purchase the Keypad remote which makes it a bit tedious to type in a word so my advice at this price purchase the remote", "Date": "April 1, 2013"}, {"Title": "Great product from Vizio with reasonable price", "Author": "RajB \"Raj\"", "ReviewID": "R2RFTYQKMDRADB", "Overall": "5.0", "Content": "This is the first time I tried anything else than LG. I have been always a LG fan starting from washing machines to refrigerators to Split ACs. For the first time I tried something else and surely not disappointed. Its slim but not ultra slim like some of the LG and Samsung models. Its super light. Picture quality is awesome. Note you might have to do some settings on both TV and Satellite receiver initially.Internet Apps are ok (note there is no Youtube and rest all apps need subscription)..I am an Amazon Prime and watch movies once a while using amazon app. It detects connection speed and automatically adjust the movie quality from SD to HD.I would suggest using N router with at least 150mbps speed.Setting up wifi was easy and straight forward. I have not yet tested the 3D feature so can not comment about it.Comparing the prize + size + screen technology (LED) + Internet/Smart + 3D I think it is the best deal one could have...One thing which lack in this TV is the VGA port - It comes with limited ports (3HDMI and one Component). It does not have VGA, so if you have Ipad/iphone with VGA adapter or wants to connect laptop, you cannot unless you use VGA to HDMI converter.-------------------05/07/2013 Update - I mentioned earlier that it does not have Youtube App. I was wrong. It was not pre-installed on my TV, but I was able to install it using application settings. There are tons of other apps you can install.", "Date": "May 3, 2013"}, {"Title": "good value for the money", "Author": "AlwaysFlying", "ReviewID": "RRG32LP8T30WP", "Overall": "4.0", "Content": "I purchased from Costco.com:  lower price, second year warranty extension included, Concierge tech service (which I haven't had to call on this TV) and a 90 day return policy which removes risk on a purchase decision you might quickly regret. Just take it back to your local Costco if you change your mind within 90 days.  This isn't a Costco ad but sounds like one! As to the televison we are very happy. We found the set-up of this TV to link our Amazon Prime account was quite easy. The internet access set up was as easy as selecting our wireless network on the set up screen and entering a couple of lines of information taken from our router label. We have viewed a Prime movie and it worked as expected. I don't have a wireless USB keyboard to test but the reviews lead me to believe the remote is the only input option.  The remote as an input device is clunky and somewhat tedious but it will eventually get the job done. We have older A/V equipment and the older TV we replaced had many more inputs/outputs.  It was a bit of a challenge to get all the goodies working together. I did have to buy some RCA jack splitters to allow the TV audio output to share an AUX input in to our home theater system with a turntable (no HDMI input option, that's how \"old\" my home theater is). I had to get the TV working in the home theater or we were stuck listening to Prime or web video through the TV speakers. Only my DVR had HDMI and that is a great system, one cable and you are done.  I jacked in my laptop using an HDMI cable and the TV displayed exactly as expected. The challenge on this TV is selecting the appropriate display settings.  This will take some study to understand and to adjust the settings to match our preferences.  The TV audio on it's own is so so, you can't expect much out the tiny speakers. Vizio knows most customers have home theater or will buy an accessory sound bar. Overall I love this, it replaces a 10year old Akai which weighed over 100 pounds and was working.  I dropped that off at Goodwill yesterday and the comment was \"that's what used to be called a TV\"! There is not much comparison to the old technology vs this new LED web enabled tech.  For $500.00 I don't think you can go wrong on this Vizio.", "Date": "April 21, 2013"}, {"Title": "NOT DLNA Compliant or Certified", "Author": "Steller", "ReviewID": "R1LDLKHFLL1R1M", "Overall": "1.0", "Content": "Some \"Smart\" TV's are smarter than others. I was unaware when I bought this TV that Visio products are largely NOT DLNA compliant or certified yet. What this means to you as a customer is that you will be unable to stream video, pictures, or music from a local source on your home network via wireless. Samsung and Sony have done this for years and I guess I assumed since this was a wifi capable \"Smart\" TV, it would do it also. Now, if your looking for typical TV functionality, this TV may be just fine for you. But, why would you limit yourself if your going to make a fairly large investment in a TV that you would like to use for 5 years? For example, the reason Iphone and Android Smart phones are so popular, is the apps. Visio doesnt seem to think they are that important for TV's yet. I called and spoke to their management personally yesterday after trying to get PLEX or Twonky to work on a local network. Both Samsung and Sony not only support DLNA, but they also have their own way of allowing additional application integration.As I said, this TV might be great for you. My only advice about Visio is this is becoming an application centric world. As a consumer, you will be using more any more applications. Visio has almost no options for this UNLESS you connect via USB. They are the ONLY TV vendor that this is the case for.", "Date": "November 25, 2013"}, {"Title": "Agree to a point with other reviews", "Author": "RF Wiede", "ReviewID": "R1R0UAC90IW4NB", "Overall": "4.0", "Content": "I bought this to replace a Vizio 32\" 1080p LED smart TV in our bedroom. The 32\" just was a little to small. I was very happy with the picture of the 32\" and this is what drove me to buy the 42\". Even though the 32\" is not 3D, I thought that this gives me an opportunity to do a Vizio to Vizio comparison.First, I still love the picture for both of them. With adjustments mentioned and my fine tuning to my preference, the 42\" matched the 32\" in picture quality and clarity. I did not notice any bleed by the LED on both. The sound quality seemed comparable. The set up was easy for both and my Netflix and Amazon is easier to bring up on the 42\" than the 32\" with the dedicated buttons.So why did I give the 32\" a five star and the 42\" a four star...Motion blur. I don't know if it was on the 32\" and since it was a smaller TV, it was less noticable or not but it is noticable on the 42\". It is not something that drives me crazy or makes sports less enjoyable but it is there. I am not sure if there is anything I can adjust to make it less noticable or eliminate it. I am not a electronics whiz so I am hoping someone will post here something I can do to fix it. I would not consider it a deal breaker because of the positives including the price. But it should help NASCAR or NFL fans in choosing this TV.", "Date": "February 20, 2013"}, {"Title": "Everything I hoped for based on others Reviews", "Author": "Luke Smith", "ReviewID": "R2HTYTOB7YJR0E", "Overall": "5.0", "Content": "Well, I received my TV from antonline, and it didnt come with screws to put the TV on its stand. This really bummed me out, so I called up Vizio and luckily I was able to get the screws from Lowes.  You need 4 Metric x 16mm screws and 4 Metrix x 12 mm screws.So besides that little side track of a hassel, the TV itself is amazing. I upgraded from a 50\" Samsung, and this was definately worth the upgrade.  If you are only using it for 2D, the Ultra HD on this screen is amazing, sound quality is every bit as good as Samsung.  I also play 3D movies through my laptop. So I bought an HDMI 1.4 cable, made sure I had a 3D compatible video card on my laptop, and PRESTO, I'm watching 3D movies and loving it.  The refresh rate is PERFECT.  I was a bit skeptical when I read reviews about refresh rates, because I started to get buyers remorse thinking I should have spent extra for a 240Hz TV.  No, forget that hogwash.  I watch like 5-12 hours of TV a day [don't judge me], and I love a perfect HD picture and a smooth picture, so I know what Im talking about.  This is a perfect TV.  The 3D is very enjoyable.  I've found PowerDVD 13 3D combined with 3D Nvidia Vision 3D Player are great for playing my 3D movies.  This TV is a Gem.  Very happy I upgraded, worth every cent.", "Date": "March 4, 2014"}, {"Title": "Great TV for the price", "Author": "Duane Perozzi", "ReviewID": "R2A3FCI4A5AJPB", "Overall": "5.0", "Content": "Amazon offered the Vizio E420d-A0 42 inch Smart TV at a great price.  Picture is great, tv is very light weight and it does everything is says.My only complaint is that the remote control that comes with the tv is very cheap. Almost like it came from the dollar store.  You only need this for internet and app use, otherwise I'm using my Uverse remote.", "Date": "August 29, 2013"}, {"Title": "Present for my daughter", "Author": "Anthony", "ReviewID": "RM7ODP0QHDGVU", "Overall": "5.0", "Content": "She said it was the best present ever, and was so excited to use the tv. Of couse she did not have cable yet, but used the wireless feature to access netfix :)", "Date": "August 28, 2013"}, {"Title": "Better then expected", "Author": "Jean M. Brassard \"Tedbrass\"", "ReviewID": "R3G0YZ3JR0QK4J", "Overall": "5.0", "Content": "Just set up this TV, which was no problem, and I musty say that it exceeded my expectation.  I use it solely for wireless streaming and the HD picture is fantastic.  Also, we can not believe the 3D picture which is much better then we expected from a WIFI connection.  For the price I believe that this is the best deal on the web!", "Date": "June 18, 2013"}, {"Title": "Great TV excellent price", "Author": "Kandice222", "ReviewID": "RRVS6294EW8IS", "Overall": "5.0", "Content": "My husband am I were looking for a TV for our bedroom. We wanted a smart TV since we would be be using it only for streaming amazon prime instant videos and Netflix movies.  We didn't want to spend a fortune and were excited to find this TV on amazon for such a great price. We checked Sears and Costco and couldn't find a better deal. It arrived in just 2 days which is amazing since we live in Hawaii!! We love it. It works great and streams movies much better than our Sony smart TV. The only thing I would suggest is that you upgrade to the remote with the keyboard. This would be especially useful if you are going to be using a lot of the online content.  It's such a pain to search for movies without the keyboard.", "Date": "May 12, 2013"}, {"Title": "Got based on reviews, like it so far", "Author": "Nomad", "ReviewID": "RZ4RPITTWQ06V", "Overall": "5.0", "Content": "I'm using this in place of my ideal setup (projector + 10' diagonal screen) b/c my new place is not compatible with that setup. I use this with my new smaller quieter HTPC. So far, it's great! Haven't fiddled around with 3d yet. Also, awaiting a better graphics card to try the 120 Hz refresh rate. Sound is decent and loud, but for HTPC or even good quality audio, I'd NOT use the built in speakers, nor would I use the built-in HDMI-DAC-RCA out, compared to even a run-of-the-mill sound card DAC.If the PC-monitor power saver kicks on, the TV will automatically shut off as well ... unfortunately, moving the mouse around won't turn it back on, but all you have to do is hit the on button on remote, still easier than flipping the projector lens cover up & down!", "Date": "May 9, 2013"}, {"Title": "TV is so good!", "Author": "RedZero", "ReviewID": "R1IU0RL0KDVZ5N", "Overall": "4.0", "Content": "I bought this mostly for the 3d so I could play 3 full screen split screen with my bro which works great.  The video is very good. You can watch your netflix, amazon prime, and youtube on your TV without the need on another device.  The only thing I don't like about this is the remote.  Its very bad.  The remote has some lag on it compared to my Comcast remote. I recommend  to try getting another remote or the Vizio remote with the keyboard.", "Date": "April 27, 2013"}, {"Title": "Great Smart TV", "Author": "MIGUEL FARFAN \"MIGUEL FARFAN\"", "ReviewID": "R1J4Z1VV7GHLDK", "Overall": "5.0", "Content": "It’s the most complete smart TV that I have ever had. Beautiful design and color . I fully recommended it.", "Date": "April 17, 2013"}, {"Title": "Fantastic", "Author": "Crodley \"Crodley\"", "ReviewID": "R3UOJIFJC65NP6", "Overall": "5.0", "Content": "I have had this TV for 3 days and oh my goodness is it great. I've actually hooked it up to my computer flawlessly as a monitor.  The image is crystal clear and setup was a breeze.  I've watch a few 3D movies and 3D clips from youtube and it looks amazing.One reviewer said the downside of passive 3D is that you need to be pretty much facing the screen head on, but I've not noticed that NOT to be the case here so far.  While watching the movie \"UP\" with my mother she was centered and I was about 3 feet off center from only a few feet away and the 3D was still sharp. I'm extremely satisfied with my purchase so far.", "Date": "April 1, 2013"}, {"Title": "I like it!!", "Author": "Carl", "ReviewID": "R1VNDTF2JUIS4Q", "Overall": "5.0", "Content": "Great TV at a good price.  Very easy to set up and use.  The 3D is a big plus and the Apps are easy to use.", "Date": "June 2, 2014"}, {"Title": "AWESOME TV", "Author": "Casandra Baum", "ReviewID": "R31XMZX0W86JCN", "Overall": "5.0", "Content": "AWESOME TV, Worth every penny I spent.Have not used the 3D function yet but the HD and smart capabilities are beyond spectacular.I have has no issues", "Date": "May 24, 2014"}, {"Title": "AWESOME 3D TECHNOLOGY!!!", "Author": "Myke", "ReviewID": "R31GQ765EX4660", "Overall": "5.0", "Content": "What a great value for this tv!!!  yes its last years model, but everything about the TV is GREAT!!!!  I followed some others reviews on setting up the color schemes and tweaked them a little for my liking, and the picture is outstanding!!  The apps that are available make this TV more than adequate, actually have more options than necessary!!! Which in the end leaving me with nothing more to want!!!God Bless", "Date": "May 24, 2014"}, {"Title": "TV WENT BLACK AFTER 8 MONTHS OF NORMAL USE", "Author": "Pompey The Great", "ReviewID": "RNITIG8VYIYG5", "Overall": "2.0", "Content": "After having the television set for approximately eight(8) month, the screen went black and would not come back on.  While working, the television set was on of the best I have ever owned.", "Date": "May 23, 2014"}, {"Title": "very good", "Author": "Franklin Montilla", "ReviewID": "R2CRYWHKIZ0KVW", "Overall": "5.0", "Content": "very good and it is excelent, but i buy it for watch tv 3d with directv and it is not compatible.", "Date": "May 10, 2014"}, {"Title": "Excellent product.", "Author": "Naudy", "ReviewID": "R1RDLQCHBGV6G4", "Overall": "5.0", "Content": "It's a very good tv with respect to economic, quality, high definition, but I Don't know if its parts are easy to find.", "Date": "April 25, 2014"}, {"Title": "Great set for the money", "Author": "Dale Strait", "ReviewID": "R2USVBGBQIRSBZ", "Overall": "5.0", "Content": "Picture great.  Easy set up.  The color rendition is fine for me.  The Amazon app works great.  What's not likeable.", "Date": "April 21, 2014"}, {"Title": "This is the way to go.", "Author": "Dennis Ayotte \"ScroogeDA\"", "ReviewID": "R13O6VVC4H5NI4", "Overall": "5.0", "Content": "VIZIO  3D - I'm not going to write a book but to say go and buy this TV .Yes this one  I own Three Vizio 3D 42\" for my bedrooms. I'm not kiddingand one VIZIO 55\"  3D  in my living room. all TV have a Samsung 3D Blu-ray player  Model-BD - F7500 Living room only  this one is a lot of money  I needed the jacks is one of the reasons I have it's a real advance player. with some features you can only use with Samsung TV.But will run with VIZIO .  Now This player is a good choice Blu-ray 3D SAMSUNG  BD-FM59  SMART, WIF,I  ALL  KINDS OF APP, IF YOU CAN AFFORD IT THEN GO FOR IT. Nice I hope I was able to put a smile on someone face. your paying for the name if you go LG, Samsung, Sony,  My Way  VIZIO.", "Date": "March 30, 2014"}, {"Title": "great tv awesome price great shipping", "Author": "mike", "ReviewID": "R2ZZGRZ3POIH51", "Overall": "5.0", "Content": "great pic awesome 120 hrz refresh rate and it was a reasonable size for my apt speakers on tv actaully sound great", "Date": "March 25, 2014"}, {"Title": "Best deal", "Author": "Joseph", "ReviewID": "R34RKCGOQQ4LLR", "Overall": "5.0", "Content": "TV has held up perfectly after 8 months of heavy use. The black level and color are much better than other TV's in the price range, and the 3D works fantastically", "Date": "March 1, 2014"}, {"Title": "More than expected", "Author": "Axl", "ReviewID": "R12689S2WDXWPC", "Overall": "5.0", "Content": "Excellent HD 3D TV, I was blown away by the picture quality and the sound is quite sufficient. The 3D is super and had me jumping at times. Thumbs up to Vizio on a great product. I do not hesitate in recommending this TV.", "Date": "February 20, 2014"}, {"Title": "White Screen after 5 months.", "Author": "Jitender Singh", "ReviewID": "RTDOUCFA7OE8O", "Overall": "1.0", "Content": "I bought this tv in August 2013. By looking at the price, features and reviews I was extremely satisfied with this purchase until today when the screen turned white all of a sudden. I turned it off unplugged the cable and restarted again with no luck. Even tried the factory reset but the screen is still white showing blurry images with sound. I tried calling the technical support but got disconnected 5 times. I had to call again and again start all over with name, model no etc. FInally 6th time I was able to get the case number. They told me to email them the pics of the screen and they will contact me when they receive them. I'm still waiting for their call. Despite of all the attractive features this tv is not reliable and will not last long. If you look up online this model is known to have pink due issues.P.S if anyone knows how to fix this please let me know.", "Date": "January 30, 2014"}, {"Title": "bad remote", "Author": "Not a Kansan", "ReviewID": "R3354IBZ7BBSL3", "Overall": "3.0", "Content": "tv works great and 3d is fun but the remote stopped working within the first couple o weeks we had it", "Date": "January 30, 2014"}, {"Title": "Far exceeded my expectations", "Author": "schnazz", "ReviewID": "RENF9HYHHIC6V", "Overall": "5.0", "Content": "Bought the tv for the smart features, and screen quality.It far exceeded my expectations with all the apps you can install, local streaming functions (dlna/upnp),incredible 3D quality that in my opinion, is better that in theater, and speakers surprised me a bit as I was expecting a mediocre/tinny sound.5 stars!", "Date": "January 26, 2014"}, {"Title": "Best Value TV", "Author": "Maureen Santisi", "ReviewID": "R3VO89X41288T6", "Overall": "5.0", "Content": "Outstanding TV for the $.  Fits perfectly into my old school entertainment center.  Has all the features I wanted and the picture quality is awesome.", "Date": "January 25, 2014"}, {"Title": "Love it!", "Author": "Brent Welker", "ReviewID": "RIT7V2XXX641K", "Overall": "5.0", "Content": "Great tv! My only down side is the \"smart tv\" anything I watch over wifi is super slow. Haven't tried hardware yet but my playstation 3 and 360 have the same apps and work faster. Other than that I love it!", "Date": "January 18, 2014"}, {"Title": "LOVE this TV!", "Author": "Amy_Ro", "ReviewID": "R2O05ZKDYGEBP9", "Overall": "5.0", "Content": "We bought this TV back in February of 2013.  This is one of the best purchases I ever made.  I absolutely adore this TV.  The picture on it is beautiful, and the sound is great.  I highly recommend this TV.", "Date": "January 17, 2014"}, {"Title": "Great value", "Author": "Hristo Zevlikaris", "ReviewID": "RC2TTI4644B1P", "Overall": "5.0", "Content": "Television is a great value for what you get, including 3Dtv and Smart TV.  I doubt you can find a TV with similar features for the price.", "Date": "January 15, 2014"}, {"Title": "The Picture quality is AMAZING ! my first exprience was.. \"WOW\"", "Author": "Taps", "ReviewID": "R2SZV7F2ND5OKH", "Overall": "5.0", "Content": "With this cost.. No one on earth can offer the features what the TV has.I tried 1080P videos. it needs lil eduacated setting , then Its looks like a painting on wall... Flawless.Tried 3d video content.  thats WOW.Smart application lil slow in starting. (it take the same time as my PS3 does).Initialy it may be a problem to find out the options in remot but with time it will became handy.(its natural thing with every new gadget).3d content !  AWSOME...The clarity will make you feel good n i cant stop smiling while watching.I have Connected to my PS3.  I will try a 3D game n will post my experience.delivery was in time n in perfect condition.So far I m satisfied.The money i have put n the thing i got is beyond what i expected,I will give 5 STAR because of the way it surprised me.Will update if i get any flaw.Thanks.", "Date": "January 8, 2014"}, {"Title": "LOTS FOR LESS", "Author": "tjwsmith", "ReviewID": "RYVE22U4NZIP1", "Overall": "5.0", "Content": "VIZIO HAS DONE A FINE JOB INCOPORATING SO MANY FEATURES IN THIS MODEL. The wi-fi connection does not stay on after use.  Maybe we are not accessing it correctly.  It would help if the manual was not installed because getting directions would be easier.  Otherwise, it's a bargain!", "Date": "January 8, 2014"}, {"Title": "great!!!!!", "Author": "namreh 72", "ReviewID": "R3HS5V6FX5F6QQ", "Overall": "5.0", "Content": "I'm just loving my tv..perfect size for my room ....this would be an great upgrade if your gonna buy a new tv...", "Date": "January 7, 2014"}, {"Title": "As usual Vizio wows on image and 3D, yawns on audio.", "Author": "Dustin", "ReviewID": "R2LLTINMG5ZJUN", "Overall": "4.0", "Content": "The built-in speakers are kinda flat with not much bass to speak of, so I ended up buying a sound-bar.  This is actually typical of Vizio. The picture and the 3D are really nice, though, and the TV is light enough to mount without needing a second person (assuming you're not mounting over shoulder height).  It doesn't come with any mounting hardware, you'll need a kit with M6 screws.  The Apps are nice, but the selection is REALLY limited; I basically only use Pandora, Accuweather, Netflix, maybe YouTube if I don't feel like whipping open the laptop, and the usual TV functions.Inputs are 2 HDMI, 1 component (RGB), Coax/RF/RG6 on the back, and one HDMI and a USB on the side (with an optical digital audio out).  If you own an older Wii, you will need a different cable to hook it up, there is no composite video jack (the yellow RCA jack). Same with the old-old-XBox, you'll need the component video cable.  Any newer system with HDMI is no issue.One pet-peeve:  The built-in TV speakers can be shut off through the menu, BUT will come back on when you turn the TV off and on again.  I need to get a hold of someone in tech support to try and fix that.  Also the digital audio out (optical) is ALWAYS ON when enabled through the menu (it can output PCM or Dolby), and muting the TV does NOT mute the digital audio, you have to mute the device receiving the audio.  Not ideal, but with the right universal remote, livable.", "Date": "January 4, 2014"}, {"Title": "Quality is good OS is not!", "Author": "Sina", "ReviewID": "R38GWF4D1LT1G3", "Overall": "3.0", "Content": "This TV has a good picture and sound quality so I have no complaints in this regard. However, it is very dumb (as it is supposed to be a smart TV). The main problem is that it doesn't use android as OS and your hands are very tied. As far as smartness you only have a few fixed apps like netflix, amazon, etc which work OK. It doesn't have a mouse, virtual keyboard is very bad, and the OS is very slow. If you don't use the smart features like youtube, ..., I recommend it. But if you do, I highly recommend you get a Samsung even if it means spending 100$ more.", "Date": "January 2, 2014"}, {"Title": "3D Heaven!", "Author": "Scott Rathbone", "ReviewID": "R2X05W21H6RZ6R", "Overall": "5.0", "Content": "Awesome 3D HDTV for the money! Put it in our upstairs game room for watching movies and playing video games and could not be more happier with it. Often on sale for $699.99 which is a screaming deal!", "Date": "December 16, 2013"}, {"Title": "Very Smart and Beautiful Image.", "Author": "Peri Basseri \"BigTime Peri\"", "ReviewID": "RR0TUGV1WCMTK", "Overall": "5.0", "Content": "Great value. Lots of features and excellent image. I definitely recommend this product. Takes a little patience to set-up.I haven't tried the 3D yet.", "Date": "December 13, 2013"}, {"Title": "Paired with the PS4", "Author": "Damez28 \"Damez\"", "ReviewID": "R212EQMR8PE73B", "Overall": "5.0", "Content": "I bought the TV for my game room and the picture is great. 3D games aren't available for the PS4 yet, but From what I've seen so far; there won't be any issues.", "Date": "December 4, 2013"}, {"Title": "Great Job!", "Author": "Betty Evans", "ReviewID": "R12X2V3JKNDHJM", "Overall": "5.0", "Content": "It arrived safe and works beautifully! It was just what I needed for a MAW Child!Glad you had it in stock!", "Date": "December 1, 2013"}, {"Title": "Excellent Choice. Cannot ask for anything better.", "Author": "Constantin Hodovanu", "ReviewID": "RC6XM0GF539X2", "Overall": "5.0", "Content": "Everything works very well. Easy to set-up including wi-fi. Excellent image and sound. I highly recommend this brand and model.", "Date": "November 26, 2013"}, {"Title": "Great TV for the money", "Author": "Stephen Burrington", "ReviewID": "R19PKX37CUW3OJ", "Overall": "5.0", "Content": "Great deal for the money....exceeds expectations. Out of the box simple setup found the wifi network greeat picture really happy we got it", "Date": "November 24, 2013"}, {"Title": "Spectacular TV", "Author": "Marj", "ReviewID": "R2L41JN3LQCLHF", "Overall": "5.0", "Content": "Great TV. Excellent quality for the app. My gripe is the Netflix app (have not tried much of the others) crashes without notice and is pretty buggy. Needs a software fix badly.", "Date": "November 19, 2013"}, {"Title": "TV with all of my viewing features", "Author": "Mantic Reviewer", "ReviewID": "R3KBASCFRYHOQR", "Overall": "4.0", "Content": "i got this up and running without any fuss.  I found the menu easy enough to navigate and I was able to do all kinds of things with the sound options.  3D worked as well as advertized and that is the bonus with this unit... cheap 3d.  For my viewing pleasure, I'm not a big videophile, so while I played around with the settings after reading the reviews, I found the mode that I liked.The sound was what surprised me.  I have this mounted on my office wall (a generous 12x13) and I bought a sound bar to go along with the TV.  This isn't one of the thin models and the sound shows.  When I compared the audio, it was close enough for me to send the soundbar back.  If I need big sound, I bought a cheap little amplifier and run it through a set of old Bose speakers I had in storage.Very pleased except for two things, the LED backlighting isn't as uniform as I'd like and every so often I get vertical lines running along a fifth of the screen on the right.  If I turn it off and on, they go away.  If it weren't for those two things, I'd give this five stars.", "Date": "October 27, 2013"}, {"Title": "LOVE IT", "Author": "DANIEL BARKELL", "ReviewID": "R2XUW57VYAXTGQ", "Overall": "5.0", "Content": "I AM ABLE TO WATCH NETFLIX IN 3D AND EASY HOOK UP. GOT HERE IN EXCELLENT CONDITION AND WOULD RECOMMEND IT.", "Date": "October 25, 2013"}, {"Title": "great deal", "Author": "steve", "ReviewID": "R3LMB222299UY5", "Overall": "5.0", "Content": "Bought this for my son and he absolutely loves it. Compares well to my 55 in 3d as well. Thanks", "Date": "October 11, 2013"}, {"Title": "3d Gaming not so great", "Author": "Theuser", "ReviewID": "RFDGL8XME43HC", "Overall": "3.0", "Content": "First off, this TV is awesome. No doubt, but if your buying for 3d gaming. I suggest looking somewhere else. 2D is awesome, HD is amazing. Set up was easy, and switching to 3d is even easier. I only have one problem with it. I'm a heavy gamer, so I switched the 3d on for online match, and I won't lie I was amazed. But, I soon noticed there was some ghosting on the edges, near the corners when the gun shows in Black Ops 2. The gun shows off double vision, along with the A & B labels for the bombs sights. Since it's passive, there's really nothing that can be done. If you looking for a gaming Tv, it's best you look somewhere else. If not, and all you do is watch movies, well this is the perfect tv for you.", "Date": "October 9, 2013"}, {"Title": "Wonderful.", "Author": "DINGKE GONG", "ReviewID": "R2Q1N9WMMTYD64", "Overall": "5.0", "Content": "now enjoy the 42-inch 3D TV set.I play video games on it, and it is amazing!worth to buy.", "Date": "October 7, 2013"}, {"Title": "Awesome value, great TV.  Get it!", "Author": "BrooklynMetal", "ReviewID": "R2ZVBDKAR2DB5E", "Overall": "5.0", "Content": "Its a great tv for the price. I have two VIZIO tv's and I couldn't be more satisfied with them. Great picture and the 3D is awesome.", "Date": "October 3, 2013"}, {"Title": "Awesome", "Author": "deepa", "ReviewID": "R25FXG8LU6J2SY", "Overall": "5.0", "Content": "We got the right thing we wanted at the least price. We spent most of the day watching it. Loved it", "Date": "October 2, 2013"}, {"Title": "GOOD DEAL", "Author": "AWESOME", "ReviewID": "R28A7QYSG6HG2P", "Overall": "5.0", "Content": "It is a good tv ! It is cheap and really good quality. The image quality is more than enough . I like to watch it and the price is same with the 32 inch equivalents .", "Date": "September 13, 2013"}, {"Title": "What a great TV", "Author": "ilovegod2", "ReviewID": "R1R2I8LRHLAROR", "Overall": "5.0", "Content": "The picture quality is fantastic and I like it that the screen fits all the way to the end of the frame. It's also a very thin TV so it looks better and is light considering the size of it.", "Date": "September 3, 2013"}, {"Title": "Great TV!", "Author": "Tigger Soholt", "ReviewID": "R3QM7Z3AX3W84P", "Overall": "5.0", "Content": "My Samsung gave up the ghost after 5 years, so I decided to upgrade.  I went from a 720p 60hz 32\" TV to this one and was surprised by the difference in the clarity.  The only disappointment that I have is that some of my PS3 games don't work with the passive 3D feature and require active shutter glasses to work. I love to use the Netflix feature!  It is easy to navigate and get to.", "Date": "September 3, 2013"}, {"Title": "Vizio 42 inch smart 3d HDTV", "Author": "Jennifer Reilly \"Arizona Jen\"", "ReviewID": "R1LOHG3N836ETG", "Overall": "5.0", "Content": "Shopped around a while to find the best TV at the most reasonable price.  This TV has met my expectations.  Great picture and easy to use.  The price cannot be beat and would recommend this TV.", "Date": "August 29, 2013"}, {"Title": "Amazing", "Author": "Joseph Ruiz", "ReviewID": "R6T770CE9UIVL", "Overall": "5.0", "Content": "I got this tv because the other one i had before this was a Emerson tv with the big fat back, had it for like 10 years, it was time for me to get back to our time, this TV is Awesome, all the Apps lke pandora, Hulu, Netflix and i love how the Netflix button is on the remote because i Use it ALOT. SOunds great, i felt the bass off my Kendrick Lamar Radio on My panDora, The 3d is a little Tricky Though, Didnt really Care for it but the tv Visual is Fantastic", "Date": "August 27, 2013"}, {"Title": "great  tv", "Author": "Dorothy D.", "ReviewID": "R3B1GQ9G9MPWTH", "Overall": "5.0", "Content": "great picturethe only problem I have is that I can,t figure out how to access the various apps and smart tv features", "Date": "August 13, 2013"}, {"Title": "awesome tv for the price", "Author": "william Oconnor", "ReviewID": "RERQ1MELA536F", "Overall": "5.0", "Content": "This tv is amazing. I was a little worried buying a tv online but amazzon and fed ex did an amazing job. The tv was delivered on time and package was in pristine shape. After finally getting the tv set up which is quick, just 3 scews to install base and hook up cable and my 3d blue ray player to tv with hdmi cords, plug in tv and power on is all it took. I also love the interactive ownwers manual that you can find on help menu is also great for troubleshooting and set up. The picture is amazing and I watched my first 3d movie (Green Lantern) and the 3d effects were way above my expectations. Overall for price you will not find a better TV and I would recommend this TV to anyone, very happy with purchase.", "Date": "August 11, 2013"}, {"Title": "Great TV, Slow turning on", "Author": "Nick S.", "ReviewID": "R388SS9AWQRE80", "Overall": "4.0", "Content": "My only complaint about this TV is that when I turn the power on, it takes about 10-15 seconds before the the input is actually displaying. This is by far the slowest TV I've ever owed when turning on.Everything else is pretty good. Amazon Video is a little slow loading, but works great. Haven't tried any of the other services yet.My guess is that there is a slow processor built in, along with other components which keep the price of this TV down. For under $500, you really can't complain much about having a smart TV w/ 3D (passive) and Amazon video.", "Date": "August 2, 2013"}, {"Title": "Excellent buy for the price.", "Author": "Jesse M. Aliganga", "ReviewID": "R3EOYOWCCNVOQ3", "Overall": "5.0", "Content": "It's been great having this smart TV.  I have no complaints and it's easy to operate.  Speakers in the TV are great .  It's too bad I didn't buy a bigger set. Overall, I'm happy with TV.  The colors are great and so is the picture screen.", "Date": "August 1, 2013"}, {"Title": "VIZIO has done it again. A superb television made in America!", "Author": "Unbekannt \"ragmaniac\"", "ReviewID": "R3CFMJEKIDVJUC", "Overall": "5.0", "Content": "The headline says it all. This TV with all the bells and whistles gives me 42 diagonal inches of sheer pleasure.", "Date": "July 17, 2013"}, {"Title": "Great TV for a great price!", "Author": "Ohad Ella", "ReviewID": "RI7IL01LF6TCQ", "Overall": "5.0", "Content": "The 3D was much better than I ever expected. With added Apple TV, It met all my needs and more. Great picture quality as well!", "Date": "July 17, 2013"}, {"Title": "Awesome.", "Author": "Nancy", "ReviewID": "R1VCQDFRTEQOU9", "Overall": "5.0", "Content": "Awesome TV and a great price.  I have yet to figure out all the options.  So far it is a great TV.", "Date": "July 15, 2013"}, {"Title": "Great TV! Awesome 3D", "Author": "Kelevra", "ReviewID": "R1DFD23M2R5XRP", "Overall": "5.0", "Content": "I used to have a Vizio 32\" 3D, but oh my does that 10\" make a world of difference! I like the internet Apps on it, my only wish is that the native player for streaming media from a network share would support more of my data, I've only gotten it to play AVI videos.", "Date": "July 13, 2013"}, {"Title": "We love it!", "Author": "lashata", "ReviewID": "RT5BVLA1QPVV3", "Overall": "5.0", "Content": "My husband and I were very skeptical about buying used items, especially a flat screen tv. The price was very affordable and it came on time. There were very little marks on the screen but was easily fixed by cleaning it. Overall, we are very satisfied with this purchase and would definitely recommend it to anyone.", "Date": "July 7, 2013"}, {"Title": "Best Picture In The House!", "Author": "randoman73", "ReviewID": "R1QYAYOKYBV7J5", "Overall": "5.0", "Content": "This is my first Vizio television and I am very happy with the purchase.  It beats the picture of my 4 year old 1080P/120HZ/10,000,000 to 1 plasma hands down.  I have not tried the 3D yet because the BluRay hooked to it does not have that capability.", "Date": "July 5, 2013"}, {"Title": "Great Picture", "Author": "Pat Cassidy", "ReviewID": "R2ZLQEI7ERA9N8", "Overall": "5.0", "Content": "Picture quality is sharp, and clear. Meets and exceeds my expectations, 3d is not a gimmick quality is comparable to theater experience!", "Date": "June 22, 2013"}, {"Title": "Great TV", "Author": "Wayne. C. Scott", "ReviewID": "R2IVX7H75W62ID", "Overall": "5.0", "Content": "I do not follow commercials on TV explaining how good their products are. I just read the reviews from other customers to help me make my decisions.  I was looking at the Samsung LED TV but after seeing the good reviews on this Vizio I purchased it.  The price was good, easy set up and the picture is outstanding.", "Date": "June 11, 2013"}, {"Title": "Great TV and Easy to use", "Author": "Linda", "ReviewID": "R2FXKJXGQS4HR3", "Overall": "5.0", "Content": "We updated from a fossil version TV so anything would probably be stunning!  However, this TV was great for it had the features we were looking for, easy to order and install and as a use of a 2nd TV in a bedroom, it's perfect!  The 3-D feature is a funky thing and rarely in use, but, hey kind of fun to have the option with an animated feature and the like.", "Date": "June 11, 2013"}, {"Title": "Nice TV overall", "Author": "Mike Scioscia", "ReviewID": "R15T00T763G1B3", "Overall": "4.0", "Content": "This TV has a great picture and gives you a lot of control to adjust the image.  I have read some complaints about the apps but they work just fine for me.  The only negative things I can say about this TV are that it takes a VERY long time to turn on, way longer than any TV I have owned.  The other nagging thing is with the TV on, once I turn on a connected device like my DirecTV box, the TV's controls cease to work for 20 seconds or so.  That means I can't change the volume from the TV or the remote, which can be a bit of a problem at times.  Overall though I think it is a great TV for the money.", "Date": "June 10, 2013"}, {"Title": "nice tv", "Author": "cheryl", "ReviewID": "R3F5KS8VI4GIK1", "Overall": "5.0", "Content": "I did a lot of research before I purchased this tv.  It is just what I hoped it would be, great picture, great apps, I use the ethernet cord instead of wi-fi it is better for me at least.  I recommend this for the picture and the bang for your buck.", "Date": "June 7, 2013"}, {"Title": "Very good picture.  Cool Tv.  and Rockin Audio", "Author": "keef", "ReviewID": "R3VMZZ55H85HJ3", "Overall": "5.0", "Content": "Although i have not boughten very many TV's in my life, i have to say this TV is very top of the line.  Especially for the price!  I would recommend this TV to anyone buying TV's in general.  Although if you don't want 3D or don't have need for it i would probably go with the model without 3d.  I really like the small bezel around the television.", "Date": "June 3, 2013"}, {"Title": "Bb review", "Author": "Barbara Baevitz", "ReviewID": "R3R9HICQAKPEL", "Overall": "5.0", "Content": "Est Great tv enjoy watching tv its my first flat screen tv color is hr everything nicer and clearer and brighter", "Date": "June 2, 2013"}, {"Title": "A very cool TV", "Author": "Ronald Yarger", "ReviewID": "R3IC6J2S6F1RUI", "Overall": "4.0", "Content": "This has got to be the coolest TV I have ever owned. The Wi-Fi was connected very quickly and took just minutes to set up the TV, and even connected to my YouTube account and found some videos that I posted years ago. Very good TV and a very good price.", "Date": "May 26, 2013"}, {"Title": "Great buy.", "Author": "Debra Martin", "ReviewID": "R23KB2EOKAHW2O", "Overall": "5.0", "Content": "I really love my plasma TV but bought this one because it was a smart 3D TV for the same price.  Satisfied with purchase.", "Date": "May 26, 2013"}, {"Title": "for 550 the best tv you can get  early 2013", "Author": "daniel", "ReviewID": "R2XY1FESD08VBR", "Overall": "5.0", "Content": "this is my first vizio and im very impressed this tv is way better than the samsungs in my house. maybe its not fair maybe to compare the samsungs both are plasma let me tell you led blows em away picture quality is so sharp and clear i wasnt expecting this good quality for 550 dollars. i bought the other samsung for 600 like 2 years ago and i had anouther samsung which just died out which i got in like 2010 which was like 1000 at the time.the 3d functionality is cool to have but the internet app is where its at i put this tv in my room where i dont have a cable outlet. so i just use the internet apps and my ps3 and xbox 360 this is a great tv would recommend to anyone if you got the room", "Date": "May 25, 2013"}, {"Title": "Great TV", "Author": "R. R. Sermons", "ReviewID": "R2CHB674BBP1AS", "Overall": "5.0", "Content": "Bought it for my Bedroom and gaming. it works great no longer have to use my PS3 to watch nextflix. Simple and easy to setup even with the remote that comes with the T.V. but if you plan on using apps that requires a lot of typing, I would get a remote with a keyboard. Great sound for a flat screen. 3D works great but I feel like a dork wearing the glasses in my bedroom but for the price point I just couldn't resist.  Needs a Spotify App but they do have Pandora and Rhapsody.", "Date": "May 22, 2013"}, {"Title": "AWESOME!", "Author": "Seth Rettig", "ReviewID": "RZSSVLJKFD7LU", "Overall": "5.0", "Content": "An all around great TV plus it's a real nice price. Vizio is much better than most of the other high end TV's.", "Date": "April 4, 2013"}, {"Title": "Outstanding", "Author": "T. Pospichal", "ReviewID": "RGGMV0ERAB2JR", "Overall": "5.0", "Content": "While we have just had this TV for two days, installation and setup, including WIFI and streaming video, was extremely easy, using the quick setup guide and online help. So far, picture quality is brilliant.", "Date": "March 29, 2013"}, {"Title": "i love it", "Author": "ratemoore", "ReviewID": "RKFFPOYEN8KUS", "Overall": "5.0", "Content": "Fast shipping and awesome features. I love the size and how thin this tv is. Easy set up and great sound.  I purchased this tv to replace my last flat screen (same size) i have not used the 3d feature yet but I'm sure it's cool, I'm just waiting on a sound bar.", "Date": "March 19, 2013"}, {"Title": "What a great TV!", "Author": "W Jeffry Stein", "ReviewID": "RHOR3IJDYAGM9", "Overall": "5.0", "Content": "This is our first Smart TV.  I did a lot of research and discussed options directly with Vizio.  In spite of what turned out to be very clear directions on how to log into my wireless network I failed to figure it out, called Vizio and they very politely answered my questions and got me up and running quickly.Still exploring all of the TV's capabilities, but the picture is great, sound great and look of TV great.  Would recommend this to anyone wanting such a TV.", "Date": "March 18, 2013"}, {"Title": "Vizio E420d-A0", "Author": "Terry Hastings", "ReviewID": "R1EYIO42HE8HJH", "Overall": "5.0", "Content": "This product was every thing i expected, great picture and sound. Easy setup out of the box had it up and going in 15 minutes.", "Date": "March 12, 2013"}, {"Title": "Great Value", "Author": "KP", "ReviewID": "R1ANXJ9N5WHAI6", "Overall": "5.0", "Content": "I have had this TV for seven months and am pleased with its performance and Amazon's price.  Although someone set it up for me, including the wireless settings,  I could see that the process was easy.  The wireless is flawless,  the picture/colors very nice, and the sound quality is fine for a TV;  I didn't buy this to listen to grand opera. I have only watched one 3D movie and that may have required a setting I did not do. Would recommend this product.", "Date": "October 1, 2013"}, {"Title": "Does Not Turn On", "Author": "Matthew E DeMichiei", "ReviewID": "R11MVZ5F27GXN3", "Overall": "1.0", "Content": "Pretty much sums up my issues with this product.  I was able to turn it on twice, then if you so much as move the power chord the television will just shut off.  Then I realized that a lot of other people have had this issue.  I've tried all the online tips on how to reboot the TV save the ones that involve dismantling the back since that would prevent any sort of possible refund.", "Date": "September 2, 2013"}, {"Title": "Very Satisfied", "Author": "Valkryn Exodius", "ReviewID": "R1LWWIL9PQFDW3", "Overall": "5.0", "Content": "I'm going to be honest, at first I was very skeptical about the picture quality of this TV but after messing around with the video settings my initial feelings towards it did a complete 180. Here's what I personally recommend for optimal picture. First, follow Zachary Dunklee's instructions for adjusting the color temperature and make sure you do this under the \"custom\" option. Outside of that my personal settings are as follows and they've been working quite well for me:PicturePicture Mode: GameBacklight: 100Brightness: 50Contrast: 50Color: 50Tint: 0Sharpness: 4Advanced PictureNoise Reduction: HighMPEG NR: HighColor Enhancement: Normal (setting this to rich like Zach recommended made certain colors too dark or too bright for me)Adaptive Luma: StrongFilm Mode: OffSmart Dimming: OffAmbient Light Sensor: OffI would also like to comment on the sound quality of this TV since it is probably the best built in sound I have ever heard in an HDTV. Granted there aren't many cases I can compare this to since many of the other HDTVs I've seen have been equipped with sound bars or systems. I can say that the sound is better than the HDTV I had before this one. The only complaint I have with this TV so far is that you have to adjust the video settings for every input which is a real pain. All in all though, this TV is awesome and you would be hard pressed to find a better TV for the same price.PS: Please let me know if there is inaccurate information contained in this review and I will fix it. Thank you!", "Date": "March 6, 2013"}, {"Title": "good tv", "Author": "Jonathan Hallisey", "ReviewID": "R33NJY9UJPSRHB", "Overall": "4.0", "Content": "the 2d quality of the tv is great! the picture quality is flawless and the price was definitely right! the problem is that i bought this tv for the 3d function and after a few days of messing with the settings i still cant get the picture right in 3d mode...i have to look at it cross-eyed to see the picture right. the internet apps are cool but shouldn't be your main reason to get this tv because the options are limited and i dont think you can add any additional apps than what it comes with. overall i am happy with my purchase and i will be even happier once i get the 3d working properly", "Date": "February 14, 2013"}, {"Title": "Horrible TV", "Author": "Solomom", "ReviewID": "R2VHZDCYXFVBNV", "Overall": "1.0", "Content": "I always thought that Vizio is a reliable brand, but after three weeks of having it the TV just died. Fortunately, I was able to return it and get a full refund. I certainly do not recommend this TV.", "Date": "January 30, 2014"}, {"Title": "Never been happier", "Author": "David", "ReviewID": "R5WBGWUVI3PCO", "Overall": "5.0", "Content": "This Tv is awesome. Its sleek light and very easy to set up. This is my first 3D led hdtv and my first 55 inch tv and I couldnt be happier.  The pictire is very crisp and rich, the 3D is amazing, and the speakers arent bad for such a slim TV. The only gripe I had was that the specs said it came wiyh a qwerty keyboard remote and it didnt. It only came with the typical Vizio remote control. It was an easy fix though, just order a qwerty vizio remote for 10 bucks and problem solved. The smart apps are decent I havent had any problems with them so far. My ps3 games look amazing on it and it does have a power indicator you just have to turn it on in the settings. Overall im very happy for the price. I will buy vizio again.", "Date": "July 27, 2013"}, {"Title": "A lot of TV for very little $$", "Author": "Craig Walker", "ReviewID": "R32USUQYVN1IMH", "Overall": "4.0", "Content": "When I started hunting for a new TV for my living room I was not in the market for a 3D...I wasn't even in the market for a smart TV but when I came by this which claims to be a true 120hz 3D Smart TV I had to bite. The Vizio E420d-A0 is a phenomenal bang for your buck, so many features for such an entry level TV price.I hadn't had my Cable box set up yet in my apartment so when I received the TV So I had no way of testing it's abilities aside from my Xbox and let me tell you; the picture quality was excellent!  I later got my HD set up and introduced a 3D Blu-ray player to my arsenal and WOW!Only think I don't quite get is under regular viewing, it doesn't appear to ever hit that 120hz threshold.  In 3D it's very clean and crisp and I can def. pick up on the 120hz display but otherwise it seem more like an almost 120hz.  Then again, HD TV with Comcast only displays in 720 so I don't get to take advantage of it's true HD a majority of the time.Whenever I have friends over and they ask about the 3D I put the below trailer on for them and everyone is blown away.  Remember, in life you get what you pay for, while yes it says smart 120hz 3D TV, take it with a grain of salt.  This is still a great deal, but if you were to go toe to toe with a higher end TV (Samsung, Sony or Panasonic with true 120hz) you'll notice a slight difference, not large enough to justify the additional $2-300 spend.If you really want to experience the beauty of this picture and display, hook up a Blu-ray or find some true HD content on YouTube; it'll blow your mind how crisp this picture is.", "Date": "July 25, 2013"}, {"Title": "Unbeatable Price", "Author": "Lovestoshop777", "ReviewID": "RBBO39BTXNZ4G", "Overall": "5.0", "Content": "First of all, the 3D is amazing! I have a ps3, and ordered Avatar, Monsters Inc., and Ice Age Continental Drift in 3D with this TV. Wow! Avatar really is amazing on 3D. I need to purchase the active shutter glasses now. The regular theatre glasses that come with the TV are great, but the electronic glasses will fix the problem of having to be in front of the tv, which you would get with any 3D TV. One problem I did find, I put on the Blu Ray \"Rio\" movie, and you can see blur each time there is movement. This is disappointing, but the good thing is that it does not happen with all movies to where you notice it. I looked EVERYWHERE, and no place could compete with the price and features of this TV. I play Black Ops 2 on the ps3, and my Kill/Death ratio immediately improved. I used to use a 32\" Vizio, but this is much better than that one. I really loved the TV. I did not use any of the settings recommended by the other people. I preferred the Vivid setting with the sharpness lowered a little bit down to 10. Thats it. It looks much better and brighter like that to me. Great buy!", "Date": "March 14, 2013"}, {"Title": "Best LED for the money, hands down !", "Author": "Brandon", "ReviewID": "R13Y5F9S4GRRGH", "Overall": "5.0", "Content": "I got this tv as my new monitor to my computer.  The tv is amazing to say the least.  I also bought it because I THOUGHT it had 2d into 3d conversion; it does not.  It does have 3d thought,as you already knew.Vizio found my wifi right away and got it accepted right when i put my password in.  There was a comment on here that the tv didn't get a password to the mans wifi and he had 3 geek friends to figure it out.....  It's not hard.  It asks you for the password, and you put it in correctly.Th picture is clear as day, and the colors are great.  I took the advice about changing the color, and it is nice.  Although, it honestly didn't need to be changed from the standard settings.the vizio apps work great.There is no reason you should not get this tv.  It is led, lcd, 3d, 42 inches, 120hz refresh rate, apps, and the video in HD video looks fantastic.  All this and more for  $528.  You can't go wrong.Vizio is the reason all the other big companies are losing sales!!  Think about it.", "Date": "March 14, 2013"}, {"Title": "great TV!", "Author": "mbh", "ReviewID": "R1LJZAO4W9XCPC", "Overall": "5.0", "Content": "Very easy to install.  Hung it on the bracket and plugged it in, great picture.  Only complaint is the triangular piece on the bottom for the stand.  Can't remove it, and looks kind of stupid when hanging on the wall.", "Date": "February 10, 2013"}, {"Title": "Even my wife approved", "Author": "A. D. Sterling", "ReviewID": "R47C3OJWZYO78", "Overall": "5.0", "Content": "Her only comment was that we need a bigger one, so the 55\" is on the way. Easy to set up, Amazon instant prime and other internet setup was a piece of cake. Did spring four  4-pack of VIZIO's glasses which are slightly (almost imperceptibly) be and have satin pouches to keep them in. So we LOVE the image and price, it's destined for the summer home and the 55\" VIZIO will be here next week,", "Date": "May 31, 2013"}, {"Title": "Vizio 42\" for a PC - Lil Tricky", "Author": "Justin D. Lewis", "ReviewID": "R1KOBG9P5LQKJB", "Overall": "5.0", "Content": "OK first I use this LED as my monitor for my computer. I came from a Toshiba Regza 42\" which I loved to this. When I first hooked it up I didn't like the picture quality at all it was dull and it sucked badly.  Here is what I did (remember this is for a PC setup) - when hooked up to a computer (gtx 570 - my card as an example) you MUSTTT go to Nvidia Control Panel - Adjust desktop color settings - at the bottom you will see content type reported to the display - set this to Full-Screen Video (this will enable advanced picture options)If you get weird colors shutoff your computer and tv, restart your computer and then turn on the display. Now going from dull and sucky to beautiful on a PC this is what I did.In picture on the LED -I set picture mode to custom -Backlight - 100Brightness - 50Contrast - 50Color - 50Tint - 0Sharpness - 8Hit More -I put color temperature on custom - Cool sucked in my opinion - it's not original PC in my eyes.on custom it should be different than cool but all color gains and offset should say 128.Hit Advanced picture -Noise Reduction - OFF - always off on a PCMPEG NR - OFF - always off on a PCColor Enhancement - Rich Color (it's gorgeous)Adaptive Luma - Strong (this is the biggest impact on the TV It actually makes it a 2grand TV)Film Mode - OFFSmart Dimming - OFFAmbient Light Senor - OFFNow it is set for a PC with very very close to a 2 grand display in picture quality.  This TV honestly does rock.", "Date": "March 12, 2013"}, {"Title": "Well worth it for 3D", "Author": "Pen Name", "ReviewID": "R3D5JA3FGR00JB", "Overall": "5.0", "Content": "With a $530 price tag you really can't do better than this. (3D LED 120hz w/Apps)  This is a GREAT TV!  Sleek and stylish.  The passive 3D is the way to go.  Have used active and I noticed eye fatigue.  The 3D with this set is clear and crisp without any ghosting.  I have watched approx 10 movies in 3D ranging from animation to live action and they all look great!  Good for small to medium sized rooms.", "Date": "March 9, 2013"}, {"Title": "Great Value can't beat it", "Author": "MJ", "ReviewID": "R2BBZ2SFA275CR", "Overall": "5.0", "Content": "I purchased this tv 3 days ago and I am very satisfied with my purchase, where else are you going to find an LED 42in 1080p 120hz refresh rate 3D smart tv for $519.99?? I was a little nervous at first because of the grainy picture the first day when using it but these tv's need a little warming up out of the box to get adjusted the next day everything was perfect with the exception of some picture settings as listed in one of its reviews, highly recommend following the user suggestions in movie mode etc. I'm confused on some of the 3D settings can someone please help my out? 3D works great on my Comcast on demand 3D purchases but when playing amazon 3D movies there is something off even when adjusting settings to any of the 3D options do I need special 3D HDMI cables? Any help would be appreciated! also smart features work great comes equipped with YouTube which comes in awesome btw, I actually purchased the vizio remote control with a back keyboard for $12.99 highly recommend, you will not want to use the smart features without it and no set up needed, remote works right out of the box. I love the amazon app, scrolling through movie selections are a breeze!! Way better than selecting a movie through my ps3. Pandora is not equipped even though it is displayed in the product ad, you will have to use rhapsody and purchase a monthly sub but you do get a free 30 day trial. this television looks very sharp about half the weight and thickness of my last 42in vizio which is why I needed an upgrade after 5 years, very happy with my last vizio and they are a brand I trust! Selected the free 5-8 ship came 4 business days through ups in perfect condition. Set up was a breeze connected to wifi within seconds. Will be purchasing a couple new sets of glasses though the ones in the box are a little flimsy. My only legit negative comment is the sound don't expect movie theatre surround sound unless you purchase a sound box or home theatre system! Sound isn't the best but me personally I don't have to worry because I have a surround sound system which is awesome. So if you are looking for a great value within a reasonable budget you will not go wrong with this purchase!", "Date": "February 28, 2013"}, {"Title": "Very pleased once setup.", "Author": "Barbara Smith", "ReviewID": "R3GN0VIRMZ3ZX6", "Overall": "4.0", "Content": "Arrived on time.  Not to easy to set-up for non-techie person.  Great sound.  Haven't found the 3D yet.  Will have to checkout Youtube.  Would buy again good price.", "Date": "February 15, 2014"}, {"Title": "Good value...but so so picture.", "Author": "Joanne M Martin", "ReviewID": "R2FRMIA9FTDMUY", "Overall": "4.0", "Content": "I am glad I invested in this television, for the price at the time, it was good value.  I would say that the picture is not so great and does not live up to the other televisions in the house.  I have read many reviews to try and work out the problem, but it appears it is just hit and miss with this.", "Date": "February 9, 2014"}, {"Title": "excellent tv", "Author": "Jamael Smith", "ReviewID": "RP9VHGRNPJEVD", "Overall": "5.0", "Content": "Worked as advertised. I haven't had any problems with it at all. My suggestion is get a qwerty remote. Great color.", "Date": "January 23, 2014"}, {"Title": "Vizio Smart 3D HDTV", "Author": "Terry Dunbar", "ReviewID": "R241QL2SC3LRB8", "Overall": "5.0", "Content": "The order was satisfied promptly and the product was as described.This TV has one of the brightest and clearest pictures I have seen.  The Smart features permit direct access to the internet without the need for an attached computer.3D viewing is incredible in high definition. Unfortunately, shortly after purchasing the TV, ESPN stopped broadcasting on its ESPN3D channel but until they closed the channel, the 3D sports programs were fantastic in 3D. Thanks, ESPN.", "Date": "January 8, 2014"}, {"Title": "It's totally a TV", "Author": "owtshark", "ReviewID": "R3B0TYQL6V59IB", "Overall": "5.0", "Content": "Sometimes I think it isn't, but then I turn around and look at it, and sure enough, it is. Baller.", "Date": "January 7, 2014"}, {"Title": "Superior TV!!", "Author": "G. Kenneth LeFave", "ReviewID": "R3KMJF32MPW9OM", "Overall": "5.0", "Content": "I spent two years researching flat-screen TVs. I compared ratings; features, prices, et.al; I can unequivocally state that VIZIO is a top \" state-of-the-art\" product. It is one of the few TVs today that produces excellent sound quality; I found that many new flat screens are \"weak\" in this area. I play music channels on this TV - and the sound reproduction quality is excellent. The picture is spectacular; friends and neighbors tell me it is much brighter and clearer than their own, comparable flat screen TV. The price is  reasonable when compared to similar products; particularly when assessed against the \"big-name\" brands.", "Date": "December 31, 2013"}, {"Title": "Excellent picture and it is an affordable 3D TV", "Author": "Ovat-68", "ReviewID": "R2MJ04C3MK2RUG", "Overall": "5.0", "Content": "This a unit that can give you all the goods and pros of HDTV picture, let you see 3D content with superb quality and still fit reasonably within your budget", "Date": "October 17, 2013"}, {"Title": "its amazonaizing", "Author": "Jonathan", "ReviewID": "R2HUATJ2JEVSB0", "Overall": "5.0", "Content": "Wow what can I say about this tv... Its amazing... The picture is so clear it makes regular programs look blury... You will need some hd channels to truly appreciate the picture. Its sound is awesome and the 3D is an added bonus. It will not let you down... Great choice for an affordable hd 3D tv.", "Date": "September 29, 2013"}, {"Title": "very nice", "Author": "John DeTar", "ReviewID": "R2CMBCCEE287K1", "Overall": "5.0", "Content": "I'm very impressed. 3d is great depending on which movie. Enjoy everything else. Smart tv is great and hooks up easy.", "Date": "September 12, 2013"}, {"Title": "Great TV!", "Author": "glen", "ReviewID": "ROZJI36DX004I", "Overall": "4.0", "Content": "Love everything about it but a little disappointed on the limitations of the Smart internet features. There are a few useful apps but no browser allowing me to go anywhere. I was really hoping this would allow me to check my bank account, pay bills, fantasy football, etc. Instead I only use it for Facebook updates and trying to type anything in is very tedious. The user (me) may be the main issue with this product though so I'm not complaining.", "Date": "July 11, 2013"}, {"Title": "Can't go wrong for the price.", "Author": "Dell", "ReviewID": "RMI732J9DQV7K", "Overall": "5.0", "Content": "Very happy with this TV. For anyone who is considering a Smart TV for the guest room this one is great!", "Date": "June 13, 2013"}, {"Title": "Great TV for the price!", "Author": "David Greggo", "ReviewID": "R1WYFDUUYTIT84", "Overall": "4.0", "Content": "So, I did a bunch of research on a new TV for my gym.  This seemed to have a bit of overkill for my purposes, but I was curious to see what the extra features are like.  However, DON'T buy this TV for the extra features if you don't have a blue-ray player with 3D capabilities or you won't be able to use the 3D functionality.  Also, the \"SmartTV\" isn't so smart in my opinion.  For these 2 reasons, I gave it 4 instead of 5 stars because the price is so low, but I can't really use these features.  I wanted to have internet access on the TV, but Smart TV doesn't necessarily mean that.  It means, you can use the pre-loaded \"apps\" that come with it.  I wanted to be able to use my spotify account to play music while working out and I wanted it to be able to watch movies if I'm cycling indoors for a couple of hours.  However, all in all, this TV is GREAT for the price! The picture looks great and the sound is ok.  It could use an external sound system if you really care about sound quality.", "Date": "April 22, 2013"}, {"Title": "works well, good picture, wi-fi easy to setup", "Author": "Chuck Toedtman", "ReviewID": "R2TQ3GGOKNU85N", "Overall": "4.0", "Content": "Good picture,changes from regular to HD extremely fast. Smells like hot electronics when on more than 15 min good buy", "Date": "April 15, 2013"}, {"Title": "Cheap and good!", "Author": "Davide D'Agostino", "ReviewID": "R2USQ9RK347DBN", "Overall": "5.0", "Content": "This TV is cheap but is one of the best display ever seen.I haven't try yet the 3D but it has gorgeous rich colors.The menu is a bit slow and sadly no HD but ... nvm.Thanks Vizio!", "Date": "April 4, 2013"}, {"Title": "Great TV", "Author": "Douglas Von Feldt", "ReviewID": "R2XRH0PTC49BQD", "Overall": "5.0", "Content": "We had it for a month and so far so good.  Plenty of inputs and the sound isn't bad. The setup screen is also easy to use", "Date": "March 31, 2013"}, {"Title": "Great buy for the price", "Author": "sandor clarke", "ReviewID": "R1EXJKEG90POH9", "Overall": "5.0", "Content": "nice picture and sound well worth the little over $500.00 we paid for it . i have not used the 3D yet but im sure that it is great.", "Date": "March 28, 2013"}, {"Title": "Best 500 dollar TV money can buy!", "Author": "Amazon Customer", "ReviewID": "R159EGOMNZ9CLU", "Overall": "5.0", "Content": "Fast shipping and in exellent condition. Got it in two days. Setup is a breeze and anyone that can read shouldn't have trouble. Realy any other brand with the same specs will cost at least a couple hundred dollars more. I use the apps, have watched 3D movies, and of course jusst TV and this thing perfoms flawlessly. Really the only con for some may be its thickness but it isn't a problem for me. Couldn't be happier.", "Date": "March 24, 2013"}, {"Title": "Awesome!", "Author": "javier florez", "ReviewID": "R1P4EQYNOVL1O1", "Overall": "5.0", "Content": "It was what I expected. With excellent price. In other stores cost 600 dollars! Good brightness, 3D looks great with my PS3.", "Date": "March 18, 2013"}, {"Title": "This TV is outstanding!", "Author": "K. Chambers \"khcham\"", "ReviewID": "R2GVMBHEOAYMDY", "Overall": "5.0", "Content": "A 42\" 3D LED TV is the best one I've ever owned. The picture is crystal clear when watching regular TV and watching blu-ray movies is even clearer.  I'm seeing colors and details that I have never seen with other TV's I've had. I purchased a 3D cable so I could look at my cable company's 3D movies that they offer with On-Demand. The 3D looks just like it does in the movies. I purchased several 3D movies and am very impressed with the way they look. It's just like what you would see in the theatre. This TV is truly a great buy!", "Date": "March 7, 2013"}, {"Title": "I absolutely love it!", "Author": "Rocky D. Grim", "ReviewID": "R3KR0EA0CJE73B", "Overall": "5.0", "Content": "I just got my Vizio 3D TV about three days ago March 4th 2013. I love this thing. I got this after my Panasonic 42\" plasma was damaged during a warranty repair by Target. Up until I bought this I liked plasmas a lot more. With plasmas you don't have to worry about ghosting or image blur. However, with this new Vizio I have not seen any blurring either. With a few tweaks the picture quality is amazing. I even tried out the 3D by playing games like Call of Duty Black Ops 2 on Xbox 360. It makes the game come to life! The sound is pretty good too. Its an awesome TV. For the price Amazon is asking for one I feel like its a steal at this price. I defiantly think everyone should have one of these!!!", "Date": "March 7, 2013"}, {"Title": "that great big disappointment to get my tv with split screen", "Author": "keyllin carreño", "ReviewID": "R1L2EG9WLR83RM", "Overall": "1.0", "Content": "my first review is the box where they keep these tv, does not protect anything, it seems that they are made to split the screen. that desegcion so big and sadness. the screen is very fragile not recommend buying. It is my opinion", "Date": "January 9, 2014"}, {"Title": "My IT guy was right", "Author": "Maria D'Alessandro", "ReviewID": "R25IMBNYJ8IHU5", "Overall": "5.0", "Content": "I'm tech challenged but did a bit of research and consulted with the IT guy at my job before purchasing. He suggested this site and this product. I have DirecTV and while the tech wasn't supposed to connect it, he did so anyway since the woman who processed my request made an error. I have yet to be disappointed. HD is sooooooooooo awesome. A personal friend (who is also an IT guy) is gonna hook it up so I can stream. Like I said \"I'm tech challenged\" but I gotta a lotta friends *: D", "Date": "December 17, 2013"}, {"Title": "GIFT FOR DAUGHTER IN MILITARY", "Author": "cpete", "ReviewID": "R2HNWMHU7U4R2W", "Overall": "5.0", "Content": "AFTER READING THE REVIEWS ON THIS VIZIO  TV WHICH FOR THE MOST PART WERE MOSTLY POSITIVE I DECIDED TO PURCHASE THIS TV AS A GIFT FOR MY DAUGHTER WHO IS SERVING IN THE MILITARY. I HAVE NOT HEARD FROM HER YET REGARDING THE TV. WITH THAT SAID, I AM HOPING SHE WILL BE ABLE TO SET-UP THE TV WITH LITTLE OR NO PROBLEM. WHEN I GET SOME FEED BACK FROM HER I WILL UPDATE THIS WRITE-UP....THE TV HAS MANY OF THE LATEST FEATURES AT A REASONABLE PRICE WITHOUT BREAKING THE BANK.  UPDATE FROM MY WONDERFUL DAUGHTER......SHE STATED THE FOLLOWING...PRICE: PERFECT!(BECAUSE IT WAS A GIFT FROM MY AWESOME PARENTS....THANK YOU.APPERANCE: SLIM, SLEEK, AND RAVEN BLACK. REALLY ATTRACTIVE AND WILL FIT IN WITH JUST ABOUT ANY KIND OF DECOR WITHOUT DETRACTING FROM IT.THE SCREEN WILL SMUDGE A LITTLE SO BE CAREFUL WITH THAT.WEIGHT: WEIGHTS VERY LITLE AND IS EASY TO HANDLE ESPECIALLY FOR A SINGLE INDIVIDUAL.SETUP: FAIRLY SIMPLE FOR THOSE WITH A MODICUM OF TECHNOLOGICAL CAPACITY. HOWEVER, HAVING A REMOTE WITH FULL QWERTY KEYBOARD WOULD MAKE SETUP A LITTLE EASIER. REALLY LIKE THE FACT THAT INSTRUCTONS AND SETUP ARE FOUND WITHIN THE ACTUAL TV SO YOU DON'T HAVE TO WORRY ABOUT LOSING THE GUIDE.RESOLUTION/COLOR/CLARITY: REALLY GOOD. NO GRAINIESS BUT THE COLOR PALETTE IS A LITTLE DESATURATED. I MIGHT HAVE TO PLAY AROUND WITH THE SETTINGS A LITTLE. THERE IS A LITTLE BIT OF GLARE BUT NOTHING TOO DETRACTING.REMOTE: VERY UNCOMPLICATED WHICH IS WONDERFUL BECAUSE NO ONE LIKES HAVING FIVE REMOTES TO CONTROL ONE TV. I ESPECIALLY LIKE THE NEFLIX QUICK ACCESS BUTTON. THE BACKLIT BUTTONS ARE A NICE TOUCH FOR TV VIEWING.CONNECTION: THIS IS THE BEST PART OF OWNING THIS DEVICE. THE CONNECTION SPEED IS AMAZING. (I HAVE TIME WARNER SERVICE) I SWITCH FOM HDMI 1 TO HDMI 2 TO NETFLIX ALL IN THE BLINK OF AN EYE.EASE OF USE: ONCE AGAIN, REALLY SIMPLE TO USE!3D: HAVEN'T USED THIS YET.SOUND: VERY GOOD, PROBABLY NEED A SOUND BAR FOR SURROUND SOUND EXPERIENCE BUT ITS PRETTY GREAT ALL ON ITS OWN.WELL THAT'S MY EVAULATION ON THIS WONDERFUL PIECE OF TECHNOLOGY...HOPEFULLY, EVAULATION WILL BE USEFUL AND INFORMATIVE...HAVE A WONDERFUL DAY TO ALL WHO READ THIS WRITEUP.....", "Date": "July 27, 2013"}, {"Title": "Vizio products are worth the money!!", "Author": "Amazon Customer", "ReviewID": "R2OKJI4UH5KXRC", "Overall": "4.0", "Content": "I researched flat screens for several months.  I absolutely love these TVs.  I love the fact that my kids are able to watch kid friendly shows.The only con to this product is that you can not easily access your Amazon watch list.", "Date": "March 25, 2013"}, {"Title": "Amazing TV for the price!", "Author": "Tony", "ReviewID": "RI5ARZWUAUFPT", "Overall": "5.0", "Content": "I've had this hdtv for a few days now and am truly impressed by it. Paired with my Sony blu ray player, the 3d is definitely cinema quality and the image remains pristine throughout with no pixelation or ghosting even during fast, high energy scenes. I had no problems connecting the tv to wi-fi or using the on screen apps. I'm not one that needs to be constantly connected 24/7 so I gave this feature a test run just to make sure it works and it worked perfectly for me.I'm also a big fan of all the picture and audio options the tv includes. Not only do you get the basic color, contrast, tint, etc. functions but it also includes individual color gain and offset options along with a built in equalizer for the audio and several modes to choose from.I also have an hd cable package and the quality of channels varies with some looking outstanding in their clarity and others only being ok. I know much of this is due to what the program was filmed on but I thought I'd mention it for any new comers who may think that hd programming automatically means eye popping excellence across all channels.For the price, this HDTV is unbeatable with all the features it includes, some of which are absent from tv's costing double or triple the price!Great job, Vizio!", "Date": "March 20, 2013"}, {"Title": "The best television market", "Author": "freddy manuel garcia", "ReviewID": "R3HWIZNJRVVH76", "Overall": "5.0", "Content": "Very Surprising TelevisionThe 3D works great, and more when you're face to face directly to the TV.The picture quality is incomparable, very hard,The cable connectivity to your friendsI am very happy with my TV, at first when I was looking for information on the forums, I read many bad things, now the rule.Uufff sound very hard, so much so that you can listen to music like a computer radio.I just do not like one thingThe remote control that comes from this TV is the version sensilla, to use the keyboard you'll have to buy the additional control but that's not a problem, since it only costs 9 to 20 dollars, :) to enjoy the most of your TVgood in this case I was happy with my TVVIZIO the bestand best price", "Date": "March 15, 2013"}, {"Title": "finally go one that wasn't broken", "Author": "alllie", "ReviewID": "R1S7IRZAS2X3L3", "Overall": "5.0", "Content": "The first one of these I got was so broken the screen did nothing but flicker. Amazon was nice about it and sent me a second. And it was broken too. Cracked screen on the upper right and a line down the middle. I posted a customer image. But even with the cracks it worked. I watched a bunch of movies and TV shows from amazon and loved the images, except for the cracks and the line. I figured out how to watch documentaries on youtube and could even read the subtitles easily. This is my first big screen and I loved it. Amazon is sending me a third one. And if it works, I will change it to 5 stars. But even cracked it was definitely a 3 star.Wish me luck.", "Date": "October 4, 2013"}, {"Title": "I've only had tv for a couple of months and it is already shutting off on its own", "Author": "rahman howard", "ReviewID": "R2J55LQIUOQ8B0", "Overall": "2.0", "Content": "It seemed like a good idea.  Picture is good but now it shuts off all the time.  I've never had a television do that", "Date": "June 20, 2013"}, {"Title": "Nice TV, still setting it up.", "Author": "RawNerd", "ReviewID": "R1DWCUNWU9Z7HT", "Overall": "5.0", "Content": "Agree with other reviewers.  I left at 5 stars for now, although some annoying things for me (going from CRT television) was that the cables are all different, but this is not really Vizio's fault. Still, why couldn't they add one s-video port?  This was the standard for so many years.Also, it was not obvious to me that to get the keyboard onscreen one has to click \"OK\" in a text box.  There should be a shortcut for the onscreen keyboard on the remote or something, and this should at least be a FAQ.", "Date": "February 2, 2013"}, {"Title": "Great little TV", "Author": "Edward Winfrey \"EnemyMine\"", "ReviewID": "R26GYEQQXIPSO2", "Overall": "5.0", "Content": "Was a solid Panasonic Television fan, and have been looking at getting another Panasonic Plasma TV to replace my old one (6years old, but nothing really wrong with it), but first I needed to replace my bedroom TV.  I was looking at a Panasonic Plasma, but after doing some research, reading several reviews about the VIZIO, and the VIZIO 3D Smart television was only $70 more I opted to buy it.  So far the picture is great, and the convenience of watching 3D movies with the regular glasses is unbeatable.  Went to Sam's club the other day and they happened to have a Panasonic LED TV on Display next to a VIZIO LED TV of exact same size - the picture quality was pretty much exactly the same between the two, the price of the VIZIO was $300 less.  So I am heavily considering buying a new VIZIO instead of a Panasonic, I will have to make my final comparison after all the new models come out.", "Date": "March 23, 2013"}, {"Title": "Couldn't be happier", "Author": "Sharon M Henderson", "ReviewID": "R1MU82BTWQVGG", "Overall": "5.0", "Content": "I love cool stuff and this 3d tv is fun for the whole family.  Nice size beautiful picture and not bad at all for the price.", "Date": "February 22, 2013"}, {"Title": "thanks bill", "Author": "williambarnhardt", "ReviewID": "R2BUD6RBNDMHB5", "Overall": "4.0", "Content": "tv is great.  lovit.  the remote ?????  what the hell were they thinking!  worst ever.  need little tiny monkey hands to use it.", "Date": "November 1, 2013"}, {"Title": "missing in action", "Author": "Asaint", "ReviewID": "R2W9K4NTB6ETFD", "Overall": "2.0", "Content": "Item arrived with missing parts(screws, stand ,manual and batteries) called amazon they did try to help but could not.Vizio was worthless in helping ..Can't use tv till my wall stand arrives now since I have no stand to use.", "Date": "September 4, 2013"}, {"Title": "Overall good value for money", "Author": "Rudolf Bartle", "ReviewID": "R2F62LFVIZFPW9", "Overall": "4.0", "Content": "Only thing I don't like is that you don't got much appsSo instead of Hulu they only got Hulu plus and the remot control could be betterBut picture is really goodOverall good value for money", "Date": "June 25, 2013"}, {"Title": "Product Incomplete", "Author": "James D.Sessions", "ReviewID": "R13K6IJI8GNTI8", "Overall": "2.0", "Content": "No two 3D Glasses, the voices do not sync with the picture I am so mad. My e-mail: James Sessions sessmo@hotmail.com", "Date": "June 13, 2013"}, {"Title": "3D TV, Do not purchase from Amazon", "Author": "Pooja", "ReviewID": "R236QH94A33MV3", "Overall": "4.0", "Content": "Had quite a bad experience with this order. Received a TV whose 3D was not working. Went in Loop with VIZIO customer care and optimum. Eventually found out that the motherboard of the TV is faulty.Raised a request to replace the TV. Amazon replaced the TV within 3 days. Was quite happy with the service provided by Amazon in replacing the TV however the new TV which I received have also started giving problems now.Would not recommend purchasing from Amazon. They keep faulty products.", "Date": "May 15, 2013"}, {"Title": "cool tv", "Author": "russell adkins", "ReviewID": "R3J2VEXY9127UR", "Overall": "5.0", "Content": "I love this tv I looked a month at different stores then I seen this one I fell in love instantly", "Date": "February 7, 2013"}, {"Title": "Only worked for one hour now it will not turn on", "Author": "Gap country adventures", "ReviewID": "R3RLLW4FCMRRT0", "Overall": "1.0", "Content": "I am very upset I tried holding the power button for 30seconds  like people said in forums, but that did not work either.  Also, the box was opened and taped back up when arrived. Box also torn and taped. Wtf amazon?", "Date": "August 29, 2013"}, {"Title": "Sound isn't great as the old TV, takes forever to start", "Author": "Urlville", "ReviewID": "R1WJWKJALYXG5T", "Overall": "3.0", "Content": "The sound really isn't very good. It's mounted in a corner but the sound is significantly worse than the old TV.", "Date": "May 24, 2013"}, {"Title": "Just an OK TV", "Author": "bishoparc", "ReviewID": "R14SXYDEB178EN", "Overall": "3.0", "Content": "I needed to replace the TV in our bedroom as I was moving that TV to my new office space.  I didn't want to spend a lot of money so I went with this Vizio 42\".  Needless to say, you get what you pay for.  This Vizio is no where near as sharp as either my 3 year old Samsung LED/LCD TV or my 7 year old Sony LCD TV.  I've seen several posts with recommended picture settings in the reviews here but those didn't really make that much of a difference so I just went back to default (other than turning off the automatic dimming features as they totally suck on this TV.)  It's good enough for me to deal with in the bedroom because we don't watch TV in there a whole lot but overall I would say if you can afford it, buy a Samsung or a Sony and avoid Vizio.  The passive 3D glasses do work well though and I do like the fact that you don't have the flickering active 3D glasses like my Samsung (but I don't watch a whole lot of 3D so not a huge deal.)Overall, it's just an OK TV for the money.  I've contemplated sending it back and getting a 40\" Samsung but I'll probably just deal with this one.**Update**As others have said I now have to agree as well that the TV takes way too long to turn on.  It's usually 10-15 seconds before you get an actual image on your TV.  It's not a huge deal but it is annoying.", "Date": "July 16, 2013"}, {"Title": "Not sure about everything yet !!!", "Author": "obie wan", "ReviewID": "R1I5TIP4159TCX", "Overall": "3.0", "Content": "Honestly,I'm not sure how to rank this tv because my input options are limited. Currently I only have cable,no DVD player, and while the cable high def (1080i) stations work well, the on demand feature on cable that's supposed to offer not only high def, but 3d movies as well don't work on this tv at all. I will say that the internet sites I've tried work ok,though I've only tried Amazon,Face Book and a couple movie sites,(not a member of Netflix). On these sites I can watch high def movie previews,so maybe my cable provider (comcast) or the cable box I'm using just ain't cutting the mustard. Until I get a 3d/blueray dvd player I won't know for sure whether the tv actually shows 3d so I'll reserve judgement. Besides that the usb feature works well with music and photo flash drives that I've tried !!!", "Date": "November 20, 2013"}, {"Title": "Problems started 42\" Vizio", "Author": "Martin T Condon", "ReviewID": "R2AY0E2GIO01ZD", "Overall": "2.0", "Content": "Received this \"Like New\" (Saved a few $) TV from Amazon and had some issues with it initially .  Amazon handled my complaints to my complete satisfaction.  About 2 weeks ago I started to have intermittent problems with the TV.  The TV was received in May 2013 and 2 weeks ago(end of August) it started to occasionally blink.  Blink lasted about 1 second and happened about every 2 seconds. Extremely annoying and impossible to watch.  It would stay like this until I changed channels.  Sometimes it requited changing 10 to 12 channels before it went  back to normal.  Happy with the product until this issue.  Not sure on how to proceed.  It appears that since I purchased a \"Like New\" product I may not be able to resolve this issue (guarantee times) on \"Like New\" items.  Hope these issues can be resolved.  My advise is too be cautious about buying refurbished, like new, or used.I live in a condo complex and no one in the is having this some problem, so it's not my cable signal. Other than this blinking problem I'm happy with this product.", "Date": "September 13, 2013"}, {"Title": "This tv works well", "Author": "shindre", "ReviewID": "REEYIF4VTZ5J4", "Overall": "3.0", "Content": "updated2DSo the TV is a mix bag, the picture quality can be very good with some tweaking. colors are very good etc. AS a HD 2D TV is great.3DNow the problem i had with the screen going green has fixed its self somehow.... but now, it goes half green and half purple. However its only when this happens to only to HD content, when maximized on the TV you get the option to enable 3D(otherwise 3D its grayed out). So it works, but not like you would want it to. you have to always enable it which is annoying. There should have been a 3d button on the remote at less to enable 3d. Unless your using a player on your PC like the Nvidia 3d player.So is the 3d Great? well its OK not the best i have seen you have to sit the correct distance away from it to look good with no ghosting or crosstalk. well for most content i have tried. I do not have this problem at the theater when watch 3D movies.PC GamingGaming in 3D. Some how it hurt my head. I get a headache at times. Playing Crysis 3 and some other 3D person games and there is about 10 percent ghosting it almost like a burring effect. HATE IT!! However playing game like Street fighter X Tekken its fine no headaches whatsoever.Oh and Nvidia 3dTV does not support this TV so you have to do a small hack for it to work. Basically your override the TV driver with any passive 3d TV or monitor which Nvidia 3DTV supports for it to work. You can find the details onlinePlayStation 3it works well with the PS3 have not tested the 3d though.(No 3d Games to test it with)AppsApps works well but are not that fast. i say not that fast as my bro bought the Vision razer LED TV more expensive and the apps were Slow.ConclusionSo i will have changed my rating from a 3 to a 4 because its a great TV for the cost. however you have to spend allot of time figuring it out to make it work well. Good thing you can save configuration.old reviewI have had this TV for a couple of hours i am not yet impress with the Picture quality. I have read you have to modify the setting to get a good result, which I have done although the picture is good it does not look nearly as good as my two led 26inch PC monitors. that said it is OK.However I did not buy this TV for the big screen or 2D but for the 3D. The TV plays 3D from the Youtube app fine. However when you try to run a HD video or convert a Side By Side (SBS) 3D digital movie. Well the hold screen turns green. Well this sucks its the only reason i got this. And this feature does not work I do not know if there is a fix or firmware update as i have been searching the internet for a solution with no success.", "Date": "April 11, 2013"}, {"Title": "YOU MAY THINK YOU HAVE A GREAT TV, CHECK OUT MY REVIEW!", "Author": "Eddie", "ReviewID": "R3V2VG9UTCOLC1", "Overall": "1.0", "Content": "I bought two of these TV's earlier this year.  I thought they were great as the picture looked good and everything.  Then I purchased three more units (I'm working on a special project that uses multiple TV's).  I set the new ones up and holy crap two of the TV's have super nice bright colors, and the third one has the colors of the original two that I bought earlier this year.I was puzzled and to see if the two super nice ones were just a fluke, I placed an old Insignia led TV next to all of them.  Set up a Samsung dvd player and you can tell right away that the cheaper Insignia had the same brightness as the two Vizios.  I am convinced the three other Vizios are defective.  The problem is unless you have the good Vizio next to yours comparing the quality, you will never know that you have a good one or a bad one.  For all the good reviews here, I bet many of those have the lesser quality.  And I played around with the picture settings but no use.  From the factory setting you can tell right away.The Samsung dvd player comes up on the screen with menu options when it is turned on.  You can tell day and night the difference in brightness.  The grey area on the lesser quality comes out like a grey color while the better ones show it as more of a blue color.  I am extremely frustrated with Vizio.  Do not buy this TV as you will never know which one you will get.  I will contact Vizio and let them know they have a crappy product!", "Date": "October 16, 2013"}, {"Title": "WOW thanks Amazon for not putting this in secure packaging I appreciate it.", "Author": "Judy ward", "ReviewID": "R3UQ6WWYS8OQN2", "Overall": "1.0", "Content": "I usually don't write reviews but this should be known. I have ordered a ton of stuff from Amazon but I have always been skeptical about ordering electronics. Well thanks for proving me right. The good thing is that I received this TV in all of 2 business days and I didn't pay extra for expedited shipping so I was really excited when I got home to see my TV yesterday. I inspect every package to see if it has been tampered with, I'm just that kind of person, and I saw a hole in the box. So I crossed my fingers and prayed that it was not on the screen side of the box and to my surprise it was.Long story short the LED lights were cracked I plugged it in and the spider web happily lit up on the screen. Maybe it's a sign since I hate spiders. So you all can guess how upset I was after I rushed home from work to play with my new toy only to be dissappointed in the end.I have ordered electronics from Best Buy and never have they shipped anything, especially a TV, in it's original packaging. They have always put the TV box inside another box with those air balloon thingys to make sure that it is secure. Shame on Amazon!!!On another note I'm returning the broken TV for a refund and possibly getting something thinner than this thing. Yes it's LED and a \"Smart TV\" and 3D but the crap is thick and doens't look sleek at all. It looks like an old plasma from 2005. Matter of fact my old Vizio plasma was thinner than this thing. It's not heavy just bulky to me and my friend even said it's as thick as his 5 year old Sony Bravia. I guess you get what you pay for.My review is based solely on how the package was shipped and the style of the tv. It never worked to begin with so I do not know what the picture looks like or if operating it was easy and user friendly. Amazon's customer service was great they sent me a return label via email. I went to the nearest UPS store, about 5 mins from my job, the same day and had it shipped back. I had my refund within 3 business days.", "Date": "April 2, 2013"}, {"Title": "color is good but blurry", "Author": "innerphreak", "ReviewID": "R10WVTXG9YTXW2", "Overall": "3.0", "Content": "i guess for a 3d smart tv its ok since i got it under 600 but for all the hoopla i heard about how wonderful it was i am very  disappointed.", "Date": "December 23, 2013"}, {"Title": "What isn't reviewed as much... and it's not good", "Author": "lis", "ReviewID": "R3DMUFIY4FYYLT", "Overall": "1.0", "Content": "The TV picture is incredible, like many reviewers are saying. Since positive reviews re the picture quality are abundant, I will review other aspects of this TV that are quite a letdown.1. The remote is not user friendly. It is very small and the buttons are tiny, like on a crackberry.2. The Amazon Instant Video app is horrible, absolutely horrible. I bought this television specifically for the Amazon compatibility, so to have such a horrific app is a major letdown. I wish that I would have read a review about it.3. There is no access, NO access, to your Amazon Prime Watchlist through the app on the television. So, you have to go to the search box every time you want to find a show you are interested in.4. Using the search function requires scrolling through the letters of the alphabet and clicking enter-- a lot of scrolling and clicking with the already sucky small remote buttons. Once you get to a TV series that you want to watch, you have to click/scroll through an annoying menu. Additionally, visually the Amazon app is quite dissatisfying and unappealing. There is no pleasant aspect to using the Vizio Amazon app.5. If you love Yahoo and you have Yahoo accounts, this Vizio TV will be great for you. There are many Yahoo apps. I am not a Yahoo fan and I do not have Yahoo accounts. And I do not wish to create a Yahoo account for the crappy apps on this TV.6. Limited offering of apps. I was very disappointed to find how few apps are offered on this TV. I was expecting access to all of the great apps that are found on Roku. A previous roommate had Roku and I loved having TED on the TV. For me, it is a disappointment that Ted is not included. Also, no Pandora. There's some music app called Rhapsody-- I'm sure many people like this app, but I feel that I should have a few choices on which music app to use. There's an entire tiny remote tiny button dedicated to an app called M-GO, but the app is not up and running; there's a message that it is coming soon.The above 6 points would have led me to investigate a different brand of television. If the above 6 points are not a problem, this is an AWESOME television. It was easy to get started and hook up to wifi-- I had the TV functional within minutes of removing it from the box. And, the picture really is incredible, especially considering the comparative pricing. I actually think the picture is superior to the last roommate's LG television that was double the price.", "Date": "May 12, 2013"}, {"Title": "wont work", "Author": "Noah Rinartz", "ReviewID": "RWYQXFT4GHXI9", "Overall": "1.0", "Content": "got it to work after about a half hour after setup. watched it for the rest of the night and then turned it off. tried to turn it back on in the morning and nothing happened. i had it for less than 1 day. thanks amazon", "Date": "July 20, 2013"}, {"Title": "So-so tv", "Author": "Cadillac1970", "ReviewID": "R3OU6LRSMVAC6K", "Overall": "3.0", "Content": "Very disappointed in the screen quality,very dark screen. I regret purchasing this TV. I'm sure you can do better purchasing another brand I would.", "Date": "August 31, 2013"}, {"Title": "What a bad luck", "Author": "Gabo", "ReviewID": "R3O3TR0BHY8G7T", "Overall": "5.0", "Content": "I was just about to buy today at 519.99$, put it in my cart and I realized it's 529.99$ NOW. What a bad luck!! :-(", "Date": "February 27, 2013"}, {"Title": "something missing", "Author": "viki", "ReviewID": "R3CAWLT1A1IEWI", "Overall": "4.0", "Content": "sell videocamera with tv not only tv.i don't like tv without camera how I use Skype without cam aa aa", "Date": "July 3, 2013"}, {"Title": "Shipped me a piece of garbage", "Author": "MJ Jones", "ReviewID": "R2FR8PMP88UPA0", "Overall": "1.0", "Content": "should have known I was rolling the dice to order this from Amazon as others had also received damaged goods that had to be sent back but I thought the odds were in my favor, I was wrong. Got home to find the TV waiting at my door. Unpacked it and immediately saw the screen had a huge oil slick looking stain on it. OK, I thought it might just be from laying flat and that it would go away when I put it together. Plugged it in and the screen was all messed up, looked like a broken mirror. I wasted about two hours of my life unpacking, setting up, going on line to ship back, repacking this piece of garbage Amazon shipped me. Why can't they inspect these things before they ship them, it would take two minutes to see that this was defective. Instead they ship it to you and let you have all the hassel and frustration, completely ruined my night as my wife and I got in a big argument over this. Thanks Amazon,you burned me once but never again, going to a brick and mortar store to buy a TV tomorrow.", "Date": "April 3, 2013"}, {"Title": "Bulky and pic clarity/color not bueno", "Author": "Michael J. Troutner", "ReviewID": "R2RX35BPCJ1CLJ", "Overall": "2.0", "Content": "I got this TV after trying the Samsung Smart TV 42\" I think (sent it back.)  Title says it all about this Vizio.  So, think about getting the model I just found at Sam's (maybe you can convince Amazon to carry?)  Sanyo FVM 4012 (40\", 1080p, LED.) Amazon has the 39\" 1080p 60Hz HDTV | FVM3982 - but it's LCD not LED.Anywho, for $400 it is the best I've seen.  If you don't care about all the 'Smart' stuff TV's, get this one.  Pic clarity is great as is the look of the TV overall.  Sound is reasonable.  Great value.  Only thing about this Vizio I liked is that it was not very laggy when I played COD/B-Ops on my PS3...", "Date": "March 6, 2013"}, {"Title": "junk", "Author": "amanda hunt", "ReviewID": "R2KV5QQMJSDGWS", "Overall": "1.0", "Content": "i wouldnt buy this tv i had it two month wifi does stay connected nor does it turns off all the time i cleaned the screen turned tv on and the screen had a huge grey line in it and a spider like crack in it and no pressure was aplied to it right at bottom of screen funny theres not even a mark on this tv too called vizio they wanted to do nothing but sell me a $700 screen replacement i payed $529 for it vizio tvs are just junk dont buy this and amazon wont do anything to help", "Date": "April 22, 2013"}, {"Title": "Not Blaming Amazon ,Direct TV, and/or VIZIO >>>> YET.", "Author": "ken hodges", "ReviewID": "R2PPZJY7R7PSBI", "Overall": "1.0", "Content": "I have spent Hours on the phone (and several phone cards) talking First to Direct TV,Then to the Nice people at VIZIO SUPPORT .My DirectTV Remote  CANNOT Retrieve MUTE, Volume Control, AND WILL/Can NOT Turn ON My New Amazon Vizio E420-ao .Both VIZIO And DIRECT TV say \"Direct TV and THIS PARTICULAR VIZIO TV MODEL MUST BE INCOMPATIBLE./IRONICALLY , I just got on to theWeb to Ask For A Return Of This TV.AMAZON , DIRECT TV ,AND VIZIO ARE Better Than This , and I know it .Thanks, Ken HodgesPS: \"I guess you will just have to use TWO -Both REMOTES . LOL !@#$%^&*(_+", "Date": "April 22, 2013"}, {"Title": "Broken screen", "Author": "Jorge Hernandez", "ReviewID": "R2O3FHPGEV1XPI", "Overall": "1.0", "Content": "If you want to waste 500 buks on a broken screen, here you have this tv, i just barely got mine and was all excited about it untill i opened it, the screen is all broken, the ENTIRE screen, so i conected it to see if it would work srill (obviously not) and it didmt at all, i want my money back or send me another tv that it isnt broken!!!! Those are 500 im not gonna let go, so i want my money back!! Or another tv that actually works!!!", "Date": "August 9, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "VIZIO Internet Apps -  Instantly enjoy online movies, TV shows, music, apps and more\nTheater 3D - Cinema-quality, brighter, flicker-free 3D\nRazor LED with Smart Dimming for richer colors and more vivid details in an ultra thin design\nSlim frame design looks great on a wall or table stand\nIncludes 2 pairs of comfortable, battery free, Theater 3D glasses", "Name": "VIZIO E E551d-A0 55-Inch 1080P 120Hz 3D Smart LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51MbG3UVFML._SY300_.jpg", "ProductID": "B00BF9MY3Q"}}