{"Reviews": [{"Title": "Incredible picture! With only 1 passable flaw.", "Author": "Aiden", "ReviewID": "R3DJE31B03MHOF", "Overall": "5.0", "Content": "I'll keep this review simple. The TV is incredible with great picture and 16x9 movies with black bars standout ,making the black bars not noticeable. I came from a samsung 2 year old 50 inch to this 60. Its very noticeable the picture increase. The frame on the newer models (2013-F5500) is thinner, with more screen real estate vs more of a noticeable frame.Blacks are great! and Pure! Colors pop out even with reflections from light sources.Ill add some of the features which I had to dig for because the Samsung rep was not aware or hidden in the online manual. Im more of a feature person, started to notice Samsung online limited the technical information regarding their televisions.PRO:NO remote lag, quick menu transitioning.Built in Wireless N 2.4ghz and 5ghz.Streams 5.1 from Netflix, Amazon video, hulu plus etcClear speakers-I set mine to clear voice.Colors stand out even with ambient light cancelling out any reflections.Great TV from any angle.DARK Blacks , vibrant WHITES, and Greys blend in with black well, it also enhances the color and images because the TV has great black reproduction.(typical plasma)HDMI 1.4 (no internet pass threw) Samsung rep had no idea just said \"the newest standard\"  and wasn't listed in there online booklet.After some digging and verified at home, it is HDMI 1.4 just no internet pass threw.MHL connection from the side. (Mobile High def link) ie Roku stream sticks, Chrome Cast from google, and mobile devices. (it powers the item) Samsung site kept this information hidden. I had to dig for it. Future ready.NO HEAT. My 2 year old Samsung Plasma gave off a ton of heat. This one barely anything.Built in Wifi direct for Samsung products Galaxy Line and tablets or get a 3rd party app from Android play store . File transfer big files almost instantly.You phone/Tablet needs Wifi direct.Vibrant picture, deep blacks, and non-16x9 movies stand out to the point you no longer notice the black bars. 3D is okay, but I've only messed with a few games having it built in like Uncharted 3, Wipeout HD and its noticeable gaming layer. Have not tried a film with it.3D glass's use a battery watch , which last 150 hours, easy to replace. The batteries cost about $2. Replacement glasses are $17 comes with 2.Remote is easy to use, has a skip the main screen ability instead of going application to application. One quick swipe on a stand out bar in the track pad jumps to the next screen by passing the constant swiping.ie  pictures, movies, applications etc instead of going one by one on the screen.  Voice guidance you need to talk into the remote , not just into the TV. (my mistake lol). Has a setting to have all applications, including firmware auto download.Remote is bluetooth , so the signal is better than any television ive own that had , so far no dead spots.Very accurate even when sitting down.Thin frame, you notice the big picture screen real estate instantly coming from a 50 inch. Which had wider frames making the TV larger than what it actually was. On this TV is more of a pure picture experience.60 pounds without a stand and 66 with floor stand.As listed, Amazon video built in, Hulu PLUS, Netflix etcCONS:The screen reflects, so it takes a little getting use to. I adjusted after a few hours of watching the TV off in the living room. (The TV caught my attention since its in the same room as my PC) The trade off of such a good picture is 100% worth it and when its on, reflection go away since you have an image vs pure black screen. The reflection only kicks in when the television is off. Typical of a plasma set, but once you go plasma, its hard going to LCD/LED which have issues reproducing blacks and greys.Instruction for the 3D glass is clumsy. When the glasses are on, the screen LCD in the glasses turn on making them darker. (visual cue its on). When the TV set is on (the 3D) glasses auto turn off after they are synced to the set. To make sure its completely off. leave the TV 3D effect on and manually shut the glasses on while the 3D effect is on the screen. They give no indication its on or  off. No blinking light etc. By having a 3D image on the TV (3D mode) it gives you the chance to shut the glasses because the 3D effect will not work and the LCD lens on it lightens up. Even when glasses are off, the TV pops an image on the screen saying synced. Which can give an idea its on, instead of off. Its better to rely on the glasses to no longer giving you 3D as a cue its 100% powered off.No Wireless AC (new standard) Hopefully they will release an add on like a stick to be able to use the new speeds. Wireless N in 5ghz and 2.4 is excellent still . (id rather have all , plus wireless AC) This is newer tech , so its expected.---------------------------------------------------Those were my only annoyances with the sets.. which is really nothing compared to the befits the set gives you.3D is good, blacks are dark and has multiple adjustments to make them darker.I will not be using the TV for 3D but rarely. Mostly gaming, movies, Hulu plus etc. Gaming was excellent (typical plasma set with high refresh rate). Skype ready (you just need their $100 skype 720p camera add on.). You also need the camera for motion so it can track your hand movements. By default its on, but does not work because you need the Skype Camera.Streaming was solid. I ran mine in 5ghz wireless N. No stutter on 720p streams from Hulu Plus. I have not tried full HD 1080p streams. 5ghz Wireless N needs to be close to the unit. Not to far off because the signal is smaller. Typical, and not a Samsung defect.. all wireless 5ghz signals are limited to a smaller foot print..I am loving the TV. the duel core makes switching between apps, screens and transition smoother and the strong signal allows youtube, streaming content to work instantly and on button press.", "Date": "June 22, 2013"}, {"Title": "Great TV with a few small annoyances.", "Author": "A. Webster", "ReviewID": "RW2E0QTE9AAY4", "Overall": "5.0", "Content": "I bought this to replace my pn58c500.  So my impressions are based off of the differences of these 2 models.  I also have a 46\" Samsung LCD in my bedroom to compare with.First impressions are WOW what a difference in picture quality.  I thought my pn58c500 had a good picture but this is way more cleaner and clearer overall.  Watched some of a Monster vs. Alien show on Netflix and it looked amazing.  Everything is clear and vibrant.  The sound seems fine to me.  I have it mounted on the wall at an angle, so maybe the speakers sound better that way.  The sound is robust, clear, and has decent surround depth to its output.  Now would it sound as good as the surround sound turned on and up, NO.  But I watch mostly at late night when everyone is sleeping and only use the surround sound on weekends.Now some of the annoyances are#1 - the remote is not very good, it only has a handful of buttons and most of the ones you need and want to use are buried in sub menus that you must use the touch pad to access.  Which is hit or miss on selecting the correct item(will probably take more time to figure out the sensitivity).  This is not for someone who has never used a smartphone or rarely uses a computer or mouse.  They would probably chuck the remote through the TV within 5 min of use.#2 - There isn't a power off button on the front of the display bezel(at least that I can find).  The buttons are on the back of the display.  My kids have learned to turn on the TV with the front buttons and then just turn on the xbox.  Helps with keeping track of the remote.  Especially now that it is so small and easy to misplace.Now some more points:- 2d-3d conversion seems pretty good.  I have been watching some regular netflix shows and playing some games(Battlefield 3 and Halo 4) and they all look decent in 3d.  Reminds me of the 3DS 3D output.- 3D seems good I can't really compare as this is my first home experience with 3D, I do seem to think it is something I won't use on a regular basis.- Input lag isn't a problem, I was going to get the Panasonic ST60 but saw that it was having input lag issues, so got this instead since I game alot on my TV.  No problems so far in COD:BO2, BF3, or Halo 4.- Wireless is built in, I have hooked it to my Wireless N network with no problems and have also used a wired connection.  No noticeable difference between the two.- I have no problem with it turning onto HDMI 1 when powering on, unlike previous reviews mine never starts in smart hub.- Reflection is no more than my previous TV and I have a large window directly to the right of the TV.- Motion and movement scenes are very clear and smooth- The smart hub when I first setup the TV wouldn't do anything, I had it wired into my router.  I could see all the apps names but no pictures for the apps and nothing would work.  I though something was wrong but it was just downloading everything, wish it would have given a notice so I didn't waste 15min trying to get netflix to open.- The xbox360 netflix app is alot better than the smart tv app, but if it is all that you have it will be ok.  One weird thing I have noticed is it seems that each app has its own settings and some can't be adjusted and some can't do 2d-3d conversion.Overall very pleased with my purchase, picture is great, sound is great.  I just wish the remote had more buttons for quick actions for example: a button to change picture size, picture mode, quick 3d menu, and they need to make remotes that have programmable buttons without buying another remote.Extended Impressions......July 14th 2013After some more time I figured I would add some more info.  The remote is absolutely terrible, from the awkward button placement to the size and shape.  I don't know how many times I have turned the power off when trying to adjust the volume.  I have very large hands so that may have something to do with it.  Also this remote gets lost on a daily basis and can seem to slip and slide down into the deepest abyss of your couch.  The sound now seems messed up almost like the speakers are blown because with any bass sound it comes out distorted and blown sounding.  Not sure if they are blown or not but need to call and have it looked at.  The screen seems to ghost almost immediately upon powering on, it goes away once the screen changes but just seems weird to ghost even after a couple of seconds of an image up on the screen.  I have not had problems with burn-in or IR.  I have taught the kids to use the Scrolling bars after every use of them playing Xbox.  Unlike my earlier review the TV now DOES start in smart hub every single time it powers on, very annoying and can't find any way to switch it directly to the input upon powering up.  I still find it annoying that each app has different picture settings and you can't adjust all the settings  for the apps pictures.I have gotten my phone to sync up and miracast or screenshare my LG Optimus G screen to my plasma.  My phone is rooted and this only works on 4.2.2 roms.  Screen and picture are still looking great and I don't notice the pentile display that some have mentioned unless I am standing right next to the screen, I almost think it makes the picture clearer when you are viewing at normal distance 10-15ft.  I also never use the 3D mode so can't really add any valued comments for that.  Overall still a great TV for the price, I am going to try one of the remote apps for my phone and see how that works.  For now I grabbed my old plasma remote and am using it since it has all the buttons on the remote that I want to use.", "Date": "May 1, 2013"}, {"Title": "Overall, very satisfied", "Author": "Richard L. Wasserman", "ReviewID": "R2D2KRU5R6C01K", "Overall": "5.0", "Content": "Updated 4/19For the price I paid, it's a steal.Day 1.The good - 1. Setup was super easy. - 2. The default settings on the TV had a very good picture. - 3. Black performance & 3D was very good. - 4. Speakers were tinny, but way better than decent - a big surprise.A few annoyances - 1. THE BASE IS NOT CHROME OR ALUMINUM. IT IS GRAPHITE PAINTED PLASTIC!  IT LOOKS CHEAP.  THE TV IS BLACK AND BASE IS GRAPHITE. NOT A FAN. - 2. as a small beep when you raised or lower the volume. - 3. I couldn't get the TV to burn in as it would shut off every few hours without activity. I thought I changed all that in the settings but it didn't work. Could be user error. - 4. When you turned on the TV, it would go directly into SmartHub. I am not going to use SmartHub much and would rather use my standard DirecTV remote. I cannot find a way to \"default\" it into HDMI1. An updated DTV remote code can fix this but you will have to flip the DirecTV Remote switch to TV, press Select, then move the DirecTV switch back to the box. Pretty annoying. If you buy a Harmony, you can program the remote to fix this. - 5. The remote is kind of weird. It was this multitouch old school laptop trackpad thing. I'm no sure if I like it yet.For ordering - I recommend 270 degree HDMI port savers.After a few days. - 1. I added a Samsung HW-E450C sound bar. It worked immediately with the TV.  Wireless connectivity (SoundShare) worked great. No discernible difference from optical to wireless.  It takes about 20 seconds for the wireless to kick in. - 2. After break in, the blacks were pretty impressive. Watched Van Helsing on blu-ray to test blacks and was very happy with the level of detail. - 3. I have witnessed only 1 distorted image in several viewing days. It lasted for only a split second. - 4. I am not a fan of the smart remote for changing channels. When using SmartHub, it's good. - 5. Like all plasmas, the screen is super reflective. Even in a mildly lit room, you will see the light source. With the brightness turns up, the TV does power thru it.", "Date": "April 12, 2013"}, {"Title": "Plasma still carries the torch for picture quality.", "Author": "Dirk Allen", "ReviewID": "R2KE55JQ29CRFR", "Overall": "4.0", "Content": "This is an initial review of the 64\" model.  Possible updates to follow.  First, ordered from Amazon, delivery was prompt and safe, price was as good as anyone I could find.  Unit is well packed for shipping from Samsung.  I replaced a 50\" Samsung plasma with this set.Here are my first impressions.............PROS:-picture is bright, colors appear accurate, black levels seem good-set is lighter than the smaller set it replaced-build quality seems to be excellent-aesthetics (without the stand) of the tv are very nice-HDMI outputs run parallel with the wall instead of at a right angle to minimize \"stand out\" of cable-no motion blur at all so far-screen \"buzz\" is within acceptable levels to me-the apps section starts fast, and is fairly clean and intuitive-Netflix app looks very good, is stable, and has 5.1 out via the optical connection-I prefer the little control \"nub\" on the back of the bezel....saves the finger prints from the touch sensitive are of my old set-OTA ATSC tuner is on par with others-PiP looks very good-speakers sound ok.....previous reviewers had me dreading thisCONS:-screen is VERY reflective....all plasmas are, but this one more so than my last...NOT an issue 90% of the time-HDMI ports are too far \"inboard\" from the edge of the set....will make temporary connections difficult-A/V (component/composite), and antenna connections are right angle to the wall-the remote takes ALOT to get used to......most people will be glad to have a universal-no way to learn IR from the supplied remote as it is Bluetooth-too much emphasis is placed on the SmartTV functions, just give me a great picture!!-some of the apps are very poor-black levels don't make my jaw drop-no 2nd tuner for PiPMany of the features of this model will have very limited, if any use for me.  I could have picked up the step down model, the 5300 series, but I wanted to stay with the higher quality set.  3D, HDMI ARC, the \"OnTV\" functionality, PiP, wireless, 80% of the apps, the Bluetooth remote, will not get used enough by me really appreciate or give detailed info of.All in all...........I am still a fan of plasma, even with it's shortcomings as the picture quality is the ultimate driver for me.  I do wish that Samsung would have made a set with the PQ of the 8500 series without all the extras.....just give us a stripped down monitor panel with the best picture available......but I realize that I am in the minority here.Any major changes in opinion, operation, or issues will be updated.", "Date": "November 25, 2013"}, {"Title": "A great TV with some minor problems", "Author": "Bob Montgomery", "ReviewID": "R3Q7BR1L86KLGN", "Overall": "3.0", "Content": "If you read the other reviews you will have everything you need to know.  The reflective nature of the set can be a problem and we ended up hanging up some new drapes to darken the room certain times of the day.  Some people hate the remote.  I love the remote.  If you get everything set up, and your TV starts at the \"Smart Hub\" as some have complained, the fix is simple.  Go through the setup menu and you will find a simple option to disable it if you so desire.  Many of the complaints are simply not becoming familiar with the options in the various menus.  After two months, I really am somewhat of an expert when it comes to setting up various options.  All and all, I feel it is a great set BUT.....and to me this is a BIG BUT, when you set up the Smart Features \"On TV Settings\" you may have a problem if you don't live in a large city with one of the big cable providers.  I have spent countless hours with Samsung trying to resolve this problem without any satisfaction at all.  When you go through the setup process, it asks you to select a service provider.  It asks you to enter your zip code to find the right provider.  After doing so, the setup gives you a list of the providers in your zip code area.  For me, it lists four and one is my provider (zip code 824114 TCT West Basin/Greybull IPTV ) .... when I select my provider it asks me to \"press the channel up or down buttons on your remote\" and asks \"did your set-top box change channel?)  This is repeated three times, each time the answer is \"no\" and finally it asks me to \"Search model Number\" which I do. This does not bring up anything to select and it then says in part ....\"if it's not on the list now, it will be available soon.  Please quit and set up later.\"  Two months later nothing has been fixed.  Samsungblames it on my (can you believe this) service provider.  Of course, my service provider is unable to resolve thiseven though they spent countless hours talking to Samsung on the phone.  The problem is NO ONE who knowshow to fix this problem at Samsung is available.  You can call corporate, you can call level two support, and allthey can do is read out of the instruction manual.  It pains me to say this, but at this point I know much moreabout the setup than Samsung support. One Samsung rep told me my STB  was not compatible with their\"universal\" remote but I proved him wrong.  Another option after you enter your zip code and the list of providerscomes up is \"My provider's not here.\"  If I select it the following message comes up....\"On TV window of SmartHub will not be displayed, since your service provider is not supported.\"  Remember, by service provider IS listedas supported.  Anyway, if I continue with the \"my service provider is not here\" I can enter my service provider as \"Entone\" (the name of my STB) and now the remote works with my STB 100%.  BUT the \"On TV\" window of theSmart Hub will not function.  If you don't mind paying for the Smart Functions, then you will have no problemswith this television.  If they work fine, if they don't fine.  But if you want all the features that you paid for you maynot get them.  And Samsung support is poor at best.  Three times I was told someone would call me back withintwo business days but it never happened. There is no way I can find to check and see if your cable provider willwork with the remote etc. before you buy this.  And no logic when dealing with Samsung..  Buyer beware.UPDATE 12-19-13. Nothing new from Samsung. My Cable provider sent their two top IT people to my house a week ago and so far they have no clue. The NetFlix app no longer works. I will keep this link up to date.1/21/14 Update:  I am lowering the rating because of the following:I too must downgrade this set.  The picture is great, until you facture in the reflective qualities of the screen.  I moved into a new home and the TV is facing away from the window, yet I still get reflections of lamps etc.  In short, unless you have a completely dark room you will notice reflections.  Sometimes it is quite bad.  Other times it is not that noticeable.  Another gripe.  Samsung ignores my pleas to fix the remote to work with my stb.  Some of the support knows less about this TV than I do.  I get remarks such as \"your sbt is not compatible with our remote.  Even though I have proved it is not true, and even though  they have my isp listed as supported,  they have not been of any help whatever getting my problem resolved.  I own a Galaxy 3 Tab 3 10.1, and it's software doesn't work properly, I Own a Galaxy S3 phone, and it's software doesn't work properly.  So I guess I expect too much from Samsung.  When this TV dies, I will be moving to another brand.  I will do my homework next time.  Oh, another thing, my isp (cable company) has spent hours trying to work with Samsung.  You would think Samsung would try to work with them, but no.  Nobody listens at Samsung.2/27/14 UPDATE:  I said \"Nobody listens at Samsung\"..... Google this.... \"do Samsung Smart TVs spy on us?\" You may be shocked at the results.  I am disabling most of the \"Smart Functions\" as a result.  Buyer beware.", "Date": "October 6, 2013"}, {"Title": "Great plasma for the price!", "Author": "Jason", "ReviewID": "R1EGOF6NLNJDBV", "Overall": "5.0", "Content": "I ordered my PN51F5500 on Tuesday June 18, and got it delivered by CEVA on Friday June 21. I went with Amazon for their return policy as well as the white glove service. Having to pay CA Tax, it was worth it as the white glove service else where can go upwards to $200.Delivery was top notch. The Samsung TV came inside it's own Samsung box, but delivered by CEVA, it came in another larger one. I'm not sure if this is how televisions are shipped to begin with, but it provided me a good sense comfort knowing that my TV was not damaged during travel. The CEVA delivered my TV on the second floor, and set it up rather quickly. They knew what they were doing, and the television was flawless.Onto the plasma. I'm not a videophile. My other television is a Vizio LCD M420SL which is at least 4-5 years old. I went back and forth between LED and Plasma and made my decision to go with the plasma after everyone's ordeal with light bleed & faulty units. So what can I say about this plasma? I LOVE IT! Picture quality is top notch. In SD, you really can't appreciate it, but in HD, it's a gem! I've watched Netflix non stop on this, and everything is so crisp and clean. Blacks are black, colors are not over saturated, no light bleed, and everything is even.Features:1. The swivel stand is a plus as I can move it around while I am on the computer and still watch TV, and then move it back to face my bed.2. The SMART remote is also great to use. If you are technologically hip, it shouldn't be a problem to use. You can draw channel numbers to switch channels, swiping back and forth is a breeze. Voice control is also simplistic. This should be the new standard.3. The 3D feature is cool, but I really haven't used it. I find 3D not a necessity, but more a plus to have just because it's standard feature. TONS of smart apps, and the dual core processor is quick enough.4. Plenty of Net Apps for you to mess around with (Netflix, HULU, Amazon, NBA TV, MLB, etc.)Gripes:1. Sound comes downward from the television, and isn't forward facing like my LCD. It isn't BAD, but I wouldn't say it's great. Volume just needs to be up a bit depending on what you are watching.2. This is really dependent on the person, but yes, this screen is REFLECTIVE. Understand this before you buy. If you put the television around a lot of light, you'll see it. I personally don't think it's a make or break. I love my purchase.", "Date": "June 23, 2013"}, {"Title": "2nd times a charm.", "Author": "Sevenhellz", "ReviewID": "R2333YF1IQBYEG", "Overall": "3.0", "Content": "Got first one and after about 10 hours of use it died on me. got a blinking red led light but no tv. contacted amazon and they replaced it for free and shipped the old one back for free. its been 3 days sense i got my replacement and all looks good so far.now onto the tv itself.The picture: 10/10Amazing! I do allot of hardcore gaming and watch allot of movies and in game mode there's no noticeable lag and in movie mood movies are awesome!The sound: 4/10The sound is not very good at all but i would not imagine anyone would buy this TV and plan on using stock speakers. I have it hooked up to 2 3 way speaker box's with 15\" woofers so sound from the TV is not an issue as its always off.Now for the reason for only giving it 3/5 stars. THIS TV BUZZES!!! LOTS!!! its very very loud and both of them do it so i'm sure its not a defect. But on the other hand i sit relatively close as its in my bedroom so if its going in a big living room then its not as noticeable.People complain that the stand is made of cheap plastic, who cares? I'm not touching my stand every 5 seconds so it really dose not matter what material they use.The 3D is cool but not my thing so not used.The remote is awesome once you get used to itThe wifi works great and loads Netflix instantly.If i have another problem with the tv ill re do my review so you guys know.", "Date": "January 28, 2014"}, {"Title": "Terrific Samsung plasma TV set!", "Author": "Paul S. Gutierrez", "ReviewID": "R28753DK2WB2KF", "Overall": "5.0", "Content": "I've had this TV set for 2 months now and it has blown me away ............... certainly delivers much more that I expected.The color, sound (I've installed a home theater system), picture, resolution, clarity, and ease of use make this set a complete package.", "Date": "November 13, 2013"}, {"Title": "Quirky", "Author": "Stephanie", "ReviewID": "RXCAH216TBJ4T", "Overall": "3.0", "Content": "We had to send the first TV back due to color distortion in bottom right hand corner -- exchanging it was effortless thanks to Amazon.  Second TV's color is great, however the TV is quirky.  The apps don't always work (about 7 out of 10 times they work... 30% of the time it's frustrating!) immediately and I've had to turn off the TV & \"restart\" on several occasions :(  Husband loves it for game-playing, I just want to watch my shows & it's extremely upsetting when my down time turns into a stressful occasion...", "Date": "October 29, 2013"}, {"Title": "TV", "Author": "nutsya fagan", "ReviewID": "R63WXNDHOMA2Q", "Overall": "5.0", "Content": "I've wanted a plasma tv for some time. When I found the Samsung it was exactly what I was looking for.  I wear prescription glasses so 3D doesn't work for me.  But I still get an AWESOME PICTURE.  I love it, my brother is jealous.  I'm so happy.", "Date": "September 9, 2013"}, {"Title": "I'm still excited about it!", "Author": "Shaw", "ReviewID": "R2Z75HGH2N9YPX", "Overall": "5.0", "Content": "I purchased the 51 inch about a month ago, from Amazon, and the delivery was super quick and easy. I am blown away by the features of this TV. It is very simple to use, and operate. I also bought a refurbished 3D Blue Ray Samsung surround sound audio, and an Apple TV. When I turn on the TV, it also turns on the surround sound. I watched the life of pi in 3D, with the glasses, and it was amazing! Super easy to go through the initial set up. No problems connecting my wi-if. I would buy this again in a minute. I love the way it looks, and the HD channels make a huge difference. I feel like this TV is worth much more than what I paid. Super happy!!", "Date": "August 10, 2013"}, {"Title": "INCREDIBLE TV! INCREDIBLE PRICE!", "Author": "residentj", "ReviewID": "R3BCWIF0SZ3I5N", "Overall": "5.0", "Content": "Wow, Just Wow! I just upgraded from a 2010 UN46C7000. It was a wonderful TV! Then I bought a UN55ES8000... wanted to love it so much, but the screen uniformity was aweful! White patches all over the place.  I was nervous ordering this, hoping it would not disappoint me... Well, I think I just made one of the best purchases ever! The Blacks & the Colors are insane! I always calibrate my monitors and TVs. Unfortunately this TV has not been reviewed by pro who share their settings, but I can tell you that right out of the box, in Movie mode, this thing looks amazing!  The Smart Hub works great! Be aware that only one remote, the touchpad one, comes with this TV. It's pretty cool, but I can see how some people would get frustrated with it.  Also, for anyone else debating about this TV, check out a video review on youtube by Rowan on the model PS60F5500(it's the UK version).  His review encouraged me, and I'm glad it did! You can't find a better TV at this price and if you already like Smart Hub, then you'll be very happy. Also, for $80 dollars you can pick up a VT-STC3000 camera which gives you the gesture control and skype.UPDATE: JUNE 8TH, 2013A few problems... Software froze on me twice already and allshare cast (screen mirroring) is not working on the TV. It works flawlessly on the Bluray that came with it, but not on the TV. It's been 2 days with it... this sucks. Also did notice some \"White Pops\" when watching Hockey game last night. Let's see how it goes... but I'm already considering a return if problems are not fixed.UPDATE: JUNE 19TH 2013Samsung released a firmware update and the TV is working flawlessly now! Mounted it on the wall, picture looks amazing! Couldn't be happier! I still can't believe the picture quality, features, and size that you get at this super low price! Yea yea yea... Pentile... Honestly that's a bunch of BS! If you are sitting at least 6 feet away you will never even notice it. I have my set up 9 feet away and it looks AMAZING!", "Date": "June 6, 2013"}, {"Title": "No Regrets...but power issue!", "Author": "SHC", "ReviewID": "R1BXY18IORBAII", "Overall": "4.0", "Content": "I have a 2011 model Samsung PN63C7000 (an awesome unit), but this has much improved picture quality. Perhaps it's because the screen is smaller, but great picture quality nonetheless, and the sound (from TV speakers) is surprisingly good. The TV starts in a blink of an eye and everything is working as expected. The older Samsung couldn't play m2ts files (from a bluray structured folder) via usb on portable HHD, but this model can.Lastly, a lot of complaints about CEVA enhanced delivery, but they were just fine.  I had \"scheduled delivery\", but they nonetheless called ahead of time to reconfirm, came on time, and they even put the TV on the stand.  No complaints whatsoever.  UPDATE:After a few days, the TV developed a power issue. This is exactly what happened, so if this happens to you you know what to do. I will try to be as detailed as possible because half-baked explanations do nothing more than make things more confusing.DAY 1:  In the middle of a movie (was watching cable), the screen went black WITHOUT SOUND, and the red LED light at the bottom left corner of the TV was off, so it looked like the TV wasn't getting any power even though the power cord was plugged into the wall. I know to look at the red LED light because that's how Samsung TVs are. The red LED is on if the TV is plugged in but not turned on. The red LED goes off ONLY if either (i) the TV is unplugged or (ii) the TV is on. It's a good feature because you can always check if the TV is off by looking for the red LED light, especially in the dark.After a few seconds, however, the screen came back on WITH sound as if nothing happened. I also noticed a slight smell of burning plastic, but couldn't tell if it was coming from the TV.DAY 2:  The TV worked fine in the morning, but it wouldn't come on later in the day. Whenever I pushed the power button on my touch remote, the red LED light at the bottom left corner of the TV BLINKED a few times and stopped blinking and stayed on, but the TV wouldn't come on. So now I had a TV with the red LED light on (so there was \"some\" power coming to the TV), but a TV that I would not turn on. I plugged the TV into a different outlet, but then the red LED light wouldn't come on at all. It would only come on after a few minutes, but when I tried to turn the TV on, the red LED light BLINKED again a few times and the TV still wouldn't turn on.I checked to see if I was having power issues with my wall outlets - electrician came and checked - but the wall outlets were fine, i.e., good, steady power in the outlets without surge.  I worked with Amazon's tech support who was very helpful btw, tried all of the troubleshooting methods, but none worked. I called Samsung's tech support, who was also very helpful, but, after listening to my explanation, they said the TV needed to be looked at. They offered to send out a technician, but I told them I was returning the TV to Amazon.I just received a replacement from Amazon and will revert with an update if I experience any issues. If I don't update, then the TV is working fine - fingers crossed.I know Samsung had issues with their TVs in the past due to faulty capacitors, and they settled on a class action law suit.  But that was limited to select 2008 and pre-2008 models as far as the court documents go (which I checked).  The Samsung tech support rep said she never received any complaints about this model.  This model is a 2013 model btw, so perhaps it's because it's new.  And I haven't been able to find any power issues on the internet relating to recent Samsung models. Perhaps I got a dud.I do want to make something very clear, however. Amazon was very professional, Samsung was very professional, and I have not had any issues with CEVA (after 2 visits), the shipper that handles Amazon's TVs.Samsung has been my brand for many years. I've tried Sony, Panasonic, Toshiba, LG, etc. in the past, but I still find Samsung to be the best - top quality, best value. Perhaps it's because I always bought my Samsung in Korea, where the larger TVs are made in Korea. And I've NEVER had an issue with Samsung TVs before. I have one that I have been using for 10 years without an issue. And the PN63C7000 I bought 2 years ago is still one of the best TVs I've bought thus far.Hope this helps!  UPDATE 2:After 3 months, the image retension/\"burn-in\" image started.  I own 3 Samsung plasma TVs and know about plasma and potential burn-in issues and NEVER had an issue before.  From day one (about 3 months ago), I activated \"Auto Protection Time\" and \"Pixel shift\" to minimize the risk. And I know not to watch a program with a static image for a prolonged period of time and never did.  However, now I have image retension/\"burn-in\" that isn't going away. I tried the \"Scrolling\" function, but no help. I called Samsung several times, but all they say is \"not covered by warranty\".  Absolute non-sense.  Don't buy Samsung!  Customer service at Samsung USA is horrible.  Many of the tech support people have NO CLUE, e.g., they put you on hold, come back with little support/advice, etc.  You'll get more help from the internet.", "Date": "June 4, 2013"}, {"Title": "Great buy", "Author": "jlundin", "ReviewID": "R1NF0CO7WJBIVI", "Overall": "5.0", "Content": "I was a little skeptical to buy  a plasma TV because in the past they have not been so great. I have had this TV for over 2 years now and I am so pleased with my purchase. The TV works great and the picture quality is great. All the features work awesome on this TV. The sound quality is fantastic for movies or just regular cable and you cannot beat the price for the size!", "Date": "November 4, 2013"}, {"Title": "I want to give it a 5 but there's a few issues.", "Author": "dabombace", "ReviewID": "R2Q868I3NMSU2W", "Overall": "4.0", "Content": "The Good:The picture quality is stunning. For me the difference between plasma and everything else is like night and day quite literally when it comes to blacks. After breaking my previous Samsung PN51D6500 plasma which this is replacing since i cracked the screen I was shopping around for something else and I couldn't even look at the LED TVs that are all the rage now for more than a few minutes, even with the brightness set to the lowest setting on most of them it was like staring at a lightbulb compared to the natural effortless comfortable viewing on Samsung plasma screens.Out of the box picture settings are exceptional with no tweaking, i noticed this on my previous Samsung plasma as well.SMART TV is hugely improved from first generation, tho you get slower performance on this model than on the top of the line one.3D Looks great.Doesn't burn in as easy as previous plasmas, good features to prevent this and to deal with residual images.The price!The Bad:The remote concept seems good but in practice it's annoying. It has a very sensitive touchpad the slightest butt press on your couch or even just while inattentively holding it in your hand will fast forward your content or rewind it. The remote and smart TV menu can control your cable box depending on provider (NEAT!), but the lack of number buttons quickly became too annoying to bother with. Finally the mute button is on the side of the remote, (where an iPhone style touchpad Lock switch would be better suited)This is a specific problem I had with HBO GO App, although i'm sure other apps have similar issues. HBO Go will on rare occasions crash or hang while playing something, the other night this happened when i had fallen asleep. Normally a safety timer on the tv shuts it off after you don't use the remote for a length of time but this does not kick in if the app hangs. I know because i woke up several hours later to a still image on the screen, luckily running the pattern removed the residual image quickly. Unfortunately i can't use this app while dozing off because i don't want to risk that happening again.Another issue i noticed with the same app was after a movie finishes sometimes the resolution of the whole screen will get distorted and stretched out so you can't use the smart tv menus at all and need to shut the tv and turn it back on to continue.The glare can be an issue if there's a lot of light, if at all possible place the tv with the back towards biggest window.", "Date": "July 26, 2013"}, {"Title": "60\" Model is Pentile.", "Author": "Reala", "ReviewID": "R39W8NI2SV4X5H", "Overall": "3.0", "Content": "Just an FYI, the 60\" model (60F5500) uses a pentile subpixel layout.  For people with sharper vision or a relatively close viewing distance, this pixel structure can be noticeable and distracting.  My personal impression is that it looks more similar to a 720p display than a 1080p display, but those with no frame of reference and/or a great enough viewing distance might not notice or care.  Just putting it out there for those that do.  I believe this is limited to the 60\" model only.  The 51\" and 64\" varieties use a standard pixel structure.", "Date": "June 8, 2013"}, {"Title": "That's one great TV", "Author": "Rich T", "ReviewID": "R1JJ7R34CWUPCH", "Overall": "5.0", "Content": "I took the time to read up before I made a purchase. I was looking to spend no more than $2,000 and wanted something bigger that 60 inches, with 3D if possible.The Samsung offers the active 3D I wanted, the size (64 inches) and the picture quality one associates with HD televisions. And the 600Hz is a bonus.The 3D is theater-quality, the Blu-ray discs are much sharper than on the old TV (a Mitsubishi DLP model), plus it was easy to hook up to my existing surround sound system. The guys who delivered it couldn't figure it out, but when I came home later it only took me a couple of minutes to get it good to go.Most of my research was through Consumer Reports, and I also set the picture according to their recommendations. I did that during a football game and was pleased with the picture when I was finished.For the price you'll have a hard time finding a better HDTV.", "Date": "January 11, 2014"}, {"Title": "Satisfied with the purchase", "Author": "AndyZ", "ReviewID": "R18QF8D6YMY08B", "Overall": "5.0", "Content": "I had exactly the same Plasma from Samsung with no Smart functionality before and I simply love our new TV. With the internet access, Netflix and Youtube apps I can watch whatever I want even if there is no cable. Good for gaming as well. Recommended!", "Date": "September 6, 2013"}, {"Title": "Great TV picture, poor sound", "Author": "J.B. Hickok", "ReviewID": "R34EIMXGONQMD3", "Overall": "3.0", "Content": "I purchased 2 of the 51\" models.  Both have awesome pictures, the best I have ever seen.  If you got a low lit room, plasma is the way to go.  The 3D looks spectacular.  The remote is a little odd and too small for a TV with so many options.  It has a touch-pad sensor, and I'm thinking with a lot of use, the touch-pad will get worn out.  Then you would need to purchase a new remote if they are still available in the future.  Also, I had to disable the goofy \"what's on\" menu.  Every time the TV is turned on, that thing would pop up.  The biggest problem I'm having is the sound.  The TV speakers are horrible. I have owned both TV's for 15 days now.  One of the TV's started distorting anything with a certain bass level -background music, explosions, etc.  The bass now sounds like thunder, and rumbles with distortion when it hits a certain bass frequency.  The only way to fix this is to turn down the eq levels between 100-300Hz, but then the sound becomes flat.  I guess the other way to fix it is go through a Home Theater System and don't use the TV speakers at all. By doing a google search for the problem, I have found that other Samsung TV's have this issue as well.  One explanation points to a fault in case design. The bass distortion is caused by a lack of insulation in the speaker cavity of the case.  So when it hits a certain frequency, it rattles something on the inside of the case. I always had the TV at a reasonable sound level, nothing that would cause a speaker to blow.  It's strange that it does it on just certain low frequencies.  If the speakers are that fragile, I'm really cautious to bring the other TV up to a enjoyable sound level.", "Date": "September 28, 2013"}, {"Title": "Recommended", "Author": "G. Taylor", "ReviewID": "R3112TU4SB2F2X", "Overall": "5.0", "Content": "No problems with PN60F5500. A few thoughts:- Spent weeks going over reviews. In the end, I think every HD set looks great and it would be hard to tell the difference in my living room between this plasma and another.- Performs well in room with lots of windows..It does have a reflection, but all TVs will.  It is acceptable. The kids could care less and I mainly watch TV at night.- The SMART TV functions work well, but in reality beyond Netflix and Vudu I do not think I will use them much...There is a fitness app that looked neat, but it looks like too much work.- Sound is average. Got a Polk sound bar and very happy with that choice.- Remote is interesting. Has voice capability but it is gimmicky and will never be used.- 3D feature is better than I expected it would be. Did not buy it for the 3D but it looked perfect. Watched Avengers 3D and was impressed. May watch more. The glasses seem cheap, but they are only $20.00. 3D was much better at night in a dark room.- In the end, highly recommended. Great price on a new model HDTV.", "Date": "April 21, 2013"}, {"Title": "Good TV", "Author": "Kevin J Corcoran", "ReviewID": "R217KX3NQOMH03", "Overall": "4.0", "Content": "I've had this TV for about a month. Here are my impressions:The picture is very good. However, I can is definitely notice some buzzing when there are bright objects on the screen. For example, watching a day baseball game can causing buzzing. Disappointing and annoying, but not a deal breaker. The black levels are quite good and I haven't noticed any loss of detail in dark scenes. I also have not noticed any image retention.I have noticed some issues when the camera pans. Sometimes it can be almost dizzying. Perhaps I'm using some setting (or not using as the case may be) that is causing this. I never had this problem with my old plasma, so this is definitely a strike against this TV.The screen is reflective, but my last plasma and the CRT TV I had before that were reflective as well. I don't view the reflectivity as a problem. I only really notice reflections when the TV is off or it is showing a really dark scene.I'm not a 3D person, so I can't speak to its performance.The browser is just okay. It's slow, but it does work for most of the sites I've visited. One exception I've noticed was NBCSports.com. I could only access the mobile version of the site. Specifically I wanted to see if Live Extra (for English Premiere League soccer) would work. It did not. I'm not sure as this is specific to NBC's site or if other sites are similar. I haven't used it enough to find out. Hulu.com seems to work just fine (for those shows that are only available on the web as opposed to via the Hulu Plus app), if slowly. However, I haven't tried to actually play a video. The browser is nice to have, but I don't see me using it a whole lot.Speaking of apps, the app selection and performance is adequate. The apps I've used so far can be a bit sluggish (at times frustratingly slow), but they do work. I've primarily used Hulu Plus and HBO Go and have had no problems with either. It does take a while for Hulu to load, but once it does it works fine. I'm using a wired network connection, so I can't comment on the WiFi capabilities.The sound is fine. I can make out everything just fine even when I have the volume on a low setting.3 HDMI inputs is disappointing, but switches are cheap.The remote control is good in so far as it's small and you don't need to point is directly at the TV. I did find the lack of number buttons to be a negative. Also, the voice commands for the TV, while nice in theory, don't work. The voice command system is, quite frankly, terrible. Don't waste your time trying to use it.Overall, I'm pleased with the TV and would recommend it.", "Date": "August 21, 2013"}, {"Title": "A great TV with a very poor computer attached", "Author": "Amazon Customer", "ReviewID": "R3KXYI0UJ6KBSV", "Overall": "3.0", "Content": "The TV portions of this panel are nice, the software and possibly the hardware are very poor indeed. While I have a 20 Meg internet connection, content does not buffer properly, and thus, you have content playback stop, load, then play after a while.My opinion is, hook your own computer up to it, or better, put a chromecast on it you will be much less frustrated.", "Date": "February 16, 2014"}, {"Title": "Good BUT Caveat for Soundbar Users", "Author": "GENE P WHIT", "ReviewID": "R16WN2PJ0GQX9D", "Overall": "3.0", "Content": "IF you're looking for optimum soundbar audio, be aware that this TV downgrades ALL sound output to two channel with the exception of  Tuner & Wifi received signals.  Simply put, DVD or satellite programs come out strictly stereo, no dolby, surround, etc. IF you attach to the TV's output, yes even the TV's optical output.  This is a fairly high end TV and Samsung should have done better!", "Date": "February 7, 2014"}, {"Title": "Love the Smart Hub", "Author": "Orbital", "ReviewID": "R24TM9SH9EB4DK", "Overall": "5.0", "Content": "Love except for the touch control on the remote. I bought a Logitech remote and love it. The video streaming works well.", "Date": "December 23, 2013"}, {"Title": "Great picture", "Author": "Kristie Young", "ReviewID": "R2G2QTWRQAYCG8", "Overall": "5.0", "Content": "The Picture is great. It is easy to use. It was delivered promply.Only had it for a month so hope it lasts along time.", "Date": "November 13, 2013"}, {"Title": "Best TV I ever had", "Author": "Nick5405", "ReviewID": "RYFH03UV88TV7", "Overall": "5.0", "Content": "I bought this to replace my aging 50\" Plasma that I left on the wall at my old house.It was a Samsung Plasma also and it worked flawlessly for about 6 years.I was a little skeptical about this deal because it was about $600 cheaper than the old onebut I guess the technology the is cheaper now than it was then.The picture is awesome, blacks are very black and the color is very impressive and I don't seeany pixelation on fast moving subject matter.My old Plasma used to get very hot but this does nothing like that.I tried the 3D the other night and it was jaw dropping just how good it was.I bought 3 sets of the 3D glasses after reading all the comments about that and then I found 2 free pairsinside the box so I would wait until you got the set and checked before buying more.The sound is OK for TV but I did get the Samsung sound bar to go with it so I expect it will be betterwhen that is hooked up.The stand is OK, but I think the set is really supposed to hang on a wall so I wasn't too hung up about that.The remote is different with it's \"mouse\" pad thingy, don't know what would happen if something got spilled onit though, I can't imagine there will be many universal handsets available or a replacement being cheap.A great TV and well worth the money", "Date": "October 21, 2013"}, {"Title": "Wow. Great picture quality, great xbox 360 3D action!", "Author": "S Clayton", "ReviewID": "R1FP5RTKEGSYC2", "Overall": "5.0", "Content": "Update: I've had the tv for a month or so and still love it. Easily the best picture of any set I've owned. Do yourself a favor and switch the picture to dynamic mode. For gaming turn on game mode (choose 'only for this source'). It uses more power but the picture improvement is dramatic. And turn off synced to power. The remote is nice but I find that it has one fatal flaw that ruins it for me. The EPG in smart tv hub is awesome but doesn't remember which channel you changed to. Scrolling down to the hd channels each time is a pain.Really thin, great picture quality. Screen mirroring from android is boss. 3D Call of Duty Black Ops 2 is so good it makes me thing 3D may not be hype. For video games at least. Just remember to lower the resolution on the xbox to 1080i or lower. The 3D glasses are darker when they are on - if the game is showing doubled images then you don't have the glasses on.The remote has a bit of a learning curve but the touchpad really does work well and the remote has less than 10 buttons. entering usernames and passwords by touchpad isn't great but the remote and the way they implemented autocomplete make it less painful - 4 letters are projected around the letter under the cursor. The letters are based on previous entries. So typing the same word more than once is quick.", "Date": "August 22, 2013"}, {"Title": "This TV was better than expected...", "Author": "T. DeJarlais", "ReviewID": "R2IKY5G4BNK8H3", "Overall": "5.0", "Content": "I very recently moved up to a job situation where I could buy cool stuff like a 60\" TV. (Prior to this, I was a typically broke art student that was happy to watch my neighbors set with binoculars) Spent months agonizing over the right one to buy. I shopped all the brick-n-mortar stores, did tons of internet research and eventually settled on this Samsung. So happy with my purchase. Picture quality is fantastic, 3D is the same as in theaters. Honestly I don't like the ugly base (Detached: wall mounted) but otherwise have nothing to complain about here. Remote is well designed and totally intuitive. Not difficult to use at all. Contrary to some comments, the touch pad does not require advanced touch-screen skills to operate: right, left, center, click... simple. This TV rocks...", "Date": "July 21, 2013"}, {"Title": "Whole..New World......Fantastic Buy", "Author": "Jack Wallace", "ReviewID": "R35RC2YQWICACU", "Overall": "5.0", "Content": "Although, we'll probabaly use the 3D options only..maybe three times. Even though, I purchased an extra 2 pair,of 3D-glasses this television is beyond any, quality and feature , we've ever known! Amazon has /had the lowest price with FREE shipping! Soo, it was vey easy to make this choice to Plasma Smart 51\" class even with that, \"carbonite\"(?)  tripod stand . Fabulous Picture and vistas', that, just leave the old lcd, led tech far behind. And this particular model, will not be out dated for a long long time...with all its wireless options alone. Something like this television, would have been, easly, 2-3 grand++, 3 years ago..my aproximation. Way more than I could ask for. As our 5-6yrs old, 37\", LCD-made by a famous and good,previous refrigerator motor company -that we paid, out the door was 1500+ with 1- ONE(!!)- HDMI(It was verry.. serious.. business, back then!!)! And really, I've only explored 10-20%, of it's features.Blu Ray High DEF IS KING!! And, watching in 3d... incredible depth a ultra defined focus, as it will in any format, on this television. Got a refurbed ray player for 31usd off Amazon. We are NOT richie money, soo, many people, can get this deal of a find can....  up grade! Sort of last year's model... for the near future.REMEMBER , THIS IS A PLASMA GLASS SCREEN , SWIVEL THE FACE OF THE TV AWAY FROM ANGLED LAMP/Lighting You do NOT have to sit in a dark room.I will  update this...edit as per consumate", "Date": "June 29, 2013"}, {"Title": "First Impression is not very good", "Author": "Bubsrub", "ReviewID": "R12XQFUORZNNI2", "Overall": "1.0", "Content": "I went from a 2010 Samsung 58\" plasma PN58C550, to the Samsung smart 3D plasma PN60F5500. My 58\" Samsung was not a 3D, and did not even have Internet capabilities, so I do love the new features this one has. However there are a few complaints I have,  The picture is bright, crisp, and clear until you start watching something with a dark scene in it. On dark scenes, the picture will become very grainy! I have tried to manually adjust the Sharpness, Brightness, Contrast, Cell Light, Color, and Black Level settings with no avail. I even went as far as to get the calibration settings from a reputable electronics reviewer. But changing the calibration settings did not help either. Now of course it could be that I have just not found the perfect picture settings for this TV yet. Or it could be grainy due to the fact that Samsung has changed the sub pixel structure of this particular model TV, to something that is a known as a PenTile structure. But as of now I have been unable to tweak the grainy picture out. On to the sound. The speakers are on the back of the unit, so the sound goes backward. I have to turn the volume up to the halfway mark before I am able to even hear it. Then anytime a little bit of base starts to play, the speakers sound distorted, and blown! Not sure why this is happening, but I find it better to just keep the TV muted, and my Surround receiver on. Now to the remote. It is very strange an awkward, a bit heavy, and a bit useless. I find myself getting frustrated with it, and just using my old remote that came with my 58\" Samsung. It is also kind of strange that there is one lone toggle switch on the back of the unit, that controls the TV volume, channel changing, and menu options. Also, the screen on this unit is much more reflective, than the screen on my old set. So a bright room does not get along very well with this TV. On to some improvements this set does have over my old set. It puts out a lot less heat than my 2010 58\" plasma did. When you would even walk by the 58\" you would feel the heat coming off that baby, but the new 60\" plasma remains cool to the touch! Also even though the new set is bigger, it does not weigh as much as the 58\" does, and it also uses less power, than the old one did. Also the new set has thinner edges, a thinner back to it, and a voice control feature, which is cool. ****UPDATE**** I have had the TV for only 2 months now, and I have found out that BURN-IN is still a major problem with this set. By default when you turn this TV on, the Smart Hub will open up, and about 9 small windows will appear to show you, what TV programs are currently playing. I have never paid much attention to the Smart Hub, as soon as I powered the set on, I would exit out of the Smart Hub. After about a month of turning the TV on in the morning, the little windows of the Smart Hub managed to permanently Burn images of themselves in to the background of my screen!!! I have always kept my Burn- In controls \"The Pixel Shift\" set to the maximum settings at all times! So I'm just curious how could something burn into my screen from displaying it for about 5 seconds every morning, for about a month?? That makes no sense to me, but it happened! I contacted Samsung that sent a technician out, that verified that it was burn in, caused from the Smart Hub Windows, and Samsung DOES NOT cover Burn In. The Samsung Scrolling feature that is supposed to removes after images, I have used this feature every day for about a month now, and the images are still there! So just like the burn in controls themselves, the Scrolling feature is useless as well! After the burn in already occurred, Samsung advised me to disable the Smart Hub feature upon power up, which I was not even aware that this was even an option! I even thought that the Pixel Shift Feature that protected my screen was broken, but the technician that came out verified that the Pixel Shift Feature was operating, and set to to the max setting. So due to the Grainy picture on Dark Scenes, the horrible sound, and the Burn-In problem, I had to only give this TV one Star, and I would recommend avoiding this set completely!", "Date": "August 22, 2013"}, {"Title": "Great TV, Pretty Good Smart TV", "Author": "Justin", "ReviewID": "R1J519JF7Q9HQH", "Overall": "4.0", "Content": "First off, I have zero complaints about this TV from a hardware standpoint. I bought a plasma tv for the picture quality and it's been a great upgrade from my previous 4 year old LED. I have a few cautionary points to make regarding the software and compatibility side of things. I don't claim to be any kind of tech genius but I'm fairly tech savy-- maybe there are some workarounds to these things, but they're not evident and caused some big headaches the first few weeks of owning this product. Having said that-- I gave it 4 stars for a reason-- it's still a great tv and I'm glad I got things resolved... eventually.1) While the \"smart TV\" features were compatible with my cable *company*, they weren't compatible with the preferred HD cable *box* of the cable company. I was finally able to get a compatible box but it was like pulling teeth and the cable company charged me $65 to switch it out. (That's a whole other story that obviously isn't Samsung's fault, but it's something to check out while making this purchase.) Supposedly Samsung is expanding support for additional boxes but they don't proactively tell you if a new model is supported; you just have to wait and check for updates.2) After I got the compatible box installed... It's kind of neat having the slick Samsung menu's that provide suggestions and allow for search but don't plan on this feature changing your life. The \"guide\" forces you to start from channel zero every time and scroll up to the channels you actually want to watch. (The HD channels are in the 600s so I'd have to do a lot of scrolling to get to those.) Luckily you can still use the cable company's menu system but then why did I buy a smart TV, right? Also, the voice search interface can be frustrating. Searching for \"college football\" will return a bunch of games that are on, but the menu can cut off which teams are playing.3) I still use my universal remote for most things because the samsung one doesn't have channel buttons. It seems like an easy fix to have a shortcut to favorite channels but I can't find that feature if it exists. You can \"draw\" the numbers on the touchscreen remote but that's a step backwards if you ask me.4) I have a soundbar that is a few years old and it works just fine with the bluray player, the PS3 and with the cable box. The TV apps that produce 5.1 sound don't sound right coming out of the soundbar. Supposedly the app developers (Netflix, Amaxon, HBO Go, etc.) are responsible for this, but it's just one more thing.Anyhoos-- like I said at the beginning-- it's a great tv and I'm glad I bought it. Just know that there might be some major headaches in getting it set up and it might have some compatibility issues with existing equipment. I was one or two hiccups away from returning it for a non-smart TV. Overall I'm glad I stuck with my choice to keep it... I just wish the installation could have been more seamless.", "Date": "September 19, 2013"}, {"Title": "Buzzzzzzzzzzzzz", "Author": "David Jeffrey Atherton", "ReviewID": "R1EJILCAQHHMTA", "Overall": "3.0", "Content": "Samsung PN64F5500 64-Inch 1080p 600Hz 3D Smart Plasma HDTVI bought and returned this TV and I want to make sure that people know what they're getting into before purchasing this Plasma.Pros: Great picture, Smart interface is slick and has a lot of cool apps including HBO GO, remote control is cool but can be frustrating.Cons: This TV buzzes very loudly, the stand looks and feels cheaply constructed, would not accept audio or video signals through an HDMI switch.My biggest problem with this TV is that it makes an incredibly loud buzzing sound whenever it is on.  This sound can be heard with the volume turned up quite high and at a distance of 10 feet from the TV.  It only gets worse with brighter scenes.I had a Samsung technician come out and this is what he told me:\"There have been a lot of buzzing complaints with this particular TV.\"\"The buzzing sound is normal.\"\"The buzzing cannot be fixed.\"He also told me that ALL plasma TV's buzz and if I were to exchange it I would get the same result.  Well guess what I did?  I exchanged it for a 65\" inch Panasonic (ST60) and there is ZERO buzz.  I can't even hear a buzz when I put my ear up to the TV.  So basically the Samsung tech is either incompetent or just lying to me so I don't return the TV.  However, I am very glad that I did return the TV because the buzzing was driving me crazy.In a nutshell, I could have lived with this TV if it didn't buzz but in the end I'm glad I returned it because the Panasonic ST60 is 100 times superior in every way.Save your money, time and frustration - buy Panasonic instead (and do it soon because they no longer manufacture plasma TV's).", "Date": "March 3, 2014"}, {"Title": "One week review", "Author": "Timothy Keyser", "ReviewID": "R52L70P08RW9H", "Overall": "5.0", "Content": "I have had this tv for one week and want to give my initial impressions.Pros- The price. For my eyes it has an amazing picture for the price i payed for it. Bluray movies look absolutely stunning. I can see details that i could not see on my Lcd tv. 3D exceeds my expectations. I was not expecting 3D to be as good as it is. 3D affects look like they are popping out into my living room. My kids love the 3D affects! The smart hub and apps are definitely a plus.Cons- The screen is very reflective like a mirror. Fortunately i can control the lighting in my living room enough so that this is not as much of an issue. Sound is decent but not good enough for me. For now i can live with it, but i will be adding a sound system later. The remote could be bigger it is too small for me.Overall i love this tv and would recommend it to anyone who wants a great picture at a great price.", "Date": "January 15, 2014"}, {"Title": "Samsung PN60F5500 review", "Author": "OvechKing", "ReviewID": "R2U973C6TW0VVJ", "Overall": "5.0", "Content": "I was recommended this TV by a friend who told me to get a plasma over an LED. He said the picture quality is better than an LED and for 1/2 the price. He was correct.Cnet.com has this TV rated as one of it's top bang for your buck TV's for Quality and Price.  The TV is big and beautiful. The picture quality is amazing and I sit about 8-10 feet away from the TV.Playing Playstation 4 on this TV looks awesome, full 1080P!The Apps on this TV work great and I can stream movies from my PC to the TV seamlessly.For anyone debating a Playstation 4 or an Xbox one. This TV replaces the need for Apps on the Xbox One and the TV has voice commands for navigation.I highly recommend this TV to anyone looking for an upgrade. I will update my review again in a few months.", "Date": "November 27, 2013"}, {"Title": "An unbeatable value for the price.", "Author": "Andrew", "ReviewID": "R22I8AY43UBXZS", "Overall": "5.0", "Content": "I've had this TV for about a week and its given me good chance to observe it.It was easy to set up.  Admittedly, the stand being made out of plastic is not the best, but I have no concerns about it's stability.  Plus, the fact that is swivels is great.  Being a newer plasma, the screen is very thin(about an inch) and gives off very little heat compared to older plasmas.The picture quality is great.  Everthing you'd expect from a high end plasma crisp textures, deep blacks, excellent refresh rate.  I have not had an opportunity to try out the 3D effect, but I will update once I do.  I read some gripes about the Pentile pixel arrangement and I can only notice the pixels if I stand about 3 ft away from the TV.  I don't see how anyone could notice as long as the TV is more than 5ft away.The Smart hub features are nice.  It comes with preinstalled with streaming apps like Netflix, Hulu plus, and Amazon Instant video.  All of which work well. I haven't tried youtube, facebook, or the internet browser.  Honestly, I would never use a TV for that.One last thing to note, this TV does have a fair amount of glare.  As with all plasmas, they perform best in lower light.  However, there is no anti-reflective coating as there is in some competing sets.  It just requires a bit more consideration as to its placement.Factoring in all of it's features and the price, it's an easy 5 star.  Just be careful, it will make your old TV look like crap!", "Date": "October 29, 2013"}, {"Title": "wow even better than my moms st60", "Author": "kmac", "ReviewID": "R341V5VEAQTJ5M", "Overall": "5.0", "Content": "This is the best tv for 2013 hands down!The picture looks even better than the st60 which I thought was amazing at the time until I saw the perfect blend of blacks and colors on this set.Also its not nowhere near as dim and how in the world is this tv under 1200 dollars and perform so well!The 3d is also a art of beauty because it has amazing details.When I say this tv has no weaknesses I mean it!I read so many comments that I was trying to search for some thing negative about the product when all I  could do is smile of being amazed the entire time lol. I am SO HAPPY i MADE this purchase because my stupid a** almost bought a samsung 8500 for 2799 because of its total blacks colors+ brightness when this dam thing actually gets to bright for me on cell light 20 but I now all I can say is that anyone who spends more money on another tv is a complete fool because I have seen every other tv and the only difference is a hair of black lmao,the samsung has better colors and brightness and panasonic has a penny worth of better blacks but is much dimmer I must say.", "Date": "August 15, 2013"}, {"Title": "This TV is effing Awesome!!!!!", "Author": "J. GODFREY", "ReviewID": "R2RA445YWM0GNL", "Overall": "5.0", "Content": "I do not have a single solitary complaint about this TV. It is absolutely stunning in every way. Maybe I have low standards but I see a bunch of complaints in the other reviews and they all seem very anal and silly. I mean the screen is made of glass so of course there will be a glare but how is that the TVs fault? Do these people blame their dryers for creating lint too? It does have a glare but only if you look at the glare and not the content that is showing on the TV at the time. Maybe I'm the only person that has the ability to completely ignore the glare and watch whats actually showing on the screen.As for the picture, what can i say, its stellar. My previous TV was a Sharp Aquos LCD 32 inch and its ok. It finally went caput so I upgraded to the Samsung PN60F5500 after doing a lot of research. I wanted to stay away from the big name TVs i.e. Sony, Samsung, Sharp, LG, etc because you pay more for the name than the product. But surprisingly this model has a lot of high priced features for a very good price so I bought it and it was the best decision I made this month.Those features include:- A dual core processor so it is very fast in processing commands, no sluggishness.- Anynet features which allows you to use one remote with all of your samsung comp[atible devices ie DVD player, Soundbar, etc.- Include IR extension sensor so you can use remotes from all over and far away.- voice command feature. It may seem gimmicky but like anything, if used correctly it can be extremely useful and convenient.- Built in wifi, goes without saying- Automatic updates, no downloaded onto a USB then sticking into the TV (huge PITB). This TV does it automatically while you make Breakfast, etc.- Swivel stand, i know this seems like a no brainer but you'd be surprised how many high-priced TVs does not have this feature. The TV can swivel from side to side (A helpful feature to those afraid of the dreaded glare I'm sure.)Needles to say my search for a great TV has ended. I will be purchasing the same model in 47 inch model for my bedroom.", "Date": "June 29, 2013"}, {"Title": "This is one amazing TV", "Author": "Chad", "ReviewID": "R25BM307FLZHLP", "Overall": "5.0", "Content": "We got this TV after really looking at the differences between Plasma and LED and decided on Plasma because of the better picture quality and faster refresh rate. I am also a console gamer and this TV rocks for playing any first-person shooter! It has a dedicated game mode that reduces picture processing (read lag time) and it seems to work great.The picture quality on this TV is amazing and the resolution really shows. I do notice some artifacts on 720 broadcasts, but 1080 rocks!The Smart TV features are really handy and easy to use. Youtube comes up pretty fast, although some movies are not allowed on TV when they are on the computer - strange... Pandora, Tune In, and many more apps are available and enhance the TV's overall feature set.The only cons I can think of about this TV have more to do with the sound than the picture. The speakers are hidden behind the TV (probably why they can keep the bezel so small). This yields poor sound quality, but for most people, this won't matter because they will have an external sound system to provide the sound.Also, the only offered output for audio is optical, so you will need a converter if your amp doesn't have optical audio input. Again, this is something that most people will have with the current external sound systems.Overall an amazing TV!", "Date": "May 8, 2014"}, {"Title": "Surprised", "Author": "Dano \"Kirkland_Dan\"", "ReviewID": "R3CVBN3FMWB9N4", "Overall": "5.0", "Content": "So, first of all you must know that I can't stand most LED/LCD TV's because their blacks are terrible, and they give that soap opera affect (even when you turn down all the oversampling).Secondly, I didn't really care about 3D nor want any of the smart features, but this panel was just too gorgeous to pass up.Well I'm so glad I grabbed this TV even for all the features I didn't want.  Firstly, the 3D looks great and is pretty cool when you get some awesome content that you missed in the theater.  Secondly, and for me, more importantly:  I don't need my Roku 3 box or Apple TV box any more.  I mounted my TV on the wall and there's exactly ONE wire going into it, the power cord.  That's it.  My wife was floored (she resisted a larger TV, worried about wires, etc etc...) and loves the fact that she only has to use one remote.  Score.Anyway, love the smart tv section, and even cooler it just magically saw my Synology NAS on my network, so I now have all my video (and other media) content available from my home server.  Fantastic!  I still installed the Plex app because it allows better/faster skipping and remembers where I love off, but still... fantastic.Super happy I bought this, will likely buy another one for my man cave :-)Cons:Ok I had a major problem connecting to the Smart TV hub, even though I was connected to the internet, I had to eventually call product support (which amazingly didn't take forever, and was actually useful, and fixed my problem.  wild).  Google'ing the problem produced no results.  If anyone get this error, something like \"your internet connection is not stable\" then you need to use Samsung's DNS in your wireless settings.  Call them and they'll help.  After that it's clear sailing.", "Date": "April 8, 2014"}, {"Title": "sold choice as long as you don't mind glare and don't have an older receiver", "Author": "MattkPSU \"Matt\"", "ReviewID": "R2WEH98RJSSJCZ", "Overall": "4.0", "Content": "I honestly feel my 3yr old samsung 50\" plasma has a better overall picture. That being said, overall this is a fine plasma TV that will give you a better picture than any LED out there. Movies look amazing and the colors are really consistent.Pros- better picture than any LED out there- image retention MUCH improved over older plasmas-smart features work well for me- swivel base is great for my room setup- less heat than my older plasma- integrates very nicely with my denon 2113Cons:- does NOT pass through 5.1 digital sound to the optical output. It will downconvert to 2.1  If you have an older receiver with no HDMI, this is not your TV.  Same goes for the all in one and soundbars that only have optical input.  The exception is if you are on netflix, apps, or using the in tv tuner.  Then, and only then, will you get 5.1/7.1 through the optical cable.  Due to this problem I had to buy a new Denon receiver to replace my old marantz.- the glare is really substantial, even compared to my older samsung plasma.  Mine is set up in a basement and even then I get glare.  This TV would be terrible in a room with lots of windows.  Make sure you are OK with this, before purchasing.- touchpad remote is worthless to use for any other components (ex: tivo).  I got a free BluRay with my purchase and it has a way better remote.  As an engineer I appreciate what they tried to do with the touchpad, but it just doesn't allow you to do basic things like fast forward your tivo.- the definition of blacks and dark colors was not as good as I was expecting.  Perhaps I need to get the settings better.  I feel like things get lost in the black.  Could be an issue if you're a gamer playing 1st person shooters and such.-  video from various sources and apps can sometimes be choppier than I expected.  Not sure why.my response to various reviews and their issues:-glare: yes this thing has glare.-I haven't tried a PS3 on this thing, in order to address lag.  I also never use the gaming mode.  I know you really have to dial the delay up to match audio with the video for dialogue.- The included speakers are adequate, but I added a Denon 2113 surround setup and it was a big improvement.  Who buys a $1200 TV but doesn't pay for sound components?- no i don't hear a buzz unless i'm 4 inches from the tv.  And I have very sensitive hearing.- pentile display:  this thing looks great, but don't sit closer than 4ft.  Then, yes, you might not be happy.  But why on earth would you buy a 60\" TV and then sit so close?!?  I wouldn't have even known about the pentile thing until I read these reviews.Overall a good buy as long as you have an HDMI receiver and glare won't be an issue for you.", "Date": "March 30, 2014"}, {"Title": "Couldn't be more pleased", "Author": "S. Bailey", "ReviewID": "RUE857DAAUO9L", "Overall": "5.0", "Content": "Bought this to replace my 8 year old LG plasma, which cost about $7000.00 back then. I couldn't be more pleased with the quality of the picture and features. At this price it will be the perfect TV to wait out the battle of the next big thing (4k, 8k, ULED, etc) until those prices come down to a resonable cost.", "Date": "February 3, 2014"}, {"Title": "Great all-in-one TV", "Author": "D. Bishop", "ReviewID": "R1RFPM5JLDXN63", "Overall": "5.0", "Content": "This was my family's first big screen TV purchase, and our first plasma TV.  I bought this one based on a lot of research, both on websites and Consumer Reports.  We have 2 smaller (21\") LCD screens and one of my concerns was viewing angle.  Buying a big purchase like this without seeing it in person was a risk, but I feel I made an informed choice.The picture is large and clear, and the TV really has everything you can ask for in it.  We purchased a sound bar to go with it, but generally it does not need it.  We are using it because the sound from the bar is much deeper and surround sound, but the TV's audio is certainly adequate, and surprisingly good for such a thin TV.  Rather than buying a soundbar before you get the Tv, like I did, I would recommend getting the TV first and trying all the settings.  The clear voice setting is very good and adequate for most applications.  If you want booming sound from movies (and, if you are a XBone/PS4 player, your games) you may want the extra boost.  My son will not game without it, but he's spoiled =)  We've not used the 3D option yet so I cannot comment on it, but it's a nice extra, I guess.  3D tech does not seem to really be taking off so I'm not considering that a pro or a con on the TV.I'd like to address a few comments I've seen in other reviews about the stability.  The base looks small, and is plastic, not aluminum, however it is rather heavy and once the TV is attached to it very adequate as a base.  We have a 1yr old, so we were concerned about her moving it, but the entirety of the 45lbs of the TV seems very well supported on the base.  It appears to only turn left and right, not back and fro, which is perfect.  Because I am paranoid, I bought a support bar that goes on the back of this to firmly hold it to the entertainment center I have it on.Also, the remote takes some serious getting used to.  It is a very very limited remote, with most of the actions covered by the touch screen and voice.  The voice interaction is entertaining and novel but we do not use it much.  It's very much like using Siri or Ask Google.  The \"more\" button on the remote pulls up a menu on the bottom corner of the screen with all the other features of the remote you might be used to.  I like the remote, most of my family hates it.  It has built in universal compatibility, like most do these days, and has a decent amount of flexibility.  It easily interacted with my Comcast cable box.As a final side note, the TV itself talks to the box and uses it to populate its own menu which is quite impressive.  You can easily see a graphic view of what's on, or use the remote and get a list of specific items (\"what cartoons are on\").  On the menu there are also a large amount of pay-per-use and subscription services that you likely will want to remove from the quick access menu.Lastly, this TV was delivered as part of Amazon's Enhanced Delivery service, which I'd never heard of before but really appreciated once it happened.  The TV was delivered like you would get it from a normal electronic store, with a few guys bringing it in and at least partially setting it up.  As it was sub zero the day we got this, we did not do that, but it was still nice to have as an option.  They were timely, polite, and it really felt like I'd gotten the white-glove treatment.  Big props to Amazon for this as a free included option.", "Date": "January 8, 2014"}, {"Title": "Great TV for the price", "Author": "Ronald Bolster", "ReviewID": "R27W7J2IT5XMDE", "Overall": "5.0", "Content": "This one has a high CU rating. Plus a downright affordable cost for a TV of this size and capability. So far, no problems. HOWEVER, I will say the remote controller is not what I would call an 'ideal' controller for the intended reciepient of this device. It doesn't have 'channel number buttons' per- se, or a way, that I have not found so far, to set 'favorite' channels. It's high tech, up to date, but alot of what it can do is to me 'overkill'. However, for the common youthful tech junkie, it's probably just enough. Oh, it also comes with 3-D glasses, that are battery powered. Batteries included. It does provide a gorgeous picture, and is impressive on HD channels. You can also watch it from any angle, with no loss of visual clarity.", "Date": "December 31, 2013"}, {"Title": "The BEST!", "Author": "agaupt1", "ReviewID": "R5SE6PZHR4572", "Overall": "5.0", "Content": "The samsung HDTV with 3D is absolutely fantastic in every aspect with well thought out and presented menu which controls all aspects of the TV  !", "Date": "October 21, 2013"}, {"Title": "Very happy with this TV", "Author": "Jerald Overstreet", "ReviewID": "RJCO5AOW7ZY1C", "Overall": "5.0", "Content": "I have had this set now for a couple of weeks and overall very impressed.  Our LG 55 LED decided to die on us and thanks to Squaretrade I was able to purchase this set as a replacement.  We play PS3 and Xbox360 games, U Verse HDTV, Blu-Ray movies from a Samsung BD-F5900 player, and use some of the apps on this set.  Everything is just beautiful, the deep color are excellent and the black level, well I never knew what I was missing.  Haven't tried any 3D yet but will update when we do.", "Date": "July 11, 2013"}, {"Title": "awesome television!!", "Author": "jkphish1", "ReviewID": "RNTYDJOTHQHZ7", "Overall": "5.0", "Content": "The picture quality is amazing. There is absolutely no blur. The.settings are easy to adjust. And the remote is a breeze once you get used to it.this is my second Samsung. I highly recommend there products", "Date": "July 9, 2013"}, {"Title": "Big Screen Perfection", "Author": "Hot Wax \"Demps\"", "ReviewID": "R3RBHO72IUN4HL", "Overall": "5.0", "Content": "A huge upgrade from my 5 year old 46\" Panasonic plasma. Picture quality is great in my finished basement. The sound, powered by a Yamaha receiver & 12\" Polk powered subwoofer is tremendous. Amazon enhanced delivery brought the TV down to my basement, unboxed, powered on, & then the packing materials were removed.  Tried out the 3D with a movie on HBO 3D & it looks good. After 1 month, the TV is doing everything as advertised.", "Date": "June 25, 2013"}, {"Title": "Good TV, Instructions weak", "Author": "Gary Penner", "ReviewID": "RTNFKALA1IT81", "Overall": "4.0", "Content": "Since what I really care about is how it looks and works, we start with that...If you want a great looking TV at a great price, this is it!  It is really spectacular, and the 3D really works well when you are watching a 3D source.  The 2D to 3D upconversion is interesting, but I get tired of watching it that way, since it isn't really broadcast that way, and lacks the spectacular nature of a program designed in 3D, but that is not the fault of this or any other TV.As far as the instruction manual goes, it gave only the basic information needed to run the TV.  There is an online manual which can be accessed using the TV, but it is cumbersome, and often refers to other manufacturers instructions, such as in regard to how to use screen mirroring, asking you to check your phone's capabilities without much other explanation as to how to make it work.  It would be nice if a better explanation of how to do things would be put in the paper manual you get with the TV.  In the slightly older days of just a few years ago, every switch, setting, function, and jack on a device was explained in detail in the manual.  Now it seems manufacturers just assume everyone knows how everything works.  That is great if you are a tech-savvy teenager, but the higher tech bears some explanation to those of us who know some but not all about things like this.  Again, my complaint aside, I think you will find similar issues with all manufacturers these days, and not just with this TV.  Just know that if you are looking to upgrade to any such TV, you better know how things work.", "Date": "August 20, 2013"}, {"Title": "Excellent 3D quality and very good HD!", "Author": "Rolando B. Fauni \"NGEPOY\"", "ReviewID": "R8AAWM7EW52NZ", "Overall": "5.0", "Content": "Before buying, I primarily used Consumers Report ratings for the technical evaluations of this product and the users' feedbacks for some cons. I hooked up 3 HDMI----DirecTV (STB), Samsung BD 3D player, and an Onkyo receiver (ARC), a component hookup for a karaoke player as well as a Samsung Skype camera. I used Cable Matters HDMI cables with 3D and 4K capability and 1.4 support. Since I want all my audio coming out of my receiver's 5.1 channels with a minimum of remote controls and cables, I directly hooked up my STB, BD player, and karaoke to this HDTV and then connect this unit's HDMI (ARC) to the HDMI OUT of my ARC capable receiver. No other HDMI hookup to my receiver is needed. If you have a proprietary Samsung Skype camera, only one of the 2 USBs will work for this purpose. This unit also has a built-in Wi-Fi wireless connectivity for internet connections. The remote control has a lot of smart features which need a lot of reading and familiarization so take your time. My best reason why I chose this over other brand names is the excellent quality of the 3D for it's moderate price. Here is where the CR ratings came in after reading a lot of user's feedbacks. I prefer objectivity than subjectivity if you get my drift. As an actual experience,  I had a Panasonic GT model and its 3D quality is actually not as great compared to this. For a 3D afficionado like me, I may not even want to upgrade to an OLED or 4K HDTV in the next 5 years or so unless it's also in 3D. Overall, I love and highly recommend it. Also, don't forget to ask for the FREE Samsung BD player when you purchase this!", "Date": "October 9, 2013"}, {"Title": "Good TV with some minor problems", "Author": "SWFL", "ReviewID": "R304W18UQXL62V", "Overall": "4.0", "Content": "First of all, the picture is great.  Deep blacks and very good overall color.  Menu picture controls are good but somewhat minimal...e.g.., no gamma settings.  This is not a show stopper.  Speakers are good but not great.  You'll need an external sound system to get great sound.  Plasma screen is NOT a matte finish.  It's somewhat glossy and room reflections can be a problem.The outputs on the back of the set are extremely limited.The only audio output in one Optical output. There are no LINE audio outputs.  On the surface, this may not seam like a big deal, BUT the built-in TV Bluetooth will not connect with any Bluetooth Headsets.There is NO Headphone output jack on the TV.  I have a Motorola Bluetooth transmitter which requires a L/R/ RCA phono jack input.  Depending on what the capabilities of your A/V receiver are, you may not be able to hook up Bluetooth headsets unless your A/V amp has Bluetooth. Mine doesn't.WIFI wireless connections are great.  Netflix and other apps work just fine.  The Smart Remote control (Bluetooth) is great but the learning curve is quite steep.  You can hook up any Bluetooth keyboard and mouse to the TV BUT NO HEADSETS.  Go figure.  The Headset connectivity may not be a big deal to you, but it is to me.The display and bezel are quite thin.  Real good build quality.3D and 2D to 3D are very good.  TV is supplied with two pairs of active glasses. Additional glasses are $20 each.I bought this set directly from the Samsung website for $1249 plus sales tax.  This price included \"White Glove\" delivery which consists of a two man operation which includes unpacking, box removal, stand attachment and placement on your table.  The set is then turned ON to verity that it works.  Long story short- only one delivery man arrived and I had to help him assemble the TV and lift it onto the table.  I have a heart condition and shouldn't lift anything.  That's why I chose the Samsung $1249 price. I called Samsung and explained the situation.  The First Line Samsung rep basically \"Too Bad\" but promised to have a supervisor call me back.  That was a week ago.  No call yet.  Doesn't say much for Samsung Customer Service. My suggestion it to buy the set elsewhere for $1197 including shipping and no sales tax.I should have purchased this set from Amazon.", "Date": "May 21, 2013"}, {"Title": "Great TV.. minor bug", "Author": "Billy Bechamp", "ReviewID": "R2ENG08HR128MQ", "Overall": "4.0", "Content": "This is a great TV. Love it. The picture quality is awesome.I had an issue with it after 1 week, there's 3 Yellow lines that appeared on the display. Had to contact Samsung Support and within 2 days a technician was over to replace 3 circuit boards. No issues since. It's been 2 months now.There's a software bug with the TV at the moment where in a high brilliance scene (ie. hockey game when the ice is taking up most of the screen) the TV dims the brightness in and out.. It's very annoying but Samsung has confirmed that they are working on a fix that will be pushed as a firmware update. So no biggie. I can wait for the fix.All in all, great TV and awesome manufacturer support.", "Date": "May 31, 2013"}, {"Title": "Samsung Quality Screen w/ 3D and  many Smart TV Features", "Author": "Kyle Ray \"Cest La Vie\"", "ReviewID": "R3R7MX7CIH4XOT", "Overall": "5.0", "Content": "Couldn't ask for a better picture. Setting are easy once you realize that some aren't available in Smart Menu Settings. You must be in an input screen. Being that HDMI or whatever. Well built except for the stand. But it's better to have flexibility than a rigid unbending stand with no give. Love the remote for most things it's quick and easy to use, without being huge!No real cons, except I just can't understand why Samsung chose IE Browser over Chrome or any other webkit or open source browser. After spending time trying to actually use the browser, it just ends up in frustration. It's slow and clunky. I dread having to use it at all. So I simply use a laptop, tablet or smartphone synced to the Samsung TV via Smart features or Chromecast. Gotta have a Chromecast for all the devices and video inputs you want to use, besides some the crippled apps. I can stream Netflix movies from my computer or other device and watch them in 3D mode. Which I can't do with the Netflix App.... only the YouTube App. It's not real 3D, but it's better than plain old 2D!I've also been converting movies to 3D for this TV. They look great and it's amazing how many YT movies without even stating they're 3D pop up the 3D mode notification.  What's interesting in the difference between passive and these active glasses 3D, is you can actually watch 3D for hours without a lot of eye fatigue.All and all despite the lousy slow IE Browser, this TV is a great purchase!", "Date": "May 5, 2014"}, {"Title": "Excellent picture with tons of features all at a great price", "Author": "metsfan39", "ReviewID": "R3ELX87LBSG8UD", "Overall": "5.0", "Content": "As far as plasmas go, you cannot beat the value this TV is. There may be plasmas with slightly better pictures, and a few more features, but they are nowhere near the price this set is going for. Samsung's top of the line plasma, which is only 1 step above this in their line is double the price. I've only had it set up, so I'm still getting used to a lot of the features it has, but most are pretty intuitive. My one complaint, like many others is the remote. A touch screen, without a full panel of buttons as well, is a pain. It is also very sensitive to touch. That's a minor issue though, as there are plenty of excellent universal remotes that don't cost an arm and a leg, and most of the important features can be controlled with your cable/satellite remote, or even a cheap universal remote. If you are set on a plasma, or even if you aren't, you can't go wrong with this model.", "Date": "April 6, 2014"}, {"Title": "Pleasantly surprised and amazed!!", "Author": "D. Basinger", "ReviewID": "R2GEMALXZC3UUK", "Overall": "5.0", "Content": "Although I had done my \"homework\" by checking ConsumerReports.org first, as well as other HDTV review sites, I really didn't expect the quality of this TV to be so great. It is the first HDTV that my wife and I have owned, and the first new TV purchased in 18 years (Previously a 53\" Sony  projection screen pre-1080i). Our previous TV had a great picture, or so we thought!We deciding on getting a new TV, it would be a choice of 4k or 3D. With the lack of  4k media, and an interest in 3D, I started doing my research. Everything I was reading was saying that Plasma was still much superior to LCD/LED for 3D presentation, and when it came to Plasma HDTV's, Samsung was consistently the leader in reviews.This 64\" screen was a perfect replacement for our previous 53\", both having approx. 32\" height, but the 64\" would be wider of course.The first 3D movie we watched was Gravity. WOW!!! Since then we've watch Avatar, John Carter and Journey 2: Mysterious Island. The quality was as good as being in the theater!!! Better, since we could supply our own snacks!18 years ago, we broke ground by getting full surround sound for our home theater, now we have 3D, and we hope to enjoy it for many years to come!!!", "Date": "March 13, 2014"}, {"Title": "Superb Television With Deepest Blacks and Brilliant Picture For A 51 Inch", "Author": "Rick L. Parrish", "ReviewID": "R2EJB6FIML0W02", "Overall": "5.0", "Content": "Keep your lcds and the others...give me plasma every time.  And now that the manufacturers are dwindling (just Samsung and LG left in the field) I wanted to grab one while I could.  Panasonic made the best but they've exited the market on these babies and that left me researching and deciding between Sammy And L.G.  Sammy won...L.G. lost by a wide margin.  But do your own homework and decide for yourself.  This one is a smart TV with the hub and all that...But I don't use it for that I mostly watch Blu-rays and 3D Blu-rays and it is a beautiful experience on this particular Samsung Television.  The price is good too...or was when I bought new ($797) delivered by prime (delivery wasn't as white glove as Amazon promises in my case...the wrong TV was delivered at first and I nearly didn't catch it because I wasn't expecting that..and the drivers never offered to take it out of the box or anything...so be glad you don't pay extra for the white glove delivery if you're prime...cause you may not get it.  And if you do pay for it I Wouldn't!!  The Television came very well packaged in the manufacturer's box shielding it from bumps and scrapes and the inner retail box was pristine when I opened it.  I've used it for thirty days or so and it's just great.  Set up is a  breeze and my son set up the hub and streaming part for me and said it was very intuitive.  He said the dual processor makes streaming and navigating a breeze but as I said I'll probably never use that anyway...well maybe Netflix if it's convenient...and I need to check and see if it has Amazon Prime come to think of it.  I may well have to update this review.At any rate I would highly recommend this model and so did Consumer Reports in it's size and price range if I can say that.  You can't beat plasma for the most vibrant picture out there especially in the blacks.  They've long since fixed all those weird problems you heard about at high altitudes when plasma first came out and even screen burn in isn't a problem anymore with automatic pixel adjustment and scroll bar rolling that's built into this model.  Download the manual from Samsung and bone up before it arrives and you'll be good to go in no time.One of the best large item purchases I've made from Amazon and aside from the delivery or extra service lack there-of...I had and have nothing to complain about.  I  do recommend this TV.", "Date": "March 10, 2014"}, {"Title": "Wow", "Author": "Joshua Woolls", "ReviewID": "R3EBHFZEAUK5ZT", "Overall": "5.0", "Content": "My wife and I deliberated a lot on a new TV. She wanted LED(as did I at first) but after much research I found that Plasma can give more bang for the buck. I read a lot of reviews and although there were a couple of drawbacks, I felt I could live with them. When it arrived and I got it fired up I was blown away at the picture quality out of the box with no adjustments.What I expected vs What I got:Picture: I expected good. This TV gets good reviews for picture, but supposedly the better Samsung Plasma is much better. Blacker blacks and so on. Also being plasma, I was worried about reflections on the screen being a distraction. What I got is great. I am not a TV snob, but I am thoroughly impressed by the picture. The blacks are quite black enough for me and the reflection is not an issue, even though the TV is in a newly finished room that is still waiting on curtains (it is not directly opposite a window).Sound: Expected poor to moderate. I was ready to go out and buy a sound system to supplement based on the reviews. I am in no hurry now as the sound is more than adequate. If you want booming base, and true surround sound you will probably need a sound system, but I feel that the TV sound is pretty dang good.Remote: Expected poor. And honestly its not that great. I like the small remote, and it isn't bad...but could be better.3D: Expected 3D? But I was blown out of the water. Pacific Rim was our first 3D movie and although I did not have high hopes for the movie, it was really good in 3D. Actually not nearly as poor of a movie as I expected and it really showed off the 3D of the TV.Apps: Hate the Apps. Netflix works...And some of the others work OK, but I am sad that my Roku is now in my in-laws room. The Blu ray player is better for apps than the TV. Can't add many new. Can't easily edit the ones it has. I am not a huge fan. We don't have cable, just use Netflix, HBO, NBA League Pass, etc... and it is so much easier with the Roku.Overall though, for the money this is an amazing TV.", "Date": "March 4, 2014"}, {"Title": "5 stars for me!", "Author": "Charlie Tarkinson \"Charlie T\"", "ReviewID": "R3IKW3R9IF47XY", "Overall": "5.0", "Content": "Nice clear picture and good sound for the price. Just the right size for our family room. Thin border that makes it look smaller than it is.", "Date": "February 3, 2014"}, {"Title": "Great T V", "Author": "Joe", "ReviewID": "R1DSBE75A2MBIU", "Overall": "5.0", "Content": "The picture quality is excellent and the many features are great too.  The ability to interface with the inernet is an added plus.", "Date": "January 16, 2014"}, {"Title": "Great tv must learn the remote", "Author": "Amazon Customer", "ReviewID": "R3PM5XTC3MJLDK", "Overall": "4.0", "Content": "Love the tv only slight problem I have is with the remote. I found for DVR it is not easy to just pause and stop or play. Besides that I do like the other functions on the remote but it takes some time to get used to.", "Date": "January 3, 2014"}, {"Title": "Great tv for the price", "Author": "grigor muradyan", "ReviewID": "R17KASS6LW1LD", "Overall": "5.0", "Content": "Great smooth picture. Dual core processor works awesome. I would like the black levels to be darker but I only paid 850 for this tv. I'm very satisfied", "Date": "December 30, 2013"}, {"Title": "Great Plasma Unit with a Great Price", "Author": "L. Troendle", "ReviewID": "R2VVIYHLNYC8YK", "Overall": "5.0", "Content": "My old 42\" plasma Samsung EDTV finally died this past summer so I did much researching before settling on this Samsung model.  The color is amazing and picture quality superb!  Black and white colors are the best I've seen.  I do not use the remote which came with it.  I should mention, after about 3 months, a slight humming or buzzing sound started to appear, coming from within the unit itself.  My old unit did the same, but not as noticeable since this unit is half as thin.  I researched the Internet and found this to be common.  My room is very quiet and I sometimes turn my home audio theater off entirely when watching sports.  That's when it's most noticeable -- especially when the scene goes from a dark to bright picture.I purchased the movie Avatar in 3D which looked amazing.  I'm not a big 3D fan, but the glasses which come with seem very nice.  Hookup to my wireless home network was a breeze and I did the suggested updates immediately.  A tip-of-the- hat to Amazon, as guaranteed delivery was 3 days off, so a customer representative called to apologize AND give me $120 off the price.", "Date": "December 13, 2013"}, {"Title": "awesome", "Author": "bobco", "ReviewID": "RY6PX6BUMZY3R", "Overall": "5.0", "Content": "I like it, I love itafter 45 days , always when watch TV I enjoy of the quality. The WIFI, Apps and All Share links works Great,I can share my Galaxy S3 Screen on the TV and doing a lot of thing.only the speakers not very high quality, but it's ok. I am planing to order some good sound system.Great", "Date": "September 27, 2013"}, {"Title": "Obligated to review", "Author": "Fred", "ReviewID": "R310UMPNS0MAO2", "Overall": "3.0", "Content": "After buying a 70\" led TV on black Friday of 2013 I quickly became obsessive over all the latest TV possibilites.  I found the 70\" viewing area to be awesome, especially wall mounted.  The problem arose when I made to mistake of reading online reviews and someone mentioned flashlighting and banding.  The 70\" was a Vizio E series which I got for less than 1k.  Long story short, I returned the Vizio and \"upgraded\" to a Samsung LED 6300.  Turned out to be a POS and, considering that I've had no problems with my old Samsung plasma, why not get a new one?  So I purchased this, and I recognized right away that indeed the color and black depth was pretty good, despite the pentile display.  Now, after watching a lot of winter Olympics, it's obvious on every panning shot that this TV has horrendous DSE. So, I felt obligated to give this review to anyone else currently suffering from the obsessive TV upgrade blues.  If you notice things like Dirty Screen Effect (DSE), which is many vertical smudgy looking lines during panning shots on consistent backgrounds, then this TV is not going to make you happy.  Also, be warned this TV has lots of plasma buzzing noise.  Sorry, if you'd settled on this one as your solution to a TV, but it's got some problems.", "Date": "February 18, 2014"}, {"Title": "good value", "Author": "sheik khan", "ReviewID": "R1OEI0QGTHOUY3", "Overall": "4.0", "Content": "I am pleased with this set. The picture quality is great. I thought it would've been too dim for a well light living room but its holding up well. it does generate heat after a few minutes of being on. I would've liked to see the 3D be more of a feature than a gimmick, the 3D glasses are flimsy. Don't buy it for the 3D option.", "Date": "September 17, 2013"}, {"Title": "Very pleased so far!", "Author": "Terrence K Purnell", "ReviewID": "R2SLHB262I0FQ4", "Overall": "5.0", "Content": "Like most people, I did a lot of research before purchasing the Samsung PN60F5500.  I narrowed my choices down to several Samsung and Panasonic plasma TV's and went with this one.  I felt like this TV provided the most value overall.  Most of the Panasonic plasma TV's had better ratings when it came to picture quality but Samsung plasma's were a close second.  I felt like Samsung had the better features, such as app's, so that's what I went with.  I also liked to fact that I could link my Samsung Galaxy S3 with the TV electronically.  In general, I was looking for a TV with good picture quality, along with 3D and a \"smart\" TV with WIFI.  The Samsung PN60F5500 met all of the requirements.  I considered purchasing the PN60E5500, which is last year's model.  However, the price is almost the same so I figured I might as well go with the newer model.I've had to TV now for about a month and it meets all my expectations.  It was relatively easy to set up, the hardest part was getting it mounted to the wall.  It has 3 HDMI ports, so I used 1 for DirecTV box and 1 for the DVD player.  Another bonus is that I got the Samsung DVD Blueray player for free!  I'm not a picture expert but for me the picture  quality is excellent.  There may be a TV with better picture quality but I doubt if I would notice the difference.  The screen is reflective, but really hasn't been an issue for me.  I've only watched 1 3D movie, and it was actuallly quite good.  I've seen 3D movies in the movie theater before and the Samsung is comparable.  The remote takes some getting used to with the touchpad, but it's not as bad as some people have said in their reviews.As far as features, having WIFI is nice and I've used it to watch movies and use apps.  The Smart Hub feature works fine and the TV comes with many apps to choose from.  It's not as many apps as I have on my phone but it has the basics like Facebook, Youtube, etc.  It also has several movies apps but I've only used the Amazon app to watch movies so far.  It's also pretty easy to connect my Samsung S3 to the TV to watch movies.In all I think it's a great TV and I highly recommended to anyone looking for a TV with excellent picture quality, 3D, and WIFI at a reasonable price.", "Date": "August 2, 2013"}, {"Title": "GREAT TV!", "Author": "Madonna Garbo", "ReviewID": "R3AA9TGNDKQ8P6", "Overall": "5.0", "Content": "We checked out Consumer Reports when we decided we needed a new TV.  This TV was rated as a \"Best Buy\" and friends had also recommended Samsung.  The picture is crisp and clean - still have to learn the many features this TV has to offer but this beats hands down our last TV.", "Date": "August 16, 2013"}, {"Title": "Love this TV", "Author": "Desurain", "ReviewID": "R1OHZPLMS2RCM3", "Overall": "3.0", "Content": "This TV is awesome. great picture, crappy sound but what tv doesnt? buy a sound bar. I also love the smart remote. super easy to use. no motion blur on sports.here are my complaints:No internal tuner for the mic port, meaning if you plan to plug in computer speakers to have better sound, think again. you wont be able to control the sound through the TV remote like any older tv can do.When you set up the tv to work with your cable box, there are a few annoyances.1. the guide will not populate until it is connected to the internet, and for some reason that usually takes a minute after the tv is turned on.2. the guide cannot be customzed or edited like the normal television provider guide, so you have about 1million channels on your guide and you dont know which channels you actually have or not. not to mention standard def and high def of the same channels are displayed.to combat this, i have to use the more button and find the STB guide through the options and use the normal direct tv guide instead.3. there is another feature to hotkey channels, but when i select espn channel 206, for ex, the tv will input 20 or 06 or 6 or somthing OTHER THAN 206!!! and its extremely annoying. it is my biggest complaint and i havnt found any help to fix that.the tv seems to have some miss communication when typing in channels. So i have to use the channel up or down button instead of the guide or the channel hotkeys.cant this be fixed through some update??overall, the tv is beautiful. had to buy a samsung sound bar and still using the stupid cable remote instead of this smart remote which i like very much.", "Date": "May 21, 2014"}, {"Title": "Great TV at great price", "Author": "Kenneth Cusack", "ReviewID": "R1UOZXJM24023X", "Overall": "5.0", "Content": "Wow was blown away by this. Was replacing a 6 year old Sharp 51 inch LCD in my basement.  Had heard plasma was good in darker areas and was proved right. Easy setup, love some of the smart features.  I have some 3d Blu rays been watching on it and the pic is fabulous!!!  Works well with my Bose surround system. Product is great for sports and movies which is what I mainly use for.  Can't go wrong with this unit.", "Date": "May 6, 2014"}, {"Title": "Great Value", "Author": "J.W. H", "ReviewID": "RHRR97NOXCF1Q", "Overall": "5.0", "Content": "Same features as sets costing twice as much. Picture is awesome. Sound is okay. Remote takes some getting used to.  3D is great. Glad I bought it.", "Date": "May 4, 2014"}, {"Title": "So many TVs to choose from.. really happy with this one", "Author": "Jimmi L", "ReviewID": "R29G3A13467H6D", "Overall": "5.0", "Content": "i was worried about the horror of 'burn-in'.. with a plasma. So, here in 2014, i think its not relevant. The tv is set to turn off automatically so that defeats burn in.Beyond that,  i happened to see a large plasma displayed right next to a bigger LED tv at Costco.  Let me tell you that the difference in the plasma picture from the LED, blew my mind. This was in a brightly lit store. There was a forest scene, and the two TVs both had great images.  The LED showed the tree trunk and branches and the other colors of the screen were very good and what Ive been used to.  However, the plasma tv  went beyond anything the LED was capable of.  You could see all the markings on the trees; the lines and knots were vivid and the LED couldnt even display them.  Maybe a little thing, but not to me.I love the colors on this TV!  There is no stutter during intense fighting or chase scenes.. no jittery cgi glitches at allI probably could use some tech help to set everything to optimum, but i will get to it soon enough, i guess.The down sides are minimal and really just kind of my preference:the remote is too slippery.. lol  and seems top heavy not a natural fit. I have wood floors in our basement and when it drops (quite often!), the cover and batteries all spew out all over... Maybe offering a rubber bumper to fit would be a good idea for Samsung. Just sayin'...Another slight negative is trying to get a better sound from the speakers. They arent bad but I like to fill the room. If you have or can buy good audio system, fine. It should plug right in and be awesome.  I dont  have an extra one right now.  I tried hooking up a little 3.1 system that Ive used on several computers, but couldnt get anything to come out of the speakers except some rumble ( maybe 60Hz cycle hum or similar). Then I tried to run it to my PA system but so far that hasnt worked out yet either.Video Games -  Just incredible !! !!  So much better than my LCD TV... enough said... As good as they say it is ...", "Date": "April 28, 2014"}, {"Title": "Great Gaming TV", "Author": "Mark", "ReviewID": "R38EJ8U4DEAGN0", "Overall": "3.0", "Content": "I bought this television specifically for console gaming as it had reasonably low input lag according to an independent review lab that tests this specific stat.  I've found this television to be PERFECT for that need.  I also have an 8000 series which I bought 3 years ago that I was hoping would work for gaming but the input lag on the higher-end televisions tend to be terrible for gaming, even when you activate GAME MODE.  I'd neglected to research this when I made that purchase.  Anyway, 3 years later problem solved.  So on to the television...Video quality is very good, though I wouldn't put it up against the 8000 series which can cost over twice as much.  Blacks are as black as can be, a hallmark of plasma television which was important to me.  Another hallmark of plasmas is that they are a little dimmer than other display types such as LED, LCD, etc.  I haven't found that to be the case with this one.  I use it in a room with a decent amount of natural light and have no problems with the brightness of this display.  In fact, in that respect it outperforms the more expensive set upstairs.Sound is a weakness on this television, though I've never really found a flat panel of any kind that sounds good given the smaller speaker sizes inherent to these types of displays.  I don't ever use the television speakers so it's not a factor for me, but I did try them out just to know what they'd sound like.  Pretty bad.  Oh well...As others have noted, the remote control is terrible.  Again, I don't really ever have to use it since I only use the display for gaming, but I did have to use it for initial setup and for calibration.  The touch input was a poor design choice.  It works okay, if not 100% accurate, but it never really feels right.  Even the buttons it does have don't ever feel the way normal remotes do.In conclusion, although this television does exactly what I wanted it to do for me perfectly, I reviewed it as average at 3 stars because the sound is really really bad, and the remote is a poor example of design.  If you want to use the SMART features of the television you'll need to use the remote and you will hate it every time.As a gaming display though (using external sound, headphones, etc), the size and quality of the display as well as its responsiveness make this a great deal at this price!", "Date": "April 7, 2014"}, {"Title": "Excellent value for the money", "Author": "David C.", "ReviewID": "R20X29M3AFTNNG", "Overall": "5.0", "Content": "I almost did not purchase this TV because the reviews that I read said that the stand was not very stable.  Quite the contrary, the stand was very easy to attach to the TV and the stand is very stable.  This is the first TV purchase for me in 9 years and technology has sure changed in that time.  I love the Samsung Smart Plasma TV.  I owned a Samsung TV prior to this purchase but it was getting to the point where it needed to replace the lamp every 2-3 years at a cost of $200 each time. When the lamp went out this last time, I figured that it was time to move up to a smart TV.  I love the Smart Plasma technology by Samsung.  Also included with my purchase were two pair of 3D glasses.  Everything is new now so everything works fine.  Maybe a review in a year from now will be more beneficial..", "Date": "April 7, 2014"}, {"Title": "Superb picture, and I can even use it for shaving!", "Author": "M. T. O'BRYAN", "ReviewID": "RKVK1KLBX26CM", "Overall": "5.0", "Content": "This set really does have phenomenally good picture quality, and is a real value, for the price.  The Smart features are also impressive, and the 3D quality is good too.  Sound is mediocre, as expected, but even a bit under-par by internal sound expectations.  Mine has no buzz, even close up, and runs very cool.The Achilles heel though is the reflectivity, which is incredibly high, by any standard.  Even exercising careful light control, in really dark scenes where the great black levels of plasma shine, you can often see yourself in the shadows, if there's _any_ light shining on you.  I found that very disappointing, but had to balance that off against the fact that (now) any plasma that does better will cost twice as much.Solutions to this dilemma are not simple:1)  turn off ALL the lights (works great for movies, but not how I want to watch TV shows, which is mostly what I bought this for)2)  special positioning.  e.g., over the fireplace mantle.  Normally I wouldn't consider this, but since you're then looking UP at the screen, the only reflection you'll see is the ceiling.3)  just live with it, and get used to seeing yourself lurking in the shadows.  Over time, this may not be as jarring, but will probably remain annoying.  Only time will tell.I have one other minor quibble, and that's with the Energy Star rating on this.  The yellow tag rating is $20/year, and while I'm sure this does use less electricity than almost any other 60\" plasma screen, I'm not buying that number.  If you back-calculate from the 178 kWh/yr at 5 hr/day, they're claiming the average power use when On is 97 watts.  I hooked up my Kill-a-watt, and the only time it was 97 watts was on a black screen with no Input, showing the moving central white box telling you to select another Source.  I wouldn't consider that anything close to 'average picture content'.With actual picture content, the Max was 295W (full white, as claimed), but (short-term) readings ranged from 140 on some shows, to 180 on others, and 220W on a few, depending on what type of TV show I had on.  I still need to do a longer term average, to see if it might clock in lower.  Since a full black screen is 50W though, I'm somewhat doubtful it will approach the 97W claimed.Anyway, in Summary the reflection was bad enough that I seriously considered just returning the set.  And if I had another viable plasma option, I probably would have.  Since I don't, I then had to decide whether I should dock a Star or not.  I'd call this a solid 4.5 stars, if I could.  But I like to be fair, and this was problematic for me.  I'm giving it 5-stars provisionally, because I think there are ways to mitigate the reflections that would satisfy many/most people.  It remains to be seen if I will be one of those, and I may adjust that later if I find it less than tolerable.  But I may decide to relocate this from the living room (sad face) to higher on the wall in the rec room downstairs.  I suspect it may work out quite well in that location.[I may come back and update this after I've had the set for more than a few weeks.  And I'm open to questions.]", "Date": "April 4, 2014"}, {"Title": "Great service and great product from Amazon", "Author": "Carlos", "ReviewID": "R9N2KOQVRSE9T", "Overall": "5.0", "Content": "The product was everything that was described about it and the picture quality is impressive. Overall I am very satisfied with this capital investment.", "Date": "April 2, 2014"}, {"Title": "Excellent addition to home theater", "Author": "Stephen M. DeBock", "ReviewID": "R14659J2W6LYIM", "Overall": "4.0", "Content": "Superb picture in both 2D & 3D. I don't care for the glasses, as the battery housing is two-piece (use a coin to take the cover off); the cover isn't easy to align with the screw threads; and the small battery gets stuck inside the cover when you remove it. Active-shutter performance is flawless.", "Date": "March 27, 2014"}, {"Title": "Samsung Plasma TV the best I've seen.", "Author": "Robert R. Haupt Jr.", "ReviewID": "R3SZWDR822I66H", "Overall": "5.0", "Content": "If this is the last of the Plasma TV I got a really good one. Better picture the the 50 inch led Samsung that a friend has and he paid way more. 3D is pretty good, and the Smart TV systems is the best out there right now. The picture is absolutely the best I have seen for a plasma and any led, lcd, etc... Price was great and the free shipping/delivery was good as well.", "Date": "March 26, 2014"}, {"Title": "Awesome TV!", "Author": "Sheri Blanchard \"strikes301\"", "ReviewID": "R14FGO0I99LK3G", "Overall": "5.0", "Content": "I have only had this TV for a few weeks, but so far I love it. It has so many features I haven't had a chance to figure all of them out yet. The set up is super easy. I hooked up a Samsung Blueray player and it set up the player by itself and the TV remote set up for the player right away. I didn't have to do any set up for it. When I was done watching the movie and turned off the player, the TV went back to the TV mode by itself. The 3D also works great. It is super easy, you just push a button on the remote.I also have a Samsung phone and when you use the mirroring feature, the TV shows what your phone screen looks like right on the TV. Pictures, videos, games...what ever is on the phone screen shows on the TV right away. The pictures are super clear. I was amazed how easy and well it works.I would recommend this TV to anyone looking for the best.", "Date": "March 26, 2014"}, {"Title": "Looks Great", "Author": "BXC", "ReviewID": "RYZMCLHW4JDAQ", "Overall": "5.0", "Content": "I drive myself nuts when i start researching products due to the fact that everything you look at has good and bad reviews.If it has a preponderance of good reviews it's probably good. There are always folks who could either get a bad product, are VERY particular, or don't understand how to use the product.  I chose the plasma over LCD (LED's are only the back-lights BTW) because of superior black levels, off-axis viewing (never darkens no matter the angle) and lack of motion blur.  Modern plasmas don't use a ton of energy or act like space heaters as much as they used to.  Folks also complain about plasma not being that bright are fooled by showroom floor displays. These TV's on display are in huge bright rooms and are all cranked up on vivid setting; something you'll never do at home.  This tv is more than bright for an average home especially if you watch mostly in the evening. Sure the screen is glossy so you have to be careful of window and light reflections.  My old Sony Wega CRT had a glossy flat screen glass so it was nothing to get used to.  The speakers aren't bad as some would suggest either but i did upgrade to a Vizio 38\" sound bar with sub soofer. For $158 at Walmart it's probably the best bang for the buck out there confirmed by my reading and listening. Again, it's a lot different, and better, in your own house than a loud big-box store.  I've seen many LCD/LED tv's and i think i made the best purchase.  Get one before Samsung stops making them like everyone else did.", "Date": "March 23, 2014"}, {"Title": "best for buck", "Author": "Jared F Colleps", "ReviewID": "R30OUSMXQXCEVF", "Overall": "5.0", "Content": "I'm not writing a big review.  It's probably one of the best tvs for the price.  Will hold value until the new 4ks and what not are affordable.", "Date": "March 18, 2014"}, {"Title": "Great Picture and value", "Author": "josh sprouse", "ReviewID": "R2Q7NKKZ8ZYNIT", "Overall": "5.0", "Content": "I choose plasma for its low price and high refresh rate. I choose this specific TV for its mix of price and quality. I debated whether to go witha smart TV or not and I am glad that I choose the smart TV with 3D only 150 more than a comparable Samsung model with no smart or 3D. The 3D function is OK, using the built in converter for non 3D content. The smart hub is pretty handy, with Netflix, Hulu, Amazon Prime, and many other services preloaded, just sign in.  I was glad to see how light and slim the TV is.  I use it for gaming and movies mostly and have yet to be disappointed. Can't wait for next football season.", "Date": "March 18, 2014"}, {"Title": "OUTSTANDING TV FOR THE PRICE", "Author": "Lawrence J Lawson", "ReviewID": "R2L18JAXHN8X5W", "Overall": "5.0", "Content": "Outstanding Picture.  Easy to setup. Menu functions are easy to use. This TV has numerous capabilities. I really like using the internet in the comfort of my bedroom.", "Date": "March 13, 2014"}, {"Title": "Amazing TV", "Author": "DroidX user", "ReviewID": "R1J5XTLOHZN2F2", "Overall": "5.0", "Content": "Great tv for the price! The remote could be a bit more user friendly. But the picture is amazing and the smart hub is Awesome! Using your s4 as a remote and playing music and videos and pictures is easy and convenient!", "Date": "March 10, 2014"}, {"Title": "Great price on a 60 inch Plasma TV", "Author": "Mark M.", "ReviewID": "R7A6KPME6ZG2Z", "Overall": "4.0", "Content": "It's a great TV for the price. My main complaint (I only have 3) is that sometimes faces seem washed out. This seems to happen more often with news reporters on remote broadcasts. The faces are missing subtle details and this makes them look flat. I made some adjustments in the settings and it is better. The problem hasn't gone away but I notice it less now. Otherwise, colors and details are spectacular. I got it just before the Winter Olympics and I'm glad I did. 3D is fantastic. I watched Avatar in 3D and was blown away. The TV will convert 2D to 3D with surprisingly good results.  My second complaint is that the screen is very reflective. This doesn't concern me with regular TV watching. The reflection is easy to ignore, and this isn't a deal breaker. At night I have to adjust the room lighting to avoid glare on the screen, especially when I want optimal TV viewing, mostly for movies. The third complaint is with the remote. I like the touch screen generally, but it needs to do more. I reprogrammed an old Harmony remote that I forgot I had, and it works ok, but I still find myself juggling remotes with the TV, receiver box, and audio receiver. I like the smart TV features. I had Netflix already on Apple TV, so I haven't used it on the Samsung. I like that it has Amazon Prime. It has Hulu Plus, but I don't subscribe. The Samsung Apps aren't as extensive as I would like, but there are some gems there that offer some interesting video viewing. I really like that it has a web browser. It's a bit clunky and slow, but you can view web sites of your choosing. A wireless keyboard makes it easier than trying to use the on-screen keyboard. However, on most sites, its easier to use Apple TV and my Ipad for web browsing.", "Date": "March 10, 2014"}, {"Title": "i cant believe how cheap this tv is!", "Author": "Roman Tylman \"big shaft\"", "ReviewID": "RAUD292BJ2OSB", "Overall": "5.0", "Content": "i owned my 50\" pn 8600 series for over 5 years now and when time came for our new living room i didnt hesitate on this 5500 51\" , and honestly i am so impressed with it even expecting it to be not as good as 8600 flagship. picture quality is outstanding obviously it cant compete with 8600 but its really close. sound is way better on this one but i use samsung soundbar so its not really importatnt. internet is nice , wifi is hot , picture quality is just too good for the price - really! you would have to spend double the cash on led to get in the similar picture ballpark. love remote unlike most users , found it to be extremely easy and fun to use. 3d is not for me due to glasses but my son loves it. reflection is the only thing but hey its plasma , if you dont like it dont buy it , easy to deal with , you cannot buy better tv for less money , you simply cannot!!!pros: everythingcons : nothing , slight reflection but cant compare to my 8600 because its in the basementlove it!!!", "Date": "March 8, 2014"}, {"Title": "Its big and looks great", "Author": "Fernando Luiz Rodriguez", "ReviewID": "R108GF5X1J03AY", "Overall": "3.0", "Content": "It is what I expected. I do not use any of the smart apps or wifi features this tv came with but its nice it has them i guess. I have had this for little more than half a year now and the one thing I noticed is that you can hear a buzzing sound from the screen. Plasmas still have burn ins so dont expect things have changed. I thought it wouldnt but it does. It has features to stop the burn in images but that is only when you are watching live tv. If you switch to the hdmi inputs half those features dont work anymore. So that sucks.When turning the tv on with the remote, from time to time the tv would not respond. the tv red dot would blink a few times like saying it failed or something. So I had to keep pushing the power button on the remote and wait for it to finally turn on. That pissed me off the most.", "Date": "March 1, 2014"}, {"Title": "3d plasma", "Author": "joseph r. wolf", "ReviewID": "R2UM5TH6RSCA4Q", "Overall": "5.0", "Content": "this is another quality item from Samsung. they have become one of the top names in the electronics field. great picture and free glasses. highly recommend.", "Date": "February 28, 2014"}, {"Title": "I like it!", "Author": "Thomas R. Andries", "ReviewID": "R3BO89U6PGTUB4", "Overall": "4.0", "Content": "Overall am satisfied with this item. However, am disappointed that this TV has no AV outputs or front panel inputs of any kind. Also, the screen is so reflective it picks up the image of almost every lighted item in line of sight. On certain programming, the background sound drowns out or distorts the dialogue to the point where it becomes almost unintelligible. All in all though, a very high quality TV: outstanding picture and impressive 3D capability.", "Date": "February 27, 2014"}, {"Title": "A dream realized", "Author": "Barbara.boxoffice \"ponygirl\"", "ReviewID": "R29R0M7Q30R6F0", "Overall": "4.0", "Content": "I waited a long time to purchase my flat screen Plasma, Smart TV by Samsung.  I'm thrilled with the quality of picture and the fact that everyone loves their Samsung, including me.  The only thing is that it's a bit complicated to learn.  I am not as technical as I should be to operate it.  I should have checked out You Tube to see if there was a video to show one how to use a Smart TV and not seem so incapable of operating it.So, if I have any problems, it's not the TV, it's me.", "Date": "February 18, 2014"}, {"Title": "So glad I went this one.", "Author": "mr.m", "ReviewID": "R1UQ5SW552QI43", "Overall": "5.0", "Content": "I had gotten a LCD or LED (can't remember now) a while back and there was a bit too much ghosting for my 3D perfectionist world. Finally did a bit more research and found that plasma is the way to go for visual perfection. Don't get me wrong, the other worked and would have been adequate. But this one was worth saving up for a bit longer. Stunning visuals, it's like being in the theater. Very content.", "Date": "February 16, 2014"}, {"Title": "Great value easy set up", "Author": "Jonathan Sartini", "ReviewID": "R2MDX343UDLS21", "Overall": "4.0", "Content": "This TV is exactly what we needed but not everything we could ever want. In other words, it's an older model with outgoing technology in terms of features and capability but it works very well, has simple easy set up and actually works as advertised. 3D it's fun but gimmicky and rarely used other then to show guests \"hey look... 3D\". This TV costs less with it then newer models without. Recommended.", "Date": "February 14, 2014"}, {"Title": "Excellent! Perfect basement TV", "Author": "ty milner", "ReviewID": "RBTO03URJHOLJ", "Overall": "5.0", "Content": "Love this TV.  Picture quality is better than any LCD TV I've owned. Smart features are neat and simple to use.Make sure to watch in a dimly lit room, glares from outside windows can be annoying sometimes. (I will be putting this in the basement of my next home)", "Date": "January 20, 2014"}, {"Title": "Beautiful when playing game and watching movies.", "Author": "TD", "ReviewID": "RL92LCDCSXRSP", "Overall": "4.0", "Content": "This is my first 3D plasma TV. The picture is beautiful when playing game and watching movies.  When they deliver it to my home  they had to take it out of the box and expect to make sure there was no scratches on the screen and power it on before they left. A great buy.", "Date": "January 19, 2014"}, {"Title": "My Best TV!", "Author": "Thomas L. Mokros", "ReviewID": "R31YMVF8HQBT3Q", "Overall": "5.0", "Content": "I like everything about this TV. The size, clarity, and smartness are its best attributes, but I also enjoy the 3D capability.  Very happy.", "Date": "January 16, 2014"}, {"Title": "great tv", "Author": "Sophrath ket", "ReviewID": "R2MUP8G4QA0MW", "Overall": "4.0", "Content": "bought this for my uncles family for christmas. they loved it. i still love the plasmas they tend to last longer then lcds", "Date": "January 16, 2014"}, {"Title": "Picture quality is great.", "Author": "nnachos", "ReviewID": "R156K2169MMBQA", "Overall": "5.0", "Content": "So far we have loved this purchase. Nice clear picture. Samsung Smart Hub feature allows you to access your online movie subscription sites; internet sites etc. In the past I have always had a hard time getting my DVD player to work through the TV, but with the remote provided, it makes finding the DVD connection easy. Haven't even used all the features on this TV yet, but we are thoroughly enjoying it and the picture quality.", "Date": "January 11, 2014"}, {"Title": "Excellent TV for the price.", "Author": "Steve Kilby", "ReviewID": "R337IADLQB9BVD", "Overall": "5.0", "Content": "TV was delivered as described and in good condition.  Have enjoyed the product especially at the price.  I would recommend this TV for anyone who wants to have many features, but not wanting to pay an excessive amount to own it.", "Date": "January 10, 2014"}, {"Title": "Plasma all the way", "Author": "Aldo Molina", "ReviewID": "RCOV7MIN1XZ9N", "Overall": "5.0", "Content": "I had my doubts about the newer plasma TV's but this one is actually better than I thought. Even compared to the panasonic viera series, it's an awesome picture and the colors are amazing. Truly satisfied with my purchase.", "Date": "December 30, 2013"}, {"Title": "outstanding  television", "Author": "buffy", "ReviewID": "R7H3PS2RUHD7E", "Overall": "5.0", "Content": "Love love this television great picture 3D is outstanding voice controlled works great love this television look at many feel I made right decision", "Date": "December 29, 2013"}, {"Title": "Great TV", "Author": "sue", "ReviewID": "RU5HO8KHXST1T", "Overall": "4.0", "Content": "Love the TV. Wish my wifi was better so we could take advantage of the internet connection but picture is beautiful, delivered on time and they even set it up for me. A lot better than schlepping the huge thing from the store!", "Date": "October 2, 2013"}, {"Title": "Samsung smart TV", "Author": "Kay Stiles", "ReviewID": "R1795G37RQI4J3", "Overall": "5.0", "Content": "We are still figuring out everything this TV is capable of doing even though it will tell you what to do next.  Great picture too.", "Date": "July 31, 2013"}, {"Title": "pn60f5500", "Author": "RC", "ReviewID": "R2TAOMXH8J7Z7A", "Overall": "5.0", "Content": "Wonderful plasma tv for the price loaded with a lot of features And apps through samsung.I would recommend this product to anyone .", "Date": "July 15, 2013"}, {"Title": "Wow Factor!!", "Author": "Derrick L. Price", "ReviewID": "R18CYDTBNA3T86", "Overall": "5.0", "Content": "Great set for a great price. Left me with the wow factor. 2D & 3D both look great!! PS3 games look 100% better. I upgraded from a DLP to a 3D Plasma and the picture/color is 100% better. Only changes need would be a larger remote and the sound is just okay. Had to purchase a Samsung sound bar to get the full affect of the 2D/3D experience. Sound bar cost another $350, but the setup is great.", "Date": "July 1, 2013"}, {"Title": "We love it!", "Author": "Irene Monique", "ReviewID": "R2VD43VXX56PR1", "Overall": "5.0", "Content": "This tv is my husbands baby. But we all enjoy it as there is a little something for everyone. Having Netflix and amazon at our fingertips is priceless. Basketball games have never moved so swiftly on screen. This tv has definitely made for a happy hubby! :) Glad we bought it.", "Date": "June 23, 2013"}, {"Title": "Great TV", "Author": "SlowRide", "ReviewID": "RYG4MTL2NNMG9", "Overall": "5.0", "Content": "This is my first plasma tv. I really like the colors, just beautiful. The viewing angle is much wider than I was led to believe. I can see it fine from nearly 90 degrees to the side. It works great with lots of options. The remote has a touchscreen like a smartphone to navigate that I like. The only complaint that I have is it doesn't have a \"soft\" mute and neither does the Samsung soundbar.", "Date": "December 24, 2013"}, {"Title": "Unbelievable", "Author": "John Spinosa", "ReviewID": "R3NN29U53OGLU6", "Overall": "5.0", "Content": "I have 4 Samsung TV's but this one is so much easier to operate and the picture quality is fantastic. Great buy great price. Delivery system \"pilot shipping\" did not deliver as promised and Amazon didn't follow through as they promised. I wasted a whole day waiting and noting came. Once pilot shipping came the set was very good. I was promised compensation from Amazon but as of now nothing", "Date": "July 27, 2013"}, {"Title": "Just AMAZING 3D", "Author": "FastFreddie \"Tattooz\"", "ReviewID": "R3GH8L7D7LMQA4", "Overall": "5.0", "Content": "I used a BD-C6900 Samsung 3D blu-ray DVD player as the 3D source and viewed Hugo 3D and the snow looked as if it were falling on my feet!  Wreck it Ralph and the Avengers also were pretty spectacular as well.  I am not so sure about the \"smart\" voice remote yet, but the plasma is stunning!The glass is very reflective!  I would have to have some very good curtains to block out the bright sunlight reflecting from the screen.  Other than that this was/is a great buy for the size and features.  I am NOT anywhere near a videofile, so pleasing me might be a lot easier, but there were no dead pixels, no video/contrast adjustments needed.  I will do a video fine tuning this summer, but I only expect to be tweeking (minor adjustments).", "Date": "April 30, 2013"}, {"Title": "Why would I rate this 3/5?", "Author": "Ryan Platt", "ReviewID": "RJGYSPHBL594F", "Overall": "3.0", "Content": "First of all, I must say that this TV isn't bad for the price... the emphasis though is on \"for the price\". $1200 for a 60\", with 3D capability, is unheard of! But if it had cost several hundred dollars more like other TVs in it's class, I would have rated this only 1 star. Here's why...When I ordered this TV from Future Shop, I told everyone that it impressed me in the store, and reviews were mainly positive, but what worried me was that the price was \"too good to be true\". Turns out it was.This TV impressed me MUCH MORE in the store, where they were showing the special, ideal Samsung-approved content, than it did at home. Once at home I played \"typical\" content, I was disappointed. I tried various material, including both the 2D and 3D versions of Avatar, which is a very good-looking movie - normally considered good \"demo material\" for a new TV.Picture quality while watching video/film on this TV is actually pretty good, but anytime graphics or text are displayed, and even sometimes during bright scenes in a movie, there is a pronounced \"dotted\" or \"criss-cross\" effect on the screen (hard to describe). It is likely a result of the \"Pentile\" pixel matrix that this TV uses, which is controversial and some have complained about. Keep in mind I only sit 6 feet away from my TV, while most people sit 9-10 feet away. At 9-10 feet is's possible this wouldn't even be perceived. Anyway, this visual effect really bothered me about this TV.Something else worth mentioning... and this is likely one of the ways Samsung was able to price this TV so low... is that the build quality is terrible!! When I attached the stand (not an issue for some who wall-mount the TV), I found that the parts are all PLASTIC, not sturdy metal as would be expected on a TV this size. I was very careful to attach the stand properly but still, the TV actually LEANS a little. It is not even standing straight! It's only a slight lean (some wouldn't even notice) but it makes me nervous. I seriously fear that if someone were to throw a paper airplane at this TV, it might fall over! And plastic can snap - it's not strong like metal. Perhaps the TV is more sturdy than it seems, but the fact that it leans, combined with those cheap-looking plastic parts, worries me.Another way the poor build quality was apparent to me was when I was hooking up my HDMI cables. One went in smoothly. Another went in, but I had to work on it for a few seconds. The third, just wouldn't go in! I carefully looked at both the cable as well as the HDMI port on the TV, and both \"looked\" fine. This same cable plugs into other devices just fine. After about 3 minutes of careful wiggling, and finally a bit of force, I was finally able to connect it. NOT very encouraging, Samsung!! It should NOT take 3 minutes to plug in an HDMI cable!!!Finally onto the 3D performance. Well, the reason I had bought this TV was because I had just bought a Sony 60\" LED 3D TV, and was happy with everything except for the 3D picture (the Sony uses passive glasses, while this Samsung uses active glasses, which provide a sharper image than passive). In the store this TV looked phenominal in 3D, but again that was with the Samsung-approved content that wa showing on the TV, which is a very bright image, colourful, perfectly balanced contrast, etc. After trying out the 3D at home on this Samsung, I found the picture to be far too dim. During 2D viewing, I had previously noticed that the cell light (backlight) was only set at 12/20, so I went to increase it, and found that it was set at 20/20. Yes, apparently this TV automatically increases the cell light when displaying 3D content. That much is a good thing, as active-shutter 3D glasses are always prone to the \"dimming effect\". Unfortunately, even a setting of 20/20 on this TV is not adequate. I had read in other reviews that people complained about this issue, but I dismissed it since I was going to install it in a near-dark room with no windows. Well, as it turns out, this TV is not even adequate for my dark room setting! Another thing I found was that the cross-talk (ghosting) that sometimes happens with 3D was actually worse than the Sony TV was with it's passive glasses. When I viewed the 3D in the store on this Samsung, one thing I noticed was that there was no cross-talk at all. But again, that was the perfect, ideal Samsung video that was looping on the TV.One thing worth mentioning is that the 3D glasses for this Samsung TV (and I believe all 2013 models) are extremely lightweight. They are so light, in fact, that they could easily be mistaken for passive glasses (which have no electronics built in).So, I have decided to keep the Sony, even though it costs $800 more, and return this Samsung. But I am still rating this TV 3/5 stars because considering the price, it is pretty impressive. That of course is assuming that the TV isn't going to break down in a few months. The poor build quality is something worth noting, and deciding whether to take your chances or not. Perhaps purchasing this with an extended warranty would be a good idea.", "Date": "July 12, 2013"}, {"Title": "Great TV at a great price", "Author": "Thomas Oliveri \"IT/Tech Guy\"", "ReviewID": "R6IJOQACSJ7BF", "Overall": "5.0", "Content": "Overall great picture quality - best TV in its price range.  The screen is very reflective, so not the best fit for a room with many windows.  3D glasses are inexpensive too, and the standard glasses were a good fit even for my 5 year old.  Cool remote too.Amazon delivery was good.  The driver was alone so I had to help him to unbox it safely, but it was no big deal for me.", "Date": "May 24, 2013"}, {"Title": "...better in picture quality.....", "Author": "Richard Strickland", "ReviewID": "R27W9GZO2RD6J1", "Overall": "5.0", "Content": "than I expected.  I was watching a smaller excellent Panasonic plasma.  I still have not mastered the \"smart\" yet in detail, but what I need to accomplish is most satisfactory.  For picture quality there were no adjustments needed from the initial picture straight out of the box.........most pleased, so far.................best to all.................rs", "Date": "January 31, 2014"}, {"Title": "Man Cave feature piece", "Author": "Christopher T Newton", "ReviewID": "R3QGK9F3TCWSMF", "Overall": "4.0", "Content": "Great TV remote stops working have to remove battery a put back in on occasion to keep it working... Didn't realize you needed batteries for Glasses.", "Date": "January 2, 2014"}, {"Title": "The plasma choices are dwindling and we like Samsung", "Author": "Healthnut \"Daily walker\"", "ReviewID": "R3N6BKHI9BCSX0", "Overall": "4.0", "Content": "This is our second Samsung plasma HD set.  We also have an older top of the line set and this model at least to my eyes this set has just as good a picture.  The setup was dead easy, adjusting the picture seemed simple to me and in the 3 year between this set and our other one, the internet features have made some progress.With that said, there are a few caveats.  The sound isn't good at all and a soundbar is a necessity.  While the internet features have progressed, they're still rudimentary.  And although you can use the WiFi alternative, to get any good internet speed, I'd recommend using the Ethernet option.  One thing that may be a problem for some is the reflection from plasma screens.  Depending on where the set is used, this can be a problem.  We have each set facing away from the windows and the picture is definitely better is dimmer conditions.We've only had it for a couple weeks, so I can't speak to durability, but our other Samsung is still functioning, so I'm hoping for the best on this one as well.", "Date": "December 4, 2013"}, {"Title": "Great Choice after much research", "Author": "Donald R. Silverman", "ReviewID": "R2X62T2QKTKT3H", "Overall": "5.0", "Content": "It is meeting every expectation.  Fantastic picture.  I hooked it up with my 5.1 system, which includes a 12 inch powered sub-woofer, and movies, particularly from my Blu Ray player (Sony) are real theater quality.  The 3d works well with the powered glasses.  Highly recommended", "Date": "August 19, 2013"}, {"Title": "Amazing!", "Author": "Nancy Samantha Aguilar", "ReviewID": "RGC5EHQ7GDECW", "Overall": "5.0", "Content": "This smart TV is the most amazing TV I have ever owned and we could not pass on the price!  We feel we got away with stealing!", "Date": "July 7, 2013"}, {"Title": "Awesome TV for the price", "Author": "M. Schmidt \"fallen dust\"", "ReviewID": "R161M1GRL8V56G", "Overall": "5.0", "Content": "I've wanted a plasma set for a long time now. The picture quality difference of a plasma vs. LCD was the biggest factor for me, and to get a PQ the same as this set would have cost me at least double getting an LCD TV. I jumped on the one of the last Amazon Warehouse Deals left before they were all gone, and I ended up paying right around $1K for it. It was well worth it and then some.Picture - While obviously not as good as the high end 8500 series or the VT/ZT series from Panasonic, I absolutely love watching sports/action movies on this samsung. Watching movies on this TV compared to my LED was like going from standard definition to high definition all over again. Great black levels, vibrant colors, no motion blur. Yes, the TV reflects during the day. After reading reviews on the TV, I knew to expect this. The TV is currently set up in a living room with quite a bit of natural light during the day. We just close the curtains and change to TV mode to standard or dynamic for daytime viewing. For me, it's a very small price to pay for a huge gain in picture quality. At night (most of our TV viewing), we set it to movie mode and can't get enough of it.Eventually it will be put in a basement and reflections will not be an issue.3D - I know a lot of people do not like 3D, and I understand why. For me, I really enjoy the viewing experience. I don't get headaches like a lot of people, and like to feel in the middle of a movie. Watching Avatar in 3D (not a great movie, but the 3D is the best I've seen) was just like being back in the theater. Also played Mortal Kombat in 3D, and the interactive backgrounds help you feel immersed in the game. TV came with 2 sets of 3D glasses, and we will be getting a few more for when family/friends are over.Smart Features - Can't give you an opinion on the smart features, but there's plenty of reviews on this already. I don't have any need for a smart TV, I use my PS3 for pretty much everything (gaming, Blu-Ray, 3D Blu Ray, Netflix, Amazon Instant, etc.) and all of those Apps work great. I will never use the smart features. If I needed them on a secondary TV I'd much rather buy a Roku/Apple TV/Amazon Fire as all of those are much more reliable than most apps on smart TV's anyways.Sound - Honestly haven't turned the TV speakers on. I haven't used TV speakers in years, and I can't stand the way flat screen tv speakers sound.I'm sad to see that Plasmas are being phased out, but glad I got a really good one before they're gone. I wanted a 60\" TV, with really good picture quality and 3D for under $1K. If I had the money to blow, I would have gotten a VT or ZT series from Panasonic, but for my price range this fits my needs perfectly. If you don't care about 3D and have a really really bright room this would not be a good choice. But for the money, the picture quality is outstanding, and that was my main concern in buying a new TV. 4K tv's are pointless with no 4K content available, and OLED are still way overpriced. This should hold me off for a few years until OLED tv's are much more reasonable in cost.***I know that this has a pentile display which has scared off some potential buyers, but unless you are 2 feet away from the screen you will not notice it at all. I sit about 10-12 feet from the screen and you can't see the difference at all.", "Date": "June 4, 2014"}, {"Title": "It is a great TV especially for $849.", "Author": "k. couchman", "ReviewID": "RT4JG6JQF8Y3C", "Overall": "4.0", "Content": "I only gave it 4 stars because it is complicated to learn everything it offers.  It may not seem complicated to others, but to me it is.  The picture is great, sound so-so. The one thing I am disappointed in is the lack of a camera to Skype with.  The problem is that the information about the TV doesn't go into detail about exactly what some features are lacking.  It is like the 64 inch model & said has most of those features.  But that didn't say which ones are not included.", "Date": "June 4, 2014"}, {"Title": "Chose carefully, very pleased with this one", "Author": "Peter", "ReviewID": "R1LKLTYH2V8BOQ", "Overall": "5.0", "Content": "I bought the Samsung PN60F5500 for a basement media room.  I read very many reviews including much more technical ones elsewhere besides Amazon.  I actually considered and rejected the projector path, because I concluded that it is possible for a picture to be so big/close that it can be a strain to view.  I opted for plasma vs. LED, because it is a basement room, and we mostly watch at night -- so light control is good, and the plasma image quality is supposed to be better.  I went for this Samsung model because it appeared to be a great value, weighing price point vs. size, features and reviewed image quality.  In summary:  The 60 inch size is perfectly adequate for a 25x25 room with about half of that as a primary viewing area.  I use the optical output to feed a separate satellite sound system, which of course sounds great.  However, the singular purpose in selecting this TV was for image.  I found and used calibration settings from some of those technical articles.  I am not a digital imaging expert, I think the image quality is just great, and feedback from everyone else has been entirely positive.  Great sharpness, great dynamic range, and good deep blacks.  Fast action on the screen seems completely seamless and natural.  The nice new TV in the media room has had an unexpected benefit:  While we have been fans of going out to the movies, my wife and teen are now opting to catch most movies at home, sprawled on the big recliner sofa in comfortable to below-casual attire, where you can pause the action to take a break.  Given today's movie ticket prices (D-Box, 3-D, VIP) and prices for upscale food offerings, this TV may actually pay itself off  in a year or two!", "Date": "May 23, 2014"}, {"Title": "Great TV", "Author": "bear", "ReviewID": "RVNO8FJBQPOP5", "Overall": "5.0", "Content": "This was a buy after returning a higher end model. The best move I did as this TV does everything the other did at a lower price.", "Date": "May 23, 2014"}, {"Title": "Good Value", "Author": "Peter Giambrone \"immersive guy\"", "ReviewID": "R33XCTXCWAXH5U", "Overall": "4.0", "Content": "Given what I paid for this unit, I would say that it is an decent value. The image quality is superior to LED & LCD type televisions and the unit is relatively easy to set up. I'm not crazy about the remote control and the steps to configure it as a universal remote, but it's something I can live with given the overall quality of the tv.", "Date": "May 19, 2014"}, {"Title": "5 star tv..2 stars insurance protection offer", "Author": "Juiderka Fernandez", "ReviewID": "RDP93K5K237TS", "Overall": "4.0", "Content": "I have only had it for 2 months but so far is very good. The picture quality is perfect.  Would of given it 5 stars but disappointed with the insurance protection offer, expected more from company and amazon..", "Date": "May 5, 2014"}, {"Title": "Love this TV", "Author": "Lifeiscool22", "ReviewID": "R3D6282XI22GE1", "Overall": "5.0", "Content": "I got this Smart TV after doing some research I like the Plasma over the others and this fit perfectly. Easy to set up especially after I read the reviews and wanted to have a wireless connection  I got the google chrome wirless adapter. It was so simple and easy to set up I couldn't believe it. The picture is awesome and the 3d is wonderful. If you have kids with games you may want to get the upgraded model as it offers more connection for other things you want to  play. For the price of this TV for me and my family it is a great buy.", "Date": "May 3, 2014"}, {"Title": "Awesome TV", "Author": "GSWillhite", "ReviewID": "R3D98SU73ZNO28", "Overall": "5.0", "Content": "I really like plasma TV's and when I found this in 3D, I had tohave it. Awesome 3D viewing! Many friends and family membershave commented on how it's almost like watching an IMAX.", "Date": "April 22, 2014"}, {"Title": "nice tv", "Author": "Samuel mosley", "ReviewID": "R34QWFCJ1W3B8T", "Overall": "4.0", "Content": "slight buzz noise and high reflection so best in dark room,but does look much better than most equivalently priced contemparary led tvs", "Date": "April 22, 2014"}, {"Title": "3D glasses eat batteries", "Author": "Corey Croaston", "ReviewID": "R22DHSHFDNM1ZB", "Overall": "4.0", "Content": "TV functions great. Picture quality is also great. 3D glasses, batteries don't last through a movie. Make sure you order alot of extas.", "Date": "April 20, 2014"}, {"Title": "For $850, the PN51F5500 is a steal!", "Author": "Tim T.", "ReviewID": "R836LJNGZW9DY", "Overall": "5.0", "Content": "I have only had this TV for a day now; I am quite pleased with it.Black levels are fantastic.Color accuracy is superb. (With a little tweaking.)Do keep in mind a couple of things.  As with most plasma TVs, you will want to break it in with about 100 hours of continuous viewing.  If you are viewing Blu-Rays or Netflix (Hulu as well), watch it in zoom to avoid burning in the black bars vertical or horizontal bars.  If you are viewing cable television, either avoid channels with a logo or ticker or just zoom as you would with the movies.My conclusion, do not pass this TV up.  You will not regret this purchase!", "Date": "April 18, 2014"}, {"Title": "Great TV at a Great price", "Author": "Ed", "ReviewID": "R341U58MSGLY9I", "Overall": "5.0", "Content": "This TV does everything it says it does and more with all the Samsung Apps available. I was able to connect my Samsung Galaxy Tablet to it and use it as an additional remote that also provides me with a TV guide. This is accomplished with a free App on the Tablet. The only thing I was a little concerned about was the reflection on the plasma screen. If your TV is placed in an area where there is a bright background, this might reflect on the screen and might be a bit disappointing, otherwise, it's an amazing picture.", "Date": "April 18, 2014"}, {"Title": "No Surround Sound from SMART TV Connections", "Author": "George E. Rainey", "ReviewID": "R3QGVYV4Q7HZHU", "Overall": "3.0", "Content": "Biggest problem for me was not being able to obtain 5.1 decoded audio from Netflix.  The Smart portion of the TV only delivers 2.1.  I now connect to Netflix through my BluRay, to the TV and use an ARC input to my receiver; this works for 5.1 audio.The picture screen reflects everything, so I have blacked out all my windows, and positioned side lighting in positions that will not reflect.  It really does reflect worse than any TV I've had before.The included stand is very insubstantial, and I would never use it for safety reasons; I have kids and cats in the house, and feel they could easily knock it over accidently while using the standPicture is GREAT, although 3D TV has lip synch problems with BluRay and Netflix.  Active glasses need frequent battery replacement.", "Date": "April 17, 2014"}, {"Title": "HDCP not supported", "Author": "Valkyrie Rider \"Dave\"", "ReviewID": "R1JVWOEVLTB1YJ", "Overall": "3.0", "Content": "I have this TV and it worked fine for about 6 months, then I began to get the error message \"HDCP not supported\" and all we got was snow on the screen. Sometimes a reboot would bring the picture back but then after about a month of fighting this we lost the picture all together. I called Samsung support and they told me it was the cable provider problem, so I called ATT U-verse and they told me it was the TV problem. I'm caught in the middle with no HDMI connectivity. I finally had to connect via component and that seems to solve the problem, however this is a new TV and should support HDMI (HDCP) protocol. HDCP is a protocol used to stop people from recording programs, but the only recording we do is with our DVR, so its a mute point. I understand that cable companies have to work with TV manufacturers to make them work together, but in this case they have not and we, the customer, pays the price of them not doing their job. Is it U-verse or Samsung?? Either will admit fault, so we are stuck using component video in a HDMI world! It sucks.", "Date": "April 14, 2014"}, {"Title": "Easy installation. Good performance", "Author": "Delwyn G.", "ReviewID": "RAXR74B8GW817", "Overall": "4.0", "Content": "Unit has excellent picture and works well Has only optical audio out which created some sound system problems. Everything else meets or exceeds expectations.", "Date": "April 13, 2014"}, {"Title": "Beautiful picture", "Author": "Patricia Holly", "ReviewID": "R30Z3Q3RFO4ZF9", "Overall": "4.0", "Content": "Excellent TV. Unaware that it needs additional webcam. Voice control not quite as responsive as I would have liked. Everything else is great.", "Date": "April 13, 2014"}, {"Title": "Good TV", "Author": "john y.", "ReviewID": "R2DBBV7BMRZE6X", "Overall": "5.0", "Content": "Highly rated and rightly so. It has a great picture and decent sound. Would recommend. Got it from Pauls TV and it came quickly.", "Date": "April 11, 2014"}, {"Title": "Love it", "Author": "RJ", "ReviewID": "R37S3L2TRJQ926", "Overall": "5.0", "Content": "Picture and sound are excellent.  Took me a while to figure out  how to find everything with the remote but the Amazon and the Samsung service people were so helpful.  Also the TV was well packed and delivery was incredibly quick.  Overall, a really good experience.", "Date": "April 11, 2014"}, {"Title": "Great TV", "Author": "Russell Bridgewater", "ReviewID": "R33QCTGEHHEM93", "Overall": "5.0", "Content": "I am very satisfied with my new 60\" Samsung TV.  It was easy to set up and my wife and I are enjoying the great picture.  Thank you.", "Date": "April 2, 2014"}, {"Title": "My first tv purchase!", "Author": "Marc A. Lewis", "ReviewID": "R3G829128N7YUM", "Overall": "5.0", "Content": "I love the TV!!! It meets and Exceeds!  It is my first tv purchase Wooot! Big and 3D!!! Also my PC monitor!!", "Date": "April 2, 2014"}, {"Title": "SOLID PLASMA TV", "Author": "john abrahamsson", "ReviewID": "RQ0DGWRAQ68VS", "Overall": "4.0", "Content": "GOOD TV, REMOTE TAKES GETTING USED TO, IS VERY REFLECTIVE BUT THE SOUND IS PRETTY GOOD,THE PICTURE IS VERY GOOD", "Date": "March 29, 2014"}, {"Title": "Great TV - no complaints except that we had to purchase two within a year :)  Thank you 4 year old!", "Author": "A. Currie", "ReviewID": "R6A1IG97U647E", "Overall": "5.0", "Content": "This is our second, yes second, Samsung.  Our first one was 5 months old and met with a matchbox car :(  It was just enough pressure to break the 'vacuum seal' inside the tv.  At first we saw just a little black spider mark in the screen…not on the glass. Over the next two weeks it spread across the screen and finally the picture went out and the sounds went out as well.  We really love the TV and we are hoping this incident (or anything like it!) does not happen again.  You will want this in a place away from where flying anything can hit it.  It's sensitive.  There was not a scratch on the glass….but somehow it affected the picture behind it.Accidents happen and unfortunately, our extra protection we purchased did not cover this.", "Date": "March 26, 2014"}, {"Title": "could be better, but glad I bought it.", "Author": "Lamar jordan", "ReviewID": "R1S6O6GCDY65W6", "Overall": "4.0", "Content": "The internet browser is slow. The 3d glasses batteries drain fast. The remote control is ok, but not user friendly for web browsing. The picture quality and 3d is awesome.  I am glad I bought the TV, the downsides are not that bad after you get used to them.", "Date": "March 25, 2014"}, {"Title": "I love this TV.", "Author": "Theresa Jackson", "ReviewID": "R16YQVEDMRF612", "Overall": "5.0", "Content": "Arrived on time as promised. Set up was very easy. Beautiful picture, it does have some glare, however, most plasma TVs have glare.", "Date": "March 23, 2014"}, {"Title": "Great Buy!", "Author": "Nicole Stout", "ReviewID": "RV1YQ3EKMEQQA", "Overall": "5.0", "Content": "This tv is beautiful! It's easy to see and I have a bright window directly across the room. The touch screen remote is fairly easy to learn. The interface with the apps is appealing to the eyes and easy to navigate, but paid apps aren't going to work soon... It comes with 2 pairs of the 3D glasses, which I would suggest buying back up batteries for. Bought it as a gift for my husbands man cave and he is so happy with it! He uses the 3D a lot for movies and gaming both. They both look great.", "Date": "March 23, 2014"}, {"Title": "tv is nice but a little glitchy.", "Author": "Kimberly Wessling", "ReviewID": "R1UQ1CU3IIUI7W", "Overall": "4.0", "Content": "Make sure you buy the protection plan. We love the tv but it needs servicing. The screen saver doesn't cover the entire screen. The remote is nice and the touch pad is easy to use.  It has a great picture.", "Date": "March 23, 2014"}, {"Title": "So smart!", "Author": "Caravel17", "ReviewID": "RJBFNFZ2B6KQB", "Overall": "5.0", "Content": "What's not to love about this tv.  Set up was easy, picture is awesome and the smart tv feature is easy to use. There is, as I expected, a bit of a learning curve with the remote but nothing too painful...  Great delivery, guys were accommodating and pleasant.", "Date": "March 20, 2014"}, {"Title": "Our second Samsung plasma and we love it!", "Author": "lil j 78", "ReviewID": "RTK28BXW1IR06", "Overall": "5.0", "Content": "Awesome picture, excellent for our gaming (BF4), great apps, great for sharing pictures, overall a winner and we would recommend  Amazon not only had the best price for the TV, but with the white glove delivery, we didn't have to assemble the stand or dispose of the HUGE box or packaging materials.  This TV is also a Consumer Reports higher rated TV and there is no doubt why.  The 3D is very cool, even when watching a 2D show.  I don't make a habit of doing that, but it was cool to see that we could.", "Date": "March 19, 2014"}, {"Title": "Only had it for a few weeks and haven't learned all of it's features (we are under re-construction). Consumers Reports called", "Author": "Don Carter", "ReviewID": "R1RKIAJ40586IJ", "Overall": "5.0", "Content": "Only had it for a few weeks and haven't learned all of it's features just yet (we are under re-construction). Consumers Reports called this one right. Excellent picture, absolutely love the plasma and lets not forget the very affordable price for a 3D, 60\", HDTV. It arrived on time and the packaging was excellent. Cudos to Samsung for the on-line setup instructions", "Date": "March 17, 2014"}, {"Title": "performs as advertised", "Author": "Joseph OSullivan", "ReviewID": "ROVWPIJ8F1WTN", "Overall": "5.0", "Content": "Was very pleased wit this purchase. Setup was easy, the picture is sharp and clear. I would suggest this product to everyone", "Date": "March 16, 2014"}, {"Title": "Best Ever Samsung Television", "Author": "Sara E Ristano", "ReviewID": "R19UCSW35W7AKW", "Overall": "5.0", "Content": "This television is the best.  I had a difficult time finding it but always dependable Amazon had it and it was exactly what I wanted.  It was rated the best by Consumer Reports and it is the best.  Quick turnaround time.  Packaging was great.", "Date": "March 9, 2014"}, {"Title": "Beats any LED TV for watching movies at night", "Author": "gmoney", "ReviewID": "R5LOVHTDUHMAY", "Overall": "4.0", "Content": "Met all my expectations, but lost a star due to reflections in daytime and auto brightness limiter (only noticeable during scenes with almost all white like hockey games)", "Date": "March 8, 2014"}, {"Title": "great", "Author": "Michael MacNeil", "ReviewID": "R1U55I824HF4PM", "Overall": "5.0", "Content": "simple to set up. great quality picture. I haven't taken time to set up the smart TV options, but they seem pretty cool and I plan to do it.", "Date": "March 7, 2014"}, {"Title": "BEST bang for the buck!", "Author": "B. Barlow", "ReviewID": "R2TMU6TJZ67O51", "Overall": "5.0", "Content": "I purchased this unit in spring of 2013 and now Consumer Reports is calling it one of their Recommended Buys!  I've found the TV has all the right bells and whistles, good SmartTV application functionality, great feature-set, all the performance you want (colors, brightness/darks, refresh rate, resolution, decent speaker volume, etc.), plenty of connection options for connecting both modern (HDMI) and legacy (DVD/VCR) devices, and even the 2D to 3D feature works well for sporting events and automotive racing!My only caution about this TV... make sure its located in a room in your home where you can minimize direct light sources... it does tend to glare if lamps, windows, or other reflective light sources are positioned in front of the screen (or behind you when sitting on the couch)!", "Date": "March 5, 2014"}, {"Title": "Daytime issues", "Author": "gerald mars", "ReviewID": "R1C8L7PFKN7H9Z", "Overall": "4.0", "Content": "I would give it a five but we are having problems during the daytime with the reflections from the daylight ,am considering returningthe unit !! Great picture at night though !!!!", "Date": "March 5, 2014"}, {"Title": "Very Satisified", "Author": "Shawn", "ReviewID": "R1A1OROJDBGRAF", "Overall": "4.0", "Content": "I bought this TV for my bedroom and I couldn't be happier.  It was reasonably priced, easy to set up, decent number of inputs and great picture.  The Smart TV features are great too.  I use the Netflix app quite a bit and it's great that you don't have to use another device to get it (i.e. DVD, XBox, etc.).There are just a couple of things that make me take a star off.  First, the built-in sound is okay but not great.  I will need to buy some sort of sound bar to address this issue.  Not a big deal but annoying.  Second, I really don't like the remote control for this TV.  I use my AT&T; UVerse remote purposefully so I don't have to use the TV remote control.My master bedroom is quite big and I have dark curtains so I don't have any reflections at any time of the day.  I can't comment regarding its use in a room where there is more light.I definitely recommend the TV as its a great bargain and functionally works very well.", "Date": "March 5, 2014"}, {"Title": "After doing research and trying other products, this one was the best", "Author": "disgustipated", "ReviewID": "RWKC1G4WJT5OP", "Overall": "5.0", "Content": "Great picture quality, high refresh rate, and 3d were the most important things to me when shopping. I tried a 3d capable Vizio of similar price. The Samsung has a much better refresh rate and 2d to 3d conversion. The vizio had slightly better picture quality and a better body (stand on the Samsung sucks). I couldnt live without the 2d to 3d conversion so i went with the Samsung. I am very happy with my purchase.", "Date": "March 2, 2014"}, {"Title": "Excellent Smart TV", "Author": "Yevgeniy Desyatnikov", "ReviewID": "R3GRME4PAVTDM4", "Overall": "4.0", "Content": "The picture quality is excellent !!!  The sound is just good, My old Sony Bravia beats Samsung in that department. The software installed is very good, including the interface, web browser,and all available apps...", "Date": "February 28, 2014"}, {"Title": "Easy to set up and use", "Author": "Robert King", "ReviewID": "R2SS1NS0IXJN70", "Overall": "5.0", "Content": "Have had the TV for about a month now and no issues thus far. Very easy to set up and the initial menu you come to when turning on the tv each time is just one remote button away from bypassing. I would buy this TV again.", "Date": "February 25, 2014"}, {"Title": "Samsung 51-inch Smart Plasma HDTV", "Author": "Aradcom", "ReviewID": "RT70PRQ96PE21", "Overall": "5.0", "Content": "Works as advertised.  The 1080p plasma screen is about as clear as any television we have owned.  Along with the crisp images the available internet apps and other browser choices almost replicates a full blown computer with its dual processor.  Using the remote with the on screen keyboard is unwieldy, so a Bluetooth keyboard would be in order. The wireless handshake and resulting through put is excellent.  Besides hooking it to Directv, we use it in conjunction with a PlayStation playing games online and dropping Amazon Prime movies.  Amazon's delivery and notification procedure is spot on, we couldn't have been more satisfied with the purchasing service.", "Date": "February 20, 2014"}, {"Title": "Awesome picture for the price!", "Author": "S & L", "ReviewID": "R30RX36J8LCFVO", "Overall": "5.0", "Content": "I researched televisions until i was almost nauseated.  I kept going from LED back to plasma.  I currently have a 50\" Samsung plasma in the living room for about 6 years now.  We really like it, the glare is not bad for us, etc.  So for the man cave, I ended up going with this smart version of the Samsung plasma in 60\".  I can't be happier with the picture.  It streams netflix without issue, it has not lost connectivity or anything like that, it just works.  I also bought the Samsung HW-F550 2.1 channel 310 watt sound bar with sub woofer.  They automatically synch, no extra wires, etc.  This combination is awesome for watching normal television like say a \"Sons of Anarchy\" episode or a movie or football game.We have not tried the 3D nor the voice command stuff.  My cable remote controls the tv with no problems and again, the sound bar automatically turns on when the tv turns on and the tv volume is muted.  Can't get any more simple than that.", "Date": "February 17, 2014"}, {"Title": "Great picture, easy to use", "Author": "THOMAS C SNODGRASS", "ReviewID": "R1R32H2BK17JYR", "Overall": "5.0", "Content": "Friends have commented that the picture is better than their other TV brands. The menus are intuitive, and the remote makes it easy to navigate. The sound quality is a bit lacking when watching the Olympics, but it was easy to run the sound through my stereo.", "Date": "February 17, 2014"}, {"Title": "A Smart Purchase...", "Author": "William Jay Marlin", "ReviewID": "RHLTTNIY1IO0P", "Overall": "5.0", "Content": "This smart, HDTV is a bit more complicated than your usual plug in and turn on.  Read the directions.  Everything makes sense.  The produce arrived undamaged and more importantly, within the time frame allotted by Amazon.  I wanted to unpack the product.  Hung the TV in a recessed cove above the fireplace.  Wow!  What a picture.  Worth the price.  Am very pleased.  Would recommend this product to my family and friends.", "Date": "February 17, 2014"}, {"Title": "Good quality and good picture", "Author": "Susan Johnson", "ReviewID": "R173BRU1IQ6U2", "Overall": "4.0", "Content": "I purchased two of these for my volunteer rescue squad and the quality of the resolution is very good. We also planned to mount on a wall and the mounting slots were already in place to attach mounting hardware.", "Date": "February 14, 2014"}, {"Title": "Love this TV", "Author": "Joshua \"mxjoshua\"", "ReviewID": "R3QT21Y2CPPPIZ", "Overall": "5.0", "Content": "I've been looking for a 60\" TV to replace my 6 year old samsung plasma (still working well).  After studying many options I settled on this one. Personally I find the colors on plasma to be more natural than those found on the new samsung LED. I chose this tv bc it had a lot of high end options and the optical out was important to me so I could connect my Bose system.I really like that the universal smart remote can control the tv, the comcast cable box, the Apple TV, the samsung blu ray player, and the Bose home theatre. I was able to put away all those extra remotes and help achieve my minimalist goals. (For those of you who wonder how do connect the Apple TV just add it as a home theatre device under universal remote system menu).My only grip with this tv is that I wish the display were a tad bit brighter. My old plasma seemed brighter. I would rate it 4.5 stars if I could for this.I really also like the built in Netflix app, the vemo app, the amazon prime video app, and the Pandora app. They sound great with my Bose system via the optical out. The vemo videos on this tv is like being at a concert.Hope that helps everyone and for the price this tv is amazing. Also runs much cooler than my old plasma. Pretty thin too!Enjoy.", "Date": "February 11, 2014"}, {"Title": "This tv is capable to where it can almost rate itself.", "Author": "Ed.C.", "ReviewID": "R330DJ6T3GDDUL", "Overall": "4.0", "Content": "While I rate this a four & not a five. I haven't had the set long. All of the things this Samsung smart plasma has that I'm useing are all great. Surely no complaints here.", "Date": "February 11, 2014"}, {"Title": "plasma HDTV", "Author": "P. Rocheleau \"rotties are cool\"", "ReviewID": "R307YRD8B3PU54", "Overall": "5.0", "Content": "this is our first wide screen and we are very pleased.instructions didn't help because i tried settings using an analog DISH TV set-top box.i upgraded to a didgital set-top box and the instructions were simple.i would recommend this unit.", "Date": "February 10, 2014"}, {"Title": "Good TV", "Author": "Ian D. Crawford", "ReviewID": "RL1OHDBYEHGZP", "Overall": "5.0", "Content": "Everything excellent, except sometimes goes into screen saver mode when moving from paused Netflex to normal TV. Missed a stereo audio output for headphones.", "Date": "October 2, 2013"}, {"Title": "Join The SamSung Class Action Suit (DO NOT BUY)", "Author": "Jim Walker \"jwalker99\"", "ReviewID": "RTVDNHI65S6XB", "Overall": "1.0", "Content": "This TV had the best color that I have ever seen. Then I turned it on one day and it would not work. Then  heard a pop/  cracking sound. The dread  BSOD problem  that many other people are having.  This is  a common problem with samsung tv's. However, they would not warranty the item saying that I had hit the tv with something which is not true. When we contacted Samsung  they were awfully rude. Its was worse than dealing with my health insurance company.  All they can say is we are denying your claim. We asked them documentation (ie a technicians report) but they wont provide that.  The glass screen in front is not cracked it is the backlit screen that fractured. So I also  am stuck with a worthless piece of junk.  Its surprising that such a large successful company can be this bad. Anyway, we are starting a class action suit for this issue that 600 others have posted about. If you want to join, please comment to this review.", "Date": "October 23, 2013"}, {"Title": "Good Entry Level 3D TV With Plasma Buzz", "Author": "John Buchanan", "ReviewID": "R3MJQYQIP48PX1", "Overall": "3.0", "Content": "This is a good value. I'm new to 3D and found this to be a good entry level set.What I liked about it includes the cost versus quality. The 'Smart' features on it are decent so I won't have to buy a roku box. It only weighs about 50 pounds (I have the 51\" model) so it is easy to pick up and move around or mount on the wall.Easier to focus on the negative though...Most of my picture/3D quality complaints are with the specific titles and aren't a fault of the TV. For example, some movies they will make it appear as though someone is in the foreground but that person's image will not be 3 dimensional. Some other movies do a much better job with that.Then what couple of minor legitimate complaints I do have with the TV. It is lacking in ports, I have yet to find how to connect a blue tooth headset to it, the touchpad on the remote would be better as typical buttons, and both pairs of 'universal' glasses I've tried don't work with it.My biggest complaint is that it makes a slight buzzing noise. Plasma TVs buzz a little because of how electricity is supplied to the screen. Samsung forums explain that as normal but only abnormal if the buzzing is loud enough to hear from 10 to 15 feet with the TV at normal volumes with a provided screen shot showing the volume set to 50. I found a distance calculator that I sort of agree with that says with a 51\" screen you should sit closer to 5 feet and my hearing is good (my wife might disagree with the comment about my hearing) so I don't usually turn the volume up passed 15. I can hear it buzz. I am only marking off one star for this because it is supposedly normal.", "Date": "January 10, 2014"}, {"Title": "My TV Pick for the Price", "Author": "My opinion", "ReviewID": "RVAKJ6POJHQCT", "Overall": "5.0", "Content": "An excellent TV for a very reasonable cost.  I would certainly recommend it if you are considering thepurchase of a large, flat screen.", "Date": "March 15, 2014"}, {"Title": "love Picture 3D Smart Plasma HDTV, sound hard to hear", "Author": "George R. Zerdian", "ReviewID": "RVHJ7WACY1RBC", "Overall": "5.0", "Content": "We Love Picture 3D Smart Plasma HDTV, sound hard to hear, because the sound is broadcast into the cavity behind the TV.Picture in 3D and 2D are excellent.  tested with my Samsung 3D DVD player.for sound I tried to use my current speakers, but no analog mini headphone jack.SAMSUNG NEEDS TO AHVE AN AUDIO MINI HEADPHONE JACK PUT BACK IN ITS TVs.ordered Samsung Soundbar, but sound (voice and sound) breaks up.reported it to Samsung last week.today reported it to amazon.it is one of three things.  the TV soundshare transmitter, the soundshare receiver in the Soundbar or the Soundbar itself.so I returned the Soundbar today.  should get replacement in a week.  if that also has the voice and sound breakup then the TV needs to be replaced.", "Date": "February 12, 2014"}, {"Title": "Samsung PN60F5500 6- inch Smart Plasma HDTV", "Author": "D. Hildebrandt", "ReviewID": "R1DASDPUZ4YZT7", "Overall": "5.0", "Content": "The picture is exceptional and I could not be more pleased.  With regard to the Smart element of the TV, I still am attempting to be smart enough to operate all the facets.  However in time I am sure I will do so.As of this writing, we think the Samsung is an exemplary TV product.", "Date": "February 2, 2014"}, {"Title": "GREAT DEAL on a super TV", "Author": "Rebecca J. Noell", "ReviewID": "R3ROFRBYBMGKOV", "Overall": "5.0", "Content": "excellent TV  PROs  picture quality,ease of operation  remote  is quirky but pretty simple  when you figure it outCONS.. very reflective finish on the screen (bright sunshine through windows very distracting) but easily fixed by closing curtainsoverall outstanding", "Date": "January 2, 2014"}, {"Title": "Arrived Broken but Amazon is shipping out replacement.", "Author": "Tong", "ReviewID": "R2BXWZNT8796M7", "Overall": "4.0", "Content": "The excitement of my new TV arriving was overcome with disappointment when I powered it up and the screen is broken; rows of dead pixels. The shipper brought it over and due to the snow the box is drenched in water. He opened up the TV box for us. The TV is kind of wet so we were told to wait before using. ??? It wasn't a big deal as the water didn't seem to damage the TV. However, later when I plugged it in, the damage was apparent. I think the TV could have been packaged better for more protection. The shipper should have also taken precautionary measures as well. In any case I called up Amazon to discuss replacement or refund and the process was quick and easy. They will ship out a new replacement at no extra cost and pick up the old one. I thought I would have to ship the broken TV back myself, cost of return shipping, and possibly even charged for the infamous \"restocking\" fee. This is my first expensive return with Amazon and I am pleased with the service. Gives me a bit more confidence in purchasing high priced products in the future. As for the features and quality of the TV, this TV I would assume is great. That's because I owned the same model just a smaller size. If you want bigger screen and can live without the bells and whistle of 3D and Smart TV apps, this TV is absolutely great.", "Date": "January 2, 2014"}, {"Title": "HAPPY!", "Author": "KenL \"Ken\"", "ReviewID": "R1HVZTRAFPI4F1", "Overall": "5.0", "Content": "Great picture and is easy to use out of the box...after attaching the base of course. I love the remote. I replaced a HD projector (10\" screen) for this and am not disappointed at all. I would recommend this set. Was delivered on time also.", "Date": "December 4, 2013"}, {"Title": "Great Plasma TV", "Author": "Nancy Burdick \"P. Burdick\"", "ReviewID": "R2SK4S48EBDZG4", "Overall": "5.0", "Content": "We received our new 64 inch Samsung Plasma TV within the projected time frame.  The delivery guys took it out of the crate for us, set it up and plugged it in to make sure it was working.  This is our first Plasma and we are in love with it.  A beautiful picture and easy to operate plus a great price!  We had a service tech install it for us and give instructions.  We are so happy to we decided on a Plasma 64 inch instead of a 60 inch Led that we originally had planned to buy.  We are planning to purchase a 50 Inch Plasma for our bedroom.", "Date": "October 27, 2013"}, {"Title": "Picture amazing, smart features too sluggish to use", "Author": "Jim Bianca", "ReviewID": "R3EX6ZSHPRNTIL", "Overall": "2.0", "Content": "I expected a great image and this unit has that.  That blacks are so black, it's as if the TV is off when you have a black screen.  I really like that.  That's one of the reason why I deiced to to with this unit.The other reason I went with this Samsung TV was for the hyped up SmartHub.  I expected the SmartHub to be at least as snappy/responsive as my 8 year old XBOX, however, not even close.  SmartHub and all it's functions (including all apps) are so sluggish, it is unusable.  I supposedly have a dual core processor, however, just navigating around the menu responds like a first generation android tablet.Voice commands are even more painful than navigating around the menu.  It's horribly sluggish and takes forever to show results.  On top of that, it usually doesn't properly recognize what I say.  You basically have to speak to it like you do your 90 year old deaf grandmother.  When you finally receive the results, it lists the standard def first, because they are usually the lower numbers on your cable box.  So you have to painfully scroll through the selections to get to HD.  I'm telling you, it is unusable.  Unfortunately, you cannot specify HD when you're making your voice commands.I have also ran across a few bugs in Smarthub.  Bug #1: If you use a voice command, then use your remote to make pick your selection, it gets confused, freezes and shuts down.  Bug #2: After you stream a movie from your computer and go back to live TV, there is a 2-3 second delay between video and audio.  Somehow streaming a movie causes a sync problem with live tv.  You have to shut the unit down and basically reboot.  There are a few other bugs, but I don't want to sound like I'm complaining...SmartHub learning my program preferences is either not implemented yet, or it just doesn't work.  I've had the TV for over  a month and I haven't had one (NOT ONE) program that fits my watching habits.  I'm not trying to be funny, but it seems to do the exact opposite.I've factory reset smarthub many times, deleted unnecessary apps, plug directly into my 60mbps modem, had tech support remotely navigate my unit......and nothing to work.  I avoid Smarthub at all costs.....however, today I signed up for a free 60 day trial of Hulu plus....I decided to go into the APPs section...tried to load the Hulu app and the app says 'critical error'  and complains that I haven't set the clock.  omgIn my opinion, first generation smarthub is much better than 2013.  They need to just keep it simple.Anyway, if you're looking for a great image and think you might want 3-D, this is a good TV.  If you're looking to get into the next generation smart units....I do not recommend this tv.  Use WD live or something.", "Date": "January 21, 2014"}, {"Title": "Great HD TV with two major issues", "Author": "Amazon Customer", "ReviewID": "R2PRB05SQ467H8", "Overall": "2.0", "Content": "This TV is great if you have total darkness and loud audio.If not, the highly reflective glossy screen and low buzzing sound will drive you nuts. I had to return it.", "Date": "December 17, 2013"}, {"Title": "Pentile Pixel Structure = Not True 1080p", "Author": "J. Marquardt \"Digital EDGE\"", "ReviewID": "R188RCXPXJEH1G", "Overall": "1.0", "Content": "Right on the Box it says 1080P \"vertical\". Why the \"vertical\"?Because it still has 1080 lines of pixels vertically. That's great except all normal 1080p tv have 1920 sub-pixles HORIZONTALY per square inch, and THIS TV DOES NOT. It's because of the Pentile sub-pixel arrangement. If you don't know what that means you should google it. Anyway the specs right from samsung say 1080 vertical x 1920 Black and white. And it only says that on the 60\" TV, the 51 inch and the 64 inch are standard RGB stripe pixels (not Pentile) which look great.Look at this TV up close and you will see all the dead space and honeycomb looking structure it looks as if your watching through a screen door, from a distance it looks okay but still not very sharp, more like a 720p TV.Stay away from this unit it's not True 1920 x 1080!According to samsung.com/us website, the 60\" PN60F5500 is Pentile:Native Resolution: 1,920 x 1,080 (Black & White)Resolution: 1080p Vertical[...]", "Date": "October 21, 2013"}, {"Title": "Great TV", "Author": "Frank Doerner", "ReviewID": "R1M5XDLT2UICOL", "Overall": "4.0", "Content": "Great picture.  But not sure the 3D is worth it.  We still trying to figure out how to use the 3D.  We bought the Wizard of Oz in 3D, but it doesn't look very good with the 3D.  Maybe it's because the movie was not created with 3D in mind.  But we didn't buy it for the 3D - we bought it for the great standard picture and are very happy with it.  It's our first Smart TV and we are still learning how to use it well.", "Date": "January 12, 2014"}, {"Title": "A great replacement.", "Author": "William Goodman", "ReviewID": "RFQWH4526GY7P", "Overall": "5.0", "Content": "My wife managed to wipe out our 59\" Samsung all by herself; it was not quite 2 years old, but I told her the screen was starting to get a little dirty. She really was upset. In all fairness maybe it was better for us because that one ran very hot & in the 2 years they did A great  job of making it run a lot cooler & still have a really good picture; it was number #1 rated plasma TV.", "Date": "October 19, 2013"}, {"Title": "Awesome tv", "Author": "Skyhooker", "ReviewID": "R3KCH9F3D9DU62", "Overall": "4.0", "Content": "The only problem is the glare from the window,but at least I can see people in my driveway. Some shades will take care of that.", "Date": "May 27, 2013"}, {"Title": "Glare is a real problem for me", "Author": "CC \"CC\"", "ReviewID": "R23MDZMTEB2FRF", "Overall": "2.0", "Content": "Our new Plasma TV was installed today. I knew plasma had some glare problems when compared to LED, but I didn't think it be a problem  in our bedroom. We have few windows, and they are covered with shutters. The glare was so disturbing to me, we gave the set to our daughter who will use it in her basement.", "Date": "January 25, 2014"}, {"Title": "not happy", "Author": "tank", "ReviewID": "ROWB04IV51HDS", "Overall": "2.0", "Content": "do not like the remote. to hard to move the pointer around  no guide to see how to do things", "Date": "May 16, 2014"}, {"Title": "Great TV", "Author": "JN", "ReviewID": "R26LIKCYL4CX42", "Overall": "5.0", "Content": "For the price, the picture and smart features are really great. No problems or concerns so far with this TV.", "Date": "March 5, 2014"}, {"Title": "Great TV great price point", "Author": "J. Easterday", "ReviewID": "R1HINDPUJAJ6XK", "Overall": "5.0", "Content": "All the features I wanted at my price point.  picture is great.  Setup flawless,  Avatar in 3D is awsome .", "Date": "February 24, 2014"}, {"Title": "It was what I wanted", "Author": "Henrik rasmussen", "ReviewID": "R2PGNNN610OMFZ", "Overall": "5.0", "Content": "IT WAS WHAT I WAS LOOKING FORI HAVE THREE MORE SAMSUNG PLASMA TV LIKE ITHighly recomended to frends", "Date": "February 23, 2014"}, {"Title": "Great Experience", "Author": "ArtVandelay", "ReviewID": "R1IAT7F1NLSILB", "Overall": "5.0", "Content": "I'm thrilled with this purchase.  The smart features are easy to use and the picture is excellent.  I didn't care much for getting a 3D TV but this has it and it's actually fairly cool.  Take my review with a grain of salt, though - I'm a bit of a Samsung fanboy.", "Date": "June 28, 2013"}, {"Title": "BEARLYDID", "Author": "Barry E. Helms", "ReviewID": "R1DM4UF9Z9X2DE", "Overall": "3.0", "Content": "THIS TV HAS A BAD HABIT OF THE SCREEN GETTING BLACK OUTS ACROSS THE BOTTOM OF THE SCREEN. NOW THE WHOLE TV GOES OUT. SAMSUNG COMING AGAIN ON THE 14TH, WE WILL SEE. THANKS HOPE THIS HELPS OTHERS", "Date": "October 13, 2013"}, {"Title": "I love the TV, shipping was awful though.", "Author": "Icehockey2", "ReviewID": "R207XHBT3GZWR3", "Overall": "4.0", "Content": "First of all, I love the TV, everything works awesome.  The only reason it got 4 stars was because the shipping was an absolute mess.  They give you a 4 hour time frame for when it will be delivered so I scheduled the cable company the next day.  They changed it on me three times in the middle of the week.  There is much more to the story but to say the least the shipping was an absolute disaster.  \"Pilot\" was thd shipping company used and they had some kid with a truck and trailer behind it dropping them off.  No wonder they couldn't stick to the schedule, I had to call 4 times to make sure it would get here and demand it by a certain time or I was getting a refund to get the TV.  Once again, I absolutely love the TV, I would recommend to everyone looking for an afforable but awesome TV.  Just know shipping might be sketchy.", "Date": "June 30, 2013"}, {"Title": "Bad remote issues", "Author": "Thomas M Gulley", "ReviewID": "R2Z5HLMNHBI3C0", "Overall": "1.0", "Content": "The smart remote for the TV stopped working suddenly after only two weeks.  After contacting Samsung customer service and going through lengthy tech support, they concluded that the remote was defective.  It took about 4-5 weeks before new remote came in the mail only to find that it was not able to control the TV either.  contacted customer support again, told that it must be problem with receiver and a local repair tech would contact to come fix.  A week and a half later we get the tech support people to arrive who were actually wonderful.  They did replace the remote receiver on the TV only to find out that it did nothing to solve the problem.  Now being told that it may be a problem with IR receiver and not the Bluetooth because the remote won't pair with the TV.  If I had the choice I would return it and get a different TV this one is not worth the problems.", "Date": "January 23, 2014"}, {"Title": "Beware of thermal fractures", "Author": "kachadbi", "ReviewID": "R38KRT044ENGYU", "Overall": "1.0", "Content": "This TV had the best color that I have ever seen until while watching my favorite TV series I hear a cracking sound.  Then I got a BSOD.  This seems to be a common problem with samsung tv's.  They would not warranty the item saying that I had hit the tv with something.  The glass screen in front is not cracked it is the backlit screen that fractured.  So I am stuck with a worthless piece of junk.  I also phoned a TV repair company and was told it was not worth the repair price and even if I had it repaired there was no guarantee that the same problem would not reoccur.", "Date": "May 10, 2013"}, {"Title": "this is not a f8500 but great bright good color and blacks", "Author": "Barry J. Gervais", "ReviewID": "R3FC6AUX2F1J0N", "Overall": "5.0", "Content": "the reason i'm starting off giving it a 5 star rateing i don't want to bash this thing with only a few hours of viewing.The delivery was as expected on time and very professional they unpacked it set it up for me and cleaned up after themselves.I was not expecting a PQ near the flag ship F8500 I got this for my cozy little den and didn't want to spend alot. It's mostly for afterwork viewing and watching Baseball.my very first impression was the screen itself has some glare, ok i can deal with that, so if you are to put this in a room with alot windows with alot of light coming in you may be dissapointed.I watched a base ball game last night the color is very good and the blacks are good.i was living on the edge here because i also Have a PN50C700 and whan watch a baseball game the static image made some bad IR on the C7000 and had to swipe the screen to clean it up. I must say there was not any noticable IR on the F5500, but i will keep an eye on that. My PN60E8000 i have never had a lick of IR problems so i'm hoping the same will be the case here with the f5500There are three picture modes Dynamic Standard and Movie I like the movie mode myself, out of the box these are not the greatest settings standard was dark but i upped the cell from 12 to 13 and it brightened up, I went to Movie mode and it was fine but still needed some tweeks i think it's got alot to do with source you know what talking about you know your on one station the picture looks great you change the channel and wonder what happened to the color that why IMHO you need a good calibration the the picture is what it is and your not chasing color every time you change channel.I will update after a good breakin period.The set up was quite simple, the only bug I got and that may have been me! at first there wasn't any apps in the smart hub after a little while trying to figure it out I just reset the TV and started again, thinking I may have missed something. After a reset the smart Hub populated. Not sure i like the new smart stuff on this thing there is alot going on, maybe because I use to and like the smart hub in my PN60E8000.Comparing this F5500 to the E8000 the E8000 is beautiful in a bright room But I'm Afraid that if you get this F5500 it won't do well in a bright room, but a little over $800 i can deal with it.I put avatar 3D Blu-ray in to see what it would be like i was very impressed it goes to dynamic picture mode on the TV i was very happy to see this movie in 3D using Dynamic mode at factory default right out of the box was way better then i expected.I will update my thoughts in a few days once i get my teeth into this thing so i'll update as i go here.....Thursday May 2nd firmware update1.This firmware is for TV Model(s): LED F5500/F6300/F6350/F6400/F6800/F7050/F7010, PDP F55002.The version is 1102.13.This firmware update will improve the following:- Improves picture quality.- Resolves compatibility issue with Fitness Game Bikei must say that the improvement in picture quality has solidified my choice in buying this PN51F5500 i know there will be more updates.so the choice is yours which one to buy 60F5500 OR 60F8500 if you can afford the price i would still buy the F8500 if i had not just got the E8000 last May i would have gone with the 8500.so here i am I have a PN60E8000 and a PN51F5500After the firmware update i noticed the biggest difference is picture quality when i first got this tv it was a little troubling that i couldn't get the right combination with blacks and color flesh tones seemed to orange or too red and it was starting to trouble me. i was watching a baseball game last night (wednesday) couldn't get it to look natural even reset all the modes and it just wasn't right. tonight i watched washington and the braves after the firmware update the black players didn't have a greenish tint anymore they looked normal the white players don't look orange or bright red i maybe over stating it a bit but now it's very pleasing. blacks are nice and black flesh tones are more normal so i hope i explained it so you'll understand.here was my settingswhen i watched the ball game.picture mode standardcell light 16contrast 94brightnes 45sharpness 0color 48tint 50/50screen size screen fitdynamic contrast offblack tone darkerflesh tone 0rgb offcolor space nativewhite balance all at 25gamma 0motion lighting offcolor tone standarddigital clean view autompeg noise filter autoblack optimizer autothose are the settings I use for it directv as the source going through my TX-NR818UPDATE MAY 8th /13i'm taking one star off till i find out what is going on with this issue read below.i just had a new issue went into apps yesterday and played an Episode of Battle star galactic with (Amazon Instant ) finished watching it closed the app but the tv didn't go back to the the last TV channel i was watching but it gave me a black screen. my set up Directv Genie +  Onkyo TX-NR616 av receiver then going into HDMI 2 (ARC) into the TV.at first i thought it was odd maybe a HDMI handshake thing so i changed the Cables i had a Brand new high speed cable so i replaced it. ?????? then i thought maybe the reciever went out i reset it still nothing. all the smart stuff was still working just no source feed into HDMI 2. to make a long story shorter i reset every thing except do a factory reset on the TV i don't even know what i did but i got everything working again. mind you this has happened before but i thought maybe the TV switched source to HDMI 1 by default so i went back and forth and it worked. so i didn't think much more about it untill yesterdayso this morning i tried and tested it again watched something in netflix everthing looked good closed APP and everything was good watched more of the today show then just before i went to work i went into Amazon instant watched some episode of Star Gate Atlantis watched it for 15 min. then closed the APP and sure enough I get a Black Screen again took a deep breath powered everthing off TV, Receiver, and the Genie. after a few %*#K words i powered every off then back on and all was good again.so untill I resolve this issue (i did contact Samsung they said i sould rest the TV to Factory default and I'll do that tonight) if this fixes it i'll be a happy happy camperlittle update instead of hitting return a few times till it asks if you want to exit i hit the smat hub button works good or i hit the scource button and choose HDMI 2 That works good.UPDATE 6/4/2013I put it back to five stars because this TV for the price is a great buy colors are great blacks are black I love this thing", "Date": "April 30, 2013"}, {"Title": "great picture, nice gui, horrible sound", "Author": "Rich", "ReviewID": "R1BQ59394CXATF", "Overall": "4.0", "Content": "awesome set for the price, menus are easy, remote is a breeze. sound is awful, enhanced delivery is a joke. gonna try and return it and get a different model.", "Date": "February 28, 2014"}, {"Title": "Can't watch hockey games", "Author": "Michael Davide", "ReviewID": "R3I92IZ8YS5228", "Overall": "2.0", "Content": "This TV is horrible for watching hockey games.  The screen continually flickers and dims even with all Eco Setting turned off.  My only Samsung purchase and after finding out this is a common problem, my last Samsung purchase.", "Date": "October 29, 2013"}, {"Title": "Don't buy a smart TV", "Author": "Dennis Mitzel", "ReviewID": "R11VLLE59LN4V4", "Overall": "2.0", "Content": "I wish I had purchased a regular television and not a smart TV. The browser that allows you to go on the Internet is very limited and of little value. I was also disappointed that when watching Netflix you cannot adjust the picture size. I do not understand why Samsung would build the TV in this way. You can accomplish more with Apple TV or Roku.", "Date": "April 7, 2014"}, {"Title": "Amazing TV", "Author": "J. Kowalski", "ReviewID": "RMJJZO9O782T6", "Overall": "5.0", "Content": "I purchased this TV from Amazon after looking at some newer models in this price range.I like the new remote, it is very easy to use and it's nice to see some innovation instead of the same old push buttons.When I bought the TV, I was worried about the stand in the picture, but it is really nice. I like the height, it is perfect so I can lay video game consoles beneath it to make everything accessible.Setup was really easy and I like the TV Guide.I will update this review after I have more time to play around with the TV.", "Date": "May 9, 2013"}, {"Title": "Run from Samsungs plasmas !!!  good for 18-24 months, after that the \"purple streaks of death\" will strike. No repair", "Author": "Boring", "ReviewID": "R37E5WGK4J9V06", "Overall": "1.0", "Content": "Google \" Samsung tv purple lines plasma\" and read the 100's of comments from people stuck the with purple lines on the screens.Unless you live in Austrailia where they have better consumer protection laws,  you are stuck.  No repair other than to replace the screen,  that costs more than a new set.  Samsungs official response to me was \"  SORRY BUT YOUR A FEW MONTHS PAST WARRANTEE\" even though this is clearly a design or manufacture issue with their screens. Our local Goodwill has 3 newer Samsung plasmas on their shelf all with the same \"purple lines / shading problems.  If you do buy this please buy a good extended warrantee you will need it.Scott  (this is one of first nega​tive review I have ever had to write)", "Date": "February 23, 2014"}, {"Title": "Exceptional TV for the price!", "Author": "Amidie Rivard", "ReviewID": "R2CIFPU43LCDH5", "Overall": "5.0", "Content": "This picture quality is great, apps are easy to use, and the price was unbeatable. The only complaint I have is the remote is somewhat touchy but otherwise I love this TV!", "Date": "May 16, 2013"}, {"Title": "I returned it after a week and here's why...", "Author": "V. Parenti", "ReviewID": "R2UXX2HBNNQZEM", "Overall": "2.0", "Content": "I returned this TV for several reasons.  I have owed a Panasonic plasma for the past 6 years, I am pretty tech-savvy, and this was my first Samsung (and last).The good:-The best picture I've ever seen, hands down.  Amazing, beautiful, 3D was great.  Boom!-I really liked that it had a swivel stand, perfect for my room and couches.-I liked the idea that it interacted with my cable box (stupid Xfinity).  I hate Xfinity's stupid guide so it was nice to have a different way to change channels but I still needed to use the original remote/guide to set a recording, so that was dumb.The jury is still out:-Video games.  I play fast action, multiplayer shooters, specifically COD Black Ops 2 on XBOX.  At first I felt there was input lag and I was sucking, but then a day or two later I was doing really well.  So overall I don't think the input lag is really noticeable or gaming is a problem.  The data collected online seems to show it's not bad and I'll agree.Note 1:  I think all big TV's that are 3D tend to be slower because they come with so much other stuff to process.Note 2:  Yes, game mode was ON but what a pain in the ass to get to it!  You have to sift through 3 menus to unbury it and turn it on.  One nice thing is that you can have HDMI1 on non-game mode and HDMI2or3 on game mode if you have it hooked up that way.So why return it? (all details below)1. The main power button shuts everything OFF, but not ON?!2. The volume button controls the TV volume, not the receiver.  Can be switched but needs to be switched EVERY time?!3. Flickers on/off during video gaming.4. TV guide \"favorites\" just plain didn't work.  Voice control was crap.The details...1. So I messed with this forever before digging around the blogs and finding that Samsung wanted everything to turn OFF with one button, ok, great!  But they didn't want everything to come ON with one button because some people just use regular TV volume instead of whole theatre sound.  So the master power button only turns on TV, you have to use a separate remote for your home theatre.  That's garbage for people who always want the best sound (theatre) which many people do.2. So once you turn your TV and home theatre on separately, and you use the \"universal\" remote to turn sound up, it turns TV up, not theatre.  Uhhgg....ok, so go through 3 menus and you can switch that appropriately so it controls the receiver, but then when you shut the TV off and come back guess what!....It defaults back to TV every damn time.  Wtf?!  So every time I turn the TV on I have to use 2 remotes, then dig through 3 menus to get this \"universal\" remote just to operate the correct volume.  Not very universal if you ask me, and a huge pain in the ass!3. So it didn't happen often, but in 5 days of playing video games, there were times when the screen went black, then about 1-3 seconds later, came back on.  Your guess is as good as mine about what's going on, just saying it was happening once every few hours or so.  Not the end of the world but 1 time is 1 time too many.4. As mentioned above, I hate Xfinity but am stuck with it.  I hate their menu and looked forward to using this TV's own guide.  It says you can filter out channels by checking them on or off.  Cool, I'll make a list of my favorites and finally have a workable guide to view.  I'm a tech-savvy guy and I messed with this for hours and it never worked.  It just continued to show all channels and that was that.  Stupid and frustrating.  Also, the voice control almost never worked.  Not that I cared but I saw a commercial where the lady asked \"what baseball games are on\" and it brought up options.  Not even close, it couldn't understand me, had delay.  It was aweful!Summary:All in all, Samsung has their head up their ass when it comes to being thoughtful about the user and functionality of their TV.  If all you do is turn it on and watch TV or movies, great, get this TV.  It has a wonderful picture, sound was good, 3D was fantastic.  If you have a home theatre and want to utilize some of the toys and perks, then get a Panasonic because this one will frustrate the daylights out of you.  For video games, I hope they don't all have the weird glitch mine had.  As long as that's true, then I liked my experience with games.  Even with game mode off it was pretty great.I hope this review helps some people make a decision.", "Date": "July 7, 2013"}, {"Title": "Eh...Just OK.", "Author": "Rod Nutt \"rodnutt\"", "ReviewID": "R3I857E8NXET7K", "Overall": "3.0", "Content": "Coming from the Panasonic GT series to this set and while the \"Smart\" set is much more advanced than the Panny there are some noteable drawbacks.  Blacks do not seem as deep and there is an awful buzzing noise that gets worse with brighter scenes.  You will likely not notice the sound unless you have the volume down very low/muted but it is definitely different than the Panny.  Remote control is a neat idea but the execution is poor as it will likely take you months to really figure out all the tricks/tips.  Also, the sound is not good, much worse than the Panasonic.  I have to turn it up to 40-50 units while watching movies because voices often sound muffled.  Decent value for roughly $800 but kind of get the feeling Samsung is investing more money into their LED's than plasmas.", "Date": "June 22, 2013"}, {"Title": "Just ok", "Author": "gamer geek \"fasty\"", "ReviewID": "R39LPDTEV623S8", "Overall": "3.0", "Content": "Bought it because the deal was good.Shouldn't have gone plasma, and very pixel-y at times, especially with weak inputs through a DirecTV box or a weak Netflix stream.Blu_Rays look good.  If your input is high-level enough it looks great.  Otherwise it looks sort of blah.  My old 720p 40\" Sony Wega DLP rear projection that I replaced with this arguably had better picture quality for many situations.  Buyer's remorse here, a bit.", "Date": "February 23, 2014"}, {"Title": "Okay....BUT", "Author": "alan wayne brunken", "ReviewID": "RKI88P6J88M85", "Overall": "3.0", "Content": "Excellent images but the changer, however, with its Apple like but erratic operation is impossible to use. We had to eventually buy a different changer.", "Date": "February 11, 2014"}, {"Title": "Poor Samsung Service, Excellent Amazon Customer Service", "Author": "D E.", "ReviewID": "RQF37UZUJFDYF", "Overall": "3.0", "Content": "I have had this TV for 2 weeks and it has a horrible picture.  It is bland and washed out.  Anything with whites or greys lacks any definition.  I got a calibration Blu-Ray disk and I cannot adjust the white levels to spec.  I have 4 other HDTVs - a 37 inch Visio LCD, a 32 inch Panasonic LCD, a 16 inch Coby bought at Big lots for less than $100, and a little 13\" Axess (I have never heard of it either).  They all have a picture far superior to this set.  I cannot watch it for more than an hour without it hurting my eyes.  I contacted Samsung and they sent out one of their authorized repair people.  He took a look at it and said he had seen worse and he thought it was within spec. but he would let me know.  He took a couple of pictures of the screen with his cell phone.  Today he told me that he compared the pictures on his cell phone with his TV and they were close enough.  I again contacted Samsung.  They said that since their rep said it was within spec there is nothing they will do.  They will send another person out to look at it, this time at my expense.  Based on other reviews of how brilliant they picture is, I know this unit must be defective.  I certainly hope Samsung will stand behind their product.Update - March 8, 2014.  The second service rep also said it was within spec.  I called Amazon and they offered to replace it or I could just return it.  I decided on a replacement since other reviews were so positive.  The replacement was noticeably better but the picture was still somewhat bland especially during daytime.  Based on the picture on the replacement set I have raised my rating from a 1 to a 3.  I called Amazon again and they agreed to my returning it.  I bought a 65\" Vizio M651d-A2 and the picture is spectacular.  The smart features are not a sophisticated as Samsung, but the picture is far more important to me than features.", "Date": "January 21, 2014"}, {"Title": "nice tv, horrible stand", "Author": "D. Hofer", "ReviewID": "R1ZJM85A5WD31Y", "Overall": "3.0", "Content": "I  bought this tv and had no real problems setting it up other than trying to download appications such as HBOgo.  The main reason for downgrading this purchase is the cheap, horrible stand.  The stand is a god awful color compared to the tv and makes the tv look cheap.  The stand is flimsy, wobbly, and, trying to be nice, it is simply ugly.In addition, this stand makes the tv heigth about 1/2 inch higher than stated, just enough to  not fit completely in the cabinet space that it was intended to fit into. Nothing makes a tv look cheap more than an ugly stand that sits under the television like a four pronged add-on and because of its polished silver color it  cannot be overlooked.  Too bad, a nice tv worth the investment, now I have to find a stand or mount it onto a wal in order to make it fit.", "Date": "May 1, 2013"}, {"Title": "****SAMSUNG IS A RIPOFF****", "Author": "Just Sayin'", "ReviewID": "R3EHL9YXV3BBPT", "Overall": "1.0", "Content": "*****W A R N I N G*****Do not buy SAMSUNG Televisions!!!  Maybe $2,500.00 - $3,000.00 is not a lot of money for some folks to spend on a television, but it is to me.  This is money I'll never get back, nor derive true enjoyment, nor value from due to the DEFECTIVE SAMSUNG product that I purchased.  After the one year warranty period SAMSUNG Television screens tend to show burn-in and ghosting with horizontal lines, along with very heavy distortion of picture on right side of screen.  This problem is systemic in all their LCD's and LED's.  Consumer's have complained all over the internet.  There are even numerous Youtube postings with the exact same problems as in my DEFECTIVE SAMSUNG model, as well as the same DEFECT in many other DEFECTIVE SAMUNG models.  This defect occurs upon start-up, and lasts for the first 15 minutes of trying to view a program. Then the picture gets progressively worse over time and continuously declines.I tried SAMSUNG's Executive Customer Relations Dept. and was told:  \"We will do nothing but refer you to a local Authorized Repair Shop.\"  They were downright blunt and rude to boot!  I feel robbed of $2,900.00!Furthermore, I was informed that the repair will consist of a diagnosis visit, and then another visit to install a replacement \"Panel\" that costs $1,300.00 for the part plus $279.00 to install, plus taxes......all told, another $1,719.16....at which point the technician basically stated, \"just buy another TV.\"SAMSUNG customer service also told me that their Televisions depreciate at a rate of 20% per year, and that they do not repair any of their products after 4 years!  Their own repair people told me to just buy a new set!!!If I save one family the heartache of losing they're hard-earned money on SYSTEMICALLY DEFECTIVE SAMSUNG TELEVISIONS, and a company that offers zero customer service....I'll be happy!  God bless....SAMSUNG CONS:No Customer SupportSystemic Panel DefectGhosting of imagesBurn-in on screenDistorted pictureVery expensive to repair", "Date": "February 18, 2014"}, {"Title": "Stand design is too large!", "Author": "Gerald A. Lombardo", "ReviewID": "R270ON1LXBJQMW", "Overall": "2.0", "Content": "While the tv itself is excellent and meets my every expectation, the STAND is a total disaster!  Samsung changed the design for it's stand from a simple rectangle (as in previous models), to a double \"v\" shape.  I had bought a table set to the measurements of the old stand specifications.  When the tv arrived, I was shocked to see that it's STAND did NOT fit the table.  I contacted Samsung, and they politely told me that (at my own expense and liability), I could buy a replacement stand from their parts department in the old style.So, two thumbs down to Samsung for changing the size and design of their stand.  It cost me an additional $150!", "Date": "September 15, 2013"}, {"Title": "DO NOT BUY SAMSUNG PRODUCTS!!!!!!!", "Author": "Allison Deal", "ReviewID": "R2H9KRM4Z3YWVZ", "Overall": "1.0", "Content": "DO NOT BUY SAMSUNG!!!!!!!!!!! Read belowI previously owned an LG, and it had much better 3d than on my new samsung, the \"pop out\" effect was 10 x better on LG. When I raise a concern with samsung ,they tell me basically \"oh well\" they will do nothing to satisfy my quality issue, they are not even willing to let me pay the difference for an upgraded model. Samsung is a joke and I recommend never purchasing one. On Samsung you are not able to................  -cannot. download apps of your choice  -cannot have surround sound audio in smart hub streaming (netflix,amazon,vuvuzela,hulu,ex). Will not output audio on tv apps.  -no \"pop out\" effect of 3D images, or movies. Only in depth 3D (boring !)  -cannot connect the blue tooth devices of your choice (samsung devices only)WTF?THIS MEANS NO SOUND BAR FROM OTHER MFG'S.  WHY ?", "Date": "November 30, 2013"}, {"Title": "BEWARE!  DON'T BUY A SAMSUNG TV EVER", "Author": "cha cha", "ReviewID": "R1P5JMU09ROLQ9", "Overall": "1.0", "Content": "Don't ever purchase a Samsung TV.  I bought a 50\" plasma in 2007.  In 2009 the TV picture went out.  Luckily I purchased the 4 year warranty through Best Buy so I got another TV.  Well, I made the mistake of buying another Samsung.  This one lasted 4 years and 5 months before the picture went out.  Unfortunately, that was 5 months after my extended warranty expired.  Samsung TVs will not last more than 4 years...BEWARE!", "Date": "November 24, 2013"}, {"Title": "Its not bad! Just don't fall for enhanced delivery", "Author": "Dhiren", "ReviewID": "R2DQGA4BCP4X9X", "Overall": "3.0", "Content": "TV is just that a TV. Nothing stands out of the ordinary and at the same time does not disappoint either. We jumped from 30\" to 55\" so we are pleased with it. However delivery is a whole different story. It was horrible. To begin with they came a day late and even on second day they called to check if we can move it to next week. Then hesitated to remove shoes in house. Anything promised here as \"Enhanced delivery\" falls just short of a lie. They only took TV out of the box but left packaging in bits and pieces everywhere in room. they left tv, not on stand or anything, on floor leaning against the wall. Its much better to get UPS/Fedex delivery they come in time and leave it where promised.", "Date": "May 13, 2013"}, {"Title": "smart tv", "Author": "lorenzo  Moore", "ReviewID": "RTUI79S4XM8BI", "Overall": "1.0", "Content": "the TV only have one remote no 3d glasses Jeff from the disappointment I hope the new replacement TV have everything that post it come with thanks thank God for you tube for the open box let me know what comes with this model.....", "Date": "December 21, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "1080p Plasma HDTV: Best picture quality\n600Hz Refresh Rate: Best for general viewing, video games, action movies, and sports\nSmart TV with Voice Controls: Interact with streaming content and the web\nTV without stand (Width x Height x Depth): 58.4'' x 34.5'' x 2.2'', TV with stand (Width x Height x Depth): 58.4'' x 38.4'' x 14''", "Name": "Samsung PN64F5500 64-Inch 1080p 600Hz 3D Smart Plasma HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/31YwIquuufL._SX300_.jpg", "ProductID": "B00BCPH3KM"}}