{"Reviews": [{"Title": "Terrific TV--doesn't disappoint", "Author": "T. Hyatt", "ReviewID": "R13C120CHXXDHL", "Overall": "5.0", "Content": "I just purchased this TV from Amazon after the long wait for Panasonic to release.  I have had it a week now and am really enjoying it.  I am not a videophile, just an average user, so I'll leave the more detailed reviews to the techies.  I am running this on an Xfinity (Comcast) cable network.  I have a Tivo Premiere, a Panasonic Blu-ray DVD player, and an Apple TV hooked up.  All running seamlessly.  I replaced an 8-yr old rear projection, 720p Samsung.  Here are my initial observations.This TV is crazy thin.  I have it on the supplied stand, but it would easily wall mount, no thicker than a framed picture.  The stand is not quite the way it appears in photos.  It is actually a very strong and solid metal stand.  The see through acrylic piece you see is just cosmetic and a cover that lies on top of the metal stand.  That's actually a good thing, because you don't fear that the stand will crack or break.  The stand is also wider (16\") and deeper (14\") than you might guess from the photos.  So you will need to be sure your TV furniture is deep enough to accommodate the stand.  What is very useful is the height of the stand (4\" from bottom of the base to bottom of the bezel).  Because you will likely want to use a speaker system (more on that in a minute), you may want a sound bar or center speaker in front of the TV.  This is a problem with TVs like the new Samsung F8000 (a clear competitor to this set) that have a much smaller stand height.  On those TVs, the height of the sound bar or center speaker is likely to cover up part of the bottom bezel.  And if the bezel is thin, as is the case with most new sets, it may also cover up part of the picture.  Not a problem with this set.  I have a Sonos sound bar and it just fits under the bottom bezel like it was designed that way.The back panel of the TV is sheet metal, not plastic.  It looks surprisingly cheap for a TV of this price, but it is sturdy, and needless to say, you won't be looking at it. It has 3 HDMI ports on the right center of the back of the set.  If you need another access port, it also has component ports.  Also an optical digital port for hooking up to sound bars like the Sonos.As for the bells and whistles, they are innovative and useful, but like cable packages, way more than you are likely to ever use.  It basically doubles as a computer monitor when you are not watching TV.  It has numerous apps available.  You can set it so that your default screen is a combo of the TV image and the various apps (and you just press one button on the remote to call up the full screen TV image), or you can just default to the TV image.  The main remote has a dedicated Netflix button, so that is easy to access.  Amazon Instant Video is called up from the apps screen, so only a couple of extra steps.  Both work well once set up.  The swipe and share works as advertized and is a fun way to show pictures from your smart phone on the big screen for all to enjoy. I have an iPhone and after downloading the needed app, it worked well. The 2D to 3D conversion works fairly well and there are 4 pairs of glasses included with the set.  But it remains gimmicky in my view and except for the occasional movie that makes good use of 3D, probably not a key feature for this set.The TV comes with two remotes.  The main remote is set up well with large dedicated buttons for the home screen, apps, inputs, and Netflix.  The smaller remote has a touchpad interface, a built-in microphone for verbal commands, and volume and channel buttons.  You don't need both.  I actually use my Tivo remote to control everything and keep the main remote nearby for when I need access to extra features.  If you were hoping to cut down on the number of remotes you have, this TV won't help!The sound quality is adequate for this TV. The speakers are on the back of the TV. To Panasonic's credit, there are a lot of options to tweak the sound, including surround sound, to get it to your liking.  But the bottom line is there is only so much you can do with rear speakers on a TV this thin. You are likely to want a separate sound system. I opted for the admittedly pricey Sonos sound bar paired with two Play 3 Sonos speakers in the back of the room to create a surround sound environment.  It really enhances the experience of watching this TV.Now for the main event: The TV image is truly remarkable. I prefer the brightness of an LED screen over a plasma screen and this screen is very bright.  The blacks look black to me and in darkly-lit scenes, the details and imagery do not get lost.  Sports are a joy to watch and you feel like you are there. This is the first time I have felt like the HD experience lived up to the hype. There are all of the expected tweaks available for image and sound and the menus are intuitive and easy enough to use.  Initial setup was straightforward and intuitive and you don't need tech support.  Because this set is so thin, and the bezel is so thin, you really get immersed in the picture. The whole TV is minimalist in design, not unlike an Apple product.  The screen does reflect a lot, so if you have light coming in towards the set, you will see it.  More noticeable in darker scenes.  At first, I thought this would bother me, but after a week, I hardly notice anymore.The best endorsement I can give is that when I turn this TV on, I always have the same thought: I love this set. Enjoy.", "Date": "June 1, 2013"}, {"Title": "Great bang for buck", "Author": "M. D. Joy \"Technocrat\"", "ReviewID": "R3ND9HCS4YEUMG", "Overall": "5.0", "Content": "If you're looking for a slim-line, high quality IPS, color accurate 55\" LCD, this is it. If you're looking for infinite fake black synthetic contrast ratios (ala-samsung) and bad off-angle viewing look elsewhere. This TV provides insanely good off angle viewing, is ultra skinny, and has a white back that the delivery guys had never seen before (neither had I, now I want a white wall-mount!). The set is beautiful when off and gorgeous when on.This TV pairs perfectly with the Peerless SUA765PU ultra-slim full articulating wall mount (it collapses to 1.23\" mounting depth), and leaves plenty of room for routing cables etc.. Not only do you get a picture frame styled and sized TV, but you can pull it out up to 23\" and angle the TV up to 72.5 degrees. Needless to say I have two of these TV's and mounts, one in the bedroom and one in the office. I'm probably going to do the same with the 47\" WT60 for a spare guest bedroom for that upscale hotel feel.The sound quality is pretty impressive for a ultra thin <2\" set, with no rattles, buzzing, or clipping even at 100 percent volume. The built in Netflix works as well as it does on the new Tivo Roamio's (the processors are of the same class in this TV). Netflix is markedly better than on the Tivo mini's as they upconvert everything to a rather odd 1080-24p.As for web browsing (really, you don't have a tablet and you're in the market for a 1k+ TV?), haven't bothered, why would you?The software, decoders, processors, even smart TV firmware are identical to my Panasonic 65\" ZT60 (TC-P65ZT60). That said, between the brains, and the color accuracy brawn of this set, I don't feel like I'm seriously missing out when I migrate from my home theater to elsewhere anymore. I have zero dead pixels on both of my 55\". Panasonic is one of the only manufacturers left with a zero stuck pixel / dead pixel policy. That should tell you something about their quality control process.On to the backlighting... Yes, it's an edge-lit TV so there is a bit of spotlighting in all four corners in maximum retina searing flashlight mode, but if you calibrate with one of the professional ISF modes (yes, you can calibrate it to dead accurate color ranges), and don't set the backlight control to store demo mode you're fine. There's no light leakage, or pooling problems in the inner 2/3's of the screen where you watch film. As this only has 16 zones, you will notice some over-brightness on the sides of some scenes at times, but this is minimal, and not obnoxious. At maximum brightness, there is noticeable dimming on the left and right 4mm of screen due to the geometry of the backlight optics. The backlight scanning runs at 4200 (which is 4200 scans, not HZ) and does an admirable job of eliminating most of the ghosting inherent in slower IPS screens without adding a cartoonish look and feel. I've never liked most motion control effects by Sharp, Samsung et. al. but the Panasonic WT60 is pretty decent at minimum settings. I use the same settings on my ZT60 to great affect. The dirty screen effect is still here though, an unfortunate side-effect of LCD technology (Sherlock Holmes: A Game of Shadows (SteelBook Packaging) [Blu-ray] demonstrates this dirty-screen effect marvelously in the opening sequences). The screen is native 240hz, and with motion control set to minimum, and film cadence control at minimum you get maximum resolution without the soap opera effect.For inputs, you only get 3 hdmi, but if you need more get an hdmi matrix switch, or use a receiver. Most people want better audio than any TV of this class can ever provide, so if you're wondering why the 5-6 hdmi port TV's are dwindling, consult market research. Also, part of the 'smart tv' appeal is to eliminate one of your dedicated streaming devices. You do get an impressive 3 usb ports though, great for powering things like Google Chromecast HDMI Streaming Media Player and other dongle style streamers. HDMI 2 is an ARC port (audio return channel) so you can drop one cable from the mix if you have an ARC compatible receiver or hdmi decoder (some matrix switches now support this).I will say that the optical audio out is not lip sync'd which is a bummer. This means your cheap audio bars without lip sync settings will not work well at all. You'll get audio before video if you have any of the video enhancements turned on. Response time on this clocks in <35 ms in game mode, but climbs to 70-80 ms if you turn on all the video enhancements (you have been warned). I would hope that panasonic might fix this in a firmware update, but this is unlikely as it's been a problem on many previous generations of plasma and lcd's panasonic has released over the past few years.If you want high quality audio pick an in-wall speaker like the Polk Audio 265-LS High Performance In-Wall Loudspeaker or sound bar like the Bose® CineMate® 1 SR Digital Home Theater Speaker System. I'm powering a pair of Polk 265-ls in my office with a NAD D 7050 to great effect. I replaced my desktop speakers with the in-wall's along with an NAD D 7050 in my office and as an added bonus have a high-end headphone amp and apple airplay target in the office as well. For smaller speakers, or a passive soundbar, the NAD D 3020 is also a great choice.Reliability is also very high on Panasonic's. They have the lowest repair rating of any of the major LCD/Plasma manufacturers out there. They have brought the same exacting precision they put into building the best and last Plasma to ever grace this planet (the ZT60) into this latest range of LCD's. Since LCD's are the future for Panasonic now, expect even more impressive developments in the next 2-3 years as they shift their focus on the high-end from plasma to LCD.As for why this is such a bargain? Nobody realizes Panasonic has stepped up their game, and is still buying the most heavily advertised sets (Samsung and Vizio, their genius is in their marketing spend).Once the secret is out, don't expect huge discounts on Panasonic LCD's in the future.One last comment, is it does use passive 3d with a circular polarizing filter on the front screen that is also setup to minimize light absorption from ambient sources. In cinema mode, the passive 3d accuracy is good, although it does have the normal reduction in vertical resolution from 1080p to an effective 720p in 3d mode. This is a byproduct of current passive 3d technology, and is why Imax screens still use dual projectors for proper 3d. You need twice the vertical resolution with passive 3d to get 1080p. The only use-case justifying a 4k set right now is this. Passive 3d on a 4k set should give you 1080p. As this isn't what I bought this screen for, I honestly don't care.I went looking for a thin, female friendly aesthetic screen with high color accuracy to match the reference grade quality I get from my Panasonic TC-P65ZT60 65-Inch 1080p 600Hz 3D Smart Plasma TV and found what I was looking for in the WT60.Great price, better quality, and proven reliability. These should tide me over until 4k or 8k OLED takes off in 4-5 years.The only down-sides are typical of edge-lit LCD's, especially of the thin variety and won't find better quality in the ~1k 55\" range than this Panasonic WT60.If you're looking for a reference grade large screen LCD look to Sharp's flagship full array LED screens (Sharp LC-90LE745 90-inch 1080p 120Hz LED 3D HDTV a close cousin to the now decommissioned sharp elite professional grade displays). Otherwise, grab a Panasonic ZT60 before they are extinct (by March of 2014) and hold on to the last remnants of Pioneer Elite quality display before OLED finally supplants Plasma as the reference grade screen standard.", "Date": "December 31, 2013"}, {"Title": "Panasonic TC-L55WT60", "Author": "G. Gleason \"Mustang\"", "ReviewID": "R30Y8EOGT55YSB", "Overall": "4.0", "Content": "I just got my TV delivered, unpacked with the delivery guy and powered up to make sure it was ok.  I got the stand put on, and the TV set up, made some preliminary settings for sound and color.  I am completely satisfied with the picture.  I know some had issues with the screen, but in the 30 minutes I have looked at it setting it up, I have no complaints.  The sound for a very thin TV isn't bad, a sound system of some kind would be better for movies of course, but to watch the news, the internal speakers are fine.  Tried out the passive 3D by watching a cartoon channel and used the 2D -> 3D conversion, and it was actually pretty good.  I don't have any actual 3D content to watch, so I can't say how good that is, but the conversion is ok.  That means you can see some depth in the picture.  So, actual 3D content would probably be even better.  And I didn't notice an scan lines or anything in the 3D mode.  Connection to my wireless router was trouble free (once I remembered my password !).  So, I have no complaints.  I have a Panasonic TC-P50ST60 plasma, and this TV picture looks as good as the Plasma.  The TV camera only pops up when you activate an app that uses the camera, I tried to manually pop it up and it didn't.  You do have to manually push it back down.  I bought this TV without actually seeing one at a store, but based on the fact I have a Panasonic, and there are some very good reviews for it, I took a chance and bought it, but not disappointed at all.  So, I don't know why some people have issues with it, but I am satisfied and the price was great.Below is a link that another guy on here provided.  it has a review of the TV and at the bottom of the page some additional links to click on.[...]I entered these setting, and them made a few small adjustments to my liking, like the color, I turned it down to 30.  but if you just tweek the standard settings you can get a pleasant picture.  out of the box, you need to adjust the picture and sound settings.  there is a slender light bar that runs across the bottom of the TV with the Panasonic name on it.  it lights up when you have the TV on.  there is a setting to turn it off if you don't like it.  the default setting is \"motion\" (with on and off) so don't know what \"motion\" setting means.  I left it on.  and there is a setting to turn off the advertising.  you will just need to step through the menu items, good to do just to get familiar with them, and look for these items.The picture seems good.  the extra remote with the round panel, is ok, and in some cases, better than the standard remote, esp for the apps, instead of having to press the arrow buttons over and over to navigate the apps, you can just swipe the small remote without all the button presses.UPDATE:  I signed up for the free 1 month of Netflix.  and they have some 3D programs available, mostly kids movies, some documentaries, and a few movies.  The 3D is fantastic !  the 2d - 3d has nothing on the real thing !  the passive 3D is really very good on this TV.  I have a Panasonic plasma with 3D, will have to check out the active 3D it has and see how it compares to the passive 3d on this LED.  so, if you want to try out the 3D, you can sign up for the 1 month free of Netflix and try it out.  the cheapest plan is $6.99/mth for showing 1 program on 1 TV at a time. apparently they will allow multiple TV's to watch different programming for a dollar or 2 a month more.UPDATE:  I tried out the TV last night, after dark, and I thought the picture was fine.  one buyer said the TV was way too bright.  I thought it was fine. and tried out the 3D on my Panasonic plasma (active 3D using the glasses with batteries) on Netflix, and the 3D was great, but this TV with the passive 3D looks just as good in my opinion.  and I don't see any problems with the screen such as extra bright areas, or dim areas, or bleeding, etc.  just a nice picture.  you will need to adjust the picture and sound settings of course.  I used the standard settings and tweeked them to what I liked, and tried out the professional setting from the web link I posted above, but I think the standard settings to your own personal likes is as good. update Jan 17 2014 -  I down graded my rating on the TV to 4 stars.  There is some bright spots in the corners that is visible on a light colored screen.  on a normal color picture, the picture looks fine since the LED edge lights are not as visible.  since the bezel is so thin, the LED edge lights seem to be visible.  The plasma offers a better picture since you don't have the edge lights.  I don't know if the full array back lights on the other brands would be better, would seem like it would be.  don't know why Panasonic didn't go with the full backlight method instead of edge lit.  the Panasonic ST60 plasma is about the same price and offers a better picture.", "Date": "December 27, 2013"}, {"Title": "Fantastic picture, some issues with audio output", "Author": "Dharma's Cat", "ReviewID": "R1XWSDFYTKR5L5", "Overall": "4.0", "Content": "As for the picture quality, I'll be very brief: It is fantastic. The reason I'm not giving this TV five stars are two issues with the digital audio output, which I think Panasonic should fix:(1) For some reason, the digital audio output is only Stereo, even if the HDMI input is a Dolby 5.1 source. I've contacted customer support - this almost seems like a warranty issue. I'm waiting for their response.(2) There is a significant audio/video sync problem that can only be resolved if you have a receiver where you can adjust for a/v sync (this has been mentioned here before). This can happen with modern HD televisions: It takes the TV a while to put the picture together, with the result that the picture is a few frames delayed relative to the audio. About 0.1 seconds in the case of this TV. Make no mistake, 0.1 seconds is quite noticeable, for example when people are talking.This is *not* an issue if you are using the internal speakers - those have been adjusted by delaying the audio by an appropriate amount. This is only an issue when you are listing through a separate home theater system.At this price, I would expect that the digital audio output is also adjusted for audio/video sync, not just the internal speakers. Instead, I now have to upgrade my home theater receiver to a model that can adjust for the sync by delaying the audio by about 0.1 seconds. Otherwise, I would have no reason to buy a new receiver. (I'm buying the Yamaha RX-V675, which is an example of a receiver that has the capability to perform this adjustment.)", "Date": "August 4, 2013"}, {"Title": "Phenemonal", "Author": "John W. Graham", "ReviewID": "R33PID33MTPSVW", "Overall": "5.0", "Content": "Prior to getting the Panasonic TC-L55WT60 55-Inch 1080p 240Hz Smart 3D IPS LED HDTV, the best TV I had was a Sony BRAVIA KDL32BX330 32-Inch 720p LCD HDTV (Black).My first impression was \"wow\"...this HDTV has an ultra-thin metal bezel and a chrome and acrylic stand.  Just having this TV atop my TV stand upgrades the look and feel of my entire living room.  The HDTV was easy to unpack.  The instructions for setup are scant and more pictorial in nature but I was able to get it set up in about 30 minutes including some assistance from my wife in setting it on the included stand.  The cable connections were well marked and easy to understand.Setting up the TV via its setup routine was very simple.  The TV guided me through the process and even offered a voice guided tour of the features.What I love:* There is virtually no blurring - the image is smooth.* The color depth and clarity are outstanding.* The picture is essentially edge to edge thanks to the thin bezel.* I have no issues with the built in speaker sound quality.* The 2D to 3D capability as very well done.* Swipe and Share works great although I doubt I'll use it much.* I like the Home Screen concept and the fact that I can customize it to fit my needs.* The LED lighting is a nice touch and blends in perfectly with my furnishings and doesn't detract.Some irritations:Why is the power connector in the middle back of the TV?  Why not put the power connector closer to the other connections to make cable management easier?The home screen and other areas feature advertisements.  Why?  At this price point there should not be a single advertisement anywhere.  Ever.The camera is a nice feature but it needs to be manually pushed down when not in use.The remote control (the main one) is not programmable/universal so I still have to have my cable box remote control.  To make matters worse, the channel button on the TV remote switches the input source versus changing the channel on my cable box.The \"other\" remote is a bit strange.  It has a touchpad type surface and a microphone so you can speak commands.  So far all it does is search for what I ask in a browser.  It does do a great job of transcribing what I ask into text though.  I find this remote difficult to use.Some concerns:VieraConnect is a bit problematic.  It finds and attaches to my router but has trouble connecting to the various apps from time to time.In general, the apps are hit or miss.  For example, the Facebook/Social Media app says to visit Facebook.com/device and enter a code but the TV never displays the device code.  I had to download \"Facebook\" from VieraConnect's App Store and not use the version that shipped with the TV to establish a FB connection.YouTube is a bit clunky when searching.  I have this same issue with my AppleTV.  In particular, the search results returned by the TV are not the same search results that I would get if I visited youtube.com from my laptop.Some of the apps, like Hulu, won't connect and I haven't been able to determine why.Overall, this is a phenomenal TV.  The image quality will astound you and it simply looks great.  This TV will not disappoint - I definitely feel like I am watching a flagship TV.  Unfortunately, there are some irritations and concerns.  However, none of them are showstoppers.  I am considering getting the smaller version of this for a bedroom. I'm still rating this as 5-stars.", "Date": "July 17, 2013"}, {"Title": "This TV beat all others in value.", "Author": "SewNovice", "ReviewID": "R2TFD0ZDVVNOMK", "Overall": "5.0", "Content": "I have spent the past few months researching and shopping around for a new HDTV for a modest sized room. I love watching streaming video and movies so, I wanted a 46-50 inch, with 3D, 1080p/240 Hz. I considered plasma and lcd. I was really concerned about the glare with plasma, as the TV is in a room with a large window. I am not the kind of person who has tons to spend on a Samsung (which IMO probably makes the best LCD TV). I shopped Vizio, Panasonic, and LG. I decided Vizio was too bulky and looked a little cheap. Panasonic was more expensive. LG seemed the reasonable option...sleek, good picture, good price. Then Amazon dropped the price on the Panasonic WT60 47 inch to $1000....this drop only lasted for like 3 days, right after Christmas. This was a deal that couldn't be beat. I received my TV a few days later and have been in awe since. I will say I have three other flat panel TVs but have not purchased a new one in several years. This TV was purchased for my home office.Picture. It is truly awesome. I did not know HDTV could be so crisp and clear! The picture is amazing!Design. The TV is lightweight, sleek, simply beautiful. I love the minimalistic design, thin silver bezel, clear acrylic stand, white backside (think apple). Simply beautiful!3D. The 3D is awesome with 3D content. Unfortunately, there's not a lot of 3D content out there but when you can get it, it's awesome on this TV. I did not notice any effect when using 2D to 3D....none at all. The glasses are lightweight and cheap to replace. You get four pair.Apps. It has a decent app store. It had all the apps I need.....amazon prime, Netflix, crackle, vudu. I really like the setup of the various home screams (including the app home screen) which can be customized to your taste. I choose to direct wire through Ethernet which is better than wifi, as with my wifi, sometimes things disconnect. It speed of downloads is impressive (I have cable internet).Camera. I have no plan to use the camera, as I don't Skype, but others have complained about having to push it back down???? Sounds minor to me. How about just leaving it up?Remotes.  The main remote is great. Some have complained but I find it very useful. It automatically controlled my Sony Blu-ray player. However, it is not a universal, so I was not able to use it for my cable box.The second remote is not very helpful to me, but I could see its use if you plan to use the TVs web browser often. The second remote acts like a mouse and it has a voice command feature. I found the voice recognition to be pretty accurate. This could be quite useful for searching the web. I, however, prefer to use a computer for that. I also have concerns about internet security on a TV, since I can't install security software on a TV. There's a dedicated Netflix button on the remote, which is nice, however, there is a big apps button which is most helpful. I also like that the menu button and 3D buttons are at the top of the remote, as I use these often. There's a large home button and input button (good for changing from tv to dvd). There is even a light button which backlights the remote. Enough about the remote.Menu. The menus are fairly intuitive, if you have any knowledge of basic electronics. The menu selections are clear...picture, sound, network, timer, setup, and help. That pesky lighting for the logo on the TV can be turned off by going to setup...other settings....led illumination (off). I was also able to turn off those annoying ads, or at least I made them less obvious.Network setup was easy. The TV really walks you through it. This TV also has a SD card slot which is awesome if you plan to view personal media on the TV. Three HDMI connections are enough for me. I don't get the need for 3 USB connections though. It is odd that the power cord is opposite all of the connections...makes for a messier cord situation.Sound. Some are annoyed by the height of the TV with the stand. It does seem a bit higher than others, but this might be beneficial if you plan to use a sound bar. It could sit neatly under the screen and would not obstruct the picture. I have been using the TV speakers and have to say they are impressive for TV speakers. Of course, the sound can be adjusted to your liking. Since this TV is in a small room, I have no real need for surround sound.Overall, at this price this was a great buy. I certainly would not have paid the retail price for this TV, as I could buy a Samsung for that price. I really didn't need the extras, such as the camera. I didn't even need wifi on the TV, as this can readily be had with a blu ray player. Now, I am glad to have the option of an ethernet connection. I did require a 3D TV and this feature is usually only available on higher end models. Unlike most, I really wanted this feature. All that being said, I am very happy with my purchase of the Panasonic TC-L47WT60 and would not hesitate to recommend it to anyone who asks.", "Date": "January 5, 2014"}, {"Title": "Like having the shows acted out in front of you!", "Author": "easyshopper \"ryd\"", "ReviewID": "R1PW8T7EWXODHF", "Overall": "5.0", "Content": "This is the Flagship 2013 TV before the 4G came out last month.  I waited all this time (since 4/13) for the price to come down to be able to afford it.  Finally got it after Christmas at $1300 on Amazon.  FANTASTIC, I can't believe I've missed so much details all this time with the quality of the screen.  There is NOTHING wrong in any direction with this TV.  We will only use the online features for netflix movies and 3D viewing anytime and probably won't be doing any of the voice/face recognition silliness.  For those unable to see a close up of the actual TV in the ads, it has a 1/2\" silver/chrome edge instead of those fat black edges.  Screen is paper thin.  We got the 55\" so it's not easy to shove around on the table, it is heavy enough to sit snug and you must have help for both sides to lift up to move around.  The base is actually a 1/2\" silver/chrome edge as you see shaped, and a lucite/glass looking L-shaped piece slides in the bottom up thte neck to look naked.  This blends nicely with our white walls.  Also, the bottom of the TVe has a 1/2\" glass/lucite strip that is slightly lit with the Panasonic logo very small in the middle.  You need to have the correct cables though because the old crap from your previous TV probably won't work.  HDMI is needed of course.  If there is any negative, it's the sound.  You have a menu to adjust small aspects of it, but it's still a bit \"man in a can\" sound unless you tweak it enough--the sound is from the back and the reflection from your wall makes a difference.  Most people buy strip speakers for the front, and some day we may do that, but in general it's totally fine!!  The delivery person provided by Amazon came on time, unpacked it, tested it, and took the giant box away.  VERY VERY VERY Happy.", "Date": "December 30, 2013"}, {"Title": "Based on first impressions, there's some quality issues", "Author": "Brian R.", "ReviewID": "R284TW16I1W65G", "Overall": "2.0", "Content": "Update 8/19/2013:I'll keep my servicing updates relegated to the comment section from here on out. I do want to add some user experience notes here, though.Some negatives:-The Viera smart functions are ok.  The interface is nice, but lags quite often.  Shifting from icon to icon, there's often a delay which is not acceptable for a set of this caliber.-I've put away the smaller remote.  Without using the interface much, there's not a lot of need for it.Some positives:+I love the way it handles my Sony blu-ray player.  When a movie is put in and I press Play on the unit, the tv automatically switches to that input and the main remote also controls the player.  This is a great feature.  Unfortunately, it doesn't do the same for the cable box, even though both are connected by HDMI cables.  I'm chalking that up to a crappy cable box, though.+The 3D glasses are quite comfortable - I like them better than the LG's for sitting through an entire movie.+SD slot and the slideshow functions work really well.  This has been great for viewing family photos.  The tv automatically adds some cheesy background music, but it can be turned off.Update 7/25/2013:I had called the Panasonic support line and they scheduled a service person to view the TV.  They sent a 3rd party repair person who was very professional and helpful.  Once entering the service menu, he enabled a mode that cycled the screen through various solid colors.  Although in normal programming and in bright daylight he had trouble seeing the panel defects, it was very obvious in this mode.  He took a picture of the panel with his iPhone to attach to the support case documentation he'll send on to Panasonic.  We also examined the audio-sync issues and he made note of that as well.  No word on the total time to determine if Panasonic will classify this as a true defect and then what they'll approve (panel replacement vs. replace the tv).  I'll update again once I have been provided more info.Original Review:I normally wouldn't leave a review after such a short time with a tv, but in this case it warrents some early criticism.  I really expected more from Panasonic's flagship LED tv, so let me explain why:Either the software within the tv is poor, or I received one with some manufacturing issues.  What I first noticed was that there's a \"hot zone\" on the panel.  My understanding is that for local dimming, this set divides the panel into multiple sections, first by dividing the panel in half side-to-side, then by chopping each half into multiple horizontal sections.  On the left side, about 5/8's of the way up from the bottom, there's a pretty clear hot zone which is brighter than all others, regardless of content.  At first I just thought it was the programming of the show, but as I watched over the course of a few days, I found that it is indeed the tv itself and not the channel, specific input, etc.  Turning off all of the processing (local dimming, etc) seems to have helped, but I shouldn't have to turn it off to get a consistent picture.  I'd also like to point out that it wasn't just local dimming working on other areas, as in scenes that should have been all similar brightness, you could see a clear line of brighter area for the same object on the screen.The other \"defect\" in the image quality is around the edges of the screen.  First, you can clearly see where the LED edge lighting is located by the presence of bright/dark areas, especially in the corners.  I'd expect a panel of this caliber and price to deliver a uniform response, even at the edges.  In addition to the hotspots around the edges, there's an overall dark area about 1/2cm from the very edge of the panel that almost gives a beveled edge look to the picture.To put this in perspective, I don't think anyone in my family (kids or wife) would have picked up on or said anything about these issues.  However, this set should appeal to a household with at least one pretty discerning viewer, and they'd easily pick on these defects.To be fair, I plan to contact Panasonic's support to see if there's any remedy via firmware update or panel repair, but I wanted to at least post my initial observations.Some quick additional feedback while I'm at it:+Overall picture quality is very good, and the enhanced refresh rate looks decent+There's less glare and the polarizing film is less noticable from reflections compared to my LG sets+Really nice user interface that's customizable and very well done+Backlit main remote control, with dedicated netflix button+Stylish 3D glasses, but won't fit over some styles of regular glasses+Easy, voice guided initial setup; good wireless setup as well-Several times when I changed the volume an advertisement is displayed below the OSD for the volume level.  This is ridiculous!-Poor AV sync with my cable box - and there are NO settings to adjust audio delay on the TV set.  No settings on the cable box, either.  It's noticable even to my kids.-Two remotes is kind of redundant, especially since the smaller one is basically just a touchpad with volume/channel controls.-The built in camera can pop up automatically, but must be manually pushed back down.I know there's a lot yet to explore with this seet and I want to give Panasonic a fair chance, but as it is right now, I'm likely to put my LG back in the room.", "Date": "July 1, 2013"}, {"Title": "AMAZING!!!", "Author": "Mary S.", "ReviewID": "R28CC64GON28SH", "Overall": "5.0", "Content": "I haven't upgraded a television in my home in a couple of years, so this TV really blew my mind. There's so much to love about it! I am giving it 5 stars for its capabilities as a 3D television, since that is its primary function.The 3D is simply AMAZING! I'll be honest, I don't watch much in 3D because it does tend to give me a bit of a headache after an hour or two, but on July 4th, I watched Independence Day and the fiery explosions in that movie were epic in 3D. There is a dedicated button on the remote to switch to 3D or back to 2D and the only other thing you need are the glasses. It's very simple to switch back and forth if you don't like to view something in 3D.It's VERY important to have a crystal clear picture to get the most out of the 3D function on this television, so if you're watching on satellite television, make sure your dish is getting the best possible signal. The blu-ray movies we watched in 3D turned out to be the best, but this was because the picture is so crisp to begin with. We have not watched any movies specifically made for 3D, instead, we've just used the 3D function on the remote so we could rate the television's ability to convert anything into 3D and it does this very well. Animated, CG movies are spectacular on this. We watched the Alvin and the Chipmunks: Chipwrecked just to see how it would perform and it's gorgeous in 3D. They really outdid themselves with this 3D feature. Even when 3D is turned off all movies and shows have a much more 3D look to them, particularly if the camera pans around a lot. We've been incredibly pleased, thus far.It has wireless features which allow you to tap into your home's wireless network and access an \"apps\" section. If you're into streaming and Netflix, you'll love it because it has a dedicated Netflix button right on the remote (wonder what Netflix paid to be featured there with a bright red button, logo and all?) Personally, I love the access to a web browser in the apps section. It allows me to easily check my local news forecasts and radars directly from my local channels' websites, which is so much better than the Weather Channel and I find myself reaching for my smartphone a lot less than I used to. It's just so convenient and nice to have something displayed on the 55\" television screen. Most websites look beautiful on this screen. I have a website, so it was nice to see how pretty the site looked on such a large screen. There is also a Youtube button in the apps. Finally, we can watch favorite Youtube videos on a big screen and streamed through my internet wi-fi, they look even better than they do on my new laptop. I was really impressed with this.There is an illuminated LED bar on the bottom of this television. It provides great backlighting, which may be necessary to the proper viewing of this television, but may prove bothersome to some. I am not sure if there is an option to turn this off or not. Fortunately, our unit is on top of a dark-stained wood stand and this dampens the bright glow of the LEDs at night.The television stand is a strong piece of metal with an acrylic piece that just sits inside of it for looks. In the evening, the TV almost looks like it's floating and you hardly notice the stand. Very modern!The picture on this television goes nearly to all of the edges. There is hardly any frame around this, which is pretty cool and the set is so thin, it will amaze you. The whole thing weighs only around 30 lbs, which is also amazing!The television comes with a second remote, which is like a small touchpad. I haven't even used it and see no reason to.The biggest downside is that a some of my older stuff (10 year old BOSE sound system) isn't really all that compatible with the television (we can't get the lips to quite match the words while watching with our Tivo pushing sound through the BOSE.) Using the volume controls on the television solves all of this and fortunately we just got a new Tivo with HDMI, etc, a couple months ago, so all of that was compatible, but now we will have to find a new sound system as swanky as this new television with modern plug-in components. This may or may not solve the problem since there is a slight processing delay on the picture generated by this TV. Might be better to push the sound from the TV to the sound system. We'll get it figured out, eventually. By the way, there are 3 HDMI plug-ins on the television. Right now, we have one devoted to the Tivo and one devoted to the Playstation 3, with only one free. I will come back and update when we find a new sound system that is better compatible to this than our 10 year old one.I also feel the need to address two things that might really tick off some people.1. This television features ADVERTISEMENTS, even just adjusting the volume controls can trigger one when watching something full-screen. The ads aren't huge, more like pop-unders at the bottom of the screen, and they go away relatively quickly, but still. This doesn't bother me because I am so used to being advertised to and like I said, I have a website with ads, so I get it, but some people will really hate this. I do question how they have chosen what to show me in those ads and here's why: We set this TV up just a week before a Las Vegas trip. I never used the web browser for anything related to that trip or watched anything related leading up to the trip or since getting back, yet since we got back, ALL of the ads have been for special room rates at Vegas hotels and casinos. How the heck did they know? Is this a coincidence? It kind of makes me wonder if having this television hooked up to your wi-fi allows them to snoop at things you're doing on those other devices using the same network, otherwise, I have to believe this television is spying on me some other way. Very creepy, either way or it's simply a coincidence. The jury remains out on that one.2. One other slightly creepy feature of this television is the ability to record using it's built-in camera. If you choose to do this, the camera pops out from the top of the television. I guess it's there to leave video messages for family members or use the feature where the tv recognizes different users with the built-in camera (i will never use this), but notably, there is not a button to get the camera to go back down. Instead, you have to manually push it back down, which isn't a big deal, but most people won't bother and I have a feeling this television is snooping. I keep the camera pushed down, simply because I don't like a camera looking at me. I am the type of person that puts tape over the webcam on my phone and laptops. I just don't like the feeling of being watched in my own home. It's one thing to know companies are logging my website visits, etc., and it's another to have a video camera watching my every move in my own house. I do not like it and I will not allow it, so I keep the cameras out of my house or obstruct their view. Maybe I'm too privacy concerned these days, but I don't want cameras in my house watching every little thing unless I'm being paid for it, like the Kardashians.In the end, I have decided to review this television primarily for its 3D functions and if that's what you're buying it for, you will not be disappointed. I've never seen better 3D and I even went to Best Buy last weekend and tried out a competing model/brand and it had nothing on this one!There are two things that remain to be seen and I will update when I figure them out: 1. How long will the TV last? Modern electronics notoriously last a short period of time, but I am optimistic this will last for years, we'll see and I will update you. 2. Is this TV really snooping on me through my wi-fi? I have made a commitment with my husband that nobody will use the browser on the television for anything other than weather or Youtube videos. Let's see if it \"magically\" knows what to market to me next - something that it could only know from my other devices. Very interesting... I'll keep you updated.", "Date": "July 9, 2013"}, {"Title": "next level tv", "Author": "E. Sokol", "ReviewID": "R2ETZOPN8WUZ7Z", "Overall": "5.0", "Content": "Got this tv for nearly $2000 under Nero and I couldn't be more impressed.  I use this aw a computer monitor for gaming and movies and I couldn't be more impressed.  The response time is excellent which is something that is a must for a gaming monitor and the picture quality is the best I have ever seen. I could do without the 240hz as it slows the response time but it is a nice feature to have for movies I suppose.  My last tv was the st30, basically the same model from a few years back except then the biggest they made tit was 37\". I think I preferred the active 3d over this the passive, as it displayed 3d in full 1080p instead of 720p, although I am happy to have 4 pairs of glasses instead of only 1. I also haven't noticed the headache I would sometimes get  with active 3d", "Date": "February 1, 2014"}, {"Title": "Not just a crisp, brilliant television...also a piece of art for any room", "Author": "David A. Burke \"SoCalguy teacher\"", "ReviewID": "R3HE1N3HTPJ89Y", "Overall": "5.0", "Content": "I've had this 55\" TV for 3 weeks, and I couldn't expect more from it. The bezel is almost invisible (1/2\"), and the stand makes it look like the TV is floating. I have it sitting on my dresser in my bedroom, and it makes my bedroom look like a scene out of a futuristic movie when the TV is on or off.For some of the reviewers, they mentioned negatives of not being able to turn off advertisement banners and/or power-saving auto shut-off features. This TV is very adjustable, being able to fine tune it to your exact desire. You can even turn off the Panasonic lit bar under the bottom of the TV bezel if you'd like.It comes with 2 remotes: a standard remote with all of the necessary buttons for menu, options, inputs, etc. It also comes with a mouse-size remote with thumb-touch-pad to surf through apps such as Netflix, Skype, or other movie apps which are built in. The computer processor is pretty fast too, moving you from one page/program to the next.I planned to buy a sound bar to lie in front of my TV, with a wireless sub on the floor. After 3 weeks, I'm opting to stay with a cleaner look of no soundbar, as the surround sound feature on the TV is plenty enough for watching football or movies or Family Guy in my bedroom (and I have a 60\" Panasonic plasma connected to a receiver, sub, center channel, and two tall floor speakers in my living room).Some people gripe that the pop-up camera needs to be manually pushed back down when done. Yes. But how often do you have to do that? And that's one less mechanical pulling part that could have broken over the next 10 years that I hope to be watching this TV.If you buy it, go to cnet.com and enter their suggested color settings. I'm very pleased with this television.", "Date": "January 20, 2014"}, {"Title": "Awesome tv", "Author": "Linda Garrison", "ReviewID": "R2ZJJP3O0BULIW", "Overall": "4.0", "Content": "This is an awesome tv.  The picture is so crisp and clear.  Set up was easy.  The has far more features than we will ever use. My only complaint is the tv times out and shuts down when it thinks you are not watching. An energy saving feature, but annoying", "Date": "January 17, 2014"}, {"Title": "Great until you turn off the lights", "Author": "adam", "ReviewID": "R2YSAQ4BSW8Q54", "Overall": "3.0", "Content": "Amazing picture, better than my 4k off brand tv. But whe. You turn off the lights and you see hotspots everywhere. If it wasn't for the hotspots ipi would rate it 6 stars.", "Date": "January 15, 2014"}, {"Title": "great tv", "Author": "Buddha", "ReviewID": "R2NZFDOHQGK36Q", "Overall": "5.0", "Content": "Bought this baby in Dec '13 back when the price made it a steal (~$1200). The product has yet to disappoint. Out the box, the colors weren't optimal, but after a little tweaking, the image is beyond satisfactory. My only gripes are that there is a bit of light bleed at the corners (reduced by changing the A.I. settings) and a noticeable \"bloom\" effect when bright images are surrounded by black. Perhaps a bit more tweaking would resolve this but I'm no expert. All in all, this is a great tv. Purchase is highly recommend.", "Date": "March 30, 2014"}, {"Title": "This is one beautiful TV", "Author": "MeNotYou", "ReviewID": "R35JO3TPMQOGEJ", "Overall": "5.0", "Content": "I purchased this TV for my parents who were still on an old tube TV, after unboxing it I was blown away by the sheer beauty of the TV.  The TV has an ultra slim bezel that looks non-existent and a clear acrylic base that gives the appearance of the TV floating in air .  The colors of the picture were vibrant and crisp.  The TV allows you to create/customize a home screen with the apps of your choosing (like Facebook, YouTube). Using it's built in camera the TV can also be used to make Skype video calls, of course that would have been overkill for my parents, so I didn't set it up. The TV comes with 2 remotes, one is a normal style remote and the other is a simpler remote that has a touch pad that you can swipe to navigate the on screen display. The secondary remote also allows you to operate the TV using voice commands, which comes in handy when using some of the web apps because it does Text-to-Speech. I personally am a plasma person and prefer those to LCD, but this LCD displays its picture at 240Hz and uses an \"advanced 8-Phase, 4,200 Backlight Scanning technology employs fine light-emission control to minimize flicker and ensure smooth images without afterimage effects, even during high-speed action scenes in movies or sports programming. You get remarkable sharpness, clarity and contrast with virtually no image blur.\"  I definitely agree with Panasonic as I noticed little image blur.  Having built in WiFi is a plus since this truly is a \"Smart TV\".  One other thing that I like about this TV is that it included 4 pairs of 3D glasses (extra glasses are fairly cheap too).  The 3D picture and 2D to 3D conversion works well and didn't cause any eye strain.All around I would say that this TV would be an excellent choice for anyone, people new to HD TVs (yes there still are those living in the past) or people who are looking at fully featured TVs at a great price point.", "Date": "March 6, 2014"}, {"Title": "Great picture, cool apps, great 3d.", "Author": "Devildogdiaz", "ReviewID": "RWWWVPO802HWH", "Overall": "5.0", "Content": "The customization of the settings really makes this TV Stand out. It really allows for great picture on an lcd. The 3d is great. I'm always looking for 3D movies to buy. The only downside I would say is sound. But that is to be expected in a slim frame such as this. Hence why sony introduced the new wedge model. The sleak look of this TV also stands out above the rest. It looks very modern and stylish. Good job Panasonic.", "Date": "February 15, 2014"}, {"Title": "Great vibrancy, contrast.  Backlight uniformity could be better but great for inner part of screen.", "Author": "grover", "ReviewID": "R1E6RY34M1YI75", "Overall": "4.0", "Content": "Pros: Great vibrancy & contrast.  Fast Smart TV, very quick to get Netflix / Hulu / Amazon video up and running unlike many other \"Smart\" TVs.  Skype is a fun addition and would be great for anyone who communicates via Skype a lot - the microphone picks up speech quite well.  Great local dimming (the entire backlight can be dimmed) to get great darks in dark scenes.  I feel like you'd have to go Plasma to get better darks, but here you get the benefits of LED/LCD when the room is bright too.  Kind of getting best of both worlds, except for a few minor cons below.Cons: By design has some corner uniformity issues and dim edges (~4mm), but this is symmetrical and with the lights turned out the image kinds of blends into the dark on the sides which makes this ok - it's more distracting when the lights are on.  Other issues are not normal and if you see that you should contact Panasonic/Amazon for service or replacement.  In my case, Amazon replaced TV without question.  On the plus side, the lighting is quite uniform towards the middle which is where your focus usually is.", "Date": "February 3, 2014"}, {"Title": "Great TV at a bargain price!", "Author": "Ron Cousino", "ReviewID": "R148B81B2RZBK1", "Overall": "5.0", "Content": "Best TV I have ever owned and I have had LG and Sony.  There was nothing I did not like.", "Date": "January 17, 2014"}, {"Title": "TV is great", "Author": "Allison Wilhelm", "ReviewID": "RNEJSDZR1ZVYO", "Overall": "5.0", "Content": "We ordered this right before Christmas as a family gift. VERY impressed. We have been very happy with it. Easy delivery and easy set up.", "Date": "January 17, 2014"}, {"Title": "beautiful picture.", "Author": "Dyana", "ReviewID": "R2V5OTK1S6GBG8", "Overall": "5.0", "Content": "the seamless frame is very nice!  nice size, great 3D viewing also.  i would recommend this tv.  a great buy.", "Date": "January 16, 2014"}, {"Title": "Incredible TV", "Author": "brad b", "ReviewID": "R2P8M30L9QK59E", "Overall": "5.0", "Content": "I was moments away from buying a Samsung 55\" when a \"techie\" friend of mine told me about this television. Samsung of course has become a household name with LCD televisions, and for the money they must have the best models right? All I can say is that the picture on this Panasonic is ridiculous and I don't know if any Samsung can come close to it. My wife who rarely is impressed with stuff like this was blown away.I mounted it on the wall and with the bezel so small and the screen so thin, it looks like the image is floating there; very impressive. I've never seen a tv as beautiful turned off. Everyone that sees it comments about the design which makes other televisions look vanilla.Best purchase I've made on Amazon.", "Date": "January 5, 2014"}, {"Title": "Panasonic TC-L55WT60 55-Inch  -  great purchase", "Author": "Ezra M.", "ReviewID": "R1NQQTB6AKEM3Z", "Overall": "5.0", "Content": "so i received my fancy panasonic.TV Look -  awesome and sleek..looks way better than most tvs out there..  the samsung 8100 and sony xbr probably look more sleek but this tv is  really sweet for $1100, which was the discounted price i got.Applicationsapps selection is good on the viera and work pretty good.. the 240 Hz provides very good navigation as opposed to the Sony KDL50 550R which i just returned.  I have always used sony products but the KDL50 550R was a little too slow compared to this panasonic.Picture quality is awesome,  requires a bit of fine tuning and takes a while to get used to..sound is pretty good and the remote works just a great and as expected...u will not regret this tv especially if u get it for under $1200.. as far as i'm concerned its worth the $2000 for which i didn't pay..", "Date": "January 25, 2014"}, {"Title": "Serious inherent problem with unit and unsatisfactory customer support", "Author": "JM \"JM\"", "ReviewID": "R1QOO6TPL89S36", "Overall": "1.0", "Content": "There are bright strips and shadows near the left and right edges of the screen probably caused by the backlight controls noticeable after about 2 months of purchase. Service came and replaced the screen and the backlight control panel over a period of 3 months but the problem still exists. Panasonic simply threw up their hands and offered to refund the price as they told me it is not cost effective for them to repair the unit. I requested for other options such as replacing the unit with current model but they were not going to do that. This tells me their customer service is not flexible and not catering to customer satisfaction. Extremely dissatisfied and disappointed.", "Date": "May 19, 2014"}, {"Title": "Problems after 5 months...", "Author": "Joe", "ReviewID": "R2Q5QA4SDTBY5R", "Overall": "1.0", "Content": "Upper left quadrant of the screen developed a shadow about a week ago.  Today the TV started shutting off on its own.  Used the 'self test' feature and the screen went black.  I contacted Panasonic today - will update this review after I deal with Panasonic.", "Date": "May 17, 2014"}, {"Title": "Excellent with one exception", "Author": "Michael  J. Cuttler", "ReviewID": "RQRKGI8JPOW3G", "Overall": "4.0", "Content": "First off, the external design of this set (silver edges, clear Lucite lower) is very attractive in a contemporary setting and the picture on this set is absolutely amazing, right out of the box. Thanks to the unusually powerful backlight the set performs marvelously in a bright room and is comfortable to watch at very wide viewing angles. We don't watch 3D very much but we have tried it once or twice and were pleased with this effect as well. The basic sound (coming from the internal speakers, which face the rear) also seems pretty good compared to others we have had in this room. Nonetheless, we plan to add a soundbar soon as the sound is still pretty basic.The one issue I have with this set is the apps and browser functions which, IMHO, are not particularly  \"Smart\". The interface is not really intuitive and many of the apps themselves are very difficult to navigate. Help functions are very scanty and rarely helpful. I found the web browser pretty much impossible to navigate and not very useful. That said, who buys a TV for internet apps anyway? Stick a Roku (or your choice of appliance)  on the back, or in one of the USB ports and/or attach it to one of the multiple HDMI inputs and this problem is solved.In general, I am pleased. I think this is a good set, superior in overall design and quality to some of the other brands and worth the extra few dollars.", "Date": "May 2, 2014"}, {"Title": "The Pizza delivery girl said it looked like it was from the future.", "Author": "NeillooftheNorth", "ReviewID": "R14NKQXP0WN6UY", "Overall": "5.0", "Content": "This tv demands to be on the wall. The bottom lighting really does make a difference. The picture is amazing. A toslink cable puts the sound through an amazing third party home theater system. We haven't gotten to the voice recognition, or the camera for skype yet. The Netflix button on the remote make seeing Netflix amazingly easy. I had a real issue with delivery. There was some discretionary grey area about who was responsible for a tv that fell over. Because the enhanced delivery was not available, amazon took full responsibility for the freakish chain of events that led to the TV i bought originally. That model was no longer available, so amazon gave me additional credits, and covered almost all of the replacement price for this upgraded model. The pizza lady was right. It's an amazing tv. Amazon is customer centric.", "Date": "March 27, 2014"}, {"Title": "Exceeded my expectations", "Author": "PETER F RIZZO", "ReviewID": "R3933NFXCCA4RF", "Overall": "5.0", "Content": "I'm not a videophile but just someone who likes a good picture and features. This TV has been perfect since the day we set it up - couldn't be happier", "Date": "March 8, 2014"}, {"Title": "Found the ONE!!!", "Author": "Ian A Nazario", "ReviewID": "RX8TYO9H0CPYC", "Overall": "5.0", "Content": "Looking for a TV can be a long process, but was made easier with the Panasonic. Great PIC, Good features, and Great Price!!!!!", "Date": "February 22, 2014"}, {"Title": "Most important thing is the TV looks beautiful, its so thin!", "Author": "Gurdeep Singh \"Gurdeep\"", "ReviewID": "RASJN9Y6BJVN1", "Overall": "4.0", "Content": "Let me start with the only negative for me, which is it doesn't play flash streamed videos, for example if I want to watch something streamed from my browser it wont work. But mostly many don't stream videos on browser in US since everyone uses Netflix and other apps, but still in case you wanna do it like me it would be a problem. If not for it I would rate the TV 5 stars.It is my first LED TV, started with LCD then had a plasma, so I am not sure if it is an issue or not but let me put it here, there are some kind of bright spots at the edges. when you are watching any programs you don't feel it but you can clearly notice them when there is a solid screen for example that red starting screen of Netflix. Sometimes when I watch sports I realize it, again not sure if that's how LED TVs work.I had a dead pixel with one of these TV and Amazon was just awesome got it replaced, so hats off to them.Other than that I like the way the TV looks so thin and beautiful, adds a nice look to the house. Very elegant build TV. Just integrated well with my receiver so when I watch apps on my TV the sound comes from my external speakers. What else not used 3D much, need to find something that is worth watching in 3D. Just hoping this TV works for a long time, because my previous plasma I bought from best buy broke just exactly after 2yrs which was also end of my coverage.Any other questions about configuration I can answer, and would love to hear from folks about the bright spots on the edges?", "Date": "February 20, 2014"}, {"Title": "Really nice TV", "Author": "techsavy", "ReviewID": "R2AYTJIQ0U6ZFO", "Overall": "5.0", "Content": "The features in this TV are unbelievable! The picture is awesome. Bought this TV at amazon's after Christmas sale, and I feel like I got a steal. The TV is a great addition to my living room. All around very happy with the purchase especially for the value I got.", "Date": "February 17, 2014"}, {"Title": "Great TV", "Author": "Kurt Apen", "ReviewID": "R3B9UA30MQXOFZ", "Overall": "5.0", "Content": "For the price- I found this on-sale on Amazon for just $1,100- it is a great TV.  The picture and set-up were easy.  Amazon dropped the price by roughly $50 a day or two after I bought- but I found the price guarantee link and they gladly refunded me the difference.The Viera cast interface is well done and very responsive.  I like the dedicated goto Netflix button on the remote - make it easier for my family to navigate.", "Date": "January 25, 2014"}, {"Title": "Great tv", "Author": "STEPHEN T ALTIMARI", "ReviewID": "R9US9DWBBE2M", "Overall": "5.0", "Content": "Everything I expected and more. The TV was very easy to set up and just as easy to use. The picture quality is excellent. Only negative I can find is the pop up ads which are barely noticeable.", "Date": "January 10, 2014"}, {"Title": "PATIENCE", "Author": "Ruth", "ReviewID": "RE4TLIHV9I2YE", "Overall": "4.0", "Content": "At first when I got it, I wasn't all that impressed with the picture. While it wasn't bad, I had high expectations for it because it is a few years newer than my plasma that I replaced it with and the pic was very similar. For the price that I paid for it, I wasn't too disappointed, but I guess I was expecting more. After adjusting the settings and through trial and error I began liking it more and more. Don't know if my eyes have adjusted, but I am still finding myself changing the settings as I watch different things, i.e., football and basketball games or just a movie, which I don't recall having to do with my plasma. The upside to that is that once I change it and find what I am looking for, the picture is excellent! Would I recommend this tv...yes. As far as the settings go, I believe it is all in preference. I tried the settings that were listed from a website that was given by another reviewer on this tv which I believe were from a professional review and it wasn't for me. I think it all depends on the person. The picture is decent out of the box, but isn't for everyone who is switching from a quality television. Those who already have a quality television may need to adjust the settings to their liking and will definitely find what they are looking for in picture quality through trial and error. But please be prepared to play around with it. If I would have reviewed this television right out of the box, I probably would have given it 3-3.5 stars. I am now at 4.5 stars because I haven't yet found the perfect setting that looks great with everything, and like I said, I am constantly changing the settings depending on what I am watching. I don't recall ever having to do that with my plasma. I'm sure that I will find a setting that suits everything and will later give it that full 5 star review that I am sure it deserves.Please remember, this is just my opinion and not everyone will agree, but I do hope that this helps those that are interested!", "Date": "January 6, 2014"}, {"Title": "Panasonic TC-L55wt60 55-inch", "Author": "Juan D Jimenez", "ReviewID": "RTKTZOAFUGX5C", "Overall": "5.0", "Content": "Best TV I ever bought because of the picture quality better than my Samsung PN59D8000 59-Inch 1080p 600Hz 3D Plasma HDTV (Black) with a few adjustment on the picture quality but you have to know what you doing, if you can't do it yourself you can have some one else calibrate your TV for the best picture quality for the TV.", "Date": "February 16, 2014"}, {"Title": "Great TV", "Author": "Cecilia Aguillon", "ReviewID": "R3T6721KPYFA5V", "Overall": "5.0", "Content": "I got my TV a month ago and love it. Easy to set up. I'm still getting to know all the cool things this TV does!", "Date": "January 30, 2014"}, {"Title": "The best", "Author": "lysander roberson", "ReviewID": "R1K47AE3ENSG7R", "Overall": "5.0", "Content": "Great tv best tv I've ever owned, 3d is amazing and video games also if your lookin for the a tv with 3d and hd this is the 1", "Date": "January 12, 2014"}, {"Title": "Its is a good TV and good buy", "Author": "bhartrihari misra", "ReviewID": "R2N59S61JL13X3", "Overall": "4.0", "Content": "I like it . It has good picture quality. Only problem is that we can not play few format of streaming. The VIERRA APPS for IPAD and IPHONE is also not very great.Overall I am happy with the TV", "Date": "March 23, 2014"}, {"Title": "Good tv but not great.", "Author": "Dani \"Dani\"", "ReviewID": "R1U1UEDVPWIXOA", "Overall": "4.0", "Content": "I just get mine.The firs thing that you will notice is the light bleed in the four cornres. The screen is very dirty, you will notice it when a plain color image is displayed. The network interface is great, you can see video and pictures from a router in a snap.I will update a soon tes it better.Update:Hi, the price is stunning, but this tv at night is not good at all, you can see the cloud of light trespassing the screen from side to side, killing the picture.Another thing is that the picture is not cristal clear, is like blurry and everything looks washed this tv looks like a plasma.If you will use it just to play games , this is the tv, not at all for watch movies or anything at night, I am waiting for the truck to pick it up back to amazon.", "Date": "December 21, 2013"}, {"Title": "Like cristal", "Author": "Yanick Saindon", "ReviewID": "R30SST2RBAECE7", "Overall": "4.0", "Content": "First flat TV ever for me. Would like to have a better instruction book for all gadget in it, even if the help guide is in the TV.", "Date": "January 27, 2014"}, {"Title": "good is enough ...but not", "Author": "mariano", "ReviewID": "RYLBM3OZ0I7K1", "Overall": "3.0", "Content": "Nice tv led 3d good quality imagen but isn't good sound & to over price. .$$$$$ intern is.suck no good quality", "Date": "January 27, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "Viera Connect With My Home Screen Swipe And Share Voice Interaction\n3D IPS LED LCD TV\n240 Hz Backlight Scanning\nBuilt In Camera\nTV without stand (Width x Height x Depth): 48.3 X 27.7 X 1.23 Inches, TV with stand (Width x Height x Depth): 48.3 X 32 X 14.2 Inches", "Name": "Panasonic TC-L55WT60 55-Inch 1080p 240Hz Smart 3D IPS LED HDTV (Includes 4 Pairs of 3D Polarized Glasses with Built-in Camera)", "ImgURL": "http://ecx.images-amazon.com/images/I/41OyjqS3xuL._SX300_.jpg", "ProductID": "B00BECKOBI"}}