{"Reviews": [{"Title": "Great TV", "Author": "gendy", "ReviewID": "RARU33FLMQKHG", "Overall": "5.0", "Content": "Samsung never fails. The previous model had outstanding picture quality and I didn't know how they can further improve it. First let's look at the dimensions, the previous model (UN55ES7500) is 48.8-Inch x 28.7-Inch x 1.2-Inch this one is 48.4 X 27.6 X 1.4 Inches without the stand. Surprisingly Samsung didn't make the TV slimmer actually it added 0.2 inches in thickness but it decreased the frame size to compensate for it. The TV was securely packed in a large box and it seemed to be very well protected so don't worry about buying this TV online. I tested this TV by watching a blu-ray disc, a dvd and playing Black Ops II on it. The blu-ray movie I watched was 300. I've watched this movie at least 15 times before but watching it on this TV was a different experience. I was looking for any flaw in the TV but couldn't find one, the colors were so rich and bright and shades were clearly distinguishable. This TV combined with a blu ray movie is enough to make people working for movie theaters go out of business, it is this good. The second movie I watched was dvd quality, I did this because blu ray looks good on any tv so I had to be sure. The movie I watched was Monster Inc and mike have never looked greener, the picture quality was good and the colors were vibrant. The last thing I tried on this tv was playing Call of Duty with my younger brother, this would allow me to test the sound of the TV. We played multiplayer split screen which means that the screen is divided into an upper part and a lower part, usually this interferes with the gaming experience but the tv's screen was large enough for us not to notice it. The sound of the tv was really good but it needed a subwoofer for additional bass, I would recommend a Polk Audio subwoofer if you want your system to be complete. The stand looked nice and I am very pleased with this purchase. My dog never watched TV on my old 32 vizio but now he declared the middle spot on the sofa and seem to be enjoying this TV as much as I do. Feel free to ask if you have any questions :)", "Date": "May 8, 2013"}, {"Title": "Picture good -- firmware not so much", "Author": "Alex Neihaus", "ReviewID": "R2XK745AF84JUA", "Overall": "2.0", "Content": "I upgraded to the UN60F7500 from a six-year-old Sharp 46\" LCD. So you can imagine how much better (and bigger) the picture looks. Yes, it's great though I am not sure how much of it is due to my eyes adjusting to a much bigger screen and how much of it is just the progress of the technology.Still, there are somethings I take issue with.1). Out of the box the motion compensation and color balance tend to make things look extraordinarily artificial -- but in a an attractive way. That is, if you don't mind your TV looking like it's not real, you're all set with the defaults. I set the TV to some recommendations I found in the UN60F7500 forum on avsforum.com and things look much better to me.2). Even after an upgrade, the TV occasionally crashes and reboots. That's a change for me from the Sharp which was just an appliance. The firmware is buggy. For example, when set to power on and power off my FiOS STB, it will only power it on.3). The remote is, in a word, awful. It has Bluetooth lag. It doesn't allow basic channel jumping without a complex sequence of strokes. It requires too many different presses to do simple things. The sensor strips at the top and sides are both too sensitive and not sensitive enough. Give me back my 2007 Sharp button-filled remote!4). I miss a printed, complete user manual. The online \"E-manual\" is insufficient. Feature details are missing and illogically explained. Samsung documentation ranges from stilted US English to incomprehensible.5). If your viewing position is below about the midpoint of the screen, you can forget using the camera. It pops up to be flush with the top bezel. It's not possible to tilt it down.All in all, it's a very nice upgrade. I took what I perceived to be a risk buying from Amazon but all went smoothly. Of course, this doesn't say much about what would happen if things didn't go well. But if you are playing the odds, they're in your favor with Amazon.Update 2013-06-29While I am enjoying the picture quality, I wanted to update this review to say that it's for some SERIOUS firmware issues, which I have only begun to experience as I got more familiar with the TV.1). Most Samsung apps don't really understand the 2013 Smart Remote, causing all kinds of odd, inconsistent interactions. Some get so stuck that even a power off/reboot doesn't reset the EV2), The DLNA functionality is MESSED UP. I have a Netgear ReadyNAS -- it's got an excellent DLNA implemenation. But the UN60F7500 cannot read the directories when selecting \"photos\" but can read the same directories when selecting \"all\" content. Go figure.Samsung promises an update in February -- until then, if the Smart TV portion of this device is why you are buying it, I'd recommend you hold off.", "Date": "June 23, 2013"}, {"Title": "Terrific TV (won't be beat until 4k & OLED come out)", "Author": "Evo Owner", "ReviewID": "RLT35T28Z22DR", "Overall": "5.0", "Content": "This is fantastic TV with a great picture, snappy fast menus, and a very low profile look. I'm sure that you can read about the detailed features in the description, so I'll just mention what mattered to me when deciding:When comparing the F7500 to the 8000 (1 model up) and the 7100 (1 model down), there are just a few features that change (e.g. blur reduction, micro dimming, webcam). Frankly, you can't tell the difference in picture without a side-by-side comparison and some really keen eyes & the webcam isn't useful enough to change anyone's mind. The deciding feature for me was the faster quad-core chip and the Smart Evolution kit compatibility. In short, the menus on the 7500 and 8000 are just faster. Netflix, Hulu, Pandora, and especially Plex all load and play faster with the faster chip than on the lower models. Also, this chip only upgradeable ($200 extra kit later) on the 7500 and 8000. That means the top two models will be faster longer; the 7100 and below will not be able to be upgraded. Truthfully, I think Samsung is completely aware that the 7100 or even the 6300 are as good picture-wise as the upper end TVs, so they put in a slower chip and locked down the upgrade ability to force you into the higher end model. That was the case for me anyway.All in all, it's a great TV and I'm very happy with my purchase.Pair it together with a Sanus LL11-B1 mount from Crutchfield for a terrific low-profile that puts the screen <1\" from the wall.Pros:-Some useful SmartTV apps especially Plex, Netflix, Hulu+, and Pandora. If you don't know what Plex is, Google it immediately. It's basically a free Roku in your TV for playing your own music, movies, and pictures. Amazing! -Great picture, which is made even better with the thorough picture settings -Small bezel (~1/4\") and thin panel (~1/2\") -Very fast menu navigation due to quad core cpu -Wireless (this is 802.11 N, so it's very fast) -Camera can be hidden (unlike last year's modelCons:-The motion detection is gimmicky and not particularly useful. I hid the camera. -The SmartTV stuff is cool enough but not as good as a standalone Roku, AppleTV, or WD Play. -NOT A TOTAL CON, but the remote is a little different. What's great is how small, fast, and low profile it is. What's annoying is that is has so few buttons, that many inputs and options (ex. for a DVR) are hidden in secondary menus that require additional clicks to get to.", "Date": "November 29, 2013"}, {"Title": "Picture is magnificent", "Author": "Zenster", "ReviewID": "R3NP6FHGIJ0NKE", "Overall": "5.0", "Content": "We did our homework and chose this Samsung 7500 to replace our 8 year old 42 inch plasma. Amazingly this 55 inch screen is the same size as our 42 inch plasma with 6 inch borders. Easy to set up and get going. As I said the picture is magnificent. Took my wife and I a while to agree on which picture setting - dynamic, standard, natural or movie.We compromised movie for movies and natural for all else. Easy to switch using Samsung remote.At first we IR'd the Samsung remote with our cable box but did not like how it complicated things when you just want to turn on the TV, so removed it and now we use cable box remote for TV viewing and samsung remote for everything else.I like the clear voice setting for sound as it seems to subdue the background noise so you can follow dialogue - another great feature of this TVThe switch to web and use of the web browser was so easy, I easily attached an old wireless keyboard to a usb port on TV.", "Date": "June 14, 2013"}, {"Title": "Great Picture, but some serious flaws", "Author": "cmoisuperlea", "ReviewID": "RD95EV4RSALYY", "Overall": "4.0", "Content": "I purchased this product two days before black Friday.  I saw an amazing price online and amazon matched the price because of a price guarantee.  I paid just under $1,200 tax included.The good:- the picture quality is absolutely gorgeous- the look of the tv is really great with the very slim bezel (i'm not a big fan of the tv stand that it comes with; its made of cheap plastic)- the remote takes a little getting used to, but once you've mastered that, its a pretty nice remote- this model comes with a web cam which is a nice feature for skype calls- 3D feature is pretty sweet.  I've watched a couple of movies in 3D and I was really impressed with the quality.  If you're streaming 3D movies make sure that you have a really fast internet connection as it takes a significant amount of data.The ugly:- serious wi-fi issues.  I'm having a lot of problems with wi-fi connectivity.  Although the TV shows a full signal to my wireless router it seems to drop the signal.  Sometimes it can happen 10 times during one movie!!!  That can be extremely frustrating.  Once it drops the signal it takes several minutes to reconnect to my router (apple airport) even though the TV see's the router in the menu and it displays full signal strength.  I have spoken to Samsung tech support and they told me that its not their fault because the router is in the room next door and not in the same room as my TV.  I think that's a pretty stupid excuse and defeats the purpose of having a wifi connection.  Tech support over the phone was pretty unhelpful.  I did my own fiddling with the settings and tried changing the channel on my router in case the problem was with interference from other devices, but I've still been unsuccessful in solving this problem.  I'm curious to see if other people have similar issues.- like most new TV's, the speakers are on the back and so if you have your tv set inside a wall unit (mine is inside a 4X4 ikea expedit shelf) then you lose a lot of your sound.  I think that's expected from most ultra slim tv's today and so a soundbar is a must.- When the TV is showing a dark or black image, you can see white shadows in the 4 corners of the TV.  I'm not sure what the cause of this is, but its pretty annoying.- annoying soap opera effect.  There is a function on this TV which makes your picture look like you're watching a soap opera.  If you're like me, don't worry, you can disable this feature really easily!  Press the menu button and go into the \"picture\" menu.  Scroll all the way down to \"picture options\".  Then scroll down to \"auto motion plus\".  You can then turn this off completely or choose one of the 4 other options available to you.I've only been using this TV for a few weeks now.  I will update this review when I have a bit more time to play with some of the other features.  I'm giving this TV 4 out of 5 stars because of the wifi issues.  I don't have cable TV at home and only stream movies online.  Wifi connectivity is extremely important.", "Date": "January 1, 2014"}, {"Title": "The interface and Smart TV features are disappointing; the rest is OK.", "Author": "Andrea", "ReviewID": "R2149SRN7SX11D", "Overall": "3.0", "Content": "This December 2013 review is for the 46’’ model (UN46F7500). In general it is good quality, but many of the advanced features (Smart TV) do not work as expected. This is disappointing because those features are probably the reason you would like to buy this model. I suggest you buy the more inexpensive model which is much better value.PROs:- Assembling is easy, however, if you are not particularly strong, you need two people.- It’s very stylish. It’s incredibly thin and the bezel almost disappears.- Picture quality is OK; the only problem being the black levels which are not that black due to the backlighting technology; this is the price you pay for having a thin screen.- The camera's picture quality is great.- 3D works very well; slightly better than at the movie theater. (I personally get tired after a few minutes.)- There’s a 2D -> 3D conversion function. I have no idea how it works, but they manage to give some 3D appearance to 2D movies. Really impressive. (I know, you might say, “it’s not possible”, but they actually managed it.)CONs: The biggest disappointment is with the “Smart” features, the apps, and the interface:- Currently Skype doesn’t work well. After a couple of minutes, you stop seeing the images from the other sides, while they continue seeing you fine. I spent some time in the Skype support forums and it looks like this has been a known problem for sometimes, and Skype says it’s Samsung’s fault, and Samsung says it’s Skype’s fault. Very disappointing. Using Skype was the main reason I bought this model with the camera, and it’s unusable right now, with no solution in sight.- There are some weird limitations in what picture options you get according to the source. If you use external HDMI sources you can select all options; however if you use Netflix or Plex then you cannot select options such as “cinema black”. It just says “this option is not available” without explaining what’s going on. It took me a few days to understand it depends on the source.The interface is terrible:- The newly designed compact remote is not that usable. The trackpad is way too sensitive; for example, often I mistakenly exit a Netflix program by swiping left by mistake. Many apps are designed assuming that you can easily press “A”,”B” etc, but the remote doesn’t have those buttons anymore. Now, you have to navigate through menus to reach a “virtual” remote. I’m considering buying a regular remote.- The microphone is not sensitive. I couldn’t get voice commands to work without yelling towards the TV.- Similarly, the gesture-activated commands are mostly useless to use; it’s tiring to wave in the air for several seconds, while you could reach for the remote with less effort.In conclusion, a better value for the money would be to get an inferior model (F7100 or the 6 series, even) because they have the same picture quality without the Smart TV features, and then rely on a Roku or Apple TV to give the “smarts” to your TV.", "Date": "December 23, 2013"}, {"Title": "Nice! 3D works great!!", "Author": "Shashi", "ReviewID": "R20S857K6MDE49", "Overall": "4.0", "Content": "Works great. Have been reading/hearing about spontaneous restarts...had it happen once since I bought it. The screen goes GREEN for a few seconds and then restarts. But it happened only once and I was jumping between the installed apps. The 3D glasses work pretty neat. I could watch a regular 720p Youtube video in 3D. Was very good quality. The set-up is a bit tiring to get through, but is well worth it. The smart remote is not too useful. The volume and channel buttons on the Smart remote are VERY hard to press making it pretty much useless. The \"Hand Waving\" function starts up...looks like a lot of fun to use but your arms get tired trying to learn it. The built in camera is super for Skype chats! The video is pretty wide and covers our full 3 seater couch (set at ~8-9 feet from the TV). Still haven't seen the performance difference in the 240Hz compared to the 120Hz. I got it on Sale, so am happy for the price I had to pay. I would not recommend full price though. Have Fun!", "Date": "August 14, 2013"}, {"Title": "Good TV If your budget allows", "Author": "Del", "ReviewID": "R27C7X7QSOUHJQ", "Overall": "4.0", "Content": "We bought this TV 2 weeks ago, so far we're happy with what we got. Here is what I think about this TV:1- The TV looks very elegant with the very thin frame.2- The picture quality is good, you will see a difference in the picture quality in compression to a lower end Samsung Tv's but not even close to what Samsung and the sales guy claim, I think these days most of the TV's at this price range will give you a good quality picture.3- I like the voice control it comes handy and fast in searching TV channels for example when I talk to the remote control asking for golf channels a list of all channels playing golf comes on the screen.4- I also like the motion control feature. It's fun and conveyance when the remote control is away from you. I work on my laptop while the TV is playing the back ground, so it's great to control the tv with a move of your hand. For my friend in the previous review who complain about their arm getting tired when they do the motion gestures I say a little exercise on your couch is beneficial lol5 The camera picture quality is not the greatest and it depends to a great extent on the light source amount and direction in the room6  To the few reviewers and readers who don't read the manual like me and who complained about the camera is showing only the tip of their heads I say the fix is easy the camera has a little switch on the back that controls if the camera is looking up or down7  The quad core computer processor is fast and the speed of surfing is noticeable in compassion to the dual core TV's8 The remote control is elegant, small and efficient, I think the large remote control with million buttons will become a dinosaur in the few years.9 Finally I say the TV is worth the money if you're welling to pay the extra $ for the extra features.", "Date": "January 11, 2014"}, {"Title": "great hdtv", "Author": "pjay \"pjay\"", "ReviewID": "R8DBIOK41KSD4", "Overall": "5.0", "Content": "this ia great tv if you are searching for amazing picture quality.the 240 hz motion detection does its job while watching fast movie scenes.HD picture resolution is great, color reproduction is very close to natural and unique.my wife says she sees the soap opera effect when the tv is in standard mode.  when switched tomovie mode it goes away though.i had a plasma before and the experience was different. the colors  are less softer withLED and it takes time to get adjusted . do not mistake the loss in softness as a reduction in quality.LED/LCD is a different screen than plasma.the things that i dont like are the remote control which is not very user friendly , the software can be improved in general and SD/analog  quality is not that great.", "Date": "October 25, 2013"}, {"Title": "Fantastic", "Author": "mike", "ReviewID": "RJQCLVBAJARY", "Overall": "5.0", "Content": "TV is great.  We replaced a 5 year old LCD and the quality is so much better.  Amazon is great, I ordered it late Wednesday night and was enjoying it on Friday night.", "Date": "June 9, 2013"}, {"Title": "Defective WIFI Card", "Author": "zafor ahmed", "ReviewID": "R372NMU6D9WALT", "Overall": "1.0", "Content": "I have purchased this TV on December 2013 and after three months the WIFI started malfunctioning.Every 5 to 10 minutes the connection will re-set and I will have to re-connect to my wifi by going to network setting.I have called Samsung Technical Support for at least 12 times by now and it was probably the worst customer service I have ever experienced.  After 5th or 6th call they told me the problem is my router is not next to the TV. When I told them the WIFI signal is showing at the full strength on the TV they told me to Connect my TV directly to the router using a cable!!! Why on earth some would buy a smart TV if you need run 10 cables behind it ??  Didn’t make any sense to me. They would not send anyone to fix the issue.Bottom line is – The WIFI module probably defective on this TV and Samsung would do anything to avoid providing any helpful technical support as part of the warranty, so the Samsung warranty is just as good as a piece of a paper.I have submitted this review on the Samsung website and they rejected this review, So don’t TRUST ANY REVIEW  posted on Samsung website as They ONLY Post Positive Reviews !!!  I have the Review Rejection email from Samsung if anyone like to see it !", "Date": "May 5, 2014"}, {"Title": "It's all in the Specs", "Author": "Kevin Shaffer", "ReviewID": "RTKJHLPJQX6EE", "Overall": "4.0", "Content": "Specs don't always translate but in this case they do. This TV has a quad core processor and 960Hz (effective via their clear motion tech) refresh. You'll see that, and appreciate that quad core speed when using the apps! I would like to give this TV a 5 but it still has some quirks. Sometimes the smart wave technology is a little disappointing. You'll probably say, I'll never use that, but I said the same thing until I realized that with my hands full of food/drink I could wave at my tv to change channel or raise/lower volume. It is cool and worth a try. I would definitely recommend this TV. Lastly. My TV sat slightly crooked on the stand. I like how this TV has some height above the stand unlike the 8000 series that sites about an inch from the base. With that being said, all that distance must have been complicated for Samsung because it has a tendency to be off balance. I notified Amazon of this and they were willing to swap out the unit or give me a refund. I opted to keep it. I will be hanging the TV in the future and this will not matter. In the meantime I can deal with the slight lean and adjust with change (literally a couple nickels under the left two feet)...", "Date": "January 3, 2014"}, {"Title": "great product and service.", "Author": "Vipul Bhagat", "ReviewID": "R2NFP8V47PBBG8", "Overall": "5.0", "Content": "I love this TV with having motion sensing feature and inbuit wifi, having different apps on it. I am experiencing it like a big touch screen smart phone. It was great price by Amazon comparatively. I refer to buy it from Amazon, as the delivery person will open the box for you and check the basic audio and video. In case if it doesn't work , he can take back with him. Other retailer does not offer this service and leave headache for customers for return.No doubt on product itself, and no question for Amazon's service. Everything was great.", "Date": "January 2, 2014"}, {"Title": "Love it.", "Author": "Barb B.", "ReviewID": "R1GFTOQNPQAYDN", "Overall": "5.0", "Content": "Arrived in excellent condition. Beautiful picture. The web browser has a lot to be desired and is not very functional. That being said, I did not buy the tv for its web browser.  The swivel stand is a great feature. Have not used the 3D yet. I have not had any problems with the smart hub apps. They seem to work as well as the same apps do on my Roku 3. I  don't have a a very fast internet connection so it is difficult for me to stream in HD.  I would recommend this tv.", "Date": "December 27, 2013"}, {"Title": "Like it very much.", "Author": "Jake", "ReviewID": "R39PP66OF6EXBU", "Overall": "5.0", "Content": "TV is made for Ecuador...so not all Apps will play correctly or install at all...aside from that I can't notice any difference. (It is only a few Apps that are affected.) As far as I know, that is the only drawback. The camera motion-activation is being finicky...but I think that's only because it's in a brightly-lit room.The TV is in overall excellent shape. No defects that I can see. Plays blu-rays and everything great with a crystal clear colorful display.The screws to hold it to the stand are not nearly long enough to hold it to any stand, certainly not securely. They should be much longer. I would consider that a design defect by Samsung. I did not see any Infrared that came with this, even though a lesser-model did come with one. Overall, great t.v.I hope this helps people make an informed decision either way....", "Date": "December 21, 2013"}, {"Title": "Terrible wireless adapter, remote and documentation", "Author": "Martin", "ReviewID": "R309J6BDGIX5B9", "Overall": "2.0", "Content": "When I had continuous problems with streaming (TV drops wireless connection every 20 minutes or so), I thought it might be the software.  Updated to Samsung's latest version -- same problems.  Finally I had to go with a wired ethernet connection.  $2400 and Samsung couldn't afford a decent wireless adapter??  Extremely disappointed.  btw, the remote is one of the more difficult to use and learn, and since the only user guide is an \"e-manual\" online you'll waste a lot of time just trying to figure out basic functionality.  Too late, I learned that the best thing to do is to avoid \"smart\" TVs altogether, and just get a Roku box for streaming.", "Date": "April 16, 2014"}, {"Title": "Wi-Fi capability is defective", "Author": "MMB", "ReviewID": "R3SMQKPCZKNI11", "Overall": "3.0", "Content": "I purchased it so I could stream via wireless network.  Works fine for Apple TV (which as its own connection to the wireless network and HDMI cable into TV) but not so for connecting to the TV's own wi-fi e.g. using Amazon Instant Video.  To solve this my installer said I need to hardwire the TV, which defeats the purpose of having a wi-fi TV.  Samsung's answer was ridiculous - that the TV has to be no more than 20 feet from the router, which means you need to have all your TVs close to the router or you need to purchase network extenders.  However, I have no problem streaming video to iPads, Mac Books and iPhones in the same room as the TV.  So seems like Samsung went cheap on their wi-fi component.  Otherwise the picture quality is very good. Smart Hub is not that smart, really a little clunky, as is the remote that goes with the TV.", "Date": "March 15, 2014"}, {"Title": "Excellent TV", "Author": "E. Stewart", "ReviewID": "R1OD1X207OM0I", "Overall": "5.0", "Content": "I bought this TV because it has an MHL port and I wanted to use the Roku Streaming Stick with it. It is mounted in our kitchen and has no cable or antenna so we get all of our video via a Wi-Fi connection. It has great built in apps and I mostly use Netflix and Plex plus Google Chromecast connected to one of the 4 HDMI ports and one of the 3 USB's for power. It is very user friendly and a great picture, especially when viewing 1080p content. Unfortunately I found out the hard way that the Roku Streaming Stick doesn't function correctly with the MHL port on this TV so I upgraded to Roku 3. I learned yesterday that Roku just announced a Streaming Stick that does not need an MHL port and like Chromecast just requires an HDMI port and a 1A USB port for power and this TV has one powered USB port with the other two providing .5A power source. I mounted it flush against the wall and use it to display recipes and other media while working in the kitchen. I do wish it were more friendly for people like me that don't use TV (cable or antenna) input. Some of the features such as PIP only work with TV input and not the other input sources that I use.The picture is superb and the remote is excellent. I also bought the wireless keyboard for browsing but haven't used it too much yet. I think browsing with a laptop and using Chromecast is probably easier. One piece of information that is hard to come by is a picture of the ports on the back once it is mounted on the wall so I took a picture for reference if anyone else wants to access it in the future. For me, I couldn't remember which one of the USB ports provided 1A of power that is needed for the new Roku Streaming Stick. A link to this picture is here: http://goo.gl/Jw0LBg", "Date": "March 5, 2014"}, {"Title": "Perfect for the whole family!!", "Author": "nickAddiction \"techjunkie\"", "ReviewID": "R1Z8H4JSZX8U2Z", "Overall": "4.0", "Content": "Well, like most people should do before buying something this expensive, I did as much research as I possibly could. I went to several different electronics stores and websites before settling on Amazon. Compared to everywhere else I went, Amazon was at least $200 cheaper. That being said though, we bought the TV through another company listed through Amazon, and I have to say, I wasnt all too impressed with how long it took our TV to get here. For one, it took a week for it to show up to our house, secondly they used some delivery service that Ive never heard of and the truck driver was very rude. Third and certainly not least, the box came damaged, but thankfully nothing was broken and the TV didnt have any scratches or dents. I made sure it was perfect before that truck driver left. I wont rate poorly on this product because of my bad experience with the outside company though. So on to the actual TV review.As soon as we turned the TV on, my fiancee and I were absolutely stunned! We upgraded from a 32\" Samsung LCD which Ive had for about 5 years, which has traveled with me from at least 6 different apartments/houses and has even traveled cross country with me in the back of my car. I like to call it \"Ole Reliable\" because it has never let me down. So once we sat down in front of a \"60 LED, I couldn't believe how clear and vibrant the picture quality was. The SMART features are great, but I guess I've been spoiled with my android devices, because the apps didn't seem up to par. I was hoping that the SMART screens would be customizable, but I cant seem to figure that out. What I mean by that is, I would like to make my starting/home screen the apps menu with whatever is playing in the background, not the cable channel suggestions page. We don't have cable, so its pointless to have this screen. The sound is decent, not as good as my old TV, but I expected that going with the LED and I was also forewarned from all the reviews. I have computer speakers with a 10\" sub woofer that I used with my older set and I figured I would just use them with this TV. Well I have to say, getting them to work was a pain in the butt. The speakers have AVS outputs and the TV comes with an AVS converter, so I just put 2 n 2 together and hooked it up that way, but as soon as I put on Pandora, the sound only came through the TV. A little frustrated, I tried taking the converter off and just plugging the AVS cables straight into the AVS input slots. That didnt work either, so I searched high and low on the internet to figure out what I was doing wrong. it took me 3 days to finally figure out on my own that I had to use the one single cable that I always use to play music from my phone. I took that cable(not sure what its called) and plugged it into the Audio Out port. HOORAY, WE GOT SOUND! I would have been severely upset if I had to go out and spend more money on a sound bar or home theater system so soon. As far as the picture settings go, they are a pain in the butt let me tell you. I'm a tech junkie and can usually figure stuff out pretty well on my own, but calibrating the right picture quality is something that I hope I will never have to do again anytime soon. For one, the 10p White Balance is tough to get perfect, and the intervals for said balance is still a mystery to me. Getting the back lighting just right was annoying and I still feel the contrast is off a little. What ever happened to the good old days where you picked between Dynamic, Standard and Movie and you didn't have to mess with anything else? I guess having a TV for 5 years has dulled down my TV knowledge. Oh before I forget, if anyone is a gamer and is going to use this TV heavily for gaming, you might get annoyed after a while having to always go into the settings and switch to \"Game Mode\" every time you want to play. After 3 days of this, Im already hating this feature. Other then that, I think this TV is well worth the money spent, and my wife is in love! :)- RECAP -Pros1. Outstanding picture quality2. Wide selection of apps for everyone to enjoy3. Amazing design4. Has the upgrade feature so when the time comes, you dont have to buy a whole new TV5. Navigation through the TV is fluid and flawless6. The camera and voice recognition features are a fun way to interact with the TVCons1. Sound quality2. Picture calibration is tough for those who aren't TV savvy3. SMART screens non customizable4. Remote is a little frustrating, but nothing too serious5. The game mode setting should be able to turn on and off automatically so that the user doesn't have to manually turn it on every time he/she wants to play a gameI hope you enjoyed my review and it helps you make a better decision on what kind of TV you want. I would highly recommend Samsung TV's, I've always enjoyed the quality and have never experienced a problem with their products.", "Date": "February 19, 2014"}, {"Title": "Easy to hook up; beautiful color and sharpness", "Author": "I Do The Speed Limit", "ReviewID": "RQRT3N3S3EFMX", "Overall": "5.0", "Content": "We did a lot of comparison shopping between name brand HDTVs.  For the value, we thought Samsung won, without a doubt in our minds.  We went with the LED because it gave us the best color and sharpest picture.  We went with 240Hz because the action on the screen did not make us dizzy:  The action was sharp, quick, to-the-point.  We went with the \"Slim\" because it gave us a border that receded into the background, (rather than the in-your-face, shiny, black one-inch (or so) border of the regular screen).  We didn't care about the 3D feature, but the features we did want did not come without the 3D.  So 3D is getting a free-ride here.Another aspect of the Samsung brand:  The \"Smart\" in Samsung Smart TVs means that it links to Amazon video and my Kindle HDX 8.9\" and other internet \"stuff\", too.  And that also means that you have extra Amazon support from their technicians in setting things up.  The day (maybe it a day later) I placed my order, Amazon began communicating (via emails) with me regarding all the avenues of support and help that I could expect once my TV arrived.  It was comforting, and it was a nice touch.Regarding set-up:  The TV was easy to remove from its box and simple to assemble.  Set-up (connecting all the wires to the correct ports) was fairly simple, even hooking up my old (bought around 2001) Bose 3-2-1 sound system.Other info that might be helpful:--One pixel is not working, (at least that is what we think the single, bright red dot is on the screen, but as it is not visible from viewing distance, we have let that issue slide.  We were not about to go through the rigmarole of re-packing and shipping the TV back to Amazon, just for one pixel.--The border and the stand are shiny silver.  We would have preferred a brushed or satin finish, but we could not find any models that come with that feature.--If you are replacing an older TV that is not a flat screen, and if you are unfamiliar with current lingo and are a little fearful of where all the wires go:  If you are a patient person, you can work with the quick set-up guide and the more detailed operating manual and get this TV working in a few hour's time.  It may be frustrating, because the manual is not the best, but common sense, perseverance and patience will see you through it.  If you are unfamiliar with some terminology, a quick internet search will tell you what you need to know.  I guess I'm saying that you don't have to buy your TV locally because you think you'll need a technician to come out and set it up for you.  You can really have it shipped to you and do the set-up yourself.--The color, contrast, etc. controls are very easy to find and fiddle with yourself.All in all, we are happy with our new HDTV and are really looking forward to watching the 2013 Winter Olympics in style!", "Date": "January 26, 2014"}, {"Title": "Excellent upgrade from my first generation LCD HDTV", "Author": "Chris Hertenstein", "ReviewID": "RC0H5SD1S77F5", "Overall": "4.0", "Content": "Overall, very happy with the UN55F7500.  Picture quality, and software features are excellent.  Remote control takes some getting used to, and I am not a huge fan of the swipe pad.  I would have preferred actual numeric buttons.  DLNA client software works well with my media servers running TVeristy, Mezzmo, and PlayOn.", "Date": "January 2, 2014"}, {"Title": "Defective since day one", "Author": "Stacey d", "ReviewID": "R184GO7QC2J72V", "Overall": "1.0", "Content": "Purchased the Samsung TV UN60F7500 from an online retail store (not through Amazon) TV defective since day one. Had a white image about 5 inches in length across edges of TV. Samsung had me do several configurations all of which still didn't correct issue. I asked for an exchange of the same TV, nothing more. Was told they would not exchange at this time but will send our an authorized repair technician to my house. Four days later the repair tech arrives at my house and tells me within two minutes the TV's main board is bad and will need a new one. Goes on to say he would have to take the TV for 5-7 days!!!! Leaving me with the burden of un-mounting the TV from my wall, being without it for a week if not longer and now having a repaired TV I just spend over $2,000 on. Called Samsung two more times, once again told too bad they will not exchange it despite FACT it was defective since day one.HORRIBLE SAMSUNG CUSTOMER SERVICE. BUYER BEWARE.Too bad, I own two other Samsung TV's I like and haven't had an issue with. This just pushed me to buy another manufacturer.", "Date": "February 7, 2014"}, {"Title": "awesome tv", "Author": "Christopher", "ReviewID": "R3BUJS49YAXMVZ", "Overall": "5.0", "Content": "i did my research and checked out the specs of this particular tv and found it most affordable for quality and state of the art fashion. It has voice control, 3d viewing (you get 4 pairs of nice 3d glasses), and it a bunch of apps that are helpful. I actually use this tv more than my mac. Deff worth every penny!!", "Date": "March 11, 2014"}, {"Title": "Family enjoys it!", "Author": "Deuce", "ReviewID": "R5NHHJAVDDM44", "Overall": "4.0", "Content": "Picture; Out of the box it looks great, sometimes surreal which takes getting use to. I imagine that I'll eventually venture into picture settings for tweaking reasons but at the moment I can't justify doing so. The first day of viewing had me second guessing going with the 60 inch version, average viewing distance in my room is 11 feet. This samsung replaces a 50 inch LG which was plenty big in my opinion, but a friend convinced me to go 60. After a few days of viewing I believe 60 was the right choice, bigger is better I guess. I have zero complaints regarding the monitor.Remote; I personally don't use all of the extra bells whistles so I can't really comment on their functionality. My 20 year old son who's home on Christmas break claims that with the exception of voice commands he mastered the high tech remote in one afternoon without much of a hassle, he tells me the voice option does not belong but other then that he likes it.Smart TV; We've managed to access both Netflix and Amazon prime without any problem. Not being able to route audio through our AVR is disappointing but I have an optical cable on order which should remedy the situation. I don't foresee using any other internet function, my wife did try the Facebook app and said it was a joke.Reason for 4 stars!! We were all pumped as a family last night for our annual viewing of Christmas Vacation (first BR experience), what a let down! Picture was great but the lip-sync effect was downright disgusting, I did not see this coming. I'm running the BR player through a Denon AVR-1910 which as never let me down. Do I now have a situation where the smart technology on the TV end requires that I also upgrade my receiver?? If so I'll bump the rating down to 2 stars out of pure frustration. If somehow I discover a fix which allows my blu ray movies to become watchable again I'll bump the rating up a notch.", "Date": "December 24, 2013"}, {"Title": "Great tv from the basic person!", "Author": "booklover666", "ReviewID": "R3OA1DOKAQ5UET", "Overall": "5.0", "Content": "I'll start by saying I know nothing about specs and technology so please excuse me for not mentioning these things in this review.I am very impressed with this tv. The graphics look amazing. It's a really clear picture. My husband who is tech savvy has said its a very good tv.The novelty of speaking and waving at your tv loses interest after awhile especially when the voice activation can happen when you're just talking in the room which is very annoying. We ended up disabling the voice activation.The other features such as all the internet apps and tv on demand are great. I use them all the time.The remote is easy to use. And the set up was basic.The 46in has no border so the screen goes almost to the edge which makes it even bigger than our previous 46in tv.It's expensive however I can see why it's at the top of the range. I really enjoy watching tv and movies on this tv. It's so clear and big!It also has the ability to update as new software becomes available which means it won't be outdated as quickly as most TV's.Definitely enjoy watching movies and sport in HD. It's an amazing picture.", "Date": "November 4, 2013"}, {"Title": "Tops in picture quality", "Author": "Clifford D. Whitney", "ReviewID": "R6T1NZIPPW3M0", "Overall": "5.0", "Content": "I am a retired TV engineer. This is the best there is in picture quality. Sound, not so much. I had to add an external sound system.Also we like to watch movies when the \"vast wasteland\" is empty. Best home picture I have ever seen.", "Date": "May 6, 2013"}, {"Title": "Way too sensitive to internet speeds", "Author": "King-Me", "ReviewID": "RW4NZ4DWH6OLT", "Overall": "1.0", "Content": "I am very disappointed with this tv. 50% of the viewing time is spent, reading an alert that pops up after stopping my viewing of Netflix and Amazon Prime TV that say \"We're having trouble playing this title right now. Please try again later or select a different title.It has nothing to do with the title. The TV that I replaced this one with was 4 years older and almost never gave me this alert unlessour internet service was so slow it was at dial up speed. Multiple times I have ran a diagnostic to verify my internet speed within 60 seconds of receiving this alert and found my internet speeds in excess of 50mbps. Most homes do not enjoy greater than 15mbps.This stinks and I have spent more time go back to settings than I have enjoying watching this TV. Like right now, my TV is telling me that my wireless internet connection has failed  but my speed test tells me that I am at over 50 mbps. The older Samsung flat screen LED TV that is 30 feet from my location never stops viewing Netflix during all of the alerts I receive almost every 15 minutes.I am sending this junk back to AMAZON!", "Date": "March 18, 2014"}, {"Title": "Great TV, Terrific Online Support, Horrible Onsite Repair Service", "Author": "Lesley Symmonds", "ReviewID": "R2JB4SQ8XYR1W6", "Overall": "4.0", "Content": "I love the TV.  Its smarter than I am.  I have had it now for 2 1/2 weeks and I'm still finding out things that it can do.  I got the 60\" unit to replace an old 60% Samsung DLP TV that was on its last legs.  My new TV is so different from the old one, we are finding that it takes time to get used to how sharp the picture is.  It actually makes some shows look phony because the TV is better than the cameras they used to shoot the movie with.My only complaint has to do with service.  My TV came with a dead pixel.  I called Samsung to complain and asked them to have it fixed.  No big deal, the TV is under warranty for a year, etc.  They opened a repair order and assigned it to Lakes Electronics who is a vendor they use in my area.  Lakes contacted me the next day.  The woman I spoke with did not sound pleased that she was being asked to service a TV for just one dead pixel but regardless she asked me to take a picture of the offending pixel and email it to her, which I did right away.  Then, silence.  I heard nothing back from Lakes.  Since I work for a living I was not able to call them until after work and by that time they were closed.  Their automated attendant did not provide the ability to leave a voice mail.  No worries, I thought, I will send them an email.  Silence . . . .  So I downloaded Samsung's We Care app (boy is that a joke), only to find that Lakes Electronics had closed out my repair order with a note complaining that they could not reach me!  Ok, so after I had calmed down a bit, I called Lakes Electronics and asked them to open the repair order and come out and fix my TV.  The Lakes lady said she could not do that and that I would have to call Samsung and have them reissue another repair order.  Ok, so I figured there was no point in fighting Town Hall, so I called Samsung.  This was on 12/4.  I spoke with a nice young man who was suitably indignant on my behalf and who promised to reissue the repair order forth with.  He promised that someone from Lakes would be in touch with me within 24 to 48 hours.  Well here we are 48 hours later and I have not heard from anyone, so I called Samsung again and low and behold, I come to find out that the young man I spoke with two days ago did nothing!!  He did not place the repair order he promised that he would do for me and all the Samsung rep can do for me at this point is to start from scratch and place a new repair order today which means I would have to wait until at least sometime next week before hearing from anyone and it will likely be the same deadbeat Lakes Electronics.  So I asked to speak with a Supervisor, which I find usually works if I need to have something escalated and I think I have ample reasons to have these issues escalated.  The Supervisor, Jessica, said that she can either place the repair order with Lakes for the next available time slot with is 12/12 and then I am free to call them to negotiate a better day, or she can ask their Dispatch Operators to call me sometime tomorrow and schedule the repair with another company but in order to do this she would have to cancel the order with Lakes.  AT this point I am thinking better the bird in the hand than two in the bush, so I go with the Lakes Electronics 12/12 date and the bad taste in my mouth.So the moral of this story, boys and girls, is that this is a terrific TV with a beautiful picture and a bevy of features and toys to keep you busy for a long time.  The Samsung online support is excellent and well positioned to grow with the technology, but watch out if you actually need any onside repair service.  If you are lucky enough to live in an area where you are serviced by a good Samsung vendor, then you are blessed.  If not, then document, document, document.", "Date": "December 6, 2013"}, {"Title": "Got this for my multi-remote challenged husband", "Author": "techsavvykat", "ReviewID": "R2Z74FZBMNXYEA", "Overall": "5.0", "Content": "I already had the Samsung 46\" 3D TV, but the D series, so I couldn't upgrade with the Evolution Kit.  I set this up last night and fought and fought the Internet Connection to my wireless router, which is necessary to use the Smart features.  I finally got on Samsung support and found that my router, the Cisco Linksys EA4500 Media Stream N900 Smart Wi-Fi Router, had issues with this TV and Samsung wrote a patch and put it in firmware available as a download from their support site.  I got the firmware and loaded it onto a USB jump drive, plugged it into the TV.  Followed the directions given on Samsung's website for installing it and it fixed it!  I was able to complete the set up.  The picture is great.  It recognized the cable box and Samsung 3D Bluray player (E series) and a USB portable HD with videos/photos, and my PC, which is set up to stream.  I am waiting on the Samsung 551 Soundbar/receiver.  The remote is tiny.  But the touch pad is generous.  The aren't many buttons.  The additional \"buttons\" that were on the previous TVs remote are available by pushing the \"more\" button on the remote, which puts a pop up on the bottom left hand side of the TV screen.  You operate it with the touch pad and you can also draw numbers on the touchpad to input channel selections...as no numbers are available on the remote, just up and down arrows.  You might want to keep a stylus handy.  The voice recognition works great.  There will be a learning curve for my husband, but I think he'll be much happier not having to fight 4 remotes to watch 1 show!  And, here I thought guys were remote savvy...  This is a great TV for the technophobe...once they understand there's no going back to the old two knob (on/off/volume and channel selector) vaccuum tube TVs.Additional information.  IF you have a Linksys EA4500N wireless Router, you will need to download firmware from Samsung support, load it onto a USB and let it install to get the Internet connection to work.Camera:  As has shown up in other reviews, this is not adjustable and unless your TV camera is at eye level, you will have to get off the couch and stand to be seen.  Virtually unusable.  I tried to hook up via USB the Samsung External Camera I had on my old D-series Smart TV.  But the TV does not recognize it and Samsung support says there is no way to do this.  I am hanging onto my external camera in the hope that Samsung will write some firmware to allow this to be used.  Please!Some of the features in Broadcast, CC, favorite channels list and such, may not be available depending on your set top box.  I am going to have a chat with my cable provider to see if they have a newer, smart tv friendlier device.Will update this review as I go.FYI:  Fabulous picture!  I have the Samsung HW-F551 Soundbar/receiver hooked up to this TV. Fabulous Sound, too! However, though the Universal Remote feature does recognize and switch the virtual remote from your set top box to the Bluray player, depending on how it is hooked up, to use the extra features of the soundbar, you have to use its remote.  The TV does not recognize this Soundbar yet.  It may be in the next update...  Let's hope.", "Date": "February 11, 2014"}, {"Title": "Amazing picture", "Author": "Brandon", "ReviewID": "RNHIE0EB1CD14", "Overall": "4.0", "Content": "This TV has not stopped to impress me. The only thing better would be a 4K TV and right now it's not really worth it to me. There isn't enough products that will support 4K for me to justify spending $3,000+ on one. I got my TV for less than half of a 4K and the large open scenes look so amazing. I have begun to watch all my Blu-ray movies again now in true HD. I don't use the camera very much, and to be honest I think the camera should be able to point further down so if I did want to Skype, I wouldn't have to stand up. The camera points half way up my wall and doesn't see much of me sitting in the couch.The voice command stuff is a neat feature, but I do not use it much. It does seem to catch some voices off the surround sound thinking that I'm saying \"hi TV\" and it mutes the volume waiting for a command. I need to go though the options to see how to disable it because it's more of a nuisance than anything.I paired up my TV with the Samsung 3D Blu-ray player/surround sound and they work seamlessly together. Samsung HT-F5500W 3D Blu-Ray Home Theater SystemThe remote can be quite a pain. The limited buttons is great for my wife who always had trouble turning on the TV, Cable and Surround before, so now it's one button and it's on. The negative for me about the remote is that they have a guide button on the remote, although it will not bring up the guide from my DirecTV. I have made a call to Samsung about this and they said that it does not work, although they are currently working on an update that will take care of it. I hope they do soon, because I still find myself using multiple remotes like I have before.I would recommend this 7500 series TV over the 7100. My friend has the 7100 and I can tell that with my upgraded processor, all of the web items run much faster, so if you plan on watching a lot of Netflix right from your TV, go with this one.", "Date": "February 6, 2014"}, {"Title": "Fantastic TV", "Author": "S. Jones", "ReviewID": "R2FOPUTBENBE3H", "Overall": "5.0", "Content": "This is truly an amazing TV. Picture quality is excellent. Blacks are really black. The sound is okay, but I bought a Samsung sound bar, which greatly improves the overall experience. The smart hub is pretty cool, and the apps work really well. About the only negative I can say about the TV is that if you have the audio commands turned on, sometimes the TV just suddenly cuts off the sound and prompts you as if it's waiting for an audible command. Since I never use this feature, I just turned it off in the settings. The hand gestures are actually a bit more useful and natural to use.", "Date": "February 3, 2014"}, {"Title": "Solid hardware, great picture quality, rich software control", "Author": "Vincent", "ReviewID": "R2W0POTT2GQQHH", "Overall": "5.0", "Content": "The TV set has great picture quality. It's light and slick styling is impressive. The integrated browser is great. The 'SMART' remote control offers a multitude of features for the viewing experience.Some of the simple functions like 'previous channel' or 'info', etc require multiple clicks to access. The user interface could be designed better. The TV response to a click from the remote could be a little faster, perhaps more micro processor power.Overall, it is a marvelous piece of hardware packed with great software features.", "Date": "October 29, 2013"}, {"Title": "Samsung un60f7500 review", "Author": "Michael E. Adams", "ReviewID": "R2G2A077TBX7NC", "Overall": "5.0", "Content": "I'm replacing a plasma tv brand xxxx with this Samsung un60f7500 smart HDTV.What a visual experience seeing the tech advance on this set.I can't believe the picture, it's like you can walk into the screen, the clarity is that good!As far as dislikes not one I can think of except the 3d glasses are not very usable when wearing corrective glasses.The 3d conversion from broadcast stations is very nice (more than expected)I also recommend the Samsung sound bar. I wasn't sure about what the sound quality would be like. Well I ended up retiring my amp,speakers,sub woofer wires. I'm now using the sound bar and the wireless subwoofer for my audio.As far as a recommendation, I would be remiss not too recommend this product.Thanks to all the people that recommended this Tv from Samsung on amazon.", "Date": "August 9, 2013"}, {"Title": "Great Smart TV!", "Author": "lfh", "ReviewID": "R18L4G4EIZZRYP", "Overall": "5.0", "Content": "I have been very pleased with every feature I have tried.  Still haven't tried 3D because I'm still exploring all the Apps.  Plenty to do if your an insomniac. Incredible picture and feature set.  Highly recommend.", "Date": "June 9, 2013"}, {"Title": "Super", "Author": "rod", "ReviewID": "R3BS282MF80GW6", "Overall": "5.0", "Content": "Great tv. Using it in a room with all floor to ceiling windows and picture is bright and rich with no problem of washout", "Date": "June 5, 2014"}, {"Title": "energy saver", "Author": "Richard", "ReviewID": "R1VV8J09P8BQG8", "Overall": "5.0", "Content": "Picture quality is  great and this thing is soft on the electric bill which is great.  Also super light and  has a ton of apps", "Date": "June 2, 2014"}, {"Title": "Spectacular!!!!!!!!!!!!!!!!!!!!!!!!", "Author": "michael curran", "ReviewID": "R3LADJ1RTKC7SF", "Overall": "5.0", "Content": "no hassle purchase. research info excellent. shipper info and delivery accurate, on time, professional and courteous. easy setup by myself. all bells and whistles have preformed as advertised. picture is SPECTACULAR!!!!!! first comment my wife made was \"we should have bought the 60 inch\". very, very pleased. all setup and capability info well explained and easy follow. only down side is the internet  t v and MY laptop, I thought, would be interfaced but they are not. can run screen as giant monitor. broadcasting, Verizon and the movie industries need to catch up to this products capabilities.  buy it!!", "Date": "May 26, 2014"}, {"Title": "The best in motion interpolation and picture quality", "Author": "Dresk Spidflisk", "ReviewID": "RF74C387SB55B", "Overall": "5.0", "Content": "I'll keep this review simple.  We all know Samsung makes excellent TVs.  What we all don't know is who is the king of motion interpolation (if that's your thing.)  Well, this TV successfully smooths out interlaced sources, something my first 240hz Samsung didn't do (back before they had the \"CMR\" ratings.)  Basically, it smooths out broadcast HD, even interlaced.The speakers could be better (they are back firing) and the remote takes some getting used to, but this TV is loaded with features, including Samsung's SMART TV applications (Youtube, a web browser, Netflix and more, all pre-installed) and the picture is completely configurable.Most importantly, it has the best motion interpolation I have ever seen.", "Date": "May 12, 2014"}, {"Title": "Not so Smart!!", "Author": "PJ", "ReviewID": "R2YSLRQO5O07CC", "Overall": "2.0", "Content": "After 1 week of  ownership I was  worried I made a mistake.  Now a month later I realize I did. Many glitches. Wireless connection is terrible. Samsung must have used a cheap wireless adapter, or after reading other reviews, the wireless adapter is defective and Samsung knows it. Google the issue, others have had the same problem. Will not stream Netflix. ( my Samsung Blue Ray BH5900 has no problem) Samsung claims TV must be 20 ft or less from Router, Even though the owners manual clearly states 50Ft. is acceptable.  Be careful! If you call tech support they tell you to run a cable directly to the back of the TV. are they kidding?? A smart T.V that has to be wired into your network???Voice control is just a gimmick. It works when it wants to.  The \"Smart\" recommendation which they talk about on their web site is a joke. I have it hooked up to my DirecTv Genie DVR. it either recommends channels I don't receive, or the same ones each day. Threre is one good thing( yes there is one), Picture is great. You could probably pay much less by getting another brand with just as good a picture. You if are looking for all the Tech supposedly available in a Smart TV, I would think twice before purchasing this one.", "Date": "May 8, 2014"}, {"Title": "Great TV, but the H series for 2014 is better", "Author": "Phil", "ReviewID": "R2MC8GDKDCDV44", "Overall": "4.0", "Content": "This is a great TV, and works very well for the room I bought it for.  The picture quality is excellent, and I would probably have given this a five star rating but for the fact that I recently also bought an H series Samsung, and recognize that the bar has been raised.  That said, this is a great unit....easy to hang and easy to install with other components.  If you buy it you'll like it.", "Date": "May 4, 2014"}, {"Title": "Incredible TV", "Author": "Charles Hura", "ReviewID": "R2IDXKIOTU3ZLI", "Overall": "5.0", "Content": "Fantastic picture, great refresh rate, constantly get the comment from visitors that this is the nicest picture quality they have ever seen.  Very happy.  My only doubt is if I should have went for the 60-inch :)", "Date": "April 29, 2014"}, {"Title": "So far, so good", "Author": "Max", "ReviewID": "R1EUF5WOR45AQH", "Overall": "5.0", "Content": "So far, this TV has been perfect. The picture is flawless after a little messing around with the picture modes. If you are a gamer, you're going to want to turn game mode off FOR SURE otherwise there is a lag. The remote is my only gripe with the product. It won't sync with my Yamaha audio receiver so I can't use it to turn up and down the volume. The 3D works great - watched Frozen 3d the other night and everyone thought it was awesome. oh - 2nd and last gripe is that the batteries for the 3D glasses last for maybe 3 or 4 movies before they need to be replaced...whaaat? Overall, if you're looking for a superb picture quality, this is the tv to get.", "Date": "April 29, 2014"}, {"Title": "Amazing", "Author": "A_L", "ReviewID": "R36H35A3VRHDTT", "Overall": "5.0", "Content": "My first big-girl TV purchase and I couldn't be happier.  Men are clearly jealous of my awesome TV and the picture is amazing.  Yes, I could have spent more for an 8000 series, but this is still impressive.", "Date": "April 11, 2014"}, {"Title": "Awesome Picture; Atrocious Battery Life for Smart Touch Remote", "Author": "B-52 Flyer", "ReviewID": "R2UAU20USB77G4", "Overall": "2.0", "Content": "The picture on this TV is amazing.  It looks like the actors are actually in the room.The smart TV features are pretty good -- No serious complaints.The 4-leg base / stand looks cool, but it turns out it's a terrible idea because it severely limits positioning options on narrow tables/shelves.The Smart Touch Remote (RMCTPF-1BP1; Model Code  AA59-00758A) is not that easy to use.  The touch pad is inconsistent and takes a lot of swiping to navigate the screen.  The LG Magic Remote QWERTY is by far a better solution than Samsung's remote control.Worst part of the Samsung Smart Touch Remote is the battery life.  The remote delivered with my TV consumes fresh 2 AA batteries every 30-40 days.  No exaggeration.  This is with literally only watching the TV about 7 hours each week.Samsung thinks this is perfectly reasonable.  Here is Samsung's response when asked about the astonishing battery consumption rate:I said \"I have had this TV about 3 months and I just replaced the AA batteries in the remote control for the third time.  This remote control should not require new batteries every 30 days.  Why is this remote control using batteries so quickly and how do we stop it from consuming so many batteries?\"Samsung replied \"I would like to inform you that your TV comes with the Smart touch remote controller and basically these remote controller consumes more power when compared to standard remote controller and also the battery life of the controller depends upon the usage of the controller.\"If Samsung thinks it's ok for the remote to consume so much power, they could at least supply rechargeable batteries.", "Date": "April 9, 2014"}, {"Title": "Very pleased w/ this UN46F7500 46 inch!", "Author": "LAHIRI", "ReviewID": "R1LRKMBSADJPFG", "Overall": "5.0", "Content": "The Panasonic I wanted didn't fit. So, I opted for the slightly less expensive 7500 Samsung. Haven't set up the wifi yet, but the set is  of very good quality, so far. The 3D works easily and well. There are more smart features, like the smart hub to set up, but already the set honed in on my cable box. The Sam-remote operated the cable box w/in minutes. I can even use a menu of voice commands to mute, raise/lower volume & change channels. Nifty!The picture is not a plasma, but can be adjusted nicely to produce a very good to excellent picture.The only downside so far is the remote's slipperiness. Its shape and surface make it easy to slide out of the hand and sometimes awkward to use...w/ 1-hand. A better ergo form/grip would be good, but I'll just add some adhesive grip strips as an easy fix.I already have recommended the 7500 series to friends.", "Date": "March 30, 2014"}, {"Title": "My Samsung TV is great", "Author": "richard loftus", "ReviewID": "RE7PMDW6I5QQO", "Overall": "5.0", "Content": "I am most pleased with my Samsung 7500 46-inch TV purchase.  It meets my expectation in it's performance and certainly would recommend it to  anyone looking to purchase one.", "Date": "March 21, 2014"}, {"Title": "Great TV", "Author": "AZPat71", "ReviewID": "RRVXMSIYH8CNK", "Overall": "5.0", "Content": "Love it.  Easy to set up and easy to use.Streaming video is a snap with the built in wi-fi and the picture is the best.", "Date": "March 20, 2014"}, {"Title": "Great tv, for great price.", "Author": "KB", "ReviewID": "R3KMUQ7ZMZ5GR7", "Overall": "4.0", "Content": "It is a great tv, happy with it. All features of 8000 series for price of 7000. Other than battery for 3Dglasses which seems to drain fast, no complaints with TV", "Date": "March 8, 2014"}, {"Title": "amazing!", "Author": "Ignacio Gonzalez", "ReviewID": "RBHMACB2ASMBA", "Overall": "5.0", "Content": "More than I imagine.  The picture and quality are above all competition in the market.  No regrets... I recommend it.", "Date": "February 23, 2014"}, {"Title": "Outstanding", "Author": "David Howard", "ReviewID": "RYAK4E5P5TM1C", "Overall": "5.0", "Content": "I am partial to Samsung products owning two 40\" LCDs that are in excess of 5 years old. Setup was a snap,I realized that I had to change from HDMI 1 to HDMI 3 when viewing app related material. I wasn't interested in the jester controls or voice commands. Some folks do not like the 'soap opera' effect, but I have gotten used to it. I feel it adds another level of dimension.", "Date": "February 3, 2014"}, {"Title": "Picture is just....WOW", "Author": "One Man's Opinion \"Scott in Tampa\"", "ReviewID": "R1R90Y2ND0LI0B", "Overall": "5.0", "Content": "I bought the 46\" for my den, and the picture is better than the far larger Sharp Aquas TV I have in the family room.  Obviously, as technology has improved over the years, each new TV shows an expected increase in picture quality.  However, this is the first one in sometime that's really had the \"WOW\" affect.  I'm not really crazy about some of the menu features, and some of the apps do not work great.  Still 5 stars, because at the end of the day the reason for a TV purchase is picture quality.  Another reason for 5 stars is (at least for me) no \"tuning\" required.  It just looked tremendous out of the box.  I am using this set with DirecTV whole home.My only problem now is I want a second one for my home gym, and since I bought the first one during a Black Friday sale, I am not going to pay an extra $300 now.  Will wait for this set to hit $1250 again at some point, then I'll be buying for the gym.", "Date": "January 26, 2014"}, {"Title": "Samsung 60 in TV", "Author": "Mary Ann Ronco", "ReviewID": "R3EGPLZREUT2FI", "Overall": "5.0", "Content": "This TV has a very clear picture and good price.  It is slim and neat looking and I am quite pleased with my purchase.", "Date": "January 16, 2014"}, {"Title": "Great TV", "Author": "RB", "ReviewID": "R1GZO7YOPYVV0Q", "Overall": "5.0", "Content": "This TV has a load of great features. The only thing that is disappointing is it will only let you use the Samsung app store to download apps. Good picture and is easy to setup. The voice commands work well but the motion commands need alot of work", "Date": "January 14, 2014"}, {"Title": "Great TV", "Author": "Raymond G. Buza", "ReviewID": "R1USAGAQK45B3P", "Overall": "5.0", "Content": "Terrific TV that provides a great sense of depth in the picture. The picture is very lifelike and a lot of fun to watch.", "Date": "January 11, 2014"}, {"Title": "When my 42\" LG was stolen...", "Author": "K. Thompson", "ReviewID": "R1ZGDC6NHRH3I2", "Overall": "4.0", "Content": "...a few weeks before Christmas I searched high and low for another 120MHz 42\" to fit in the area of my entertainment center.  All I could find worthy of the expense were 46\" ones but their overall sizes exceeded what space I had... until this one.  I double, triple and quadruple checked various sources before purchasing this one because I couldn't figure out how it was smaller than it's similar models from Samsung.  It fit perfectly into the space I have for a TV... 3/16\" space on each side... PERFECT!The price I paid ($1600) was quite nice for such a high-end 46\" LED TV.  It has a built in retractable camera, dual microphones (for stereo), 3D with four sets of glasses, voice and gesture interactions... ALL of which I have disabled because I do not have a desire for those features... Not even a curiosity!  The menus are logical and attractive.  Internet connectivity and streaming is flawless!Assembly and \"first-time-setup\" was easy and quick.  I did make the mistake of getting ahead of myself installing the stand but only set me back a few minutes...The 240MHz refresh rate and 46\" screen really is an awesome upgrade from my previous LED TV.  Once adjusted, the picture has been smooth during \"action sequences\" with crisp definition and fantastic looking brightness, contrast and saturation.  I am noticing some of the lower definition programming of local channels more obviously with a hint of ghosting.  DVD playback looks better than a movie theater!!!The integrated speakers, once again after I adjusted them, sound phenomenally better than any TV I've ever watched.  I use to always use my surround sound system to experience the depth of audio for various programs or movies, but this TV's speakers do a fantastic job emulating the surround sound experience.And now the reasons (2) for the 4 out of 5 stars:1. I dislike the remote control... A LOT!  For the majority of it's functionality it requires use of a tactile-mechanical touch pad that has given me more frustration than I've ever experienced!  It's either too sensitive or not sensitive enough.  I'm continually struggling to scroll through menus smoothly having to resort to laying the remote onto my coffee table and gently interact with it with one finger in deliberate, tiny movements... AND STILL HAVE ISSUES!!!  That's why I WILL be replacing it with a universal remote (Logitech Harmony) in the VERY near future!!  I do, however, like the dim back-lighting, which can be disabled, of the buttons as well as their unique shapes.2. YouTube menu... There is no way to watch playlists and playback is not in sequential order.  I have specific subscriptions for specific playlists and it's painfully aggravating to have to navigate through ALL the subscription content just to see what I want to see.  Playback is from newest to oldest with no way to change it.  The playlists I watch are in sequential order and I must manually select the correct video every time.Other than those few gripes... GREAT TV!", "Date": "January 7, 2014"}, {"Title": "samsung quality", "Author": "eeb", "ReviewID": "R1KEARLSYO1FNU", "Overall": "5.0", "Content": "Worth the price outstanding picture easy set up very prompt delivery. I may buy a 60''  also for another room.", "Date": "January 7, 2014"}, {"Title": "Not only a great TV but an AWESOME SMART TV!", "Author": "PPG", "ReviewID": "R2KEQKABFRB3XK", "Overall": "5.0", "Content": "The Samsung UN55F7500 is a great SMART TV. Got a great deal through amazon that included a Samsung galaxy 3 tablet (7 inch) for less than 2K!In brief the quality picture is superb! additional features including the voice and hand functions to change channels will blow your mind. Also the TV comes with 4 pairs of 3D glasses ideally for a movie night at home!The smart features (browser, Pandora, YouTube, tune in radio, Skype, etc) are quite convenient and I have been using them more than I was expecting too!You won't go wrong buying this TV... two thumbs up!", "Date": "October 13, 2013"}, {"Title": "Awesome TV! The dual processor makes all the difference", "Author": "Sean Pitts", "ReviewID": "R29R6VSPRMMT10", "Overall": "5.0", "Content": "Picked the 7500 over the lower models because of the dual processor. It makes apps run smoother, and the TV picture quality is amazing. No more ghosting during football games, no more white-ish black levels. Great TV!", "Date": "October 6, 2013"}, {"Title": "Great picture!", "Author": "SLiM", "ReviewID": "RGJXVWVNBLYRD", "Overall": "5.0", "Content": "HD picture quality is great and SD is very good.  3-D picture is pretty decent.  I have it connected to Dish HD and a Samsung HT-F6500W.  Nice setup for a med/lrg room.  The viewing angle is not that great and you have to sit a certain distance from the TV to really enjoy the picture quality.  Got a very good deal on Amazon.  Overall, this is a great TV that has a lot of features and functionality.  Been very happy with it so far.", "Date": "September 13, 2013"}, {"Title": "This HDTV Rocks!!", "Author": "Thomas Rushmore", "ReviewID": "R2T0PDMVJ903XU", "Overall": "5.0", "Content": "Great TV, I have an older, slightly smaller version of this and like that TV as well, but this one is amazing.  Love that it has both Netflix and Amazon apps for watching movies.  Integration with Verizon tv and it really is nice to see at a glance a dozen or so of the upcoming and currently in progress shows to choose from.  Of course there are things that are a bit overkill and I will never use, but isn't that the same with most things these days?  In any event, if you are on the fence...get off it and grab this TV, you won't regret it.", "Date": "September 4, 2013"}, {"Title": "So far so good :)", "Author": "JCG", "ReviewID": "RBVV8SJBLJUK9", "Overall": "5.0", "Content": "Very happy, it exceeds our expectations!!  image, controls, internet, camera, everything works better than we th. We had a 55 inch but this is bigger and better plus excellent deal in amazon. recomend 100%", "Date": "August 30, 2013"}, {"Title": "Very good picture quality, a bit flimsy looking though", "Author": "Sameer Khera", "ReviewID": "R19HKTDTDPYYNF", "Overall": "4.0", "Content": "I was having some buyer remorse just after I bought it using a Groupon deal, which was very attractive. I was afraid that it may turn out to be that good. I am happy with the picture quality and with the fact that one of the HDMI ports supports ARC (Audio Return Channel) which allows me to watch netflix using the in built app while still feeding back the audio through my AV Receiver. This avoids the need for an additional S/PDIF cable. I will not even bother with web browser, voice and hand gestures, can't expect those features to be up to the mark. When you buy a TV you buy it for the picture quality and I have no complaints there.The only downside is that it looks a bit flimsy as it is very thin and the stand does not look solid. I am used to the Sony that I have, which looks rock solid. The flip side is that this is genuinely thin and therefore the stand is lighter which is also a positive. The Sony I mentioned is 5 years old and back then TV's were heavier and therefore looked sturdier.I watched a baseball innings in 3D, novel idea but sitting and watching with those glasses is not my cup of tea. I usually have the laptop when I am watching TV so 3D is definitely for me.This baby seems to be a great TV and I am happy to endorse Samsung....", "Date": "June 11, 2013"}, {"Title": "MIND BLOWN *****", "Author": "Tyler Bednar", "ReviewID": "R1S6EJTKCPUWMO", "Overall": "5.0", "Content": "RAVES:I purchased the 55F7500, deciding to upgrade after several years from my college 32\" Phillips.  I'm thoroughly impressed with this TV.  Does it have too much to offer in form of user capabilites, probably yes.  I rarely use the 3D (and would have purchased a cheaper option without it probably but that wasn't offered), never use the gesture control, voice rarely, and camera rarely but glad you can hide it down with a push.  I use a Roku2XD (don't have cable) and it does great, HuluPlus and HBOGO look incredible when playing shows, I actually prefer using the easy user interface of this accessory over the Samsung SmartHub, I also experienced app issues.  I also updated to the latest software that the support website has available through a zip file (takes a while).  I finally got my BluRay player in to fully test it out and watched Dark Knight Rises, Lincoln, and Pitch Perfect all in the same weekend... MIND BLOWN!  The clarity, color quality, smooth transitioning, vast sound range (I use Movie and Music setting under the menu when switching between TV and Pandora), all added up to an electrifying experience.  Samsung has truly made me a believer and future customer.  I've also hooked up a USB drive to look at pictures (I'm a hobbyist) and am truly in awe, I just wish I could get them to look that good when they're printed.  I've noticed anything that was digitally created works fantastic with this TV, like the opening to DKR.  I've never seen such great picture quality in any store or at any friend's house.  I would highly recommend buying this TV.  I'm a 25 yr old male who is hard to please when it comes to expensive electronics, but like I said this TV is MIND BLOWING!ISSUES:I wish the TV controller was more simple and easy to understand, I feel like the touch/swipe pad could be quicker if it were just buttons like all the other controllers. Apps sometimes give me issues/uninstall. I would be scared to wall mount it, it's pretty heavy, and struggles to rotate on its stand (love the thin/minimal border though), wish there was an shortcut to switch the sound menu setting from movie to music since I switch to Pandora alot in the mornings, also you can't hard code free broadcasted channels through an antenna if it doesn't find them you won't ever get them. In a world demanding options there's still some of us that like things a bit simpler but every option has been easy to figure out, just prefer some over others, to each his own.OVERALL:Even with slight issues, I'm still giving this TV 5 stars, no doubt.  If you're looking for an upgrade I would suggest this investment, just be careful not to get addicted, even my dog stops to watch it sometimes!http://www.samsung.com/us/video/tvs/UN55F7500AFXZA", "Date": "June 11, 2013"}, {"Title": "Excellent LED HDTV", "Author": "FE Bird", "ReviewID": "R282R42ONGBNWK", "Overall": "5.0", "Content": "I am very happy with this TV.  I own a total of 6 LED or LCD HDTV's.  This one is excellent.Pro's:Easy to set up.Excellent picture quality.Easy to use remote (better than LG magic remote)Easy network set upCon'sDoes not rotate easily on the standWould like to see more apps (like HBOGO)i would recommend this purchase to others.", "Date": "May 26, 2013"}, {"Title": "The best Smart TV", "Author": "Victor Cruz", "ReviewID": "R29J8XTUP4H0CP", "Overall": "5.0", "Content": "I think this is the best Smart TV, the video quality is very good, the sound is amazing and the smart hub is pretty easy to use.I send one of this (UN46F7500) to my family in Costa Rica, and all the apps (like Netflix, Facebook, Yotube, Skype) works perfectly with a 4Mb/1Mb of INTERNET.My only complain is that is not possible to watch video via HDMI (PS3 or Blu ray) and facebook at the same time.I really recommend that you buy this Samart TV.", "Date": "May 29, 2013"}, {"Title": "They refused to price match", "Author": "Jignesh patel", "ReviewID": "R1J34OCUI580VE", "Overall": "1.0", "Content": "Amazon.com sucks...1st the CS rep tells me they will price match it next day they refused to price match and now Lost out on both side fry's.com had this television for $1350  just didn't want to wait 3 weeks and Amazon.com screwed me over by that time fry's.com sale was over.", "Date": "May 8, 2014"}, {"Title": "Wow", "Author": "Sarah \"Sarah K\"", "ReviewID": "RKJYXS4YQ6FB0", "Overall": "5.0", "Content": "Upgraded from a 6 year old  50\" plasma and can't believe how clear and crisp the picture on this set is. The ability to access Amazon video and Netflix is a definite plus for me. The motion and voice controls are somewhat hard to control and probably unnecessary; but the included remote works fine for me. Amazon please note the delivery was fine except it would be nice if you can at least have the delivery include attaching the included stand and tv placement. Maybe include that option with the purchase for a small fee. for those of us who are disabled.", "Date": "February 17, 2014"}, {"Title": "Wow! Awesome!", "Author": "Luke Moore", "ReviewID": "R2ULZLS9EDZU5X", "Overall": "5.0", "Content": "Wow, what a sweet TV with a great picture.  The smart features work very well (the interface, the hand motion, the apps) and the the 3D is awesome.  I also have an Xbox one and the picture on my games are excellent.  My Samsung blu-ray player also works well with the television.The only thing I would knock is the difficulty when typing with the remote (e.g. when using the web browser).  I would recommend buying a wireless keyboard (I bought a logitech k400r for about $20 that works quite well) if you're planning on using the web browser etc.  The keyboard doesn't work with some of the apps though (e.g. Netflix), so that is a bit of a drawback.", "Date": "February 15, 2014"}, {"Title": "Absolutely the best TV I've ever had.", "Author": "Tony White \"Tony\"", "ReviewID": "R22G2K761XOHFG", "Overall": "5.0", "Content": "All the specs are on the money.  For the price you'll be glad you bought it.  Picture is noticeably cleaner and higher res than my \"old\" Sony Bravia 1080p.  It links with the DirecTV Genie all-home system admirably, and it self-updates when Samsung has one available.  The extra features are great (like a direct link to Netflix) and the Internet connectivity is an item of the future.  There's a lot of spam features that come with it, but since that's the worst I can say, it is obviously deserving of a five-star rating.", "Date": "February 1, 2014"}, {"Title": "Excellent", "Author": "John E Hines", "ReviewID": "R7GSB4D4IH4L0", "Overall": "5.0", "Content": "I love everything about this tv. Everything. Great picture, more features than I will ever use. Super easy set up. I am 60 and technically challenged, so that was real nice. Big box made my purchase easy. Delivery was early, at christmas time! Happy all the way around.", "Date": "January 25, 2014"}, {"Title": "Great TV", "Author": "Kansas Cook \"KC\"", "ReviewID": "R2K39QEYM16CBD", "Overall": "5.0", "Content": "Gorgeous picture; easy setup; interesting array of \"smart tv\" extras. Very satisfied with all aspects of this Samsung television. Have not yet used 3-D feature.", "Date": "January 3, 2014"}, {"Title": "Lots of features with great picture qty, but not so great 3D", "Author": "JAS", "ReviewID": "R1R2DFCEKP2UDE", "Overall": "4.0", "Content": "Lots of features, Great video Qty, standard Sound Qty, smart features.Voice & hand gestures, but not used too much in long run.Nice SYPE feature, very clear video chat.One disadvantage, for some reason, when watching 3D films, they look like shot with Home Camera... does not have film feeling ( I guess 24p) issue.please let  me know if their is a way to fix it. Otherwise 5 stars.Review is for Samsung UN55F7500 55 Inch model.", "Date": "December 31, 2013"}, {"Title": "great tv", "Author": "Stewart A. Feldman", "ReviewID": "R2JUZZYHKMG3U5", "Overall": "5.0", "Content": "great tv.  however, unless you're a gadget freak (i am but not to this extent) this tv does more than i'll ever want.  the 6000 series is much more cost effective.  i've got an 8000 and a 7500 series tv's among about ten samsung tv's.  even for me, these tv's do more than i'll ever want.  however, the pictures are great.", "Date": "December 26, 2013"}, {"Title": "Beautiful picture, worth the price.", "Author": "ET", "ReviewID": "R2SXK0PJQYZN5U", "Overall": "4.0", "Content": "The picture is excellent when you are looking straight on.  It is deep and vivid and very sharp; it almost looks like a photograph.  However, when you move above the screen or to the left or right (I notice it at 25-30 degrees off center), the picture washes out a little.The remote has a trackpad rather than buttons to change channels and access DVR functions.  This is not as easy to use as dedicated buttons because you need to access different menu screens (for example, to fast forward a DVR show, you press one key to access a menu, then you scroll to the second screen to get to fast forward, pause, etc.).  So, I use the DVR remote for DVR functions most of the time. The TV has many apps, which are convenient, and you can sync a bluetooth keyboard with the TV for web surfing, etc. Currently, the Amazon App doesn't work with a bluetooth keyboard, though.However, the picture is amazing and the processor is fast and wifi works well.", "Date": "November 26, 2013"}, {"Title": "Great TV, no so sure about the smart hub", "Author": "Alejandro Ugalde", "ReviewID": "R3M2CYHDMJ9CIR", "Overall": "4.0", "Content": "I got this TV last week, and I decided to put it in the wall above the fireplace.  After installing and setting the TV for the first time I realized that HDMI were in the order that I wanted, so I took it off and re-accommodate the HDMI as I wanted.  The problem was that re-installing the U-verse box was not as simple as re-name the source in the TV, it took me a while and 1 call to Technical support to understand why the TV was not working correctly (no on-TV content in the smart hub, and voice recognition showing errors).  We had to reset the TV (original factory settings) in order to make it work properly.  Firs experience was not as good as I expected but image and smart motion are great, but not so sure about the smart features that make the TV cost over $2000.  Wondering if I should have purchased the 65 inch 7100 instead.", "Date": "August 13, 2013"}, {"Title": "Beautiful TV", "Author": "PeterCip", "ReviewID": "R3KBOS554F0KFC", "Overall": "5.0", "Content": "I'm happy I opted up to the 7500, as the 7100 didn't have the same level of Motion stability. The color is perfect, and the frameless design is wonderful. Hooked up the wireless soundbar for better sound, as the speakers can feel a bit empty.", "Date": "July 23, 2013"}, {"Title": "ONE GREAT TV", "Author": "J Russ", "ReviewID": "R3GGDUFGTT56EZ", "Overall": "5.0", "Content": "This is as good as it gets! Right out of the box it looked great and was actually very easy to set up. The web browser also works great. More apps than I will ever use but that's okay too.Took advantage of the free Samsung HW F450 sound bar of which Sear's had a big sale on this last weekend for $269. Happy with the sound but would like to be able to do more adjusting. Also purchased a new Samsung BD F5900 since I didn't own a Blu-ray player and they all work great off of both the Samsung TV remote and my DVD Cable box remote.I'm very glad I oped for the Samsung F 7500.Thanks Amazon for the fast free shipping!", "Date": "June 10, 2013"}, {"Title": "Great Television; Apps are a bit buggy though.", "Author": "Gregory", "ReviewID": "R1XFJEG9NH7GM2", "Overall": "5.0", "Content": "So far no complaints about the TV, except that the applications seem to be uninstalling themselves occasionally.  They are not necessarily apps that I use frequently, but it is a bit annoying.  Hopefully / I would expect that this will get better as the marketplace develops and becomes more mature.", "Date": "May 18, 2013"}, {"Title": "Questioning the quality", "Author": "Luc", "ReviewID": "R3OHDWON2VWO4P", "Overall": "3.0", "Content": "I ordered this TV, received it and this is not a plug and play, you need to configure it. I'm not an IT guy so it took me a while to understand. The SMART feature didn't work at all. The TV was connecting to wireless but failed to update the firmware. Called Samsung, the first guy I spoke to lost patience and eventually hung up the phone, The second guy was very helpful spent 1 hour trying all kind of procedures until he tried to transfer the call to a technician that had remote access, This technician connected remotely and did the same procedures (reset to factory default, change IP settings, etc.) that the second one tried and still failed, His answer to to send an in-person technician, at my cost.AMAZON.COM has an excellent client service, it was the first time I tried contacting them and they were very helpful, they proposed to return the TV, so I did,  They sent me another one.  I received it 3 days later, but the delay was caused by major snow storm in eastern states US.The second TV's SMART features are working great, I can access Skype and search the internet.  So, I was curious to see if the second TV would be better than the first, I tried the same procedures the technicians did on the first TV to update the firmware...and it fails....exactly the same spot (at 46%). Wrote to Samsung, they apparently never seen a 46% failure, so their response was to send an in person technician...at my cost.Image quality 5*Sound quality 4*SMART features 5*Easy to wire/connect, lengthy procedure to set-up but step by step is well explained  4.5*The TV loses it's stars because it failed to update + Samsung technical support failed to correct the issueEventually I will have to pay to have it fixed...", "Date": "February 7, 2014"}, {"Title": "Expensive, but you'll be forever pleased..", "Author": "K. N. Barker \"Shateldo\"", "ReviewID": "R374CI4HME7L83", "Overall": "5.0", "Content": "Light bleeding on the left side especially in black background scenes. No effect on color scenes. 2d to 3d conversion is impressive in content like Bioshock 2. Full web browser is useful, but it's hardly full if there's no ability to open links in new tabs (probably from lack of an alternate click on the remote). Need two people to put on mount.With 240hz or Samsung's equivalent to it, I see almost no motion lag. Any motion lag I do see I blame the content provider, like my aging Xbox 360.Motion controls using hands are neat and at times seem to work better than kinect's first version. But the cursor requires precise movements than are sometimes hard to obtain with your hands. I leave motion controls off. Voice search using remote microphone can sometimes work well but the easiest control method is to just use the track pad. Internal settings are complex but Samsung did a good job of bringing the stuff you needed right to the front lines with their Quick Options button on the remote.I don't think the wifi-adapter built in is exactly quality because at certain times while watch netflix I'll see things (lag, video pixel glitches, video quality differences) that I never saw on the xbox netflix app, BUT it doesn't always happen and the web browser experience usually has no lag.I wouldn't bother with the presets in clearmotion (lg users know this as trumotion). Using halo: reach's starting sequences I've noticed motion blur in the animation using either the clear or smooth preset. If I go to custom and max it judder/blur reduction to 10 and turn on that second option for video enhancement that is not available until choosing custom I get better results for motion. Just leave that on all the time.Got the tv in October 2013. It did one update and once completed has not needed to do another one since. I think updates are scheduled every 3 months anyways.Samsung apps are completely useless. I've only used netflix and the web browser. There's just not enough app support yet. Too many are useless. It reminds me of us cellular apps before android came out. It was nostalgic but wrong. I asked for an android os hdmi stick - not chrome cast though.", "Date": "December 8, 2013"}, {"Title": "Sammy 7500 Series 46\"", "Author": "E. L. Woods Jr.", "ReviewID": "R2806GQR5KX5HD", "Overall": "4.0", "Content": "Great picture though somewhat narrow viewing angle.  Seemingly endless tools and adjustments I.e. TV can be tuned to suit anyone's preferences........a good feature.  Strange little remote, awkward to use.  Lots of apps to choose from.  Internet connection was seamless.  Like it all but can't say I love it.", "Date": "December 1, 2013"}, {"Title": "The Bomb Diggity", "Author": "Glenn", "ReviewID": "R1RW1X2MFA4O2M", "Overall": "5.0", "Content": "This TV is awesome!!!  Previously I had a 60ES8000 model that had severe clouding and flashlighting issues to the point you could see the backlight through the picture when watching TV at night.  I returned the TV within 4 weeks of owning it and opted for trying the 60F7500 model which has pretty much all the same stats except the F series has a quad core processor.  Samsung definitely addressed all the backlighting issues that plagued the ES models.  After adjusting the backlight settings, you can hardly notice it even when the room is pitch black (for whatever reason, the default settings have the backlight turned all the way up).  My video games have never looked better.  The upgraded processor is an added bonus and helps make navigating the Smart Hub extra smooth.  I would highly recommend this TV.", "Date": "July 1, 2013"}, {"Title": "Amazing Picture", "Author": "Sokly Saing", "ReviewID": "RESIG42JROIDC", "Overall": "5.0", "Content": "Amazing Picture, sports and fast moving viewings look amazing.  Game mode is very nice on the low latency response for PS3/xbox gaming.  My  only gripe so far would be the AirPlay (tv audio over bluetooth) with the samsung soundbar that works with it, it works nicely but i wish you had the option of picking DTS instead of PCM sound output.  Another gripe would be, the Automation Plus feature.  you should be able to hotkey it to a button on your remote.  There is some programming that you might want to watch with it on and some off.  The other option that should be on a hotkey is the game mode.  I prefer the coloration of Movie mode but with game mode you can only use the Standard option.  The final thing would be the Samsung smart hub, i wish you could filter out the standard definition channels from the samsung menu.  everytime you hit the cable guide, it starts the channel listing at 1, instead of the channel you're currently viewing and if you're watching in HD which most US users are, then its a pain to have to keep scrolling down.", "Date": "June 25, 2013"}, {"Title": "Awesome Tv", "Author": "Sanil Bhatte", "ReviewID": "R24DLNABY3KBUY", "Overall": "5.0", "Content": "Hi,This is my second smart TV and I am happy with the functionality. Response for the smart feature is fast. Picture is crisp and black levels are good. Gestures control is troublesome. Overall great TV but a Little bit pricey.", "Date": "June 10, 2013"}, {"Title": "Great TV", "Author": "D. Finkelstein \"The Fink\"", "ReviewID": "RFAL5ASRNJOCL", "Overall": "4.0", "Content": "I've only had this for a week. So far so good. This is my first \"smart\" tv and it can be daunting how many features are packed into this HDTV. I think the hand gestures and voice are gimmicks however, especially the voice commands since I can barely get it to work and it's just easier to push a button. hand gesturing has more promise and works as advertised but right now it's not being used to it's full potential like the microsoft xbox kinect. As a mac user it's bummer that it won't play nice, (meaning airplay) with my iTunes media. I could buy an apple tv which would solve this problem. But that just means there are a treasure trove of samsung features that are now useless as I am not an android user. If you use your samsung tablets and phones you will be over the moon.", "Date": "May 28, 2013"}, {"Title": "Nice picture, nice features, came broken", "Author": "John Cargo", "ReviewID": "RWSANQU9BBTLI", "Overall": "4.0", "Content": "Picture quality is quite nice once you cailbrate it (YES! You MUST calibrate your TVs! Out of box is NEVER the best picture). Features and plenty and function without any noticable flaws. Only problem is the TV came with a broken motherboard. Picture came up, but with a big vertical line on the left side. Called Samsung and after three calls they sent a technician out to check out the TV. Switched out the motherboard, works great. Service was under warranty so didn't have to pay a dime.", "Date": "March 19, 2014"}, {"Title": "goooooooooD!", "Author": "Park jonghoo", "ReviewID": "RAODX1JMG8R1L", "Overall": "5.0", "Content": "I will have good time with my family.Because, I got it this TV.Smart tv is very useful.Internet, movie , game , etcperfect!", "Date": "January 9, 2014"}, {"Title": "Much to like and recommend this Samsung TV", "Author": "B. de Mil", "ReviewID": "R3BRLCSQQ8HNHX", "Overall": "5.0", "Content": "Provides a beautiful and clear picture. I have not yet learned how to use all its features because it was purchased for my vacation home. It was very easy to set it up right out of the box within a short time. It seems like it will be fun to learn and use all the features. Since I will be doing that soon, I will come back to my review and make any appropriate revisions. Great service from Amazon Prime as always.", "Date": "December 7, 2013"}, {"Title": "Not A Paid Spokesman", "Author": "Jimbo \"DVD Fan\"", "ReviewID": "R382GE83KRUEQ8", "Overall": "5.0", "Content": "I am not paid by Samsung as some of the other reviewers said that some people are.I am in my Second Day with this TV and I have been Amazed. The picture quality was so good that I found my jaw dropping. I first went to HBO on the Dish Network and watched Mr. and Mrs Smith after I had put the tv into vivid quality. It was amazing that you seemed so totall immersed in the picture. I then went to Amazon Prime and watched Sleepless in Seattle.I finshed off with a Blue Ray and A DVD all of them looked better with this TV. I am a retired senior so after Christmas I will check out the 3-D movies.The only cons were that as a Senior which I am, I was the TV controller was  like a mouse it makes it hard to seem for someone with some years on them to enter their code to get Amazon Prime.I will update this as time goes buy but at this point in my life I have never seen a TV of this quality. A 75 inch would be too expensive and overpower a room at this quality, so for most rooms this is the TV to try.", "Date": "December 6, 2013"}, {"Title": "Amazing.  We love it!", "Author": "rsneld", "ReviewID": "R3D0QVCMZVWR86", "Overall": "5.0", "Content": "Amazing TV.  We love, love, love it.  Has all the bells and whistles.  Shipping was fast.  Easy to put together.  I highly recommend it.", "Date": "December 4, 2013"}, {"Title": "Awesome, just pure awesome.", "Author": "Amazon Customer \"Animaleyez\"", "ReviewID": "R15B11J5QAMXHJ", "Overall": "5.0", "Content": "I've only had this unit for a few hours but so far it is impressive.  The most impressive thing to me is the bezel or lack there of.  While taking nothing away from the picture I expect nothing less than stellar quality from Samsung considering how awesome their phone's screen look.  That being said I'll update this review after I've had some time to experiment and explore this unit more. So far so good.I have to admit I am blown away.Pros:Wifi: Just connecting this to wifi was a snap and unlocks the bulk of your Smart TV's features3D: I never imagined I would be sitting at home watching movies in 3D as I always felt the glasses were either over weight or just plain goofy.  So label me goofy but this is outstanding.  Admittedly all I've seen so far are Disney/Pixar movies but they rock in 3D How to Tame Your Dragon and The Incredibles are by far my favorites.Allshare/Samsung Link/Screen Mirroring:Can you really enjoy any Android device without utilizing some of it's more prominent features? Samsung Link is just a way to to share what's on your Samsung (Android) device be it Tab, Note, Galaxy etc between the device and the TV.  This works so perfectly.  You have company over and want to share photos, videos or music? Go right ahead and fire this baby up and it's quite awesome.  Start a picture slideshow and set it to music simply awesome. Even one step further is Screen mirroring. It's like Samsung Link but it just mirror's your device.Picture Quality: It stable and ultra beautiful. The ultra thin bezel is just unbelievable and makes you feel as if you're getting the maximum size of your television. I could go on but I think you get the picture.I can't talk about the camera or the audio features as the location of the TV is too high to the ceiling and the audio features annoyed my wife so I turn it off.Cons: Price only because it's very pricey but I feel it was worth every penny.All and all this unit rocks and I can't say enough good about it.  In a nutshell if you can get one do so.", "Date": "November 29, 2013"}, {"Title": "Excellent Product!", "Author": "Dileccio Antonio Guzman", "ReviewID": "RU55ZUWCFMA0U", "Overall": "5.0", "Content": "Just got this TV for my new home, and no complains so far...excellent packaging and delivery on time...the TV itself is as advertised!", "Date": "October 16, 2013"}, {"Title": "Very Nice", "Author": "C. Brocato \"cbrocman\"", "ReviewID": "R2HETR423WPJ64", "Overall": "5.0", "Content": "Very nice tv. I really like the camera feature and voice recognition. The built in Wi-Fi is also a nice feature.", "Date": "June 20, 2013"}, {"Title": "Fantastic 46inch TV", "Author": "Amazon Customer", "ReviewID": "R1Y0DCH6DUYNLZ", "Overall": "5.0", "Content": "Samsung has done a great job and my family loves this TV. The picture quality is pretty awesome, the slim edge is so nice. Setup is actually really easy. The amount of features is great and fun to use.", "Date": "June 14, 2013"}, {"Title": "SAMSUNG UN60F7500 3D LED HDTV", "Author": "rd3md", "ReviewID": "R1XFFEKI5BN6VG", "Overall": "4.0", "Content": "THIS IS MY THIRD LARGE SAMSUNG LED TV.  THE PICTURE IS VERY GOOD.THE VOICE RECOGNITION IS TRYING AT TIMES.  FOR NO REASON AND WITHOUT PROMPTING, THE POPUP FOR AN ACTION BY VOICE RECOGNITION APPEARS.THE SMART HUB FEATURE, WHICH GIVES CHOICE OF WATCHING TV OR SELECTING OTHER FEATURES IS ANNOYING.  IT IS THE DEFAULT SETTING WHEN TURNING ON THE TV AND WOULD BE MORE USER FRIENDLY AS AN OPTION RATHER THAN DEFAULT.ON OCCASION WHEN SMARTHUB APPEARS THERE IS A NOTICE THAT AN \"UPDATE\" IS AVAILABLE; TWO OPTIONS ARE GIVEN \"CLOSE\" AND \"UPDATE\".  IT IS NOT POSSIBLE TO MOVE CURSOR TO UPDATE AND UPDATE MUST BE SELCTED BY SEVERAL OTHER STEPS.  WOULD BE MUCH PREFERABLE IF COULD SIMPLY UPDATE FROM SMART HUB SCREEN CONTAINGING THE TV PICTURE WHICH RESIDES IN LEFT UPPER CORNERI SUSPECT IF I WERE A COMPUTER NERD THAT I WOULD NOT BE BOTHERED, BUT I AM REASONALBY PROFICIENT AND FIND THE MANY FEATURES SOMEWHAT OUTWEIGHED BY ALWAYS HAVING TO DEAL WITH RAHTER THAN HAVING SELECT SMART HUB BE A SECONDARY SCREEN.IT WOULD BE VERY HELPFUL IF SAMSUNG WOULD PROVIDE SIGNIFICANTLY MORE DETAIL IN MANAGING VOICE ACTIVATED INSTRUCTIONS.  I HAVE NOT TRIED THE VISUAL CUEING.", "Date": "August 30, 2013"}, {"Title": "Great Color, but you'll definitely need a sound bar", "Author": "Customer", "ReviewID": "R4LBTPX9Z7RAI", "Overall": "5.0", "Content": "So far everything works as its supposed to.  Wasn't too too impressed with the \"white glove\" delivery.  While they got the job done, the two individuals looked like Cheech and Slingblade.  Got it out of the box, plugged it in & good to go - After a few adjustments.  Voice & hand movement stuff I just turned off....too finicky.  Also have not used as 3D yet.", "Date": "December 9, 2013"}, {"Title": "goof tv", "Author": "SuperDealUnlimited", "ReviewID": "R18HCTVC9TAOUT", "Overall": "5.0", "Content": "good tv at once, i would love to have it. Samsung UN55F7500 55-Inch 1080p 240Hz 3D Ultra Slim Smart LED HDTV", "Date": "December 4, 2013"}, {"Title": "ORDER THIS TV...THERE IS NO COMPARISON", "Author": "BooYah!", "ReviewID": "RY7DAJTDYI18W", "Overall": "5.0", "Content": "I PURCHASED THE SAMSUNG UN55F7500 AND I'M GLAD I DID. UNBELIEVABLE PICTURE QUALITY!!! IMO THERE ARE ONLY TWO OTHER TVS ON THE MARKET RIGHT NOW THAT ARE BETTER...THE 8000 SERIES SAMSUNGS AND THE SONY 4K. FOR 1800 BUCKS YOU CANT BEAT THE DEAL FOR THIS MODEL I PURCHASED. I REALLY COULD CARE LESS ABOUT THE 3D AND THE MAJORITY OF THE SMART FEATURES INCLUDED IN THIS MODEL BECAUSE I BUY TVS BASED ON HOW THE PICTURE QUALITY IS. THE COLORS ARE VIBRANT, THE PICTURE IS BRIGHT, PERFORMS EXCELLENT DURING FAST ACTION SCENES, SPORTS ETC.  ENOUGH SAID.", "Date": "August 15, 2013"}, {"Title": "Avoid the lure of the great picture, poor quality construction on every aspect of this tv.", "Author": "Jc4life", "ReviewID": "RXZG87B4O8WS", "Overall": "2.0", "Content": "I Hate to give a bad Samsung review but every Tv i've owned has had a major malfunction to the point of paying too much to repair or scrappign it.I'm already worried about this tv.Let me start by saying the picture quality is amazing. The 3d is great. Tv setup is very simplistic. Its got a lot of great gadgets. I enjoy getting on youtube and watching some of my videos i've made riding my horse. (on my phone but the tv's bluetooth picks it up and can play it also).The first Tv that came i had returned because it was turning itself off w/out sleep timer or updates. I'd be sitting there watching. Main annoyance is this particular tv Has an annoying buzz coming from it 2-3 times per hour. Totally random and it lasts for at least 3-7 seconds. So i returned that tv. Got a replacement and this one is doing the exact same thing. The odds of getting 2 bad tv's has to be impossible. I feel helpless in the situation.Other negatives. The remote as others have mentioned. It's small, clumsy, very fragile. Don't dare drop it becaues im sure the plastic would break( i dont want to find out). I bought the square trade 4year warranty. If they made an 8 year i'd be all over that. To me thats so sad. Every samsung tv i've had has crapped out after 3-5 years. I've owned 3-4 tv's from them, 1 monitor.Hand gestures are relatively useless, for me on the tv. Waving of the hands etc just seems to confuse the tv. Then you have to speak loud n' clear into the remote for it to understand you. Then the tv talks about to you super loud.My main reason for the 2 start rating is due to this tv's flaws and or defects. Inability to produce a tv that will last. I'm not rich by any means. I dont see myself being able to keep buying tv's with warranties tax etc nearly 2,000$. C'mon samsung put out a lasting product. Stop sacrificing quality materials for profit. Losing customers due to poor quality control is bad business.I regret not trying Sony this time. Or Even walmart brand at this point.This is just an honest Texan review, its quite opinionated but honest. I heavily rely on other peoples reviews. There's not much i buy that i dont read almost every review.Good luck to anyone thinking about this model tv. I'd spend a little extra and go a model higher and hope for the best or just avoid Samsung altogether. I have friends who have had zero issues with  Samsung. Me on the other hand have had horrible luck.Also the material of this tv as well as the remote is all super super cheap plastic, tv stand is cheap hard plastic.", "Date": "November 21, 2013"}, {"Title": "Great TV!", "Author": "Niles", "ReviewID": "R20SDK6HG2WE4T", "Overall": "5.0", "Content": "This is a great TV with superb picture quality!Works wonderful in our conference room.I would recommend.Samsung Rocks!", "Date": "February 18, 2014"}, {"Title": "Where's the rest of my Netflix Queue?", "Author": "DVD Expert", "ReviewID": "R3VFJ9PL0DMHOO", "Overall": "4.0", "Content": "I just received this TV last week, finalized its setup over the weekend, and now I'm ready to begin my journey - and this progress report.The first thing I noticed, transitioning from a 32\" CRT to this set, is that it looked a lot smaller in the store! Damn, this TV is big! It's a good thing I didn't go for the 70\" (or, even, the 65\"). Anyway, this TV makes my little living room feel like a private screening room. People are so large, I feel like they're actually in my apartment.And I'm glad I opted for the 7500 over the 8000, as its swivel base allows me to sit dead center for the best color and clarity.So, after setting up the Netflix app, and logging in to my account, I noticed that, for some reason, this set displays only an incomplete Instant Queue (or, \"My List\" as it is now called). Granted, Netflix supposedly limits invidiual lists to 500 titles but, at some point, I was able to reach 700. I've pared it down to just over 600, and my Roku shows every title - as does my TiVo and my LG BluRay player, so why doesn't the Samsung TV?Another small beef I have is with the remote. I love the metallic style, the raised icons and its heaviness in my hand, but the touchpad (its scrolling capability, anyway) is, at times, oversensitive, while, at other times, resistant. When using the virtual keyboard, I found myself constantly deleting undesired key entries, skipping keys and, simply put, going back-and-forth multiple times.Now, if I could just figure out the surefire way to verify that I am watching each program in its correct aspect ratio.UPDATED 10/2/13:For those of you are teaming this television with TiVo, I have settled on the best possible combination of screen formats, though the result is still a bit unsatisfactory. TiVo has three options: Full, Panel and Zoom. This television also offers several options when paired with TiVo Premiere (standard menus - I don't yet know if the HD menus have any effect on these options). Regardless of any other component's options, for proper aspect ratio calculations, this television should remain set at 16:9; any other setting will either distort or crop the picture.So, with the TV set at 16:9, the results are as follows:TiVo set at \"Full\" = picture squeezed (or squished, as it were) from top to bottom, so image looks as if it's being projected onto a funhouse mirrorTiVo set at \"Panel\" = black borders on all four sides of picture, so image looks like a picture within a frame, while about 30% of television screen is black; picture, however, is neither cropped nor distorted and retains sharpness (in foreign films, subtitles are clear and legible)TiVo set at \"Zoom\" = picture fills entire television screen with negligible cropping, but image appears grainy and fuzzy, especially noticeable in foreign films, where subtitles are somewhat blurry.Hopefully, when I use by BluRay player and my TiVo Roamio, both connected via HDMI, I will experience much better image reproduction.Oh, and I do notice some minor flashlighting in the corners of the screen, but it only bothers me when I think about it or look for it.But one extremely annoying element is the fact that, with Samsung TVs, you cannot use ARC without AnyNet, but AnyNet fouls up my system by randomly switching the inputs on my AV receiver. I have my old DrekTV satellite receiver connected via RCA cables to the TV/SAT (DUH!) input jacks on my receiver. There is no HDMI input slot for TV/SAT (why not?); otherwise, I would have connected my TiVo Roamio to it. But, with AnyNet \"on\" (so that I can use ARC and the control features that allow me to turn both my TV and receiver on with just one button), EVERY TIME I turn on the television, I have to wait about 10-20 seconds for AnyNet to switch my receiver from its previous input setting to TV/SAT, so that I can then reach for my receiver's remote to manually switch it back (fun times!). I've even tried turning on the receiver first, but doesn't that defeat the purpose of the one-button synchronization? Even so, this method only delays the result, which is the same as above.", "Date": "September 30, 2013"}, {"Title": "Samsung, I could leave it", "Author": "Russ \"Gorloth\"", "ReviewID": "R2EDRLXPBD8FQR", "Overall": "2.0", "Content": "Here goes. Basically there are currently 4 technologies that compete for your your home.  AMOLED, LCD w/white LED backlighting (this tv being reviewed) Plasma and DLP. Well DLP is just about dead. It's almost like VHS vs Beta. It's history. So now there are 3 left. Plasma is being discontinued. The best which was the top end Panasonic, will be gone come 2014. They are moving 1/2 of their development team to AMLED technology development. So now there is AMOLED and LCD w/LED backlighting. The TV industry is touting LED TV\"S when in reality they are talking about LCD TV's with LED backlighting. They are purposely trying to confuse you. AMOLED tv's are just expoentially better than LED tv's. AMOLED is the big kahuna. These LCD w/ LED backlighting are crap. First and for most for your viewing pleasure you want a picture that will show a linear range of tones from black to white. The difference in 100 words or less id that LCD is a liquid crystal display. To show any light it must have a backlight. So they use LED's which are very energy efficient. Al Gore will love you for it. AMOLED's are actually Light emitting Diodes which show ranges from black to white. Let me be more specific about that. When showing black, they are OFF, meaning zero light emitting. Walk into a dark room with a AMOLED TV showing black and you won't be able to see the TV at all. This Samsung and LCD tv's and you will see a gray rectangle which is supposed to be black. To be short about it. LCD w LED backlighting shows about 15% black to bright white. AMOLED will show 0% to 100%. Thus they are more 3 dimensional. So to rate this TV, at $1350 ~ $1600,  just buy a less expensive one. This one's not worth it. AMOLED will blow it out of the water. AMOLED is the very latest technology, so it will bear a very high price tag at first, but it is actually cheaper to make than LCD TV's so the price will come down drastically, and soon. SO I got this TV because I got a decent price on Cyber Monday and from Amazon. I probably should of bought a lesser model in this size range. However I'm waiting for a 4K TV based on AMOLED for my home theater. This one was for my bedroom. I would of bought the Panasonic plasma 42\" but they quit making the 1080p and only offer the 720p version. and then plasma is going away. That would of been a no brainer, but I got this Samsung, guess I'll have to live with it.. it's charcoal colored black's and all. A lump of coal in my Christmas stocking, I hope the rumored Apple TV will be a 4K AMOLED TV. Make Steve proud. I give this TV 2 stars.", "Date": "December 9, 2013"}, {"Title": "Worst TV Ever", "Author": "paul salvatore", "ReviewID": "R38A05NRAJ6N78", "Overall": "1.0", "Content": "I've owned this POS since 01 July 2013.  Since then, I've had to have it serviced TWICE.  The first time was to replace a bad board.  There are three in the TV.  My guess is that this time it's one of the other two.  I have to take uncompensated vacation days from work to wait for a technician to come to my home to fix it.  This time I will be without a TV for a WEEK while I wait for parts to come in.  I will NEVER buy another Samsung again.  Looks like I own a very expensive paperweight.", "Date": "October 14, 2013"}, {"Title": "Great when it works which is not often enough", "Author": "icepick", "ReviewID": "R3OOZ0ORENRNJA", "Overall": "1.0", "Content": "This is the first one star I have ever given but I couldn't rate this tv any higher.  I had the tv for less than 3 months the first time all the HDMI ports stopped working.  It took a month to get someone out to \"repair\" it, which involved doing a hard reset from the manufacturer debug menu.  This worked for a little over a month and now it is starting up again and the hard reset doesn't work anymore.  Now I get to start working with Samsung customer service again which was abysmal last time I had this issue.For what it is worth the tv's picture is amazing when it actually works and I really enjoy the smart tv function.  It is possible that I got a lemon but I'd buy at your own risk.", "Date": "December 15, 2013"}, {"Title": "The TV is fine, but Samsung's response to a problem was unacceptable", "Author": "Jo Ann Cummings", "ReviewID": "RDUJHDLZQW307", "Overall": "3.0", "Content": "I love Samsung products, and think they are high quality. But I was completely surprised at the lack of support from Samsung the first time I had a problem.I received the TV on time from Amazon, but could not assemble as the screws to attach the base to the stand would not fit. You would think that for a $1400 TV that Samsung could get this right. I spent 30 minutes at Home Depot, who could not fix it, but directed me to a local hardware store, Turner Hardware. The next morning the helpful staff at Turner literally re-threaded the screw sockets for me, and then put it together for me with 4 new screws. He charged me 91 cents for 4 screws.Earlier I had phoned Samsung and asked them to send me the replacement parts, and they said they would, and I would receive in 5 to 14 days. I said no, no, no, they needed to overnight the screws to me. They said they couldn't do that. Say what? They screw up my shipment, and can't expedite replacement parts?  That's just silly.Samsung said I had to email then my receipt to receive the replacement screws. They then said what I sent them was invalid as it did not contain the payment method. Seriously? For them to say they have to have my method of payment to make the receipt valid is absurd. I don’t give out that kind of information, as it has absolutely nothing to do with the problem or their failure to perform, and it is none of their business. And paleeze, don’t tell me it’s their policy; I don’t care… it is my policy to not provide needless and non-pertinent information. . They were just stalling. Ask enought questions and throw out enough roadblocks and folks will give up.I then phoned Amazon and asked them to phone Samsung and get the delivery expedited. They did, and said that Samsung would not expedite. They did find out the screw number, and said if I would buy them, they would repay me for them. Their response was immediate... and as always, Amazon is the best at customer service. They rule.My TV is great... I have not begun to learn everything about it that I need to, but the picture is fantastic. We watched the Life of Pi in 3D, and it was stunning. Love the remote, and find it easy to operate. Love being able to access YouTube, Amazon, and NetFlix. I easily played my YouTube playlist of videos... fantastic. There have been no disappointments with the TV.The 3 rating reflects the lack of customer focus and response from Samsung. They should match their service and support with the quality of their products. And when they screw up, they should correct it immediately. Their response was dismal.", "Date": "August 12, 2013"}, {"Title": "Best TV I've watched!", "Author": "Don King", "ReviewID": "RJYJMESFPVHP5", "Overall": "5.0", "Content": "This is the first TV I have bought that was not at all disappointing. This TV has exceeded my expectations in every way.", "Date": "April 25, 2013"}, {"Title": "Good stuff", "Author": "Max Denver \"Max\"", "ReviewID": "R16D20IYECRZEG", "Overall": "4.0", "Content": "as a used HDTV , I had prior experience with a SAMSUNG DLP TV acquired  7 years , with excellent results. With this state of the art unit soon to be obsolete , its an absolute joy to learn and practice using  the wide range of functionality.", "Date": "June 13, 2013"}, {"Title": "If I save one family the heartache of losing their hard-earned money, I will be happy!", "Author": "Just Sayin'", "ReviewID": "R105ZY12FMOYT8", "Overall": "1.0", "Content": "*****W A R N I N G*****Do not buy SAMSUNG Televisions!!!  After the one year warranty period SAMSUNG Television screens tend to show burn-in and ghosting with horizontal lines, along with very heavy distortion of picture on right-hand side of the screen.  This problem is systemic in all their LCD's and LED's. Consumer's have complained all over the internet.  There are even numerous Youtube postings with the exact same problems as in my DEFECTIVE SAMSUNG model, as well as the same DEFECT in other models.  This defect occurs upon start-up, and lasts for the first 15 minutes of trying to view a program. Then the picture gets progressively worse over time and continuously declines to zero picture status.I tried SAMSUNG's Executive Customer Relations Dept. and was told:  \"We will do nothing but refer you to a local Authorized Repair Shop.\"  They were downright blunt and rude to boot!  I feel robbed of $2,900.00The repair will consist of a diagnosis visit, and then another visit to install a replacement \"Panel\" that costs $1,300.00 for the part plus $279.00 to install, plus taxes......all told, another $1,719.16....which equals basically buy another TV.SAMSUNG customer service also told me that their Televisions depreciate at a rate of 20% per year, and they will not repair any of their products after 4 years!  Their own repair people told me to just buy a new SAMSUNG set!!!SAMSUNG:No Customer SupportSystemic Panel DefectGhosting of imagesBurn-in on screenDistorted pictureVery expensive to repair", "Date": "November 29, 2013"}, {"Title": "DO NOT BUY IF YOU CARE ABOUT SOUND!!!", "Author": "Melissa Carrington", "ReviewID": "R38MXEACQ7S9W4", "Overall": "1.0", "Content": "I bought this TV after seeing the picture and being amazed by the quality.  However, I have had nothing but trouble since getting it home.The TV does not allow for any 5.1 sound to pass through and if you send your components through an AVR and then to the TV it will not let you use the smart hub features.  Yes, I said that right.  The smart hub has no way to send audio out through HDMI.  Therefore you have to use toslink.  But you must also have a cable box plugged into the TV.  If you do not, then the TV software shuts down sending any audio out.  Therefore, if you care about using the smart hub, apps, or getting 5.1 sound out of anything, DO NOT BUY THIS TV.  All it is good for is plugging in a cable box and listening through the TV speakers.  Yes, you could send 2 channel audio to an AVR but all that would do is make it louder.I have been on the phone for countless hours with Samsung and they instructed me to buy a bunch of cables for work arounds so that I can get 5.1 sound or ANY sound at all from the smart hub.  However, after all that failed they told me that the TV is just not compatible with anything and I am out of luck.1 star for picture quality.", "Date": "October 25, 2013"}, {"Title": "DONT BY THIS JUNK", "Author": "2morrow", "ReviewID": "R2JRDC8YA4XIYZ", "Overall": "1.0", "Content": "Just 45 days out of the box the Samsung turned off by itself and won't turn back on.WOW this is just great 4 days before the Super Bowl!!GDSOBI'm pissed off and will never buy another Samsung product ever again!!", "Date": "January 29, 2014"}, {"Title": "Shipping issue", "Author": "Evan Lengerich", "ReviewID": "R34RVZ2UMJL5VF", "Overall": "3.0", "Content": "Was really excited about this TV to come from all the reviews I read. Unfortunately, when it showed up to my door the bottom corner of the package was missing and the TV was broken. I had to deny shipment.I will rate this 4 stars because: A. This is the first time I have ever had a problem with TVs through Amazon and B. I called Amazon right after the shipment left and my money was refunded that day to buy a new TV. Great customer service deserves at least 3 stars.Here's to hoping the new TV i just ordered shows up in one piece.", "Date": "August 8, 2013"}, {"Title": "CMR Conflicts With Support Page", "Author": "Jim H", "ReviewID": "R30NO83EN3DSWQ", "Overall": "5.0", "Content": "This is really not a 5* review but I was curious as to the CMR vs the 7100 (which has stayed the same as last year 720 but may have improved the dimming process). This page claims 1200 but the Samsung link I was given shows 960. May be minor consideration but a difference nonetheless.", "Date": "April 13, 2013"}], "ProductInfo": {"Price": "$1,497.99", "Features": "1080p HDTV with Micro Dimming: Best picture quality\n240Hz Refresh Rate: Best for general viewing, video games, action movies, and sports\nSmart TV with Gesture Controls and a Built in Camera: Interact with streaming content and the web\nThin LED Design TV\nThin LED  Design: TV without stand (Width x Height x Depth): 40.9'' x 23.8'' x 1.4'', TV with stand (Width x Height x Depth): 40.9'' x 26.8'' x 12.1''", "Name": "Samsung UN46F7500 46-Inch 1080p 240Hz 3D Ultra Slim Smart LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/417M44vq19L._SX300_.jpg", "ProductID": "B00BCGROEQ"}}