{"Reviews": [{"Title": "The Good, The Bad, The Ugly", "Author": "Techno Geek", "ReviewID": "R3S47BHQ2BVDVI", "Overall": "4.0", "Content": "Just bought this new 2013 ET60 - 50 inch model from Amazon about one week ago. I previously owned a Panasonic 2012 ET5 model and a 2012 Samsung S6 6150 HDTV. I use the Digital Audio output to a Sony A/V receiver.THE GOODThe mechanical construction of the 2013 ET60 is very good. The bezel and stand are now a silver color which looks richer and matches my decor better (its very hard to find any Audio Video component that is not black - which looks like office furniture!). The stand is very solid construction, but does not swivel. The cable connections are parallel to the back panel, which allows the panel to be pushed up closer to the wall when using the stand (my previous Samsung had cable connections perpendicular to the panel, so it needed to stay at least 6 inches away from the wall, and you could see the ugly back cables when you passed by it).3D support - its awesome. The picture quality seems to have improved from last year, especially the 2D to 3D conversion (you can watch regular TV channels and convert them to a simulated 3D). Since there is little 3D content available, and very expensive, I will likely use the 2D to 3D conversion feature mostly. The screen also contains IPS technology, providing a good wide viewing angle. I have a bright room, and the picture looks good with little glare and no adjustment out of the box.The new Homescreen changes from last year's model improves the User interface greatly. You can customize the homescreen to add which Apps and browser shortcuts appear. The set will remember which homescreen you last used when it powers up again. You can turn this feature off if you wish, (as well as the annoying advertising banner).Internet streaming to TV is good, no stutter at all. The previous 2012 Samsung model I owned would need to buffer You-tube videos every 20 seconds, making it impossible to watch. I have wired Ethernet to both old and new TV.Swipe and Share feature. From my iPad, I can easily send stored pictures or video to the TV screen, with the Panasonic VieraRemote2 app. You need to use the browser function within the VieraRemote2 app which is limited to what the TV browser can support.The Panny ET60 supports wired keyboard and mouse only (NOT Bluetooth as indicated in the Amazon product info). I was able to use a Logitech M505 wireless mouse (non-bluetooth) that comes with a small USB dongle, which I plugged into the TV backpanel - it works great. The iPad Remote2 app contains a keyboard function, so I don't need any dedicated keyboard.THE BADYou want to watch foreign news or other non You-Tube video from the internet ? Many video streams still required Flash Player or Silver light - both are NOT supported. It kinda renders the browser app useless for me, since for most general browsing, I will use my iPad. Most TVs don't support Flash Player.The Amazon Instant Video App is over two years old, with no further updates available! No 5.1 sound, no Watchlist, awful old User Interface. I owned a 2012 Samsung TV and the same App was better, newer, had the watchlist etc. The new Panasonic remote now has a red Netflix button on it. We can only draw the conclusion that there is no further support for the Amazon Instant Video app on Panasonic TVs (since March 2011). This is looking like a possible deal breaker for me...There is no way to turn off the internal TV speakers if you use the Digital Optical Output only (without Viera Link hdmi) to your A/V Receiver ! I verified this with Panasonic tech support. You need to turn your speaker volume to zero (the mute function shows an ugly icon).The Media Player (files on USB stick) does not support 5.1 surround sound, only stereo (confirmed with Panasonic). The .avi type media files are not supported, only mp4 /mkv.THE UGLYYou will likely be comparing this model with the Samsung UN50F6400 model, which has about the same price point at the time of this writing. The Samsung has the black color with spider leg base, and supports Bluetooth keyboard/mouse and dual core processor. The Samsung has Active 3D (battery powered glasses). The Samsung's Amazon Instant Video app is much better, and there are more apps available in general with Samsung (even if you only really use 4 or 5 of them in the end ;-). I disliked the Samsung 2012 Series 6 remote, as the buttons were too small and placed in an awkward position - the Panasonic remote is better. Its a difficult choice in the end, it really depends on what features you use most, but so far I am happy with the Panasonic 2013 ET60 model for its mechanical and picture quality strengths - less the dated Amazon Instant Video app and lack of 5.1 sound on Media files.", "Date": "April 28, 2013"}, {"Title": "TV is great...", "Author": "KJMonte \"KJ\"", "ReviewID": "RGRL8A27JV0GV", "Overall": "5.0", "Content": "This TV has a great picture, sound, and Smart TV functions. There is one big takeaway that you will need to know, if you don't want Tyson Chicken to sponsor your volume! After about a month, ads started popping up on my TV. You must manually turn this off. I previously rated this TV down because of this, but since you can remove the advertisement function (Thanks Ray Y.)...I increased the rating to 5 stars. Make sure you do the following: Menu > Setup > Display Customization > Smart Viera Banner > Off", "Date": "November 11, 2013"}, {"Title": "An under valued performer!", "Author": "Sammy Jordan Jr.", "ReviewID": "R10471OG9Q3EMJ", "Overall": "5.0", "Content": "Best picture quality for under 1000 dollars by far!  Much better build quality than Samsung or LG. Sony was twice the price and had less features.  Built in wireless is solid. Netflix streaming in HD: Awesome!  We use the ET60 for Xbox and Movies.  Plays Halo 4 and Call of Duty with no noticeable lag in game mode. We are happy with this TV.", "Date": "December 1, 2013"}, {"Title": "Nice TV for Movies & Gaming; Quality Image w/ 3D Compatibility; \"Smart\" Wireless Technology but no bluetooth", "Author": "JMM", "ReviewID": "R503ZLBDU30V0", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3RDLAA6IC0EXJembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3RDLAA6IC0EXJrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo3RDLAA6IC0EXJchiDiv\").innerHTML = document.getElementById(\"cv_mo3RDLAA6IC0EXJhiddenPre\").innerHTML;\n};\ncv_mo3RDLAA6IC0EXJrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3RDLAA6IC0EXJso;\t   \n\n\nfunction cv_mo3RDLAA6IC0EXJloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3RDLAA6IC0EXJso = new SWFObject(swfLocation, \"cv_mo3RDLAA6IC0EXJAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3RDLAA6IC0EXJso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3RDLAA6IC0EXJso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3RDLAA6IC0EXJso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3RDLAA6IC0EXJso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3RDLAA6IC0EXJso.setAttribute(\"height\", swfHeight);\n          cv_mo3RDLAA6IC0EXJso.setAttribute(\"width\", swfWidth);\n          cv_mo3RDLAA6IC0EXJso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3RDLAA6IC0EXJso.write(\"cv_mo3RDLAA6IC0EXJflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3RDLAA6IC0EXJ', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3RDLAA6IC0EXJ';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3RDLAA6IC0EXJ', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3RDLAA6IC0EXJloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3RDLAA6IC0EXJ\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1QM7XZ6SIWSF0\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1QM7XZ6SIWSF0\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R503ZLBDU30V0\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1QM7XZ6SIWSF0/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3RDLAA6IC0EXJduration')) {\n      document.getElementById('cv_mo3RDLAA6IC0EXJduration').style.display='none';\n    }\n    cv_mo3RDLAA6IC0EXJloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3RDLAA6IC0EXJloadSwf(movieID, playerVersion) {\n   return _cv_mo3RDLAA6IC0EXJloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3RDLAA6IC0EXJnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3RDLAA6IC0EXJ', 0, h);\n}\n\nfunction cv_mo3RDLAA6IC0EXJresetPlayer(w,h,bw,cc) {\n  cv_mo3RDLAA6IC0EXJnewHeight(h);\n\n  cv_mo3RDLAA6IC0EXJso.addVariable(\"resetBandwidth\", bw);\n  cv_mo3RDLAA6IC0EXJso.addVariable(\"cacheCode\", cc);\n  cv_mo3RDLAA6IC0EXJso.setAttribute(\"height\", h);\n  cv_mo3RDLAA6IC0EXJso.setAttribute(\"width\", w);\n  cv_mo3RDLAA6IC0EXJso.write(\"cv_mo3RDLAA6IC0EXJflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3RDLAA6IC0EXJRollOverImg = new Image();\ncv_mo3RDLAA6IC0EXJRollOverImg.src = \"http://ecx.images-amazon.com/images/I/91PtpZOR9IS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3RDLAA6IC0EXJpreplay = document.getElementById('cv_mo3RDLAA6IC0EXJpreplayImageId');\nif (cv_mo3RDLAA6IC0EXJpreplay) {\n  cv_mo3RDLAA6IC0EXJpreplay.onmouseover = function() {\n    cv_mo3RDLAA6IC0EXJpreplay.src = \"http://ecx.images-amazon.com/images/I/91PtpZOR9IS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3RDLAA6IC0EXJpreplay.onmouseout = function() {\n    cv_mo3RDLAA6IC0EXJpreplay.src = \"http://ecx.images-amazon.com/images/I/91PtpZOR9IS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3RDLAA6IC0EXJpreplay.parentNode;\n\n  var cv_mo3RDLAA6IC0EXJcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3RDLAA6IC0EXJcurrentClick) {\n      return cv_mo3RDLAA6IC0EXJcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:52 MinsChoosing a TV can be a difficult process because there are many options available.  There are a number of key questions you have to ask:  What room will the TV be viewed in?  What type of content are you going to be watching?  Do you want 3D capability and/or internet connectivity?  Below are some of the pros and cons of this TV to help you decide if this television is right for you.A little about why I chose this TV --  I was looking for a new unit for my bedroom, one that was large enough for an immersive movie-watching experience.  I have owned many Panasonic TVs and they have always been very reliable, so my preference was to stick with that brand.  I wanted an LED model, one that was both 3D capable and also could access my Netflix account.  I decided on this model, and overall I'm very happy with my decisions.  The product is impressive in many ways, particularly in its image quality and easy on-screen navigation.  The only area I feel it is lacking is in both speaker quality and audio connection options...POSITIVES:- This TV is incredibly slim.  It comes with a sturdy base plate that is easy to assemble.  The overall build quality of the TV is great, and the frame is very small which is a nice aesthetic change from the thicker frames of just several years ago.- You can greatly customize every aspect of the TV, from the image and sound specifications, to parental controls, to changing your home screen layout.- Picture quality is awesome - it's full HD 1080p, and the 120Hz refresh rate is also very important if you do a lot of gaming or watch sports.  I'm sitting around 6-8 ft. from the screen and the 50\" display is just right... if you're sitting any further than that you might want to look into the 55\" model or larger.- The 3D quality is very high - it uses Passive 3D technology, which utilizes polarized glasses that create the stereoscopic 3D effect.  In my opinion, if you are new to 3D then passive (rather than active) 3D technology is the way to go - there is less eye strain, and the glasses are comfortable (especially if you already wear regular glasses).  Two pairs of glasses are included, and they're also relatively inexpensive if you need to pick up some extra pairs.- 3 HDMI input ports are included... that means the cable box, blu-ray player, and video game console can all be hooked up at once and ready to go.- A lot of discussion has taken place about the merits of LED vs. Plasma televisions.  It's worth researching and looking at both, but I prefer LEDs because they perform better in bright settings (such as a family room w/ large windows) and they also use less energy.- This is a \"Smart TV\" - that means it can connect to the internet via your Wireless router and you can get a variety of Apps.  For movie lovers, you can stream Netflix and Hulu.  If you're going to use an internet-connected device (such as a Roku box), then there's really no need to also have a Smart TV.  But it certainly doesn't hurt either, and you can always choose not to connect the TV to the internet if you prefer not to.- The remote control is very nice and it's not too cluttered.  It's quite similar the the Panasonic remotes of the last few years.  For those who watch a lot of Netflix, the remote includes a Netflix shortcut button.NEGATIVES:- The built-in speakers are okay, but not great.  They will do fine for watching the news, but if you are into movies/gaming then I'd definitely recommend using some type of sound system/sound bar.- No headphone jack.  I'd imagine this will be a big inconvenience to some, and I don't see why companies aren't including it on their TVs anymore.  There's no standard A/V output either, so the red-white audio to 3.5mm conversion cable won't work either.- Digital Coaxial Audio (this port is typically identified by the color orange) is NOT included.  This will only affect certain people with older audio equipment - most newer home theater units, receivers, and sound bars accept the Digital Optical input (which is compatible with this TV).- Despite being mentioned in the Amazon product details, this TV does NOT have Bluetooth.  I tried to connect a bluetooth device and it did not work; then I went looking into the TV settings and the manual and discovered that bluetooth is indeed not supported.- Its annoying that Panasonic chose to run banner ads on the TV by default.  This can be turned off by selecting \"Menu\" on remote, then choosing Setup >> Display Customization >> Smart Viera Banner >> Off.", "Date": "November 5, 2013"}, {"Title": "Great TV but reflective screen", "Author": "Viperboss7", "ReviewID": "R3NFK7VAV4Z4DQ", "Overall": "4.0", "Content": "I bought this TV without being able to see it in the stores as nobody carried this 50\" model. I needed a TV for a family room/kitchen. It needs to be seen from multiple angles and not be too reflective from windows. I took back a top of the line Samsung because of reflections. This is an IPS LED tv which has an advantage of not bleeding colors when viewed from the side. The problem is, it does have a lot of reflections. Our kitchen lights showed up clearly on the screen. I am replacing a five year old Sharp TV that had a matte screen and worked well in that room. I am having a hard time finding a good tv that is not reflective. It seems to achieve the best picture, a more reflective screen is needed, so I think I have to downgrade the model to get less reflections, otherwise a Plasma tv would be best. The lower end Sharp and Samsung are less reflective so I guess I'm headed that direction. The TV itself is beautiful and easy to set. The colors are great and are very even when viewed from the side.", "Date": "July 29, 2013"}, {"Title": "Outstanding in every way but one.", "Author": "Number Six", "ReviewID": "R2VLRBWBLYY0QX", "Overall": "3.0", "Content": "The Good: The feature set is huge.  There are a number of web apps, in my case available wirelessly.  I've only tried tried the Amazon video app and was reasonably pleased with the functionality.The fake 3-D is much better than I'd expected it to be.  A computer chip in the TV makes guesses as to how far back items in the display are then generates a 3-D rendition of the scene.  It occasionally gets depths wrong but I'm astonished at how often it does a good/great job.  In particular the TV usually does a good job of giving faces a realistic 3-D appearance. 3-D and fake 3-D weren't even remote drivers in my purchase decision - but now I'm sold.The Bad: Blacks are dark gray.  Maybe I've been spoiled by my plasma.  In a brightly lit room that's almost irrelevant.  For use in a light controlled room, there are better choices if inky blacks are a priority for you.", "Date": "December 8, 2013"}, {"Title": "Ridiculously great TV for the price.", "Author": "AV", "ReviewID": "R1ZRB3JDVENP19", "Overall": "5.0", "Content": "I was a little concerned about shipping via FedEx, but the TV's box arrived safely, box packed in an even bigger shipping box full of cardboard packing peanuts and styrofoam.The only negative I can find with this TV is the sub-par sound quality--I knew this before purchasing and I have a sound system, so I'm not going to deduct a star. Picture quality is great, blacks are really good [for an IPS panel; also, MUCH better than my four year old Samsung LN32C550 LCD], panel is uniform, viewing angles are fantastic, metal bezel is gorgeous. Netflix and Amazon Instant VIdeo work great over wi-fi. 3D remains gimmicky in general, but still manages to impress.", "Date": "March 7, 2014"}, {"Title": "More than I expected", "Author": "Bill F.", "ReviewID": "R1GGB1YEWY46LP", "Overall": "5.0", "Content": "I bought this TV to watch cable and DVDs – but discovered that it is so much more. There are so many apps that I can download including games and news feeds. I have the TV linked to my Netflix, Amazon Prime, and HULU accounts so I can stream vided straight to the TV. Entering text using the TV remote control was a pain. So I purchased the Logitech Wireless Keyboard/mouse and plugged the USB dongle into the side of the TV. Now I just sit back in my recliner and use the keyboard/TV to surf the web – no wires and no fuss – life is good. I am still discovering ways to use the TV that I had never dreamed of. Next I will see if I can use a USB wireless head set for quiet viewing. Best of all it was so easy to setup and very easy to add apps.", "Date": "November 21, 2013"}, {"Title": "Nice", "Author": "Dude", "ReviewID": "R12BWU8JHYUGTT", "Overall": "4.0", "Content": "Things have changed since I bought my last t.v. .  The LED (LCD) units are smaller, so you can get a bigger screen with it only taking up the same amount of space due to the smaller outer edges with no front facing speakers. This t.v., as with others I have looked at have very few hookups other than HDMI and USB. They only seem to have one component connection which is shared with an  RCA connection, so if you have any old equipment, you can't hook it up.  There are no S-video connecions, or fiber optic connections. Once again, this seems to be the case with all new \"flat\" t.v.'s, including this one.  Incidentally, my component connection doesn't seem to work on the red color, and my older DVD recorder transmits in a greenish yellow color to the t.v. .The t.v. otherwise has a great picture and puts out very little heat.  The only reason I didn't give it five stars was because of the lack of connections and the component color issue (which may not be related to the t.v., I am still investigating).Amazon shipped this to me in a HUGE box, which really pissed off the UPS driver.  The driver said he had never had that big of a box on his truck and it should have been shipped through a different service.", "Date": "February 24, 2014"}, {"Title": "Great TV", "Author": "Christopher N Dansby", "ReviewID": "R1SAHAML14AKH7", "Overall": "5.0", "Content": "My first large amazon purchase. Was very hesitant to purchase large item form amazon, I am no longer hesitant to do so. Researched over 2 years looking at prices and deals on all of the other TV products around.  I have owned this TV for over 3 months, it is a fantastic buy. Motion sports, Movies you name it no blur. Excellent off axis color due to the IPS panel technology, this is the same type technology that apple uses for there computer and notebook displays . I would buy this TV over and over again. TV looks a bit smaller then I expected, its slim bezel is perfect blends in with the surrounding decor well yet stands out as not just another black box. When ever we entertain people always ask even when the TV is off, What kind of TV is that.  This TV also replaced my previous favorite television a Sony Bravia XBR-4 as far a look and design.", "Date": "February 18, 2014"}, {"Title": "Awesome picture, awesome TV", "Author": "Don", "ReviewID": "R2VVMWUSFE3D57", "Overall": "5.0", "Content": "This TV really is better than the price would suggest.  Stylish, sturdy stand, super slim bezel and lightweight,  The picture quality is superb and watching sports in HD is a real pleasure.  Blu-ray viewing is incredible.  You will probably have to adjust the out-of-box picture settings to your liking as with most HDTVs.  Only downside to this TV is the glossiness/reflection, and I'm not surprised because reviews say this model is reflective.  During black scenes, the screen will reflect any light that is hitting it.  I watch lots of sports (which have no black scenes), so this is not an issue for me.  I can't wait to watch the World Cup games this summer.  Of course, viewing movies in the dark can eliminate this problem entirely.  If you plan to watch dark scenes in the daytime or with lots of lights on, a matte screen would be a better choice, unless the reflections don't bother you.  Haven't played games on this TV yet, but the reviews I read said this TV is excellent for gaming.  I'm hooking up the PS3 soon.Since 3D content is so limited, I have not gotten the opportunity to experience 3D on this TV.  It comes with two pairs of 3D glasses, so we can always try it if better 3D DVDs are released.  You can convert any 2D content into 3D by pressing the 3D button on the remote, although the effect is not that exciting...it just appears more vibrant but nothing jumps in front of your face.  Actual 3D content may be different.The smart interface is very simple and intuitive, and provides lots of apps/features for additional entertainment and convenience.  Streaming Netflix is fast (there is also a Netflix button on the remote for immediate access).  Web browsing is slower then on a computer, but no problem because it's a TV!  The 3 HDMI ports are adequate for me.  The 2 USB ports are useful if you have movies saved on flash drives.  You can install install the Panasonic remote app on your smartphone and use it as an extra remote, and yes it offers all the controls that the actual remote has.I researched TVs for a while before deciding to buy this one.  No regrets here.  Looks really modern and elegant and provides the picture quality you are looking for (unless the dark scene reflection is a deal breaker).  The added bonus of the smart features and 3D is really nice.  With the low price offered by Amazon, the extra 5-year warranty for $100 is a good choice also.", "Date": "February 3, 2014"}, {"Title": "LOVE IT!!!", "Author": "Micah Ackerman", "ReviewID": "R1UBPD7L3KVRA", "Overall": "5.0", "Content": "Great picture/quality.  The streaming videos wirelessly from my computer is of poor quality, but the quality is fine when I connect via HDMI.", "Date": "January 9, 2014"}, {"Title": "Just love this Panasonic LED TV!", "Author": "DustinD", "ReviewID": "R2LMFRFL3P9KHQ", "Overall": "5.0", "Content": "This TV has impressed me thoroughly, the sound, not so much but as with other reviewers I was aware of that fact and never made that a bullet point on my 'must haves' checklist during my hunt for my next flat panel.The semi-matte screen allows the picture to have a little more depth than a plain matte, it does reflect some light but it's an acceptable trade-off. The black levels are good, not sure if i'd say inky but deep enough to satisfy all but the most discerning videophile. No dead and/or stuck pixels out of box which is always a good omen, as electro-omens go...... :)Colors and image detail are fantastic and the ability to dial-back the refresh rate (Strong, Mid, Weak or Off) allows the viewer to choose the fluidity of movement on-screen. Sometimes I want the 'Soap Opera Effect' (with sports and certain talk shows) however, most times it's not desirable (feature film or tv drama). It's a personal preference and it's nice to have control over it.In April/May 2013 this model was $1400, it's definitely worth that price but like all electronics (other than Apple) if you wait 6 months you can save significant cash if you hold off. I waited 10 months into the product cycle to start shopping, it's hard to justify $1400 when you can pay around $800-$900 if you play the waiting game. I would recommend tracking a potential tv purchase on camelcamelcamel dot com.", "Date": "March 17, 2014"}, {"Title": "Like the product - hate the after sales service", "Author": "Peach O'Gorman \"Peach\"", "ReviewID": "R1RD4FYOQURLVP", "Overall": "4.0", "Content": "After receiving the TV, I needed to contact Panasonic for two different issues.  To date (10 days later) I still have not resolved either issue.  Sales sends me to Tech Support.  Tech Support sends me to Sales.  Sales sends me to the Warranty Department...and so on.  The technical issue was that the optical cable would not stay in the TV socket.  Apparently, there is a \"door\" missing.  The other issue is with their website on which I registered the product, but even after sending me an email to acknowledge it, when trying to enter my account, it would not recognize the email as being valid.  Am frustrated and not at all pleased.", "Date": "January 29, 2014"}, {"Title": "A super value", "Author": "Bill Gibson", "ReviewID": "R10YCMHCEOU6TN", "Overall": "5.0", "Content": "My tech-savvy son recommended this specific Panasonic model. The TV came out of the box and changed my low opinon of Time Warner Cable -- I now get true HD on all channels without a cable box. Setup took only 20 minutes...the free tech support folks had to help me connect to my Netflix account. Panasonic thought of everything -- easy controls, excellent audio, super video and surprisingly good 3D. So easy to operate my wife can navigate with ease...and  in the holiday rush, Amazon arranged for UPS to deliver it a day ahead of schedule!", "Date": "January 16, 2014"}, {"Title": "Awesome TV", "Author": "Craig Peddie", "ReviewID": "R2E8RJGB5J5BXK", "Overall": "5.0", "Content": "We are very pleased with our Panasonic TC-L50ET60 LED TV.  We have it mounted in our master bedroom.  The picture quality is amazing and we purchased it at an awesome price on Amazon.  We haven't explored the Smart features much yet.  I think Panasonic lags a bit in this area, but hopefully they will upgrade their software.", "Date": "January 11, 2014"}, {"Title": "Great buy!", "Author": "Caliboi187", "ReviewID": "R1844KSSOW8SK5", "Overall": "5.0", "Content": "I bought this 50\" tv on sale for 750.00 as an extra tv for the house but liked it so much that I made it my main tv. The great apps available are awesome plus being able to customize the tv to display the apps you want is cool. The iPhone app rocks, you can send videos directly from your phone to the tv wirelessly and the upscale looks clean. You can start a you tube or netflix video on your phone and finish it on the tv seamlessly. While a YouTube video plays you can queue up more videos from your phone simultaneously. Panasonic is also the only tv manufacturer that allows adult after hours apps that  me and my wife enjoy. The design of the tv is also very nice with a thin nickel bezel. The iPhone connectivity was so good that prefer it over my Apple TV, the only  thing it doesn't do is phone mirroring but does transfer videos, pictures and music. The 3D features were nice too since I prefer the polarized instead of shutter 3D. I definitely recommend this tv, it replaced my 2011 lg smart 3D tv.", "Date": "December 8, 2013"}, {"Title": "The TV is excellent -- its accessories and interface menu not so much", "Author": "RGBCMYKER \"rgbcmyker\"", "ReviewID": "R1EZRTWG68QKHA", "Overall": "4.0", "Content": "This is a fantastic TV overall, the silver bezel looks nice and modern -- it is nothing that screams at you due to the small surface space of the bezel but the simple touch is something that my guests find worth mentioning.The only drawback I can think of for this TV is that the remote and the user interface do not complement the hardware of the TV itself. The remote looks dated and removed from the core product. Almost as if I had bought a generic universal remote from Radio Shack. The user interface needs a lot of help though it is responsive and for the most part easy to use -- not a pleasure to use.", "Date": "December 5, 2013"}, {"Title": "Excellent tv for price", "Author": "AGerace", "ReviewID": "R2CNF6GSORN9SA", "Overall": "5.0", "Content": "Picture quality is excellent for a tv in this price range. Not many tvs this size at this price. The biggest drawback to me is that the screen is plastic. You can tell just by looking at it when it's off. It looks cheap, not like a glass screen would look, but again, at this price...Once turned on though, tv looks great. One other issue is that when turning the tv on, it's difficult to tell whether its on or not. It doesn't make a sound. Only a small red led in the bottom left hand corner. Not that big a deal.", "Date": "May 29, 2013"}, {"Title": "Awesome picture... love it!", "Author": "phiren", "ReviewID": "R16CXV6438JFES", "Overall": "4.0", "Content": "I purchased a Samsung TV of similar price and found myself struggling for two weeks to configure the picture quality to my liking.  At some point, I felt that I would just have to settle.  But then that TV started shutting off on its own so I returned it and bought this Panasonic TV instead.  I am a typical home user and here are my thoughts after using the TV for about two weeks.Pros:- The bezel is super thin.  And because it is silver, it blends pretty well with the wall color so I feel like the bezel is not even there!  It gives me some bragging rights since most of my friends and family do not have a TV with such a nice looking bezel.- The picture quality right out of the box is breathtaking.  Way better than the similarly priced Samsung TV that I used for a few weeks.  I have not noticed any blur and picture fuzziness so far.  The colors are nice and smooth with no noticeable pixel'ation.- I don't have Netflix but I do use Amazon Prime.  The app loads quickly and the Wifi is pretty fast! Picture quality on Amazon Prime is really good.  My Wifi gives me about 6 mbps download speed.Cons:- I can't watch AVI format movies from my network drive.  I was able to do this with the Samsung TV which I returned, and was hoping that this Panasonic TV could do the same.  It looks like it can only play MP4 movies over the network drive.- Amazon Prime app does not have closed caption.  I have not used Netflix on this TV because I don't have the membership.", "Date": "February 18, 2014"}, {"Title": "GREAT PICTURE, sound so so...", "Author": "Abdullah Nurhasan", "ReviewID": "R30GOGBF06YKV9", "Overall": "4.0", "Content": "Picture quality : Excellent...! color and brightness are fully adjustable. so crisp and sharp. customize to your own liking, avoid vivid setting. 3D is breathtaking. the glasses are comfyAngle of View : Great...!Screen Reflection : exist, but not annoying. when justing watching TV i never care about reflective light. when go to serious watching movies i tried to dim several lamp. i think that works for all TV.Sound : Not Good. again, i don't really care with the sound when it come to watching news or something like that. i have got my self a Yamaha AV receiver which is really good and i use it for watching movies. never expect a good sound from a very thin TV.Smart function works well. i never really expect much. unfortunately i can't find 3D HDTV that is not smart.", "Date": "November 27, 2013"}, {"Title": "wow factor tv under $1000", "Author": "sylvia", "ReviewID": "R3CBVSU88030O5", "Overall": "5.0", "Content": "This tv is all metal build except for a light plastic frame underneath the lower screen frame.  The color is great and the picture quality is good for the price. I wouldn't call it spectacular though. Am totally satisfied with it.The shipping was something else. No padding except for the plastic box holding the tv. The box was torn and a scratch on the TV.thankfully it was the back and being that this tv is all metal.  Was tempted not to sign for it, but I was tired of the wait for the delivery. ..so delivery experience I would have given it half a star", "Date": "May 16, 2014"}, {"Title": "The best TV I ever owned.", "Author": "Michael Schroeder", "ReviewID": "R1KX088NCJARTE", "Overall": "5.0", "Content": "I did a little research and looked at the on display at Costco.  They didn't have this model, so I mostly purchased this TV based on reviews and price point.  Set up was easy, and the picture had a \"Wow\" impact and still does three months later.  It wasn't my favorite movie, but I watched the Oz movie in 3D and the effect was also stunning (especially during the opening credits).  We have a 51\" Samsung plasma in the man cave downstairs that rarely gets used now.  Great off-center viewing and does great in a very bright room.  The sound is just 'OK' but works in the space we placed it.  The ads that popped up were an od marketing choice (IMHO) but thanks to the reviews here I was able to turn those off.Bottom line: Very happy with this TV.", "Date": "May 11, 2014"}, {"Title": "One of the very best!", "Author": "carltonslc", "ReviewID": "R3ALWLEIB6TZ45", "Overall": "5.0", "Content": "Almost everyone told me to buy a Samsung because thay believe Samsung is the best, so I did a little home work  before buying this set vs the Samsung TV (and a few others) this model competes with. The ET60 from Panasonic just happens to be an editors choice from PcMag.com. It received and excellent rating. The VIZIO M551d-A2R also received the editors choice rating but the PanasonicET60 surpasses it with with deeper black levels and a contrast ratio of more than 13,000:1 (by comparison the VISIO is more than 11,000:1) The Panasonic edged out the VIZIO with panel performance. The Samsung UN50F6400 performance was not that great in the comparison(it`s contrast was a little more that 7000:1  The Sony or LG models were even lower.This Panasonic set has excellent image quality. I would definitely put it up there with the entery-level plasmas of LG and Samsung. It offers an extremely wide viewing angle with its IPS panel.  Blu-Rays on this TV is truly outstanding with crisp detail and very deep black levels.The Smart Apps and Wi-Fi is relatively easy to use and is fast, but a little cluttered. Samsung offers slightly better performance in that department.  I would highly recommend this set to anyone looking for a very good all around performer. The only real down side is the sound quality. The TV is very thin ( at 1.4inches) there is no boom or depth at all. You must get a sound bar.The ET60 from Panasonic competes with the Sony KDL-55W802, Samsung UN50F6400 and the LG 50LA6200and VIZIO M551d-A2R. Consumer Reports rated Panasonic as the most reliable TV set, edging out the other brands I have listed here.", "Date": "April 25, 2014"}, {"Title": "Blown away in Panasonic  3-D!", "Author": "Craig Allen", "ReviewID": "RBSGXW3YPH45N", "Overall": "5.0", "Content": "I'm blown away by the picture quality in both 2-D and 3-D settings.  Its arrival was prompt.  The product was well packed....and the price was excellent!  I'm very pleased!  Panasonic is the bomb!", "Date": "April 12, 2014"}, {"Title": "Best TV I have ever had", "Author": "Jason", "ReviewID": "R2Q6Q870W1HVB", "Overall": "5.0", "Content": "I bought this TV after moving into a newly built house and installed it above the fireplace.  My living room is approx 19' x 24' and this 50\" is just the right size.  The bezel is very thin and silver so the TV appears less obtrusive than standard all black chunky sets many people have.The picture is amazing, I notice how clear and vivid it is even months after installing.I would highly recommend this TV.", "Date": "April 5, 2014"}, {"Title": "I love it.", "Author": "Michael A Akinyosoye", "ReviewID": "RGL6D34LNPJ7M", "Overall": "5.0", "Content": "I love everything about the TV most especially if you have any Panasonic Hifi or any sound system that can link with the TV.", "Date": "April 3, 2014"}, {"Title": "Great TV but was delivered with a built-in defect!!", "Author": "Michael S. Dillon \"Mick The Mech\"", "ReviewID": "R31PGJN19SGMJ5", "Overall": "4.0", "Content": "This TV was delivered by UPS and was packed in a carton so large the UPS driver said he was not supposed to deliver a package so large on his regular route truck. He said it should be a freight delivery but the terminal loaded it on his truck. I helped him carry it to the house and my wife and I began unpacking. The TV was in it's factory carton deep within the huge shipping carton and we finally dug down to it and pulled it out. There was a huge trash bag full of a very unusual type of protection all around the TV. This has nothing to do with the built in defect but just to comment to our experience.  We installed the TV on the wall mount and were very pleased with the picture quality and clarity. I began trying to establish the internet connection via my wireless Belkin(N300) router. Had no luck so I purchased a larger, more powerful Belkin(N750) wireless router. Still no success. By this time I was getting very frustrated so I called on my son-in-law who is a very good computer geek. He worked on the connection for several hours and finally gave up and went home to do some more research. He sent me an e-mail the next day and discovered that other owners of the Panasonic Viera TV's were having the same problem and there were some possible solutions. My wife and I were leaving on a two week vacation the next day so I didn't have time to work with it any more till we got back home. When we returned home the first time I turned the TV on a message appeared, \"there is a software update available for this TV, Would you like to install it now?\" I entered YES and after a few minutes another message appeared,\" software installation complete, re-start jour TV for it to take effect\". Presto!! internet connection available. I got my Amazon Prime code from my computer, entered it as described and it all works as it should. Evidently Panasonic discovered their problem and developed a fix, thank goodness!!! I could now give the TV 5 stars but I feel this problem should have been discovered and corrected before it left the factory.", "Date": "March 23, 2014"}, {"Title": "As Good as I expected it to be", "Author": "Barbara Isler", "ReviewID": "R2G2L2B80338OW", "Overall": "5.0", "Content": "I gave it 5 stars because It matches all the other good reviews.  Yes it needs improvements... but we knew ahead of time that the sound would not be theater quality without a sound box. That was clear in the reviews too.  In the near futureI hope Panasonic will get in tune with Charter or Direct TV controllers to avoid the need for 2 controllers...namely that the TV comes on with a ring of large Icons for loading other things on the TV.  So you need the Panasonic controller to click once more and get all TV on the screen.  Then it is a breeze. (I knew of this liability too...but was pleased to have a good TV ...that can work on a variety of systems.)", "Date": "March 18, 2014"}, {"Title": "Very Good Picture", "Author": "Dan Ryson", "ReviewID": "R1KLY74DROOHKA", "Overall": "4.0", "Content": "I would have given a fifth star if not for the reflective screen.  With no light immediately behind the viewer, the picture quality is superb.If I was using the built in speakers (which I'm not) I would have been disappointed by the mediocre audio quality - but that's to be expected with such a thin device.", "Date": "March 17, 2014"}, {"Title": "Great", "Author": "Sandy C.", "ReviewID": "R2LKEJDEXSWD36", "Overall": "5.0", "Content": "Excellent productI am very happy with this TV. The interaction with the smart phones and tablet is so easy and the 3D is great.", "Date": "March 1, 2014"}, {"Title": "Great value for the price", "Author": "Alex Kananyhin", "ReviewID": "R1C6I58DVSY7U2", "Overall": "4.0", "Content": "but there's no audio-out connection other than optical, so there's no way to connect a headset.ads are built into the system menu..the Amazon description lists Bluetooth; alas, it's absent, see  [...]", "Date": "February 5, 2014"}, {"Title": "Great! Except the sound.", "Author": "Bacon", "ReviewID": "R74K794IJ5HKE", "Overall": "4.0", "Content": "This is likely the best built TV I have owned. Its made of a lot of metal instead of plastic. In this day and age, thats rare. The whole back of the TV is made of metal and is very supportive. The bezel is also made of metal. The base of the TV is metal except for the silver plastic covering over it. How is the picture? Fabulous. One of the best LED TVs I have seen. How is the 3D? No idea. I probably will never use that feature. How is the sound? This is the main problem. Minus 1 star. The sound is absolutely awful. It sounds like your in a bathroom. I didn't mind this so much since I have speakers to hook up, but if you are planning on using this for movies without your own speaker set, It will be bad. Its only good for maybe news of soap operas. Overall, I am very very happy with this buy. The silver is nice since having black TVs all the time is boring. Its also extremely thin and would attach flat to the wall like a giant picture frame.", "Date": "January 23, 2014"}, {"Title": "Nice TV", "Author": "Tom", "ReviewID": "R1ZRT7DRDPOI8B", "Overall": "5.0", "Content": "Excellent picture quality, small border around edges. Very light and easy to move around. Price was good at the time also.", "Date": "January 4, 2014"}, {"Title": "Great TV so far", "Author": "Rusty Shackleford \"Dale\"", "ReviewID": "RT1XMNPJML0UX", "Overall": "4.0", "Content": "Pros: Slim; picture is pretty good; not bad price for an LED smart TVCons: speakers are horrible; picture is good, but not as good as my 5 yr old LG LED", "Date": "November 28, 2013"}, {"Title": "Stunning Picture Quality!! W.O.W!!", "Author": "Doug-E-FresH", "ReviewID": "R2YYHRV0J1CET", "Overall": "5.0", "Content": "Absolutely Stunning Picture!!! I cannot believe that they are selling this set at this price.  I am telling you this panel rivals the W900A from Sony. One big difference though, This Viera is under 900.00. The Sony is more than double the price. If your in the market for a HDTV, stop looking/researching. this is the set to buy.", "Date": "November 19, 2013"}, {"Title": "Make sure you like it before you try it.", "Author": "Lisa Ogden", "ReviewID": "R2Q4EPKF7U5HIN", "Overall": "3.0", "Content": "A word of caution, if you decide to return the TV because you are not satisfied with it you are responsible for the return shipping cost. There was miscommunication on the cost of the return shipping but Amazon made it right for us which we appreciate.The reason I returned this TV were some picture quality issues and features. In my opinion the 2D to 3D conversion made little to no difference except the tint of the 3D glasses you're wearing. I noticed more motion blur than I expected from this level of TV. The picture quality changed more than I cared for between different channels and movies.On certain broadcasts the picture was excellent but the consistency just wasn't there for me. My older plasma TV is still more of my liking. The obvious downside to ordering online is not being able to try it before you buy it and the return policy. If you know what you want then there's definitely savings with Amazon.", "Date": "May 25, 2013"}, {"Title": "So far so good.", "Author": "O. Ogunsile \"touskin\"", "ReviewID": "R3UMDCVTVF1ICN", "Overall": "5.0", "Content": "I bought a Panasonic on Amazon October 2012...47inches. Fast forward to 14months and the TV panel gave out with lines on the screen. Came back to Amazon and i read reviews about this issue. Called Panasonic and of course, the TV had only 12 months warranty...so they offered me 65% of the purchase price if i buy another Panasonic TV of equal or more value. That was the only way to get something back, so i went with this model because it was the cheapest for 899.00 and now 841. It is also considered more valuable at this price because it sells for more than $1000 elsewhere.Thus far, it has been spectacular compared to the 47inches. Picture is often and 3D on Netflix is fantastic. The remote control and build in application is easier to navigate. I am loving it thus far, and with added 5yr protection by SquareTrade...i am in good hands with this TV. I will be waiting for my refund from Panasonic in 2 - 4 weeks. This TV so far ROCKS.", "Date": "January 23, 2014"}, {"Title": "Great picture, but lacking in features...", "Author": "Jason Jarmacz", "ReviewID": "R3SV01P0IF5TO", "Overall": "3.0", "Content": "The one thing that I notice that I don't like is that if you're watching something, and you hit the home button, or any button that changes the screen whatsoever, you can't get back to that screen even by pressing the return button... Also, there's no browser history so you have to type in the address every time you go to a site, unless you bookmark it.Other than that, we like the size, and the picture is amazing, just thought that for a smart TV it would be a bit smarter...", "Date": "January 1, 2014"}, {"Title": "Extremely satisfied!", "Author": "Zeeshan Qureshi", "ReviewID": "R7EUX3GR1S7NJ", "Overall": "5.0", "Content": "I didn't think I would actually use the Smart TV functionality but DLNA/UPnP works perfectly serving content from a plex server.", "Date": "February 14, 2014"}, {"Title": "I love my new tv", "Author": "Margie Hernandez", "ReviewID": "R2LN4QDYBVPPU6", "Overall": "5.0", "Content": "This tv was just what I was looking for, I got it for a great price on amazon people and don't listen to the bad comments you're going to love this tv .", "Date": "January 29, 2014"}, {"Title": "For $700 it's not bad.", "Author": "Shebar", "ReviewID": "R1I0GY5E15UOJD", "Overall": "4.0", "Content": "Very thin and light weight. A pain to get color settings right - factory default setting is definitely not optimum.  You may not get perfect colors - but with some adjustments you can get pretty darn close. Google it - there are several different setting recommendations online. Reasonable range of viewing angles and good picture in most light conditions.  Took some experimenting with settings to get rid of tracers/ghosting on fast action shots.  Love the smart TV functionality. Wish the remote was backlit. Only 3 HDMI connections and they are positioned on the side close to the edge - so cords have to be tied back or they show when you are looking at the TV from the front.  Controls are fairly intuitive. Sound is okay - added a low cost sound bar for a little extra kick (didn't want surround speakers scattered around my livingroom).", "Date": "February 2, 2014"}, {"Title": "The silver bezel does not look good", "Author": "nah", "ReviewID": "REQ4ZW9X92B3N", "Overall": "2.0", "Content": "The product works ok, I just do not like the cheap looking silver edge around the screen. I would recommend the more common black bezel.", "Date": "March 3, 2014"}, {"Title": "Two stars for bad engineering", "Author": "mgforshort", "ReviewID": "R1VJT2XB9P48T0", "Overall": "2.0", "Content": "This TV has low power consumption, light weight, looks good, and has a terrific picture. 5 stars for looks and video.And audio? How about a half star?I knew from reading Amazon reviews that the audio is poor, but I didn't expect  that it would be extremely bad.  There is one speaker, facing towards the back, and the sound is like listening to someone in another room.No big deal, drive over to Best Buy, and get a soundbar. A Panasonic soundbar.The Viera Link, as the user guide explains, will enable the TV remote to disable the TV speakers and control the soundbar.Unfortunately, it doesn't.  After two calls to Panasonic tech support ( their tech support is very good, no complaints there) I was told that this Panasonic TV doesn't control this Panasonic soundbar.The soundbar has it's own remote, the size of a credit card, and the first time it hits the floor it would be swallowed by the dogs roaming under the table for leftovers.What I did was to disconnect the soundbar, got a Polk CsiA6 center speaker hooked up to an old Sony receiver, and now we get decent, if not terrific sound.  I'm not into home theater, all I want is to hear what the guy said about the weather.The two stars is for the Panasonic engineers who couldn't get their own product work properly with their own product.  I hope they can  read this and get their act together.Update: 6 months later we purchased a Samsung 55 inch 7100 set and this Panasonic was moved to a bedroom. Now it sits in a corner where the speaker is facing a wall, maybe 16 inches from the wall.  In this setup the sound is better.  Probably the resonance from the wall helps.  It's not great but quite acceptable without an added soundbar.To give Panasonic credit, this TV had terrific picture the moment it was turned on.  The Samsung, however, was a 2 day-long trial and error to get the picture to my liking.  I am an enthusiast photographer and we owned many computer monitors and TV sets, but the Samsung 7100 was the hardest to get right, especially the flesh tones.", "Date": "December 6, 2013"}, {"Title": "Good TV", "Author": "SPN", "ReviewID": "R1CYJPQCCCPYEK", "Overall": "2.0", "Content": "I bought this for my living room. First of all the color was looking odd when fixed. Videos looked good, but when I compared this LED TV with panasonic plasma I could see good difference, panasonic plasma is much better.  Sound quality was terrible, I didn't expect much from this super thin TV to have good audio. I found 3D as a total crap in this TV. It has passive 3D glasses but still I was getting severe head ache after watching 3D for 15-20 minutes, not sure if it is problem with my eyes. Remote uses AA batteries which makes it more heavy.It is difficult to find cables matching TVs color, also I couldn't find a matching color for Skype camera. TV did not play most of my DLNA videos.I returned this tv within a week and purchased SharpLC60LE650U, non 3D model. This sharp tv rocks!!", "Date": "May 23, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "VIERA Connect With My Home Screen; Swipe And Share; Voice Guidance\n3D IPS LED LCD\n120 Hz 1920 Back Light Scanning Technology\nSuper Slim Bezel\nTV without stand (Width x Height x Depth): 44.3 X 25.8 X 1.35 Inches, TV with stand (Width x Height x Depth): 44.3 X 28.2 X 10.9 Inches", "Name": "Panasonic TC-L50ET60 50-Inch 1080p 120Hz Smart 3D IPS LED HDTV (Includes 2 Pairs of 3D Polarized Glasses)", "ImgURL": "http://ecx.images-amazon.com/images/I/31T7JsuBipL._SX300_.jpg", "ProductID": "B00B59NYFI"}}