{"Reviews": [{"Title": "Took the plunge and went BIG...", "Author": "B. Raines", "ReviewID": "R325RO4XXVCV97", "Overall": "4.0", "Content": "First off, let me say I am not a \"Google fan boy\" as the fact that its made with Google products didn't really matter to me. My decision was concluded after widespread research of many TVs from different brands offering different products. I didn't buy it because it had Google stamped on it, so I am unbiased in my decision making. In my opinion, this was the best choice for my setup for my own reasons. Your needs may be different.So I was torn apart from the 55GA6400 and the 55GA7900. I was in the market for a new TV and did a TON of research, looking various TVs based on the following:3D: Active Vs. Passive. I prefer Passive, because you don't need to purchase batteries, many TVs already come with a few pair of passive glasses and from my experience they are easier on the eyes. The price for the glasses of active are astronomical! This tv is passive.120hz vs 240hz: It doesn't really matter to me because having any TV is better than none at all. That being said, I would have settled for the 55GA6400 if it wasn't for the audio sync issues. (Will be discussed later on) I will say though, I can tell a significant difference between the two models. I watched \"Forward Unto Dawn\" in blu-ray and I must admit, it was gorgeous. So if you're on the fence...know that there is a difference, it just depends on how much you care.Google-ness(apps): The whole \"smart tv\" thing I don't really care for to be honest. However, what really drew me in was the \"magic remote\" that LG included with THIS particular model. I don't like the regular \"magic remotes\" LG has for the other models, I think they are \"magic failures\", but I will say that I do like this remote. I read where other people said the remote buttons were too small, especially on the qwerty side. It doesn't bother me...I haven't made many typo's using it. The reason I mention the remote for this section is because only the Google TV has it. The apps, include Amazon instant, HBO 2 go, Netflix, Google play, etc.... The list goes on. I have yet to really dig deep into it, but there are many to choose from. The apps always tell me the latest news, suggest to me what movies I might like (based on me voting on various movies), it searches several different \"realms\" of whatever I search for. IE, if I do a voice search (the microphone is on the remote itself!)for the word \"house\", it will bring up the TV show House, shows about houses, across live TV, movies in various different apps and you tube! Needless to say, out of all the TVs that have experience with apps, I personally think this is a good choice. I don't see the \"Google tv\" going away any time soon. Google Chrome, Im no fan of in the PC world, but actually managed very well. I have yet to have a significant issue trying to pull up any websites on my TV. That in mind though, who really buys a TV so they can search the web?Brand: Brand has a HUGE role on choice. Honestly, Samsung was my first choice, followed by Vizio. (I know, right?) Samsung is a household name that signifies quality. Vizio is a brand I gambled on and has always paid out. I had friends that had LG, and I liked them....just wasn't really looking for one. LG however does have experience in the TV realm though so I was still comfortable making this decision. We'll see how it pans out in the long term.Research: ALWAYS research what you buy. I always drive my significant others nuts, but I research EVERYTHING. As I stated, I was going to go with the 55GA6400 first. However, after digging just a little more I saw \"audio sync\" issues with it. I plan on purchasing a surround sound system in the future and didn't want the hassle later on. I decided to test it myself. I went to Best buy and told them about my concerns before I purchased it. They assured me they had heard NOTHING about it. In my browsing of TVs, I also made a point to stop at Sears. The employees there had essentially said the same thing. Not convinced I went back to Best Buy and requested they connect a sound bar or some other type of external sound device. The employee kindly said he didn't believe such a TV made by such a prestigious company (and at that price) would suffer that kind of issue but he complied and said he would be happy to accommodate me.Upon connection of the TV, I asked him to change it to a station where people would be talking. (On their demo feed, you don't SEE anyone talking. Hence you can't tell if the audio is off) After changing the input channel, a talk show appeared on the TV. Sure as day light, the audio sync issue was present, it was like watching a current day Godzilla movie. The Best Buy employees who assured me this wouldn't happen stood there open jawed and couldn't believe what they were seeing and hearing; they didn't know what to say to me. After taking in that consideration and paying nearly a thousand dollars more (After tax and warranty plans included) I decided to go all out and purchase THIS TV. I have not been able to connect my own sound system to it as of yet, but this hasn't happened yet on the step up model (55GA7900) at Best Buy. That being said, it could have just been luck.HOPEFULLY, LG can correct this issue with a firmware update or something. Other than that, I am very satisfied with the quality of TV and the graphics. I have yet to have the opportunity to test out the 3D abilities of this TV, but I will update as I delve more into it.Ultimately I chose the more expensive model. There aren't many reviews out at this time and thats why I wrote mine. Cnet was not a big help, (normally one of my \"go to\" sources), but that is probably because this is such a new TV. They appear to be much better than the other Google TVs, the G1 and G2.Pros:*Picture: Excellent picture quality, I can't stress enough and believe me I was surprised with what I saw, I didn't expect it to look that good. I think LG has really made progress this year. Xbox 360 looked amazing on it with incredible detail.*Google Apps: Just a plethora of information at your finger tips, making it one more step easier to get the info you need. Being able to just do a flick or swipe and share your pictures etc..., from your tablet/phone to your TV is just amazing to me. For a smart TV, Google has done really well with the dashboard and abilities of a TV. I have a feeling more \"TV friendly\" apps will come out soon.*Prime apps: Not just your \"ho-hum\" regular apps, but the sought out Amazon instant video, Hulu etc...*3D: Passive 3D. (If thats what you want)*240 Hz as opposed to the normal 120.*Sleek design with an awesome non-invasive bezel. (My friends thought I had a painting on my entertainment center at first.)*Ease of use with the \"magic remote\" and it is easily navigated.Cons:*Sound: LG seems to suffer from this. This model is supposed to have a better sound setup than the step down model. I will agree with an earlier post that the sound does sound a little echoey. That being said, its only noticeable in the beginning and you get used to it. Its a little frustrating to spend that much only to suffer in the sound department. However if you're like me and you know you're going to use an outside sound source then it doesn't matter.*The menus take a little too long to respond to the \"magic remote.\" I expected the dual core processor to perform better.Not too much to say about the TV on the negative side.And that wraps up my initial review for the LG Google 3D TV 55GA7900. More to come.***UPDATE***05/13/2013Tried the 3D out on it...and oh my goodness it was awesome. I didn't really care for 3D, I just wanted to make sure my tv had the ability to do it, but it looks awesome in 3D. Passive glasses worked out very well, myself and my friends were impressed even though we had seen different displays etc at different stores.***UPDATE***04/01/2014I just connected my surround sound system with an Onkyo receiver, NR-626 coupled with Energy 5.1 Classic speakers. Sounds AMAZING, I do detect a hint of voice/video latency in synchronization, but I havent tried fiddling with the settings yet...and its not as bad as it was at best buy with just the sound bar...more to follow.", "Date": "May 10, 2013"}, {"Title": "Beautiful Display with Endless Possibilities", "Author": "David Bradshaw", "ReviewID": "R3L9IV7OPZI0V5", "Overall": "5.0", "Content": "UPDATE:The TV had an update, so I let it update (regret that).  It updated to the new Google TV version that is trying to unify all Android devices.  This changed a lot of how the unit works, I have not seen many new apps that are in the Play store that I care about, and my biggest problem is with Chrome.  Chrome has changed to a Android phone/tablet version that the TV channels detect as a mobile device and say you cannot watch on it (you can use desktop mode to get around this), however, Flash is GONE!  There is no Flash support anymore and I cannot watch any Flash videos (like fox.com, nbc.com...) they will not play (the unit had Flash support before).  I can now close apps (have to use a strange swipe motion with the remote's mouse; like you would on Android ICS), which is nice.  Some good things of the update is that the Video and Sounds improved greatly (do not know how, but they are amazing sounding/looking now; way better than before, which was already really good).  For the most part everything else is the same, the pop up menu in live TV mode is now different and requires an extra step to get to DVD/Record options; but I programmed the color buttons on the back for these functions.The TV will bug you about updating, so you will probably have to, but you will lose Flash which is really not cool.  Hopefully, LG or Google will realize this is not a good thing and will add it back to Chrome in Google TV, or somehow have a way where you can install it from Adobe (I tried, it detects the TV and says Not Supported); but I will give credit for the improved video/audio.UPDATE:I watched the DVD version of Oz the Great and Powerful last night and decided to turn on the 2D to 3D conversion, it was great!  I have found that the 2D to 3D conversion works great on movies that were made in 3D (I get most of my movies from Netflix [DVD] so watching great 3D movies on a budget is not easy since I cannot afford to purchase all of the disks that I want to see on 3D and Netflix does not rent out 3D Blu-Ray [to my knowledge]).  I have tried the 2D to 3D conversion on other stuff and it works, but is not amazing 3D effects, but movies that were originally in 3D look great even when watching the DVD version!UPDATE:My problem with the UP arrow and UP roller were found to be a problem with the Remote control, I called LG and they sent me a new Remote for free and it arrived quickly!  Their was no problems at all and the representative was super helpful and once the problem was found to be the remote sent a new one for free [Warranty].UPDATE:I had a hard time getting Google TV to work with my HTPC (Windows 7 x64).  I finally got it!!!  --This is not the fault of the TV, but instead me trying to do something that it is not completely meant to do.  I finally got it, and here is how in case you also want the Google TV system to control your HTPC (and use only one remote).  I was able to get it by telling the system I was using a TIVO for my DVR (I used Remote Code: 1817, and I found using generic codes did not work, since it would think that multiply buttons were the same [send same code to Windows]) and Broadcast Service for my zip code.  I than used a program called Intelliremote (I tried EventGhost, but it would go idle on my system and stop responding to remote commands) and used the MCE template to match the buttons (to control Media Center actions, their is also support for XBMC and a few others, and you can make your own). You will also need to Disable the HID Access in Services.msc.  I matched each button (using Learn Code) and it worked!  With the exception of two buttons (GREEN and RED), I programmed all the buttons to match what I wanted for my TV (as well as a few remote commands that can be sent from the onscreen menu).  Now once they fix the bug in Primetime I can use it.  I now only have to use one remote for everything.  I just thought this might help anyone trying to use Windows Media Center as a DVR with this TV.The Bug in Primetime I mentioned should only affect you if you are using OTA.  It sends the channel number to the DVR as a number (for example 10), however OTA sends it all with a decimal (WMC reads in as a decimal, but you could program it as a dash if needed).  When you use Primetime to go to a channel, say 10.2, it only sends the 10.  Which WMC ignores and does not change the channel.  I have reported this to LG and they said they are sending it on to Google (I tried to report to Google, but could not find anyway to send it to them).  This should not affect if you use Satellite or Cable (since they do not use the decimal, to my knowledge)First off, my setup.  I have this TV, a HTPC (HDMI, Windows Media Center OTA broadcasting) PS3 (HDMI), Wii (Component Cable), PS2 (Composite Cable), AV Receiver (Optical Out), Roku (HDMI) -- With all that Google TV offers I have stopped using Roku.SetupI got this TV and took it out of the box (super easy to do, since you open top of box, remove everything but the TV (stand, remote, cables, 3D glasses, instructions), than you can lift the top of the box up and the bottom will stay with the TV.  Than the TV can just lift out of the bottom cardboard and styrofoam.  I took the TV and put it on a  bed (with wrapping in place, so I could put the stand on it; the bed is nice since it is soft and the over lay allows the stand to be off the bed and at a height that you can easily work.  I put the stand parts together (four screws) and than put the base on the TV (four screws, but be sure to slide the stand on the top notches or it will not be right).  I than brought it back to the living room and put it on top of my electric fireplace. -- This TV does not look it due to its size, but it is really heavy.  I had a hard time lifting it and moving it (also because of its size it is hard to hold (without touching screen).  I put it on their and the stand is very solid and the TV feels super safe (the stand looked a little strange on the picture and I was worried about it, but it is super sturdy).I turned it on and the LG logo shows up and it was super sharp and gorgeous colors.  The Google TV setup wizard type walkthrough appeared and asked simple questions that I followed and got the TV setup.  I use Windows Media Center (Win7) with OTA (antenna) broadcast TV, I setup my system with that setting.  I have an AV Receiver, but I prefer not to leave it on all the time, so I only use it for music and movies, and the Optical Out on the TV allows me to do it with the DTS and Dolby Digital passthrough and have theater quality sound when I want it.Also, I enabled the Quick on setting to make it turn on instantly when I turn it on (about 2 seconds) vs the normal of around 20-30 seconds.  This setting is off by default and is presented in the Setup Wizard at first start or in Settings.I want to note that while it has plenty of HDMI ports it only has one Component and one Composite.  However, it technically only has one of both type.  The TV panel has a 3.5mm looking jack connection for Component and Composite.  The TV came with an adapter for it.  However, the Component does not have Sound and instead uses the Composite's input for sound.  So I have my Wii (Component) hooked in, but the PS2 can only have video, no sound.  I am going to go get an RCA jack splitter (one for the RED and one for the WHITE sound cables) and than have the Component Video hooked to the Component port, Composite Video (YELLOW) hooked to the Composite port and the AUDIO (RED and WHITE) from both split to share the Composite Audio in (Since I will never have both on at the same time, it should work fine).  However, I just wanted to note that, since it appears that you can use Component and Composite you can only use Component or Composite, since they are share Audio.  This is was kind of irritating, since their are still a lot of great devices that use Composite or Component (Wii and PS2 for example)...TV Service SetupThe TV setup was easy and the TV found all my TV channels (I went in and removed a few that it found that I do not have), and than the hard part (not related to the TV).  I had to get the LG remote to control my HTPC (Windows 7).  I used a program called EventGhost that allowed me to record the commands from the LG IR blaster and EventGhost triggers an action when it gets that (since all tasks in Windows Media Center can be performed with a keyboard, I set up each task to trigger a keyboard event).  This took forever due to the problems I kept running into HID services triggering duplicate events, IR signals Debouncing, I finally got it to work by enabling MCE Remote (Vista/7) and MCE Remote (old) on the same system, the Vista/7 model enabled the service for passthrough of IR signals and the older version of it created three IR signals that had different codes for each event and I just created a trigger for the first one received (this took a while since I had to create it for every single button that controls the device; if you are using anything other than a computer (HTPC) you should not have this problem and can pick your remote/device provider from the list provided, but if you are using an HTPC I thought this might help you.To let you know, since it is a tad confusion on how it works.  Here is how the Google TV system connects to your Input devices (in my case my HTPC, acting as a DVR/Guide for OTA TV).  The IR blaster sends the IR signals to your device, the IR signals include launching DVR (recorded content), Live TV, Guide (for provider guide), channel numbers, and other commands.  When you tell it DVR (menu or back DVR button on remote) it sends the IR signal to the device, the same with all other functions.  When you use Primetime for the guide it sends the channel number to the device using IR (I have found that for OTA it does not send the decimal or dash; Windows Media Center uses a period, so I programmed the DASH button on the remote (only non number that seems to send an IR blast) as a period, but Primetime does not seem to send a dash or anything, it just sends the number (for example 10.2, is sent as 10), and the HTPC just ignores it since it is not valid.  So at this point I cannot use Primetime (it has a cool look and looks promising.  I will report the issue to Google and LG and maybe an update will fix it).  I have verified that it does not send anything but the first number (using an IR console, I saw it send three commands, which I have previously programmed.  For going to channel 49.1, it send a 4, 9, ENTER.  WIthout a dash or period it will not tune to a channel.  If you have cable/satellite it should not be a problem since it has no dash/period.  Also, when I setup I saw all the cable providers and Satellite providers in my area as choices for TV service, so you should be good.DisplayThe screen is gorgeous and is near edgeless (about a quarter to half an inch on the sides), the colors are vibrant and the picture is just amazing.  Make sure to rerun any Display setups on your devices to ensure that it changes to proper 1080p and the proper settings for this display.  --If you are using a HTPC or computer, you might find that their is  a large (about 2 inches) on each side of the screen not being used.  To fix this go into your graphics driver's program (I went into Catalyst since i am using ATI) and look for a setting like My Flat Panels.  In there you will seen an option called scaling, click on it and you will see a slider that you can adjust.  I set mine to 0 and it now fills the entire screen!3DTo test out 3D I purchased Avatar in 3D.  The 3D was amazing, I will say it is very close to Theater quality.  Movies with more action and popping out stuff is cooler, but Avatar had a neat feel to it that sort of engulfed you into the picture.  Their was no tossing stuff at you, but spears and fire seemed to just come at you and the bugs and floating things (from the tree of souls or life) seemed to be almost in the living room.  The 3D glasses are really nice and you get 4 of them.  They do not require power and are very similar (if not the same) as the type you get at the theater.  They have a comfy fit and cover your whole viewing (wide lenses) and you do not even realize you have them on.  While watching Avatar I tried to increase the 3D depth, but after some research found that you cannot, the Depth slider is just for 2D-3D conversion.  I did enable 3D color enhancement which seemed to make it more vibrant since the 3D glasses darkened it up a bit.  The 2D to 3D is also pretty cool, but I find that it mostly just makes text on the screen come out.  If something has a lot of  action it works better, but it is not something you should expect to use often.  Some shows/movies it works great on, others it does not seem to; I do recommend turning up depth all the way, that is a great improvement on the 2D to 3D.  Also, when I turned on the PS3 after connecting the TV it popped up saying it detects a 3D TV and asked to enable 3D I said yes, and now when running 3D movies or games it automatically goes to 3D and the TV says to Put on Glasses (easy setup and works great)!!AudioThis TV has 2.1 audio.  However, you would never guess it.  The TV has Virtual Surround and sounds amazing.  When I do not have my surround sound on (actual AV Receiver) it sound like I do since you can heard numerous distinctive channels.  You do have to set it up right, go to Settings and find the Audio and set it up.  You will have to play with it and get that sweet spot for you.  You can also enable Virtual Surround in their.  The sound is not that loud as my old TV, but if you have it on about 70 you can hear it great (with fans on; I am in South Georgia and it is hot right now; without fans 30-40 is great).  It does seem to change sound intensity based on channels (I think some channels have HD sounds and others do not), but it is not a big difference.  The virtual surround is amazing and this TV puts off great surround effects without even using the AV Receiver.  I do use the AV Receiver for movies and music, and the AV Receiver can use DTS, Dolby Digital, and Multi Channel Stereo through the passthrough of the Optical Out.Google TVThis is my first Google TV, I used to have a Roku (still have it hooked up, but find I am not using it).  The Google TV has Netflix, Amazon, Crackle and a few others preinstalled.  You can add more from the Google Play Store (at this time Hulu Plus is not there, I do not use Hulu Plus, so it does not matter to me.  Their are options, so you can find some ways to get Hulu.  I personally use Hulu Desktop on my HTPC).  Their are not as many Google TV apps out their as you would hope, but for the most part the main ones are their.  You do not seem to be able to load any Android app on the TV (for some reason I thought you could; I am sure their are ways, but I am not trying any with a TV).  Their are probably going to be more apps showing up if Google TV becomes more popular and the inclusion of it in some big brand TVs might help it take off.  However, this is a TV and for the most part you are not going to be using a lot of non streaming apps (other than radio and news).  If you go to Google Play and Search for Google TV you will see most apps have the phrase for Google TV in their title.  The ones you will actually use are their and you can always use Chrome for other tasks.  The Chrome browser works great (before you try, Hulu will block it for full episodes, it will appear to work and than \"Hello, we notice that you are trying to access Hulu from Google TV.  It is not available, but we are working hard to bring our Hulu Plus Subscription service to Google TV\").The Primetime and show search functions work nicely and you can see what episodes are free (through Netflix) or can be bought from Amazon Instant VIdeo.  I wish they would add the Prime Content of Amazon Instant Video to the list of Free shows in the search and Primetime areas.  You can easily open the Apps from the Home page of Google TV and change what apps are shown where (bottom bar and Top Apps).  You also have Widgets that can display stuff you care about (I have my weather and news on the home page).  The Google Play store on the Google TV works great, and only shows Google TV Apps (so if you wander why some are missing, that is why).  Their are many apps and they change all the time, and more are added to the Google Play store.  I have actually found that I do not need my Roku anymore, since I can stream everything on Google TV and it looks just as good (if not better).  You can also surf a full web using Chrome (it has Flash support), and the remote mouse works nicely and is easy to use.Also, to let you know, I checked in the settings and found that it has 5GB of storage for Apps and other stuff.RemoteThe remote is cool, the QWERTY keyboard is nice and it feels well made.  However, it is the weakest link in this TV (although this is an amazing TV, so this remote is still pretty awesome).  The remote's shape is like a phone (width and height), it is just a tad longer than my iPhone 5.  It is pretty fat on one end, but still fits naturally in your hand.  The keyboard is nice and has most characters that you would expect.  The only thing I would change on the QWERTY keyboard is the FN keys.  They are this dark maroon red and unless you have a lot of light, they are hard to see.  I wish they had better contrast, since it is hard to see.  I also wish that the dash or period (my HTPC uses a period for channel numbers), but the period button (FN + L) does not send an IR signal, instead the DASH (FN + S) sends a dash (I programmed Intelliremote to read that as a period).  However, I think that should have been a main button, since if you have OTA you will use the DASH/PERIOD a lot since all channel numbers have it.The front of the remote is simple and has the main buttons that you use.  The Power button and Input button are clear and the voice, Guide, Back, Home, Menu, Mouse, 3D, Channel, Volume, Mute, and DVR functions are easy to press.  I also like the 2D-3D button being on here.  However, I wish they had included the STOP button (I programmed the Yellow (FN + INFO) on my TV to STOP programs).  I also wish the DVR, Live TV and Info button were on the front (they are on the back), but they are most used buttons in my opinion (you can get to the buttons by pressing Menu on the front and an onscreen option is present).  The DVR Controls are nice, but I do like the Skip (skip ahead 30 seconds or back 15 seconds), those are not present, but I can live with that.  For IR controls, you can program most of the obvious buttons on the front, and on the back you can use the Numbers, DASH, INFO, DVR, and color buttons (RED,GREEN,YELLOW,BLUE) and the arrow keys, Enter, Backspace and ESC do the same as their front counterpart (ESC is BACK).  Once you get used to the remote layout and use it is easy to use and you will not have much problem.The voice search is nice and the Integration with YouTube and Chrome allows you to find nearly anything.  You can also find stuff in Primetime and launch Apps.  It is very good and I have not had any issue with it not recognizing my voice.  Just remember that it does not stop what you are watching when you do it.  So you may want to pause before doing it if you are watching something you care about (it does mute it).The remote is pretty cool.  However, I have found two annoying problems.  [UPDATE: The UP and Scroll UP are actually a defect with my Remote, I contacted LG and they are replacing the remote, see update below] The UP button on the front does not seem to work when you press it lightly (like the other directional buttons) and the scroll going up keeps tossing me down, I find you have to press a little harder on it for it to recognize (maybe it the way I hold it...).  Secondly, sometimes the remote does not seem to respond.  I think it might take a second to repair with the TV (since it is BlueTooth), and I press a button and it does not do anything, I am not sure if I should do it again or wait (I raised the volume of alerts in the Settings since the sound takes place before the action for big changes (like going Home).SummaryIn the end this TV is amazing.  The picture quality is amazing, the streaming content and integration between content and devices is amazing and it works flawlessly.  3D is amazing and glasses are comfy and cover your whole line of sight, and enhancements with Google TV are limitless and the future apps can always keep you watching new stuff.  Like all full features devices their are some quirks, and some stuff that does not fit all (for example, I had to do a lot of work to get my HTPC to work with this).  However, once you get it all setup, you will find you only need one remote for most devices (still have a remote for the PS3, since it is BlueTooth) and you can stream straight from the TV without any other devices.  Their are a few changes I would like to see and a few bug fixes that need attention, but since this is Android based it can receive updates (in fact I had an update when I first got it; updates are painless and take about 10 minutes).If you are looking for a full feature TV that offers everything and can do it all, than this is what you want.  The Google TV platform is growing and had some hiccups along the way, but with the quality I have seen here it has the potential to be big!  I look forward to seeing what new apps and features this offers in the future and Hope to see Primetime fixed soon for OTA users.Highly recommend this TV!!!!UPDATE on Remote:My problem with the remote control turned out to be a problem with the Remote hardware.  I called LG and explained the hard to press UP button and the scroll ball's problem going up (goes up a little and than shoots back to the bottom of a page or list), and they said that the remote sounds defective.  He said they are sending me a replacement remote control (under warranty).  So if you have this problem it is a problem with the remote and warranty will replace it.  Also, the LG customer service was super kind and fixed the problem on the first call with little effort on my part.  LG has excellent customer service and great policies on how they handle warranty replacements.", "Date": "May 24, 2013"}, {"Title": "Truly Amazing TV Experience", "Author": "Dr. Bojan Tunguz", "ReviewID": "R181UKCR8E6MWN", "Overall": "5.0", "Content": "I got this TV a few weeks ago, and have been really enjoying having it. I was not in the market for a new TV, but I am definitely really glad that I got this one. Below are some of my experiences and observations thus far. I may add some more info as I get to know this TV more in the upcoming years.***** Setup *****Despite it being a fairly big 47\" TV, setting this device up was a breeze. It is remarkably light, and even though you are supposed to set it up with someone else helping you out, a reasonably strong person could do it by himself. The connections and all the other setup features were also reasonably easy to figure out and configure, although this could be just my bias - over the years I've set up a fair number of TVs and other \"screen\"-based devices, so I am very familiar with all of its ins and outs. If, on the other hand, you don't know the difference between, say an HDMI and component cables, then you might want to have someone a bit more technically savvy helping you out.***** Picture Quality *****Despite all the advances over the years in various features of the \"smart\" TVs, for me the number one consideration when buying a new TV is the picture quality. Fortunately TV manufacturers have been more than obliging in this department in recent years, and each year we are treated to some new improvement. Today most TVs made by the top brand manufacturers more than meet my minimum requirements. Even so, the visual quality of the content that can be viewed on this LG TV is just stunning. The colors are crisp and vibrant, and the contrast is very impressive as well. The TV features very wide viewing angles, and it can be enjoyed throughout even a larger living room.This is the first TV that I've owned which features the 240 Hz refresh rate. Personally I am a bit ambivalent about it. Yes, it makes the picture seem much smoother, but this effect can be look petty unnatural when you see it for the first time. It almost has the feel of a homemade video. You get used to it after a while, though, and the \"normal\" TVs start looking choppy.***** 3D *****I am not a huge fan of 3D TV, but given a chance I don't mind watching that kind of visually enhanced content. When it comes to movies, I guess I am still very much \"old school.\" A few action-packed and/or visually enhanced movies that came out in recent years do make the 3D worth having around. The same goes for the few sports channels - watching high-level athletic competition in 3D is definitely a great experience. However, for the most part, I still don't see the 3D technology as a make-or-break for my TV experience.This TV comes with four pairs of 3D goggles. This is enough for your typical nuclear family these days, but you may want to get a few extra ones if you are planning on watching some 3D content with guests. This TV uses the passive 3D technology, which in my experience is much easier on the eyes and makes for cheaper and lighter goggles.***** Sound Quality *****Unlike the picture quality, the sound quality of the TVs in recent years has not been showing nearly comparable improvement. The sound of this TV is more than adequate for your casual watching, but if you really want to make the most of this TV - be it for amazing sports or movies - you will certainly need to invest into a better external sound system. This is fine as far as I am concerned - I already have a pretty good sound bar that I've been using from before. But if you are trying to determine your total budget for a new TV, then this consideration should be another thing to keep in mind.***** Build and Design *****This is a very elegant and svelte looking TV. It is very light, but it feels very sturdy and well built. The lack of thick bezel makes the TV look almost like a stand-alone work of art. It also makes it seem smaller than it really is, something that I am not too bothered with.***** Online Content *****These days I primarily rely on Netflix for my content, so I have come to expect from a TV to provide an easy Internet access. However, in the past, aside from a few very specific TV \"apps\" I've had the hard time accessing most of the online content. With this Google TV I've been able to access more content than I ever did before, aside from accessing it all on my computer. Furthermore, the Google search function makes finding things to watch incredibly easy and intuitive.***** Live Primetime Guide *****One of the biggest frustrations that I have with TV in general is the difficulty of finding the right programing. Most TV systems still rely on a cumbersome set of menus and scrolling which gets incredibly tedious when you have to deal with hundreds, if not thousands, channels. Some Cable systems (including TiVo for instance) have a more manageable search features, but even these are far from ideal. The inability to find the right kind of programming on demand is particularly frustrating when compared with the almost magical ability to find stuff online. A Google TV seems like an ideal solution to those woes.The LG keyboard remote is pretty good interface solution for accessing the guide. The keyboard is diminutive and you would not want to use it for any kind of extensive typing, but as an access point for text input it is more than adequate. The keyboard also has a voice-input functionality. So far I have only used it sporadically, and if my use of Siri is anything to go by, then I don't see myself using it a lot in the future. However, for all those who prefer this kind of input it is a very convenient feature to have.***** Conclusion *****This is a truly very beautiful, functional, and glossy TV with a lots of \"smart\" features. After using it for a few weeks I am more than happy with everything that it has to offer. However, if you are \"only\" concerned with getting the best picture quality for your money, and all those other higher-end features don't impress you all that much, then there are many other much cheaper TVs available right now.", "Date": "June 17, 2013"}, {"Title": "Great TV if  you don't mind being an early adopter", "Author": "Thorstein Veblen \"Conspicuous Consumer\"", "ReviewID": "R1G0X0PQI7G269", "Overall": "5.0", "Content": "My goal for years has been to have a fully integrated device where one can watch TV, view content from my NAS and surf the web.  I have dreamed of being able to be watching a movie, and while still watching be able to look up the stats on an actor.  I have bought many of  the devices to attach to the TV like the popcorn hour and many others but until now I finally settled on a home grown HTPC.That was then - - -but - - - now my goal is fulfilled.This TV does it all,  I won't go into all of the features because they are spelled out very well in the other reviews but let me tell you that with this TV, I  can seamlessly surf while I watch TV with the picture in picture feature.  Also through the app section, I can use the Plex app to access my Synology NAS to select and play my movies, music and more.But that is not  all.  In my opinion, the picture is as clear and  sharp as any i have seen on display at Best Buy.  The 3D is easy to use and  the quality is 90% or so as good as what you see in the theater.  The voice feature of the remote is nothing less than remarkable.  It almost always understands  what I say. The QWERTY keyboard is a real help too if you want to browse.  All the buttons that you need to get around your TV are on that side of the remote.But this TV is not for everyone.  If you want to walk a well worn path of technology where all the bugs are worked out and the TV is totally compatible with all other devices,  look elsewhere.In playing with the TV I have found a variety of things that are either bugs or at least annoying.1, If you hook your TV to a sound  system, you cannot use the mute button on the remote (I confirmed that with LG)2.  Sometimes the remote freezes up and you have to press the down arrow key to unfreeze it (I found that by trial and error)3. Documentation is the pits!  You just have to use trial and error4.  The menu system on the TV is very confusing!  It varies based on where you are in the program and for me it was difficult to re-find options that i had found previously.5,  The remote is too small!  My hands were cramping after a bit of us.  I don't see any reason that it couldn't have been a couple of  inches longer.6. All of the keyboard functions  are not explained. I have cox cable and when  doing certain functions like confirming an erase on my DVD I have to press a button on my cox remote in the shape of a yellow triangle.  Only aft holding the function button down and pressing every button did I find the magic combination (hint it is the one with the yellow underscore plus the function button)7.  The function keys are in dark red!  I had to use a pair of glasses a magnifying glass and a flashlight to be able to read them8.  I could go  on.  There are lots of little things like that.To sum up my experience, I think that this TV provides a tremendous value for the money and I  am very happy with my purchase  even if i can't use my mute button.  Just be sure that if you want the functionality that this TV provides, either be prepared to put up with some annoyances or wait for a later model.  For me though I couldn't wait and I  am glad that i didn't.So for now, I am going to press the voice button on my remote and say, Google TV find me a Star Trek movie...then look up the age of Leonard Nimoy.  This is so cool!UPDATE 10/5/2013 - As I have become used to this TV I only love it more and more.  My only real complaint is the lack of a mute button.  Everything other issue has been resolved with use.UPDATE 11/14/13 - There has been a major software update and now - - - THE MUTE BUTTON WORKS!!  So cool.  A lot of other awkward menu logic has also been fixed as well.  This TV just keeps getting better and better!", "Date": "May 27, 2013"}, {"Title": "Great panel, GoogleTV still under construction", "Author": "Gaz Rendar", "ReviewID": "RMR5AIW67AJJ8", "Overall": "5.0", "Content": "The LG GA7900 is a great looking panel loaded with a GoogleTV operating system that isn't quite fully baked.  LG also makes the LG Electronics 42GA6400 42-Inch Cinema 3D 1080p 120Hz LED-LCD HDTV with Google TV and Four Pairs of 3D Glasses (GA6400) series of televisions, which I recently reviewed on Amazon.  Some of the features are identical between those two GoogleTV series, so parts of my review will be recycled, but I will point out the differences in the GA7900 below so you can compare and contrast the two units while you're shopping.HARDWAREI'll start with the physical specifications of the television first.  Assembly of the stand is pretty typical for LCD sets, and I had no problem attaching the 8 screws required to get the TV in an upright position by myself.  I would have preferred a base with a standard X pattern, but the two \"arms coming out to hug you\" stand is stable enough and doesn't take up a huge footprint.  It's somewhat of a bummer, but the stand lacks a tilt/rotation capability.  There are 4 HDMI inputs on the side of the TV, a headphone output, an optical out, 3 USB inputs, and some 1/8\" jacks that allow you to plug in composite and component in cables via the supplied adapters.  There is an additional 1/8\" jack for the IR blaster adapter (also supplied--it's a Y-adapter with two IR blasters connected to the same jack).  There is also an ethernet jack and a coax cable input for direct standard cable signal or an over-the-air antenna.  All of these inputs are on the left side of the TV (oriented while you're facing the LCD screen). The 3-prong, grounded power cord is attached to the opposite side of the TV from the inputs.  Unfortunately, I feel like the power cord could be a little longer.  The frame is slightly slimmer and has an angular, and more aggressively styled bezel on the GA7900 compared to the very squared-off shape of the GA6400, but it looks cool.  The sound on the GA7900 has a little more bass and \"oomph\" than the GA6400, but they're still stock TV speakers and nothing to get excited about.PICTUREI received the 47 inch version of the GA7900 for review.  It's a full 1080p, LED edgelit screen.  While I can't find specifics on the technology used, the GA7900 boasts some degree of local microdimming.  The result is a dramatic difference between the GA7900 and GA6400 in terms of black levels and contrast.  The GA7900 does an excellent job of producing something close to a \"true\" black on an LCD with a substantial contrast range.  Basically, most of the cost and performance difference between the GA7900 and GA6400 is located here, as the picture is significantly improved in the 7900.  I was also impressed with the clean black around the edges of the panel.  I didn't detect any noticeable light bleeding out near the bezel.  You'll have to move up to the very high-end (and more expensive) microdimming Samsung F8000s, Sony XBRs and Sharp ELITEs to reach better black levels on an LCD.  And of course, good plasma TV tech still produces the best blacks. Color reproduction on the GA7900 is very good compared to similarly priced sets.  Reds and greens have an appropriate amount of saturation and color accuracy.  I didn't find anything looking too warm or too cool.  The 240Hz refresh rate holds up well versus similarly priced sets and does a commendable job handling live sporting events.  I only noticed minimal digital motion blur during very fast NHL hockey action.  Overall, the GA7900's panel pretty much performs as well as anything in its price range.3DThis LG comes with 4 pairs of passive 3D glasses (similar to the glasses you get in a movie theatre).  Since my 3D options are somewhat limited, I ordered a free OnDemand viewing of Ice Age 4 in 3D.  I enjoyed the 3D effect and I never experienced any cross-signal.  The 3D viewing angle isn't that wide, but you can maintain a quality depth effect if you're sitting  within 45 degrees away from straight-on.  I was surprised that I wound up preferring this passive 3D effect over my active-shutter 3D glasses I use with my Samsung ES7500.  It's also nice that you don't have to worry about putting batteries in the glasses.  The 3D here works more or less as well as the GA6400.REMOTEIf you're reading this review the reason you're considering this TV is because it's a Google TV.  Well, really, the GoogleTV software goes hand-in-hand with this iteration of the LG magic remote (the remote is the same for the GA6400and GA7900).  LG made an incredible remote for this TV, however, they also annoyed me to no end by not going the extra mile and including a couple simple, intuitive features.  First, the good...the keyboard works great and is so much better than trying to type out search phrases in a SmartTV with a D-pad.  The pointer works very well.  It's basically a poor-man's version of a Wiimote.  Some of the features, like holding down the gesture button and air-drawing semi-circles to zoom in can be next to useless, but for the majority of the GoogleTV interface this remote is a wonderful match.  Unfortunately, the remote has problems whenever I try to use my Comcast DVR.  There are times when I want to use my DVR's channel guide (see below) and unfortunately, this remote does NOT have page up and page down buttons.  This problem could be alleviated if LG can fix the firmware and allow a single click of the scroll wheel down to send a \"page down\" signal to the DVR through the IR blaster.  The other main issue is that, amazingly, there is no STOP button.  There is a separate play and a separate pause button, but no stop.  Why not make one button PLAY/PAUSE and the other button STOP?  When I'm watching DVR video I need the stop button to get me out of the program I'm watching and give me the option to delete it.  Instead, all I can do is pause, and then hit BACK, which takes me all the way out of the DVR menu structure.  It's annoying.  Buried within the menus is the ability to assign functions to the red, yellow, green, and blue buttons, but I tried to assign the page up and down functions and it didn't work.  There is a lot of empty space on the front of the remote.  Why didn't LG add a couple more buttons for page up/down and stop...and even 0-9 while they're at it?  The other minor things I miss are having a backlit display and a \"flashback\" button to flick back and forth between two channels.  Finally, some keys have secondary functions, but they are written in a tiny red font that is nearly impossible for me to see and probably invisible to people with red-green color blindness.GOOGLE TVObviously, this is the differentiator for LG's GA series of televisions.  If you ask me is it worth paying a little extra cash for a GA model over a competitive panel with the same picture quality to have GoogleTV built-in, my answer as of June 2013 would be---not yet.  Hopefully some software and firmware updates will soon change that answer to a definitive YES.  GoogleTV essentially tries to overlay its interface on top of your DVR's interface and cable (or satellite) signal.  When you start up your GoogleTV, you are required to log in with a Google account.  Not a fan of Google's privacy policies?  Too bad, you'll have to deal with it.  The main purpose of your account is to provide access to the Google store for app downloads to your TV.  Once you're logged in, you calibrate the unit to the type of TV signal you receive, what area you're in, and whether or not your receive premium channels.  From there it takes a few minutes to load, but GoogleTV takes over and provides you with its channel guide.  The GoogleTV channel guide is similar to Apple's cover flow for music.  Instead of seeing a common spreadsheet grid from your DVR, you instead thumb through mini-images of movie and TV show posters.  At first glance, it seems like a much more intuitive way to find content.  However, it only works well for live TV and shows that are going to start within 5 minutes.  You won't see shows that are going to begin in an hour.  On a normal DVR channel grid, I can flick around and randomly notice a program that will come on in one hour.  At that point in time, I can either choose to record it or plan to watch it.  With GoogleTV, you are instead supposed to know what you want to watch and use the keyboard or voice search to find it.  The search will find it on upcoming TV listings, Netflix, Amazon Video, YouTube, etc (there is no Hulu Plus on this set as of June 2013).  The difference is that you have to know what you are looking for ahead of time.  While using GoogleTV, a double press of the Guide button will send you to the DVR channel grid, but without the aforementioned page up/down buttons navigating is an imprecise chore.  The TV has a 2-hour sleep feature to keep its content up-to-date.  If you shut off the TV and come back an hour later you won't miss a beat.  If you shut off the TV and return the next day, it can take 30 seconds to 5 minutes for the Guide to update and be ready to use.The GooglePlay app store is...weird.  Within the app store I can click GAMES and I'm taken to a page that shows subheadings for featured items, editor's picks, etc.  Except that there are zero, and I literally mean zero apps on these pages.  It's as if the store is empty.  However, if I search within the store for \"solitaire,\" I'm given the option to download a game that works on the TV.  Once again, you need to know exactly what you're looking for.  There are a very limited number of apps, though.  I believe the problem is that GoogleTV is running a variant of Android 3.2 instead of the 4.X running on most phones and tablets for 2012-2013.  I have no idea if an upgrade to 4.X will provide more apps.  Of the apps that are there, it's a somewhat mixed bag.  The internet browser is amazingly not horrible for a TV, thanks in large part to the keypad remote with scroll wheel and Wii-like pointer.  I had a difficult time with streaming services, though.  Short YouTube clips have worked well, but AmazonPrime hasn't been perfect.  At first, I searched for \"Avengers,\" and Google directed me to an option to watch a comprehensive list of movies that I could pay for or watch for free.  That search part is wonderful.  I selected the movie, Thor, because it was free through my Amazon Prime subscription.  I was able to get through the whole movie, but there were 2 instances where I had to wait for buffer loading in HD.  While not perfect, recent updates in the AmazonVideo app have dramatically improved streaming performance and it gives me hope that a few more software/firmware updates will really improve GoogleTV.SUMMARYIn conclusion, the GA7900 is a very good television.  The panel's picture quality and its ability to compete against similarly priced sets on the market today is why I'm giving this product a 5-star review.  You could still simply use this set like any other TV and choose to ignore the GoogleTV features and be pleased with the picture (you'll still need to create that Google account, though).  My only caveat is that the GoogleTV functionality as of June 2013 still has a ways to go before it can fully and precisely interact with a DVR's menus, or altogether replace them.  The software has some cool advantages with its image-based content scrolling, but it's still too limited in its current form.  Hopefully Google can update the software to Android 4.X (rumored to happen later in 2013), and offer ways to stumble onto TV programs without me needing to know exactly what I want to watch.  The remote is one step away from being one of the best gadgets of the year, but the lack of just a couple buttons is a mind-blowing admission.  It would be great if LG can provide some new firmware to perhaps assign more functions to the colored remote buttons.  The mystical TV-watching experience I was hoping for is so tantalizing close, but yet remains beyond the reach of my magic remote clenched hand.(If Google/LG push out significant upgrades I'll try to update this review).", "Date": "June 8, 2013"}, {"Title": "You take the good...you take the bad...", "Author": "Rawim", "ReviewID": "R2ELMIEAWRPSH7", "Overall": "3.0", "Content": "You take it all and there you have....a Google TV.There are a lot of things to like about this TV and a lot of things to dislike.Picture quality.Most of my viewing is just watch I watch off of DirecTv and my DVR.  I have noticed that the picture viewing quality changes depending on either what I am watching or in what viewing mode I guess I in.With most sports viewing everything is fine.  You can set the screen to be very bright and clear.  The image moves smoothly and everything seems great.But I notice sometimes when I try to watch a drama or a movie I the image with go from being super clean and very lifelike, to choppy and momentary stutters.  Normally this wouldn't be a big deal for me, but when a screen goes from showing me a great image to a suttery one, it really draws me out of the moment.There are of course multiple expert option to change how you want to view things, more than I have seen on any other TV.  It could just be I need to tweak these.  But the truth is I have no idea what most of these settings are, and the on screen menus do not help you out.  I would guess I could look it up in the manual, but you don't get a paper manual, you get a cd with the all the manual information on it.Would it have killed Google to build the manual into the TV so you could just look it up?Sound.The built in sound for this TV is surprising good; a nice dynamic range, and very good for built in speakers.  Only one big problem is that when things get loud you get a rattle from the back of the TV.  From what I can tell the back metal casing for the TV rattles if you get things too loud, kind of a drawback.  But of course you may be hooking this up to a sound system, then you won't have any problems, and of course there are multiple menu options to go through to tweak things.3DPretty darn good.  A passive system, so just polarized style glasses you need to wear.  It looks like things are in 3D.  You can adjust how much of an effect you want, so you don't get sick or have eye strain.  The thing that surprised me the most was the 2D to 3D function.  That was pretty good.  You could just turn on broadcast TV and the TV did a really good job of interpreting and making things look 3D naturally.  I don't use the 3D very often, but an impressive feature none the less.The Google Stuff.So you basically need a broadband connection to make this stuff useful.  You can use either Ethernet or the TV's built in WiFi.  Setup wasn't too tough, just follow the onscreen prompts and you can be done in 10 to 20 minutes.  But you do need that always on connection.First the remote control is akward.  I don't know how to describe it other than a poorly designed cellphone.  It is thicker on one side than the other; it has basic buttons on the top and then a mini QWERTY keyboard on the back.  It just feels weird and takes getting used to.  It is an RF remote, so most of the time you don't have to point at the screen to use it, but it can also function as a mouse, so you do need to point is at the screen for that.  The remote also has a built in microphone for using the voice activated features of the TV.Which brings me to the voice activated features.  Pretty decent, works kind of like Siri.  You press a button, speak into the remote, Google takes your voice send it off to the server and then follows it like a command.  So I say \"Netflix\" and Netflix opens.  I say \"Keyboard Cat\" it searches youtube for keyboard cat and begins playing the clip it thinks is most relevant.  Kind of a fun feature, but it needs some tweaking to understand when I want to change settings.  When I want to do that I have to just use the menu buttons.The TV has sort of a home page.  Where you can navigate the different media sources and \"Apps\" you want to use.  You get your basic stuff, HBO2GO, Netflix, YouTube, Amazon, Google Chrome.  One missing piece, no Hulu.  I cannot get an answer why either.  No Hulu app, and you can't even watch Hulu through the web browser, I can only assume it is some legal or royalty issue.Back to the home  screen, you can navigate it with buttons, voice, or using the remote as a pointer (Least useful).  You can browse different apps, open up media you have attached via USB port.  Or stream various media apps.  But it all just feels clunky in the interface.  I have only been working with it for about a month now.  I assume I will learn more about the quirks, as I spend more time with it.  Also I am sure as Google gets feedback they can update the firmware and the interface, and it will get better.But unless you are an early adopter, I would probably hold off for now on this TV, I think some interface issues need to be worked out.  Because lets admit if you are buying this TV, it is for the Google stuff, and I just feel like the Google stuff isn't quite there yet.If you have a question about the TV or my experience with it, just leave a comment below and I will do my best to answer it.", "Date": "June 26, 2013"}, {"Title": "Great Picture, UI needs work", "Author": "Amazon Customer", "ReviewID": "R1Q7A9ZINU0ABR", "Overall": "4.0", "Content": "Out of the box, the first thing that I noticed about this TV was the bezel, or rather the near lack of one. Its an attractive feature although it makes installation a bit tricky.  The next thing I noticed was the picture quality. Its excellent. Local dimming provides for nice blacks and for the most part doesn't introduce artifacts (on some static menus there was a bit of a background gradient visisble).  3D also looks great once you try something besides the included videos.While the 240hz smoothing provides a liquid feel, I preferred to turn it off.  Here the UI reared its ugly head, to get to the fine tuning adjustments requires popping into the GoogleTV home page and digging through menus. This is doubly problematic for trying to choose between the various smoothing options as it isn't possible to switch the settings while video is playing.GoogleTV isn't all bad though. The remote is pretty neat, though a little laggy and being able to do voice searches is very cool.  There is a limited selection of apps but many of the big ones are there. Not all the apps are that polished compared to what you find on a device like the Roku or a console.  The main GoogleTV concept of intercepting an HDMI feed from a cable box and providing a guide overlay is also pretty neat, if you are using STB or similar as a TV source. Sadly, support for TV over DLNA from a CableCARD source (HDHomeRunPrime) isn't there.  Nor is it possible to use WMC7 as a tv source and provide control over IP, although this is such a niche application that it isn't surprising.  In general DLNA support was pretty bad, although the built in Plex app worked well.Another quibble is with control of the tv over ethernet.  It's very simple to connect an Android device to the TV and use it as a remote.  However, it isn't possible to turn the TV on using a remote app, only off. There don't appear to be TV codes that will work with a universal remote to control the TV so the only way to turn the TV on is manually or with the supplied remote.Overall, the TV combines great image quality with a UI that includes many tradeoffs.  Aside from the Google-centric features, the GoogleTV interface isn't up to the level of the competition and adds an unnecessary level of complexity to the menu structure.", "Date": "June 10, 2013"}, {"Title": "Google G3 TV", "Author": "DanS \"DanS\"", "ReviewID": "R1VPJV3WOJITKG", "Overall": "4.0", "Content": "I had to return the 47GA6400 after a week to BB due to poor AV synch (must have been a lemon). Finally, received this TV from Amazon after almost 2 weeks since I had preordered it, and I am glad I waited and spent the extra 400 on this model. The overall experience of using Google TV is same between the two models (I have written a review for GA6400 already), so I will list the advantages of this series:1. Definitely better looking and more sleek. It's all black with a very thin black bezel around it. My initial impression was its the 42 inch screen, since the overall size is markedly smaller than GA6400 (that has almost an inch of silver bezel all around).2. Superior sound quality with 2.1 speakers. There is a small subwoofer in the back. I don't feel the need to run sound through my surround system.....its that much better.3. Seems faster and more responsive. There is still a lag when starting the TV but it's not always present and seems shorter than previous model. Maybe it has more memory built in, but theres no way to find out.4. Both TVs have fantastic image quality. I am not sure if I can appreciate any difference between the two.5. There is no NFC feature, although its mentioned in the TV description. That seems to have been copied from LG's other 2013 nonGoogle smart TVs. I have already been through the LV tech support on this one. Not a big deal though; but would have been cool to have.General advantages of Google TVs:Fantastic voice search capability.Full Chrome web browser.You can send a link from laptop instantly to the TV screen with Chrome extensions.Did I say, fantastic voice search! Love this feature.", "Date": "April 25, 2013"}, {"Title": "Loving this LG TV, Thanks Paul's TV and Amazon!", "Author": "Michael Lamberd", "ReviewID": "R3BSI30IZBLDES", "Overall": "5.0", "Content": "I was considering getting the GA6400 before finally deciding that I would step it up for the 240hz model since it's cinema screen was much more impressive and it's design is more pleasing in my opinion. It arrived well packaged and quickly from Paul's TV and I even got a free 2 year extra warranty from them to go with it. I love LG's passive 3D, it works just as well as the active even though it's not full 1080p on 3D modes. I usually side with Samsung products but both LG and Samsung are Korean competitors that have been doing well this year. Samsung has active 3D and most of their TVs are assembled in China while this one and the GA6400 my parents own are assembled in Mexico. Google's operating system is very android like in many ways as expected and the magic remote with qwerty is something I enjoy using when networking. I love the TV and I wouldn't want any other when it comes to High quality LED/LCD.", "Date": "July 20, 2013"}, {"Title": "Cutting-edge Smart TV / Tech Geek's Paradise", "Author": "Robert Petrocelli Jr.", "ReviewID": "R2P6FFWNS5TEI5", "Overall": "5.0", "Content": "Cutting-edge HDTV technology. Flawless integration of Google TV, clever double-sided remote with QWERTY keyboard, very easy to sync with Set-Top Box (Verizon FiOS), works perfectly with 3-D LG Blu-Ray player, 3-D is much more immersive than I originally anticipated. The ONLY drawback is that this TV is more geared for hardcore tech geeks (like myself). People who don't follow technology may find themselves a bit lost in operating ALL of the features that make this smart TV so sweet. Beyond that, I'm 150% satisfied with the performance of this TV thus far (adding on the 5-year extended warranty also helps in terms of feeling secure). Highly recommend this TV to someone looking to take their television/movie viewing experiences to the next level.", "Date": "December 8, 2013"}, {"Title": "LG TV collects your personal info", "Author": "M. Shimoni \"Latin music fanatic\"", "ReviewID": "RQ2UTV181F88W", "Overall": "1.0", "Content": "I want only to comment about the end user agreement that you need to agree to in order to be able to use the network connectivity and USB sockets.Unless you agree you will not be able to use them. Once you agree, LG collects all the info the TV can collect. It is not just your channel usage - it also grabs and transmits to LG anything you may have on your USB drive you plugged in to watch some photos. E.g., if you have a copy of your tax return them consider LG partner to this info.This end user term (EULA) is not mentioned in the product description and is NOT available on LG's web site, such that you are faced with it once the TV is unpacked and set up, leaving you to return it if you don't like it. Obviously at your own expense and inconvenience.Avoid this and any other LG TV with the forced EULA.See (among many others) LG Admits Smart TVs Spied On Users [...].", "Date": "February 3, 2014"}, {"Title": "Really Nice TV", "Author": "D. Bezboruah", "ReviewID": "R2WWM8FQKVMA0F", "Overall": "4.0", "Content": "This LG 47 inch \"Google TV\" is one of the nicer TVs I have seen recently.I am using this TV solely using the internet sources (aka Netflix, Amazon Prime, Youtube, etc.).  I don't have a cable box or antenna hooked up to this.  The internet sources work great and with a fast internet connection, you forget easily that you're not using cable or satellite.  The TV software is fast and reliable, so you can pretty much eliminate the use of any external sources such as a PlayStation, XBOX, Roku, or Apple TV.  Though one notable app that is missing in the TV is Hulu Plus.  So if you rely on Hulu Plus, you'll probably still need another source to use that.  I am not a big fan of the mouse remote or keyboard, however.  I'm not sure I would recommend this TV for web browsing purposes, which is what it is somewhat marketed for.The image quality of the TV is bright and clear, with accurate color rendering.  The picture is sharp even when viewed at a pretty close distance.  Again, this is when using the internet sources.I only tested the 3D feature once for the purpose of this review.  The 3D effect does really work and \"pops out\" the image.  LG includes glasses with the TV, and the nice thing about them is they are not battery powered.  So you don't have to worry about replacing batteries, and you can get more glasses for cheap.  Personally, I am not a fan of 3D TV yet so I haven't used this feature since my one test.The only CON with this TV that I have found so far is that the automatic backlight adjustment is lousy.  The TV is supposed to automatically dim when you are watching in the dark, but mine did not.  One night, I tried watching a movie when I had a corner table lamp on in the room and nothing else.  The lamp was next to me, so it was still bright in the room.  The TV dimmed itself significantly to the point that I could barely see the picture.  Turning on the main room lights caused it to brighten up.  Turning OFF ALL the lights kept the screen very bright.  As soon as I turned on the corner lamp again, the TV dimmed once again.  I ended up turning off this feature in the settings.Comparing this with my other TV, a 2011 Sony 46NX720, the LG is mostly superior to the Sony.  I would highly recommend this TV.", "Date": "July 18, 2013"}, {"Title": "A few minor flaws but overall an amazing TV.", "Author": "Kevin \"Kevin\"", "ReviewID": "R3G771BU755X5R", "Overall": "4.0", "Content": "Update 10/17: This TV does NOT support Miracast (there is an error in the product information on the detail page)==============Pros==============- TV is very light and was very easy to wall mount- the bezel is VERY small, when this TV is wall-mounted it looks very slick and is pretty much all screen!- amazing crisp picture, deep blacks and vibrant colors- The GoogleTV software is good enough to replace the need for my Roku. It streams Amazon Instant Video, Netflix, Pandora perfectly.- I use this TV with an HD Antenna. I love being able to browse what shows are on without needing to flip through the channels- it's even organized by category/genre.==============Neutral==============- Google TV software is very mediocre. While it does do everything my Roku can do, I was expecting a lot more! The software can definitely be improved, so I hope Google is actively workign on improving GoogleTV to make my TV even better.- The 3D with the passive glasses was better than I expected but it did give me a minor headache after watching for a while. My 3D tests were based on the free streaming 3D content as part of the Google TV softwae.- voice function is cool but not very practical, using the remote/buttons is faster and easier- Setup is a long process.... But, thankfully you only need to do this once!==============Cons==============- The WiFi card is very weak and didn't work for me. I live in a condo and from my laptop and iPhone I can usually see 10 or so other WiFi networks. This has never been a problem for me once connected though. My TV is about 15-20 feet away from my wireless router and my other devices get full signal where my TV is mounted... While the TV can see my WiFi network and connect,  it constantly disconnects making it impossible to stream anything. My solution was to buy the NETGEAR WNCE2001 Universal WiFi Internet Adapter. The little box which is velcroed to the back of my TV and powered by the TVs USB port picks up my WiFi signal and outputs it to the ethernet port on the TV. So, to the TV I am connected via a Wired Internet but I don't need to run a wire from my router. This solved my WiFi issues.- Product detail page claims \"HBO GO\" but note that this is in the Chrome web browser and not as easy and seamless (need to sign in periodically). Note: if you have comcast which does not allow HBO Go on Roku or other connected tvs, you can actually use it on this TV since it goes through the web browser.- Google TV is a little slow and laggy.- Remote ergonomics are pretty bad and I find it hard to use the remote in the dark without accidentally pressing the right buttons.- The IR blaster works well to turn my AV Receiver on and off. To do this, I need to hold function and another button on the remote keyboard. This is impossible to do in a dark or dim room and I could not find any way to automatically power the receiver on when I turn the TV on.- Mouse pointer is pretty hard to use and accurately control (compared to Nintendo Wii which has a similar interaction).", "Date": "June 27, 2013"}, {"Title": "I was going to give it 4 stars...", "Author": "G.R. Medina", "ReviewID": "R2CIDRXWG3F6XE", "Overall": "5.0", "Content": "I was going to give it 4 stars because it didn't have an Amazon Video app that you could install from Google Play. Just yesterday, all of a sudden it updated and I got the app. The remote is great, the TV looks AMAZING. I have the TV hardwired to my network so I'm not using WiFi (so I can't comment about that) It plays MKV files from my network NAS. I am very happy with this purchase and have it mounted on the wall. Also a plus is the optical out (because I use google music.)", "Date": "June 21, 2013"}, {"Title": "Excellent TV after I returned the first", "Author": "Todd", "ReviewID": "R1ALWTB3FX2GKL", "Overall": "5.0", "Content": "I had to return the first one.  The picture just wasn't good quality at all.  I had a Samsung, but after going through two Samsung TV's in 7 years, it was time to try a different manufacturer.  The picture on this LG just was not close to Sumsung's picture quality even with constant adjustments.  Then after about a week, it completely malfunctioned and I had to return it.  The second TV though, has been great!  Picture quality is excellent, sound is excellent and all the google features make this TV the best I've had so far.  My point is, these TV's are brand new at this point and may be suffering some initial production challenges and in need of some firmware updates etc.  I'm glad I stayed with the same TV as I can say, so far, this is the best TV I've had.  I just hope it last more than 3 years as it appears to be the problem many are experiencing with Samsung.", "Date": "June 9, 2013"}, {"Title": "SIMPLINK / HDMI-CEC Not supported", "Author": "Amazon Customer", "ReviewID": "R3B7TYF46H19XJ", "Overall": "3.0", "Content": "This TV is great however there are a lot of misinformation from LG; on their website LG says that it support SIMPLINK (HDMI-CEC) which allows you to control an external device such as a bluray player with the TV remote (if the device supports HDMI-CEC). This is a great common feature that most TVs support nowadays. This TV does not support it, LG website says it does but talking to their technical support people will tell you otherwise...If this feature is something you want to use, stay away or wait for an update that might enable it...", "Date": "June 3, 2013"}, {"Title": "55ga7900", "Author": "Jeff Murray", "ReviewID": "R3SRZYFTTAEIL4", "Overall": "4.0", "Content": "I had BB price match the newest 55 inch LG listed here.  I ordinarily have no problem ordering from Amazon but I wanted the option of immediately returning this purchase if I was not satisfied with the picture/feature set/quality since this is my first LG TV.  I have only the Onkyo txnr-818 as an input to the TV-everything goes through the AVR (laptop/360/PS3/Roku/etc).  So far I have tested the laptop input/resolution and am satisfied with the picture quality.  I had to use the TV's \"scan\" setting to get the laptop picture (1920x1080) to display correctly on the TV.  I primarily listen to music via 3tb HDD>Laptop>818>TV and am very happy with the performance of the TV within this setup chain.I watch little TV, except streaming video via Netflix and the other usual suspects when time allows.  I'll update my review of this model as I have the time to explore its features but I do have a few first impressions since setting up the TV on 04/05/13.  It is wall mounted so I cannot speak to the stand-it is still in the box.My initial impressions are, in no particular order:-This is a gorgeous TV.  Very sleek design with a tiny bezel.  My only complaint here is the bezel is angled outward and not perpendicular to the screen.  Personally, I would have preferred the latter, if only to make the bezel appear smaller.  I can, however, live with the angled bezel...-The picture out of the box (vanilla) is nice but a little dark.  I'll play with the settings and see if it can be improved.-I noticed a little judder with a slow moving pan via Roku (a black and white cut scene) so I suspect some picture adjustments are required.-The small black remote will take some getting used to.  Buttons are tiny and some of the text is in red, making it difficult to read.  The keyboard on the back of the remote is easy to use but suffers from the same red text issue.  Yellow or a bright green would have been a better color choice, especially in a dark room.-the Google interface is very familiar since I have android tablets/phones.  I am not sure how much use it will get since I have my laptop connected and do most of my work/play through the Opera browswer on it.  But I will test it out and have some comment(s), one way or the other.  Signing in/or up to Google is part of the initial TV setup.  Android ver. 3.2 is the OS on the TV.  Under Google options is the ability to install 3rd party apps via check box like one can on a phone or tablet.  Several Google apps had updates available the day after setup.-The screen does reflect a little more light than my older Toshiba LCD.  To minimize the reflection I rearranged my entire living room in advance so I could place the TV on a better suited wall.  So far so good...-Gaming (no comment yet)-DVD playback (See below)Edited 5 May 2013DVD playback:-I used, \"The Hobbit\", as a gauge for picture quality (PQ).  The content was very clear and bright with no stuttering, jaggies or juddering.  The TV PQ was set on \"Standard\".  I noticed no obvious flashlighting or blooming during the dark scenes.  I am very satisfied with this TV's performance so far.", "Date": "May 5, 2013"}, {"Title": "Brings \"Getting the most bang for your buck!\", to a whole new level!", "Author": "Kimberly Ann Salen", "ReviewID": "R3RP6FP4O13GOJ", "Overall": "5.0", "Content": "Before buying this tv I didn't know anything about how important hertz, aspect ratio, resolution or back lighting etc is in order for you to wind up with truly high quality TV @ the end.  I got plenty of advice from my TV savvy son. Then compared prices & quality, read countless reviews & even more research on what the ideal specs should be. I ultimately decided on this model & could not be more thrilled with it! We've had it approx 3 months now & are still in awe. Whether we're watching 2d or in 3D mode we are still finding ourselves commenting on how amazing the picture quality is & of course patting myself on the back for it! Even if you were willing to spend 2, even 3 x more money on a new 3d tv. You'd honestly be hard pressed to find anything better then this. To sum my review up- This tv has all the necessary ingredients that's needed in order to have a high quality tv/movie theater experience right in your own home!  And all at an amazing price to boot! It brings the expression \"getting more bang for your buck\" to a whole new level! If your in the market for a 3d tv & you buy this one. I guarantee you won't have a drop of buyers remorse. You just might wish you knew me so you could pat me on the back too is all! Lol!", "Date": "March 16, 2014"}, {"Title": "Great Tv", "Author": "Ibrahim", "ReviewID": "R1X2VVIGXYAI14", "Overall": "4.0", "Content": "Great Tv with intuitive features and picture. Sound is good but would have been better if placed in front of tv rather than behind it.", "Date": "January 8, 2014"}, {"Title": "My Christmas Present Amazing", "Author": "HolladayMTM", "ReviewID": "RYKDENLDMDXPV", "Overall": "5.0", "Content": "I just recently bought this well my girlfriend bought it for me but we got it from Best Buy it had 100 off for clearance 10% off additionally for not having a box for it and 142 off for not having the magic remote. Got it for 1116 before tax plus a 5 year warranty came out to 1466. But they through in 4 additional pairs of 3D glasses and several free cables and also a regular lg smart remote. Tons of batteries and some other stuff. Also called LG and they are sending a free magic remote.Overall I love the picture and audio quality is amazing. The 3d in my opinion is better than the theater movies I have watched. The only things I dislike are no audio RCA out. There is a 3.5 mm out aka headphone out. But I will update this after I get the remote in and have some time with it.", "Date": "December 19, 2013"}, {"Title": "great television", "Author": "Michael Chesack", "ReviewID": "R37GY0UOHP1UJX", "Overall": "5.0", "Content": "Have had this tv for 1 month so far it has been great, excellent picture especially in blue ray the 3D feature is great as well, would recommend.", "Date": "October 6, 2013"}, {"Title": "Love Both Our LG TVs", "Author": "ladyfingers", "ReviewID": "RIYJMF0Z06JR2", "Overall": "5.0", "Content": "This is the second LG TV we've gotten through Amazon.  Both TVs arrived in excellent condition and presented no delivery problems.  Setting up the LG 47GA7900 was easy, although we didn't follow manufacturer instructions that said to lay the TV on its face while installing the stand.  Not wanting to put any pressure on the LED-LCD screen, one person held it vertically on one side while the other person screwed the stand into the back of the TV.  The 47\" TV only weighs 32 lbs and is easy enough for two people to handle safely.  The stand is attractive and provides solid TV support.We connected a Charter cable box (manufactured by Motorola), a Sony Blu-Ray player using HDMI cables and a Samsung sound bar using an optical cable. This package includes an \"IR blaster\" cable with two IR transmitters that need to be positioned in front of the components' IR receivers.  The IR blaster allows you to use the LG remote to access some of the functions of the components.  We placed one IR blaster transmitter in front of our cable box and the other in front of our Blu-ray player.  We were never able to control the Samsung sound bar using the LG remote.  The sound bar works fine, we just need to use the Samsung remote to control the volume and sound bar features.  The TV easily found and connected to our home wireless network router.The gesture wii-style function seems to move the cursor arrow in unpredictable directions, so we try to use the arrow cursor keys for screen navigation whenever possible.  Finding and adjusting settings takes some searching.  After changing the screen brightness and setting the screen size ratio to automatically sense and adjust according to the given input signal format, we now have a beautiful picture.  The qwerty keyboard on one side of the remote is great for entering words or URL's in the Google Chrome browser.  Unfortunately, LG chose to write some of the functions in red font on small black keys that are next to impossible to read (lights/magnifying glass help).  The voice search is interesting and useful, but not always accurate.  For example, it kept finding \"Prime\" this and that when we clearly and repeatedly enunciated John Prine.  That doesn't happen too often, though.  Its quick ability to search TV and web for basically anything we want more than makes up for a few idiosyncrasies.  The remote works well for controlling the TV, but the IR blaster is a poor substitute for either the components' manufacturers' remote controls or a well designed multi-component remote control like Logitech makes.The picture quality of this TV is absolutely beautiful in 2D or 3D.  The built in speakers are adequate but an additional sound system is recommended for better theater quality sound.  The home screen is easy to navigate, but watching how-to videos on LG's website for a more complete picture also might help.The Google TV platform has many applications for gaming and access to movies and TV programs that mostly require subscriptions to view.  Our Google Chrome TV experience is much different than using the computer web browser on our PC.  We are still exploring the many ways to access content and figure out what our family likes best.For those who aren't ready for or don't want Google TV features, we highly recommend LG Cinema Screen 55LM7600 55-Inch Cinema 3D 1080p 240Hz LED-LCD HDTV with Smart TV and Six Pairs of 3D Glasses.  This TV has the same beautiful picture quality, is cheaper and offers many similar features.  Because it lacks voice and keypad controls, the search process is a bit slower, but nonetheless it's a wonderful TV.  Don't be afraid to buy via Amazon--we were initially hesitant to get costly electronics through Amazon, but each transaction has gone perfectly from start to finish.", "Date": "June 8, 2013"}, {"Title": "Amazing TV , really top quality", "Author": "KJ", "ReviewID": "R2O6850YM68O28", "Overall": "5.0", "Content": "I've had the TV for a few months now and couldn't be more pleased. The 47\" screen is perfect if you want a large screen but not something that will dominate a medium sized room. The minimalist look of the bezel gives it a popular modern look and the lighted logo on the bottom adds a little finesse. The Google TV integration is a very nice touch and after the initial setup is fairly user friendly and intuitive. The screen quality is top tier and probably one of the best edge lit led screens you will find. LG packed a whole host of customizable options to tweak the picture to your liking and presets for those who would rather use one touch picture and sound tuning. Internet and android os works well and adds many features to this smart TV. Plenty of input options, both wired and wireless. The sound quality of the stock speakers are the best I've heard on a large flat screen TV, they're at least comparable to the older box style TV speakers that have depth to the audio and not weak and flat sounding like most modern flat screens. The remote really makes this TV with its built in mouse pointer, full qwerty keyboard and voice input. The pros of this TV easily out weigh any cons. Some of the cons I ran into was I wish the mouse pointer had an option to adjust amount of time it stayed on screen before rehitting the call button for it. This however can be remedied by using a wireless mouse with TV if you wish. QWERTY keyboard should be background lit and better choice of color for special key characters used, you do get used to it in time though. You have to use IR blasters to sync remote with up to two other devices. It will run about 90% of what my cable box is capable of doing which is great, but the missing 10% can be annoying. I can't get my Polk Audio sound bar to either sync with my TV or remote. So I have to adjust it separately from tv audio. This is just a compatibility issue between this model of TV and this model of sound bar, most separate audio systems shouldn't have this issue. One other thing is the lack of very many apps in the android market for this operating system yet. I do feel this will change as time goes on however. Again however, these are minor annoyances at worst and the pros of what this TV is and does is greatly out weighed by these pros.", "Date": "September 18, 2013"}, {"Title": "Lots of bells and whistles but not the right ones (for me)", "Author": "gadget-o-holic", "ReviewID": "R3MYCAEI7YF6T9", "Overall": "3.0", "Content": "I bought this TV at Best Buy and ultimately ended up returning it.  I'm came from a 1080p Epson Projector that projected on to a 100\" screen.  I had decided that I wanted to try the newer LED tv's out since we were moving anyway and did not want to bring the projector with us to our new home.I primarily looked at two TV models when I was looking in to TV's, the Samsung UN60F8000 and the LG 55GA7900.  I actually bought and tested both of the TV's out.  Below is a short Pros/Cons review and conclusion on both TV's.LG 55GA7900-------------------------Pros- Price... much cheaper than the F8000- Google TV integration for Apps (apps to enable airplay/etc)- Decent picture quality- Awesome remoteCons- No ARC capability for HDMI audio passthrough- Plex app does not play 3D SBS files- Not all apps in google play store are available- Google TV interface for Tivo integration not the bestSamsung UN60F8000-------------------------Pros- Awesome picture quality- Innovative, if somewhat limited, remote (would like more dedicated buttons and a QWERTY keyboard- ARC capability!!! Can use single HDMI cable to pass 5.1DD and DTS audio back to receiver from apps like Plex, Amazon Instant Video, and Netflix- Built in Skype and camera- Built in Plex app supports 3D SBS files natively!!!Cons- Limited app selection (though the essential apps are there - Plex, Skype Amazon Instant Video, Netflix)- Price... would have liked it to be a few hundred cheaper- ARC setup is not intuitive and there is limited documentation on how to get it set upCONCLUSION-------------------------After testing both TV's I ended up keeping the Samsung UN60F8000.  Although I was impressed with many of the bells and whistles that the GA7900 provided, I ultimately did not find many of the features to be useful and I found many of the apps were a little buggy and the interface was not entirely intuitive.  I really only use my TV to do 2 things... watch TV and watch movies from Amazon/Netflix/Plex.  Everything else is really unnecessary for me as I find that browsing the internet and things like that are better suited for a tablet or laptop.  Overall, the F8000 seemed like a better TV for my purposes, plus I really like that I can use HDMI ARC to send 5.1 and DTS signals to my receiver when watching movies through netflix/amazon or Plex.  The final plus for me with the F8000 is that the Plex app is much better IMO than on the GA7900.  The plex app on the Samsung F8000 comes pre-installed and can play 3D movies natively whereas the GA7900 using the plex app could not play the same 3D movie.  I couldn't be happier with my TV choice... if you use plex and need HDMI ARC the F8000 seemed to be one of the few TV's that could actually send 5.1 and DTS signals over the ARC interface.", "Date": "August 8, 2013"}, {"Title": "false advertising", "Author": "SJ", "ReviewID": "ROJIW9NIWOEQC", "Overall": "2.0", "Content": "Amazon listed Miracast and NFC as features of this otherwise nice google tv...LG also lists those features for this model tv.Having owned, struggled with, and then returned, this tv, I must say it has neither Miracast nor NFC... (i own a nexus 4, so I could have used both features)I spent some time researching online and contacted both LG and amazon.  I received no answer.It's such a shame, with google tv and miracast, this product could have been great... without miracast it severely limits the possibilities.Maybe with a software update the feature could be enabled, but I wouldn't hold my breath.", "Date": "July 17, 2013"}, {"Title": "Awesome TV with unlimited viewing!!", "Author": "Alex v.", "ReviewID": "R6GBWVGXRWIC3", "Overall": "5.0", "Content": "This tv is definitely ahead of its time! There's nothing u can't watch on this, if u don't have a channel you want to watch just simply go online and stream live tv. It's so hard not to miss out on sporting events now! Also the menu on this tv is so amazing it's like a giant tablet and it's so easy to find things.", "Date": "November 22, 2013"}, {"Title": "LG 55 inch", "Author": "Tim Bell", "ReviewID": "R1DRATZ9JV0GH9", "Overall": "5.0", "Content": "So far the tv works up to all aspects. We haven't tried all of the features yet, but time will tell,", "Date": "May 19, 2014"}, {"Title": "Great Picture! 3D is Awesome!", "Author": "M. Holley", "ReviewID": "RLK3BJ47N3CD0", "Overall": "4.0", "Content": "I'm still learning all the features of this gorgeous TV.  The image is spectacular!  I love the edge-to-edge picture. I was concerned about the increased size, but not having the \"picture frame\" styling made it comparable to the dimensions of the 46 inch TV it replaced.  The sound is quite good for a flat-panel TV. (Sound purists will want a separate speaker system.)I have not yet tried all of the apps that came embedded with the TV.  The minimalist documentation (\"attach this here\") gives me no clues about what is possible on this hybrid TV cum computer.  I have not yet found a way to play my MP4 files, which I was able to do with my previous TV. Very disappointing.  There are places to plug in a USB stick, but the system doesn't recognize it as an input device.  Maybe one of those many apps?  Sure would like to have better documentation!", "Date": "April 11, 2014"}, {"Title": "The best TV ever.", "Author": "Dawid  Broda", "ReviewID": "R262EHFHDGAFK9", "Overall": "5.0", "Content": "We did not even had an TV signal connected for moths. Easy to use apps and browser 100% substituted the Cable or Satellite TV set", "Date": "April 1, 2014"}, {"Title": "Great TV", "Author": "Julio R. Lopez", "ReviewID": "R4V4UMUY5Q9VD", "Overall": "5.0", "Content": "The picture quality is excellent.  I am still learning how to use the apps but if you have an android phone it is very intuitive.", "Date": "March 3, 2014"}, {"Title": "I love this LG", "Author": "K. Cox", "ReviewID": "R1A9FZPA87CP4S", "Overall": "5.0", "Content": "This is an amazing TV, Love everything about it. The picture is sharp, and the 3D is truly spectacular! WOW!", "Date": "February 21, 2014"}, {"Title": "It does what it says...", "Author": "M. Kelly", "ReviewID": "R3DMF3DUK2UKJ0", "Overall": "4.0", "Content": "For the amount of money you spend on something like this I would expect more user friendly interfaces. The \"magic qwerty\" key board remote is just awkward. Worst thing (for me), is that Hulu Plus is not an installed app. The menus are overly intricate to easily get to what you want quickly. All the other things you have read are true, great screen, 3D is great if you want to use it (preloaded content is just okay), and sound is good, some reviews said it was bad, but I don't hear any problems.", "Date": "February 14, 2014"}, {"Title": "******* No MIRACAST and NFC Features available in this Google Model ******", "Author": "karthik", "ReviewID": "RJ9R9QO4AST6D", "Overall": "3.0", "Content": "Be Aware,1. There is no Miracast and NFC available in this Google TV model after spending $1099. Requesting Amazon to remove this from the site's \"ADDITIONAL FEATURES\" which has misguided me.2.Crackle App - Free Movie channel  has been removed and cannot find it in Play Store via TV.3.Though Chrome Browser is displayed in the big Screen it display small mobile phone's compatible browser.4.Flash is not supported.will be continued ...", "Date": "February 4, 2014"}, {"Title": "I would buy this again", "Author": "Gert Walter", "ReviewID": "R3VP7SYBPFHY8X", "Overall": "5.0", "Content": "After we had to return our first one that came damaged and unusable, the new one is great.  User friendly, easy to set up, works better than promised.  Only quibble is that the qwerty keyboard would be much more functional if back lit.", "Date": "January 27, 2014"}, {"Title": "Great Full featured smart TV", "Author": "Jason Turner", "ReviewID": "R3O93C5WHW7ABZ", "Overall": "4.0", "Content": "I was deciding between this model and a comparable 55 incher by Samsung, and pulled the trigger on this one due to price.Pros:Appearance-  The slim bezel and the included stand are very nice. The glowing LG logo at the bottom is a nice touch too.Picture quality-  Amazing picture quality for the most part. Watching Blu-Rays and HDTV channel is a very crisp and clear picture in comparison to other models in this price range. There's a large amount of fine tuning you can do to adjust the picture to your liking if you have the patience, but if you're like me the picture wizard is the way to go. The only time I saw a dip in picture quality was when watching netflix on the built in app, but I think that can be fixed with a software update in the future.The Remote-  At first I thought this remote would be gimmicky, but after having this TV for almost 3 months and realizing what the remote can do, I stand corrected!  The remote is a perfect companion to this TV; I find myself using the voice commands and the qwerty keyboard more and more.Smartphone Connectivity-  I have a Samsung Galaxy S4 and it works flawlessly with this phone.  You can pick a YouTube video from your phone and instantly send it to the TV for your viewing pleasure.  There's also an app in the Google Play Store that allows you to use your phone as the remote, without losing ANY of the features of the included remote!Cons:Built In Apps-  Granted, there are a bunch of apps already installed on the TV.  However, most of them either take too long to load or are a pain to navigate.  As mentioned before, the netflix app has some picture quality issues and is sluggish when starting up tv shows and movies.  The Youtube app doesnt have any sluggish buffering, but searching for videos to watch is a nightmare. This is why I use my phone to search for videos, and then send the video to the TV from my phone.Sound Quality-  Kind of a given. most flat panel TVs dont sound that great cause of the small speakers.  This one isnt any worse than the rest, but definitely get yourself some external speakers.Pro AND Con: 3DI didn't buy this TV for the 3D capabilities but I have bought a few 3D blu rays to check it out.  Firstly, the 3D quality on Blu-rays is pretty awesome. You can adjust the depth to your liking, and on the most extreme setting some images really pop out.  The included glasses are super lightweight, making them easy to wear for long movies.  I did notice some crosstalk while watching movies, especially using the 2D to 3D mode.  That's why I knock the 3D a little bit b/c the crosstalk can be very distracting.", "Date": "January 25, 2014"}, {"Title": "Everything's good so far", "Author": "Kishan Jeter", "ReviewID": "R1K1R76U0QCFFL", "Overall": "4.0", "Content": "Was able to purchase this tv brand new from Micro Center for $899 and so far so good! I'm not a fan of the IR Blaster feature where it attempts to allow you to control other items connected to you tv. I don't like that it requires an analog cable that sends some type of infrared signal or something?The Google TV remote control is really cool. I'm more excited that I was able to get it at great price.", "Date": "September 7, 2013"}, {"Title": "LG 55GA7900 - Happy with my choice, but.....", "Author": "David G. 12/24", "ReviewID": "R3B3YYOKDT841D", "Overall": "4.0", "Content": "I purchased this TV at Best Buy for the same price advertised here on Amazon. I would have bought it on Amazon, but I didn't want to wait to get the TV and I'm leery of delivery services for high end electronics.I've had the TV for about 3 weeks and I'm very happy with my purchase. I researched buying a new TV for about 2 months and after countless visits to various websites, after reading endless reviews and after the umpteenth visit to my local Best Buy to look at the models that I had settled on researching I was down to the LG55GA7900 and the LG55LA7400. The deciding factor was the price. The Google TV was $200 cheaper and apart from the Google TV feature both sets are practically identical.The TV was a breeze to set up and looked beautiful straight out of the box! I fiddled a little bit with the picture settings and got it pretty close to where I want it but I gave in and bought the Disney WOW calibration DVD/Blu-Ray. Be ready to spend a couple of hours calibrating your TV because this tool is pretty detailed, even for novices.I've tried using the smart TV features and apart from the Netflix app most of the apps are ones that I'll probably never use. The HBO Go app is really a link to the website and it's not that great to use. All in all I'll stick with my PS3 for stuff like that.3D:The passive 3D on this set is amazing. I know alot of people don't care about 3D and I know there isn't that much 3D content available out there but if you purchase the 3D version of a Blu-Ray you will not be disappointed. I tried the 2D-3D conversion and it's a little gimmicky but it's kind of cool for sports. The 3D for gaming on my PS3 blew me away. I felt like I was playing old games for the first time!Magic Remote:I'm not a fan of the magic remote - the qwerty keyboard on the back is difficult to use in the dark - I'm probably going to purchase a universal remote.Picture:The picture on this TV is amazing! The options for adjusting the picture are plentiful.Sound:Definitely invest in a sound bar or a good surround sound system.WiFi:The TV comes with WiFi, but after 3 or 4 days it lost the signal to my router and I kept getting the message that it couldn't acquire a signal because it was too far from the source. My router sits 10 feet away from the TV. If you can run an ethernet cable I would suggest doing so - save yourself the headache.I am overall very pleased with my purchase aside from a very few minor things. For $1500 this is the best 3D LED TV on the market!", "Date": "September 5, 2013"}, {"Title": "I love my new 3D TV", "Author": "Amazon Customer", "ReviewID": "R3HNNUDL2BMC6M", "Overall": "5.0", "Content": "What a wonderful purchase this was.  I love how this tv works, love the google on the TV.  Just an awesome TV and I would recommend this TV to anyone thinking of purchasing a new 3D set.  I love LG and their technology.", "Date": "September 2, 2013"}, {"Title": "3d TV", "Author": "Brian R.", "ReviewID": "R20Z3THN8I1ROG", "Overall": "5.0", "Content": "Amazing TV.  Cool remote.  Easy to set up and use.  Has great apps but lacks Hulu Plus.  Also adapts really well to most formats on USB, external hard drives and home networks via Smartshare.", "Date": "July 23, 2013"}, {"Title": "Probably the best value HDTV in the 2013 line; but what's with the pricing?", "Author": "dookerJ", "ReviewID": "R3GLGKZMYKJXV5", "Overall": "4.0", "Content": "Was just getting ready to buy this tv when the price jumped 100$+ in a day. Perhaps it was on sale, but still... The pricing seems strange; it's now just a couple of hundred dollars off from the 55\" model. Makes no sense.At any rate, this seems to be THE TV for 2013. Everyone including Vizio got rid of TruLED (local dimming) even on higher models, and QWERTY remotes are a must on a smart TV; those were ditched in Vizio and many other manufacturers.I loved my Vizio XVT series(about 3 years old; what happened to TVs in 2012-2013???)-true local dimming and slide out qwerty Bluetooth remote, but it's all been done away with in 2013, even on flagship models. Shame.So here we have 240hz, true local dimming, a kickass qwerty+motion remote, and a Google TV layer to boot.... For the \"semi-budget\" range this seems to take the cake unless you're in the Plasma camp.To me, this one is the value king for this year, where the Vizio XVT line was several years ago.Just wish they'd get the price back down to where it was before I put it in by cart.  It continually swings as much as several hundred dollars; it's as though they can't figure out how to price it.", "Date": "June 16, 2013"}, {"Title": "55GA7900- Great Deal so I made the leap.", "Author": "JPleasant", "ReviewID": "R1GFWS6VT4TTSD", "Overall": "4.0", "Content": "I purchased the UN55F7100 from Best Buy and had it for about a week. I paid $1599 for it. I heard about the 55GA7900 on sale at MicroCenter for $999 and thought there was something up, especially since the TV is $1599 everywhere and now $1899 on Amazon. I had no problems with the Samsung. I returned it because LG is a great brand and saving $600 bucks is worth a try. I absolutely love the picture. It is a great mix of the dark tones of a plasma without losing the bright clear effect of an LED screen. I am a huge Samsung fan and I feel the LG picture surpasses Samsung. The picture is a five, but the Google TV is about 3.5-4 and thats probably because I'm just not a fan of Google's system. The Apps work well and after I installed a few updates, things got better such as response time etc. I am having a few issues pairing my Samsung sound bar so that I only use one remote, but I'll call LG about that. Having the Qwerty remote is so much better than I expected. I barely calibrated this TV as it was damn near perfect out of the box. GO TO MICROCENTER WHERE EVER YOU ARE BEFORE THE SALE ENDS. I asked the sales guy why so cheap and he said they bought way too much and that is actually company wide. I read a forum online and the sale appears to be everywhere. The great price also allows you to buy the warranty for $170 or $270 with screen protection.", "Date": "September 10, 2013"}, {"Title": "Beware.  Falling out of love very quickly ...", "Author": "Deirdre Mcdonnell", "ReviewID": "R2PK0VY9Z4DOWS", "Overall": "1.0", "Content": "Bought this with a sound bar at Best Buy. Have it three weeks. Totally impressed for the first few days.  Then the downhill slide began.  So far it has shut itself off randomly and had to be completely unplugged to restart. It also now has a black stripe appearing down the middle of the screen, that only goes away if I turn it off and on again, always with fingers crossed that it will actually come on. I have also been unable to get the 3D function on the remote to work.  Fortunately I am within the return period so off I go to the store today to get them to come get it. I am not sure if I will replace it with another LG since there seem to be a lot of complaints on other forums about the reliability of this brand.", "Date": "August 31, 2013"}, {"Title": "55\" LG GA7900 - Worth the price ?", "Author": "Watch Fan", "ReviewID": "RAEWT2M82PZQF", "Overall": "4.0", "Content": "Well, here it is, in my family room, the most hyped 55\" LG GA7900. After 2 days, the screen went dim a few seconds after I turned it on, I tried on different channels and the results were the same. I finally changed my surge protector , and the TV screen went normal again. Hope this is the only reason because returning this thing to Amazon is a big chore for me.Now for my evaluation of this TV, as a non cable user, I use  aerial antenna only :CONS:  1.  Skin tone is harsh and posterized even on popular HD stations: ABC, CBS , NBC , etc. ( But people on Samsung TV screens look plastic too).  2.  Pointer (Gesture) is jerky, not smooth like my laptop mouse.  3.  Voice command only allows you !/2 second to respond otherwise it will ask you again (?).  4.  Lacking bass sound.  5.  Only PIP is available, a small screen on the upper right corner. SPLIT SCREEN could have been an awesome added feature for Sunday games. I have this feature  on my old 2005 flat panel TV.PROS: 1. Wow, Google TV- Apps galore! No need for expensive cable fee for me with this TV.  I stream movies, sports, etc., and save cable outrageous fees.  2. Two sided remote control is very functional, but LG should redesign the keyboard for Braille bumps and glow-in-the-dark letters/numbers.I'll be back here to add more stars (or deduct) if this TV will prevail/stabilize like my old LCD TV.", "Date": "May 11, 2013"}, {"Title": "HORRIBLE software", "Author": "Edward Scott", "ReviewID": "R2O0XB4KR6POFK", "Overall": "2.0", "Content": "I purchased this TV three months ago. It was my first TV purchase. I am not happy with it.It was a smart TV or nothing for me. On paper the GA7900 looked great. Turns out it doesn't support everything they claimed, apps in general have very limited support for Google TV, the software is buggy, and the support is lousy.I'll detail three issues to support my rating. Any one of these would have been a dealbreaker for me if I had known ahead of time.HBO Go is an essential app for me. At the time I purchased both Amazon and LG claimed it was supported. At the time of writing Amazon still claims this. LG has since removed that detail from their site. If I try to install the app from the play store it claims my device is not supported. I'm not able to use the HBO Go website as it requires flash. I called LG support to inquire about this. The support guy claimed that HBO Go is a service not an app. (It was at this point that I got a VERY bad feeling about owning an LG product.) I very politely explained to him that, while it is a service you must subscribe to, there is an app with which you can use the service, and I was looking at it in the play store that very moment. The LG support guy couldn't offer an explanation. A separate email to LG support was responded merely that they are hoping HBO adds back support in future.I was pleased to see that I could install a Rhapsody app, but after some time ran into a problem where, while watching a movie on Amazon instant, if I unpause a movie by pressing the play button then Rhapsody also unpauses whatever music I was listening to earlier that day (even if the TV had been powered off since!). This is quite an alarming bug. I reported this to Rhapsody, who responded letting me know that LG Google TV is no longer supported. (LG TV is supported, but that is a different product.) Fortunately I can avoid this by unpausing movies by pressing the pause button a second time, but I am discouraged by the fact that Rhapsody abandoned support for this product.There is a live TV option that I had to enable in order to adjust some of the display settings. (That seems odd, right?) Since I don't have TV hooked up to it, I only stream from the internet, when I try to view live TV it shows the LG logo bouncing around the screen with a \"No signal\" message. On a couple of occasions I have been watching something on Netflix and that no signal bouncing logo appeared over the top of my video. Can you believe that?!? I had to power the TV off and on several times for it to stop. I reported this to LG support (during the same phone call in which I asked about HBO GO support). LG support told me I was just to restart my TV if that happened. That was all they offered. I asked if they were going to do anything to stop this happening. They said they could forward my request to engineering, who would follow up with me. I asked them to, but never heard back from them.There are some other minor gripes. Like, the Tune In app does not support this TV, and my favorite radio station won't work from the Tune In website on this TV. That wouldn't have stopped me buying, but is frustrating nonetheless.The hardware is fortunately pretty good, at least to my novice eyes and ears, so not all is lost. I can rely on my trusty Blu-ray player for a software-free TV or movie viewing experience. I am considering purchasing a Chromecast to get HBO Go support - as dumb as that it sounds to use a Chromecast on a Google TV, it may be necessary.", "Date": "February 23, 2014"}, {"Title": "Great picture and audio quality.", "Author": "DS", "ReviewID": "R1O77037FO56XQ", "Overall": "5.0", "Content": "I have been impressed with the picture and audio quality of this LG TV. The integrated GoogleTV feature is a bonus. The remote feels strange at first but you get used to it.", "Date": "July 2, 2013"}, {"Title": "Takes some configuring, but then it's perfect", "Author": "Ivy", "ReviewID": "R3ESXEP3Z6Z1OS", "Overall": "5.0", "Content": "For the image quality, I give it a 5.  You can have it dim in a dim room, which I find easier on the eyes.  It shows a crystal clear picture, and glorious 3D.  It's easily movie theater quality.For gaming, it supports dual screen with separate glasses LG Electronics AG-F310DP Cinema 3D Dual Play Gaming Glasses (2 Pair).  With this both players see their game full screen, in full HD.  I highly recommend this accessory for the gamer.The sound system is worth 5 stars if you set it up exactly right.  You can set the sound for wall mount or stand.  You can normalize the audio levels for extra clarity on the dialog.  There is an option to automatically sync the video to the audio.  The last two are turned off by default and you'll have a superior experience if you turn them on.  There are a lot of options, and it's worth the trouble to spend a little while playing with them until you get the configuration that works best for the acoustics of your room.  The TV is capable of excellent sound out of the box, but truly amazing audio once you have it turned just right.The TV is exceptionally clever at points.  ESPN 3D broadcasts on a top bottom split, so if the TV isn't in the correct mode, you see two images one above the other.  HBO on Demand 3D does it left and right.  With other TVs I've seen, you need to use the remote to tell the TV that it is supposed to be 3D and which mode it is being broadcast in.  This one initially shows the split screen, but figures it out and makes the switch itself in less than a minute.The remote is the weakest element.  You can use the pointer (think wii mote), and it has a nifty \"shake to center\" feature.  You can use the up and down arrows to point to your selection.  You can give it voice commands.  \"Show Netflix\" and \"CBS\".  You don't need to be precise so \"Hulu\" works the same as \"Show Hulu\". When you use the voice command and say \"watch TV\" the screen shows the phrase \"live TV\".  You do not want to say the phrase \"live TV\".  Just trust me on that one.  You can use the voice command to pull up the HDMI selection screen, but then you need to point and click to the one you want.  If it can't figure it out, say if you ask for \"SyFy\" for which there are multiple stations, it will show a list of best guesses.  If you ask for HBO, it will always bring you to HBO Go.On the plus side, the keyboard is convenient for searching, and the buttons are similar to those on a phone.  Integrating with other systems is done via IR blaster.  You sit an IR device over the IR receiver on the device you want to control and the TV pretends to be that device's remote.  It is good at pulling up the guide for your local programming provider, and changing channels, even without IR blaster.Overall, this TV falls somewhere between \"Wow\" and \"Belongs on the Starship Enterprise\".", "Date": "May 23, 2013"}, {"Title": "Unsure about LG Televisions", "Author": "William G. Fuller \"WGF1811\"", "ReviewID": "R2PXKXPQKIV5U1", "Overall": "2.0", "Content": "The TV worked for 6 days and then died.  I am extremely dissatisfied with LG---I had always heard that LG made good televisions.  I guess it's possible I bought a bad one.  The TV is too big and heavy to return so LG has made arrangements to repair it.  I am still waiting for the LG tech to arrive.", "Date": "November 18, 2013"}, {"Title": "wow love this tv", "Author": "keith w", "ReviewID": "R14FCB4JMX78TZ", "Overall": "5.0", "Content": "I ve been looking for a new tv ever since my sony broke for the 3rd time in 5 years and they gave me the run around.after my wife called the better business bureau they wanted to listen to us and gave us a refurbished tv with a 30 day warranty.the new tv was so dark in color even in vivid with colors all turned up.football season is coming up and ive been doing research and knew i wanted a 3d tv that was thin and something bigger i had a 52inch but wanted 60inch until i was told that the clearity isnt as good because of the megapixels stretching over a bigger area which a gentlemen at sears who worked on tvs for 10years told me which makes sense.I seen a samsung at bestbuy and it had a amazing picture but its so vivid the colors arent that accurate plus it has 3d glasses that need to be charged which is active 3d glasses and they are expensive.I decided with all the great reviews online and talking to people that lg was the way to go.I wanted the 55la7400 or the ga7900 google tv .well looking online i saw a deal on slick deal.com that micro center had a sale on the ga7900 tv.it was 1499.00 everywhere except sears was more.they had it for 999.99 so i drove to ny from ct to get it.i got a 3 year warranty with screen protection and with tax it was under 1400.00 out the door.I hooked it up and set up the tv which was alot of stuff for a tv but i was impressed on the clear and easy the steps were.the tv was real light compared to my older lcd which was twice the weight.I was very shocked at how quick the internet search was considering i did hear how slow it was from reviews but its as fast as my laptop.The 3d mode rocks I loved 3d every since I saw albert hitchcock the birds in flordia.I watched alot of the free 3d stuff on the tv and the insect one was awsome the whole show takes place outside your screen .i just watched men in black 3 and it was cool but not out of the screen 3d cool like the insect one.For anyone who wants a amazing 3d tv with great quality go with this tv you cantgo wrong.i cant believe people who complain over the stuff they did it makes me believe they work for another tv company because i honestly dont see any problem with my tv.i love the remote with the speak option its really unbelievable i cant believe how cool it is and accurate .the sound is a little different because iam used to the tv volume being at like 30 now its like 50 but the numbers go higher which is wierd but the sound is good but i will probably still get a sound bar just for extra surround sound", "Date": "August 11, 2013"}, {"Title": "I would not recommend this TV to anyone", "Author": "scallawag", "ReviewID": "R10CYYF72A7IIZ", "Overall": "1.0", "Content": "I have blazing fast Internet speed and the built in Netflix app keeps buffering buffering buffering. When on the same wifi connection Netflix never skips a beat playing through my Apple TV or Roku box which obviously both have a Netflix app installed. They NEVER buffer with the same Wi-Fi connection going to the same TV just hooked up to a HDMI port. I have tried it hard wired and with Apple TV and Roku box disconnected still can't watch a show on Netflix! Just to much buffering to be worth it. I hate the dumb remote that has no programable keys.What's wrong with this picture?", "Date": "January 19, 2014"}, {"Title": "No Camera .....", "Author": "James Sitko", "ReviewID": "R3ANHEC170QKIU", "Overall": "4.0", "Content": "Only disappointing issue is there is no camera if you wanted to connect your laptop and us \"GoToMeeting\" and/or Skype.", "Date": "August 26, 2013"}, {"Title": "Google TV is the future.  Great TV...a bit challenging to set up", "Author": "Stephen \"radman2020\"", "ReviewID": "R79G7POJTBM3H", "Overall": "4.0", "Content": "Pros:Fantastic picture3D which I thought was going to be a fad is fantastic.Bezel is very thinGoogle TV is the future. It is well integrated with this TV. Saying what I want and having the info pop up is fantastic.  The system isn't perfect (see below) but it is a whole new way of approaching TV...melding cable and online.Streaming over Wifi is perfect..Cons:  There are lots of these but they still don't override the ProsThe bezel is thin.  Even though this TV's screen is larger than the one it replaced, the TV is much smaller due to a smaller bezel.  It doesn't look as big and fill the space I had for it.  For others, this may be a plus.Setting up the TV was very difficult.  At first I couldn't get it to hook up to the internet. Turned out, It doesn't support WEP security.  The instructions don't say this and in fact the implication is that it does. You must use WPA or WPA2 (or no security).  I wasted hours figuring this out.It didn't seem to recognize my local fios.  It kept saying it didn't recognize any providers in my zip.  Then, inexplicably, after an hour, it worked.It got stuck in 3D mode every time I invoked it for a Fios movie.  It turns out that my receiver, only a couple years old, which is interposed between cable box and TV, doesn't support 3D fully.  It doesn't allow the TV to sense you are back in 2D mode.  The fix is to switch to another input and then return to the FIOS input (or unplug the HDMI cable and put it back.  I am not willing to spend a few hundred to replace an otherwise good entertainment receiver.  I found customer support very much available by phone but they couldn't figure it out.  I did.Even though Google TV promises to integrate the Verizon feed (regular TV), Netflix, Youtube, and Amazon... it leaves out one important source.  The ON DEMAND from the cable company.  Yes, I can voice search for ondemand and get the menus to search through...  if I search a movie or actor or whatever, I get lists of what is available from broadcast, Netflix, Youtube, amazon etc.  The only workaround is that you do get HBO GO in the search which replicates the HBO on demand.  It is streaming though...  which works fine but prob isn't as good resolution wise as the on demand.  There still is no good way to see all the movies and programs available in Ondemand without going laboriously through menu after menu.  I was hoping the google search would fix this.  It doesn't yet...but I am hoping.In the end, I don't think I would consider buying another big TV that didn't have google TV and 3D.  This is amazing even if it isn't perfect yet.  It will keep updating and hopefully become even better.This TV is highly recommended...but with the small overall size for a 46 incher due to the thin bezel, I wish I had a 55 incher!", "Date": "May 26, 2013"}, {"Title": "0 stars", "Author": "rick moody", "ReviewID": "RZZR20X7HKHSD", "Overall": "2.0", "Content": "They said it was in stock. Two weeks later after several inquires we were told it was on back order. Ended up havingTo go to Costco to get the tv. Had to change schedule with electrician and Directv twice. Was working with the scheduling on their arrival dates.", "Date": "February 16, 2014"}, {"Title": "No price matching", "Author": "antonio", "ReviewID": "R1CR7XV5P8HT1J", "Overall": "2.0", "Content": "Not hapy with Amazon third party, they do not macched the price Microcenter $500 less from Amazon price. I tried to return on my expenses to LA!. I belive Amazon have to protect the costumers.The TV reach the aspectation, slow the Google applications for the wifi connection. Google TV have potential to build your costum programming.", "Date": "November 20, 2013"}, {"Title": "I never got to test the television due to the carrier breaking it", "Author": "MS", "ReviewID": "R3PBS457NXVUL7", "Overall": "1.0", "Content": "I never got to test the television. The carriers handled it cavalierly when taking it off the truck, even though I was standing there watching them. They were supposed to set it up to make sure it was working, but they took off as soon as they got it in the house. When I got it set up, I noticed a huge defect in the picture. I called LG and sent a picture via email. I was told the carrier had to be at fault and to return it. Amazon was great with their return policy, but I did not want to order another television of the same size because I was afraid that the same carrier may be assigned to deliver it. I opted for a 47-inch LG, which was delivered by UPS with no problems.", "Date": "October 30, 2013"}, {"Title": "No 1080P through HDMI!!!", "Author": "Gregg R. Stauffer", "ReviewID": "R3N86VAAVHHW4B", "Overall": "1.0", "Content": "I really wanted to like this TV, however, out of the box I recognized right away that there was something up with the picture quality. Not that the quality was terrible, it was \"ok\". But--it did not match the quality of the TV I was replacing.I have a DirecTV system. Anyone buying this TV who has a DirecTV system needs to understand this TV will not get the 3D DirecTV channels--ever. You will also--never--get 1080P on any programming through HDMI, you will get 1080i at best. I can tell the difference having had 1080P.This is from the technical specifications of the LG website: \"HDMI: 1080i, Component: 1080p\". Why LG would design a TV that does not pipe 1080P through HDMI is a mystery. I tried to get 1080P through component, this does not work with DirecTV.I contacted both DirecTV and LG support. Directv knew exactly what the issue was, saying it was a KNOWN issue with this LG model. LG support insisted there was nothing wrong with the TV and it was DirecTV's issue. This is true, the TV specifications states exactly what they are selling: A TV that DOES NOT transmit 1080P through HDMI.Bottom line, for the money I spent, I expect what should be a basic: 1080P through HDMI. Although the 3D from DVD was beautiful, it did not make up for this--what I consider to be--a major design flaw.-------------------------------------------------------------------------------- Item being reviewed LG Electronics 55GA7900 55-Inch Cinema Screen Cinema 3D 1080p 240Hz LED-LCD HDTV with Google TV and Four Pairs of 3D Glasses The Fine PrintAll submitted reviews are subject to the license terms set forth in our Conditions of Use.Your reviews will be posted within 48 hours.Submissions that do not follow our review guidelines will not be posted.You must be over 13 in order to submit a review for this item.If you believe that the product you are reviewing is unsafe, please report this information to the U.S. Consumer Product Safety Commission (CPSC) or contact Amazon.com directly. Get to Know UsCareersInvestor RelationsPress ReleasesAmazon and Our PlanetAmazon in the Community  Make Money with UsSell on Amazon", "Date": "June 6, 2013"}], "ProductInfo": {"Price": "$1,534.99", "Features": "LG GOOGLE TV. FREE CINEMA 3D GLASSES\n2.1 SPEAKER. TRUMOTION 240HZ\nENERGY STAR QUALIFIED\nTV without stand (Width x Height x Depth): 49.1 x 27.9 x 1.3, Inches, TV with stand (Width x Height x Depth): 49.1 x  31.1 x 12.8 Inches", "Name": "LG Electronics 55GA7900 55-Inch Cinema Screen Cinema 3D 1080p 240Hz LED-LCD HDTV with Google TV and Four Pairs of 3D Glasses (2013 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/41wWXoU92%2BL._SX300_.jpg", "ProductID": "B00BBAFUOY"}}