{"Reviews": [{"Title": "Beautiful Picture (after a little work)", "Author": "Casch \"Chris\"", "ReviewID": "R3D1JSVJT3W3VS", "Overall": "4.0", "Content": "I've only had this TV for a few days but now is a good time (while still fresh in my mind) to write a review regarding the great things and things that frustrated me in setting this TV up as well assessing the quality of the finished setup. I was replacing a plasma array that was using so much power that it was adding about 20 or so a month to my power bill. This is an energy star set so the savings should be dramatic.First impression was the size of the TV. With that thin bezel it took up not even an additional inch from my previous plasma 50\". So, even with the extra 5\" of screen size the foot print is identical (actually 1\" wider but identical height). It also comes with a qwerty keyboard on the back of the remote... a nice feature but it is an infrared remote so you need to have line of sight for it to work.Unboxing was easy and setup was straight forward and no surprises. If you have everything in place all you have to do is plug in the HDMI cables and other connections and turn it on. It did not come with its own set of cables so make sure you have them before setting up. Inputs and outputs are adequate with 3 HDMI, composite, antenna, Ethernet, and component as well as USB host. I've seen more but I don't even use all of these.OK, now I turn it on. Setup wizard walks you through the steps of configuring the television. Very easy, quick and intuitive. Love the WI-FI and it configured in seconds. Within 5 minutes I was up and viewing my satellite programing. Disappointing! I was used to my plasma with the beautiful blacks and rich colors. This was WAY sharper looking but looked washed out. So I went to the menu and decided to adjust the picture settings. Lots of settings and intuitive so that wasn't the problem but it either was too dim OR looked washed out. For a set that boasted 2 million to 1 contrast ratio this was a bust and a deal breaker. I looked on JVC's online site and came across a little blurb about local dimming and how that allowed the set to actually achieve the stated contrast ratio (I thought that local dimming was the feature to dim the set in low light conditions... NOT). On further investigation on other sites revealed what it does. A simple definition is.... there's an array of LED lights behind the liquid crystal pixels, and local dimming is when sections of the LED array are turned off or dimmed to help produce the deep blacks. Suffice to say I turned this feature on and voila! I had blacks. I don't know why it didn't come with that GREAT feature enabled but mine didn't. NOW, I am REALLY happy with the picture. Yes colors aren't quite as bold as the plasma but the picture is MUCH sharper. Blacks too aren't quite as good either when the scene is very bright. This is a very bright picture and stands up well to a brightly lit room. I watched a football game last night and motion was good so 120Hz seems fast enough for sport viewing.The sound quality is stunning for in cabinet speakers on such a thin set. I won't say it matches a sound bar in quality but it is useable and I don't turn on my theater sound except when watching movies. It has contoured sound so that when volumes are low it boosts the bass adding to the perceived quality. The thirty watt speakers are plenty loud. When 3d sound is enabled it boosts the voice frequencies so that dialog is easily understandable. I did find it a little shrill for me though when volumes were high. It also has sound leveling so that commercials don't blast you out of your chair when you turn the volume up to watch your programming. Worked well but could hear some compression artifacts while this is on. It sounded like a soft knee compressor (those of you with sound experience will understand) and did allow some loud content through (actually this is better as it sounds more natural).The set also has built in WI-FI (remember) and apps that allow you to use Netflix and Vudu as well as connect up with a media server. I was under the impression that you could get additional apps from the internet. Nope. That is all it has. It does say that when updates are available they will add more like YouTube and the like. I couldn't find a way to force an update though so it must decide to do it on its own.So in conclusion I'm happy. Are there better sets out there? Not at this price. Is it perfect NO (but what is).Pros: Large good picture, great sound, nice very thin cabinet, WI-Fi and plenty of inputs for me. Digital optical out for connecting to external sound system.Cons: Could be a larger manual that explains things better. User upgradeable apps were missing. Website was minimal at best for information.9-19-2013 update: Set works fine. After some additional fine tuning the picture is getting more to my liking.I measured the power draw under actual use and was amazed at how little it uses. With a VERY bright picture it draws from 72- 80 watts. Most of the time it is under 70 watts (most scenes aren't that bright). Sometime (night scenes) it will use as little as 58 watts. This is all measured with a meter as it is being used. Quite a bit difference from the 320 watts that the plasma ALWAYS drew.", "Date": "September 9, 2013"}, {"Title": "JVC Impresses!", "Author": "Wish '73", "ReviewID": "R24FL1SLM9WFUL", "Overall": "5.0", "Content": "Purchased this set 9/16/2013 at COSTCO. Originally $799, on sale for $679 (thru 9/29 & supplies last).  There were just three boxes left after we loaded ours - other racks for tvs fairly full, which tells me others willing to make this choice.  Honestly, would have preferred a Samsung, but $1697 (top of the line) vs $679 - well, if you want to spend that much don't bother reading further.I had seen this set last week and compared picture with those around it.  Others were not as bright (less expensive Samsung, Vizio - BTW, I am NOT reviewing this for pay; nor do I work for JVC, COSTCO, or in any related retail field.  Checked it out again with my wife and her eye for detail.  We turned the 7000 series Samsung so we could view both sets \"head-on\" although from about 12 feet or so (distance of our couch from tv at home).  No perceptible difference in picture quality between the $679 JVC and the $1679 Samsung, in our opinion.I was able to handle the tv loading into our SUV and carrying it into the house.  Basic instructions on the top of the box for removing the contents - straight forward. Some assembly required - 4 screws to attach stand to tv, 3 screws to attach stand to base (all seven included); JVS even includes a nice Phillips-head screw driver for this task!  Unplugged our 6-yr old plasma (an Insignia that has been a great tv - just has some burn-in, lower-middle section of the screen, about 7% of total screen area).  Easy hook up to blu-ray player and cable dvr.Set-up was simple with minimal need to reference the \"Quick Start Guide\"; all very intuitive.  In our case, the \"Local Dimming\" was already \"On\" (Press \"Menu\" on the remote, icons appear upper left to bottom left, press \"Picture\" then \"Advanced Picture\" to see the \"Local Dimming\" feature and others.)Explored different channels; watched \"Star Trek: Into the Darkness\" via \"On Demand\"; a dvd - opening scenes of \"The Fellowship of the Ring\"; Monday Night Football; and few minutes of \"Through the Wormhole\".  Blacks were very black, colors vibrant, sound was rich and full but  had to adjust via manual settings to hear dialogue, which minimized the \"Surround Sound\" experience but enabled us to hear clearly.Unobtrusive appearance when off; thin profile and \"picture frame\" look (just need a nice photo/picture to display!).Have not accessed the online features yet, although Wi-Fi has been connected (easily) and is working.All-in-all, very satisfied.  Sure, a Samsung would have been nice but would still advise comparing picture and features before paying the premium price.As for quality and dependability - we had a 35\" tube style JVC for years that served us well; as noted above, our Insignia (almost 6 years old) still working well, despite a little burn-in and has great picture.  Unless one is a very discriminating videophile, this tv at this price (even $100 more) is a great choice.", "Date": "September 17, 2013"}, {"Title": "Decent Budget TV", "Author": "C", "ReviewID": "RPZQVNBFM7XSB", "Overall": "3.0", "Content": "I bought this TV for my elderly parents at Costco as a replacement for their 7-year-old 42\" 720p plasma. Setup was straightforward and intuitive and connection to the wi-fi router was quick. The sound quality, as others have mentioned, is good, but I had to tweak the settings to make it sound natural and not distorted. Although this TV claims it is a \"Smart TV\", it isn't really, because the only apps available are Netflix, Pandora, and Vudu Movies. There is no way to update the software to allow for the addition of apps. But I knew that before buying the TV.For me, the biggest shortcoming of the TV is the narrow viewing angles. Move more than 20-30 degrees of off center viewing and the colors wash out and light leakage becomes distracting, especially during dark scenes. Viewing directly however, the picture and color quality is good, and motion seems to be fairly smooth and crisp.In summary, this is a decent budget TV. I paid $679.99 (on sale at Costco), which I think is a very reasonable price. With the new ultra high definition 4K TVs on the horizon, I didn't want to shell out $2000 for a 55\" Samsung that would simply be obsolete in 2 years. In my opinion, $799 is a little high and there are likely better bang-for-the-buck options than this model at your local Wal-Mart or Best Buy.This TV is actually designed and manufactured by AmTRAN Technology Co.,Ltd, the Taiwanese electronics company that also makes many Vizio-branded TVs.", "Date": "December 29, 2013"}, {"Title": "best TV for under 700 absolutely best bang for the buck", "Author": "Kyle Herrera", "ReviewID": "RR288GN743IQZ", "Overall": "5.0", "Content": "this is my third flat screen I always do my research on the best bang for the buck and this blew it out of the water my first TV was a 37 720 60hz inch insignia my second TV which I still have in another room is a 50 inch Samsung1080p 120flow motion.. Found this jvc  TV for $679 at Costco (deal is still good through December 31 -13) this TV is a 1080 P true 120 Hertz not like other 120 flowmotion that is really 60 Hertz that duplicate the picture making 120 frames per second. honestly most of my research for flat screens was with Samsung LG and Sony I didn't know much about JVC but at that price I thought I had to give it a shot. I am very satisfied with the picture and extremely satisfied with the soundthe TV is very comparable to the Samsungs picture maybe better I honestly can't really tell they're both great but the sound on this TV is 10 times better than my samsung which is still good. I would say this is by far the best TV you will find under 700 and it's even better than most TVs for much more", "Date": "December 3, 2013"}, {"Title": "Great Value", "Author": "Amazon Customer \"StanO360\"", "ReviewID": "R2U1XGAQMCTIS5", "Overall": "4.0", "Content": "Like the other review, it took a lot of tweaking. But at the end of the day it's a good picture. The new TV's are amazing, it is only 4\" wider and the same height as my Toshiba 46\".As a TV it's what I hoped it would be.But there are limitations, not a true Smart TV, at this point only Netflix, Vudu and Pandora, no DLNA access. I suspect this will get updates. However, Netflix seemed to work well (easier than the XBox) and with the keyboard remote.Pros: Great price (Costco), attractive set, good picture.Cons: No DLNA, limited Apps, no smartphone apps, remote is not multi-function. Fairly narrow field of view (though our room is on the small end, so the farther back you go the less you will notice this).", "Date": "September 9, 2013"}, {"Title": "great Tv", "Author": "F. miyata \"miyagisan\"", "ReviewID": "R2H252QLDU9567", "Overall": "3.0", "Content": "Also bought at costco and compare to other TVs in that price range and above. And this was very impressive. Out of the box  was a walk in the park. The back was flimsy plastic compare to the plasma i was replacing. Setup was really easy. Piture is beautiful and i did not have to tweak any settings ...i just used the presets for sport and movies and it was just fine.  Sound ia little tinni but I just boosted the bass and on the equalizer i raised the midrange and low frequency. Now i've heard a lot of wifi issues and at first everything was fine but alas it started acting up and disconnected a lot and sometimes it didnt even connect. Contacted JVC and he had me reset but it didnt work. He asked me to disable the MAC filtering  and it didnt work. then he asked me to det a static IP which i had to call up my Cable  company for assistance. The rep was nice enough to help me set it up and now everything works great. i think.....i'll update if it persistUPDATE:The WIFI has been very inconsistent and i may have to return it. It would be grast if JVC gave me a glimmer of hope that it would send out an update to address the issue", "Date": "September 20, 2013"}, {"Title": "No backlight bleeding", "Author": "eric tenort", "ReviewID": "R241Y4TION020A", "Overall": "5.0", "Content": "After trying a 60\" visio, a 55\" hisense, and a 47\" JVC  tv's, the jvc ap55m-c was the best. What I kept running into was backlight saturation which cause the black in the video to appear cloudy. I was unable to adjust backlight to a acceptable level without sacrificing color. I returned all 3. The jvc sp55m showed very little backlight bleeding. The blacks in my movies are not cloudy with this tv. Color is great. I will keep it. Unit was purchased at costco. Thanks JVC.", "Date": "December 3, 2013"}, {"Title": "Blue color and Not sharp", "Author": "J. Moss", "ReviewID": "R1WDQ5SSYVJS79", "Overall": "3.0", "Content": "I was excited when we bought this TV from Cosco for th $679 price like others to be our 2nd flat screen TV in our house. Our first is a  2 year old 40inch LCD  COBY.  Well we were disappointed with the picture when compared to our older LCD COBY set.  The Coby set is really sharp while the JVC has a blur to it. We tried all the recommendations and changed many settings and screen sizes and while the picture improved could not touch our older TV set.A HIGH def movie on NETFLIX on the JVC looked like a normal cable tv show when the same HIGH def show on our COBY displayed  extremely vivid and crisp. A normal cable show at times looked like an old over the air show. Our old tube 19in has a comparable picture. The JVC also has an issue of when someone is viewing the screen from either side..say from a wide couch the viewer gets a light blue color and reduced resolution.The WIFI connection  was not the greatest with this TV even though the wireless router was stationed close to the set.  Our connection to Netflix often dropped and typically takes over  1 min to load.  When NETFLIX was connected to our COBY via our PS3 we rarely saw connection issues.  We connected the JVC directly our router with an Ethernet cable to get around the loading issues.The setup is easy and the sound is nice. The tv has a small form factor. The qwerty remote is an awesome feature but that's not enough to deal with the other issues at this price point. Yes it's sounds like a deal for a smart 55inch TV but after paying over $700 after tax I'm getting a better experience from a $375 set with a  PS3 or roku attached. We're taking the JVC back.", "Date": "January 11, 2014"}, {"Title": "Great Picture and Sound", "Author": "telfonejack", "ReviewID": "R2GQCP8CUEWGJ2", "Overall": "2.0", "Content": "Great picture and sound as advertised good value BUT DO NOT fall for the hype that you can download I.C.E. apps... this is not true, there is NO user accessible browser. ONLY JVC can install additional apps to the I.C.E. feature. At this time JVC has not developed a USER/owner accessible browser... therefore you are at the mercy of Amtran/JVC for apps. You can access Netflix Pandora and Vudu from the ICE on the SP55M-C. This info was provided by JVC Customer support ????? or should I say non-support... deplorable tech support.It took 4 contacts before someone owned up to this fact. JVC is now JVC in name ONLY. I have had many great JVC products amps, receivers, TVs and turntables in the last 30 years... NOT AGAIN!", "Date": "October 9, 2013"}, {"Title": "Great Set for the Price", "Author": "Madeline S", "ReviewID": "R1IQBIVSUYH57B", "Overall": "5.0", "Content": "Are there better sets out there that do more amazing things? Yes.Can you get them at this price? No.We bought this to replace an older model LED 50\" flat screen. The frame on this one is so thin that it actually takes up less wall space than the previous one. We had the set unboxed, on the wall, and set up within 5 minutes. The walkthrough menu has the TV going very quickly, and the various inputs made adding our other electronics simple.My only complaint is that the TV has only 5 apps, and they do not include Amazon Prime or YouTube. There also does not appear to be anyway to add any. Since one of the reasons we bought this particular TV was for its \"SMART\" capabilities, we find this TV to be a bit of a disappointment in that one regard. However, as long as you realize that this is only a \"moderately intelligent\" TV, then you'll be fine.And again, for the price, it's hard to beat this set.", "Date": "December 30, 2013"}, {"Title": "Good for the price", "Author": "Jacob E FInch", "ReviewID": "R3ODT2BKACT9W2", "Overall": "4.0", "Content": "Important note\"Screw the bottom bases screws as tight as you can without striping them or the TV will lean to one side\". I had to tighten them after the TV was set up, because the TV leaned to one side.I had 46 inch LED Samsung before this TV that only lasted 5 years, took it to a repair man $900 for parts alone. This being bigger and cheaper than parts, I went with this TV. The Samsung did have a better picture,but was over twice as much. The smart TV function has some bugs, the Netflix app works off and on. The Remote and the over all looks is not as nice as the Samsung,but the price makes it a god buy.", "Date": "September 19, 2013"}, {"Title": "NOT so Smart 'Smart' TV", "Author": "Scott Krebs", "ReviewID": "R3V2T4O4VF9E6V", "Overall": "2.0", "Content": "Disappointed.  This is a 'SMART' TV that doesn't include a browser.  What good is the ability to connect to the internet if you are limited to 3 or 4 sites?", "Date": "December 10, 2013"}, {"Title": "blue hue", "Author": "Lisi Cai", "ReviewID": "R3QKUZ9GXF7PFO", "Overall": "3.0", "Content": "We bought this TV from Costco. in the showroom everything looks pretty good, from the color, to the contrast, to the high definition. we are planning to use it to replace the five years old Insignia 46 inch, which after 60 months of extensive use, starts to develop shadows in display.First thing out of the box we noticed the 55 inch TV is not much bigger. it's a little bit wider, but not much bigger than the aging 44 incher. during the set up (it is a smart TV so it need to be connected to the internet through wireless or wired network), we found it fail to find the indoor wifi (NetGear router) , but randomly picked four signal sources from the neighborhood. Refreshing the scan list does not help.Then comes the color. no matter which channel i go to the base color is blue. I'm an avid photographer so my eyes are \"picky\". however my elder parent and my wife all agree the color is blue_ish. it's below the 5 year old insignia and the 3 year old Toshiba. we tried to adjust the settings but it didn't help.", "Date": "October 1, 2013"}], "ProductInfo": {"Price": "$879.00", "Features": "Ultra Slim ; Narrow Bezel Design\n120Hz Crystal Motion\nCrystal Color Enhancement\nLocal Dimming\nWi-Fi 802.11n Built in", "Name": "JVC SP55MC 55-Inch1080p 120Hz LED TV", "ImgURL": "http://ecx.images-amazon.com/images/I/31uDE2lLpDL._SX300_.jpg", "ProductID": "B00BDRDUJW"}}