{"Reviews": [{"Title": "An In-depth review about Seiki's 32 inch LED tv", "Author": "pennywyze", "ReviewID": "RYX5W4VAKX2SE", "Overall": "4.0", "Content": "Where to begin...where to begin? Well, I won't bore the readers with a story; but here's a little background info about this TV.This Black Friday, I had a choice between standing in line at Walmart and waiting for a 98 dollar Funai or being smarter and getting a 98 dollar Seiki TV on Amazon. The reason why I went with Seiki is because I have yet to run across a review for a Funai TV; and secondly, I've actually seen the Funai in action via a family member that got one. While the Funai wasn't bad, it certainly lacked some of the connections and presented a less crisp image. Anyway, onto the review-TV build/Accessories-This Seiki 32 inch TV comes with a remote, 2 batteries, a stand that you'll have to screw on with a Phillips head screwdriver (which is standard), an instruction manual and a one or two page colored diagram that shows all the TV's features and connections. It could've come with an HDMI cable, but being that I own about 5 of them, it's no big deal. However, in the accessories department, an HDMI cable included would be the only thing that's missing to make the deal a little sweeter.The TV's build is a bit on the light side. In fact, the TV is extremely light and can be picked up by anyone.The stand is just alright; but I'll get into that part later.Score- 9/10Connections-This TV's connections includes 3 HDMI ports, a USB port, a Component port, VGA port, Composite/AV port, 3.5 mm audio cable (this can be used for headphones/earphones/speakers/and supporting soundbars), A Coaxial cable In port (also for soundbars) and finally, an RF cable out which would be used for antennae support.So as you can see, the Seiki gives you a lot of options for connections, however, I only wished this TV had stereo AV in ports for AV stereo AUX support with soundbars. If you have an AUX out soundbar, you'll need to get a two-way 3.5mm audio cable which are really cheap.Score- 9/10Image clarity/Options/Menu options-Ok. Here's the more important part of the review that I saved just before I list the cons of this product. The image clarity!!! This is important to me because I'm a gamer and light TV watcher, I also watch my Roku box and Youtube with apps such as Hulu Plus, Netflix, Crackle and PBS etc.The image quality for this TV is really good. In fact, I own a Vizio, Samsung, LG and a Magnavox as well as the worst of my TV's being a DYNEX (DO NOT BUY A DYNEX) and I'd have to say that the Seiki's image clarity is on par and in some ways better than my Vizio, It's somewhat on par with my LG (but I'll give the LG a slight edge in crispness)...heck, even the Samsung's quality is about on Par with it but I'd still give Samsung a slight, and I mean very slight edge. One of the problems I have with this Seiki TV is that the contrast and color are really, really good but can be a bit overbearing to the eye. In fact, how I tuned this TV was by turning the contrast and color down a load and fiddling around with the Dynamic Luminance. Here's a tip if you end up buying this TV and want a high contrast setting. Simply turn down the color and blast the contrast. In any event, it has a bright, colorful and crisp image.Initially, I was afraid that the SEIKI wouldn't hold up; but the quality is impressive, especially considering it's price and the size of the set.The menu options include Picture settings, Audio settings, Time settings, Parental Lock and a channel set up. Within these options you'll be able to fine tune the TV's color, color temperature, Noise reduction for image clarity, enhance the sound with PCM or RAW sound output with supported surround sound and equalizer settings between bass, balance and treble. It also supports French, Spanish and English audio.  There's also a built in NTSC/AIR antennae tuner, a QAM tuner, and a cable tuner with IRC and other options.The channel scan is relatively fast and lasts about 4 minutes. Yes, it does pick up DTV channels and local channels, all you need is a cheap antennae or some rabbit ears. Perhaps even a piece of wire would work as well. Currently, I have a normal antennae plugged into the RF port and it found over 40 local channels in 4 minutes. I didn't bother adjusting the antennae since I really don't watch much TV except for news, some movies (which I watch on Roku anyhow) and perhaps some sports games. Overall, it has a load of options, but it is missing some features that I would've liked. It also does have an LED backlight and luminance option.Score- 9/10Gaming/Xbox 360/Xbox One/PS3/Wii/PS2/etc-Being that I game a bit, here's the rundown with gaming.This TV does support 1080p resolution. On the Xbox 360 and Xbox One, it's pretty good. However, with consoles like the Wii, I'll have to tune the color a little and turn it almost all the way down because the color's really strong. I've tested it with PS3 and PS2. With PS2 I noticed that gaming does look a bit better especially if you have component cables (blue, green, red, white, red)and honestly, the PS3 games look amazing on it, especially at 1080p.At first I assumed since this is a 720p set, it would only upscale, but the games are actually in 1080p at 60hz, so playing games like Killzone, Call of Duty, Battlefield, Gears of War, Mario etc look really nice. The image is really crisp. With some games I'll change the video output to 720p or 1080i being that 1080p tends to pixellate some games horribly.The response time is good. I tested this online with Battlefield Bad Company 2 conquest mode and I haven't noticed any lag, again, the image is crisp, although to be honest, I may prefer the color of my Magnavox because it isn't so strong...once I tune the color or simply put it on a setting, it's just fine.Cons-The biggest con thus far with this TV is THE STAND. Let me clarify, the stand is supposed to be screwed in, which I did, however, it's slightly wobbly. Not to the point that if you bumped the TV it would wobble, but the stand's built awkward and the TV has a minor lean. Despite the minor lean, the viewing angle is excellent, so I haven't had any problems but it's still worth noting.The second con would be that the Tint option is grayed out for some reason. I'm not sure if it's grayed out because the tint adjusts based on the color temperature or if it just doesn't have a tint adjusting option, but in any event, it's just a gray option that I haven't been able to fiddle with.Finally, there's the audio. Yes, you get many options, but the sound is not good at all. It's just passable. But in comparison to my Vizio (which has excellent sound), LG and even my Magnavox, the sound is bad. It either sounds really tinny or just cheap. I found that adjusting the bass and boosting the treble really high helped a bit, but overall, it still sounds terrible, especially during some commercials or when listening to music. Do yourself a favor and get some speakers or a soundbar. I highly recommend soundbars by Haier or RCA.Overall-I highly recommend this TV for anyone on a budget who'd like a quality TV with a crisp image. While certain cons such as this TV having one of the worst screw-in stands, a lack of tint customization and the TV's audio which sounds really cheap even when tuned nay bug some, the overall image clarity and the viewing angle of this TV is fantastic. It has really vivid colors and again, produces a crisp image. It's not bad to view TV on or watch Roku/Apple/apps, it's great for gaming and it's lightweight. This was a steal for Black Friday, but I could see myself buying this tv full price. The only reason I give it 4 stars is because of the stand and the audio. If it were possible, I'd give it a 4.5/5 but Amazon doesn't have half point increments.Edit (December 8th, 2013)I also neglected to mention the following features of this Seiki TV. This TV features a memory store for color/audio and picture settings on each source chosen. In other words, If I picked HDMI 1 and set the color, then chose TV and set the color, then chose HDMI 2 or component or AV, it will memorize all color settings for each source chosen.I have finally resolved the \"Tint\" issue with this TV and it's a little weird. First, you'll have to go to factory settings by pressing \"Menu\" and then hitting \"0\" four times. (then look for \"Others\" then select \"Color Temp\" and adjust IF YOU WANT TO. To exit this mode, simply press exit or menu twice. I am not telling anyone to go to the factory menu) Keep in mind that when entering this menu, you DO NOT WANT TO MESS WITH ANY SETTING THAT YOU'RE NOT FAMILIAR WITH. (I accidentally enabled \"Burning mode\" and got a screen full of colors until I held down the power button on the TV for 10-20 seconds and pressed it again to get it off)Anyway, from the factory menu, there are settings to add \"Green\" \"Red\" and \"Blue\" or to \"offset\" Green, Red and Blue, and what I did was slowly add small amounts of Green and red to even out the tint.The downside to doing this is that it will save it to one of the color picture presets and you'll have to keep the preset in mind. I personally used this for the \"Cool\" temperature setting in picture settings just to knock the reds back a tad. (But again, that's just me)The good part about the factory menu is, there's also settings for the \"Backlight\" which I've put all the way up to 100. There are settings to enable QAM as well. But I just wanted to speak on the QAM being enabled through the factory menu a second because I saw other recent reviews that are a little misleading. If you enable QAM, indeed, you'll get a few more channels, but don't expect every cable channel possible. For the antennae channel scan, at best you may get 10 or more extra channels. (at the moment, my tuner found 58 channels via antenna with QAM enabled, whereas, before, it found about 40 or so channels. It's a difference, but it's not a huge difference)Also, there is an option available to scan cable channels, which I'm assuming works, but you'll have to give Seiki an e-mail (which is provided if you call their customer service line. In fact, it's an automated message and it's literally the first thing they talk about before connecting a call), I got my code via e-mail in about a minute flat. (It seems to be an automated e-mail anyway)I also resolved the TV stand issue by simply and carefully tightening the stand screws, and it wobbles a lot less.Anyway, I still stand by my review. This TV has been great.", "Date": "December 3, 2013"}, {"Title": "Good TV, had to enable qam manually.", "Author": "Stephanie W.", "ReviewID": "R2STE9LY87LY7P", "Overall": "4.0", "Content": "Pros: Great value for the price, bought it on Brown Thursday for 98.00.Cons: Did not support clear qam (would not pick up digital channels out of the box)Had to manually enable qam support.To enable click Menu, then press 0 four times, the service menu will open.Scroll and click others, then click other settings, then scroll down to cable qam and turn it on. Then press exit.After you exit go and redo your channel scan, it will find all your digital channels.", "Date": "December 7, 2013"}, {"Title": "Seiki  TV", "Author": "James E. Witt", "ReviewID": "RB978GOB4RJ05", "Overall": "3.0", "Content": "The first one that arrived had a white line all the way across the top. I returned it to Amazon, The replacement worked fine. The return policy with Amazon could not be easier.", "Date": "July 20, 2013"}, {"Title": "Great Flat Screen", "Author": "Brian", "ReviewID": "R1REA11OP2C0R5", "Overall": "5.0", "Content": "My wife and I are very pleased with the picture and all the features. Would recommend this brad to any one.", "Date": "July 21, 2013"}, {"Title": "Excellent purchase!", "Author": "Sandra J. Whitaker \"honey\"", "ReviewID": "RQCWCC915CP7Q", "Overall": "5.0", "Content": "The tv arrived quickly, was easy to set up, fairly inexpensive compared to most...great quality picture, sound, etc....no problems whatsoever with it!", "Date": "July 27, 2013"}, {"Title": "Enable QAM Tuner for Better Picture & HD Channel Support", "Author": "DaveF", "ReviewID": "ROGQ47O2TATXT", "Overall": "4.0", "Content": "Got this TV on thanksgiving night for $98 to use in an extra room. First one I received had a bad pixel but Amazon sent a new one to me really quick - be sure to check for stuck / dead pixels on your unit after initial setup.Once I received the 2nd unit, I hung it on the wall rather easily as the TV is so light. Then I hooked it up to the cable coax, I was off and running. The picture was not so great and I wasn't getting high def channels. After a bit of googling, I found that the tuner necessary to get high def channels without a cable box comes disabled on this TV. After enabling the tuner it makes a giant difference. The TV goes from kind of washed out to looking great. (see below for directions)As far as the hardware goes, the tv is light, has a small bezel and is pretty good. The remote is kind of weak and feels flimsy but it does the job.How to enable QAM using the remote:1. Press Menu button2. Press 0 four times3. Select \"Others\"4. Select \"Other settings\"5. Select \"Cable QAM\"6. Enable QAM7. Press Exit button8. Press Menu9. Select Channels10. Rescan channels", "Date": "December 7, 2013"}, {"Title": "Great Television", "Author": "AmazonPrincess", "ReviewID": "RCYFAI41PDUSW", "Overall": "5.0", "Content": "I was worried by other reviews that this might not be a great television.  After having it for the past 4 months, I can say with confidence that I made the right decision.  It has great quality picture and sound.  For the price, I couldn't have done much better.  Would recommend to others.", "Date": "February 2, 2014"}, {"Title": "Tv died after 20 days", "Author": "Amazon Customer", "ReviewID": "R1UB34HUUSKADI", "Overall": "1.0", "Content": "Worked for 20 days then suddenly the tv died. I would not recommend this product to anyone. Don't waste your money.", "Date": "October 23, 2013"}, {"Title": "Not a good purchase.", "Author": "Jerry Vitovsky", "ReviewID": "R30QBR4A3PMDFA", "Overall": "2.0", "Content": "So far I can not say anything good about this TV. We have had nothing but problems with keeping it on. We have to unplug it every other day to reset. Not sure why. Working on sending it back.", "Date": "March 21, 2014"}, {"Title": "Excellent television!", "Author": "David Ha", "ReviewID": "R1MQ8R7OGMLB87", "Overall": "5.0", "Content": "I purchased this as a GOLD BOX deal from Amazon for under $100. I love the television and theres no way a person could buy it for a better price. Works well and does what it needs to!", "Date": "January 9, 2014"}, {"Title": "Pleasantly Surprised!", "Author": "Cris", "ReviewID": "R1BGKXQIJNB52I", "Overall": "5.0", "Content": "After reading the reviews, I was a bit hesitant about purchasing this TV.  I needed one for the guest room and it needed to be cheap and Prime.  I set the TV up last night with the Roku and the DVD player.  I am pleasantly surprised that this TV is going to work out well!  The remote is great! It has a sleep button, which is a must have option for guests (in my opinion).  The color and clarity are fantastic.  I am really glad I took a chance and purchased this TV.  I don't know how it will work out in the long run, but it is for the guest room, so it won't be constantly used.", "Date": "April 24, 2014"}, {"Title": "Be careful", "Author": "Tim Ma", "ReviewID": "R1PBF6PBEUJ8B5", "Overall": "1.0", "Content": "The item description is wrong. This TV only has analog TV tuner. No QAM tuner, No over the air HD channels. Standard channels are worse than other brands.", "Date": "April 12, 2014"}, {"Title": "Great sound - Great picture", "Author": "Rick", "ReviewID": "R3R3GHFRAIA8GW", "Overall": "5.0", "Content": "The picture is very clear and colorful especially in hi-def. To say the sound is loud is an UNDERSTATEMENT this TV's sound is LOUD, the volume goes up to 100 and at 10 you can hear it downstairs. One drawback is having to assemble the stand it's a little tricky at first you have to be careful not to get it wrong or the TV will be wobbly - but once it is assembled it's very sturdy. This is definitely a must buy.", "Date": "April 11, 2014"}, {"Title": "Excellent picture", "Author": "Marsha Moses \"Marsha\"", "ReviewID": "R3QXRGNZDHMUWC", "Overall": "5.0", "Content": "I was pleasantly surprised at the quality of the picture.  This tv has a great picture. It is just as good as a much more expensive tv.", "Date": "March 25, 2014"}, {"Title": "Good for the Price", "Author": "Ronnie W.", "ReviewID": "RYEFXS72RM5TQ", "Overall": "5.0", "Content": "Slim profile, does what it needs to do. Speakers are ok, picture is ok. Plenty of hookups for game consoles or dvd players", "Date": "December 22, 2013"}, {"Title": "Not great", "Author": "susan s. fowler", "ReviewID": "R3RSN36K1DVAQ0", "Overall": "1.0", "Content": "It's not awfu - but I'm glad I got it on sale for a huge discount.  I know why - the picture won't keep the settings and the sound quality is horrible.  Honestly - better sound from a tin can.  I would not spend the money on this TV again.", "Date": "December 30, 2013"}, {"Title": "Complete Fail", "Author": "J. Bowen", "ReviewID": "R12IJYBMH1F5K5", "Overall": "1.0", "Content": "This TV was a complete dud. It would not power up when first removed from the box. I would give is negative stars if it was allowed.It going back to Amazon tomorrow.", "Date": "December 25, 2013"}, {"Title": "Inadequate TV", "Author": "phyllis howe", "ReviewID": "R59KI55GVZ1TW", "Overall": "1.0", "Content": "Color correction is awful, varies from station to station.Way too small and cheaply made.You get what you pay for.", "Date": "December 13, 2013"}, {"Title": "Fine deal.", "Author": "Charles P Fletcher", "ReviewID": "R934M0KPVFNQW", "Overall": "4.0", "Content": "Digital ready.  Good picture.  Good sound.  Easy hook up.  Low power draw.  Lightweight.  Great price.  What more do you want?", "Date": "November 2, 2013"}, {"Title": "Do not purchase if you need it longer than a year", "Author": "Min", "ReviewID": "RO96U9O3MZII0", "Overall": "1.0", "Content": "Had this TV for less than a year. It stopped turning on. Googled to see what information I could find out about it, and so many people are having the same problem.  Spend the extra dollars and buy a brand you trust! ,", "Date": "November 29, 2013"}, {"Title": ".V", "Author": "Marilyn", "ReviewID": "RGUJUAAU8JXST", "Overall": "5.0", "Content": "The product was exactly the size I needed to fit in my cabinet and priced right for my budget.  It works very well and is so much lighter than my old T.V.", "Date": "June 25, 2013"}, {"Title": "Buyer beware!", "Author": "Wer", "ReviewID": "R2J48G22IBGP3N", "Overall": "1.0", "Content": "Cheap and flimsy First one had a cracked screen at delivreyHassles sending it backReturned 2nd one cause it felt  very cheaply madeSamsung from walmart did the trick!", "Date": "October 6, 2013"}, {"Title": "TV WAS WORTHLESS & AMAZON IS RIPPING ME OFF !!", "Author": "Alan / Miami, Florida", "ReviewID": "R1M9IN0AA32GYL", "Overall": "1.0", "Content": "I bought it for my son as a surprise and had it shipped to his dorm in MI.  It arrived in a hurry, but it did not work. It would not perform a channel search successfully. He tried a number of different maneuvers, but no dice. I visited him in MI last week, tried to get it to work, called Seiki's Customer Service [horrible - got placed in a loop of recordings for an hour], and returned the TV for a replacement will all manuals, packaging, remote, etc. The replacement arrived in a flash also, but it did not work either. I returned the replacement as well. Then, I went to the local Walmart and purchased a comparable Phillips TV. It worked fabulously in minutes. The channel search was flawless. Just got a refund from Amazon with a 20% Restocking Fee. Seriously ? Are you kidding me ? DON'T BUY THIS TV. You shouldn't have to be gambling on getting a satisfactory TV - hit or miss. I want the rest of my money back ! This is my first unsatisfactory experience with Amazon. I'm fuming. STAY AWAY !!", "Date": "November 5, 2013"}, {"Title": "Good TV , cheap", "Author": "Eduardo Nunez", "ReviewID": "R209UQ2Y8W39DA", "Overall": "4.0", "Content": "It has a good menu, easy to understand in your language. I like this TV and recommend it to your room, it is very cheap.", "Date": "May 19, 2014"}, {"Title": "NO  SOUND", "Author": "denyce roeseler welch", "ReviewID": "R1VKC4NZLCMI64", "Overall": "1.0", "Content": "I have tried everything and i can't get any sound to come out with the cable box. getting very frustrated", "Date": "May 9, 2014"}, {"Title": "Great TV", "Author": "Cadman-LT", "ReviewID": "R1MHDS163M2I20", "Overall": "5.0", "Content": "This is a great tv for the money. It has all the inputs you should need. Most tvs have 2 HDMI inputs, but this one has 3. The VGA doesn't go to as high of a resolution as I would like, but still works fine. I kind of wish the stand was adjustable, but that's just me. Overall a great tv for the money.", "Date": "April 26, 2014"}, {"Title": "Not a very good picture", "Author": "Lou", "ReviewID": "R3MW9I0KFWMZPB", "Overall": "2.0", "Content": "Good price but not a good picture.  Price was good, but will return for better brand.  Do not recommend it.", "Date": "April 26, 2014"}, {"Title": "Very good deal.", "Author": "Geezer 67", "ReviewID": "R1ZKIINY3ZS3Y9", "Overall": "5.0", "Content": "The TV looks great, Clear, Good color and contrast. Contrary to other reviewers, I think the sound is more than adequate for just the TV. If you want Theater sound, you better buy an external Dolby system with Digital input. The setup is simple, just set it for Antenna or Cable and do the automatic scan. The remote control is good, except you must use the full channel number, IE:45-1, or 22-2, or it stays right where it is. There are two rounded indentations on the back that align your thumb over the Channel and Volume keys if you put your first and second fingers in them. Most of the keys are conveniently placed so it is easy to use in darkness or dim light. I tried what others said to do to enable the QAM tuner, but found no mention of one in the setup-other list. If you have Digital service, the TV is usually set to channel 3, and the channels are tuned by the digital converter that your service provides. I see no need for more than this TV provides, no set I have had was any different! If my luck holds, and I didn't get one of the 5% or so that tend to be Lemons, this TV should last ten or more years. I recommend this purchase to anyone that needs a cheap but decent medium size TV!", "Date": "April 25, 2014"}, {"Title": "Seiki 32 inch", "Author": "Donald", "ReviewID": "R4W7DQGS0807X", "Overall": "4.0", "Content": "Very good quality picture in hd, the only thing bad I have to say is the stand is a little cheap. Because two of the screws stripped the inside of the stand.", "Date": "April 16, 2014"}, {"Title": "Nice picture", "Author": "luis armando partida", "ReviewID": "R2JZ0D2D8K6X7T", "Overall": "4.0", "Content": "This tv has a really nice picture .A 32 inch tv doesn't have to be 1080p to get  a really fine picture. the price of this tv is very convenient. I definetly recommend it.", "Date": "April 15, 2014"}, {"Title": "loving my t.v. seiki", "Author": "latasha oneal", "ReviewID": "RL8RAJ5XLGEQB", "Overall": "5.0", "Content": "Love this t.v.. It is simply incredible and my family and I love it. Thinking of getting another one... I highly recommend this item to ppl.", "Date": "March 18, 2014"}, {"Title": "Seiki makes a great TV at a great price", "Author": "Christopher J. Cowen", "ReviewID": "R3OELGLI5BMKE9", "Overall": "5.0", "Content": "Seiki SE32HY10 32-Inch 720p 60Hz LED HDTV (Black) is a great TV at a great price. This Seiki Digital TV has an amazing picture and is under 12 pounds.  The user menu has alot of features that allows you to change the contrast and brightness as most TV do, but TV also has a sleep timer so that it will turn itself off if you are like me and fall asleep while watching TV. With this TV you get a  picture with stunning clarity and colors that far surpass many other TV's within it's class. Put simply, you have to see it to believe it.The TV has all the connections you will ever need and more. The TV also has good built-in speakers produce high-quality, crisp and clear audio stereo sound, and even has a powered by high-quality amplifier.Price - $169.99TV Display Technology - LEDResolution - HDTV with 1366 x 768 resolutionRefresh Rate - 60 HzSmart TV NoTotal HDMI Ports - 3Dimensions - 19.4 x 8.1 x 29.2 inchesThank you for reading my review, if you have any questions feel free to email me, I would be happy to help you with any questions you have.", "Date": "February 19, 2014"}, {"Title": "Excellent TV", "Author": "Mary", "ReviewID": "RP3ZRESXR981U", "Overall": "5.0", "Content": "Just hooked this TV up last night and am very impressed with the performance of the product.  This is not our primary TV, but I see no reason why it couldn't be.  It's located in our basement where you can see it from many angles.Pros:- The picture is very crisp from many different angles.  It's capable of being extremely bright as well.- The TV is remarkably light.  I hand to hang it on a swinging wall mount by myself and was easily able to hold it up in position with only 1 hand.- There's a boatload of inputs for this TV.  Way more than I need, but still nice to have.- Price is fantastic.  Wish I caught the black Friday deal, but even without that I can't complain about the price.- Despite what some people say, I am very impressed by the audio on this TV.  I was very surprised that I had to turn the volume all the way down to 7 (out of 100) to get it to a comfortable level for my room.  Granted, I am hardly an expert when it comes to these things, but I expected a lot less from the TV based on what other people had said after reading all of the reviews.- Plenty of ways to configure the audio/video to your likingCons:- Delivery was delayed 5 days due to weather conditions!  Nobody's fault here... just annoying ;)", "Date": "February 19, 2014"}, {"Title": "Flat Out Deal For A Flat Screen", "Author": "Joshua T. Ebert \"Ebes\"", "ReviewID": "R14DV3HFI6YWWK", "Overall": "5.0", "Content": "This is a great little TV if you're looking for an entry-level flat screen. I've been slowly updating my parents' home over the last couple of Christmases. My sis and I got them a nice entertainment center downstairs with an AppleTV and 5.1 system for movies and such. That seemed to convince them they could handle some new tech. (Ha!) We got this TV to replace the \"cheap\" TV upstairs that they just watch broadcast TV on.For a \"dirt cheap\" option, it actually looks nice, and it's SUPER lightweight and compact. (Like, my mom can just lift it off and move it for cleaning.) It's so light that it feels cheap, but it seems surprisingly sturdy when you mess around with it. And– it's held up great for half a year so far!It did great with channel tuning, and the remote seems great (also really tiny and lightweight). The menus and interfaces aren't amazing, but they far surpass many cheap, generic TVs I've had. They're fairly intuitive and look decent (i.e. clear and easy-enough to read for my old man. ;] )We eventually got a new AppleTV for the downstairs system and moved the old one to this TV. It connected without a hitch! It runs great with it and takes full advantage of the 720p!Overall, this is a GREAT purchase that I highly recommend!", "Date": "February 12, 2014"}, {"Title": "One stuck pixel.  Bright Green.  Ugh", "Author": "M. Tai \"customervalued\"", "ReviewID": "RNYV2D2VCQ5MM", "Overall": "2.0", "Content": "Bought this for my parents and it has a stuck green pixel.  Since it was so cheap they didnt want to bother with returning the unit.  Still it bugs me though.  Works fine otherwise.", "Date": "February 11, 2014"}, {"Title": "Quit in 4 months", "Author": "JL", "ReviewID": "RGZS4H031GU1A", "Overall": "2.0", "Content": "Unit was good for awhile, but after 4 months quit. I hope they will honor the warranty. It was working normal and then picture is gone and no power.", "Date": "January 26, 2014"}, {"Title": "Good HDTV for the price", "Author": "nick", "ReviewID": "RVFYF8TAVEQM2", "Overall": "4.0", "Content": "I grabbed this gem on Black Friday for a hundred bucks. It is incredibly light and easy to set up. The picture is great and displays HD nicely. The 3 HDMI ports are great, however it's limited to one multi-out input. I just bought a selector box that should fix that though for fairly cheap. Being a 32 inch, it's a bit small for my family room/living room, but the trade off with price was worth it. The only other limitation is the the zoom modes/display settings. It's difficult to find one that works well, especially when watching sports. Otherwise, I recommend strongly.", "Date": "January 5, 2014"}, {"Title": "good deal", "Author": "lchmom", "ReviewID": "R1XWFL3H8KKLNK", "Overall": "3.0", "Content": "Tv was easy to set up and the sound is good. The picture isn't as clear with standard cable,  but good with dvd's.", "Date": "January 2, 2014"}, {"Title": "Nice Picture", "Author": "ricmcc53", "ReviewID": "R302NV2J74YKHZ", "Overall": "5.0", "Content": "I bought this tv about 3 months ago. this is very nice for a small bedroom. The picture quality is very good. So far, so good with this television.", "Date": "December 30, 2013"}, {"Title": "Inexpensive and Perfect Bedroom TV", "Author": "Paul M. Walker", "ReviewID": "R3GL4IOVF6VOZ2", "Overall": "5.0", "Content": "We ended up getting this on the black Friday Special and it's perfect for our Master Bedroom. It replaced a Vizio 32\" that we moved to our office because of the A/V connections on the Vizio for other purposes.We use the Seiki for DirecTV and the quality of the picture is nice as well as a loud/crisp sound. Not what we expected from such an inexpensive TV.Don't judge a book by its cover and get this one for sure!", "Date": "December 30, 2013"}, {"Title": "Good bedroom TV", "Author": "B in Maine", "ReviewID": "R1GR74ILVLP939", "Overall": "4.0", "Content": "I got this on Thanksgiving Day for $99. It went into the bedroom, which doesn't get watched much. It is perfect. I think I would be disappointed if I had to put it in the living room, but I have a 40\" Toshiba there to compare it too. If I hadn't been spoiled by that one, I would be thrilled. It is definitely a big upgrade from a regular tube TV. I would recommend for bedroom or other light use area.", "Date": "December 30, 2013"}, {"Title": "Great deal", "Author": "Amazon Customer", "ReviewID": "R3DDIBAVIKY71Y", "Overall": "5.0", "Content": "The TV was more than I expected it to be for the price that I paid for it.  The Sound and Picture on the TV is very good. I have it in my daughter's room and she really loves it. Has enough ports to hook up her DVD player, her WII game and still have extra ports.  Don't worry about buying this TV. You will be happy with it.", "Date": "December 30, 2013"}, {"Title": "very happy", "Author": "Robinblythe", "ReviewID": "R1FM2HNUUN7581", "Overall": "5.0", "Content": "We are very happy with this tv, we bought it for our kids, for the resolution, etc, it looks very good and we have no complaints.  It was a great buy around black friday!  We haven't had it long but so far so good, the only thing that I am not personally crazy about is the hook ups, you need to keep your book to be sure you hook up gaming devices and dvd player correctly, kind of a pain, the colors don't match the red, white and yellow connectors.", "Date": "December 30, 2013"}, {"Title": "Great value for the dollar", "Author": "William T Donigan Jr", "ReviewID": "R3RLIL165WRC0U", "Overall": "5.0", "Content": "I was sitting in the living room Thanksgiving Day waiting to go to Walmart and wait in line for a $98 TV 32 inch, nothing fancy but for the spare bedroom. When what to my wondering eyes should appear but Amazon's deal buster. The same TV for the same price, delivered (allowing me to enjoy the rest of the day with my family) and no sales tax. Yahoo! I now look at Amazon first!!!!!!!!!!!!", "Date": "December 30, 2013"}, {"Title": "awesomness", "Author": "Kim Nguyen", "ReviewID": "RJQZ9I4CJQOQA", "Overall": "5.0", "Content": "For this price, I really could not have asked for a better TV. No broken pixels, good sound, decent resolution.One complaint I have is the placement of the HDMI ports on the back panel: the TV bulges out just below the HDMI ports and makes it a little bit difficult to plug in the cords.", "Date": "December 24, 2013"}, {"Title": "Great", "Author": "Franklin  Valcin", "ReviewID": "R343BUXYJDNRS4", "Overall": "5.0", "Content": "This is a real tv, not a toy. From virtually all vantage points, it is doing my job: I truly Lov it!", "Date": "December 14, 2013"}, {"Title": "Good value", "Author": "Jimmy", "ReviewID": "R2RLTIET3MWV6A", "Overall": "5.0", "Content": "I was able to pick one of these up for $98 during the Black Friday Lighting Deals...I am now able to retire my last tube t.v.  When I received the t.v. I was shocked at how thin the bezel was. We have 2 other $200 budget t.v.'s (Westinghouse & Haier) in the house and this is by far the best looking form factor....It also seems to have a better picture.  So, far I'm impressed with this t.v. and it's features, but mostly the price.", "Date": "December 11, 2013"}, {"Title": "Highly recommended", "Author": "Cat N.", "ReviewID": "R1ITW5QSAOXLSQ", "Overall": "5.0", "Content": "Excellent color and clarity - great tv for the price!  Purchased this for my study with chromecast - I cant believe the quality of the picture and the vivid color.", "Date": "December 6, 2013"}, {"Title": "18.5 inch t.v.", "Author": "Fran Maltby", "ReviewID": "R2Z8R5B98CRRU4", "Overall": "4.0", "Content": "I like it, and it's good enough for my guest room and for the price.Good price too :) thanks", "Date": "December 6, 2013"}, {"Title": "gr8 picture quality build quality okay", "Author": "AJ", "ReviewID": "RA4W3Z5VSJF9K", "Overall": "4.0", "Content": "Got this tv during thanksgiving daily deals. Pretty much worth a penny for this tv. connected an regular antenna and the HD picture quality is amazing. The build quality is okay types but the picture quality is great.  Overall would recommend this product.Gr8", "Date": "December 3, 2013"}, {"Title": "Perfect price and great picture!", "Author": "Mo Ko", "ReviewID": "RQMPMAMS7DNF2", "Overall": "5.0", "Content": "I was surprised at the ease of use and the picture and sound quality on this TV. Its amazing for the price and is a great deal in my opinion. I would definitely buy it again if I had to and do not regret buying it at all.", "Date": "December 3, 2013"}, {"Title": "Black Friday deal", "Author": "mr simon vanweerdenburg", "ReviewID": "R31W4MLZEN8E2H", "Overall": "5.0", "Content": "I purchased this TV which much trepidation on Black Friday for $98 but so far I'm so glad I did. I was worried that the sound would be awful but in fact it isn't bad straight out of the box and a little adjustment makes it even better. The picture is crisp and colorful and the tv itself looks very nice. We have it in our second living room so the room is not huge which helps the sound. I would actually write a similar review if I'd purchased it at full price! I'd definitely recommend this tv to anyone looking for one for a bedroom or smaller living room. If you want to see what it looks and sounds like it is identical to the new Vizios ( not the internet ready ones).", "Date": "December 2, 2013"}, {"Title": "great", "Author": "Joshua Scott", "ReviewID": "R20UO5MS0J8QDA", "Overall": "5.0", "Content": "great tv, bright, clear, has great features and good sound. totally recommendedcan't think of anything else to say so yeah", "Date": "November 3, 2013"}, {"Title": "Amazing", "Author": "Tianna", "ReviewID": "R3988J8T7XIHVH", "Overall": "5.0", "Content": "I love this tv it's amazing and it came very fast . I was easy to put together and it works amazing .", "Date": "October 17, 2013"}, {"Title": "Nice for price", "Author": "Virginia Hunt-Jansen", "ReviewID": "R2BCW0D03M0U5V", "Overall": "4.0", "Content": "Used it for my 3 yr old sons room, he loves it, so far sturdy & worth the money I paid", "Date": "October 16, 2013"}, {"Title": "New TV", "Author": "G. Wolf", "ReviewID": "R1ZF92L3KGRH4V", "Overall": "5.0", "Content": "The TV arrived and was very easy to set up.  It has a great picture sound quality is alright .  The TV is used in the bedroom so it's size was important it fits the spot perfectly.", "Date": "October 8, 2013"}, {"Title": "Love it", "Author": "Stormin' \"Norman\"", "ReviewID": "R35Q5RRN2NF7XZ", "Overall": "5.0", "Content": "Fit the area it went in perfectly and has a great picture. Easy set up and programming was a snap.", "Date": "October 6, 2013"}, {"Title": "Great tv for the price", "Author": "Mindy", "ReviewID": "RKGIXRQCN75BK", "Overall": "4.0", "Content": "For the price, great TV.  Picture quality is good and sound quality.  It's light weight, doesn't have that glare you get on some tv's and arrived quickly.  Easy to set up, hook up, we really like it.", "Date": "October 3, 2013"}, {"Title": "Nice TV for students", "Author": "Big-smile", "ReviewID": "R3RAFNIR8W42QB", "Overall": "5.0", "Content": "I wanted to buy a small TV under $100 for my apartment and found this one. Have been using it for a couple weeks and I love it. Pictures are nice and I don't have any problem with the sound.", "Date": "September 9, 2013"}, {"Title": "So far so good", "Author": "Toni-Ann Welds", "ReviewID": "R2F1YZ9XFM587G", "Overall": "4.0", "Content": "The quality of this TV was higher than I expected considering how low the cost was. I've only had it for 2 weeks and I can say I have no complaints so fat.", "Date": "September 9, 2013"}, {"Title": "Great purchase", "Author": "Paul.a", "ReviewID": "R3MXY0Y7N07EEM", "Overall": "5.0", "Content": "This is a great tv for the money. It has a very good picture and sound quality. I would purchase this tv again.", "Date": "September 9, 2013"}, {"Title": "LOVE THIS TV!!", "Author": "raymond h. stoebling", "ReviewID": "R1OWKIDGGSA40P", "Overall": "4.0", "Content": "GREAT PITCURE, EASY TO GET FEATURES. LIKE IT!! I WOULD RECOMMEND THIS TV !! GOOD PRICE AND GOOD VALUE! GET IT>", "Date": "September 7, 2013"}, {"Title": "Great!", "Author": "Teresa L. Ditsworth", "ReviewID": "R2EBM28GRGEO5F", "Overall": "4.0", "Content": "This is a great tv for the money.Easy hookup.  Up and running in ten minutes.Picture and color are as good as most name brand tv's.", "Date": "September 6, 2013"}, {"Title": "Hanging TV Seiki Digital", "Author": "Robert Denome", "ReviewID": "R1UFFKEAZN3S8K", "Overall": "3.0", "Content": "We use this tv with antenna and it seems to be lacking the ability to pickup HD channals like other tv we own as a plus it is lite and slim", "Date": "September 4, 2013"}, {"Title": "Best bang for the buck", "Author": "tim", "ReviewID": "R35NPRWPDDHSR8", "Overall": "5.0", "Content": "Great tv for the price. Easy set up, good picture. Got it for the bedroom, already had to upgrade to a HD box so I could take full advantage of it.... next.... surround sound!", "Date": "September 3, 2013"}, {"Title": "seiki digital 19 inch led hdtv", "Author": "lgw1954", "ReviewID": "R2DWZ8EOZWGUC3", "Overall": "5.0", "Content": "clear picture ! have not even had one problem with it ! i still cant believe how reasonable the price was !! also very fast shipping,love the two day shipping ! very,very happy with this purchase !", "Date": "September 2, 2013"}, {"Title": "Not loud enough.", "Author": "Bill White", "ReviewID": "R2XYR79LOK6AS3", "Overall": "5.0", "Content": "The picture on this TV is great, and it exactly fits in my entertainment center. However, I'm running the sound at full volume and wish it had more - I sometimes don't know what is being said.", "Date": "August 29, 2013"}, {"Title": "Great TV, Easy Setup, Great Deal", "Author": "Carrie Stearns", "ReviewID": "R3OK2D0B5TFXA1", "Overall": "5.0", "Content": "The picture and sound are wonderful, easy to set up, better quality than my more expensive TV - and you can't beat the price. I never review products but I'm so very, very happy with this purchase so far and wanted to share.", "Date": "August 29, 2013"}, {"Title": "Everything I needed in a LED HDTV", "Author": "Kevin Kline", "ReviewID": "R1JSXJP9WYQRKV", "Overall": "5.0", "Content": "Purchased this TV as a gift for my mother.  Needed it to be fairly basic and simple to operate.  It works well for general TV viewing and she is very happy with it.  TV arrived on time with no issues.", "Date": "August 25, 2013"}, {"Title": "My first HD TV", "Author": "MCW", "ReviewID": "RNV40AP7AADYV", "Overall": "4.0", "Content": "As this is my very first HD TV, I have nothing to compare it to but I like it a lot.  It was easy to set up and worked perfectly as soon as I hooked it up to my cable box.  The only thing I don't seem to have that was on my old school TV is close captioning but it really isn't that big a deal.I would recommend this brand for an inexpensive TV.", "Date": "August 16, 2013"}, {"Title": "Not what I expected", "Author": "Gabz", "ReviewID": "RPULPOWM38MCG", "Overall": "3.0", "Content": "Honestly I couldve bought a better tv for the amount of money I spent. It did ship very fast though but you can tell its a cheap tv overall I'm ok with it but definitely will be investing in a better tv", "Date": "August 13, 2013"}, {"Title": "Easy to set up, too.", "Author": "Island Girl", "ReviewID": "R2Z4NFU256YWDV", "Overall": "5.0", "Content": "Great value for the money.  I'd buy it again.  Light weight and the instructions were easy to set it up.", "Date": "November 13, 2013"}, {"Title": "INCREDIBLE PICTURE, QUALITY, AND PRICE!!!", "Author": "A. Reyes", "ReviewID": "R1JUS4GW11E4VF", "Overall": "5.0", "Content": "This TV is too good to be true. I was expecting a fuzzy or soft hazy picture but I watch high qualit television with this TV. I highly recommend this TV for the quality, picture, and the PRICE!!!", "Date": "September 11, 2013"}, {"Title": "Working Great", "Author": "Amazon Customer", "ReviewID": "R2ZICQ0T8PTW6G", "Overall": "4.0", "Content": "I have only had this for 5 days but so far so good.  The set up was easy and the picture seems to be great so far.  It is thin and light weight and works great in my daughters room. The only knock I can give it is the volume doesn't go real loud.  It is great for a bedroom but wouldn't recommend for a larger room (living room or kitchen) if there is potential for a lot of background noise.", "Date": "September 10, 2013"}, {"Title": "Great product!", "Author": "J. Johnson", "ReviewID": "RBK6TCU1O91FU", "Overall": "3.0", "Content": "It's a good tv for what I use it for, As a computer monitor. A little  pixilated, but other than that it's most definitely hi def and  inexpensive.", "Date": "October 20, 2013"}, {"Title": "average", "Author": "Sherry Walker \"Barb\"", "ReviewID": "RXM2VFWWPV94Q", "Overall": "2.0", "Content": "This tv has a good quality picture, but then any tv does these days. The sound quality is what is disappointing. I have to max it out and still need subtitles as a back up to hear over just a cheap but quiet fan in the room. The tv is only about 10ft away.Very poor sound on this one.", "Date": "August 20, 2013"}, {"Title": "Nice unit but...", "Author": "Ralph O. Richards", "ReviewID": "R1DV1BLREH1SDE", "Overall": "3.0", "Content": "Nice unit and nice size.  Clean design with minimal waste of space.  Seems to be pretty good construction and quality however... The volume control seems to be a bit touchy and hard to adjust in small increments.  Sometimes when trying to adjust the volume up or down by just a small amount, it goes ALL the way up or ALL the way down.  Doesn't always happen but enough to be annoying.  Not enough to send back for repair/exchange.", "Date": "August 20, 2013"}, {"Title": "Good value!", "Author": "Andrew", "ReviewID": "R24B54O4CK7755", "Overall": "4.0", "Content": "Bought this TV for my office, wanted something cheap to just show some TV. The positives are low cost, good picture, super light (mounted it myself), 3 HDMI inputs.The cons; the source button you have to hit OK after selecting a source. The internal tuner takes 2-3 seconds to change each channel... but I going to have a box for that tv so that won't be an issue soon.", "Date": "August 19, 2013"}, {"Title": "just ok", "Author": "travisty", "ReviewID": "R2SQP0RX1TSWXR", "Overall": "3.0", "Content": "The main thing that is sad about the chep brand LED's is that they dont maximize on the fact that the screen is super thin. The top and side few inches are as thin as my cell phone, but then the housing for all of the inputs is somewhere between an LCD, and a DLP TV, it is much less thin than a 8 year old LCD that i have, and about the same thickness as some of the newer DLP backlit TV's. Though it is extreemely light, so you know it is just empty plastic space. This could have easily been corrected with a more slim casing. (thats part of what you pay for with the name brands)The picture quality is so-so, i cant say for sure in comparison to other 720P TV's because i only have 1080P TV's to compare it to, but honestly if this is the difference between 720 and 1080, i can say for sure that 1080 is the way to go because there is a massive difference. I think that if i was using this TV as an actuall TV (im using it as a computer monitor) using it for gaming, or using it for movies i would probably return it/ not recommend it. but it is working just fine as a computer monitor, and i dont do much else on my computer besides internet and word processing, and the occasional photo editing.Pros: Very cheap price for the size, the TV has 3 HDMI inputs which is really nice, It is very lightweight. It does have standard wall mount pattern on the back and worked great with the mount i bought. The big and only A+ is the speakers, i guess thats the benefit of the large encasement, but the speakers on this are some of the best built in's i have ever heard. they sound much better than the other TV's i have owned, and though i know LED's are known for bad speakers, the others are high end TV's and dont sound this good. I have to use a sound bars with those, and with this on my computer i would be perfectly happy without having any sort of speaker or soundbar.Overall, for the price i think it is worth it, but if you want something to watch HD movies and play games on, pay a bit extra for 1080, again im not sure that even a high end TV with 720 would cut it for me now that im only used to 1080.", "Date": "August 13, 2013"}, {"Title": "Do not waste your money.", "Author": "Barbara Hanlon", "ReviewID": "R3U5F4G0F3C53B", "Overall": "4.0", "Content": "I have a 32 inch flatscreen which I bought less than a year ago.  The sound went  and I contacted their customer service.  I cannot tell you how many times I had to call these people back because they either cut me off or needed information from my receipt which I had saved but did not have handy.  Called back with receipt in hand and was told to send this tv back to them and they would make good on it.  They promised to send a replacement, however, I found the price for shipping to be exorbitant and they would not help with shipping costs etc.  I found other reviews about this company with complaints that after paying to send back their tvs, they were still waiting for the replacement.  These customers also received the same run around from the so called customer service department.  I have decided that I will not waste any more of my time on these thieves and I will have to purchase a new flat screen.  Of course, I will not be buying this brand and I will be telling everyone I know about these defective items.", "Date": "June 20, 2013"}, {"Title": "Nice economical television to use with my Roku", "Author": "Crafty Slacker", "ReviewID": "R2H67W100XPZF", "Overall": "5.0", "Content": "I bought this television on sale for a few dollars less through a local store, not from Amazon, however, I'm very pleased with it. I got the 19-inch, Model No. SE19HY10. The first one I bought had a stuck pixel, but the store took it back and gave me another one with a perfect screen. It connected easily to my Roku and DVD player and I even get a few local HD channels with a cheap basic indoor antenna with rabbit ears. I connected my Roku with an HDMI cable. My DVD player is connected with a regular AV cable, but I can also hook up it up with a composite cable, if I so choose. The rabbit ear antenna I connected with a coaxial cable. There is also an audio jack if you want to hook up an external audio device, a headphone jack so you can listen with headphones and a VGA connection so that you could use it as a computer monitor. The AV connections are located on the side of the television and the other connections are located along the bottom back. I switch between devices by pressing the \"source\" button on the remote control or the selection buttons on the top of the television.The picture is beautiful on HD movies and programs. Colors appear true and I haven't had to make any adjustments to contrast, brightness, etc. Set-up was very easy and it's small enough to fit in the limited space I have in my bedroom. The only complaint I have is that the stand is a little hard to attach and the screws quickly become stripped, so I don't recommend removing the stand once you have it firmly attached. I learned this after returning the first one to the store, because I had to take the stand back off. The stand fits on only one way, so be sure to have a good Phillips screwdriver and push it down tightly while you're screwing it in. As far as I can see, it's not wall-mountable.I can't speak to the quality of the speakers, because I use portable PC speakers connected to the speaker jack through which I listen with stereo headphones while I'm working at my crafts table. I look at the screen straight on from about 4 to 5 feet away and I haven't noticed any fade-out when changing viewing angles like I did when watching movies on my laptop. The best thing is that I can now turn my computer off and watch Internet TV on this through my Roku. So if you're looking for an economical HDTV with a small footprint that's easy to set-up with your Roku or other set-top box and DVD player, then I highly recommend this 19-inch Seiki.", "Date": "July 30, 2013"}, {"Title": "Fair TV", "Author": "Kevin Smiley", "ReviewID": "R3PVGWTP8WT1P2", "Overall": "3.0", "Content": "I got this for a good price...Prime shipping...YAY!!  The image is beautiful like all led TVs!  It is light easy to use.  The only thing I don't actually like about this TV is that the only audio out is a mini jack headphone plug that leave a constant buzz in the background when I hook it up to a amplified stereo source! :(  But I just turn the tv up as loud as I can so I don't have to turn the stereo up any louder than necessary!", "Date": "July 27, 2013"}, {"Title": "Picture quality not the greatest.", "Author": "Steven D. Sanders", "ReviewID": "RIC33MK5NV956", "Overall": "3.0", "Content": "I was a bit disappointed that the picture was not as sharp and as clear as I expected. I am probably too spoiled by the 48\" HD in the front room. For the price it is okay and it is just for the guest bedroom anyway.", "Date": "September 4, 2013"}, {"Title": "Blown away!", "Author": "Danny", "ReviewID": "R2VW30JVM9P1WA", "Overall": "5.0", "Content": "Excellent purchase! At first I was skeptical, but I bought this TV on black friday deals week for $98, and so far it's very nice! Picture is clear, speakers are good, of course all the settings are tweakable. Performs excellent as a PC monitor. Had a stuck pixel, but once I ran a pixel fixer and let the TV run for a little while it disappeared! Overall a very premium TV!", "Date": "November 30, 2013"}, {"Title": "Second TV", "Author": "Richman", "ReviewID": "R21SWJJO2ES6TE", "Overall": "5.0", "Content": "The Seiki Digital LED HDTV was very reasonably priced and has proved to be exactly what I expected . I would recommend this TV to anyone looking for a  second TV for a child's room", "Date": "August 13, 2013"}, {"Title": "Great for the cost", "Author": "Chas-u", "ReviewID": "R1HK1O89OZCELH", "Overall": "4.0", "Content": "It's probably a bit better than I was expecting from reading the other reviews. It doesn't have the widest viewing angle, but within the proper viewing angle the picture is acceptable. It was easy to set up and all the inputs work well. Great TV for the cost. I hope it lasts.", "Date": "July 25, 2013"}, {"Title": "TV for mom", "Author": "Deldrid", "ReviewID": "R3SWFYJ1E21J27", "Overall": "4.0", "Content": "Brought it for my mom to replace an older model she had . She absolutely loves the picture quality , great TV for a good deal ...", "Date": "April 21, 2014"}, {"Title": "good bargain tv", "Author": "Donald Moore", "ReviewID": "R1YXCQAB2Y4H9R", "Overall": "5.0", "Content": "I love the tv. gaming, dvd, roku is what i do and it's fine, no worries so far.... remote a slight awkward but not a deal breaker", "Date": "March 18, 2014"}, {"Title": "One of our best purchases this year!", "Author": "sdembo1", "ReviewID": "R2S15HO7KV1EWB", "Overall": "5.0", "Content": "This Seiki is an excellent value and we love ours. We purchased in early 2013 because of the great price, excellent HD picture, and did I mention great price? LOL The three HDMI inputs allow us to hook up our cable box, Roku, and Xbox 360. A lot of the pricier 32\" sets we looked at only had 2 HDMI inputs. No complaints here, just wish we had gotten more!", "Date": "December 3, 2013"}, {"Title": "Wow!!!! finally I get a chance to play my games in High Defintion and This Seiki brand gives me the Full Package!!", "Author": "Jeremy", "ReviewID": "R1Z56GKBBISKU0", "Overall": "5.0", "Content": "People please get this Type of TV it works great!!!! I put it on and it has the best picture quality I have ever seen for both my movie and Xbox 360 games.", "Date": "October 28, 2013"}, {"Title": "Our 3rd Seiki LED HDTV", "Author": "MissBetsy \"missbetsy\"", "ReviewID": "R3BEZML7PANBZM", "Overall": "5.0", "Content": "We purchased our first Seiki LED HDTV last year around the holidays.  I watched for deals and wanted the best bargain that got decent ratings.  We settled on this brand and this purchase was #3 to replace the last of our older tvs.  We have had no problems with any of them.  For us picture & sound is fine.", "Date": "October 23, 2013"}, {"Title": "Very lovely and beautiful TV.", "Author": "Ralph Willis", "ReviewID": "R3HNZHZ68SCTBN", "Overall": "5.0", "Content": "I love this TV, and the reason why I choose it was because it's not to big, and my room mate have one almost just like it. I enjoyed shopping on line, which is my first time, and it's a wonderful experience. You're allow to keep track of your packies at all time. When they said that you will receive what you order in two days...they hold up to there word (2 days.) The TV show very lovely and show some beautiful pictures. I just got to tell all of my friends about the wonderful and friendly service that you get dealing with Amazon,com. Thanks Amazon, you was right on time for me.", "Date": "October 21, 2013"}, {"Title": "DO NOT BUY!!!! JUNK!!! WASTE OF MONEY", "Author": "RainCityCoug", "ReviewID": "R29Q9EKYLYPACK", "Overall": "1.0", "Content": "I purchased this TV last month as a bedroom TV. I saw the great price and decent reviews online and decided to take a risk and purchase a TV that had mixed reviews... Boy do I regret it.It wasn't a few days before this TV had dead pixels forming before my eyes as I proceeded to tell myself it was a quality TV for the price. Next, the HDMI port proceeded to fail and cause the screen to be fuzzy, having to play around with the cord to get the picture back again. THIS TV IS LOW QUALITY. Sure, I expected sub-perfect quality, but I didn't expect a TV that is just absolutely un-watchable.Returning the TV was a nightmare and I don't wish it upon my worst enemy! I wish I would have just purchased a quality TV to begin with.After dealing with the return, I purchased a MUCH better TV for only $50 more. Trust me, $50 extra is worth the better quality TV and not having to deal with a bad quality TV and returning that bad TV.If you want a QUALITY 32 inch TV, check this one out -----> http://amzn.to/1gYLcMs, it is here on Amazon. I currently own it now and have never been HAPPIER! It has a great quality picture and wasn't insanely expensive like some of the other TV's for sale here. Please, save yourself the time and frustration that I put myself through!", "Date": "June 4, 2014"}, {"Title": "Great Television - Great price for a flat screen", "Author": "shoo", "ReviewID": "R5ZHSHIP2DDOG", "Overall": "5.0", "Content": "It's a very easy assembly/set up. It's the perfect size especially if you're in a 1 or 2 bedroom for the living or bedroom itself. Volume and picture quality is wonderful. Only had it a few days, but it's amazing so far. Get it.", "Date": "May 31, 2014"}, {"Title": "BEST TV FOR THE BUCK!", "Author": "Jeffrey", "ReviewID": "RX5AHFMN86M9T", "Overall": "5.0", "Content": "got it from Black Friday.. best tv ever for what i paid for. the sound is much louder than most tvs in my house, including a LG, samsung, Sharp and Sony!", "Date": "May 30, 2014"}, {"Title": "Real good TV for price", "Author": "Singletary Portable Welding", "ReviewID": "R3QZG9CQ9RVNBL", "Overall": "5.0", "Content": "I think this would be the biggest screen TV I have ever seen for under 200$No kind on problem with the shipping from Amazon or the programming of the TV.", "Date": "May 29, 2014"}, {"Title": "Great TV at a discount price", "Author": "Amazon Customer", "ReviewID": "R3L1WPWEMILB67", "Overall": "5.0", "Content": "Great TV at a discount price.  This is better or just as good a picture as a much more expensive TV I own.", "Date": "May 27, 2014"}, {"Title": "Great picture, no problems!", "Author": "Andrew T. Austin-Dailey", "ReviewID": "R3RI7F7YU5FSCP", "Overall": "5.0", "Content": "My son and I use the TV for videos, games, and as a monitor for our laptop.  We have had no problems.  The picture and colors have always been sharp.", "Date": "May 27, 2014"}, {"Title": "Too cheap... Spend the extra 40-60 bucks on something else", "Author": "Jennifer Lopez", "ReviewID": "R2TDNVCJA24174", "Overall": "1.0", "Content": "Came in box damaged after I spent 2 hours mounting and setting it up... Thought it was ok but when I turned it on screen was destroyed on the inside. Still waiting to be sent back for a refund. The backside females screw mount became dislodged while I was fitting the mount to it. Cheap crap. Go to best buy and get an open box tv... That's what I did afterward.", "Date": "May 20, 2014"}, {"Title": "GreatTv", "Author": "sallie peoples", "ReviewID": "RTBJ8Q4BU1R05", "Overall": "5.0", "Content": "love the tv and the price. brought it for  my granddaughter and she loved it.  she always had a 19 inch so she really was excited whenshe got the tv for her birthday.", "Date": "May 18, 2014"}, {"Title": "Great TV", "Author": "Rap expert \"RG\"", "ReviewID": "RILE6UXKQMF7T", "Overall": "5.0", "Content": "Bought it for my bedroom, perfect. Cant beat the price. I always get nervous buying tvs online, but this one works just fine. Any bad reviews are just picky people. I would Definately buy again.", "Date": "May 18, 2014"}, {"Title": "I am happy", "Author": "joshua", "ReviewID": "R2LJKP5E6M7QXI", "Overall": "4.0", "Content": "The tv has a few problems but over all it works just fine. I cannot complain about the service either.", "Date": "May 17, 2014"}, {"Title": "Great tv at a great price.", "Author": "Whitney Walter", "ReviewID": "R3R9A8LLIVK75G", "Overall": "5.0", "Content": "I have had this tv for about a month with no problems.  It does exactly what I need it to do. I don't have hd tv channels but I do stream from my laptop and it provides a great, quality picture.", "Date": "May 16, 2014"}, {"Title": "Great bargain on Black Friday...", "Author": "Jay Carter", "ReviewID": "R1OM0R07BS9ZN0", "Overall": "4.0", "Content": "I got this as a black friday bargain at $100, so quite frankly I wouldn't have been suprised if it was dead on arrival, but I am very pleased with this tv. The picture is great, the sound is just ok for a tv of this size, but I never really turn it up past 4 anyway since it is in a small bedroom. All in all very satisfied with the tv.", "Date": "May 16, 2014"}, {"Title": "Works just as expected!", "Author": "Joseph Williamson", "ReviewID": "RVGRX7W0B3XNA", "Overall": "5.0", "Content": "The screen is bright, the pictures good, and it's all put together well.The speakers are a little tinny, but I mean this isn't a high-end TV.", "Date": "May 15, 2014"}, {"Title": "It's okay", "Author": "Geniece", "ReviewID": "RNEBS11T7J752", "Overall": "3.0", "Content": "For the money, I got what I expected.  There is an area on the bottom margin that is lighter pixels until the tv warms up.  Weird.", "Date": "May 13, 2014"}, {"Title": "best tv for the price", "Author": "monk1967 \"ram\"", "ReviewID": "R1CKPDHWUMNZU9", "Overall": "5.0", "Content": "the quality of this tv is the best ever for such a low price and the quality of this tv", "Date": "May 12, 2014"}, {"Title": "For the price you can't beat it", "Author": "Jennifer E. Rodriguez", "ReviewID": "RSX2XY80W3V52", "Overall": "4.0", "Content": "Nice picture, sound is good also. This is our bedroom tv. My husband and I are very happy for the money you can't beat it.", "Date": "May 11, 2014"}, {"Title": "Surprized at quality and clarity!!", "Author": "Michael Scott Tate", "ReviewID": "R2YY6JDJYOKWUL", "Overall": "5.0", "Content": "for the price, I was blown away at the build quality, the expansion slots and the clarity. I will seriously  consider this when my other bedroom 32\" goes out.. 7 yrs going and never gets shut off!!!! has way past the 50000 hours. I hope this seiki lasts as strong!!!!", "Date": "May 10, 2014"}, {"Title": "Great Tv", "Author": "Barbara Mack", "ReviewID": "R26I7RWSQRH5FL", "Overall": "5.0", "Content": "I enjoy this tv because it has a clean picture and the sound is very nice. I wanted to try this tv because of the price and size. I uuse it in my bedroom on weekends only.", "Date": "May 10, 2014"}, {"Title": "very goog tv", "Author": "Charles Ledbetter", "ReviewID": "R21BWP3UH72B3Q", "Overall": "4.0", "Content": "works good, great picture, easy to operate, great pricegreat hookups for other devices ect.would reccomend to buy this item.", "Date": "May 9, 2014"}, {"Title": "worth the buy!", "Author": "Jasmine", "ReviewID": "R2Q0LQGPB2HCI7", "Overall": "5.0", "Content": "I made the right choice here, people! I was a bit skeptic on buying this brand online given that I've never seen one in person, but I decided to go ahead and buy it to upgrade from my Samsung box TV that I've had and it did not disappoint! Its super light, does everything I'm looking for. I connect it to my laptop through HDMI cable so I could watch movies I've downloaded and the resolution looks spectacular! I have a couple of 1080 movies which look clear and wonderful on the screen so don't be intimidated by the 720. I bought the Ematic Component Wall mount as well as the VideoSecu tilt swivel product on amazon as well and boy, does it look good! I recommend this TV to anyone not wanting to spend big bucks.5 stars for me!", "Date": "May 6, 2014"}, {"Title": "as described", "Author": "R J", "ReviewID": "R2E1YPQNCYUZZG", "Overall": "3.0", "Content": "TV works fine. Thought it was a better deal than it was (open box deal). Amazon cut no slack when pricing it with shipping. Saw it brand new at a Box Store for less than I paid & it wasn't an (open box) or (sale price). Its used in a small extra bedroom & is fine for that purpose.", "Date": "May 6, 2014"}, {"Title": "Extremely Happy dude", "Author": "David Collier", "ReviewID": "R1FET5O2RIERO1", "Overall": "5.0", "Content": "I got the best buy ever, much more then I expected very light weight easy to  move about. Not recommended for child's room easy to knock over. And all that matters is choice. recommend this TV.", "Date": "May 4, 2014"}, {"Title": "nice tv", "Author": "kelli knight", "ReviewID": "R2Y23FOSXMVDI3", "Overall": "5.0", "Content": "easy to set up. the tv has a great picture and sound. works easy to hook up all the video games.", "Date": "May 1, 2014"}, {"Title": "I love it", "Author": "00ALIEHS00", "ReviewID": "RRUY23D1Q05KQ", "Overall": "5.0", "Content": "nice look, low cost, works perfect whit my ps3 on 1080p. it look clear and beutifull. buy it directlu to mazon. recommended", "Date": "April 30, 2014"}, {"Title": "I turned this brand new TV on and it had ...", "Author": "Scott Jensen", "ReviewID": "R3OLRANIWMOHKR", "Overall": "2.0", "Content": "I turned this brand new TV on and it had a bright blue line running vertically through the picture. I'm giving it 2 stars because Amazon let me return it hassle free.", "Date": "April 30, 2014"}, {"Title": "Great TV", "Author": "ELLEN HEBERT", "ReviewID": "R189QJYY07BE8U", "Overall": "5.0", "Content": "TV works great, clear picture. No problemsCan't say anything negative about it. I would recommend this TV to anyone.", "Date": "April 30, 2014"}, {"Title": "Great Value TV", "Author": "LGGonzalez", "ReviewID": "R24MUNFC327R4U", "Overall": "5.0", "Content": "I bought this TV on Black Friday at a steal.  It was well worth the price and I will definitely buy another Seiki.  I bought this for our kids room, so we would not fight over the living room TV.  It has a great picture and a good amount of connections on the back, I have a Blu-Ray player and a Roku hooked up to it.  They both look pretty good!  This is a best bang for the buck type of TV.", "Date": "March 18, 2014"}, {"Title": "Perfect bedroom TV!", "Author": "P. Nguyen", "ReviewID": "R2N9C8BQQGLM2P", "Overall": "5.0", "Content": "This TV is great as a budget TV. It was by far the best Black Friday 2013 deal on a 32\" TV. The bezel is thin and the TV looks attractive. It has been working perfectly!", "Date": "March 6, 2014"}, {"Title": "Great TV for the price!", "Author": "C. Adams \"C Adams\"", "ReviewID": "R1A4CXSGZ3221X", "Overall": "5.0", "Content": "I got this TV on black Friday at a great price ($99) for my younger brother.  It looks great and for the price it couldn't be beat!  Much like other off brand TVs, they look great when not sitting beside a higher end TV.  This would be great for a bedroom or other small room.", "Date": "March 3, 2014"}, {"Title": "QAM Tuner Code", "Author": "TheRenoChick", "ReviewID": "R23W87IINGBQKR", "Overall": "3.0", "Content": "I was not able to plug & play this TV through my set top cable box.  It wouldn't find channels.Couldn't go into channels - had to go buy a rabbit ear antenna in order to find air channels, then I was able to go to channelsYou go to QAM there, and then it asks for a code (which isn't in the manual and you have to call or email SEIKI for)It is universal - and it's 31415 - it will ask for that code - enter it hopefully then the TV will find both digital and analog channels.HUGE HASSLE.", "Date": "February 22, 2014"}, {"Title": "For $98, it's the Best TV Ever!", "Author": "Brandon Howard", "ReviewID": "R1DWHVJOXW542J", "Overall": "5.0", "Content": "Got it during Blackfriday during a lightning deal for my Beau and yea, this TV rocks.  It's works better thana  $98 LCDTV should!  Perfect for someone who doesn't care about HD, or Blu-ray, but simply wants to watch Girls on HBO and the Food Network.", "Date": "February 20, 2014"}, {"Title": "GREAT Value!", "Author": "Sean Fitzgerald", "ReviewID": "RS7O1QVGQ695X", "Overall": "4.0", "Content": "I'm not an expert on picture quality or anything like that, but we bought this for our bedroom and it was easy to install and the picture quality is quite good.  For the price, this is an exceptional value!", "Date": "December 30, 2013"}, {"Title": "Good so far", "Author": "T. Smith", "ReviewID": "R2M3EJVFUOGWSJ", "Overall": "4.0", "Content": "Got this TV during Black Friday sales. Really nice sound for a budget television. Picture quality is good and family is happy with it.", "Date": "December 30, 2013"}, {"Title": "Great TV For The Price", "Author": "Rich Radio BKNY", "ReviewID": "R36K18Q25AAB30", "Overall": "5.0", "Content": "I absolutely love this TV. I purchased it for my mom foe her 75th birthday. Great sound,  and picture. I'd recommend this to anyone looking for a slim flat panel TV.", "Date": "December 19, 2013"}, {"Title": "Excellent budget TV set", "Author": "Charlie Furlani", "ReviewID": "R3V6FUKLZDPB0F", "Overall": "4.0", "Content": "Full disclosure: I got this as an Amazon Lightning Deal for about $95, so my expectations may have been set a bit lower than some.But, overall, I am very impressed with the set. Picture quality is excellent, native resolution of the panel is 1360x768.Colors and sharpness look pretty good even out of the box, and get better with tweaking.The major downside is the speakers. I've not owned a budget TV set such as this before, so I don't have a whole lot to compare it to, but there is virtually no bass with the built in speakers. It gets slightly better when increasing bass from the TV settings, but not much.", "Date": "December 18, 2013"}, {"Title": "Good basic HDTV", "Author": "s4v8", "ReviewID": "R348CVRNCY5AFB", "Overall": "4.0", "Content": "Got a great deal on this TV during black friday.Only a couple of issues that I've noticed:1. Viewing angles is not that great and there's a bit of light bleed around the edges.  Not a big deal since it's a small screen that's really suited for direct viewing and not large superbowl viewing parties.2. When using an Antenna with this TV selecting a channel can be confusing.  My local TV station is 25-1.  If I enter \"25\" then the TV selects channel 24-1.  To get channel 25-1 you have to specifically enter \"25-1\"Both issues above are minor and not dealbreakers considering the price I paid for it.", "Date": "December 18, 2013"}, {"Title": "Great TV at a great price!", "Author": "jason rogge", "ReviewID": "RULJD9F22OE7E", "Overall": "5.0", "Content": "Scooped this up on a black friday sale.  Unbelieveable...$98 Thanksgiving day.  Awesome upgrade to my home computer for sure.  And can't beat prime 2 day free shipping.  It was mounted to the wall in my study 2 days later.  Kudos to Amazon!", "Date": "December 14, 2013"}, {"Title": "This isn't a true HD TV! It needed a qam tuner!!", "Author": "Carolyn", "ReviewID": "R3A20O9NJ2MK8U", "Overall": "1.0", "Content": "I bought this tv on Thanksgiving 2013. It was a super super low price and I was using it to update a tv in room that we don't use much so I kept it but not without much frustration and additional costs to me. We were trying to use it in a room that didnt have a cable box but just coaxial cable. The tv NEVER would scan to get the free local digital channels. I tried every possible way to scan for those channels and even moved it to another room where our other Sharp and LG HD TVs worked. It was pretty obvious that the tv was missing something. I tried to call Seiki and I couldn't get past having to leave my name and a message. Seikis customer service is horrible and I don't recommend buying anything from them. I also tried to use Amazons technical support and they insisted the tv should get those free HD digital channels. Amazon was helpful but didnt really help solve my problem and offered a full refund. Finally after call 6 I got through to Seiki and they claimed the tv needed a qam tuner to get those freeHD channels. Talk about false advertising! So we bought a qam tuner for $50and the tv gets those HD channels now AFTER we had to rig up a splitter. Don't buy this tv unless you get it super super cheap and want to be frustrated!", "Date": "January 10, 2014"}, {"Title": "Avoid Seiki", "Author": "G. Turbin", "ReviewID": "RLDIODT6WKIBE", "Overall": "1.0", "Content": "Picture went out in 8 months (common w/ Seiki). After over 1 1/2 months, emails, and 10 hours of being on hold and conversations w/ Seiki Customer Support, I am still waiting on them to process and ship my replacement. (though I have been told many times they are waiting on UPS) A simple search on online I found that many others have an identical experience with the product and company.", "Date": "October 18, 2013"}, {"Title": "Worst TV EVER!!!", "Author": "Michelle Snider", "ReviewID": "R3SVSW8ZPX8LA7", "Overall": "1.0", "Content": "I bought this TV not through Amazon but from Kmart.  I've been googling information on Seiki because after 7 month of having the TV it just turned off and wouldn't work.  I sent the TV back to Seiki, they reassured me the warranty covered a replacement within 6 business days.  They told me I was approved.  After that, I never received the TV.  They received the TV 9/6/13.  To this day now, I email them I get no response, I call them I'm on hold until the music stops and I get hung up on.  This is such a waste of my time, and now I have to report them to the Better Business Bureau.My advice, deal with a real company.  Spend a little more.  At least you won't be wasting so much time trying to deal with this.", "Date": "November 11, 2013"}, {"Title": "Item not fully compatible with my Optimum remote.", "Author": "cpg", "ReviewID": "RCUX1XD9XS8MU", "Overall": "3.0", "Content": "The TV is great - picture, sound, ease of setup, etc.  However, when I connected my Optimum remote control, all functions except the sound control worked, and I had to use the Seiki remote for this.  I called Amazon tech support and Optimum support and the problem could not be resolved so I returned the unit.", "Date": "April 22, 2014"}, {"Title": "great", "Author": "Angela B.", "ReviewID": "R2Z9X28L8CS5L6", "Overall": "4.0", "Content": "Love the picture quality. The volume is very different from the other tvs but it is still great too. I would buy another one of this brand again.", "Date": "April 21, 2014"}, {"Title": "Probably as good as you can reasonably expect", "Author": "Otend", "ReviewID": "R3LA0SEGHPCZWQ", "Overall": "5.0", "Content": "This is far from a perfect TV, but for the price, it's extremely good.  At a higher price, it'd be a 3 star TV at best, but in its price range, it's great.  The colors are fairly good, it has an audio output that means that I can just use my own audio equipment rather than using the built-in ones (hence my lack of knowledge as to their quality), it generally looks nice, and it's under two hundred bucks (as of the time of this review).On the downside, assembly is a bit annoying, partially because I didn't have any screwdrivers of the exact size (and none were provided), resulting in the screwdrivers being stripped.  As such, I needed to shove things under the TV to balance it.  There's also some noticeable light bleed.  That being said, neither of these detract too much from the final product.If you want a TV in this price range, it's probably your best option.  You can definitely do better at higher prices, but I'm not so sure about that in this range.", "Date": "April 20, 2014"}, {"Title": "No HDMI Audio No Help", "Author": "Matthew Dwane", "ReviewID": "RVNP9WN98EVVH", "Overall": "1.0", "Content": "My HDMI audio work with all other TVs, not this one.  I tried to get help they had no assistance, I went through all Windows troubleshooting tasks however nothing is working.My HDMI audio is fine with my Toshiba and Cosmo TVs.", "Date": "April 17, 2014"}, {"Title": "Great Little TV", "Author": "Rick R Landmon", "ReviewID": "R1EFRKU9YQQYD6", "Overall": "4.0", "Content": "For the price it's been a great tv. Picture was better than I thought it would be..... I like the whole general set up", "Date": "April 17, 2014"}, {"Title": "Great tv at a great price!", "Author": "Stephanie Raitto", "ReviewID": "R17M9ZG726WXON", "Overall": "5.0", "Content": "I could not be happier! This tv works perfectly and has all the bells and whistles of a much more expensive tv. Super light, 3 HDMI ports, clear HD picture, good sound... and cheap, cheap, cheap!!!", "Date": "April 11, 2014"}, {"Title": "Great TV/PC Monitor for the Price!", "Author": "Guitar Operator \"Guitar Operator\"", "ReviewID": "R1JA583OOIDAXW", "Overall": "4.0", "Content": "I am not reviewing this for TV or even high quality video applications.The main reason I got this TV is to use as a PC/Computer monitor.I needed a larger screen but did not want to shell out the big bucks for an expensive monitor made for PC or computers.This TV works great, but keep in mind I am not using it for high quality video editing or photo applications, though I edit videos and photos just fine as a \"regular user.\"I am sure this TV is not great by any standards except for price.If you need a larger screen, have trouble seeing small text, etc., buy this and try it out.I always get the extra warranty just as a precaution and peace of mind.I had trouble at first when using with a KVM switch (hooks two computers up to one keyboard, monitor & mouse) as the switch would not support all modes. When connected directly to the PC video card it works great!The USB port only seems to recognize JPG photo files and nothing else. I tried AVI, WMV, MOV, BMP, PNG, FLV, MKV...none of those files were even recognized and did not show up in the menu.The speakers are kind of crappy but so are the ones on my new and slightly expensive 47\" LG - normal for nowadays.It stands up without the included stand, but I suggest using the stand for full support.Nice to see that it uses LED lighting. My old monitor went out because the old mercury fluorescent lights burned out.3 HDMI ports was also a nice surprise.Audio INPUT is through using the 1/8\" (3.5mm) headphone jack.Audio OUTPUT has the standard two RCA Red & White connectors.Digital Audio Output SP/DIF RCA connector.VGA 15 pin for PC/Computer video.Although it is not full 1080p, the 720p size is just fine for my needs and price range.It is so much nicer to see things larger!I am not a gamer, but again, for the price, you get a pretty good & large TV/monitor.CON: If it cannot find a channel through the \"scan for channels\" function, you cannot select a channel unless it can find it first.There is a way to fine tune the advanced options and adjustments, but using the controls available I can get a great picture.The text is fairly easy to read, but the greys seem a little green when black text is not as bold. Not quite as sharp as a dedicated PC monitor, but works well enough for older eyes, and did I mention the nice larger screen? -lol.It has a energy saving mode that will shut itself off within a couple of minutes if there is no signal present, so that works well with the PC screensaver and/or power off modes. It automatically senses a signal and turns itself back on. (energy mode.)It takes about 7-8 seconds to \"boot up\" maybe not as fast as others, but \"geez, eight seconds ain't fast enough?\"Stand is cheap plastic and fairly sturdy if not violently abused.(Sure would have been nice to get this for the ninety-eight dollar black Friday price.)I paid full price, plus the extra warranty and am quite happy.If there are any dead pixels, splotchy screens, dark, etc., send it back until you get a good one.This was the first one I was sent and it's a keeper.Hope this helps!", "Date": "April 10, 2014"}, {"Title": "Clear picture", "Author": "Claudia", "ReviewID": "R24JNDVDALA5ZI", "Overall": "4.0", "Content": "I bought this for my daughter at college she says she like it and the picture is clear and very nice size. It just did not pick up her cable channels at college she does not have a box so it is not picking all the channels but other than that she has no complaints. Any suggestions. I even had her try the qam steps someone else previously recorded. And I also told her to talk to someone from university maybe they could help. It this problem could be solved it would be 5 stars", "Date": "April 8, 2014"}, {"Title": "Liars", "Author": "Adam Swartz", "ReviewID": "R2J24WIL4WH4ZD", "Overall": "3.0", "Content": "The QAM thing posted in a few reviews either got back to the company or they are all liars. I followed the instructions to a T but there is no \"other settings\" or \"qam\" anywhere on any of me setting screens. Thanks anyway. I still think it is a good deal.", "Date": "March 31, 2014"}, {"Title": "Works and looks good", "Author": "Dante Infierno \"bm reader\"", "ReviewID": "R1Z79B0A2YUBCN", "Overall": "5.0", "Content": "I needed a smaller tv that could fit in my car and I could connect my second console to it, this tv is perfect for that. It looks great, has 3 HDMI ports and sounds great too. I only paid about $100 for this tv so I didn't expect much but I'm glad I bought it. I purchased it as mainly a back up tv in case my older 56\" samsung goes out, which I thought it would but hasn't as of yet, so I don't use this tv that much. Will definitely update if anything changes.", "Date": "March 22, 2014"}, {"Title": "Perfect for what we wanted", "Author": "Gary J. Kelly", "ReviewID": "RRN1BIY77Q0ID", "Overall": "4.0", "Content": "The picture is fine, although we aren't running HD to it.  The sound is fine.  If I had one negative thing to say it would be about the remote.  It's the only remote in this household where the volume control is on the right, where channel controls usually are.  As a result I forget and when I go to change the channel I end up changing the volume, and vice versa.", "Date": "February 11, 2014"}, {"Title": "Great little TV for a small room.", "Author": "William R. Brown", "ReviewID": "RAI718DXUZOPT", "Overall": "5.0", "Content": "Clear picture with good color.  Easy to use AND the control buttons are on the top, if you should misplace the remote...(ps  it's probably down there between the cushions.", "Date": "January 8, 2014"}, {"Title": "Black Friday deal. Not worth much more.", "Author": "emilio ortiz", "ReviewID": "R2AAL3T2B2WRH8", "Overall": "3.0", "Content": "Got it for $98 on Black Friday. Definitely a good deal. But I would not pay more that $150 for this tv. Screen refresh rate is a little wonky. Ghosting on fast moving images. Very cheaply made. It has a powerful Amplifier. But the speakers cannot handle the power. Lots of distortion if you go more than 50% volume. Plus side its incredibly light. Great tv if you need to move it alot. Not the best, not the worst.", "Date": "December 5, 2013"}, {"Title": "Perfect", "Author": "Washington", "ReviewID": "R32VU6IBX00MVH", "Overall": "5.0", "Content": "Digital all the way,really lightweight and the picture is amazing, this is been use on a RV. Really,Really recommended ,", "Date": "September 27, 2013"}, {"Title": "absolutely amazing", "Author": "Chrissy", "ReviewID": "R27CUMWZSU1FBQ", "Overall": "5.0", "Content": "The first one we got was broken. Amazon replaced it within 2 days, reminding me of another reason why I love Amazon. The second one is absolutely awesome. It works really well and look beautiful even when I don't wear my glasses. The TV itself is a humongous improvement over our little 19 inch and fits perfect on our entertainment center. Dragon's Dogma looks absolutely amazing on this.", "Date": "August 9, 2013"}, {"Title": "I warn you \"DO NOT BUY THIS TV\"", "Author": "Minjung Park", "ReviewID": "R1WFAVAGUAEF1T", "Overall": "1.0", "Content": "the TV I bought last year broke after 2months and received the replacement TV after \"3 MONTHS\".they have horrible customer service, and the quality of TV is just terrible.I strongly recommend you to DO NOT BUY THIS TV.", "Date": "March 18, 2014"}, {"Title": "Seiki TV", "Author": "M. Robson", "ReviewID": "R32Z1YVSH3YTV8", "Overall": "5.0", "Content": "We bought this TV as an extra TV for our bedroom. The picture is very good. We would buy it again and we highly recommend Seiki.", "Date": "August 19, 2013"}, {"Title": "Unbelievably light", "Author": "Ismail Rustamov", "ReviewID": "RZ8A41AHB0PIY", "Overall": "5.0", "Content": "Very light LED TV of good quality. Best for smaller bedrooms. One of the best values available in the market.", "Date": "August 18, 2013"}, {"Title": "Buyer Beware", "Author": "sharon", "ReviewID": "R3S7M4ECNP2URA", "Overall": "1.0", "Content": "I read the reviews and several said the picture was not crisp and the sound was not up to par.  Other reviews had no major problem so I ordered it.  My luck sound and picture were both sub par.  I was trying to save some money, as this is my kitchen TV, but the quality wasn't there so I returned it and ordered a Samsung for $30.00 more.  As usual, Amazon gave me full credit for my return.  My Samsung is great and I am a happy customer.", "Date": "November 4, 2013"}, {"Title": "My review", "Author": "Rodrigo", "ReviewID": "R3MUM7NFN7F8QR", "Overall": "2.0", "Content": "It was okay, it was supposed to be a 32inch but it came out to be a 28inch so yeah", "Date": "May 15, 2014"}, {"Title": "Doesn't work. Criminal.", "Author": "Tom", "ReviewID": "R6EXBNLJUPA2J", "Overall": "1.0", "Content": "I got this TV tonight. It worked for a few hours and now it won't turn on. Also tried the remote. Put brand new batteries in it, but it does nothing. I suspect it's a hollow piece of plastic. Selling these TVs is akin to theft. Someone needs to be held accountable for this garbage and waste.", "Date": "May 15, 2014"}, {"Title": "i like the seiki 32 inch hdtv", "Author": "Don", "ReviewID": "RVKXHONR7VFE0", "Overall": "4.0", "Content": "it's working find no problem yet, my friend love the sound and color, she connected the base and had no problem", "Date": "April 26, 2014"}, {"Title": "Worst Fkat Screen EVER!", "Author": "Barry Godusky", "ReviewID": "R164G8MV0XFNZ8", "Overall": "1.0", "Content": "This TV belongs on the scrap pile of which it will definitely be once my new Panasonic gets here. It constantly has to research QAM channels and then it forgets them after you turn the dam thing off.The words I'd like to use to describe this brand of TV can NOT be used on this site.If you are considering buying one of these anosijfg? pieces of JUNK, DON'T!If I don't trash this piece of garbage I may take the LCD out and use it on one of my electronic projects, maybe for the raspberry PI!Other wise it is  piece of !?<>{}|\"::( garbage, DO NOT BUY!", "Date": "April 14, 2014"}, {"Title": "Great purchase for the price.", "Author": "darthhillbilly \"Kevin S.\"", "ReviewID": "R1ADF4MQ0TPSE8", "Overall": "5.0", "Content": "I caught this item in a lightning deal on \"Black Friday\". For $99 bucks it can't be beat. I put this t.v. in my kids room and hooked up their ps3, and they couldn't be happier. The best product I bought from Amazon all year.", "Date": "January 22, 2014"}, {"Title": "great tv poor sound", "Author": "Gary", "ReviewID": "R8XVKZ1D5O5JA", "Overall": "4.0", "Content": "I bought this tv during black friday week for $98. This tv is great and has a nice quality the only complaint is the poor quality. I got a sound bar to improve the sound.", "Date": "January 14, 2014"}, {"Title": "Enjoying the Amazon Gold Deal", "Author": "B. Buller \"Young Money\"", "ReviewID": "RK4L2F81AEQGU", "Overall": "5.0", "Content": "TV works just fine. We have it in our workout room and it just runs as it should 720p is more than adequate for UVerse. Happy buyer.", "Date": "January 13, 2014"}, {"Title": "What a deal!", "Author": "Tara", "ReviewID": "R32X1WGG8K4FBE", "Overall": "5.0", "Content": "Caught this and the other 2 Black Friday Week TV deals.  All are more than decent TV's for the price.  This was a gift for my sister and she is THRILLLED with it.", "Date": "January 3, 2014"}, {"Title": "Very good product", "Author": "Paula E. Phillips", "ReviewID": "RPFN042YLNBMB", "Overall": "5.0", "Content": "This TV has worked out very well to suit our needs.  No problems so far.  Good product at good price.", "Date": "January 3, 2014"}, {"Title": "This is a great tv for the price", "Author": "Linskey", "ReviewID": "R2HQ5UI3L0FXE5", "Overall": "5.0", "Content": "Just received this 19 inch tv for my bedroom and set it up and for 88 bucks I couldn't be happier. I can't speak for longevity, but the picture is great, the setup is easy, the sound is adequate and I'm glad I bought it. My only complaint is I couldn't seem to get the base securely installed and it's not real stable. Other than that - nothing to complain about. If anyone knows why the base doesn't seat well, please tell me what I did wrong!", "Date": "December 31, 2013"}, {"Title": "Great tv", "Author": "GaDawgs5253", "ReviewID": "R3R19MC566JUZ", "Overall": "5.0", "Content": "Good picture.  Light weight. Got this for our bedroom and it works perfectly.  Best black friday deal I ever got.", "Date": "December 31, 2013"}, {"Title": "Perfect TV for kids", "Author": "Christina Bragge", "ReviewID": "R3E3WW4E1O53TA", "Overall": "5.0", "Content": "Rating this 5 stars due the fact that when you pay less than $100 for a TV delivered, there really aren't much expectations besides that it turns on. Hooked up the satellite box & XBOX360 to it and seems to work like a champ so far. At this price I would highly recommend it for use anywhere where you just want a basic flat screen with no thrills.", "Date": "December 30, 2013"}, {"Title": "Great TV, Great Price!", "Author": "Erick Carmona", "ReviewID": "R1ON1W6QC7M2CB", "Overall": "5.0", "Content": "I purchased during the Black Friday Lightning Deals for only $98! A great TV with OK Picture and Great Sound!", "Date": "December 30, 2013"}, {"Title": "Good for the $$$", "Author": "Jonathan M. Franzese \"jonfran21\"", "ReviewID": "R1DES3HRUHCN5A", "Overall": "4.0", "Content": "Easy to hookup, right price, quick shipping and worked right out of the box. Have as gift to the in laws to replace 500lb tube tv, they love it", "Date": "December 30, 2013"}, {"Title": "Good Value", "Author": "Marvel L Nolan", "ReviewID": "R3SWN9OC4ZYZK4", "Overall": "5.0", "Content": "Excellent tv for the price ($98 on black friday). Good Value and fast shipping. Not the best specs, but it was a gift for a kid, so they love it.", "Date": "December 30, 2013"}, {"Title": "Works well.", "Author": "Juan from Minnesota", "ReviewID": "R1B13F2BAMCDF0", "Overall": "4.0", "Content": "Got this HD television for my mother (who still had an older style television). Hooked up the antenna, plugged it in, scanned for channels, so far so good . . . THANKS!", "Date": "December 30, 2013"}, {"Title": "Great TV for the price", "Author": "Dustin Duncan", "ReviewID": "R2M04FGAI9GDN0", "Overall": "4.0", "Content": "To my surprise, this little TV has a very good picture unlike other cheap TV sets I have seen.  The only thing lacking is the 'smart' TV aspect, but that's what chromecast is for.  I bought this TV for my bedroom on sale for $98 during the black friday event this past year and I could not be more happy for the picture quality.", "Date": "December 30, 2013"}, {"Title": "So far so good", "Author": "Cheri (Michael)", "ReviewID": "R267KJYV4JEI23", "Overall": "5.0", "Content": "We bought this TV for my son for his room for Christmas 2013. So far, so good. No complaints at all", "Date": "December 30, 2013"}, {"Title": "Gaming TV for the boys", "Author": "haha", "ReviewID": "R3AHX2KQ9LRWM0", "Overall": "5.0", "Content": "Bought this TV for $98 on Black Friday for my kids video games. As soon as they opened it, it was wisked away to the gaming room. Their previous TV wasn't HD and had rear cable hook-ups. Those two things alone make this one so much better.  I haven't heard any complaints.", "Date": "December 30, 2013"}, {"Title": "Great Value!", "Author": "Michael E Boulds", "ReviewID": "R6ESAB77YN31J", "Overall": "4.0", "Content": "I bought this as a Christmas gift for my son to go in his room.  It is working great!  I was lucky enough to get this at a Black Friday price of $98!!!  The only thing that is holding me back from giving it five stars is the stand.  It is kind of flimsy, but we can deal with that.  The picture is great and the sound is decent.  It is perfect for a kids room.", "Date": "December 30, 2013"}, {"Title": "Good TV for the price", "Author": "Amazon Customer", "ReviewID": "ROP7GQ6IQDJP5", "Overall": "4.0", "Content": "Purchased this as a Black Friday special.  Very good image quality for what I use it for.  Like many TV's of this type, the speakers are on the back making sound a bit tinny.", "Date": "December 30, 2013"}, {"Title": "Disappointed.", "Author": "Samantha", "ReviewID": "R27L9PBXNOQCOG", "Overall": "2.0", "Content": "I was in the market for a cheap TV for my bedroom and ended up choosing the 28-inch Seiki after seeing a 24 and a 32 in the store. In store, the display on these things looked BREATHTAKING. Better than most of the high end brands. So I thought, wow, what a deal! I'm not a huge cable person for my bedroom setup, mostly DVDs and retro games, and I've seen fantastic image quality on relatively cheap televisions when it came to watching films so I was sure this was exactly what I was looking for.Then it came, and, well.Setup is easy enough, I'll give it that. It's attractive. A little thick, but not horribly so. Stand was sturdy, screws went in easy.However, immediately I noticed two things:1. The quality in terms of sharpness was phenomenal for a low price TV. No complaints there.and 2. The colors, particularly on skin and hair tones, were quite desaturated.Assuming this was only the cable quality, I stuck in a DVD to find... it looked worse. Unless a scene was very highly saturated (abnormally so), skin took on an almost gray color. The contrast seemed off. I had to adjust the brightness way down, and even when I did, the black on the screen was incredibly unbalanced and actually appeared navy blue. I tried putting the colors to the 'warm' setting, and still found everything took on a blue/purple hue. I played around with it for a good 45 minutes trying to make something look good, but between fighting with the menu that was half the time, unresponsive, or jumping back to options I didn't want, and half the time appearing on it's own... I gave up. Unfortunately, it was a bad enough picture I opted to have it returned.Yes, it's a cheap television. Yes, you get what you pay for. But again, I've seen better for less, and to see such a poorly colored picture on something that looked so deceptively nice in-store was just a bummer.Maybe it was just a defective set, but who knows.", "Date": "December 27, 2013"}, {"Title": "Got this for $98 on black friday via amazon lightening deals and gifted it to a friend", "Author": "David Zuckerman", "ReviewID": "R8667QKIMQDLM", "Overall": "5.0", "Content": "My friend likes it.  Nothing more to it really.  Works just fine as far as I know.  Played Mario Kart on it and it looked good.", "Date": "December 20, 2013"}, {"Title": "Picture seems great for under 100", "Author": "C. Behrends \"New Age Geek\"", "ReviewID": "R3MIEB5JROYC8K", "Overall": "5.0", "Content": "Uses less power than my old 32in plasma lolComes with 3!!! HDMI I was shocked when I seen this.  USB for my chromecast is always a plus also!Picture seems great for under 100.  Bought the warranty for it for 5 years so I shouldn't have any problems with it :).", "Date": "December 12, 2013"}, {"Title": "GOOD VALUE FOR THE MONEY", "Author": "B Herendeen", "ReviewID": "RX58A9DLXX1K1", "Overall": "4.0", "Content": "Keep in mind you get what you pay for, so don't expect a lot, but I still think it's good value for the money.  I purchased this TV for my sewing room. As with other reviews, the TV stand is a bit wobbly in spite of screwing it on.  I would have preferred a stand that was adjustable so that I could tilt it, but again, you get what you pay for.  Volume is a bit dicey as well.  Have to adjust it periodically.", "Date": "December 9, 2013"}, {"Title": "nice for the price", "Author": "R D", "ReviewID": "R11QW68PEPMLWC", "Overall": "4.0", "Content": "I've never bought this brand before and no nothing about this brand but for $89.00 I thought what the hell, I'd take a chance. ....so far so good....have a lg bluray player connected via HDMI and has a beautiful picture for a 720p 60hz tv;  I'm very impressed.  I would most likely buy again (I'm a LG guy so it would only be for a gift or extra tv, like this one, which wouldn't get used very much) I'd be curious to see the quaility of a bigger screen of this brand", "Date": "July 21, 2013"}, {"Title": "DO NOT BUY!!!", "Author": "Rachel Wike", "ReviewID": "R3O07QITBU3MJA", "Overall": "1.0", "Content": "This is the worst product I've ever received from an online purchase. The picture on the television is HORRIBLE!!! I have to be standing/sitting directly across from the screen in order to even see what's playing. Also, says its HD but I can't get any HD or digital channels. I only receive analog. Not sure if that's my cable or the TV. Do not buy!!!", "Date": "November 4, 2013"}, {"Title": "Don't buy an off brand!", "Author": "Roy Chapin III", "ReviewID": "R1USLQ5WK9ALK1", "Overall": "1.0", "Content": "After purchasing multiple Seiki 32\" for a rental unit, we were informed by Cox (the cable provider) that the Seiki units were not compatible with with the Cox remote.  This means 2 remotes for each unit, there by increasing the chances of loss or tenant calls.  Very sorry we tried to save the $ and irritated that Amazon does not post a warning on the sale site.", "Date": "April 21, 2014"}, {"Title": "Pleased with item and glad I purchased.", "Author": "Deborah K Selby", "ReviewID": "R1BMFP9XJEPT4K", "Overall": "5.0", "Content": "Great item with no problems and seems to be just what I thought it was when purchased. Would buy again if needed.", "Date": "November 21, 2013"}, {"Title": "Sorry I can't tell you more", "Author": "SOG", "ReviewID": "R3R2DYZ0WX0N8Z", "Overall": "4.0", "Content": "I bought this TV for my son who is a college student in Alabama. According to him, everything is fine and has a very good picture.", "Date": "October 28, 2013"}, {"Title": "Poor Image quality!", "Author": "mistik04", "ReviewID": "R1VNJDCTSDGLKL", "Overall": "2.0", "Content": "Cheap TV at $199, however, I bought a Samsung 32'' 720p 60Hz at the same time and comparing the images, it's clearly visible that the seiki is terribly inferior.I won't recommend purchasing.", "Date": "October 26, 2013"}, {"Title": "HORRIBLE CUSTOMER SERVICE", "Author": "jimmy", "ReviewID": "R255GYWTSR5O96", "Overall": "2.0", "Content": "I purchased this TV online elsewhere, the first TV we received the picture went black in approximately a week, we returned it  since it was under warranty and they sent us another TV.  The second TV I received we plugged it in and tried to use the remote..it wouldn't work.  We changed the batteries to brand new batteries and still nothing. We even tried using a Universal Remote but there is no code listed or found when we used the \"search\" button on the Universal Remote.  I called the place where we purchased it and they said that they would try to send us another remote, they didn't have one. They Urged us to call Seiki and have them send us a new remote.  I have called them SIX times, on hold each time for over 15 minutes and was sent to a recording to leave my name & number, which I have done, they have YET TO RETURN A PHONE CALL. Went to their website & sent an email explaining the situation they sent me a case number & stated they will get back to me in 48 hours. It has been 4 days since the email...still have not heard back from them. In order to use this TV, you must first go through certain \"STEPS\" to set it up, can not do this without the/a REMOTE CONTROL.  I have not yet been able to use this TV, at all and we have had it for over a week.  I STRONGLY SUGGEST NOT BUYING A SEIKI TV JUST BECAUSE OF THEIR CUSTOMER SERVICE.", "Date": "October 24, 2013"}, {"Title": "Not good.", "Author": "Khalel", "ReviewID": "R37DHVXF6RLC3Y", "Overall": "1.0", "Content": "Horrible.  i'm not sure what other sellers see in this TV but for me it was terrible.  Color was no good, customer service was clueless about what vesa mount it needed so I ended up buying the wrong one because they told me the wrong one.  Don't buy this.", "Date": "November 7, 2013"}, {"Title": "Low Quality TV", "Author": "W.P.", "ReviewID": "R245TAPW6G0E9T", "Overall": "1.0", "Content": "It died within 2 months. Repairs cost more than half of what I paid. Piece of Junk!!!! Do not buy Seiki! Decent picture, terrible reliability.", "Date": "November 28, 2013"}, {"Title": "Very satisfied with TV", "Author": "Donna Horan", "ReviewID": "R1NVTUXIK61S1B", "Overall": "4.0", "Content": "My husband and I bought this tv for a family member for his 90th birthday. It was very easy to install, the picture is good quality and it's perfect size. And, you cannot beat  the price!", "Date": "April 23, 2014"}, {"Title": "remote problems", "Author": "King-D", "ReviewID": "R3N70W8V6RFEDL", "Overall": "3.0", "Content": "My review was for the wrong tv? But still the remote isnt synced to the tv and wont work other than that the tv looks decent and works fine but that dang remote...", "Date": "March 31, 2014"}, {"Title": "Great present", "Author": "Holly Mitchell", "ReviewID": "R15KIKXAWD3050", "Overall": "5.0", "Content": "I bought this TV for my baby brother's 19th birthday, his old TV was starting to make a ringing sound so it needed to be replaced. It arrived about a week or two early but it turned out perfectly because he wasn't expecting it! He loves it, its great quality and easy to set up.", "Date": "March 30, 2014"}, {"Title": "Good for your money", "Author": "Jenn", "ReviewID": "R17RSR7QGUZD7Y", "Overall": "5.0", "Content": "For the price, you ant get anything better.  We bought this for our sons room and his birthday.  Perfect for watching movies!", "Date": "March 25, 2014"}, {"Title": "Great bedroom TV", "Author": "trent kielley", "ReviewID": "RS7ENHPTKQ55U", "Overall": "5.0", "Content": "This television is now the favorite in my house. Simple, with a good picture and good sound for a bedroom TV.", "Date": "February 25, 2014"}, {"Title": "3.5 Stars would be more accurate", "Author": "Loki \"yarndude883\"", "ReviewID": "RFYBUXE46I30F", "Overall": "4.0", "Content": "It's a good solid TV. I have it hooked up to my computer, and It does a fine job.My only complaint is that the startup time is agonizingly slow.", "Date": "February 17, 2014"}, {"Title": "Picture looks really nice and price can't be beat.", "Author": "Kenny", "ReviewID": "RELM96R52ZNUQ", "Overall": "4.0", "Content": "The television was a great price and the picture quality is very nice.  I bought it as a gift for someone who doesn't care about TVs at all and they were thrilled.In my opinion, the audio is the only real drawback (and the reason for -1 star) to this television but it would make a spectacular bedroom TV.  If you're using it in a smaller room then the audio would be a non-issue.  That being said, there are absolutely zero actual complaints so far.", "Date": "January 6, 2014"}, {"Title": "Very Good TV", "Author": "Hardik", "ReviewID": "R377G19ND1CA2D", "Overall": "4.0", "Content": "I am having this TV more than one month and it is very good. Good picture quality. Also I compared it with Vizio and other same range brand and this has better LED screen then other.Very Good Picture quality.Good Sound quality.I would recommend this TV to anyone.", "Date": "January 4, 2014"}, {"Title": "tv missing parts", "Author": "WILLIAM G NEUMANN", "ReviewID": "R2ZLSHCV50UV1C", "Overall": "3.0", "Content": "its ok,but it was missing the parts that lets it stand up was told by the factory they would send them-that was 30 days ago still don't have them. w neumann", "Date": "December 5, 2013"}, {"Title": "It's a great buy!", "Author": "kc", "ReviewID": "R2I8TFAI74L06M", "Overall": "5.0", "Content": "Its easy to setup and works right out off the box, picture is clear and slim not bulky. It's a great buy!", "Date": "December 5, 2013"}, {"Title": "try another brand", "Author": "vanatta7", "ReviewID": "R28WAKVPM11G7A", "Overall": "2.0", "Content": "nice pic and all but I had to return it.It would play a few minutes and just die likeit was overheating and waiting to cook down", "Date": "November 29, 2013"}, {"Title": "EXCELLENT TV FOR THE PRICE", "Author": "David Munro", "ReviewID": "R88O6ZLBIWJUE", "Overall": "5.0", "Content": "We put this in our bedroom where we don't have an HD box, but the picture quality is great anyway.", "Date": "September 2, 2013"}, {"Title": "great", "Author": "stephen", "ReviewID": "R11E03GTHMKHP1", "Overall": "5.0", "Content": "The tv works good I'm really proud to own it thank you for your quality and dedication to proving you sell good quality to your buyers", "Date": "December 4, 2013"}, {"Title": "Nice but!", "Author": "Nevoderick", "ReviewID": "RS3JNBXVC0HF3", "Overall": "4.0", "Content": "My stand is not sufficient to the weight of the flat screen tv! Nice product but I need a stand!", "Date": "August 24, 2013"}, {"Title": "Not a happy camper", "Author": "KevinBellamy", "ReviewID": "RAUUHHD60JOGJ", "Overall": "1.0", "Content": "I decided to purchase two (different) TV sets for my parents and went with the Seiki based on reviews listed on here. Price was also a factor and it's fairly cheap. Based on all the specs and features, this model fits their needs.Upon opening the box and removing certain packages, I noticed instantly the stand (Which literally was cheap made, you could bend it) had a broke piece. Logged on Amazon about a possible return - YES, I INTENDED ON RETURNING THE ENTIRE TV BASED ON A 2 INCH PIECE - Sadly, the deadline for return had past. Anyhow, after hooking up the TV, I noticed instantly every channel shows evidence of noise and it's more than moderate. I'll even go as far as saying its very distracting. I'm very disappointed in my purchase. I'm also upset with myself for letting Amazon reviews play a role in my decision making.", "Date": "December 5, 2013"}, {"Title": "Not what I expected at all... The only product that you've ever sold me that doesn't live up.", "Author": "James Love", "ReviewID": "R2LP458ZV8TUJF", "Overall": "1.0", "Content": "Again, Thank you for exchanging the product for me. Unfortunately, this is not a 32-inch television. The size across is 28-inches so the screen size comes smaller and is nowhere close. I am open to additional conversations to rectify the situation, thank you for your attempt to this point.", "Date": "January 10, 2014"}, {"Title": "Not the best.", "Author": "B.Spacey", "ReviewID": "R17141GH98I7CU", "Overall": "3.0", "Content": "Bought this TV somewhere else but I wanted to share my opinion.  I got the 19\" model to use in the kitchen.  The viewing angle is very poor.  You pretty much have to be right in front of it to see a clear image.  Also, it takes a few seconds when you change channel for it to adjust the picture, so you see a blue screen for a few second between every channel change.  Also, the sound is very tinny.  There is a surround sound option that helps, but you will probably want to get external speakers.  But, it was cheap and it shows a picture so I will keep it until it breaks someday.", "Date": "November 26, 2013"}, {"Title": "IDK", "Author": "charissa", "ReviewID": "RILFMWYM469VY", "Overall": "3.0", "Content": "Arrived on time, good picture, everything works!!!! I quite positive you could get this product much cheaper!!!! I wont buy again!!!", "Date": "December 1, 2013"}], "ProductInfo": {"Price": "$175.99", "Features": "27.5-inch diagonal HDTV with 1366 x 768 resolution, 16:9 aspect ratio and 60Hz refresh rate\n200 cd/m2 brightness\n3000:1 dynamic contrast ratio\n178 degrees (H) x 178 degrees (V) viewing angle\n6.5 ms response time", "Name": "Seiki SE28HY10 28-Inch 720p 60Hz LED HDTV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/415L4H7oyzL._SY300_.jpg", "ProductID": "B00BXF7I92"}}