{"Reviews": [{"Title": "very nice great for the price", "Author": "Audog", "ReviewID": "R22UNMMK7EH1U6", "Overall": "5.0", "Content": "Strong tuner, great picture. Super lightweight good remote, strong sound. We use this as our monitor in the theater room and take it in the Winnebago weighs almos nothing to move. 12 volt is a nice feature it plugs right into a cigarette lighter so you can use it almost anywhere. This is one of those things that i think I may order a second just so i don't have to keep moving it. VERY NICE!", "Date": "October 16, 2013"}, {"Title": "Not a great product", "Author": "Jim Shue \"jimshue\"", "ReviewID": "R6E0EAKZIILI8", "Overall": "2.0", "Content": "I purchased this tv for use in our camper. It arrived appearing to have been previously opened. The box was opened and taped back together. There were channels already programmed into the tv. We went ahead and set it up anyway to try it out. Well, the buttons did not work very well. The sound was pretty lame and the picture wasn't great. We returned this one and went to Best Buy. We decided to actually see the product before buying it, plus we needed it in two days. We bought a larger Samsung for less money and it's great. Perhaps the Axess unit we received was just a lemon, but I have no way of knowing.", "Date": "September 16, 2013"}, {"Title": "Sound as bad as it gets", "Author": "Sayburr", "ReviewID": "R2X5H5JGATMQDT", "Overall": "2.0", "Content": "We bought this tv for pop up camper.  perfect size.  the sound is awful, we even tried hooking up an external speaker' but still the sound made everything unwatchable.", "Date": "September 6, 2013"}, {"Title": "Good picture, easy to use, very portable", "Author": "Bryan", "ReviewID": "R2UJPUO2S07VKL", "Overall": "4.0", "Content": "I bought this for use in my travel trailer.  Thus far, I've had no problems.  It is very light and portable and has worked with every source I've plugged it into.  It's nearly worth 5 stars.  The only thing that keeps me at 4 is that the remote is pretty picky.  It has to be pointed directly at the TV from the front.  Too much of an angle and the remote doesn't seem to work.  The sound is also pretty weak.  It isn't a problem in my trailer as I connect it to the sound system in the trailer.  In other locations without external sound, it does get loud enough, but the sound is small and tinny.Overall, great picture quality and color.  The 12-volt connection works as well as the regular AC power.  If you're looking for a small 12-volt TV, I do recommend this one.  High-Def is as good as my TV at home.", "Date": "August 5, 2013"}, {"Title": "great price great tv", "Author": "daddy cool", "ReviewID": "R1IQNFMZQDVFYI", "Overall": "5.0", "Content": "We bought this for our camper - watched two movies and still had battery left (we have 2 batteries). Antennae works great, picture is great. Sound could be better, but it has adjustments. Very happy with this purchase.", "Date": "June 19, 2013"}, {"Title": "nice tv great price", "Author": "mike", "ReviewID": "R27SRU48NP96F0", "Overall": "5.0", "Content": "I do a lot of cooking and baking; and I have to watch tv while I work. This tv works great with an apple tv,as I don't have cable in the kitchen.", "Date": "June 27, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BEJO8CW"}}