{"Reviews": [{"Title": "All the right stuff", "Author": "Michael Cohen", "ReviewID": "RSSGUVZEHCB9O", "Overall": "5.0", "Content": "We purchased this TV, after deciding that we weren't interested in having our \"smart\" TV built in. We have an Apple Smart TV, and can always consider upgrades to this (developing and fairly inexpensive) technology. Our Sony dvd player handles our streaming needs quite well; so, otherwise what we wanted was a quality TV with a beautiful picture, as well as enough inputs/outputs to give us flexibility with our needs.This Toshiba (32L1350U) is truly a beautiful set - especially for the price! (I went ahead and took Amazon's credit card and received the $50 gift certificate - so that came off the price.) This TV has true stereo analog outputs (full size - not a single, mini-\"headphone\" jack, audio output), so you can easily go through a stereo receiver to quality speakers. Otherwise, 3 HDMI jacks (cable box, dvd player, etc.); as well as a PC port, and a USB, if you must use it as a computer monitor.It has absolutely beautiful color definition, a small frame - so a maximum viewing area, and the built-in speakers are really quite good! We were happy that we could still get full analog stereo, output capability and all the features of a current HD television.", "Date": "June 22, 2013"}, {"Title": "58\" Toshiba 240hz Led Tv", "Author": "Brent Doty", "ReviewID": "R1Q36X9CAD02LH", "Overall": "5.0", "Content": "This 58\" Tv is amazing, so amazing I ordered another one for my parents. I purchased my first \"flat screen\" back in 2007. It was a 42\" Toshiba that was highly recommended in Consumer Reports. I still use it today with only one issue... The battery cover on the remote falls off easily. Everything else still works perfect on it. Im a huge gamer and love to watch sports (football, nascar, hockey, xgames) and this tv worked ok, but was a little blurry. 240hz wasn't available back then. Then a few years down the road I bought a 32\" Toshiba for my bedroom. Again, no issues but I decided a few months ago that I needed to get with the times and update the 42\". So, I gave my uncle my 32\" and he loves it. I researched Tvs on here, bestbuy, new egg, sears, target, walmart, basically anyone that sells TVs. Everyone thinks Samsung is the way to go... I have no problems with Samsung, but they are overpriced. I have a ps3,a ps4, and a labtop that i hook up to my TV's hdmi. I want the best technology but minus the aps on it and the 3D on it. Which I personally believe isn't the greatest thing for your eyes. (Just my opinion) I came across this big guy... Now when I was going to purchase this, it was right around black Friday... Huge fan of ad watching... Everything that was cheap on BF was a cheap brand or not worth the wait. That's when I decided on this and don't regret one bit of it. Im not loaded or well off by any means. Im a veteran and a full time college student. I have been saving up money for a while just to afford a nice tv. For 899.00 (tax free and free shipping) You get a huge almost 60\" tv... 240hz, which is amazing on any sports, movies or fast paced show (almost looks fake cause the clearity is so real)... Now for gamers out there... This TV was rated my numerous gaming magazines as the 3rd best tv for lag response time (the other 2 were over $2,000) However Toshiba has a \"game mode\" which sets everything to the exact setting for you to achieve this quickness without sacrificing image quality. COD GHOSTS LOOKS AMAZING ON PS4!!! GTA V and Gran Turismo 6 on ps3 = AMAZING! I recommend everyone that reads this... DO YOUR RESEARCH... Make sure you know what you want before you buy... I did and don't regret it! After 3 months having it... I cant believe the difference it is compared to my 42\". Any responses with questions, I'll try and answer after this post. Thank you and CHEERZ to Tv  shopping!", "Date": "January 16, 2014"}, {"Title": "Toshiba 58L 1350u 58 in  is a five star", "Author": "Sue Troy", "ReviewID": "R2MGOV7X96LT3N", "Overall": "5.0", "Content": "All are TV are Toshiba we have had no problem with any of them. The new 58 in is a amazing picture, we have a surround sound system and you feel like you are watching everything at the theater. I highly recommend this TV.", "Date": "December 12, 2013"}, {"Title": "Performance of a Samsung, without the price! Superb efficiency!", "Author": "T. Caradonna", "ReviewID": "R2CS5BI6OEH1R8", "Overall": "5.0", "Content": "This is a review for the 39\" version.While Samsung is likely over-rated, Toshiba is equally under-rated.  This TV puts out a great picture AND sound.  This is also one of the most efficient TV's on the market.Pro:O  Great Picture.  Although not always 120hz (it depends on the source), the picture is fantastic.  Realistic color representation.  Works great as PC display (I use mine as part of a Home Theater PC setup).  Great viewing angle.  Plenty bright even with natural sunlight coming in the room.O  No \"fancy\" frills.  Forget \"smart tvs\", let TV manufacturer do what they do best: make a TV!  You can buy a dvd player, apple tv, roku, etc that does everything a smart tv can do.  I personally let my HTPC running Windows Media Center do all the heavy lifting.O  Has all the outputs you need.  Lately alot of manufactures are cutting back on outputs, probably keep the displays as thin/light as possible.  This has output for analog audio (goes to my sennheiser wireless headphones) and optical audio (goes to my audio receiver for when I want full theater experience).O  Built in speakers are quite capable.  A worthy sound for a thin tv!O  AWESOME energy efficiency.  Energy star rates this as 49.6Watts, but my killawatt measures it at 36.9Watts.  The Energy Star Sticker estimates $10 per year in power costs, far below the average for comparable sized screens.  And given my measurements, Energy star is overestimating the consumption.O  Clean design, uncomplicated user interface!O  Price is terrific!  This performs as well as much more expensive Samsung models which paying the unnecessary premium.  Toshiba makes great sets and has great reputation for superb engineering in Japan.  I will point out that Samsung is not nearly as popular a brand in Japan, which reinforces my belief that perception about brand and quality is very relative.Cons:O  Base is a bit wobbly for my tastes, but is adequate given the light weight of the TV itself.  I only notice when I turn the TV to face a different room.  (Which I do frequently, and it has been no problem whatsoever)O  Other reviewers have mentioned the low sensitivity of the remote.  I admit it's a bit weak, but it's not so hard to aim it at the TV.  Really the only time I need it is to turn on/off or change volume.  These days most viewing control is done thru media devices anyway (my HTPC in my case), so I'm not bothered, and I suspect neither will most people.  (Who doesn't have a media player of some type these days?  Tivo, Cable box, Roku, DVD player, etc...)O  I wish the TV would auto-power down faster after not detecting a signal, or allow the user to customize this.  I think it takes about 20 minutes.Overall, I am very happy with this TV!  I would absolutely purchase again and recommend this TV.  5 starsPlease feel free to leave a comment/question as I'm happy to reply.Update 4/5/2014:Still very happy with this TV.  Just wanted to add that the TV and the stand stood up very nicely to all the earthquakes we've been having.", "Date": "October 23, 2013"}, {"Title": "AWFUL Customer Service Experience", "Author": "Brandon2063", "ReviewID": "RBZ7OMRLPTJGN", "Overall": "1.0", "Content": "I purchased two of the 29L1350U LCD monitors to use as in a CCTV application.  Within a few months of installation each of the units displayed instances of random power cycling (the monitors will power off and back on during use).  An internet search of this phenomenon indicates that my monitors are not unique in this behavior.One unit has only performed this random power cycle on three occasions over six months (and though annoying, this will seem acceptable as you read on).  The second TV, however, is unusable, as it power cycles four or more times per hour - in some instances requiring unplugging for several minutes before it will resume function.The defective unit is less than six months old, so after contacting their customer service, I sent it to a Toshiba authorized repair depot.  I was responsible for shipping, which is frustrating, but acceptable.  The unit was allegedly \"repaired\" (a new motherboard was installed) but upon its return it exhibited the same behavior IMMEDIATELY after being reconnected to a power supply.  I was told to send the unit for a second round of service (again at my shipping expense) and that if the unit could not be repaired \"other options\" would be explored.  I have received it back from this second repair and it still does not work. I have spoken to customer service, warranty service , and customer relations personnel, including several \"managers.\" I am told that there is no option to have a replacement TV issued, only to resubmit to the same repair depot, AT MY COST.  The \"other options\" are that they will request that a senior technician inspect the TV (implying that the lower level technician should not have been trusted to complete a successful diagnostic and repair?).If I am to submit the set again, I will have spent $75 on shipping to repair an ongoing problem for a $190 TV.  This experience has taught me that a Toshiba warranty is not worth the paper it is written on.  I intend to file a complaint with my local bureau of consumer protection / the Better Business Bureau, as well as post as many online warnings to would-be-customers as I possibly can.  I used to look at Toshiba as a trusted brand name and a reputable company.  I understand that any manufacturer can have problems with products.  A reputable company cannot guarantee that all of its equipment will be without defect, only that they will help to restore the consumer who was burdened with a defective item.  The issue is not the faulty TV.  The issue is the horrendous run-around that I am being put through in my attempts to resolve the issue.  This is the last Toshiba item that I will ever purchase, PERIOD.", "Date": "March 20, 2014"}, {"Title": "Great gaming tv!!", "Author": "exodus", "ReviewID": "RNNNYJJWC3A11", "Overall": "5.0", "Content": "I use this tv for gaming 99.9% percent of the time ,and It handles gaming wonderfully.  it took me about two weeks to calibrate a picture that i was very happy with ,but once i did games look great on it. Now let's get down to the most important part of what makes a tv good for gaming tv: the input lag all HDtvs suffer from it to some extent some a lot worse than others ,but this one has no noticeable lag according to a certain website the 39\" version of this tv clocked in around 30ms which is considered great for gaming.  So if you play competitivly online like i do your not put at a disadvantage. especially with fighting games and first person shooters. My only knock against this tv is that it has a slight vertical banding issue only noticable when the screen is one mostly one color. But i am happy to say that this tv has a pretty uniformed screen ,and does not suffer from flashlighting which is another common led tv issue. I paid around six hundred and fifty dollars for this tv and so far very happy with my purchase.", "Date": "July 28, 2013"}, {"Title": "For the price it is ok", "Author": "daedelus7", "ReviewID": "R7Q7COUTC52J3", "Overall": "2.0", "Content": "I got this on sale at Best Buy for $350 and for the price I don't think you can really get much better picture in \"120hz\" and 39\". I'll compare build and functionality to my last TV a 2009 samsung 22\"LCD.Cons:-So here is a dirty secret I discovered. The \"clearscan\" 120Hz prominently printed on the box doesn't exist in my settings. So i'm not sure if it is really doing 120 or just 60. Yes, I know what i'm doing, I even downloaded the manual and it has directions directly referring to this exact model, go to advanced picture settings and toggle on/off cinema mode. Regardless of picture mode it's greyed out. A quick google search revealed others with the same problem. I might contact customer service to see what they say and I'll update if I get to it. But from what i've read 120vs60 is not a big deal. The difference between \"game mode\", supposedly reducing input lag is marginal compared to the other modes but I think it is better than say cinema for games. The refresh rate seems improved at least on \"game mode\" compared to my old Samsung and it works well for games and movies my main uses. Saving some money and going to 60hz is something that you might consider. I think my final conclusion is we are getting improved refresh rate from 60hz but it is hard to notice. You don't get the \"soap opera\" effect like with my parents 240hz Panasonic. Where if you put it on high processing it looks really high frame rate.-The remote is very cheaply made compared to my old remote from 2009. You have to go out of your way to aim directly at the IR port. Kinda surprising you could mess up a remote in 2013. Samsung remote works normal point it in the direction of the TV and it works. I think some of the unresponsiveness has to do with the tv taking 3-4 seconds between when you hit power on the remote and turning on.-The stand is very poorly engineered. My model is ever so slightly tipping to the left after installing it correctly and pushing on the tv causes it to wobble around WITH the TV screwed into the stand. I plan to put it on a wall mount so that should solve that problem. Wishing they just copied samsung's no tools or screws required foolproof stand.-I had to exchange the first TV I got because there was a dead pixel. Second TV was fine. The first TV's stand was fine, in terms of being level, albeit wobbly. This dead pixel out of the box on the first TV kind of makes me worry about how long the TV will last. My Samsung from 2009 is still trucking with a little brightness discoloration spots.-Menu user interface is slightly worse/funky compared to my old tv.Pros:-At around $200 cheaper than the comparable Samsung model i'm willing to put up with the Cons to avoid the samsung brand tax.-The picture is all around better than my 2009 TV as you would hope. Only problem is the blacks are really black and I found myself boosting up the gamma +4 out of a max +5 because it was just too dark, abnormally so if you ask me.-3 HDMI ports. Many TVs this size only have 2. I'm going to plug consoles into all of them. Generally lots of output options Samsung seems to just leave off this size of TV bizarrely these days. I would like to plug my TV into speakers thanks.-The TV barely is warm on top after extensive use indicating how much energy the LED technology saves.-The sound is about as good as my Samsung from 2009 probably marginally better and louder.So in the end I think it is a good deal. I'm happy gaming and netflixing on it so far and I'm willing to deal with some quirks for the price.UPDATE 10/15/2013:Support interaction information: Spoke to Jerry, reference number 131007-004922.I called Toshiba customer service to find out two things. How do I upgrade the firmware for the TV. And why is cinema mode greyed out and \"off\" in the menu, when the manual says that I can turn it on. After 30 minutes the CSR told me they needed to have a tier 2 person call me back and there is no firmware update. Problem is, on their own website when I enter the model number on the support page at support.toshiba.com it shows there IS a firmware update. I was told I would get a call back the next day and haven't heard from them 2 weeks later.  So based on my interactions I would say avoid a Toshiba TV because they have poor customer service in the support department. I certainly got the run around when I tried to ask why advertised features were not working.UPDATE 10/17/2013:I was able to update the firmware from some help from another reviewer in the comments of this review. I am now running 1.08 firmware and there has been no change in menu options.", "Date": "August 20, 2013"}, {"Title": "Nice bang for the buck", "Author": "moose_of_many_waters", "ReviewID": "R11TAKBB2E3I8G", "Overall": "5.0", "Content": "I picked this up for less than 200 bucks on sale.  I'm not much of a TV watcher and I don't even have cable TV.  I just watch PBS and special yearly events like the Oscars and the Rose Parade off my antenna.  Mostly I watch movies off my Blu-Ray player.  This TV was bought to replace my old 26\" LCD Panasonic Viera (about six years old).  The picture quality of this LED TV is definitely superior to what I had and it's nice that I get 31.5\" inches of screen in the same space of my bookcase that used to hold my 26\" TV.  Sound quality is solid, and the digital tuner is also superior to the old one on my Panasonic (I'm getting clear reception on channels that used to be sketchy).  The one thing that is inferior is the time lag in changing channels; it's a bit longer with this TV, but nothing ridiculous in terms of a wait.  This unit also has a glossy screen, and personally I prefer matte screens.  My TV isn't near a window,  so any glare is minor, but if you plan to watch this TV during the day and your house gets lots of light, you might prefer a different model.The remote is fairly intuitive.  The only complaint I have is that this unit didn't come with a hard copy manual.  I had to download one off the internet.  That's being a little too cheap in my opinion.  But other than that, I'd say that this TV is an excellent value.", "Date": "May 22, 2013"}, {"Title": "What a Bargain!!!", "Author": "starr", "ReviewID": "R1RII8S67MSGW3", "Overall": "5.0", "Content": "With Toshiba, you have top-of-the-line quality. The price (on sale) was surprisingly low so we ordered 2! My dad saw it and ordered one for himself. So, we ended up with three that we are very pleased with!", "Date": "March 7, 2014"}, {"Title": "I love my new 58L1350.", "Author": "James B Deatsch", "ReviewID": "R2XD76JJSO911D", "Overall": "5.0", "Content": "This is my third Toshiba flat screen and I love it.  I just keep going with Toshiba because of the quality.I'm using a RaspeberyPi for streaming, Dish Network for other stuff, and a Sony Blu-Ray DVD player and all are exemplary with my new Toshiba.I upgraded from a 40\" Toshiba Plasma to this backlit LED and find it just great.I really cannot say enough about this TV.  You'll love yours as well.", "Date": "January 8, 2014"}, {"Title": "Great Picture", "Author": "Kerry Graham", "ReviewID": "R3650U284088YM", "Overall": "4.0", "Content": "This TV is much better than the COBY I returned. The sound is very good and the picture is awesome!", "Date": "June 7, 2013"}, {"Title": "Toshiba 50L1350U review", "Author": "shopaholic", "ReviewID": "R2M1YN7MLK3K3D", "Overall": "5.0", "Content": "This is the first review of the Toshiba 50L1350U.  Just bought from S...S (rhymes with beers).  I returned the Toshiba 50L5200U.  This one is perfect.  Great color, contrast, black levels and is about 10 lbs. lighter.  Was able to put on the stand and put on table by myself easily.  This one is not a thin tv but I have found that the thicker ones tend to be lighter.  The sound is very good and can be heard easily (with the very thin tv's there's no room  for big speakers).  But I hooked up 2 soundbars (one for left and one for right channel; along with a BIC F12 subwoofer and WOW WOW WOW.  It has 3 HDMI inputs and a pc input (how much would it cost for a 50\" pc monitor? lol.", "Date": "April 14, 2013"}, {"Title": "Beautiful picture, good sound", "Author": "Kimberly Galante \"Kim\"", "ReviewID": "R3D3RXJMXY2GXC", "Overall": "5.0", "Content": "I am very happy with my purchase of this TV. The picture is beautiful, very clear. The sound is also very good. This is a very good price for this TV. I am thinking of getting another for my bedroom. I highly recommend this TV.", "Date": "August 22, 2013"}, {"Title": "Better than generic", "Author": "invalidprotocol", "ReviewID": "R1ZXAMQ5RI9E7B", "Overall": "3.0", "Content": "The Good:Plenty of connectivity options.  Decent implementation of 120hz motion control. Decent remote layout for inexpensive TV.The Bad:Poor color accuracy.  Foreground objects may change in hue depending on the colors in the background.  Pronounced LED lighting anomalies surrounding moving objects.  Uneven lighting that is dimmer in the corners.  Harsh shadows and contrast levels that you can't quite seem to get set right.  Black level is so-so. Remote quality isn't too great.Overall:A name brand with reasonable reliability and good connectivity options.  This TV is a good low cost alternative to no-name brands while still providing a strong offering of connectivity options usually offered on higher dollar TV's.  For those picky about color accuracy and lighting quality, you'd best look elsewhere.  The problems this TV has have been solved in competing name brand units.", "Date": "July 6, 2013"}, {"Title": "Toshiba Warranty Service is Atrocious", "Author": "Reader by Nature", "ReviewID": "R1TGZ5VXSZBNL", "Overall": "1.0", "Content": "First thing, I did not buy this tv through Amazon (wish I would have), but Best Buy. Out of the box the tv had a screen defect. There are these ripples of gray towards the top left of the screen that can be seen on lighter backgrounds. I thought I had 30 days to return the tv, but Best Buy recently changed their policy and only gave 14 days, so . . . I called Toshiba to activate the warranty. First they said the model number from the back of the tv did not exist. I had to take a picture of it and email it to Toshiba--the makers of the tv--to prove I was giving them the right model number. Okay, no problem. They tell me the tv is covered, call tech support. I call tech support. They try to walk me through all these steps to \"fix\" the picture when it is clearly a screen defect. I've invested about 45 minutes of my life, but okay this must be protocol. They finally say that the tv will need to be taken to a repair facility and fixed under warranty. They give the name and number of a place. The place never answers the phone. I finally get through to the repair place after days of trying and the guy tells me Toshiba should have given me an authorization number. Well, they didn't. Call back tech support. They have no idea what I am talking about. Finally, after being on hold the guy comes back and says, oh yes here is your authorization number. I call back the repair place a few times, finally get them on the line, and the guy tells me to bring the tv in at 4pm. I wait an hour in front of his shop before the repair guy shows up. Beyond frustrated at this point, but at any rate, I leave the tv. Next day the repair guy calls me and says that Toshiba will not cover cost of repairing the tv, they say the screen was damaged by someone hitting it? Yes, I make a habit of smacking around my flat screens. If that wasn't bad enough, this tv is advertised as 120hz, but on the back of the tv it says 60hz. So disgusted with Toshiba. I have laptops from them that are great, but I will not be a repeat customer after my experience with the tv. I seriously want to through the thing in the garbage.", "Date": "April 24, 2014"}, {"Title": "it's a 60Hertz tv", "Author": "Animal", "ReviewID": "R2ZFZYCSAGAVSI", "Overall": "3.0", "Content": "i went to the Toshiba website and it says in order to enable clearscan you must have you TV on Cinema mode. beacause \"There are no seperate settings for clearscan\"i was reading an article where it said some tv's use fancy language to make people think they are 120 hertz, i think thats what \"Clearscan\" is for this TV. The TV has a refresh rate of 60 frames per second and there is no way to change it to 120 hertz. 120 Hertz clearscan must be something else. The I was playing Xbox one on this TV and the picture looked great. I just don't think it's 120 hertz refresh rate.", "Date": "March 14, 2014"}, {"Title": "Could Have Been Built Better", "Author": "R. Beltz", "ReviewID": "RYH6C5OBVYS14", "Overall": "3.0", "Content": "At the recommendation of my son, I bought two of these TVs last summer on sale at Best Buy: a 39\" and a 23\" for my partially-finished basement. These were the first flat-screen TVs that I have ever owned, after owning a 12\" Sony Triniton, a 26\" Panasonic and a 12\" Toshiba over the past 40+ years.  Here are my findings:Pros - Lightweight, clear picture, good choice of inputsCons - VERY cheaply made compared to my son's Toshibas which are 4-5 years old. The base is a complete joke as the TV wobbles easily. The screen itself is mounted in a very cheap frame. It is hard to tune the picture, especially flesh tones. The TV doesn't even have a display function for the local time!Overall, Toshiba could have done much better with this TV line. There are much better flat-screen TVs out there in a similar price range.", "Date": "January 22, 2014"}, {"Title": "Looks nice but", "Author": "J. Maz", "ReviewID": "R27W0Z2CGPRMOJ", "Overall": "3.0", "Content": "Had since July 2013. TV is nice size, picture quality is good.  Issue with the volume buttons not working from the remote or the TV. Thought it was the cable remote but replaced that and still not working.  Contacted Toshiba, went through all kinds of resetting but was difficult as the TV does not respond well to the remote.  Gave me the phone number to have it serviced but that phone number was out of service.  Called back and got a different service center but cannot call them until Monday.  Very frustrated when a brand new product does not work.", "Date": "January 11, 2014"}, {"Title": "Great gaming tv for XBox one!", "Author": "willy", "ReviewID": "R2SBG8SJGCZK3M", "Overall": "5.0", "Content": "I read reviews on this Television from TV lag websites this was one of the ones with great hardly no lag for gaming.  And it turned out to be awesome.  Great response time from the controller to game.  I think its 27ms  of lag which is really good compared to others. The picture with HD cable tv is pretty nice  .  Also the new xbox one  looks totally awesome on this TV. I would recommend this tv to everyone.  The price is great also.Cons-The deliver isn't consistence. They had me selet a date and then the next day made me reschedule and still delivered on the same day as scheduled before. I didn't care for that cause i had to change my days off twice so i could be home for delivery.", "Date": "December 29, 2013"}, {"Title": "had to go online and download the manual", "Author": "R. Morgan \"techno-geek\"", "ReviewID": "R2Q8KVUVH4JG3K", "Overall": "4.0", "Content": "you need HD cable to appreciate the picture. menu on TV setup is a bit sketchy, had to go online and download the manual. TV is very light weight and it does wobble,(I bought 2 for gifts) attached them to the shelf back. The TV sits on a wood entertainment center. I purchased some tie downs to help, so far so good. I got \"Dreambaby 2 Pack Flat Screen TV Saver, Black\" about 8 dollars. be sure to pre-drill the holes to attach wood screws(provided), adjust the straps like you would do on a backpack and you won't have problems with the plastic buckles, each end is painted metal and all screws are provided. I think mounting on the wall would be better if possible. Hope this helps.", "Date": "December 12, 2013"}, {"Title": "Great picture, average sound", "Author": "Here Fishy Fishy", "ReviewID": "R28XV5EW6X0Q5W", "Overall": "5.0", "Content": "What can I say? This is a TV. Everything works perfectly and there is virtually no setup - plug in and go. I use this in my office to the side of my desk. Other TVs I have tried did not have good viewing from a side angle - you had to be directly straight in front of the TV to view the picture. That is not a problem with this  unit. High, low, side-to-side makes no appreciable difference. The picture quality is good from all angles. The sound quality is rather weak as I would expect from such a small unit but I wasn't looking for a good stereo system so I wasn't unhappy with the sound. If you want to get full room sound, this is probably not for you in either size or sound quality.", "Date": "December 12, 2013"}, {"Title": "Toshiba 39L1350U 1080P LED TV", "Author": "Mike", "ReviewID": "R155QN539NJMW1", "Overall": "5.0", "Content": "This Toshiba 39 inch TV is the perfect bedroom size and can be set on a stand or mounted to the wall any where in the bedroom or in the home has an exceptional picture and also has 3 HDMI connections to add an assortment of electronic attachments.", "Date": "December 11, 2013"}, {"Title": "Great HD TV or computer monitor", "Author": "Amazon Customer \"Extra class ham\"", "ReviewID": "R15H31RHYPS26L", "Overall": "5.0", "Content": "This TV/monitor is an amazingly good product. You can use it as a TV, computer monitor, or both at the same time. The price is about the same as a good quality 23\" monitor, so you're getting an HD TV for free with this. I used it as a TV in a guest bedroom. It was easy to wall mount, not overly heavy for the size, and is slim enough so it takes up practically no space when it's folded flat against the wall. The picture quality is as good as I've ever seen with a true HD signal. Even if you don't have HD, the picture quality is above average. Snap this baby up, especially when it goes on sale.", "Date": "December 2, 2013"}, {"Title": "Above Average TV", "Author": "Right2Carry", "ReviewID": "RBP51TJ9SY1AI", "Overall": "4.0", "Content": "Good picture, good sound, easy controls, easy setup.  A journeyman television, completely suited to its task of being the bedroom TV, used while getting dressed in the morning. It reminds me of the lukewarm praise cluelessly given to Major Frank Burns by \"Hotlips\" Houlihan in a M.A.S.H. episode - \"Oh, Frank!  You're so above average!\"  We bought this TV because various reviewers had rated its sound quality as better than others.  It is, but only marginally, because of the built-in limitations of flat TVs - there is no cavity for a proper speaker baffle.  It was noticeably tinny compared to the 32\" CRT it replaced.", "Date": "November 27, 2013"}, {"Title": "Love the picture qualty.  Here are some ideas to inprove the remote controll , It worked for me", "Author": "Wm. Claypoole", "ReviewID": "ROBO9UN6AQ02G", "Overall": "5.0", "Content": "I love the picture on my Toshiba 50l1350. It would have been nice to have a yellow/ red /white input. How ever I worked a round that with a hdmi converter. I  agree that the remote is poor at best. Here is a way to improve the remote problem. If you have an old dvd , cd or vcr that no longer works , remove  the plastic front that covers the IR receiver .  Cut that part of the plastic out. ( the plastic that covered the IR receiver. )  Tape (clear tape ) it over the IR receiver on the ty.  You will find the remote works much better w/ the ty.  ( I think the problem is the ty sees white light { because there is no white light filter} which makes it much harder to detect the inferred light)  Putting the filter on the the remote helps, putting the filter on the tv seems to work best.Bill from Fl.", "Date": "November 23, 2013"}, {"Title": "Another excellent Toshiba Value", "Author": "Karen Baker", "ReviewID": "R19YD9X0CDJYW1", "Overall": "5.0", "Content": "Great picture and sound for an inexpensive tv. Excellent value and quality. I have purchased other tvs this size and this is by far the best I have found. It is my second Toshiba TV because it is the best quality tv in the house. Would definitely recommend.", "Date": "November 16, 2013"}, {"Title": "The only downer is the remote - tiny buttons, not backlit", "Author": "Prime", "ReviewID": "R1BI5QEMTESN7L", "Overall": "4.0", "Content": "The only downer is the remote - tiny buttons, not backlit.  Picture and sound are very good for a small HDTV.", "Date": "November 15, 2013"}, {"Title": "I would not buy again", "Author": "Operations Rick", "ReviewID": "RHSBGIQO8NE5", "Overall": "1.0", "Content": "I bought the 23 inch model because I had the 32\" model. Both worked, but would occasionally add random channels to the menu, both would sometimes go to a channel NOT selected before going to the selected channel.The 32\" unit finally stopped working after 19 months. The 23\" unit is newer and still working, but sometimes shuts off the sound. I have to go back and forth between channels a few times before the sound comes back.I like the picture on both units and was happy with them when they worked correctly, but the quality is much less than I expect from Toshiba. I will not buy this model again. Even with the good price, I think the problems and short life make them a poor value.", "Date": "November 15, 2013"}, {"Title": "Good Sound, for an average LED TV", "Author": "kel", "ReviewID": "R3TR03FZSNXO93", "Overall": "3.0", "Content": "It works, for that price, it has pretty good sound and image, maybe the user experience is not the best, the remote could be better... but in general terms it works good.the image is nice and bright.pretty decent product.", "Date": "November 2, 2013"}, {"Title": "love it", "Author": "Kim Hinds", "ReviewID": "R3KRNCLEIIR561", "Overall": "5.0", "Content": "i truley love this tv more than expected. perfect size. really good picture. easy to hook up to, lite weight,", "Date": "October 23, 2013"}, {"Title": "Great picutre and easy to set up!", "Author": "Victoria E Soto", "ReviewID": "R18ECW9IRXNCYS", "Overall": "5.0", "Content": "After months of researching tv's (when did it get so hard to buy a tv!??) I finally settled on this Toshiba because of the brand and the price.  So far so good.  The picture is nice, clear and bright!  Sound is full.  I've hooked up my Roku, dvd player, AND VHS player (yes, you read that correctly) and I am happy as a clam.", "Date": "October 16, 2013"}, {"Title": "May not make you a very good computer monitor", "Author": "Richard Schissler III \"Rick S.\"", "ReviewID": "RPB4S561OV757", "Overall": "3.0", "Content": "Picture quality is not as good as I hoped. I use it for an additional computer monitor and it is not as sharp with text as I need.", "Date": "October 11, 2013"}, {"Title": "Good TV for the price", "Author": "Janet D Newport", "ReviewID": "RI76KCKIQF022", "Overall": "4.0", "Content": "Purchased for a bedroom TV to replace a (working) old giant that I was tired of dusting.  Perfect size for the room.  Easy to set up.", "Date": "October 9, 2013"}, {"Title": "Nice look", "Author": "Justin", "ReviewID": "R39B3RZ6O6R2MO", "Overall": "5.0", "Content": "Easy set-up with my computer. It makes a great monitor and I use one of the HDMI inputs. The only thing i wish it did was play movies through the USB port, like the movie files I have on my jumpstick. It has no problem displaying picture files nicely though. It's a great TV at low price. I paid $179", "Date": "September 24, 2013"}, {"Title": "Good TV great Price", "Author": "Matthew Dansereau \"Matty79\"", "ReviewID": "R1M6EJHYYH0VIM", "Overall": "4.0", "Content": "Toshiba 50L1350U 50-Inch 1080p 120Hz LED HDTVJust bought this TV yesterday.This is about the 50-Inch model:Setup was super easySet is light weight and well designed.I played an action game (GTA 5) from my PS3, no issues with blurryness (contrary to other reviews - I think they were talking about other sized models).I watched videos on Netflix and clarity / depth display was very nice.I did notice some pixilation when a scene would fade out that may have been the quality of the movie I was streaming.So far very happy with the purchase.", "Date": "September 18, 2013"}, {"Title": "Great TV!", "Author": "Barton OBrien", "ReviewID": "R1BFKCZCGV5P83", "Overall": "5.0", "Content": "Great TV to fit exactly into the space at my parent's home.  They are extremely pleased with this purchase.  Recommended.", "Date": "September 9, 2013"}, {"Title": "Good picture but missing some connections", "Author": "Tony", "ReviewID": "R3ARDFCTC5CK90", "Overall": "4.0", "Content": "For the price this is a great TV. Has a good picture and sound, but it only has HDMI connections. If you have any equipment that uses the older RCA (Yellow, Red & White) connections they will not work with this TV.  It does have a component video connection which didn't help me any.  So I had to purchase a $50 adapter to play my Nintendo Wii on.  Otherwise a very good TV.", "Date": "September 9, 2013"}, {"Title": "bedroom tv", "Author": "RAM", "ReviewID": "R21RLC64QHPCMS", "Overall": "4.0", "Content": "nice size for bedroom. replaced 26\" sanyo with intermittent on/off  after 2 yrs.. one month old , good pix. great price.", "Date": "August 27, 2013"}, {"Title": "Priced Right", "Author": "Patricia Collins", "ReviewID": "R1711GAKWHI8LO", "Overall": "4.0", "Content": "The picture quality is crisp and smooth. There is no remote code included and no remote code on the Toshiba site. Had to research the Satilite tv provider site to find the code.", "Date": "June 30, 2013"}, {"Title": "Great TV for the money", "Author": "E. Levine", "ReviewID": "R1IHPT64HSY9FM", "Overall": "5.0", "Content": "We love it - arrived on time.  Carrier was super nice.  Product was easy to assemble and install.  We are enjoying it immensely.  Sounds is great and picture quality is great.", "Date": "June 29, 2013"}, {"Title": "Toshiba makes a piece of JUNK!!!!", "Author": "J. Stetson", "ReviewID": "R1MP5MY52D0LLK", "Overall": "1.0", "Content": "Had this tv for exactly 4 months when it died. No power. Nothing. Called the customer service department and I must send them the unit at my own expense and find a box to put this piece of trash in. I asked them to provide a box and they told me to take it to a UPS center and buy one from them. I expected them to send me a replacement tv and I would then send them the broken one in the box I received but I guess that's just too difficult for them to do. I also think they should cover the postage for this defective junk they sold me. After going online I found out the 4 month mark is pretty typical for their products to self destruct. I am over this company and will never do business with them again.", "Date": "February 3, 2014"}, {"Title": "Gaming TV Gone Wild", "Author": "RabidAtlas", "ReviewID": "R1ACEB69XKCLB6", "Overall": "5.0", "Content": "This review is for the 50\" version of this TV, which is the one I purchased.  I wanted a TV primarily for my gaming room, which would be responsible for displaying sporting events, a computer monitor, and an Xbox 360 and a PS4.  The reason I picked this TV was the input lag, a feature not often talked about..  The input lag database clocks this TV at 27ms.  That's really low, and lower is better.  So if you're looking for a gaming TV, you're going to want something like this, and for the money, you're not going to find a better TV this size at a lower price.There are a few things I feel could be improved.  Namely, I wish you could create custom names for the inputs.  Instead, you can leave them as \"HDMI 1\" \"HDMI 2\" or you can pick from a provided list.  But without custom names, instead of \"Verizon FIOS\" \"360\" and \"PS4\" I end up with \"Cable TV\" \"Game\" \"Game\".  Not a huge deal, but my livingroom TV lets me do this and its a small feature I miss.Also, in the bottom-right you'll find a green circle that lights up when the TV is on.  You can push that circle and naturally I thought it was the power button.  It didn't work, and I was able to turn the TV on and off with the remote.  It turns out, that isn't the power button.  The power button is located behind the TV on the left-hand side, along with the channel, volume, and input buttons.  It's just sort of hidden away back there.The stand is a bit boring and there is nothing to make the TV itself stand out aside from the stellar display.  Also, I didn't notice it in the pictures, but there is a gap between the bottom stand and the TV where it's a silver metal instead of the black plastic, which does look a tad bit odd.The display itself is exactly what I wanted.  Sharp images, good blacks, nice contrast.  Viewing angle is okay, and picture isn't too glossy so the brightness of the room isn't critical.  Perfect for gaming, great for sports, and good for movies.  5 out of 5 stars, I'd buy this again.", "Date": "January 20, 2014"}, {"Title": "The right choice", "Author": "Douglas E Businger", "ReviewID": "RNUON3K2VFRB4", "Overall": "5.0", "Content": "Fairly impressed actually. What sold me was seeing one in a store and the viewing angle was so much better than another highly rated brand next to it. The set up was very easy. The sound is amazing, some reviews say the sound is lacking, it's not. If this is the size you're looking for then this is the one.", "Date": "December 13, 2013"}, {"Title": "Great picture, sound needs external help", "Author": "A. Bailey \"woodwright\"", "ReviewID": "R3U2EOFRJ80521", "Overall": "4.0", "Content": "Great picture and detail. Sound is lacking since the speakers are in the back of the set. We cured he sound problem with a sound bar.", "Date": "November 16, 2013"}, {"Title": "3 hdmi inputs, a great picture", "Author": "proman", "ReviewID": "R2KVGBSPMSRGHO", "Overall": "5.0", "Content": "I was considering a lcd tv at first, but i'm happy I bought this led instead, its a brighter picture and the 120hz refresh rate was another reason. 720 p is all you need for a tv of 32inches, gives all the detail and clarity I need. The colors are calibrated at the factory and it worked great right out of the box. Its the most bang for the buck, I could find. I am only disappointed about one thing....the base base the tv kinda wobbly,and unstable, but the toshiba use the same base for all their tv's up to 50 inch models. I opted to wall mount it with the Cheetah mounts lcd wall mount bracket, so that took care of that problem! Also the viewing of the picture off side is very good, so you dont have to sit only in front of it to view a great picture. So glad I bought a led tv vs.a lcd, lcd was the forerunner, but with lcd, theres a bulb that periodically needs replacing, its what makes the picture since the display is liquid, its backlit, a bulb costs about $200.00, but with a led tv, theres no backlighiting, its a series of light emitting diodes (led), which should make it more dependable and definately gives the tv its brighter more accurate picture, blacks are pure, whites are clean, gold looks gold and silver is silver. This tv sells for 399.00 at Pest Buy....so Amazon has the best deal!", "Date": "October 14, 2013"}, {"Title": "Good Value", "Author": "Thomas M. Anderson", "ReviewID": "R1YY6CTN3IE7MT", "Overall": "4.0", "Content": "We bought this TV for our motorhome.  It has a great picture and is simple to set up.  Downside it that the audio is just OK, but if you have it hooked to a separate audio system you will love this TV.", "Date": "October 13, 2013"}, {"Title": "Glad to receive a good TV", "Author": "Ben Hoschouer", "ReviewID": "R1WLJXX36A9FW7", "Overall": "5.0", "Content": "Even with Standard Definition the color and quality was good.  With the HD the picture is very very clear and the skin colors are right on.  My wife really enjoys her new TV.  And the size is just right for the space that it sits in.  The sound quality is pleasant, not high and shrill.  For most programming that doesn't require a theater sound system the audio is adequate. The stand that is provided wobbles.  This isn't to important to us because we do not have children in our home.", "Date": "September 27, 2013"}, {"Title": "Black spot on top edge turned into an un-viewable screen", "Author": "Nightbringer", "ReviewID": "R17SZ7TJQT8EJN", "Overall": "1.0", "Content": "I ordered this for my parent's who lived in a different state.  Apparently there was a black 'spot' at the top edge of the screen that they didn't notice when the TV arrived.  My brother noticed it when he visited and now this spot has turned the screen into, what looks like a cracked LCD screen.  It's been over a month so I cannot return it (mea culpa) so am now stuck with attempting a repair by Toshiba...", "Date": "September 15, 2013"}, {"Title": "Excellent tv", "Author": "amazonian", "ReviewID": "R1AFDCDWC9L5PV", "Overall": "4.0", "Content": "It has nice picture and good sound quality. All necessary inputs are available.The remote controller is the only way to operate it. There is not even a power on/off button on the set.The  setup may not be intuitive for connecting a computer. Had to call support to learn that other than the inputs you have to go down to options to get both picture and sound.", "Date": "September 12, 2013"}, {"Title": "good quality", "Author": "chia-hsiu", "ReviewID": "R3CLHMHWWROD7J", "Overall": "4.0", "Content": "The only drawback is the stand is not very strong. The TV would sway, if you want to plug something. Also, the TV setting is not very user friendly. It took a while for me to know how it works. However, the sound and the color are perfect. I just got it one month ago. Hope everything would be good in the future..", "Date": "August 26, 2013"}, {"Title": "image sharpness, color rendition excellent", "Author": "James Steven Nichols", "ReviewID": "RPSLJEUNL8P4X", "Overall": "5.0", "Content": "for the price range color rendition and image sharpnessare superior  120Hz aids in action scene images No extra bells and whistles, justgood solid picture quality", "Date": "August 19, 2013"}, {"Title": "Great Investment for the money", "Author": "C. Ruston \"Creative Technicians\"", "ReviewID": "R33NXDC8ZWKFZ3", "Overall": "5.0", "Content": "For A LED , this is very well priced, and it also works well for a PC monitor, it took sometime to find a resolution that would work with my laptop.Very light, Very Slim, good sound, well worth the moneyCan see from any n all angles no darkening which is good and the 120hz helps with action flix and games", "Date": "July 9, 2013"}, {"Title": "I had the 32\" So, I figured 39 would work just as well", "Author": "William G. Haver \"Lawnman\"", "ReviewID": "R318MVB2H09YHM", "Overall": "4.0", "Content": "As having a Toshiba 32\" LED 1080p which had worked out great, I thought I would upgrade just a small amount both in size and price to the 39\" LED 1080p w/120mhz refresh rate - the picture is superb! the 120mhz does make the difference in watching fast action movies and even using it as a monitor for X-Box games. The game graphics refresh and fill with unnoticeable speed and clarity - which in gaming can be key. Well, yes having Hi-Speed Fios doesn't hurt either.", "Date": "July 25, 2013"}, {"Title": "Toshiba Led TV", "Author": "Martha Dennard", "ReviewID": "R26IDMB4OWZFRA", "Overall": "5.0", "Content": "Good picture and good sound. My son bought one and I was so impressed with his that I bought one. Good quality product.", "Date": "May 29, 2013"}, {"Title": "Received today and am already enjoying the purchase - 4 stars", "Author": "Scott Kessler", "ReviewID": "RUUWMQ13FQMFH", "Overall": "4.0", "Content": "Pros:(1) Great cost.(2) Fantastic picture/color considering the fact that it's somewhat of a budget TV.(3) 120hz really comes through after moving from a 1080p / 60hz TV to this 720p / 120 hz TV.(4) Gaming is amazing. Very vivid colors and the animations are without any lagging.(5) Hooked up the Xbox360 for more than gaming and tried out Netflix. Some shows need a lot of volume, but speech is much better on the TV than most flat screen HDTVs.(6) Not much, if any, LED \"bleeding.\"Cons:(1) The stand is kinda shoddy. Despite needing to screw in the base to the TV, the is still a little wobble and I think the TV is titled to the left just a bit.(2) The speakers are good for a HDTV, but I still think I'll need to use external speakers of my own.I'll update if anything comes up as I use the TV more.", "Date": "September 18, 2013"}, {"Title": "Great TV for a great price", "Author": "fantasy reader", "ReviewID": "RLMWZFQVY07BN", "Overall": "5.0", "Content": "I recently bought this TV.  It was my first flat screen television and I'm glad I bought it.  The picture is crisp.  It has excellent sound.  Many flat screens have poor sound but not this one.  The only drawback is that it doesn't handle Analog inputs very well.  If you have a WII or a DVD player without HDMI you'll need to get RCA to HDMI converters.  But still well worth the price.", "Date": "September 4, 2013"}, {"Title": "Exactly what I was looking for!", "Author": "7rory5", "ReviewID": "R3EZEZ8CAM6EFR", "Overall": "5.0", "Content": "I just picked up this TV from a local brick-and-mortar because they matched Amazon's price - including reducing it to make up for having to charge tax.  I was surprised how light it was as well as the ease of set-up.  I AM THRILLED WITH THIS TV!!  The picture was great right out of the box - with only a small, powered HD antenna!  Our computers and the Blu-Ray player are equally stunning.  The dimensions of it worked to get us the biggest screen size possible while still fitting in our cabinet.  I never thought we'd get a 39\"!  Plus, with this model having 3 HDMI connections, RCA audio out and smooth motion I couldn't be happier!", "Date": "June 12, 2013"}, {"Title": "Cool and crisp", "Author": "Scott Olson", "ReviewID": "R35KLZ2YHKE4SF", "Overall": "4.0", "Content": "Good picture, LED is cool and doesn't heat up the house or use as much energy as many others.It was easy to hook up and works great in the bedroom.", "Date": "August 23, 2013"}, {"Title": "Love Our New TV", "Author": "T. Doyle \"BargainShopperMomof3\"", "ReviewID": "R23DRV3QMRTLT3", "Overall": "5.0", "Content": "We have had it for over a month and love the picture and sound quality.  It was for our spare room and we couldn't be happier.  It is used for movie watching and gaming.  The seller was great and shipped it to me very quick.", "Date": "October 7, 2013"}, {"Title": "Took two attempts, but still happy.", "Author": "Cruise Master \"SnowBird\"", "ReviewID": "R3EMWKY24OTQ8P", "Overall": "4.0", "Content": "This TV was sold by Amazon which I was very happy about. The first one was delivered with a defective outer frame. It would allow a very bright line to appear at the top. Amazon as always made the return easy and a new TV was shipped immediately. Second TV has been running with no issues for a week now. We enjoy the picture, but what is the real bonus is the sound. I can at last understand what is being said on a flat screen TV.For some odd reason flat screens seem not to care about the audio quality. This Toshiba must have cared, and for that one main reason I would recommend it to others.", "Date": "July 19, 2013"}, {"Title": "Great tv, won't find one better at this price", "Author": "alex thill", "ReviewID": "RZLK9ME16TDAX", "Overall": "5.0", "Content": "This TV is awesome, the picture is perfect. I've read some people have problems with it, when in use with an HDMI cable it's perfect. I've watched a lot of action movies and no problem at all with the 120 refresh rate. My bluray player upscales non bluray movies and the picture is still great. I love the sound options with this TV, a lot of new tvs have horrible sound, not this one.", "Date": "June 11, 2013"}, {"Title": "Big picture in a small set!", "Author": "C. Hubler", "ReviewID": "RI3DN25MR35IA", "Overall": "5.0", "Content": "Beautiful 1080p images, when calibrated properly.  Great viewing angles side-to-side and from top of screen (though I don't think the screen is IPS type).  Works great as PC monitor.  (3) HDMI inputs a blessing.  Almost 3D type depth of field with 1080i source material.  Built-in digital tuner works extremely well; received all channels in Los Angeles market.  Though its digital signal strength meter isn't the greatest.  Highly recommended and quite affordable.", "Date": "June 10, 2013"}, {"Title": "Toshiba 39L1350U LED HDTV", "Author": "Andrew", "ReviewID": "R3OH1ZAMVRSGVC", "Overall": "5.0", "Content": "The Toshiba 39L1350U LED HDTV is a great TV.  Setup was easy, excellent picture, and very good sound.On top of that the price was great and delivery beat the estimated delivery date.  Can't get much better than that.", "Date": "June 15, 2013"}, {"Title": "Best picture in the house!", "Author": "ROLLIE SEIBERT", "ReviewID": "R31QHCGZE6JAPI", "Overall": "5.0", "Content": "Have had this 23\" Toshiba for 2 months now. It's got the best picture of all my TVs, including my big screen Panasonic and JVC. I bought a Samsung first but the wall mount plate covered the HDMI inputs so exchanged it for a Toshiba. Wow! Much better picture than the Samsung. Good sound too (considering). I have been so happy with it I just bought a second one for the beach house.", "Date": "November 19, 2013"}, {"Title": "HDTV Value", "Author": "Lowell DeHaven", "ReviewID": "R1R7N6EMHODORD", "Overall": "4.0", "Content": "Have had the 50\" Toshiba for several weeks now and am happy with the set.  Good picture, clarity and color right out of the box with factory defaults.  No bad or black pixtel areas.  Arrived with forklift puncture hole in the box from some forklift monkey during distribution process, but it missed damaging the unit itself.  The mounting stand design is a piece of crap...plan on wall mounting or extra support if using the unit standing on its own.", "Date": "October 7, 2013"}, {"Title": "'Great monitor / TV! 'Can't beat the price!", "Author": "Tom Jr", "ReviewID": "R12TBRR74EBAK1", "Overall": "5.0", "Content": "We bought two of these Toshiba 39-inch, 1080p, 120Hz, LED HDTVs as xbox 360 monitors to use with two system-linked (and on \"xbox live\") controllers. So far, they are working great! They replaced two older Sony 32-inch, 1080p, 120Hz, LCD TV monitors that we bought about six years ago (they were great too; unfortunately, the power supply card in one of the monitors died and could not be ecomonically repaired). The picture is bright and dynamic! The audio is more than adequate for gaming. Amazingly, given that the plastic border surrounding the screeen is so narrow, they two monitors, side-by-side, take up just about the same amount of wall space as the previous two Sony monitors. Lastly, the two Toshiba monitors combined cost less than one of the higher-end \"gaming\" Sony 32-inch LCD monitors I purchased six years ago.... You can't beat the price. The Toshiba's are a great bargain! 'Highly recommend.", "Date": "August 26, 2013"}, {"Title": "Terrific picture", "Author": "a reader \"maxona\"", "ReviewID": "R2JATESEJN59EY", "Overall": "5.0", "Content": "I own 2 Toshiba TV's. I needed a smaller TV and searched for the Toshiba brand. If you have cable with HD on your TV, I think you will really be pleased with this product. The color is very good. I didn't feel the need to adjust the color on my set at all. The channels that come in as HD are crystal clear. I also can project my computer screen on the TV (with a netgear product) and it is even clearer than on my computer sceen. The cost for such a good product can't be beat. Once again, if you are looking for an affordable TV with an excellent picture, I think you will be pleased if you purchase this brand and product.", "Date": "June 16, 2013"}, {"Title": "Theproduct has poor quality", "Author": "Mingwei Yang", "ReviewID": "R2W3VHBOXJ5ZDX", "Overall": "2.0", "Content": "Sometimes sound may be gone for no reason when you switch inputs, sometimes even images are gone, so you have to turn off/on the TV!", "Date": "January 16, 2014"}, {"Title": "Easy to set up great tv", "Author": "Paul in MD", "ReviewID": "R3T3L4H9PFESGO", "Overall": "5.0", "Content": "For a 32 inch tv it has a great picture and more than enough volume although with all the connections available you can add speakers, dvd player and your pc.", "Date": "December 2, 2013"}, {"Title": "Super TV", "Author": "doctrains", "ReviewID": "R2QOPVFVHN9P5K", "Overall": "5.0", "Content": "This is one great little (?) TV at a great price. Picture quality is superb!  You can adjust screen display.  All in all - a nice buy.", "Date": "November 20, 2013"}, {"Title": "Toshiba 32 inch", "Author": "maximuslover", "ReviewID": "RD3C2E1M6B5TI", "Overall": "5.0", "Content": "Great picture and great sound.....great price . Totally better than what I had before. Sound not brassy!!!  You will not be sorry in this purchase", "Date": "November 17, 2013"}, {"Title": "I like it...", "Author": "JON \"JON\"", "ReviewID": "R3KY75KA0X7CMM", "Overall": "5.0", "Content": "The TV is great and easy to hook up.  I can see how the other reviewer said the stand could be stronger.  It will move a bit from side to side, but seems to stay straight enough.  My problem was that I discovered my cable service was not HD.  A smaller TV tends to have a sharper picture on a lower resolution.  When you get up to the 50 inch, that lower res shows up more in the picture.  Anyway, the Blue Ray player will show off the ability of the larger TV just fine. I might mention that Amazon supplies customer support for this TV for the first 30 days.  I did call with a question regarding the HD and they were extremely helpful and informative.  Also the TV was delivered to me all the way down to Key West, Florida about 5 days earlier than promised, which worked out well for my schedule.  I like a lot of things about Amazon and trust them more every day.", "Date": "November 16, 2013"}, {"Title": "Amazing", "Author": "Tarek K.", "ReviewID": "RZZEQIXMIGVW7", "Overall": "5.0", "Content": "I am really glad that I bought this LEDit's very light, elegant, has a pc connection, amazing colors full HD 1080 pthe only problem is the speakers its not that good quality and there is not many Audio optionsbut still amazing deal with amazing price", "Date": "October 28, 2013"}, {"Title": "Could Be More User-Friendly Formatted", "Author": "AthenaisMedomai \"Jessie\"", "ReviewID": "R36EPP3EBO7K7K", "Overall": "4.0", "Content": "Great TV for the price, and my family loves it.  It was a gift for Fathers Day and my husband's birthday.  It's our first flat screen HDTV, so definitely worth what I spent.  We like the features, although they could be more user friendly.  Works well with ATT U-Verse.  Easy to put together to put onto an entertainment center, and appeared easy enough to mount on a wall if that's what we chose.Would use this seller again, as the TV arrived timely and exactly as described.", "Date": "October 9, 2013"}, {"Title": "Excellent quality", "Author": "IVAN J. ALDANA", "ReviewID": "R1H0DPJHCF0ORU", "Overall": "5.0", "Content": "Expected a little less quality but really good for the money.Will buy Toshiba next time around, they could make the remote a little bit simpler,", "Date": "October 4, 2013"}, {"Title": "Not the best, but does a good job", "Author": "Bob Morrow", "ReviewID": "R1DF9YNOMJDQCA", "Overall": "4.0", "Content": "This of course is not the top of the line TV, but it really does a good job. Picture quality is real good and light weight. Only issue I have is the base is a little off kilter, nothing big, just noticeable to someone like me who likes things dress right dress. The base is fixed, you cant swivel the TV otherwise a good buy for me.", "Date": "October 2, 2013"}, {"Title": "WOW", "Author": "Bradley Mathies \"Design style\"", "ReviewID": "RN5BXLE1DF9RK", "Overall": "5.0", "Content": "I love it, I have been wanting a TV for my shop for almost two years and this was my time to invest in it and I glade I did, the picture is great and the sound is better it help me stay in touch with the news all day.", "Date": "October 1, 2013"}, {"Title": "Happy Purchase", "Author": "Food Critic \"Glen\"", "ReviewID": "R32I3IFWS8J6NG", "Overall": "4.0", "Content": "This is the first Toshiba item I have owned, save for the CDRW I installed on a computer a dozen or so years ago.  I wasn't interested in a smart TV, so this Toshiba 50L1350U 50-Inch 1080p 120Hz LED HDTV fit perfectly.The clarity is excellent, with great colors.  Even darker scenes show up clearly.  The Blue-ray DVD's we watched on it were incredibly sharp.  The sound is decent, but not fabulous.  I am somewhat disappointed with the remote.  My couch sits about 12 to 15 feet from the TV.  If I'm sitting on the left side of the screen, the TV does not register the remote.  I have to move to the right until I'm directly in front of the sensor in order for it to register.  Since I primarily watch Netflix through my Blue-ray player, this doesn't really matter until I have to adjust the volume.  I may just look into getting a universal remote to see if that doesn't fix my problem.The stand it comes with is flimsy.  Actually, I think it's the entire setup.  I don't recommend leaving it on the stand for long.  It's not solid.  I wish the TV had one additional set of component video hookups, since the kids still play the older gaming consoles, but they don't complain too much about having to swap out the cables.All-in-all this is a great TV for the price, though I've only had it for a month.  Even after reading the overwhelmingly positive reviews, I was skeptical.  But I have to say I am satisfied.  And that's saying quite a bit since I held off buying a TV for 6 months, waiting for the right TV with the right price to come along.", "Date": "September 12, 2013"}, {"Title": "Good Price for 29in TV - one dead pixel.", "Author": "---->Sam<----", "ReviewID": "R37DN0PO49J1BO", "Overall": "4.0", "Content": "I did some research before buying this tv and strangely nothing online has the specification for its native resolution or the max resolution of this tv...even on toshiba website it only says this tv is 720p. After i setup my tv to my pc, i found the actual resolution of this tv 1360x768 if you're looking for the specific resolution here you go.As for the TV, $180 price is a very good deal usually only no-name brands offers this price point at this size. I found one dead pixel after setting it up, since it is price cut of $120 and dead pixel is at the corner I'm probably just going to stick with it.Video Quality is fine but my laptop is 1366x768 so switching resolution is a bit annoying.Sound Quality is not bad in my opinion but this is my first(my last TV, a 32in Sceptre only lasted 3 HOURS) tv for my room, so anything its give or take.3 HDMI is nice because LG and Samsung TVs only have 2 HDMI.So far it is working well, hopefully it will last long.Edit 1Connecting to pc issuesSince this tv has a odd resolution of 1360x768, setting the right resolution in your pic settings is very important. My laptop has native 1366x768, part of my screen was cut off due to the extra 6 pixels not being able to display. After setting the right resolution the tv looked crisp and HD from a distance dispite the result ion is a bit lowered.As for the lag issue I've seen people mention, I have no problem playing battlefield 3 on this tv from my laptop. The HDMI cable I have is only $3 I bought from amazon. It is important to turn Vsync on in game setting so the computer will match the 60hz refresh rate with 60fps.Games that I play with this tv:Battlefield 3League of LegendsLeft 4 Dead 2Killing FloorAll have no screen lag problem at 60fps Vsync on.", "Date": "September 2, 2013"}, {"Title": "GREAT", "Author": "Amazon Customer", "ReviewID": "R3I4RDG9U5ZP89", "Overall": "5.0", "Content": "The purchase was as advertised. It was a Good price and a real value.  It arrived safely and whole with no damage.  Good tv.  Very satisfied with the whole purchase procedure.", "Date": "August 29, 2013"}, {"Title": "very good TV", "Author": "Stanley", "ReviewID": "R2A8WRRD5YGTU8", "Overall": "5.0", "Content": "I bought this TV mainly for its RGB feature. I hooked up with my laptop and it gives a very good quality picture and everyone in my family loves this TV and i definitely recommend this one.", "Date": "August 23, 2013"}, {"Title": "great tv", "Author": "Child of God", "ReviewID": "R74ZN6APN1JCW", "Overall": "5.0", "Content": "I bought this as a gift for a friend and it was the perfect item. She loves it and it is all it should be and more. Thank you", "Date": "August 2, 2013"}, {"Title": "Great picture and sound", "Author": "Zac", "ReviewID": "R2SGYWDFFJ963H", "Overall": "5.0", "Content": "Great HDMI image. Goes to 1080p when hooked into my computer. Sound quality is similarly great and I haven't had any issues with it so far.Only con is the annoying blue stand that holds up the TV. Strange choice and can be distracting at first.", "Date": "July 10, 2013"}, {"Title": "Perfect size for my room", "Author": "Meggo39 \"Meggo39\"", "ReviewID": "R3VDNT92IB6TET", "Overall": "5.0", "Content": "Great picture, fits my needs.Stable stand - not the case with other televisions of the same size that I had previously tried.I would definitely recommend it to a friend.", "Date": "July 2, 2013"}, {"Title": "Great for the price", "Author": "R. Murray", "ReviewID": "R1GNXRC404U05N", "Overall": "5.0", "Content": "Great TV for the price.  Out of the box the picture appeared to be way off as far as color etc.  Took about 10 min to get everything dialed in and looking good.  The bezel is one of the reasons I went with this screen.  It is so thin and looks really good, TV is also very light (20lb).  This TV will serve as an Xbox / Computer monitor.  For $347 nothing even comes close to specs, looks or picture.  Would recommend and buy another.Only con I can give is the flimsy base can make it wobble if you bump it or touch it..?  I plan to hang it so thats a non issues for me.  Also, the screen isn't a completely matte one.  It has a bit of a shine to it.  Not full blown gloss like most laptop screens but it may be an issue for some.", "Date": "July 1, 2013"}, {"Title": "Great TV", "Author": "Eric", "ReviewID": "R26FCM8JAKTELC", "Overall": "5.0", "Content": "This is a nice 32 inch TV; great picture, sounds good, perfect for a bedroom. If its a 32 inch your looking for this is what you need.", "Date": "June 24, 2013"}, {"Title": "TOSHIBA tV", "Author": "mildred m piper", "ReviewID": "R2KGK9D4I5RLH3", "Overall": "5.0", "Content": "perfect size ,price and the TV works perfect for my needs.  great Tv  would definitely recommend to anyone needing a smaller TV", "Date": "May 29, 2014"}, {"Title": "Never buy a Toshiba again", "Author": "M. S. Hanley \"nana\"", "ReviewID": "R3A1QWQTLS6JZR", "Overall": "1.0", "Content": "This TV, still under manufacturer's warrantee began having problems 2 months ago.  Calls to Toshiba resulted in speaking with someone whose first language was not English, hours on the phone and finally being told that even though I live in a city of over 100,000 the only 2 repair places were 30 mins away in very small towns.  One no longer does repairs and the other, after sending pictures of the screen etc still has not been able to get the needed parts.  So here I sit with a 7 month old tv that does not work and no help from anyone", "Date": "May 23, 2014"}, {"Title": "Very nice TV", "Author": "Mark Godbee", "ReviewID": "RUVZ16QTRLS7J", "Overall": "5.0", "Content": "This TV works very well, has a clear picture and contains several HDMI plug-ins which was a major reson for purchasing this item.", "Date": "May 19, 2014"}, {"Title": "Fantastic", "Author": "ELIZABETH", "ReviewID": "R3NL725XGNQV6A", "Overall": "5.0", "Content": "I wanted a small flat screen LED HDTV for my bedroom and I'm extremely happy with my Toshiba. Beautiful picture, good sound,and easy to set up. I'm not a techie. I'm a very happy camper! And because I opened an Amazon Prime account with this purchase, I really got the deal of the century!", "Date": "May 16, 2014"}, {"Title": "Great tv", "Author": "Manora", "ReviewID": "R34JL4UZNS5EP9", "Overall": "5.0", "Content": "The picture is great and the sound is good for me.  I think  it was a good buy for the price.  Im glad I bought it.", "Date": "May 15, 2014"}, {"Title": "Like it just fine", "Author": "Bob - Manhattan, New York", "ReviewID": "R1VZA0JSHD7FOI", "Overall": "4.0", "Content": "Picture quality is great. Just what I've come to expect from Toshiba tv's.However,the sound quality is disappointing. I would recommend this product.", "Date": "May 6, 2014"}, {"Title": "Just Stunning!", "Author": "Mark Decker", "ReviewID": "R34IFE59NO47TJ", "Overall": "5.0", "Content": "This is a fantastic HDTV.  The picture, both in HD and standard is superior.  Very easy to set up.  I have an Apple TV, BlueRay, and cable connected.  The difference betwee a 55\" and a 58\" is significant.  So if you have a choice go bigger.  The 58\" was as large as I could go with the space i had to work with.You won't go wrong with this unit.  No comprimise on the pictrue given the outstanding price!.  A 240hz refresh rate insures smooth fast moving sports are clear.", "Date": "May 1, 2014"}, {"Title": "What I Don't Like About My New TV", "Author": "Vanessa T. Evans", "ReviewID": "RUM85V3ODFE1B", "Overall": "3.0", "Content": "I chose this rating because, I'm not getting the full enjoyment of 1080p, and that may not have anything to do with the TV itself, I think it has to do with my cable provider.  But one thing that I don't like about my new TV is the pedestal that it's on, it's a bit shaky, not as sturdy as it could be.", "Date": "April 20, 2014"}, {"Title": "Great and easy to set up", "Author": "Angela Shudo \"new mommy\"", "ReviewID": "R3EXORAXKRUDN4", "Overall": "5.0", "Content": "Bought this for my mom. It is a great second tv and at this price we could't be happier. The picture is clear and she can navigate it easily.", "Date": "April 19, 2014"}, {"Title": "Great price", "Author": "R. Lano \"Bobby Ray\"", "ReviewID": "RBX74LN2G7H2N", "Overall": "4.0", "Content": "I have a 46\" top of line Toshiba bought back in Oct 2010. Fab picture and features.But this 39\" one, while only replacing my bedroom TV which the ex stole, is okay but lacks a bit of the picture quality that the 47\" one did.Could just be the picture size being smaller.", "Date": "April 11, 2014"}, {"Title": "Great TV", "Author": "Alex S.", "ReviewID": "R2AG3A9V192HON", "Overall": "4.0", "Content": "I've had this tv for a little over a month now and I really enjoy it. I bought the 32-inch model and it's perfect for my bedroom, the stand was easy to attach and the settings are pretty simple for the un-savvy like myself. I enjoy bass, and the speakers do a pretty good job of supplying great, sound after fiddling witht the bass and treble settings. Only thing is that if the bass and treble are set too high the speakers vibrate which is to be expected (everything has a limit) but it's a little depressing. I plan to get a wireless soundbar at some point in the future, but for tv speakers, they are pretty powerful. Volume at 20 and it's blaring so that's great. Picture quality is beautiful, and the different modes are fun (Gaming, Movie, Dynamic, Standard). I usually leave mine in Dynamic as most other settings are very dark (especially Gaming).All in all, would recommend to others. Great product for the job.", "Date": "March 25, 2014"}, {"Title": "Perfect size", "Author": "John L Moss", "ReviewID": "R2S4C20MOAWW8D", "Overall": "4.0", "Content": "Quality picture, perfect size for kitchen counter although volume adjustment between HD and other channels is a little too much.", "Date": "March 25, 2014"}, {"Title": "Fantastic Value - excellent choice", "Author": "Bluewater Business Consulting LLC", "ReviewID": "R2940KMMVZJ484", "Overall": "5.0", "Content": "I had my heart set on a Samsung but was unwilling to spend quite that much, however this Toshiba is easily as clear and amazing a picture than the Samsung TVs I had researched. It is like sitting in the middle of the movie. Sound quality is good and it is quietly unobtrusive for a 58\" screen!", "Date": "March 25, 2014"}, {"Title": "Toshiba23-inch tv", "Author": "Christine Popp \"vettechick\"", "ReviewID": "R1T9K99L38AQ2C", "Overall": "5.0", "Content": "Needed a small-ish tv but still wanted big color and big sound.  It rocks!  Great picture.  I would but this again.", "Date": "March 24, 2014"}, {"Title": "Good Item", "Author": "Joe Lopez", "ReviewID": "R33UHIQT5ONEA8", "Overall": "5.0", "Content": "Great item for the price can not go wrong , I will recommend this item to any one who needs it", "Date": "March 22, 2014"}, {"Title": "Exactly what I was looking for! Excellent value for a near 60 in. HDTV!", "Author": "TheNotoriousMAZ", "ReviewID": "R3VISY15149F5Z", "Overall": "4.0", "Content": "Considering I already had a multitude of \"smart devices\" such as my Xbox and Chromecast to access Netflix, internet etc, I had no need for a smart TV. Having a big screen was a priority, and I wanted at least 120 Hz. The \"dumb TV\" market is certainly dwindling, but it makes sense to save a few bucks and forego the smart features if you can already get them elsewhere.My shopping search brought me to this model Toshiba, and a 60 in. Samsung (UN60FH6003F), both which could be had for less than $1000. I was able to see both models in person; the Toshiba at Paul's TV, and the Samsung at Costco. Both were close in terms of performance, but the 240 Hz and quicker response time for gaming won me over for the Toshiba.After optimizing the screen settings over the past couple weeks, the picture quality now astonishes me everyday. Blacks are deep and colors pop without being too saturated. The only thing I negative thing I can say about picture quality (and deducted a star for in this review) is that there is some backlight bleed in the bottom left corner when the screen is completely dark. This only happens late at night when the TV is the only thing illuminating the room. Otherwise it is unnoticeable.The sound from the built-in speakers is nothing to write home about, but that seems to be the case with most flatscreens. I have a 5.1 system, and pairing that sound quality with this great screen brings a top-notch entertainment experience. If you do not have a sound system, I would highly recommend getting a sound bar at the very least.I was a bit wary when I bought this TV because there were so few first-hand reviews out for it. Some reviews mentioned that the TV stopped working after a few weeks, or even arrived completely dead. That was not the case for me, and I will knock on wood for good longevity. I consider myself lucky finding this Toshiba for only $799 at Sears, and can say with confidence that it is an excellent bargain. If you are searching for great picture quality in a big screen without the added bloat of smart software, look no further. I can recommend this unit with confidence.***This is a copy of my review from Sears, where I purchased this TV. Amazon is where I come for my user reviews, and want to contribute here as well.***", "Date": "March 17, 2014"}, {"Title": "Overall great TV", "Author": "D. W. Clark", "ReviewID": "RB46D2HRZPGZU", "Overall": "4.0", "Content": "This is a great TV for the price, it has a great picture, it's lightweight and easy to setup.  My only complaint is that Toshiba televisions don't have a good low volume.  I originally bought this for a bedroom, but on volume level 1, it can be heard clearly in the hallway.  It is not so loud that it would be a bad TV for a office or living room, but I would rather it be a little quieter for my bedroom.", "Date": "March 12, 2014"}, {"Title": "Great TV", "Author": "Yellow Bee", "ReviewID": "R2D1U66NBJ6URK", "Overall": "5.0", "Content": "I bought this TV as part of a quest to make my home more energy efficient. This is a great bedroom TV. I has descent sound and a great picture.", "Date": "March 10, 2014"}, {"Title": "Truly great for the price", "Author": "Rebecca", "ReviewID": "R2CGIOORGPCPR1", "Overall": "5.0", "Content": "Great picture, good color, definition outstanding when hooked to HD.  For just under $200, the TV is really a great value", "Date": "March 10, 2014"}, {"Title": "looks, features", "Author": "brian hase", "ReviewID": "R3QK21N0MTW02K", "Overall": "4.0", "Content": "love this tv , great picture, easy controls , sound is great, clean, crisp, sharp picture, easy remote, good looking", "Date": "March 9, 2014"}, {"Title": "Ok for a budget tv in bedroom.", "Author": "Eva M. Wilson", "ReviewID": "RZEZ082XJCONV", "Overall": "3.0", "Content": "I bought this for my daughter and she likes it.  Not the best picture, but ok.  You get what you pay for...", "Date": "March 8, 2014"}, {"Title": "brilliant", "Author": "ana teresa romero", "ReviewID": "R1THXJJAL6K5KT", "Overall": "5.0", "Content": "if you want a tv with good sound quality and this is your choice I loveclear that it is a bit wide but very light so 100% recommended", "Date": "March 4, 2014"}, {"Title": "Crisp & Clear", "Author": "L. Cerny", "ReviewID": "RKJGVSI4HE4BZ", "Overall": "4.0", "Content": "I upgraded from a 19\" AOC as I needed at least two HDMI inputs AND still have  ports for older game consoles.  It was easy to unpack and plug in all the cables.  I did not expect the quality of the picture to be so high; it is real HD and is crisp, bright, and runs cool.  As a monitor, it is nice having the extra desktop space to work on multiple projects.  As a TV, the picture is really gorgeous.  Fallout 3 (2008) looks very good and is definitely more immersive on a wider screen, but I have not hooked up my Nintendo 64 to check the quality.The initial monitor set-up is a little difficult as there are many options.  Correcting the PC input viewable area (without having those black bars on the sides) was the hardest part, but there are many websites which explain how to adjust the picture size while keeping the font readable.I do have a problem with the speakers.  Any volume setting over a \"10\" creates bass reverb; not horrible, but noticeable even after turning the bass all the way down.  As this device is primarily a PC monitor, I sit close and keep the volume at a \"4\" or a \"5\".  I can see the sound being an issue if this device is used as a TV and viewers are sitting at a distance.  The sound also seems to be better coming from the back of the monitor, but that could just be my unit.I would give this monitor a five if it weren't for the speaker issue.", "Date": "March 3, 2014"}, {"Title": "Remote!", "Author": "Carolyn", "ReviewID": "R20GMVG54OAU1G", "Overall": "5.0", "Content": "Love the TV, picture is great, however the remote could be better. Have to push too hard on the buttons.  It needs to be better quality.", "Date": "February 28, 2014"}, {"Title": "Lovely LCD", "Author": "H. Yousef", "ReviewID": "RKB6Z8CYCPWLY", "Overall": "5.0", "Content": "Very happy with his tv, picture is sharp, sound is strong and it's slim, bought a little one for the bedroom.", "Date": "February 27, 2014"}, {"Title": "great smaller tv for the money", "Author": "Lacey Morton", "ReviewID": "R2EMPTUL72D73G", "Overall": "5.0", "Content": "the only thing i night change is the mute button. one press of the mute button halves the volume. have to press twice to get mute.lpm", "Date": "February 25, 2014"}, {"Title": "Toshiba 58\"", "Author": "David W Erb", "ReviewID": "R28L996D1HJPQZ", "Overall": "5.0", "Content": "The main power supply board went out within the first week. Called Toshiba, no questions asked they had it repaired in my home within a week. The picture quality is great, the refresh rate is great, I would buy another.", "Date": "February 24, 2014"}, {"Title": "Very Nice TV", "Author": "Ann", "ReviewID": "R1GNE17LLQU9XH", "Overall": "4.0", "Content": "We are enjoying this TV.  It is certainly an improvement over what we had before.  Wish they made these TVs with the speakers in the front instead of in the back.", "Date": "February 22, 2014"}, {"Title": "Love this 39-inch TV", "Author": "NorCalGal", "ReviewID": "R3526KA61C3QTL", "Overall": "5.0", "Content": "After using this TV for over a month now I have absolutely no complaints!  It's a perfect size, with lots of setup options on the menu. And, it was a super easy install on my DirecTV service, too.  All in all, from receipt of this TV right thru the complete install, including the DirecTV remote setup - it took 37 minutes.  The picture is great, the sound is great, the menu is easy to use.  A very good buy for the price, indeed!", "Date": "February 22, 2014"}, {"Title": "Just what I was looking for.", "Author": "m bollen", "ReviewID": "R32NXEHXGU0QOP", "Overall": "5.0", "Content": "For the price, great product. What sold me was the analog audio outputs. This was the only set I could find that would allow me to hook into my old stereo system. All features from the remote transferred to my universal remote. Easy to use ( thinking about getting one for my father).", "Date": "February 21, 2014"}, {"Title": "Perfect fit; great picture.", "Author": "David Styron", "ReviewID": "R19C6V1QGYMSVU", "Overall": "5.0", "Content": "This TV fit perfectly in the space I planned for it.  It looks great and has a very good picture on my HD FiOS television setup.  Very pleased with this purchase.", "Date": "February 19, 2014"}, {"Title": "Love it", "Author": "Nancy Hughes", "ReviewID": "R2BEUV36VQ6RD", "Overall": "5.0", "Content": "Great picture and easy to set up. The stand is better than I thought it would be, very sturdy. Just the right size for our bedroom.", "Date": "February 17, 2014"}, {"Title": "Nice speakers, okay video, occasional audio problems", "Author": "McGroarty", "ReviewID": "R33MHT1ORR293I", "Overall": "3.0", "Content": "The speakers are surprisingly nice, given the small display. There isn't room-shaking bass by any means, but the low end isn't absent the way it normally is on small monitors.The video quality is nothing to write home about. It's a bit muddy, as if the video is pinned to something less than 24-bit color. The effect is most noticeable on flesh, which looks pasty. It has a wide color range regardless, and it has temperature customization as well as the familiar contrast and brightness settings. There are also some mpeg and digital noise reduction options that don't work as well as the counterparts on Sony TVs. There's some kind of edge enhancement filter that creates a sort of embossing effect even when it's disabled - the effect is more pronounced when it's set to \"on.\" It's pronounced enough that you wouldn't want to use this as a PC display.My big problem is that the TV sometimes powers on with a problem where it plays TV static then silence, even when on an HDMI input. Powering off and back on again is the only thing that seems to bring audio back. The static is quite loud and sends my cat fleeing the room every time.", "Date": "February 17, 2014"}, {"Title": "Toshiba LED HDTV", "Author": "Hank", "ReviewID": "R1YVHACET6AMKR", "Overall": "5.0", "Content": "Very nice monitor. Love it. Mounted it in the corner of our camper and the picture and clarity are outstanding.", "Date": "February 17, 2014"}, {"Title": "worth the value", "Author": "Aria", "ReviewID": "R2C042Y6V2X9GQ", "Overall": "5.0", "Content": "been a while since I bought a TV, was easy to assemble and light, pictures are great. just need to see longevity", "Date": "February 15, 2014"}, {"Title": "Amazing", "Author": "Dana", "ReviewID": "R2FGD30TY3BGAE", "Overall": "5.0", "Content": "I sent this to my grandfather as a gift for his birthday. Toshiba 32-Inch TV came on time in great condition! you couldn't even tell it was used before!", "Date": "February 14, 2014"}, {"Title": "Amazing TV", "Author": "Morabito", "ReviewID": "R3G7QXPZO2MH7", "Overall": "5.0", "Content": "This TV was a great buy.The price was reasonable for a 120Hz TV and the quality is great.This is a great improvment over my old CRT tv.", "Date": "February 11, 2014"}, {"Title": "Good for the price", "Author": "T. Law \"TL\"", "ReviewID": "R1K58YR86H789U", "Overall": "3.0", "Content": "This is a good tv for the price. The quality seems fine though the tv itself is very lightweight and I was a little concerned at first. Picture quality is noticeably less than the more expensive models but fair enough. You get what you pay for.", "Date": "February 10, 2014"}, {"Title": "Not a big TV watcher", "Author": "Joe", "ReviewID": "RX1SU882J50OG", "Overall": "4.0", "Content": "Please take into consideration that I am not a avid TV watcher.  I bought this TV for it's size to fit in my entertainment center in my living/family room.  The room size is approximately 12'x15 and the 32\" TV was the largest that would fit in the entertainment center space.  The farthest distance any chair is from the TV is approx. eight feet.  I would think anything larger than a 32\" TV would be over kill.  The TV was very easy to assemble and set up.  The picture and sound is everything that all professional reviews say.  In addition, it was very easy to route the sound through my stereo with RCA cords when I wish theater quality sound.  It is also easy to watch shows streaming off my computer and Kindle with simply plugging in HDMI cords from my TV to computer/Kindle.", "Date": "February 8, 2014"}, {"Title": "I LOVE THIS TELEVISION", "Author": "Rozaroni", "ReviewID": "R3MZ9KTQWAJZ9A", "Overall": "5.0", "Content": "Easy to set up, 1080p HD, 3 HDMI ports, great color, great sound. Chromecast setup was a breeze! What's not to love?", "Date": "February 6, 2014"}, {"Title": "Great TV for the price", "Author": "Paul", "ReviewID": "R3PK4AVJ4C4BK2", "Overall": "5.0", "Content": "I've had no problems with it. i have it set up in the bedroom less than 3 feet from me and the picture is super clear.Only problem is that it takes a long time to warm up, up to 30 seconds, and sometimes doesn't turn on on the first push of the remote.Considering the price the warm up time and turning on are small problems", "Date": "February 5, 2014"}, {"Title": "great picture", "Author": "Patrick Dickson", "ReviewID": "R2AXLWFGZZINUH", "Overall": "5.0", "Content": "great tv. for the money. more than happy with this purchase, all my friends comment on how great it looks", "Date": "February 3, 2014"}, {"Title": "Claims to play USB Video are false", "Author": "Ran", "ReviewID": "RIMEAV5NL7AVC", "Overall": "2.0", "Content": "Picture and audio are OK but the USB video playback does not support standard file formats such as mp4, avi, or mkv.  Very disappointed :(", "Date": "February 3, 2014"}, {"Title": "Was good but now ???", "Author": "Mike Calimari", "ReviewID": "R3M5ZO8WXO5AJK", "Overall": "2.0", "Content": "Great set at first with good picture for its resolution and has HIDMI inputs.  The missus had connected to her laptop as a secondary display for her work and the information display was easy to read. Absolutely no complaints about the picture or performance for the price, @ <$200.The bad:  The TV still works but you can't input anything with the remote.  I don't know if the remote died or if the sensor or its circuit inside the set went south in 4 months time.  The remote does pass the camera test, aim your remote at a digital camera wand watch its screen as you press the remote's buttons. You should see the IR emitter bulb glow.The set has a year warranty but must be sent to a repair center. The cost of shipping, insurance then cosmetic damage (we haven't removed the protective film yet as it is in a temp location) by the repair technicians means we'll probably keep it as is.", "Date": "February 2, 2014"}, {"Title": "Better than I anticipated.", "Author": "Rein D.", "ReviewID": "R3XD6UDUHNJ3Q", "Overall": "5.0", "Content": "I was looking for a tv to bring to college for my dorm room. Of course I didn't want something too big so I found this nice 32\" toshiba for a great price. I was also looking for a good gaming tv and with the 3 hdmi inputs and 120hz, this was perfect. I was worried about the 720p however because I wanted the graphics to be the best they could possibly be, but I bought it anyways since I couldn't find a better tv out there for such a good price, believe me I looked. Turns out when you use the hdmi ports for one of your gaming consoles, the resolution bumps up to the full 1080p. This tv was much better than I had expected and if you're looking for a nice tv, for gaming or just for television, that doesn't take up a lot of space and looks great, I highly recommend this one.", "Date": "January 31, 2014"}, {"Title": "Excelent choice.", "Author": "Carlos Ruben Soto", "ReviewID": "R1U7NPJHCD7O2H", "Overall": "5.0", "Content": "It's looks great. The quality of the picture is excelent and the sound is superb. Love it. I recommend it.", "Date": "January 31, 2014"}, {"Title": "Great for the price.", "Author": "Avid Fan", "ReviewID": "R360CG45WUKGY7", "Overall": "5.0", "Content": "Got this to replace an old 27\" tube tv from the early 90's (it's still kicking though) in the bedroom.  For the money I really can't complain, and when you're going from standard def to HD, you really can't complain.  I thing it has just 2 HDMI ports, one for the cable box and one using my Chromecast.  Frees up a lot more space, can't set the cable box on top of the tv anymore though.  I would recommend it and would be open to purchasing another for a spare bedroom.", "Date": "January 27, 2014"}, {"Title": "Great TV for the price", "Author": "Rob H.", "ReviewID": "R35RVX0TY7ZKRB", "Overall": "5.0", "Content": "I bought this TV for my bedroom and replaced an old box-style, CRT TV. The picture and sound are perfect for what I need in my bedroom. Is this the best TV out there? No. But, for a bedroom setting AND for such a reasonable price, it fits my needs perfectly. It was easy to set up and has a lot to offer at this price point. I'll probably buy a cheap soundbar to amplify the sound a little bit, but I'm overall very happy with this purchase and would recommend it highly.", "Date": "January 26, 2014"}, {"Title": "good overall", "Author": "Reg", "ReviewID": "R3M9SOIG22K58U", "Overall": "4.0", "Content": "Not a bad set. Bought as a gift. But watched it after we set it up. Not the best. But definetly not a bad TV. Especially the price.", "Date": "January 26, 2014"}, {"Title": "Great quality for the price.", "Author": "Aspen", "ReviewID": "R2DEQD3I99C9AA", "Overall": "5.0", "Content": "Great pictures and no gap when you flip from channel to Channel.  Clear picture, easy to set up.  Was skeptical at first, but overall very happy with it.", "Date": "January 23, 2014"}, {"Title": "Looks good", "Author": "Ms*Dee623", "ReviewID": "RYIHX7UDAOIWS", "Overall": "5.0", "Content": "Hung on my wall 50\" had to push couch back picture so good sounds good was easy to set up", "Date": "January 22, 2014"}, {"Title": "Great TV.", "Author": "Lady Texas", "ReviewID": "R1AL7CIVF34F3B", "Overall": "5.0", "Content": "Awesome picture, This is in my sons room and he really enjoys it and all the attachments with it. He has added a speaker system with his DVD and made a surround sound so he can enjoy Blurays etc.", "Date": "January 19, 2014"}, {"Title": "Perfect for the price", "Author": "Julianne M Koski", "ReviewID": "RBF6MILRHUCUA", "Overall": "5.0", "Content": "This was so great for me. It went in my office and I could not be more pleased. it arrived on time and in great condition. I was a little concerned at first because the actual TV Box was just wrapped with a piece of cardboard around it, but it was fine and works like a dream.", "Date": "January 17, 2014"}, {"Title": "Fine", "Author": "C. H. Morrison \"VintageGeek\"", "ReviewID": "R2121W9C9II3HW", "Overall": "4.0", "Content": "For an inexpensive HDTV, it met my expectations for picture, setup, etc. I've used it with my laptop from the office at home and also as an over the air HDTV via attenae. Worked fine.", "Date": "January 17, 2014"}, {"Title": "Great product", "Author": "MYLES", "ReviewID": "R12U354Z9TGA87", "Overall": "4.0", "Content": "The tv hasnangreat picture and excellent clarity! Definitely recommend! It has a slim design and thin frame. Would buy again!", "Date": "January 15, 2014"}, {"Title": "Amazing TV!", "Author": "Tomasz Kaczmarek", "ReviewID": "REVHQ3470VNX6", "Overall": "5.0", "Content": "This TV is amazing.  It's slim and has great pictures. For $300 on a 39 inch you cannot do better!", "Date": "January 14, 2014"}, {"Title": "Wife Likes it", "Author": "CL \"C\"", "ReviewID": "R1F6TGHTM4YM2Q", "Overall": "5.0", "Content": "Well, when the wife's happy....  Works well, connected to our cable TV just fine (we don't use the set top box with this TV).  Picture looks good, but I didn't \"study\" it like many people clearly do - we're happy with it.", "Date": "January 12, 2014"}, {"Title": "We enjoy it", "Author": "R. ZHANG", "ReviewID": "RN4I2XOGPXFC5", "Overall": "4.0", "Content": "I am not really picky for TVs so I can give much analysis to the TV regarding color brightness etc. But I see no problem, and my family likes it so that worth 4 star to me", "Date": "January 11, 2014"}, {"Title": "Good clear picture and sound", "Author": "Betty Key", "ReviewID": "R2SAR78OOYK8FM", "Overall": "5.0", "Content": "This tv has a clear picture and sound. We are happy with it so far. (It replaced an almost 12 year old TV so it definitely is better!)", "Date": "January 10, 2014"}, {"Title": "Good function, great picture, excellent value", "Author": "Apple Newbie", "ReviewID": "R14B5531QRMUQ2", "Overall": "5.0", "Content": "For this price point and functional list, this TV is awesome. The streaming content shows as 720p but blueray looks fantastic on this screen size.", "Date": "January 8, 2014"}, {"Title": "Great TV for the money.", "Author": "Patricia A. Justice", "ReviewID": "R18YZA9IV5W1CA", "Overall": "5.0", "Content": "I love the TV.  It is a good size for my room.  The picture is fabulous.  The sound is much better than I expected, after reading reviews of other flat screen tv's.  I am more than satisfied with this purchase.  This is my second Toshiba television and I am sold on this brand.", "Date": "January 8, 2014"}, {"Title": "Nice TV for the money", "Author": "Riledup \"Jim\"", "ReviewID": "R2QWJ3KFVLENI5", "Overall": "4.0", "Content": "We had to limit the size of our new TV so it would fit into the entertainment center. I already had a small 20 inch Toshiba in the bedroom, and it had a very nice picture if you turned off the Dynamic lighting feature. The LU1350 also had a VGA input, which could use with the PC that acts as my DVR for recording over the air TV signals. That left the 3 hdmi connections for my other equipment. I have a displayport to hdmi cable on order, so I won't need to use the VGA for much longer. Very loud volume, so using hooking it up to a home theater isn't necessary. Cheap remote control, so I swapped the much nicer one that came with my 20 inch years ago.", "Date": "January 7, 2014"}, {"Title": "Excellent TV for the money!", "Author": "sslami \"sslamster\"", "ReviewID": "RSJSVZKT4APEG", "Overall": "5.0", "Content": "I initially had a 37\" 720p Toshiba LCD, which I replaced with a 42\" 1080p Toshiba LCD, which was then replaced by this 50\" Toshiba 1080p LED TV.  I still have the 37\" and 42\", they both still work great; they have just been redeployed to the bedrooms.Because I have had such good luck with Toshiba TV's in the past, I decided to continue with the Toshiba brand for my new 50\" TV and I have not been disappointed.  The funny thing is that one of my wants in a new TV was to have RCA audio outputs as I have an old Sony SA-VA analog audio system, and Toshiba was one of the few that still had analog audio outputs in their TV's.I use this set as my main TV and I am very happy with it.  It has 3 HDMI inputs (my 42\" set had 4 HDMI inputs) and I have connected to it my cable STB/DVR, Xbox one, and Toshiba HD-DVD player.  My Xbox one has a built in blu-ray player so I was able to eliminate the need for my PS3.Aesthetically, I really like this TV.  The bezel is much thinner than my old set but not quite as thin as some of the new LED's out right now.  However, this TV is also much less expensive than some of the other newer LED sets.  The base is sort of flimsy and I was worried that, based on previous reviews, the TV would \"droop\" or wobble in response to vibration or someone walking near the TV.  Fortunately, that has not been the case.  Despite the fact that the base could be sturdier, it sits even on my TV stand and does not wobble.  The TV base unfortunately does not swivel like the 42\" set I had, but the wide viewing angle makes up for that.Inputs and outputs are perfect for me.  I needed at least 3 HDMI inputs because I don't have an audio receiver.  My audio system is old and analog, but still works great.  Switching between inputs is very fast, much faster than either of my older Toshiba LCD's.  The menu is also a bit more user friendly.  There are plenty of options for customizing the picture and audio quality.  The built in speakers are surprisingly good.When you feed a high quality source into this TV the results are exceptional.  For example, when I use my Xbox one for gaming or Netflix, the picture is (in my opinion) exceptional.  The same holds true when watching HD-DVD's or DVD's via my HD-DVD player.  When viewing the cable set top box, the quality of picture really depends on the channel.  Some channels are better than others, despite the fact that they are all supposed to be HD channels.  I don't think that this TV does much in terms of video manipulation, so the better the source the better the picture.  However, many of my cable channels through the set top box do look fantastic.  Again, not the fault of the TV.  Coming from an LCD TV, the colors and blacks are more vibrant on this TV.  Not sure if it's due to the LED technology or just the fact that this is a brand new TV.Overall, I am really impressed with this TV.  I was kind of worried that the quality wouldn't be as good as my 42\" Regza LCD based on previous reviews, but I have been pleasantly surprised.  The picture is fantastic, the audio is very good, and the looks are amazing.  I spent quite a bit of time calibrating my 42\" and 37\" Toshiba LCD's with DV Essentials on HD-DVD.  I really didn't need to even do that with this set as it looks pretty good right out of the box.  It is also significantly lighter than my 42\" LCD.  I highly recommend this TV!As always, Amazon was awesome with super fast shipping and delivery.  I'm 100% happy with this purchase.", "Date": "January 7, 2014"}, {"Title": "Works well so far", "Author": "Camera User", "ReviewID": "R3Q0WWTXW6MZ1P", "Overall": "5.0", "Content": "It has a very good picture, and a very wide viewing angle. The wide angle was important to us, because we use it in a motorhome, where we have to look up at it, and often sit to one side or the other. It's light, about 8 pounds, also important in the motorhome, where it's subject to driving forces, and it must be easily restrained should there be an accident.We've only had it a short time, so can not say much else.", "Date": "January 7, 2014"}, {"Title": "Nice and bright", "Author": "Bingo Tailspin", "ReviewID": "R20DOVWV10EU8Q", "Overall": "5.0", "Content": "The TV is very bright and clear.  The size is bigger than expected and great for a bedroom.  Very nice price for 1080p.  Kind of a cool base that is more than most HDTVs provide.", "Date": "January 7, 2014"}, {"Title": "I purchased this TV as a Christmas present for my mother", "Author": "Cherri", "ReviewID": "RGHDMJL8L8DBL", "Overall": "5.0", "Content": "I purchased this TV as a Christmas present for my mother. The TV arrived in good time. The TV itself is very nice, with a great picture. My mother was very pleased as were we.", "Date": "January 6, 2014"}, {"Title": "good tv", "Author": "carlos morris", "ReviewID": "RS5UDSN60AVYE", "Overall": "4.0", "Content": "small but image it is good, the only thing i do not like, it does not come with regular audio video input/output to hook up a regular DVD. it is all high definition now", "Date": "January 6, 2014"}, {"Title": "Exactly what we wanted", "Author": "L. Breheny \"LB\"", "ReviewID": "R2VHEI1SABL0Z4", "Overall": "5.0", "Content": "This TV is the perfect size to view movies, play games, etc. We are so enjoying it - I'm spreading the word!", "Date": "January 4, 2014"}, {"Title": "excellent quality; difficlt to set up", "Author": "mercedes montgomery", "ReviewID": "R1QV65ZU79JZV4", "Overall": "4.0", "Content": "The Toshiba 39'' led TV (or compter, or anything, really) is an excellent product.  Far better picture than or previous Toshiba set(pre-digital).  I am having trouble getting the picture the right size on the screen.  It seems that there should be more adjustment for width, mainly, and over-all fit of the received signal image to the screen.  Often it is obvious that there are words  that run off the end of the screen, and when I quickly try to select a different picture size, it is still not there completely.Color adjustment  and other tweeks are effective in viewing non- HD signal; we don't have HD signal yet.Sound comes out the bottom of the set and is somewhat 'tinny', so an amplified speaker system makes for much better sound quality.Overall, though, I expect this will be a good choice for the money, since our other Toshiba products have outperformed all previous electronics.", "Date": "January 3, 2014"}, {"Title": "Fits my needs perfectly", "Author": "Hans Probst", "ReviewID": "R2ZG9CUKOVAKXD", "Overall": "5.0", "Content": "Love it for gaming. My Wii U has never looked better. Perfect for people who want a TV that's just a great TV and nothing else.", "Date": "January 3, 2014"}, {"Title": "Superb", "Author": "Farhana Sumi", "ReviewID": "RUPWWMGQJHFEP", "Overall": "5.0", "Content": "Nice and slim and good sound !! It was my New Year gift from someone special....I like this TV, This is the second Toshiba in our home...", "Date": "December 31, 2013"}, {"Title": "Great TV and price!", "Author": "Thomas pendergast", "ReviewID": "R888MDNJ7N42I", "Overall": "5.0", "Content": "Great buy!  Better price than all places researched. Easy to set up. Great picture. Just the right size for our bedroom. Very pleased with this purchase. Would recommend this TV to anyone looking for a great TV.", "Date": "December 31, 2013"}, {"Title": "Very good TV for the size and price.", "Author": "Jason Bisenius", "ReviewID": "R2R5LF9PE6Y2XN", "Overall": "4.0", "Content": "My intended purpose for this unit is to double as a second PC monitor and HD TV.Pros:HD picture and colors are awesome.Like the multiple inputs: Three HDMI inputs, a USB port, a high-def PC port, and a ColorStream HD component input.Speakers sound good for a slim screen.Easy to set up and use.Light weight.Cons:There is a 1/2 mute feature so you have to push mute twice for full mute. This is an annoying, unneeded feature.As a PC monitor it works fine for the most part but when using a CAD program the pixels seem too big, definitely not HD quality.With PC speakers plugged into the TV, the remote does not control the sound level of the PC speakers.Overall good TV, just not the best.", "Date": "December 29, 2013"}, {"Title": "volume troubles", "Author": "pjs", "ReviewID": "R13Z8YEBHDGL7M", "Overall": "4.0", "Content": "We took our Sony and moved it replacing it with the 58\" Toshiba.  This is not a smart tv as they are called today so I call it a dumb tv.  Does just what I want, a fantastic tv to watch and that is all it does.  I could not give it 5 stars which it deserves because of the sound volume of the tv.  You have to listen to the tv at a volume setting of 1 up to 4 depending on the channel you are watching.  Toshiba says it is not the tv because my DVD is listened to at normal volume settings.  I had Cox cable come out and replace the box same problem, used another box, still the same problem, too loud.  Still when all is said and done it is not a huge problem, just shouldn't be that loud.  There are some times that it is too loud but the tv has a 1/2 mute feature that will take a volume setting of 1 down to 1/2 .", "Date": "December 29, 2013"}, {"Title": "Super gaming TV", "Author": "Chris M. Cooper", "ReviewID": "RX0ZX9ODZ7IKN", "Overall": "5.0", "Content": "Found this tv on IGN. Amazon had the best price and the shipping was almost a week faster than the estimation. Easy set up with and switching between Xbox 360 and XboxOne. Great picture and sound.", "Date": "December 29, 2013"}, {"Title": "Excellent screen for the money", "Author": "Dan S", "ReviewID": "RNW6VZ1U675SZ", "Overall": "5.0", "Content": "I did a lot of research a few months ago and found this Toshiba to be the best value at the time. The picture is clear and bright. We stream using an Apple TV and find the 1080p at 60Hz to be all we need.Highly recommend for the budget conscious looking for a quality screen without the bigger brand's inflated prices.", "Date": "December 26, 2013"}, {"Title": "It was a gift.", "Author": "manuel", "ReviewID": "R1T2Y7LYF7TMIL", "Overall": "5.0", "Content": "I got this for my girlfriend since she needed to upgrade from her 480p t.v. I set it up for her and she loved it. The menu is easy for her to adjust the visual settings since two of them are on the controller itself. The picture is good on this t.v that I think I have created a gaming monster with it. She said she can read stuff now and the images look good. Words are from her but not quoted. I was actually considering buying for myself, might do in a few weeks.", "Date": "December 25, 2013"}, {"Title": "Clear Picture", "Author": "S. Nagel", "ReviewID": "R2EEYUC93CVSJQ", "Overall": "5.0", "Content": "I am using as a computer monitor and it works well.  Easy to hook up and a very clear picture", "Date": "December 23, 2013"}, {"Title": "Very good television, crappy remote", "Author": "Weldon Berger", "ReviewID": "R162ESCCHMDAQ8", "Overall": "4.0", "Content": "I bought this particular TV because I've had good luck with Toshiba products and the price was quite good.  I've had it about four months now and am happy with it.Setup was very easy. The screen isn't the highest resolution, but at this size -- I got the 32\" version -- there isn't all that much difference between the 720p and 1080p, at least for me. The picture is lovely, with true colors and good contrast. The higher refresh rate makes sports and other action programming much more enjoyable than with the standard 60hz rate. The sound is decent (although you're always better off running audio through some decent external speakers). The picture looks good from a fairly sharp viewing angle. The unit is lightweight, which makes it easy to mount on a wall.I would give the TV five stars were it not for the remote, which is flimsy and doesn't include the channel guide feature that our little off-brand kitchen TV remote has. That's annoying because we only use a digital antenna so we don't have a program listing channel as one does with cable or satellite providers. At some point we'll replace the remote with a universal one. Even with that gripe, though, I wouldn't hesitate to recommend the TV so long as the price isn't much more than $200.", "Date": "December 18, 2013"}, {"Title": "Decent picture for the price", "Author": "B. Adams \"BA\"", "ReviewID": "RH5VK5EEER6VY", "Overall": "3.0", "Content": "First impression was not very good.  Seemed cheap compared to my Samsung and Sony.  After getting everything hooked up I decided the picture was decent for what I paid, $299.  The stand is woobly at best.  The remote does not light up and the buttons are3 small.  For what I'm using it for it's just ok.", "Date": "December 17, 2013"}, {"Title": "Toshiba 23L 1350U LED HDTV", "Author": "1slydude", "ReviewID": "RWR3P8HZ3PQ8Z", "Overall": "5.0", "Content": "The Toshiba 23L 1350U 23-inch 1080p LED HDTV works great.  The picture quality is excellent.  I purchased two of these Toshiba LED HDTV's and I am very satisfied.", "Date": "December 17, 2013"}, {"Title": "it's 'ok'", "Author": "Mr. Ronald Sach", "ReviewID": "R3DWK4LNKHQVMJ", "Overall": "3.0", "Content": "no great shakes... picture/audio 'ok' ... used in bedroom so 'ok'... would not use as main viewing tv... have seen much better TV's in this size...", "Date": "December 16, 2013"}, {"Title": "Great picture, 32-inch at 120Hz", "Author": "Eric S.", "ReviewID": "R31FBASOMD810N", "Overall": "4.0", "Content": "I bought this as a gift for my mother. Good value for money with this TV. Crisp and clear picture, even in action movies, however I hasn't been used for gaming so can't really assess the 120Hz refresh rate properly. 32-inch is a good size for most purposes and most people, so nothing wrong with making this your main TV. Sound is poor, but you can pretty much connect it to any stereo you have and that will take care of that. I will consider this model for my new studio apartment, where space is at a premium.", "Date": "December 3, 2013"}, {"Title": "Nice Toshiba TV", "Author": "john", "ReviewID": "R2D7XV2MS5PMJ5", "Overall": "4.0", "Content": "I was able to get an excellent price on this TV about 6 weeks ago and I really enjoy it . Sound is perfectly fine and the picture is very good without HD cable service . I use the Movie mode for TV watching and found the picture to be too contrasty in the other two modes . Minor issue is that no instruction manual is provided . It's been really nice for general viewing .", "Date": "November 29, 2013"}, {"Title": "A good value for money small LED TV (32-inch)", "Author": "Deovrat BAPAT", "ReviewID": "R5FU1JUOJBHK1", "Overall": "4.0", "Content": "TV is as expected! no complaints! Like the picture quality for the HD channels! The only flip side i noticed is that it is not as thin as I had imagined it to be! But for a 3 inch thickness, it doesn't really matter, as long as the TV picture is good and crisp - which it is.", "Date": "November 27, 2013"}, {"Title": "Toshiba 32L1350U 32-Inch 720p 60Hz LED HDTV", "Author": "Ernest C", "ReviewID": "R3MOWNIWTDIEQ4", "Overall": "5.0", "Content": "love it, 3 HDMI input, one USB, quality pictures, got it for $210, free shipping and no tax, come with tuner will recognize HD cable signals, PC audio input that's puls, I can use it as PC monitor also stereo and digital output are great to hock up with receiver. Toshiba in Asia is very sold elect's company, quality well last years of use the product.", "Date": "November 24, 2013"}, {"Title": "Great product", "Author": "Gary Eldridge", "ReviewID": "RYMG0CM5FBJ62", "Overall": "5.0", "Content": "Great picture and sound. Practically plug and play, I will definately buy again. The energy efficient use is a bonus.", "Date": "November 22, 2013"}, {"Title": "Great TV, pretty low price!", "Author": "Hodo", "ReviewID": "R2KAEYM3KA4DA5", "Overall": "5.0", "Content": "The TV is great--Amazon's LOW-PRICE GUARANTEE is difficult to understand and complicated to make a claim with.  The picture takes a little time to properly tweak to your personal liking for each input, but it is well worth the time.  It has lots of inputs and a bright vibrant picture with plenty of ways to maximize viewing older equipment with very good quality.  The viewing angles are amazing compared to HDTVs of just a couple of years ago.  The technology has come a long way--even for a 'budget set' like this one.  Don't be put off by the negative reviews that compare this with sets two or three times the price--this TV has a better picture than almost anything you could have bought a few years ago.  This TV can be gotten at a very good price many places and Amazon may be difficult to work with if you make a price match claim.  I highly recommend you buy this TV if you don't need all the bells and whistles of a 'Smart TV' but make sure Amazon really has the best price because getting them to price match after the sale may take a lot of time and effort!", "Date": "November 15, 2013"}, {"Title": "Great TV for the price", "Author": "norm morrison", "ReviewID": "R1N08XIN3GN20W", "Overall": "5.0", "Content": "this I wonderful tv!! It has great sound as well as a great picture. Has plenty of inputs and jacks. easy to hook up dvd player. I definitely would recommend this tv for the price!!! I love this tv!!!", "Date": "November 15, 2013"}, {"Title": "Great little TV!", "Author": "Ann Marie Erickson", "ReviewID": "R3D0207EHDKX49", "Overall": "5.0", "Content": "Great TV - LOVE Toshiba. It is the second Toshiba set purchased for my new home. Easy to operate and great little TV. Coun't be happier!", "Date": "November 14, 2013"}, {"Title": "Very pleased with the product", "Author": "Lisa H. Richards", "ReviewID": "R3INIWNV4STZGX", "Overall": "5.0", "Content": "Arrived before anticipated arrival date and easy to install.  This is the second Toshiba that we have bought and we are pleased with both.", "Date": "November 13, 2013"}, {"Title": "A home run for Toshiba!", "Author": "M. D. Oakley Jr. \"Wickedteercroquet\"", "ReviewID": "R31KNMIPG2R8Q8", "Overall": "5.0", "Content": "The perfect size for the application, superior stereo sound, easy attachment to available cable service, terrific color with adjustment capability.", "Date": "November 13, 2013"}, {"Title": "Working well.", "Author": "An ordinary consumer", "ReviewID": "R36FITM041EGXY", "Overall": "5.0", "Content": "Was sold and shipped by Amazon. Received as expected. The delivering company (Pilot) has scheduled time for delivery. They brought it in, unpacked, assembled and connected to the outlet. Since it was for a retired person, he was glad to see it working. Of course, it still needed adjustments in terms of settings and I also had to disassemble and re-assemble for him because the post still had blue plastic on it, but it was not a big deal.Please note, if you have children, make an effort to secure this TV either on the wall, or at least with a metal cable that must be put through a special loop on the back of the TV. The TV itself is resting on just one post and is not very stable (like the most of the big TVs) for an environment with children.We've connected an HTPC to it via a BlueRigger High Speed HDMI to DVI Adapter Cable (6.6 Feet/ 2 Meters) and so far so good. Also connected a DVD player via Component connection. So far everything is working.We'll see if it will be a long-lasting product or not, but as of today it is worth its price.", "Date": "November 9, 2013"}, {"Title": "Purchased for my daughter...", "Author": "Robin Selesky", "ReviewID": "R153UMKH58VIPK", "Overall": "5.0", "Content": "Great picture at a reasonable price....was actually expecting it to be much worse quality considering what I have paid in the past.  Not bad for a second bedroom or for your child", "Date": "November 8, 2013"}, {"Title": "Great TV for the money.", "Author": "James Reece", "ReviewID": "R17KYVOCVIILXI", "Overall": "4.0", "Content": "Very good quality picture and has the hook ups I need.  The base is a little shaky.  I am satisfied with the unit.", "Date": "November 4, 2013"}, {"Title": "Good buy", "Author": "Ashley W", "ReviewID": "R2DQX3869JUQY0", "Overall": "4.0", "Content": "The picture is good. Good sound quality. Has a reliable stand and was easy to set up. It has no motion blur and was an overall good buy.", "Date": "November 2, 2013"}, {"Title": "A gift that was enjoyed.", "Author": "J. Jones", "ReviewID": "R1MFKML7D0MU80", "Overall": "5.0", "Content": "Gift for my Grandmothers bedroom.  I have not seen it but she loves it says it has a beautiful picture.", "Date": "November 2, 2013"}, {"Title": "Easy Set-Up, Met Expectations", "Author": "Joseph H.", "ReviewID": "R1BA5NLNMC7J5Y", "Overall": "4.0", "Content": "I'd give it a 5 star but can't seem to get the whole picture to work on Wide screen.  Perhaps it is user error but I'd thought the manual could be more helpful.", "Date": "October 31, 2013"}, {"Title": "Awesome", "Author": "james cole", "ReviewID": "R26J9UGNMXI8DZ", "Overall": "5.0", "Content": "The television is awesome. The size of it combined with the price makes it an amazing buy. Thank you very much.", "Date": "October 28, 2013"}, {"Title": "Toshiba Tv", "Author": "Amazon Customer", "ReviewID": "R3O1WZOS7GSOW7", "Overall": "3.0", "Content": "I Like Toshiba. Ive Had Others With Good Luck. If Your Used To 1080p Like I Am  Dont Go Back To 720 P Tv You Won't Be Satisfied.Picture Just Isnt As Sharp. But Thats On Me Not Tv.", "Date": "October 22, 2013"}, {"Title": "great tv for a great price", "Author": "Phillip V.", "ReviewID": "RJ92HP852X2XV", "Overall": "5.0", "Content": "The picture quality is great! The sound is good. And it has a nice design to it. And its a good size for a good price, I recommend it to everyone.", "Date": "October 20, 2013"}, {"Title": "Excellent", "Author": "Amazon Customer \"HPS\"", "ReviewID": "RPFX1WDW737NQ", "Overall": "5.0", "Content": "Great size, clarity for an office or bedroom TV.  Was relatively easy to put together (on the stand) and was very easy to connect to HDMI, satellite/cable.  I'm not handy person so that's saying something!", "Date": "October 15, 2013"}, {"Title": "Great TV at a Good Price", "Author": "Sharron", "ReviewID": "RAWGD39R3JTOR", "Overall": "5.0", "Content": "This tv was purchased for my elderly mother who wanted to upgrade from a small, box tv. She was excited to get a large flatscreen tv that she could see more clearly at a great price. She didn't need all the bells and whistles of the more expensive sets so this is perfect for her.", "Date": "October 11, 2013"}, {"Title": "Beautiful TV and great price", "Author": "Marte \"InfMom\"", "ReviewID": "R2AZWZUD1GTQFH", "Overall": "5.0", "Content": "Extremely easy to hook up, crystal clear picture, and even the built-in speakers sound good. Comparing it to the crummy old CRT it replaced is like night and day.  :)", "Date": "October 5, 2013"}, {"Title": "nice unit", "Author": "TOM CURRIN", "ReviewID": "R375EUTPPULPR8", "Overall": "4.0", "Content": "nice unit--like it real well--32\" is just to small-but that was my mistake-should have at least gotten a 40 \"", "Date": "October 2, 2013"}, {"Title": "A great selection for any family.", "Author": "Jerry Straughan", "ReviewID": "RXH5XIKLTV6ZY", "Overall": "5.0", "Content": "It came to our door on time, we unpacked the TV, we plugged it in, made the required clicker program with the instruction's with ease, turned it on, and then watched a movie in beautiful color on cable.  Now, who will ask for more?  Great for watching what one wants!! --- Thanks Toshiba and Amazon ---------- jerry straughan", "Date": "October 2, 2013"}, {"Title": "Nice TV", "Author": "Amazon Customer", "ReviewID": "R2S5IKVRFE1X3F", "Overall": "5.0", "Content": "Excellent picture and sound quality.  Works great with older A/V devices.  Have not tried all the features yet.  So far everything is working great!", "Date": "September 29, 2013"}, {"Title": "Great TV or Dual Monitor", "Author": "Ian", "ReviewID": "R3IX9NDHH4W1JK", "Overall": "5.0", "Content": "High Quality, I had a toshiba 32 inch tv for 5 years and passed it on to my dad. Fits great on my dorm desk. I use it for netflix and a dual monitor for my mac. Has worked flawlessly so far.", "Date": "September 25, 2013"}, {"Title": "Very good for the money", "Author": "Tony Perkin", "ReviewID": "R1OYS12LFWLSR4", "Overall": "4.0", "Content": "I bought this for motorhome that has been remodeled, good tv with some excellent menu driven features, only 720p but it still looks good in HD, there is a small pause between channel changing", "Date": "September 14, 2013"}, {"Title": "Great", "Author": "Kiwi", "ReviewID": "R1QYNW72SE6O99", "Overall": "5.0", "Content": "Exactly what I needed. I have it in my dorm, it's perfect size and I can easily hook my laptop up to it with an Hdmi cord when I want to watch a movie", "Date": "September 12, 2013"}, {"Title": "Nearly perfect TV", "Author": "Bella Luna", "ReviewID": "R19XRQHYSXUVJK", "Overall": "5.0", "Content": "I'm very pleased with this Toshiba TV. The 20L1350U was easy to set up; It's relatively light weight. Though I have  severe arthritis, I was able to unpack it and put the screen and its stand together by myself. Setting up the channels was a breeze. The remote's buttons are a decent size and it's functions were very easy to figure out. It does not come with a manual; you have to go the Toshiba's web site. I downloaded the pdf file and printed it,but truthful, I had very little reason to consult it. I had some difficulty with the connection to a  old JVC vcr/dvd player. It would not play. I had fooled around with the TV's settings and just by RESETTING to the default settings, it now plays the videos. I have not yet been able to RECORD on it but I just have not taken the time to figure out what I'm doing wrong. My vcr/dvd combo does not have a HDMI port (which I believe it the best connection ); so I used the red, green, white cables to connect it. PLEASE NOTE; HDMI cables and red,green,white cables do Not come with this set. I bought them separately. Also be aware of Amazon's TV Price Guarantee ; if you buy through Amazon and later find the same TV at a cheaper price, Amazon will make up the difference . I had the Tv less than 2 weeks and I'm very happy. The picture /color is perfect, sound is great. I'll have more to write after I have had it for a while.", "Date": "September 10, 2013"}, {"Title": "Wonderful set for the bedroom", "Author": "Kindle Customer", "ReviewID": "R1Z7JWCTAMYNAI", "Overall": "5.0", "Content": "Bought it for our bedroom. Took a very short time to hook it up. So far I am very please. Fast shipping too!", "Date": "September 9, 2013"}, {"Title": "Great TV..", "Author": "M.Jones", "ReviewID": "R289CV6TUZJORJ", "Overall": "5.0", "Content": "Great tv.. perfect for a spare bedroom.. color n quality great excellent for the price.. I totally would recommend this product..", "Date": "September 7, 2013"}, {"Title": "Screen was COMPLETELY busted", "Author": "Danielle", "ReviewID": "RJW1Y399H789E", "Overall": "2.0", "Content": "Ship a tv in its original box with no other protection and it arrives destroyed……DUH!  Returned it and never re ordered.  Customer service was very nice to deal with though.  I sent them pictures of the severe damage and they had fed ex pick it back up. All of this could have been prevented though, had they just taken the time to put the original box in another, with peanuts or other packing material.", "Date": "September 1, 2013"}, {"Title": "Very good for the money", "Author": "ak", "ReviewID": "R2L1S0J8YLY34A", "Overall": "5.0", "Content": "Excellent speakers for a tv this size, very nice picture and light weight so its easily portable. Best tv for the priceline.", "Date": "August 19, 2013"}, {"Title": "Very good picture!", "Author": "debra", "ReviewID": "R14QRS421TFRX6", "Overall": "5.0", "Content": "It arrived very quickly and was very easy to set up no problem noted at this time. The picture is good bought two of them one for a bedroom and a sunroom.", "Date": "August 15, 2013"}, {"Title": "Just what they said it would be!", "Author": "DEBORAH GREENBURG", "ReviewID": "R3SOWFKS2DIAL8", "Overall": "5.0", "Content": "I am very happy with the product.It fits just right in the spot it was intended for!It looks great!!!", "Date": "August 13, 2013"}, {"Title": "Very Good", "Author": "Takeshi Arai", "ReviewID": "R2USD0UT84Q4K9", "Overall": "5.0", "Content": "This TV is very good for me. And the display of this TV is clear and sharp. So, cost perfomance is good.", "Date": "August 12, 2013"}, {"Title": "toshiba", "Author": "cms st paul", "ReviewID": "R1V37Y8KC5A7WM", "Overall": "5.0", "Content": "the TV is great, our last TV was the last of the tube models, very heavy. This one was easier to bring into the house, easy to set up, and it has a great picture.", "Date": "July 18, 2013"}, {"Title": "Fantastic monitor, well worth the price!", "Author": "Andrew Simmons", "ReviewID": "R1PZL2BXJ611MB", "Overall": "5.0", "Content": "I bought this monitor to run training videos for my Empower Network business, and couldn't be more pleased with the sharpness or clarity of it. It arrived over night, on a Saturday; installed flawlessly; and worked right out of the box. Easy to use, great value. Will likely buy a few more of them as the business grows.", "Date": "July 14, 2013"}, {"Title": "First impression is good", "Author": "Mícheál É. Ó Máille", "ReviewID": "R2A93O7WUWQOVI", "Overall": "5.0", "Content": "I bought this for the occasional use in my travel camper, so 1080p wasn't an issue as was getting HD with 120Hz refresh rate which this has. I hooked up my BD to it and the picture was very good. I also used its speakers and they were good.I can't comment about TV reception as there is none where I have my camper. I brought it home as I figure I should use it during the warranty period and will hook it up to antenna and then edit my review only if the picture for OTA TV is not as good as it is with the BD player.", "Date": "July 13, 2013"}, {"Title": "Toshiba", "Author": "Gertrude Muro", "ReviewID": "R3R6D6NCX79K3P", "Overall": "5.0", "Content": "This television is easy to install and to handle.  Besides, it is not necessary to read the instructions since the TV set is operated as most TVs are.", "Date": "June 30, 2013"}, {"Title": "FALSE ADVERTISING", "Author": "Randal Steffens", "ReviewID": "R1AP26A6NL5TST", "Overall": "1.0", "Content": "When I purchased this TV on September 7, 2013, the listing on Amazon said this TV was 120 Hz. I thought hey good deal, now that I am back to purchase a 2nd one obviously that claim was false. This TV is now it is listed as 60 Hz. I fault the TV industry for coming up with new terms to push lesser quality panels, and Amazon for the incorrect information that was put in the original listing note that incorrect information is still in the listing as I type this. The accuracy of information in product listings and materials needs to be accurate, as how can buyers make informed decisions with incorrect information. Let me be clear the TV does its job its just not a 120 Hz panel as it is claimed to be", "Date": "November 15, 2013"}, {"Title": "Great Deal Amazing Price!!!", "Author": "Amazon Customer", "ReviewID": "R3BI7LHEVC0S8J", "Overall": "4.0", "Content": "So I had earned some free gift cards at work and was considering getting a new TV for a while now. Mostly cause I got a Blue Ray player for my birthday and was anxious to be able to watch Netflix in my room. So here I go and I used my gift card, the first TV I wanted was too expensive and I saw this one and went what the heck. I LOVE THIS TV!!!! I have two mute levels, multiple screen options for viewing, the sleep feature is great, the volume is awesome. It was totally easy to set up and came faster then expected and was in perfect condition. It's sleek and pretty and the remote's buttons are big and easy to see even when it's pretty dark. I would totally recommend this TV to anyone who asked me.", "Date": "August 12, 2013"}, {"Title": "50L1350U 50\"  I love this TV!", "Author": "Kosoku \"kikboxr1\"", "ReviewID": "R2XWQXMLL02U3G", "Overall": "5.0", "Content": "I found this TV at a local brick & mortar store as an open box item.  They had new versions up on the wall where I could check the picture - for the current price of $600 I don't know of any TV on the market that can beat it.  The picture is fantastic.  Very uniform color and backlighting.", "Date": "July 17, 2013"}, {"Title": "My new Toshiba", "Author": "Linda J Conklin", "ReviewID": "R1NI43FQIC456M", "Overall": "5.0", "Content": "I received this tv before I expected. That was nice. The tv was everything I expected it to be based on product description. I wall mounted it very easily, hooked up the cable, and voila'...it was perfect. I didn't need to make any adjustments. I was concerned about sound (my last Toshiba tv had terrible sound) but this has really great audio. A thumbs up on all counts!", "Date": "June 27, 2013"}, {"Title": "All reviews are subjective", "Author": "xtobot", "ReviewID": "R1BME1IB98XCVB", "Overall": "1.0", "Content": "So after reading the reviews on here, this TV sounded like a great budget Panel - no frills. Simple and easy?When I set it up, I noticed the color and depth were underwhelming. It could not be calibrated to anything more then saturated over-toned color. It is not fixable with a proper calibration (which I did)The backlighting will wash out everything at any viewing angle. Not something you will see on display at any retail location, but in the subtle lighting of a home theatre or living room - it sucks out loud.The image is grainy. On images that have no business being grainy, that is all you see. For the price, you get what you pay for:The VGA resolution is severely limited.There are no dedicated Input buttons, just a scrolling menu.When playing media, it will always jump to no signal and display the input label for 10 seconds whenever stopping or starting anything.The enhanced imaging features will create MPEG like artifacts on the most pristine HD content. No other TV I have owned has ever created such garbage from such content.I was very pumped to get this TV, and every step of the way it was truly disappointing.Needless to say, I have returned it and spent $250 more on a Sony Bravia loaded with smart features I don't need - and the panel is BEYOND superior.I was shocked to see what praise it has received in any review I have read, and I am confused as to what people are referencing when looking at this, because it is not good at any price.", "Date": "June 20, 2013"}, {"Title": "Picture is great!", "Author": "Suicune", "ReviewID": "R2YN8GUJN0J0YU", "Overall": "5.0", "Content": "I just got my tv yesterday and set everything up. I put in my very first Blu-ray and was blown away by how great the picture was! It was perfect without needing any adjustments. If I had to give it a downside, I would say the lack of HDMI ports but that just means I can't be lazy with my consoles but not a big deal since I won't be switching them around too often.", "Date": "December 27, 2013"}, {"Title": "I would buy another one if I needed two.", "Author": "Timothy Palmer", "ReviewID": "R1QPQU74TQP7SG", "Overall": "4.0", "Content": "I got mine a couple months ago. I got lucky and best buy had it on sale. I paid 179.99. Great buy now seeing it for more. Picture is good. Does alot of different things. I would definately recommend it to anyone.", "Date": "December 2, 2013"}, {"Title": "Fear not", "Author": "Mixman", "ReviewID": "R33CI8EOK0I7U2", "Overall": "5.0", "Content": "Plugged in and looked good. Enough volume to hear and acceptable tone. If you want to get techie, there's plenty of adjustments under the hood.", "Date": "November 30, 2013"}, {"Title": "Unable to use VCR", "Author": "Lloyd E. Pyles,Jr.", "ReviewID": "RFDW6TIO09EWY", "Overall": "4.0", "Content": "Having difficulty programing for VCR use. Owners manual not provide and the online information is too lengthy to print and it is difficult to sort through it for information.", "Date": "November 14, 2013"}, {"Title": "It is perfect!", "Author": "Margaret A. Miller", "ReviewID": "R1JJFI7PTOAG5V", "Overall": "5.0", "Content": "It is just the right size to fit a niche in the kitchen...and it is a perfect picture too! Could not be happier with it!", "Date": "August 22, 2013"}, {"Title": "Toshiba The Name says it all", "Author": "Samuel G. Fowler", "ReviewID": "R1JH9C9ESV7MYK", "Overall": "5.0", "Content": "I wish I could find fault with it I feel guilty not buying an American product, but every Toshibaproduct I have bought works well it integrated well with my Toshiba DVD player & my Toshiba laptop", "Date": "August 12, 2013"}, {"Title": "Color not as sharp as I expected", "Author": "Janice C. Carlson \"casino queen\"", "ReviewID": "R24Y33OH4YPWOV", "Overall": "3.0", "Content": "I have a smaller Toshiba TV and the color is vibrant, closeups are awesome. This one doesn't have the same sharp color. Have tried tweaking it a bit. Finally went back to factory settings and it is ok, but could be better.", "Date": "August 3, 2013"}, {"Title": "Excellent product espedially for the price.", "Author": "John Roberts", "ReviewID": "R37F9S9ECFAHNQ", "Overall": "5.0", "Content": "This TV has a clear crisp display with good natural colors.  Relatively light and easy to handle in the setup.  Quick and easy setup", "Date": "July 15, 2013"}, {"Title": "Very happy", "Author": "clbrown", "ReviewID": "R1ES6W8205X0KC", "Overall": "5.0", "Content": "Purchased this for our daughter.  Great price for the size.  Researched Samsung vs Toshiba............and we made the perfect choice.The item was ordered on a Sunday and was shipped out the next day.........Very satisfied", "Date": "July 6, 2013"}, {"Title": "Excellent small but beautiful and outstanding HDTV and 1080p.", "Author": "Edward", "ReviewID": "R4JBYK1X30UDE", "Overall": "5.0", "Content": "This HDTV is great!!! from TOSHIBA. My first Toshiba HDTV. I love it, it is on all day. Very power efficient, only 20 Watts. If you need a small HDTV, this is the one. Go ahead and buy, you will be very happy. Plus, from Amazon, you get the great customer service and fast delivery.", "Date": "June 22, 2013"}, {"Title": "False Advertisement", "Author": "MP Veteran", "ReviewID": "R3VOL2V25N7E97", "Overall": "1.0", "Content": "It is advertised as ClearScan 120hz. It is only 60hz at 720p and 480p. The ClearScan 120hz is only available at 480i... and even then it doesn't work. The entire 1350U and 6200U TV's are only 60hz unless taken off HD mode.... DO NOT BUY unless you want to be ripped off.", "Date": "July 6, 2013"}, {"Title": "Video went out way too early", "Author": "Joe rak", "ReviewID": "R2UYD47DD6PWLB", "Overall": "1.0", "Content": "wrong, just to find hundreds of people with the same issue.  You may be one of the ones that keep your video, but if you like a \"robust\" TV that will last more than 5 years, you might want to check elsewhere.", "Date": "December 30, 2013"}, {"Title": "Almost perfect", "Author": "Reese", "ReviewID": "R2G0G7Z04WBGBQ", "Overall": "4.0", "Content": "I would have given it four & a half stars. It's great except for a few neurotically niggling issues I have.For one, I have to press the power button on the remote more than once for it to turn on.Now, I realize that doesn't reeally seem like that big of a deal. But for me, at times it can be exceedingly irritating.& sometimes when I can't sleep I like to only hear the sound of the t.v. but have the screen almost black with tcm on.With my old dinosaur I could achieve this, with this guy I can have the back light & everything else be at zero & it's still quite bright.A more sane issue I have with it is the speakers. They rattle with bassy sounds when the device volume is pretty low.I did purchase external speakers- I bought this thing with the intent of getting external speakers any way since it had that capability. But I have to turn the volume on the t.v. off, get up, turn on the speakers & manually adjust accordingly.Which, in this time of the \"I want it now\" instant gratification attitude, it can be pretty obnoxious. But typing it now, I'm annoyedwith myself for complaining about it soo yeah. hahaPicture is great, but I'm not really all that picky. Evidently, since I went with a 720 instead of a 1080.1080 is just too clear for my taste. Everyone looks like crap. I end up focusing on how much make up theyhave caked on their faces & it's all just too distracting.It's very pretty. Compared to my super old one it's quite fancy, & large. People tried to get me to buy a bigger one claiming thissize wouldn't be big enough, but I feel size-wise, it gets the job done. I have a big enough screen to where it's not too small,but it's not excessively large where I feel like a douche bag just for owning it either.Anyway, I'm ranting. It's a nice set, very nice. I'm glad I did my research & went with this one instead of the samsung thathad like no inputs or outputs to do cool stuff with. Like plug my macbook into. That's pretty awesome in itself.", "Date": "December 12, 2013"}, {"Title": "Perfect!", "Author": "Dude Who Tries Everthing", "ReviewID": "R11RT7AT61IZHM", "Overall": "5.0", "Content": "The Best T.V ive seen and when ups doesn't break it everthing works! ive had mine for a few months now and a pixle died but its no biggie.", "Date": "October 27, 2013"}, {"Title": "Great TV", "Author": "Alex", "ReviewID": "R1OPS08IHESY4E", "Overall": "5.0", "Content": "The color is crisp and the screen is large enough to enjoy football.  Easy to install, and I'm not a techie!", "Date": "August 25, 2013"}, {"Title": "great picture, arrived promptly.  Easy to use right out of box", "Author": "Amazon Customer", "ReviewID": "R2ZCXTP79FTGVC", "Overall": "4.0", "Content": "Only problem was I wanted to use my old DVD and although the connections were shown I had to go to internet and find user guide in order to use my connectors.  It was easy once I found it.  Not everyone has blu ray and html etc.  so would be nice if they would explain how to do the settings as well as the connections on the one page instructions.", "Date": "July 30, 2013"}, {"Title": "Absolutely Horrible Picture!!!", "Author": "SJJ", "ReviewID": "R7GCSSTTDO4QB", "Overall": "1.0", "Content": "This is my first HDTV that I decided to buy just to see what things are like. After reading some reviews, I decided on this trying this one due to how great I thought the Toshiba Laptop looked--a LED to see what the picture quality was like although I had always seen better reviews for plasma. Besides, if it wasn't so great, I could always place it in the guest bedroom where the distance isn't really that close and that's exactly where it will go as soon as I receive the updated plasma set.  The reviews said anything around a 50,000 contrast ratio was considered good but that hasn't proved to be true. Closeup, the picture look like it's raining with streaks all down the picture. The black level is like a jigsaw puzzle either closeup or at distance although it's a slight more tolerable at a distance not good but it blends a bit better. While watching football games, there is way too much ghosting and the players/action is always a blurry and out of focus, especially up close or from a side view...the best picture is straight on at a distance.  The picture size and mode options are nice but the picture will zoom in (to get rid of the black marks across the top and bottom of the screen) and part of the picture is off the screen so they don't work very well. It's was inexpensive (cheap) but definitely not worth the money. This was an eye opening experience and don't trust the reviews given because this one was highly rated but is really a horrible set. I do like the remote and their functions though. It was easy to setup, the frame looks rather nice, nice set of connectors on the backside so all isn't lost.", "Date": "October 18, 2013"}, {"Title": "Poor quality TV", "Author": "J S", "ReviewID": "R1RDLJX5EQSFT5", "Overall": "2.0", "Content": "I can't believe Toshiba makes such a poor quality product and that this TV has so many positive reviews. Picture was blurry when there was movement and you can only see clear outlines of peoples faces when they are in a close up. Picture vibrated at bottom of screen. Also  remote was cheap and flimsy with slow change time and only works if you are within in a few feet of tv directly in front of screen. I returned it.", "Date": "June 26, 2013"}, {"Title": "Great Picture Quality!", "Author": "Kimberly A.", "ReviewID": "R30MR6E1XKKC1M", "Overall": "5.0", "Content": "You have to love amazon!  I ordered this TV (from amazon) and received the TV with a shattered upper screen.  My heart sank.  I contacted amazon right away and they sent out a replacement TV close to immediately and sent UPS to pick the 1st damaged one up free of charge!  Needless to say when the second TV came (only 2 days later) I was very nervous.  WOW - what a nice TV for the price!  It has a great pictue and was very easy to set up.  So far I am loving it!  The only flaw I could find was the base that you put the TV on - when the TV is attached to the base with the little \"pole\" it is wobbly but seems to be fine.  I have no regrets about this purchase.", "Date": "May 15, 2013"}, {"Title": "Manufacturing Defect Caused Broken Screen  Toshiba 58l1350u", "Author": "AmazonLover \"ONLINE.BUYER\"", "ReviewID": "R8B6AQU2Z1WB4", "Overall": "1.0", "Content": "I was so excited when I ordered this.  Couldn't wait to get it.  When I unboxed it I found that the frame was not installed around the screen properly.  A tab that should have been in front of the glass was behind the glass, causing the screen to be bowed outward at that spot, which caused it to break there.  Apparently this is a very common problem, since Amazon has stopped shipping them due to high failure/damage rate.  I see another review stating their's was broken in the same place mine was, center top.  Very disappointing.Amazon was great, though.  They had it picked up next day at their expense and issued me a full refund.Still sad though.  I really wanted that tv.", "Date": "February 5, 2014"}, {"Title": "It is OK", "Author": "Shannon Thomas", "ReviewID": "R3FPC48Y2K3EI5", "Overall": "3.0", "Content": "The picture quality is good but the sound is terrible. I have to turn it all the way up to hear it in the kitchen which is open to the room it is in. Will probably have to buy a sound board.", "Date": "January 14, 2014"}, {"Title": "it was a great present", "Author": "Matthew P.", "ReviewID": "RGF3K76HKE0SS", "Overall": "5.0", "Content": "this is a mis represented tv it actually has 120 hz not 60, i bought this for my parents for christmas, great price, beautiful picture! amazing sound dad liked that the best he is getting older!!!!", "Date": "December 30, 2013"}, {"Title": "A good TV", "Author": "Mumble \"Peace\"", "ReviewID": "R2QLWD3Z8P3YGC", "Overall": "5.0", "Content": "I bought this as a Christmas gift for my son. He put it in his room. I suppose he is enjoying it very much! It was the right size, and shape for him. He hasn't complained about it yet so, I guess he is enjoying it! SO Far, SO Good!", "Date": "December 17, 2013"}, {"Title": "I recommended this product for me 100% positive, I loved this TV", "Author": "XAVIER MENDEZ", "ReviewID": "RGP5ECYJC7FDF", "Overall": "5.0", "Content": "Thanks for the product, the fast and efficient delivery equipment as described in the picture, this TV experience permiter me see the picture I want to take my case space, high-quality TV without Repentance. preferred.", "Date": "December 16, 2013"}, {"Title": "very well", "Author": "Yohen Mendoza", "ReviewID": "R3T82S5BUQP5VC", "Overall": "4.0", "Content": "Everything arrived as expected, without fail, a day as he said, good price, serious and responsible in all cases recommend!.", "Date": "November 25, 2013"}, {"Title": "Good Value for a great TV", "Author": "Lee", "ReviewID": "R1GNDR18IIWYVA", "Overall": "4.0", "Content": "Worked great right out of the box, very nice clear picture. This was a great deal for the price. The only reason for not being a 5 Star rating was the fact the TV does not swivel on the base.", "Date": "November 25, 2013"}, {"Title": "television", "Author": "laura soncrant", "ReviewID": "R15WLW1XIVU3WB", "Overall": "3.0", "Content": "the screen has a scratch on it and the volume is really bad has to be all the way up to hear.", "Date": "October 29, 2013"}, {"Title": "Great Picture quality, subpar sound, awful TV stand, TV leans to one side", "Author": "Lazlo7d7", "ReviewID": "R2UC0V7BAEW4JL", "Overall": "3.0", "Content": "The TV has excellent picture quality, the sound system is below average. TV stand that is supposed to hold the TV upright is really flimsy, the TV leans back and to the side. If you are hanging this tv on a wall then go ahead and buy this tv. If you dont plan on relying on the subpar sound system and hooking it up to and external sound system then its good buy. If you are planning on using the TV stand to hold the tv up, you will have to use books to prop the tv up so that it wont lean over.It surprising to me that they would put the effort into designing a tv and then drop the ball on something simple like a TV stand.", "Date": "October 26, 2013"}, {"Title": "Good", "Author": "Wreck", "ReviewID": "R189W1TF7TFZPR", "Overall": "4.0", "Content": "Works as advertised. Good price for lcd without any of the extras. There is no basic video input (yellow cable) for things such as WII. You will need hdmi or the red, blue, green connectors. I got one for my wii for $4.65 so no big deal.", "Date": "October 18, 2013"}, {"Title": "love it alot lol", "Author": "D. Anderson \"62 cent\"", "ReviewID": "R3TMNWC375ZZ9A", "Overall": "5.0", "Content": "I love the way l4d and l4d2 on my xbox360  look on the TV . I love the TV alot lol", "Date": "September 26, 2013"}, {"Title": "Toshiba.", "Author": "david n.", "ReviewID": "R2PYZNCJ5XZTYD", "Overall": "5.0", "Content": "I like this 23L135OU it has better picture than the 39L135OU that I had bought from walmart.com, Toshiba makes a good TV.", "Date": "September 10, 2013"}, {"Title": "Beautiful TV", "Author": "B. Knowles \"infidel1375\"", "ReviewID": "R1T2EEG8IUKO86", "Overall": "5.0", "Content": "I bought this TV for my room in Afghanistan.  The color is great, and the firmware responds well to my game systems.  I would recommend this TV to anyone looking for a nice-looking 32-in TV for under $300.", "Date": "September 6, 2013"}, {"Title": "GREAT PIC", "Author": "joshua d shaw", "ReviewID": "R2C9Y6NW22U9OH", "Overall": "5.0", "Content": "YES THE TV'S A LITTLE SMALL BUT FOR MY CAMPER I COULD'NT OF FOUND A BETTER TV. AWESOME PICTURE AND SOUND. WOULD RECOMMEND TO ANYONE FOR ANY WHERE.", "Date": "September 3, 2013"}, {"Title": "Toshiba Review", "Author": "Grant E. Schumacher \"grant614\"", "ReviewID": "R2SG2YD1AVV453", "Overall": "5.0", "Content": "For a 29 inch with moderate resolution, it knocks your socks off.  A very good value. Have no regrets. Ypu'll love it.", "Date": "September 3, 2013"}, {"Title": "my first HDTV", "Author": "David Lund", "ReviewID": "RSHZI8UPC0X2W", "Overall": "5.0", "Content": "for anyone else who is buying their first hdtv in this price range i can recommend this one.  a problem i noticed a lot of people having with TVs this size and this price was overheating but i use this one for about 1-5 hours a day in the summer and i have had no problems with this or anything else.", "Date": "August 20, 2013"}, {"Title": "Still great....", "Author": "Lela Knudson", "ReviewID": "R3NCT2XN7F28VT", "Overall": "5.0", "Content": "This replaces my \"old\" Toshiba TV (which was great too).  The pictureis clear, of course and the size fits my room perfectly.", "Date": "July 30, 2013"}, {"Title": "Great TV", "Author": "Nick Boomhower", "ReviewID": "R1DLZMAOXKAZJ6", "Overall": "5.0", "Content": "So far, been about a month of use and its great. I have it mounted on a wall and attached to my computer, splitting the screens and it works fantastically. I had no issues mounting with the Cheetah Mounts ALAMLB. Great picture once I toyed with the settings a little bit. I recommend this TV to anyone looking for a well priced 32' TV.", "Date": "July 28, 2013"}, {"Title": "Good Tv", "Author": "Jennifer S", "ReviewID": "R2Q1NS7GNAFYRH", "Overall": "5.0", "Content": "Bought this for my kids room. Works great. Takes some getting used to the size as it is not very large for a big room...", "Date": "July 27, 2013"}, {"Title": "Its just perfect", "Author": "Linda Todenhagen", "ReviewID": "R3D5SLT1TY9NBY", "Overall": "5.0", "Content": "I made sure the specs on the tv were what I needed and when it came it was just what I wanted.  It is easy to switch from game, to PC, to TV.  The picture is great I could not be happier.  I ordered on Sunday and had it on Friday", "Date": "July 26, 2013"}, {"Title": "Nice for price!", "Author": "Coooldad", "ReviewID": "RWSVGOE96LQHF", "Overall": "4.0", "Content": "Great features for the price. Quality picture and useful features for the price. Its design is sleek and of good quality.", "Date": "July 21, 2013"}, {"Title": "Awesome bang for buck", "Author": "AMCSATX", "ReviewID": "R30MREW6U0Z9LJ", "Overall": "5.0", "Content": "For ~$250 to $275 range you'll be hard pressed to find anything sleeker, and with a nicer picture than this jewel.I swear the picture is better than an $800 Samsung I bought last year !", "Date": "June 17, 2013"}, {"Title": "Poor tuner, remote, and mediocre picture", "Author": "Jeffrey", "ReviewID": "RMN7PMX863JTJ", "Overall": "3.0", "Content": "I purchased this 39\" TV to replace another TV which had I was having some issues with the color on the HDMI inputs (color seemed good otherwise). Thought from the reviews that this would be a better TV and thought since it's a Toshiba, it would be decent quality.Good things are that color representation is decent. Do like that it has the PC input.Things not so great is the PC input only seems to only allow 1366x768 maximum resolution although native resolution of the TV is 1920x1080.Brighter colors seem to get washed out when viewed at an angle.Using the built in tuner, the picture tends to look fuzzy and reminiscent of watching a CRT. Vizio TV (which it replaced) seemed to pull stations in much cleaner and present a sharp picture. I can't seem to do much of anything to improve the picture or reception on the Toshiba.I'm also baffled by the claim of 120hz 'clear picture'. Think I actually notice more blurring/ghosting on this TV than the Vizio.The remote is probably the worst that I've come across in a long time. If it's not pointed directly at the IR receiver on the TV, it doesn't seem to want to work.Lastly, the build quality seems a bit loose and the stand was crooked. Not sure the stand is supposed to swivel at all.I'd probably recommend the Vizio VIZIO E390-A1 39-inch 1080p 60Hz LED HDTV over the Toshiba, particularly if Vizio can eventually fix the HDMI green color emphasis.", "Date": "May 19, 2013"}, {"Title": "Toshiba 39\" LED TV", "Author": "Anthony J. Cozone", "ReviewID": "R1759DOEYA8X3", "Overall": "5.0", "Content": "Very pleased with the tv. Picture quality is excellent. Extremely Easy to use.Price was cheaper than anywhere else I looked.", "Date": "August 24, 2013"}, {"Title": "Useless for games", "Author": "Ceisiwr Serith", "ReviewID": "R3HKOQLG600UZZ", "Overall": "1.0", "Content": "I play DDR on a playstion 2, and Wii Fit on a Wii.  The lag is so bad I can't play either of them on this.  A lot of the reviews say good things about lag, but maybe they're playing games where timing isn't that important.  With games like I play, this TV has made my consoles useless.  Tech support was snarky when I called them, and didn't even ask me if I was using Game mode (I was), so I have to wonder how much they know.", "Date": "August 23, 2013"}, {"Title": "Great TV, horrible customer service from buyer.", "Author": "Christopher James", "ReviewID": "ROXCWDZJXM9D5", "Overall": "4.0", "Content": "The Tv is great, Toshiba is a great brand i've never had problems with their products. I wanted to upgrade once i got this tv and realized that \"THE FACTORY DEPOT\" has horrible return policies and return timelines. I suggest never buy from this company, try and buy from amazon itself.", "Date": "April 24, 2013"}, {"Title": "TV GREAT..STAND IS HORRIBLE", "Author": "bobbie mobley", "ReviewID": "R2YDGVI1PS268B", "Overall": "4.0", "Content": "SANYO 39\" TV 1-1/2 YEARS OLD...WENT OUT COMPLETELY..WENT TO  BEST BUY..BEST  VALUE WAS THE SANSUNG39\" L135OU..BROUGHT IT HOME..MY SON SET IT UP.BEAUTIFULPICTURE, QUALITY EXCELLENT..TURNED TO WALK OUT OF ROOM AND JUST THE BREEZE FROM WALKING BY..MADE THE TV WOBBLE LEFT AND RIGHT..IT LOOKS AS IF IT IS TAKINGOFF FROM A RUNWAY...IF I TIPTOE IN AND OUT OF THE ROOM, AND DONT THINK ABOUT DUSTING THE SCREEN, I THINK IT SHOULD BE OK...MAYBE TOSHIBA CAN REPLACE THE CURRENT DESIGNER FOR THE STAND..BASE NEEDS TO BE LONGER..PLASTIC IS NOT THAT EXPENSIVE..", "Date": "October 19, 2013"}, {"Title": "tv is ok not to bad.", "Author": "Marvin Magana \"M.M\"", "ReviewID": "R39T4IAQ1BU4FT", "Overall": "3.0", "Content": "This tv it's ok, beautyfull picture ,but is not it say,s on the manual .The only problem is the U.S.B port .Manual says enjoy music picture and video,but does not accept video att all.", "Date": "September 18, 2013"}, {"Title": "Excellent piece for my PS3 with HDMI", "Author": "MaShell1981", "ReviewID": "R2NW00B87F66P9", "Overall": "5.0", "Content": "Excellent television! The price and quality cannot be found elsewhere. Toshiba is a household name and this 29 inch television is perfect for my bedroom.Video Quality 4.5/5Sound Quality 4/5Delivery Speed 5/5Features and Options 5/5", "Date": "July 26, 2013"}, {"Title": "Good picture; Minor issues", "Author": "Debra E. Skiles", "ReviewID": "R1MGEN01HG3BXM", "Overall": "4.0", "Content": "This is a nice, very reasonably priced TV for our bedroom. The only issues we've had are that (a) need more volume levels between 0 & 1 when trying to not bother someone else sleeping in the room and (b) no headphone jack input (for our wireless headphones - only USB.", "Date": "July 24, 2013"}, {"Title": "Terrible Picture Quality", "Author": "xcpuer", "ReviewID": "R3D14BAN77WXYV", "Overall": "1.0", "Content": "Picture is all washed up, no contrast, just bright.  I will never buy a Toshiba again.  Amazon, to save your name, should not be selling this junk.", "Date": "October 15, 2013"}, {"Title": "Exactly what I needed, Great for gaming.", "Author": "Allen G", "ReviewID": "RD4CDC0XFF2NN", "Overall": "5.0", "Content": "This TV is truly amazing. Especially at a sub $200 price.My plans for this TV was primarily to be able to play the PS4 when it comes out. My current entertainment system (PC, 2 monitors, and a PS3 sharing one of the monitors and having to run an audio contraption to get sound) wont be able to support the PS4 and have audio so I finnaly bit the bullet and invested in a TV.After getting this TV, I dont know why I didnt just look for a bunch of 23\" HDTV's like this in the first place to use as monitors. Compared to my 1080p monitors, which are the same size of the TV, this TV has a far superior picture. The colors are much richer and everything is much crisper. I was shocked at the graphics from some PS3 games and how much better they looked. I CANNOT wait to see what PS4 games look like on this baby.Once I move back out for the fall semester, I plan to make this a 3rd monitor as well as it being shared with the PS3 and PS4 when it comes out, It has 3 HDMI inputs and I dont have/desire cable television so this TV was perfect for my setup plans. It does have the functionality to pickup local Digital/Anolog signals, but you are going to need to have an antennae to pick them up. I dont believe this TV comes with an internal antennae like my older 20\" \"EDTV.\" My older TV detected most of the local channels with no antennae and this one found 0. I am assuming it needs one to be plugged into it, which is no problem, can find a decent antennae cheap if you really want to watch the local news. But most people will have some sort of cable service.If you are looking for a new PC monitor, TV for gaming, TV for a side room, TV for a camper, or any other secondary TV, this one is perfect, especially when its on sale.", "Date": "June 25, 2013"}, {"Title": "Great bargain and fast delivery", "Author": "Paul Esterguard", "ReviewID": "RNM55ZM5ZVKLM", "Overall": "5.0", "Content": "This set was a perfect fit for the stand that had a 27\" older style HEAVY set. The only modification needed was to find a booster to bring the set up to perfect \"eye level\" when seated on our sectional sofa. The set was in perfect condition when recieved and assembly and set up were quite simple . The above description is in error as it is a 1080P set not 720P . It it hooked to our satellite system and delivers a splendid picture and very adequate sound for viewing most programming . This is not our primary movie viewing set  anyway--mostly news and sports . I had been shopping TVs for some time and at this price you can't go wrong.", "Date": "June 4, 2013"}, {"Title": "half and half", "Author": "Andy", "ReviewID": "R8HIET2X7P6DP", "Overall": "2.0", "Content": "We got the tv and the picture was great, but then the tv power went off and never came back.", "Date": "March 1, 2014"}, {"Title": "gr8 shopping", "Author": "Lynn Thompson", "ReviewID": "R2DPLNU3S79T6O", "Overall": "5.0", "Content": "Would recommend to anyone amazon is a great source of shopping wit gr8 prices!!! will definitely shop again in the near future!!!!", "Date": "December 26, 2013"}, {"Title": "It does not have a TV guide,", "Author": "tom abbott", "ReviewID": "R221ZV6CE9QD37", "Overall": "3.0", "Content": "It does not have a TV guide, only info for current program & the next one, slow channel changes, remote has to pointed directly at TV, but good pic,very good price for 39\" TV", "Date": "October 28, 2013"}, {"Title": "okay, except for volume", "Author": "charger350", "ReviewID": "R3EIKGD6B7VLHA", "Overall": "3.0", "Content": "volume has a glitch; purchased at a good price; samsung is a better tv  , if you don't mind paying more", "Date": "October 5, 2013"}, {"Title": "Don't get this for your PS3 or PC", "Author": "Back the Dog", "ReviewID": "R2YRDPNHZRW7CN", "Overall": "3.0", "Content": "I got this 23 inch version of the Toshiba 23L1350U LED HDTV for a computer/ps3 setup. When plugged in with the computer, there was a noticeable distortion in image quality. Mainly text appeared blurred, images were also a bit jagged. Adjusting cleartype text, changing video card/tv settings did not fix the problem. It was not a problem with the wires I was using. However, through research on google it seems that it is a common problem for TV's to display \"blurred\" computer text. (Search \" Blurred text on tv when using computer\").The built in sound is not terrible but not amazing either.I also used the tv for watching netflix/playing games on my PS3. Picture quality was ultra clear and was HD as far as I could tell. However, the TV had a problem with upscaling games. The thing is, most PS3 games are scaled in 720p (despite what the box says it can support). It's up to the TV's upscaler to scale it up to 1080p format. When I played \"The Last of Us\" on this HDTV, it looked terrible. Everything looked as if it was  being rendered in 480p. It was not a problem with my ps3 video settings or the distance I was sitting at from the TV. It genuinely looked terrible.I returned the item and bought an actual computer monitor of the same size. PS3 and PC both look sharper on that than this HDTV.", "Date": "September 1, 2013"}, {"Title": "Toshiba 23L1350U 23-Inch 1080p 60Hz LED HDTV", "Author": "jon", "ReviewID": "R1197ZARDIWV2B", "Overall": "5.0", "Content": "All good. As promised, well packed and timely delivery. I use it for my computer monitor. I have three Toshiba HDs and like them all,.", "Date": "August 19, 2013"}, {"Title": "Satisfying", "Author": "Eloise Middleton", "ReviewID": "R35KW2GLMKZ4IO", "Overall": "4.0", "Content": "I find the TV to be very satisfying. I especially enjoy watching tennis. lolok forward to watching college  women basketball. Thanks for asking.", "Date": "August 18, 2013"}, {"Title": "Good for the price.", "Author": "5150 Shopping", "ReviewID": "R29SYH57I37NPX", "Overall": "3.0", "Content": "I'm not a tech expert and won't even attempt to review they way some have. As for those of us who judge a product by how it looks when it is plugged in and turned on.....picture is good for the money and sound quality is about the same. It is not our primary tv and used in our bedroom. I would not recommend for primary tv but it is fine to watch to put you to sleep and the price was right.", "Date": "August 9, 2013"}, {"Title": "Decent TV", "Author": "Zweig", "ReviewID": "R8IUBSEW746K6", "Overall": "4.0", "Content": "I use it for TV and extra monitor for my mac.The color is pretty good.One thing I like about it is that there are a few ports on the left side of the TV so that it was easy for me to hook it up with my mac.The only thing I don't like is that the sound output from HDMI is not as good.", "Date": "July 14, 2013"}, {"Title": "Very good TV, good value", "Author": "janet cutler", "ReviewID": "R250ASNO5IRWT5", "Overall": "5.0", "Content": "I am very pleased with my tv.  The picture and color are very good.  The sound is very average.  I had a sound system before and am considering getting a new more compact one.  I didn't realize what a difference it made.It was very easy to set up and the delivery was terrific.  A good experience all around.  I would buy from Amazon and Paul's Tv again.", "Date": "June 27, 2013"}, {"Title": "Great Picture and Good Sound", "Author": "Edwin", "ReviewID": "R3618FAXO680GK", "Overall": "5.0", "Content": "I needed a small Tv, and was pleasantly surprised by this 23\" Toshiba. Great picture and good sound accompanied by lots of input / output options - including 3 HDMI ports, Digital Audio Out, Digital Audio In, PC Audio In, Component video and PC in. Setup and programming was easy, though I did have to consult the online users-guide to answer a few questions.", "Date": "April 29, 2013"}, {"Title": "Definitely not a Best Buy", "Author": "M. Zablocki", "ReviewID": "R1LKB95EPVNUME", "Overall": "1.0", "Content": "Bought this Best Buy \"deal of the week\" for $299.00. I couldn't believe my luck for a 1080, 120hz HD TV. After setting it up, it was obvious why the price was so low. The picture was fuzzy on all channels and our Wii system and DVD player was nearly impossible to view due to all of the lines. Tried everything including HD cables and video component cables. Called Toshiba customer support and was on hold for 45 minutes before the phone died. Also the BB \"experts\" were not very helpful with advice.It's likely that we just received a bum TV, so it may not be indicative of how a non-defective Toshiba would perform. However it did seem cheaply made and customer support was poor. It nearly toppled from the flimsy plastic stand numerous times while setting it up. Took it back and got a Samsung 39.\" Within minutes we had a perfect picture and it seems more solid overall.", "Date": "January 6, 2014"}, {"Title": "Where is the volume?", "Author": "Webster", "ReviewID": "RD53E8NDLFH7X", "Overall": "3.0", "Content": "The picture is good but the  max volume is very low. My 19\" Samsung LED had a sharper picture though obviously smaller.", "Date": "August 5, 2013"}, {"Title": "Good TV; Cheap company", "Author": "gwb1943", "ReviewID": "R2ST74CT9Z08VQ", "Overall": "3.0", "Content": "Everything as far as the television goes, is good to great. My problem with it is that Toshiba, in its corner cutting stupidity, does not include an Owner's Manual with the TV. I had to go online and download and print out one, all 123 pages of it!!! Toshiba does include a \"quick start\" guide that will let you set the TV up and get started but that's about all it does. When you look at the guide and try to find out what each button on the remote does, all the guide does is tell you what each key is. In order to find out how to use each key and what it controls, they refer you to the NOT INCLUDED, \"Owner's manual\". If you don't have the capability to access their website and download one, you're screwed. Basically: no computer + no guide = boat anchor for a TV. 'nuff said!!", "Date": "September 5, 2013"}, {"Title": "Dead On Arrival", "Author": "rlc0618", "ReviewID": "R2Q17C247WVU4G", "Overall": "1.0", "Content": "This TV might have the most amazing picture quality ever.  I'll never know because mine won't turn on.  My TV arrived today (Amazon is terrific as always!) and I excitedly opened the package and put together the stand.  The TV looks sharp, the bezel is very thin which I like.  The stand seems sturdy enough.  I connected it to my PS3, plugged it in, hit the power button and the word TOSHIBA briefly flashed across my screen.  Then... nothing.  The power indicator went dark as did the TV.  I've tried everything and nothing will bring it back to life.  The TV is dead, dead, dead.What a disappointment.", "Date": "August 30, 2013"}, {"Title": "Great TV!", "Author": "Richard J Blair", "ReviewID": "R3MEELIJAHCJCK", "Overall": "5.0", "Content": "I looked at this TV at Sears and Ra-Lin's in Syracuse.  Even though I was told that Toshiba doesn\"t  make its products as well asit used to(when looking at Blu-ray DVD players), I went for it and was not disappointed. Only have it one month with no problems.", "Date": "May 26, 2013"}, {"Title": "the TV is excellent", "Author": "Roger Principe", "ReviewID": "R3KDSUQ7F6ZENT", "Overall": "5.0", "Content": "high quality image, sound acceptable for a tv, and is lightweight .... recommend for purchase is a good gift and it was a great pressures, and until now doing very well", "Date": "January 1, 2014"}, {"Title": "BUYER BEWARE!!!", "Author": "Ricky D. Gordon \"Attorney at Law\"", "ReviewID": "R3NPXMFPUFOZ3C", "Overall": "1.0", "Content": "I purchased a NEW 58\" Toshiba LED TV from Paul's TV through Amazon.  I have always had great experiences purchasing through Amazon.  Last year I purchased a 73\" TV and sound system from Paul's TV and the experience was extraordinary.  With the marriage of these positive experiences, I proceeded to make this recent purchase.  I ordered the TV on November 21, 2013 for delivery between November 27, 2013 and December 3, 2013.  Delivery was early on November 26, 2013.  Unfortunately, I was out of town for the Thanksgiving holiday when delivery was made at my office.  When I returned, I noted that the bottom of the box was in pretty beat-up shape and the inside styrofoam packaging was broken apart.  I actually had to tape the bottom to keep the TV from falling out.  On December 7, 2013, my audio/visual technician unpacked the TV and informed me that it was apparent that the TV had been repackaged.  That concerned me since my purchase was for a \"NEW\" TV.  In any event, he installed the wall mounting bracket and TV.  When the TV was turned on, we noticed a defect in the picture, an internal smear mark across the resolution of the picture.  I immediately called Paul's TV and was not impressed with the customer service representative although he did follow-through and I received a call back within 48 hours to arrange for a replacement.  I had to incur the expense of removing the TV from the mount and then having it remounted ($90 each service call = $180).  Paul's TV refused to reimburse this amount.  I even offered to take it in Paul's TV credits and they refused.  I even offered to split the cost with them and they refused.  Considering that they represented that the TV was NEW, it evidently was not.  I did not get what I bargained for and the added cost of $180 for their false representation made this a bad deal.  I could have gotten this TV locally and even with the sales tax, it would have still been a savings.  Needless to say, I was disappointed at Paul's TV's lack of good will for advertising a NEW TV and shipping me a repackaged TV.  The replacement TV arrived on December 18, 2013 (27 days after my original purchase) and it works great so I recommend the TV but not the Seller.  Buyers beware.  Although my first experience with Paul's TV was positive and brought me back for another purchase.  After this recent purchase, I will never buy or recommend Paul's TV ever again.", "Date": "December 26, 2013"}, {"Title": "Bought 39 inch, Failed to work with my Wii U", "Author": "neonatal1", "ReviewID": "R21G575M94EWMU", "Overall": "1.0", "Content": "Can not play my Wii U on this tv , May be due to refresh Frequency issue. Wii picture goes ghost .", "Date": "August 10, 2013"}, {"Title": "DO NOT BUY FROM AMAZON!", "Author": "Nuts", "ReviewID": "R3DVOMP8K7JHEW", "Overall": "1.0", "Content": "First the TV does not work that great. You try and change channels and it takes 30 seconds to change. Sometime the Audio does not work when you change channels. The worst part about this TV is that I received it with a broken screen. So I contacted Amazon and they sent me replacement. The shipping took extra long for the replacement.AFTER they sent me the replacement, the company JB HUNT took the broken TV back. After 30 days I got a notice from Amazon saying that they did not receive the TV back and they were going to charge my credit card again. I followed AMAZON's instructions and they are wanting to charge me AGAIN. I will never buy a TV from AMAZON again!!!!! I would not suggest anyone to buy one from them! To much work for a TV that came broken from AMAZON.", "Date": "December 2, 2013"}, {"Title": "terrible customer service", "Author": "K. Sheehan", "ReviewID": "R1UV54KQOLMIPY", "Overall": "1.0", "Content": "I have owned this TV for less than 2 months.  I have never been happy with the picture, but 2 days ago, the sound would not work through the HDMI hooked up to an AV receiver.  I know it's the TV because the old TV still works with the same setup.  I called customer support and they had me reset the TV and the Satellite.  They claim it's the signal from the satellite not the TV.  I know this is not the case because the other TV works and I also receive no sound from my Roku or the DVD player.  When I told them I was sure it was the TV, the service rep. got huffy with me.  I told him I wanted to speak to a supervisor and he got even more indignant and would not connect me.  I have been unable to find an email address on the website to complain.I have called a local autorized dealer and will take the TV to him for repair.  I know things can go wrong, I just want the Tv repaired without hassle.  But that is not the case.", "Date": "July 22, 2013"}, {"Title": "Stop working in less than a month.", "Author": "Jonathan", "ReviewID": "R168QYKUGLJWUY", "Overall": "1.0", "Content": "This TV isn't even a month old and it already stopped working. I'm never buying one online again. I'd rather go to the store itself because there is no telling what they are doing to these TV's before they send it. Picture quality is good but if it could last more than a month THAT's a PLUS!!!!!!", "Date": "July 11, 2013"}, {"Title": "Toshiba Flat Screen", "Author": "Leila Candy Bradford", "ReviewID": "R19XMJ767233TP", "Overall": "1.0", "Content": "I bought this TV as a gift for myself.  It was an exceptionally hard year and I thought I'd splurge (just once). Because I was out of state for a few months, I had the TV delivered to my daughter's home.  When I returned and moved into my apartment, I went to set up the TV only to discover the flat screen was shattered.  I was not able to return it because by the time I came home, three months had passed and it was too late to return it.  I basically wasted a couple hundred dollars that I really couldn't afford to lose.  Was not able to replace it, due to no money. Very disappointed!!", "Date": "March 6, 2014"}, {"Title": "Worse than my viewsonic lcd 1080p set", "Author": "J. Gerhardt \"design engineer\"", "ReviewID": "R1D6OH9M3QCOB7", "Overall": "1.0", "Content": "This was rated good and it turned out to be a piece of junk. The picture is blurry compare to my lcd Viewsonic that didn't have led. Its supposed to be 1080p and looks like 720p. Hooked up my laptop and it shows the boot up windows screen on the tv when loading then goes blue on the TV showing no signal.Techs from a foreign country couldn't figure it out. The colors remind me of an old color tv that can't be adjusted and some stations have a greenish tint or trees that are bright green when other colors are subdued. The sound is crap compared to the old viewsonic set that had dolby srs tru surround sound. Says built in subwoofer, what a joke. Don't buy this and get a Viewsonic instead. More features , easier to use and menus are much better. Toshiba! Cheap! Cheap! Cheap!UPDATE 1/3/14  I have to send the set into Tosiba because techs think its a hardware problem that fails to connect to my laptop vga cable. Windows shows booting up windows on the TV but says Auto Adjusting in blue and goes to no signal after windows boots up on the set. The remote is also junk. It always goes to 25.1 instead of 25 if you type it on the keypad or 43.1 instead of channel 43 if you type it on the keypad.Sometimes if I am using the down key on the channel arrows when it hits channel 49.1 it flashed 77 channel display and goes to channel 3.1 instead of the next channel lower which is 45. So the remote is weak and a piece of junk also because you cannot use the back button to get a numerical channel becuase it will jump to a .1 channel and you have to down arrow it again. My viewsonic set just displayed the number analog or digital as a single digit and not all the garbage this set puts on to the screen and was faster with no delay lag time like the Toshiba.", "Date": "December 20, 2013"}, {"Title": ":)", "Author": "brandon", "ReviewID": "R1QWWNYW5Q8KGF", "Overall": "5.0", "Content": "it is very I am enjoying it very much and I really love it thanks a whole lot appreciate it", "Date": "June 19, 2013"}, {"Title": "29\" Model Picture Failed after 10 weeks", "Author": "T. Muldowney \"Car Guy\"", "ReviewID": "R1SPZLPQNIPMIC", "Overall": "1.0", "Content": "Bought this TV for our rental condo in Florida. Bought it at H.H. Gregg. After 10 weeks it had no picture. The manager of our rental unit kindly took it back to H.H. Gregg to get a replacement only to be told: \" you have to send it back to Toshiba\". He called Toshiba and they were equally unhelpful. We will throw this new TV and buy one of the top rated (by customers) Samsung or LG TV's. No more H.H. Gregg or Toshiba TV's for us...ever!", "Date": "September 20, 2013"}, {"Title": "No User's Guide", "Author": "SlickNick", "ReviewID": "R141U1Z0QZ5KHV", "Overall": "2.0", "Content": "Bought this from the guys in yellow and blue.  Same price as Amazon.  Very pleased with ease of set-up and picture quality.  Very annoyed to be compelled to go online and download the User's Guide.  What could it have cost Toshiba to include a hard copy of essential technical information?  25 cents?  How bush league..  Will definitely ask more questions when considering a Toshiba again..", "Date": "July 25, 2013"}, {"Title": "Highly Upset", "Author": "King Son", "ReviewID": "R3NW7X62HRN19Q", "Overall": "1.0", "Content": "I just received this order and I am very upset because it is not the product that you advertised. First of all, it is not new, secondly it is not a 32 inch Toshiba, it is 28.5 inches....you guys misrepresented this item on your site and it is unprofessional.I ordered this TV for my wife as a gift and she was very disappointed as well.I want a refund on this item or replace forth with with the 32 inch Toshiba as you have advertised on your site....I cannot give a good review on this thing because it is not what I ordered.....Anthony", "Date": "January 21, 2014"}, {"Title": "claimed it was 1080.......", "Author": "Brian Koon", "ReviewID": "R2PTE2PHQI1F6J", "Overall": "1.0", "Content": "when you check its a 720 native.... Thanks for lying. It says 720p now, but when I bought these it said could do 1080. I feel screwed and wasted money buying two of these useless piles of junk. I appreciate the opportunity to buy something outdated and be lied to..", "Date": "December 23, 2013"}, {"Title": "Don't buy", "Author": "Jerry McClintock", "ReviewID": "R2ZP7TMDUSYRFN", "Overall": "1.0", "Content": "I bought this TV believing that Toshiba would be a reliable brand. Everything worked well until I turned off the TV. When I turned it back on, there was no sound. I switched HDMI ports and cables to no avail. Toshiba customer support actually told me that \"it is a defective unit\". Thanks for the help!! My first and last Toshiba purchase.", "Date": "December 2, 2013"}, {"Title": "Don't buy this tv!", "Author": "carolc84", "ReviewID": "R2JTNW5ORZI7VI", "Overall": "1.0", "Content": "Toshiba TV's are awful! They only made them to last a couple of years max. Their technical support is useless. Never buy a toshiba!", "Date": "December 20, 2013"}, {"Title": "Bad support, neither video playing from USB, nor 3D", "Author": "yajing peng", "ReviewID": "R2KZVES8DX4ET6", "Overall": "1.0", "Content": "The TV do not support play video from USB storage. I think the seller should tell us the TV's fault, but they did not. Further, I don't think the color and sound are good enough.", "Date": "July 5, 2013"}, {"Title": "Toshiba 32L1350U 32-Inch 720p 120Hz LED HDTV", "Author": "Daniel", "ReviewID": "R1F70U0MKKIAWA", "Overall": "3.0", "Content": "Rudy export product rejection for being badly damaged package and had perforations requesting my sincerest apologies as this product is this. case waiting responsiveness Thanks.", "Date": "June 19, 2013"}], "ProductInfo": {"Price": "$374.26", "Features": "Clear scan 120 Hz doubles the panel's 60 Hz refresh rate for clearer fast motion\nEnergy-efficient LED backlight for vibrant HD picture quality with sharp contract for lifelike images\nHigh-definition video and digital audio through a single cable\nDynamic Picture Mode delivers maximum contract, clarity and color saturation\nGame Mode reduces controller delay for faster video gaming action", "Name": "Toshiba 32L1350U 32-Inch 720p 60Hz LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51KxkzzeWCL._SY300_.jpg", "ProductID": "B00BN3W0G0"}}