{"Reviews": [{"Title": "Good TV, Netflix streaming has issues", "Author": "Matt Overton", "ReviewID": "R16MYBMJCMQ5EQ", "Overall": "3.0", "Content": "I would say it is a 4.5, but I really have no issues with it so I gave it a 5. I have a built in enclosure and this TV fit it with an 1/8\" to spare. I went from a 46 LCD to a 50\" LED because this item was very slim. The only problem I had once I got it was the picture looked weird and fake. Found the Motion Enhancement setting was on, so I turned it off. Picture went back to normal and I was much happier. The NETFLIX app is great, and you can watch a movie with only a few clicks. I don't like that the functionality doesn't work with my DIRECTV remote, but oh well. So far this TV has been awesome and is much better than the 46\" Samsung it replaced.I am updating my review after a few months of usage. TV works well, except for Netflix streaming. We have had daily drops that require unplugging and restarting the TV. it seems to lose wireless connection or the app crashes frequently. I had to get a wired connection to the TV, and have somewhat better results. Sharp customer support is also very poor and slow to respond. There are better products out there, I cannot recommend this at 5 stars I had before.", "Date": "July 23, 2013"}, {"Title": "Inexpensive TV with a quality build and picture", "Author": "J. Worosylo \"J. W.\"", "ReviewID": "RPBVKE49R2OD4", "Overall": "5.0", "Content": "I was simply looking for a replacement of my 10yr (yes 10yr) old Sharp Aquos LC-30HV4U.  Since i had a sharp for 10yr without a single issue, I decided it was wise to stick with them.I paid $728 for this TV last week when it was on sale and boy, what a bargain. They call this a smart tv, but to be honest, i already have an Apple TV, xbox, and PS3 so I didnt really need any more smarts.Picture:  Very good for the price.  when you view off center by about 20 degrees or so, you start to lose color saturation and the contrast starts to degrade, but its tolerable.  Since we view this straight on this is a non issue for us.  The 120Hz is nice for sports.  I basically have two setups:  one for regular TV view and one for sports, both are great settings.Sound:  Compared to my forward facing speakers of the old 30HV4U, the sound was a bit disappointing.  However, having had it for a week now, im used to it.  We have it mounted on the wall and it sounds just fine for regular TV watching (it will not replace a good soundbar or separate speakers with an amp).Overall, i'm very happy with the TV so far.  For $728, it was a steal in my opinion.Let me know if you have any questions about the TV and i'll be happy to look into it for you.UPDATE-1-30-14:  Just FYI, if you're buying this set for gaming, don't.  Though still a great TV for movies and shows, the input lag makes playing games extremely difficult, especially if the game you're playing requires quick reaction time.  Just a heads up.", "Date": "October 24, 2013"}, {"Title": "Aquos has beautiful color.", "Author": "Eric S.", "ReviewID": "R21ZK48U3S4UU6", "Overall": "5.0", "Content": "My first wide screen TV was set up by the shipping service, who waited to confirm TV was operating as it should. After 20 minutes learning the remote and making picture settings recommended by CNET, I was enjoying this terrific TV experience. Enjoying football and movies, even High Definition News reports. After  a good month, I have had a 100% positive experience. Have not attempted the wireless internet aspect yet, but I look forward to the smart part of this unit.", "Date": "October 6, 2013"}, {"Title": "Stay Away From Sharp!", "Author": "David", "ReviewID": "R3AJCGA2XV1EP4", "Overall": "1.0", "Content": "First, unfortunately I did not buy my unit from Amazon.  I'll never make that mistake again.  I bought it from Sears and the first one kept randomly powering off.  I barely caught the 30 day return period, didn't get their warranty because it's triple the price of a comparable square-trade warranty.The second one would power off and not turn back on.  I can't say enough BAD things about Sharp customer service.  Not-so-sharp non-customer service is a more accurate statement.  Their representative told me that I had the power saving option on and that if they sent a repairman, I would have to pay for the service call.  After popping some nitro-glycerin tablets (metaphorically), I asked for his supervisor who did send a local repair shop to look at the TV.  They ordered parts which took 3 weeks to get from Sharp.After they replaced the parts the TV was worse.  It wouldn't even stay on for 5 minutes.  The repair shop took the TV again and said they replaced all the power-related parts that Sharp recommended.  I got the TV back and it is doing the same thing that the first TV was doing, randomly turning off then back on.  Try watching a Netflix movie while that's happening!So now I've had a TV since July 3, 2013 that has been totally unusable.  That's almost 5 months with a piece of $800 black plastic crap sitting in my living room that doesn't work.  I called Sharp and demanded a replacement TV.  They first offered me a refurbished version of the same model.  I argued with them that I was basically paying $800 for a refurbished TV since I've never had one that worked properly.  The also told me that the warranty was still only 1 year from the original purchase price.  Unbelievable!  They then told me that they didn't have that model in stock and were going to give me last year's model LC52LE640U refurbished.  Are you kidding me!  So I paid $800 for last years model refurbished with an 8 month warranty!Go read the reviews on LC52LE640U (http://www.amazon.com/Sharp-Aquos-LC52LE640U-52-Inch-LED-LCD/product-reviews/B0076LY17E).  They're giving me a piece of crap in place of the other piece of crap.  Sounds like they have some real quality issues with power.  I will NEVER buy a Sharp product again and I will NEVER buy from Sears again.", "Date": "November 27, 2013"}, {"Title": "Good for the Price, a no frills smart TV that is obsolete at this point.", "Author": "Drweb", "ReviewID": "R3RFXL4Y2H72SC", "Overall": "3.0", "Content": "Great TV for the price.  The SmartCentral offerings of Netflix, Vudu, or CinemaNow is pathetic and stays pathetic as Sharp offers no firmware upgrades for this set.  It is was it is and will stay that way.  If you want more services like Hulu or Amazon Prime videos, you will need to buy another set or use your PS3, Blu-Ray, etc...  Picture and set up are OK.  Sound for me is an issue.  Even when using external soundbar you can't get much of a loud volume output to come out of this set.", "Date": "November 12, 2013"}, {"Title": "Dont Buy Sharp", "Author": "kenneth oehmke", "ReviewID": "R3G7ESBJJQ9TR9", "Overall": "1.0", "Content": "Do yourself a favor and shop around before settling for a Sharp television. The quality is subpar to ALL other brands available. The customer care department is despicable. Avoid the run around! Avoid the headaches! Anything but a Sharp!!!!!!!!!", "Date": "February 11, 2014"}, {"Title": "Good TV, Software full of bugs, lackluster customer support.", "Author": "ialnab", "ReviewID": "R3I4MTJN29BFN5", "Overall": "4.0", "Content": "Let me first off say that this TV is good for its price. I have several of the current generation TV's in my house. I have two LC-60LE650U models (Living Room & Bedroom), two LC-50LE650U (office & behind my bar in the basement) and the LC-80LE857U in my home theater. I have ZERO complaints about any of the other TV's in my house (these 50 inch models were the last to be bought in my home), however I think that the software that is shipped with these TV's is buggy. Once received it ships with v2.12 (at least my models did), if you go to manual update as I did it shows 2.13 is available but when you try to download it it just reboots the TV with no update being performed. Oddly enough I went to try again today after waiting a month or so and it shows that my software is now v2.19 but that version is not even listed on Sharps own website.Furthermore the \"Send to TV\" feature in iOS for Youtube does not function what-so-ever but does function flawlessly on my 60\" and 80\" models with the auto-pair feature. Clearly some type of software issue. The TV's (50 inch) did work for a time using my iPhone 4S but completely stopped again. It has never worked with my new iPad (3rd generation).For those of you looking for a TV with Youtube capabilities I'd look elsewhere until they update/upgrade their software. I am half temped to see if I can put the software for the 60 Inch on these 50 Inch models as they are from the same series, just different sizes and the newer 60\" update contains a Youtube app update which I think is needed on the 50\". I am however nervous about bricking my 50\" TV in the process of trying. Anyone else attempt it or encounter these problems?", "Date": "January 2, 2014"}, {"Title": "Sharp Smart HDTV Reboot Problem", "Author": "R. Jager", "ReviewID": "R1JTFUMU7FFDOK", "Overall": "1.0", "Content": "Purchased the 50\" Sharp Smart HDTV is May 2013.  The HDTV randomly reboots while watching programs. At first I thought it was a cable box problem.  After replacing 3 boxes over 3 months I finally realized it was a TV problem.  Contacted Sharp regarding the problem.  Sharp service department had a repair service pick up the TV from my house.  After 3 weeks the TV was still not repaired.  Control board is on back order with no ETA.  Bad luck with TV and repair.  This will be the last Sharp product that I will purchase.  Beware..", "Date": "November 28, 2013"}, {"Title": "The best in this size range", "Author": "J. Macmaniman", "ReviewID": "R2BU5FEED4545U", "Overall": "5.0", "Content": "In my opinion, Sharp is the best brand. Why do other brands need so many different, barely-distinguishable versions of the same size television anyway? Simple... so they can make some poorer quality or with marginally-different features.Picture is crystal clear, and I love the small border around the screen. Does everything I wanted and then some. VERY SATISFIED.", "Date": "December 6, 2013"}, {"Title": "Great TV Quality, Good Features", "Author": "Julian Russell \"JD\"", "ReviewID": "R1ELPGKO9FRZYP", "Overall": "4.0", "Content": "We've had no problem with this TV. Screen is bright and images are sharp. Volume/Sound from the TV could be better, but most plug their TV into a sound system. Remote is well featured. One annoyance is the need to cycle through a large number of inputs to get back to desired input. There should be quick buttons for inputs.", "Date": "May 19, 2014"}, {"Title": "The worst purchase I've made to date.", "Author": "Mike", "ReviewID": "R3BIOD3UVZ1IQ9", "Overall": "1.0", "Content": "Never purchasing another Sharp product again. I ended up buying this TV because it was on clearance for $799.97, and it is the worst purchase I've made to date. The picture quality is fair, at times the image stutters and this shouldn't even be happening at 60Hz because our brain makes the motion fluid when viewing (keep in mind I'm fully aware of what 60Hz, 120Hz and 240Hz is and I despise watching anything if the refresh rate isn't 60Hz). I tried returning it but because it was on clearance there was nothing that could be done. So I'm stuck with this piece of crap product and definitely don't recommend buying anything from sharp. Lesson learned. Do research instead of buying on impulse because of price.", "Date": "May 18, 2014"}, {"Title": "Great TV for the price", "Author": "D. J. Simons \"Dave\"", "ReviewID": "R3KXZ9HBUYRYSI", "Overall": "5.0", "Content": "I was looking for a 50 inch TV that will be strictly used for programming and not gamesI did not care about Smart nor 3D, so anyone out there who thinks the same should consider the Sharp models. I bought this at Sears for $584 on March 14 2014. Obviously for the price I am very happy, but thus far the performance is fantastic. The picture is great. This model is being phased out so if you find one, NEGOTIATE!", "Date": "March 17, 2014"}, {"Title": "best ever", "Author": "Lester Beacher", "ReviewID": "R1PP50D7W4MM1V", "Overall": "5.0", "Content": "Ha gotten a Toshiba 50 and stopped watching it because the set was not what I expected.Purchased this Sharp Aquos and I am very happy with it.I made the mistake in buying the Toshiba,I have two other Sharps in my house and should have gone with another but was talked out of it by a salesperson.I will purchase Sharp from now on.They have the best picture I have ever seen.I will say if people are looking for a new tv one get it from Amazon and two make it a Sharp you won't be sorry.", "Date": "March 16, 2014"}, {"Title": "Takes time to get right", "Author": "Brandon Bayer", "ReviewID": "R1DUTPF7O1PJGO", "Overall": "3.0", "Content": "Although the picture is great I have had to spend way too much time on the phone with Sharp customer service to help with issues. I also had repairman come to the house who setup netflix on my sons wii I can't get it work directly through the tv. Not sure if you can have it both ways but it would be nice", "Date": "February 25, 2014"}, {"Title": "Sharp Aquos not the Sharp of old.", "Author": "Lynn Young", "ReviewID": "R23PBBQMOGOC5U", "Overall": "2.0", "Content": "The TV stand was very wobbly, the color was very hard to adjust and the sound was like it came out of tin can. The sound system was the worst! I returned the TV.", "Date": "February 17, 2014"}, {"Title": "Nice TV, decent value", "Author": "Tony", "ReviewID": "R1U363X8L4LS59", "Overall": "4.0", "Content": "good, clear picture.  The default color saturation is way over the top, so it takes some time to find a balance that works.  Plenty of HDMI inputs, but one thing I don't like - it doesn't have a optical audio output, it does have a digital audio output, but it's not an optical connection.I like the built in Netflix application - I was hoping to see a built in Amazon prime at some point", "Date": "January 24, 2014"}, {"Title": "Great TV", "Author": "E. E. Yates \"Adventure with a Cause\"", "ReviewID": "ROXRUWOB8TV8Z", "Overall": "5.0", "Content": "I am just reviewing the picture quality as I use a Sony DVD for streaming and a Denon AVR for sound.  Who still uses the TV speakers for a $1000 TV when you can set up a pretty decent soundbar for $150 or put it through a good brand, very competent AVR and speakers for $350?  http://www.amazon.com/Yamaha-YHT-397-5-1-Channel-Theater-Version/dp/B007PU2X76/ref=sr_1_6?s=electronics&ie;=UTF8&qid;=1390169800&sr;=1-6&keywords;=surround+sound+systemThe picture quality is excellent - very sharp (sorry) and very adjustable.  Out of the box, colors are not perfect but the adjustments are easy and you can personalize them for different uses.  120 hz motion enhancement works great for sports and nature.  No pixelating.  I have a 5 year old Samsung 1080p and every time I would go to the store, I would say, why doesn't my TV look like that?  Now with the Sharp, it does!  One thing that contributes to this is the thin bezel. A thin bezel really, really helps the watching experience.All that said, the viewing angle is not great.  The TV merits a 4.5 because of that but for my purposes, 5 is closer than 4.BTW, the Netflix app works great.  It works much better than my Sony DVD.  The problem is - like any TV/AVR- you have to get and attach a different cable  - probably optical, not HDMI - to get the sound from the TV to my AVR for surround sound.  This is not a big deal. I am just lazy.  Youtube also seems fine.", "Date": "January 19, 2014"}, {"Title": "Good Quality Smart TV for a Smart Price!", "Author": "Robert Chavez", "ReviewID": "R6WUD80QGUH69", "Overall": "4.0", "Content": "I am very happy with the quality of this TV. The picture is amazing and has a good sound system already built in. I really like the Netflix app that the smart system featutes. I wish there were a wider range of apps for the Smart system, but besides that I love it! I would recommend this to anyone wanting a reasonably priced Smart TV.", "Date": "January 3, 2014"}, {"Title": "Great TV", "Author": "MR RR MCNAB", "ReviewID": "RKZ5WLUK63RA5", "Overall": "5.0", "Content": "Having a few issues connecting to my Bose Suround had to order cables and adapter for surround sound. Good picture quality and fairly easy to set up.", "Date": "December 26, 2013"}, {"Title": "Fabulous!", "Author": "Chad Byard", "ReviewID": "R2PJ7F3MH8E4VK", "Overall": "5.0", "Content": "Fabulous TV! Clear, bright and easy to navigate and use! Will be buying another one for sure! Would certainly recommend.", "Date": "December 15, 2013"}, {"Title": "Quit working after less than 4 years.", "Author": "Freestream \"tripehound\"", "ReviewID": "RXHTDRF34Y9NB", "Overall": "1.0", "Content": "What can possibly go wrong with electronics that it would stop working in less than 4 years.Needless to say, we won't be buying any more Sharp products ever again.  These are much to expensive to have to replace every 3 years.", "Date": "January 31, 2014"}, {"Title": "Great tv", "Author": "Alex", "ReviewID": "R39SLW4VBYH5TH", "Overall": "5.0", "Content": "I have really enjoyed this product. I haven't used many of the smart tv functions other than Netflix. It has performed very well. I have noticed a bit of stuttering when playing blu ray content from my media PC however that might be the computer not the tv. I haven't played anything off my actual blu ray player.", "Date": "September 22, 2013"}, {"Title": "Nice!", "Author": "Gene K. (aka Tyronious Ledbedder Beaver-Bottom)", "ReviewID": "R2JUY78FESOKF2", "Overall": "5.0", "Content": "I already had the 70\" version in the same product family.  The 50\" is just as good... great picture and good controls.  I just setup some excellent sounding external speakers, as I am using this TV in my office.  Good sound really adds to the experience.  Nicely done Sharp!", "Date": "August 31, 2013"}, {"Title": "great", "Author": "mike hoddy", "ReviewID": "R3ZMN4VFSU0GJ", "Overall": "5.0", "Content": "The TV is great and all it has to offer. I just wish it had an audio digital out. I like that it does not get hot like my other flat screens.You wont be disappointed with this TV. It`s worth the money", "Date": "September 27, 2013"}, {"Title": "go bigger", "Author": "L. Cook", "ReviewID": "R1N3CASIE6KBTB", "Overall": "5.0", "Content": "Love it - should've gotten the 60\".  With the very thin border, a bigger size will fit nicely in even a small living room", "Date": "January 16, 2014"}, {"Title": "Great Picture but could be better in some areas", "Author": "Da Logs Man", "ReviewID": "R1OKKYFE7Z0LL0", "Overall": "4.0", "Content": "Not very good for gaming on, there is some screen latency, even though it says it is on 120hz, it is not.The App does not work for this tv. (on iPhone 5 and up)Could be better for the price.", "Date": "January 15, 2014"}, {"Title": "Awsome TV", "Author": "John Delsanto", "ReviewID": "R26CJN7X4L6N5K", "Overall": "5.0", "Content": "This television has just the right amount of visible screen and is slim to fit pretty much anywhere. I highly recommend putting the television on a wall mount.", "Date": "November 27, 2013"}, {"Title": "Sharp fan for life.", "Author": "B. P. Smith", "ReviewID": "R26DIQ0MU59ATO", "Overall": "5.0", "Content": "TV prices being so low, it was hard not to want to go with a bigger set. This Sharp 50in replaces the Sharp 37in I've had for some years. This an excellent tv. Once you balance the settings it will produce a great picture. Very surprised by the sound quality. Assumed that since the set is so thin the sound would be too. Not true very acceptable sound quality. Use the surround setting. Wi-Fi setup was easy. I use Roku so can't vouch for Netflix et al. The set's not heavy, and I was able to attach the stand and set it up alone. If you direct connect coax, get a right angle adapter much easier. I have no complaints about this model at all, and would recommend it.", "Date": "September 25, 2013"}, {"Title": "Looks So Real!", "Author": "Notable", "ReviewID": "R36VCDZGOJ7FOA", "Overall": "5.0", "Content": "The picture is so clear, sometimes movies look like they're too real!.  I love the picture, quality and color.  Very slim frame, looks great in a modern environment.", "Date": "October 20, 2013"}, {"Title": "FALSE ADVERTISING: UNIT DOES NOT HAVE HULU+", "Author": "Dale Cooper", "ReviewID": "R3MPS3U0Y7HYCU", "Overall": "1.0", "Content": "Even though every picture on Amazon and the Sharp website shows the Smart Central having the Hulu Plus app, you can not get it for this television.I find it funny that Sharp website refuses to flat out say that you can't get it. When people ask about about the Amazon instant app, the sharp support people say \"at this time we dont have it\", but if you ask a question about Hulu Plus, its \"oh please call our customer service line so we can better assist you\" and when you call they basically tell you that your stuck with the apps that are there, or that they will \"research this further and get back to you\" The first guy I spoke to had me unplug my TV in hopes of it appearing. LIKE ARE YOU SERIOUS????????Such a joke, so now that I've spent almost a thousand dollars on this unit, I have to spend another 100 for a Roku box?I think Sharp should cover my expenses, or at least offer a rebate on this model.VERY UNHAPPY WITH THIS TELEVISION", "Date": "October 8, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "AQUOS 1080p LED Display: Using photo-alignment technology that's precision crafted to let more light through in bright scenes and shut more light out in dark scenes, the AQUOS 1080p LED Display with a 4 million: 1 contrast ratio creates a picture so real you can see the difference.\n120Hz Refresh Rate: See sharper, more electrifying action with the most advanced panel refresh rates available today.  120Hz technology delivers crystal-clear images even during fast-motion scenes.\nSmartCentral Smart TV with Dual-Core Processor & built in Wi-Fi: Sharp®'s intuitive Smart TV lets you quickly connect to your favorite content and instantly access apps like Facebook®, Twitter®, and YouTube®, plus streaming movies, music, games, and websites you love.\nSlim Design: The brilliant AQUOS® LED display is embraced by a striking new frame that's thinner around the screen and slimmer in depth, so it can fit just about anywhere.\nPowerful 20W Audio: High fidelity audio with Clear Voice technology.", "Name": "Sharp LC-50LE650 50-inch Aquos 1080p 120Hz Smart LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41LCeUw0omL._SX300_.jpg", "ProductID": "B00C9Y2TA4"}}