{"Reviews": [{"Title": "Amazing TV for an Unbelievable Price", "Author": "J.", "ReviewID": "R3TYLI31JXM3QA", "Overall": "5.0", "Content": "I just bought this TV recently from Microcenter for $600 This TV replaces a 7 year old 42 inch Samsung Plasma and I couldn't have made a better choice. I thought I would post a review here on Amazon since it probably gets more views.General Info-----------------------------------------Model: LG60PN5700Weight: Approx. 80-90 lbs.Size: 60 inch (59.8 inch diagonal)Max Resolution: 1080P (1920x 1080p)Display Tech: PlasmaScreen Type: GlossyBuilt In WiFI?: YES3D?: NOConnections: 3 HDMI, 1 Component, 1 Composite, 1 RJ45 Ethernet Jack, 3 USB ports, 1 RF in, 1 Optical Audio (Digital Audio Out)-----------------------------------------Pros------------------------------------------Price-Image Quality-Smart TV-Built-In WiFI-Good Amount of Connections-Lots of features-----------------------------------------Cons------------------------------------------No 3D (doesn't matter to me but may to others)-Screen is very glossy (not much of an issue when the TV is on but may bother some)-Included remote is extremely basic with no built-in keyboard or mousepad-----------------------------------------Setup-----------------------------------------Setting up this TV can take a few minutes or can take a few hours depending on how deep you want to go in getting the best picture possible. The different presets the TV comes with should be enough for most people but if you want to take it a little further there is a built in calibration tool called Picture Wizard that you can use. I used this tool and the picture comes out to be perfect for my tastes. You can also setup the configuration individually for each connection used so your Xbox can have different settings than your blu-ray player.-----------------------------------------Display-----------------------------------------The picture on this TV is unbelievable especially when compared to the price of the TV. Colors are sharp and vibrant and black levels are good. Due to this being a plasma and having an equivalent refresh rate of 600Hz sports and other fast action looks great without any noticeable tearing or ghosting. I'm a pretty heavy gamer and games on this TV look stunning to say the least. Some reviewers have said that they notice input lag caused by the TV that makes certain games (mainly shooters) unplayable for them. I felt no difference between my previous TV and this LG unit. The games just look much better and bigger! One thing to note is that the display is very glossy (as is the case for most plasmas). This means if you have a window or any lare light source that the TV is facing or around you may get annoying glare on the screen from it. The room in which the TV is placed for me has two windows off to the side so they are not bothersome when the TV is turned on.-----------------------------------------Sound-----------------------------------------The sound quality is typical of what to expect from TV speakers. LG has a virtual surround mode which to me makes the sound output sound deeper and louder but for more serious audio enthusiasts there is an Optical Audio connection on the rear to connect an A/V receiver to. The TV speakers are on the back of the TV so make sure not to put it too close to the wall or else the sound may get muffled.-----------------------------------------Smart TV Features-----------------------------------------This unit has the LG Smart TV functionality built into it which is another reason the price is amazing when comparing to the feature set of the TV. It comes a with a good amount of pre-installed apps such as Netflix, Hulu Plus, Pandora, etc. These aren't the best looking apps but they get the job done well enough. Netflix looks great if you have a good enough internet connection. The TV can also play movies and music from your computer or laptop if it is connected to the same wired/wireless network as the TV. It has WiFI Direct and Miracast so compatible devices can mirror their screens and beam content to the TV. The interface is basically sets of grids that is easy to navigate and doesn't stutter to much. Its usually a bit slow when the TV is first turned on but after about 10-20 seconds it is perfectly fine.-----------------------------------------Remote-----------------------------------------This TV comes with a standard remote that has the bare essentials for a TV remote. Most of the features on the Smart TV interface are designed more for keyboard/mouse or LG's 'Magic Remote'. I highly suggest NOT buying the magic remote as you can download a free app on Android or iOS that allows you to control your TV through your phone. Navigating the Smart TV menus and typing on the on-screen keyboard using the standard remote is a pain and the phone app makes it a million times easier and faster.-----------------------------------------Final Thoughts-----------------------------------------I've had this TV for about a week now and am very very satisfied with my purchase. I've been looking for a new TV since November 2012 but didn't want to overpay just to get certain features. This TV is the best bang for your buck I've found since then. If you are looking for a good TV for your media room or pretty much anywhere in the house this is the TV to get. It has all the latest features (minus 3D which I don't really care about) and good amount of connections. Games look amazing on this TV and blu-ray movies look super sharp. Definitely a 5 Star worthy television!-----------------------------------------", "Date": "August 9, 2013"}, {"Title": "The Dream T.V. and First Plasma", "Author": "Sgt. Solomon", "ReviewID": "R13BH1212L5TIQ", "Overall": "5.0", "Content": "This is the first time I have ever bought a Plasma, due to the bad reputation it used to have, so I always stuck with LED/LCD. However this had everything I was looking for.A Big Screen affordable Smart HDTV. I received a lot more than expected. This Television has 3 HDMI inputs, 2 USB inputs, and Optical for your surround sound. This also has a full built in internet web browser, and the apps run fast. I plugged it in directly with an Ethernet Cable, and there is no latency issues that others have mentioned.The Television is beautiful, and easy to set up.  The Delivery was impressive, and they not only set it up, but cleaned up all the garbage as well, while maintaining an extremely courteous, and friendly attitude. Delivery was done by CEVA and they arrived right on time.The Television has so many features, that it is like getting used to a new smart phone. I recommend if you have the money, to buy the smart remote that goes with the television. The remote it comes with works well, but with the actual smart remote, it is much easier to navigate, and has built in microphone for voice recognition. However if you have an android smart phone, or ios device. You can actually save your money and use your phone as a wireless remote, utilizing the LG App.One feature I love is the Tru Motion that was easy to find and turn on. This television fit all my needs. No 3D bull crap that currently sucks on t.v.s today anyways, and the option to purchase a camera. Very important for a t.v. that is a smart t.v. hooked up to the internet. This does not have a built in Camera, so there is no need to worry about hackers spying on you.At the time I write this article, the only App this is missing is Amazon Prime, which I assume will be released with a future update. This Television updates, and works as a giant computer with out invading your privacy. I always dreamed about owning a TV like this one day, and thanks to Amazon, was able to get it on time, and most importantly, completely affordable.UPDATEThey have since updated the apps, and happy to say this has all movie streaming services including Amazon Prime!  Also happy to note that I was able to save a few hundred bucks and use my cell phone to download the free app to control the set. This makes it incredibly easy to navigate, stream music, movies, and have a second screen.  This is a must own, and still highly recommend as the best T.V. I have ever purchased.", "Date": "August 15, 2013"}, {"Title": "LG 60PN5700 60-Inch Class 1080P 600Hz Plasma TV with Smart TV (Electronics)", "Author": "deedoor", "ReviewID": "R10MW4KFJLUEL", "Overall": "4.0", "Content": "I found this TV on Frys.com for an truly \"amazing price\". Because I wanted it immediately, I drove to a nearby Fry's store and had them honor the price. The picture is beautiful and I love the smart features. I can read my Facebook, watch UTube, order movies, and surf the web from my chair. It does have a glare from my window directly opposite the TV, but I can live with it. When I sit to the side, I have no glare and an absolutely gorgeous picture.  My only complaint is that it does not have the Amazon Instant Movie app and I can not watch the movies that I purchased from Amazon. However, it does have Netflix, Redbox, Vudu and a few others which I like. In closing, I am loving my new TV and very pleased with my purchase. I give it two thumbs up!Very important!!! In place of buying a smart remote, I found out that the LG Smart TV app can be downloaded to your tablet or phone and you use it just like a mouse. This is the greatest helpful information that I stumbled on by another LG owner. I love this feature.", "Date": "July 26, 2013"}, {"Title": "Great color when watching TV and unbelievable gaming experience", "Author": "Kiley Galterio", "ReviewID": "RZT4H97MA3H3", "Overall": "4.0", "Content": "This TV is a beast! I used the Cheetah wall mount to hang above my fire place and I'm very pleased. For people buying this TV, out of the box, the TV is great, however to get the perfect picture you do have to mess with the settings. Once I found the super resolution setting the TV has never looked so crisp and clear. The color is amazing and warm. As expected with plasma TV's the picture can look dark out of the box. Use the setup wizard at the bottom of the TV settings to adjust everything to your liking. And to the reviewer who gave this TV a poor review because of gaming. I have this TV with a PS4 and the picture and motion are flawless. The color is perfect when playing Killzone and the motion is amazing when flying down the straightaways in Need for Speed. I cannot comment on the build in speakers as I have my TV connected to a surround sound system. I originally bought the TCL 4k 50 inch TV however noticed a lot of motion blur/ghosting. I'm very happy I decided to return the TCL and go with the LG.", "Date": "December 13, 2013"}, {"Title": "Yeah, the screen is very reflective. I can see the reflection of all the money I saved by choosing it. ;>)", "Author": "Strongwood \"Strongwood\"", "ReviewID": "R1G1ZF1QAJD17O", "Overall": "5.0", "Content": "I just had to share my views regarding this TV. I would give it 10 stars if I could. I have LEDs and LCDs in other rooms of the house and they look good, but I don't care what others say, plasma still beats them. It has forced me to try to adjust the pictures on my other sets.I drove 150 miles to purchase this TV for $700 at MicroCenter. Funny how plasmas are becoming more affordable than LEDs or LCDs just in time for the manufacturers to discontinue them, go figure. I couldn't even begin to find a smart 60\" for anywhere near this price and after spending a few hours trying different settings, the picture blows away everyone who comes over to see it. Ok, no 3D. I would not expect to find a quality 3D picture for this price, and it doesn't matter to me...it may to others.Just buy the TV...I cannot imagine you will be disappointed", "Date": "February 10, 2014"}, {"Title": "Amazing!!", "Author": "John Giddens", "ReviewID": "R3V96BWO3N82QX", "Overall": "5.0", "Content": "I just purchased this tv from a local retailer. It has the best picture of any tv I have ever owned! The sound is good and setup was simple. The browser is good but a little slow on wifi.", "Date": "May 17, 2013"}, {"Title": "Great value for a very good flatscreen", "Author": "Bob D", "ReviewID": "REBZ2CNRKBCVO", "Overall": "5.0", "Content": "I've only had mine for a couple of weeks and only watched it a few times but I'm giving this five stars because I think it's a great value for a midline 60\" plasma. When you compare the price to a Samsung or Panasonic the value proposition is clear if you're able to buy it in the $800-850 price range. If you can get it for anywhere near the $600 figure other reviewers have posted they bought it for it's a steal. I know Paul's TV in my market sold it for $599 just before I ordered it from Amazon. When I called Paul's they said they sold out immediately which is not surprising.Be aware that the LG PN6500 model which has been selling at a slightly higher price level on Amazon recently is in fact an older lower priced model than the 5700. You can verify that on LG's website. Best I could ascertain is the 5700 has 3 HDMI inputs whereas the 6500 has 2. Otherwise I think they're pretty much identical. I think the 6500 sellers are trying to take advantage of uneducated shoppers that would assume the 6500 is higher priced model than the 5700 because of the numerical model designation.The features I like are: 1) easy setup to access your PC via WiFi, 2) the Android smartphone remote control app & 3) the great number of smart TV apps pre-installed.I'm not a gamer but be aware if you are that others have posted about the lag and that's because you need a highline model with a faster chip to play games. This TV loads Amazon Prime selections a lot faster than my 2 year old Panasonic Viera GT30. I'm not a TV enthusiast in the regard of being able to comment in detail about the quality of the picture except to say it's fine for me. My Viera GT30 is THX certified so ultimately it can no doubt produce a higher quality picture but in reality we've never played a THX certified disc and only watch UVerse broadcast channels & Amazon Prime selections.I ended up paying $524 for this TV bought directly from Amazon. I originally paid $849 with 0% 24 month financing but but got an additional $325 in credits because the shipper JB Hunt was a horror to deal with. After JB Hunt called me on New Years Eve morning at 7:40am EST to arrange for delivery the following Friday with an all day time window until 8:00pm not only did they not show up they didn't even have the courtesy to call me. I live in a large metropolitan area and JB Hunt would only deliver on a Wednesday or Friday and it had to be mid afternoon at the latest in the day which makes me wonder why they said until 8:00pm at night originally. How many days off work does JB Hunt think someone's going to take to get a TV delivered? Answer, they absolutely don't care. You will either live with their highly restrictive time schedule or you won't get the item delivered. My TV was received at their warehouse over two weeks before I got it. Even the Amazon customer service reps that conferenced JB Hunt in to my phone calls could not believe how difficult Hunt was to deal with. I have no clue why Amazon uses JB Hunt. My Panasonic was also purchased directly from Amazon and delivered by CSV and I had zero problems with the delivery. So if you order this TV or any other one and JB Hunt is the shipper don't be surprised if arranging for delivery is a nightmare and receipt of the unit is many days after it was supposed to be delivered.The other thing I'd say is to those on the fence about buying a plasma vs. a LCD or LED/LCD. The reasons you buy plasma are: 1) no motion blur (watching sports especially), 2) deeper blacks & 3) can view from any angle. The downsides to plasma are you need to have the TV located out of direct sunlight because of the screen's glossiness and it does generate heat. If you go to a store you'd never pick plasma because the LCD & LED/LCD's are so much brighter-that's because those TVs are in the display mode. You'd wonder why anybody would buy plasma. But IMO plasma is far superior and people that really know flatscreens always buy plasma. My Panasonic was my first flatscreen and I did a lot of online research before I bought it. All of the professional reviewers as well as user reviewers made it clear that plasma is a higher quality picture. Hope that helps if you're unsure about plasma.And to Amazon, thank you for the additional accommodation discounts but you need to get rid of JB Hunt as a shipper. They subject your customers to pure abuse and I know that is not the way Amazon treats its customers.", "Date": "January 25, 2014"}, {"Title": "Great TV.", "Author": "A. Woods \"It's always funny 'til someone gets...", "ReviewID": "R2R9CPBONU2UFB", "Overall": "5.0", "Content": "I bought this TV on a budget to replace an old Sony projection TV that started having issues that I didn't really want to fix. It's main use is for Netflix, dvds, and gaming.  Has a very nice picture and can be customized to fit your tastes if you want to play around with it.  I have not noticed any input lag on this TV. The notion that a VIZIO brand LED LCD TV is better than the plasma for gaming is ludicrous. Your refresh rate on a plasma is instantaneous compared to even the best LED LCDs that are 5ms...claiming 2ms. Aside from possibly a defective unit, plasma is my first and only choice for gaming and fast motion (sports).  I'm dreading the fact that most if not all companies are shutting down their production of plasma TVs and going all LED. Anyways, if you can get your hands on this TV before LG sells out of them I highly recommend it for the cost vs size/quality.", "Date": "October 25, 2013"}, {"Title": "LG great TV", "Author": "Jake", "ReviewID": "R3P2ZYM6C6QID6", "Overall": "5.0", "Content": "This tv is great and for the price you cant beat it. Now the tv does not support 3d but that is not a big deal for me. Sports look amazing on it and when I first bought the product I was nervous bc I was always told plasmas can leave a burned in image, but we have come a long ways in technology since plasma screens were first released. With that said I still don't leave a still image on the screen to long and most of the time I will turn the tv off when I leave the room. As a matter one cool thing the tv does when watching netflix with the SMART apps in the tv app section, if I pause the screen for about five minutes or so the picture shrinks and starts bouncing around on the tv like a screen saver so the pixels are moving on the screen so it prevents a still image burn in. I would recommend this tv to anyone that just wants an HD tv without the 3D and I am glad I made the decision to give plasma a try.", "Date": "January 20, 2014"}, {"Title": "Great Purchase", "Author": "frank l", "ReviewID": "R1VG6OLKNDK0OI", "Overall": "5.0", "Content": "Although we've only had the tv for a month we can't say anything bad about it.Great picture and sound.We've used the streaming vidio from Netflix via WiFi and all is well.Tv was delivered to the house,set up and running smoothly before they left.Couldn't ask for more.", "Date": "November 7, 2013"}, {"Title": "Truly Amazing TV", "Author": "Eap", "ReviewID": "R1TRD0845EXVDP", "Overall": "5.0", "Content": "I was a little skeptical about getting this TV based on what some people have said about the gaming lag. However due to all the great reviews on here and the unbeatable price I found it for, I decided to buy it. The first thing I did after setting it up (which requires two people since it weighs 83lbs with the stand), was test my Xbox 360 and PS4. Coming from my 4 year old 46 inch LCD Sony TV I did notice there was a very slight delay in the action performed after pressing a button on the controller. So I tried what others have suggested and used \"Game Mode\" by pressing the 'AV Mode' button on the remote and... that slight lag was gone! The 2 games I tried were Call of Duty: Ghosts on Xbox 360 and Assassin's Creed IV: Black Flag on PS4.  After testing a few other games I went ahead and used the settings recommended by this person for the 50 inch LG plasma TV: http://www.amazon.com/review/R14PX1033ASBMH/ref=cm_cr_dp_title?ie=UTF8&ASIN;=B006Z9W6AW&nodeID;=172282&store;=electronics. The setting options are very similar to this model and they're a great starting point, after some slight adjustments for my personal preferences the picture quality on HD cable, games and Blu Rays is incredible. The main three apps I use are Netflix, Amazon Instant Video and Youtube, all of which work great connected to an Ethernet cable. I do have my Blu Ray player (PlayStation 4) hooked up through my HDMI home theater receiver and I noticed that there was an audio sync issue when playing Blu Rays. After messing around with the receiver's and the TV's audio sync settings to no avail, I found a setting on the PS4 under 'Video Playback Settings' called \"Output at 1080p/24hz\" and I set it to off. After that the audio is synchronized perfectly and the picture is still 1080p (since the PS4 has a different setting for resolution display). Until 4K TVs become affordable and content for them readily available this LG will do great.", "Date": "March 1, 2014"}, {"Title": "Replacement TV", "Author": "Robert B. Schmaling", "ReviewID": "R3GB4DBYJNZH73", "Overall": "4.0", "Content": "I found this at a very low price on Amazon. This is a smart TV but not a 3D one. I have had other plasma TVs and prefer them to the other types. So far this has met my expectations. I hope I get the same life from it as I got on the last one", "Date": "January 24, 2014"}, {"Title": "Nice tv with killer picture", "Author": "real non-bias reviewer", "ReviewID": "R120RON6WFR1UY", "Overall": "4.0", "Content": "This is a killer TV. Price is the big issue. Be patient and look around. As of this review it's $850. I can say I paid much less than this. That was the reason for this tv over an led/LCD. Led will be brighter but this tv has a greeeat picture with good range and deep blacks. You won't be disappointed", "Date": "November 30, 2013"}, {"Title": "Great for the Money...", "Author": "Boraxman", "ReviewID": "R2RFTX1SHXSJ1R", "Overall": "4.0", "Content": "I picked this TV up a few weeks ago to replace my $3k POS 58\" Pansonic Plasma I bought in 2009. The Panasonic did have a beautiful picture and I will say this LG is comparable in picture quality.My LG was picked up at the store (not purchased from Amazon) for a low price of $599+ tax. I loaded it in my truck transporting it upright. It was packed in the box well and had no missing parts. First thing I noticed was how much thinner and lighter it is vs. the Panny it replaced.So my Bro and I hung it on the wall and fired it up. I turned down contrast and brightness for break-in, not that I believe modern plasma TV needs it but I figured what can it hurt. So when not being watched I ran a color slide show via the USB port. The LG was left on for a week and a half straight. Finally I turned the settings up and I will say the picture is beautiful!The smart functions are nice but could probably be lived without. I was able to connect to my wireless network in about a minute. I do wish it would have come with the optional LG smart remote that you can pick up for an additional $70. The remote provided is OK but I will not be using it as I have a Harmony. The TV come with 1yr parts and labor and 2yr screen warranty and additional coverage is offed via LG website.So what I do not like about the TV is; It has a highly reflective screen and runs hot enough to use as a portable heater in the winter...minor drawbacks I guess for a new in the box $600 60\" smart plasma TVOverall I would make this purchase again.", "Date": "August 20, 2013"}, {"Title": "Great picture , but is plasma right for you?", "Author": "Mr. Robert C. Cox", "ReviewID": "RA2P1QB2WCWRG", "Overall": "5.0", "Content": "When I researched plasma HDTV sets, the question of screen brightness came into play. I went to the local Best Buy to compare the LED VS the Plasma. In the extremely brightly lit store the LED sets appeared to have a brighter picture. The plasmas were noticeably dimmer and a fair picture quality comparison could not be made. (the LED sets could have their pictured adjusted higher than the plasma sets.) If you have a home that is lit up like a Best Buy store then plasma is not for you. Based on the strength of many reviews about this set and my research, I bought the LG from Amazon with the Enhanced delivery.  The Enhanced Delivery brings the set into a room that you choose and they unbox it. They will plug it in , if the set is up to room temperature and check that a picture is displayed. They will removed the packaging if you desire, but I would recommend that you keep it until the set has been checked out thorouhly. My research has shown that LG has a low failure out of the box rate and mine had no issues. The delivery people will not put the base on or place the set on the stand unless you have made other arrangements, in advance, with the shipping company. All the additional hookups and settings are up to you. The picture is extremely good in reduced light and stunning in a darkened room. Our standard definition DVDs looked great and the Blue-Rays were stunning.  This is our third HDTV (50 & 55 inch sets) and this one , despite being a large screen set, had greater detail and color rendition that most of the sets I viewed. One note I should mention, is that the digital audio out optical connector is disabled by default. There is an sound menu option called Sound out. It is set to TV speaker by default and that turns off the digital out optical connector. By selecting digital audio out it turns on that feature and turns off the TV speaker.  While it seems like a inconvenience, it makes sense as you don't want your TV speaker on when you are running your audio through the surround sound system. The onboard speakers are OK as with most thin profile sets and sound a bit tinny to my ears. Overall this set is a winner if you have a room that you can reduce the light infiltration.", "Date": "March 17, 2014"}, {"Title": "Very reflective screen can reduce enjoyability unless it is a totally dark in the room", "Author": "matrix", "ReviewID": "R2RQMOF9ZFYBLU", "Overall": "3.0", "Content": "Well I have to say that the picture on this TV is fantastic but when I try to watch Netflix through it i often get playback errors so I have to use my roku still. The TV does have 1 terrible flaw which is why I gave 3 stars instead of a possible 5, the screen is so reflective that you cannot have any lights on and I had to put blankets over all of the windows. Otherwise you can see everything reflect on the screen which ruins the picture. Also the 600 hertz is a little deceptive as it is really a 60 hertz that refreshes 10 times a minute.", "Date": "March 13, 2014"}, {"Title": "Impressed, Very Impressed!", "Author": "kathy", "ReviewID": "RAA77O71CYT0", "Overall": "5.0", "Content": "Purchased to replace 42\" plasma.  Very, very impressed.  Hung on the wall with an inexpensive mount.  Great picture quality.  So many things the Smart TV can do that I did not know.  I can answer my phone with caller ID, run Directv with my phone or tablet using the LG remote download (no need for extra keyboard or mouse).  I surf the net, do email, check scores and weather, all while still watching the football game.  The Roku, Amazon Prime, and Hulu Plus apps all function very well.  I am hoping to find a word processing app to use.  I looked into the Magic Remote, but for the price I don't think it adds much except voice control.", "Date": "December 16, 2013"}, {"Title": "The best value for money TV out there!", "Author": "Aniket", "ReviewID": "R1J8LTC3Y48UJF", "Overall": "5.0", "Content": "This is my first plasma TV and I must say I like it very much. Apps are good, TV clarity is awesome. Wi-Fi was easy to set up. I haven't connected my console yet so cannot comment on input lag.I got it from Fry's for $599 on black friday and I think it's a good deal.FYI for those who are wondering, this TV does not have a headphone jack.", "Date": "December 4, 2013"}, {"Title": "Amazing TV, worth triple what it cost!", "Author": "Andrew", "ReviewID": "R2L3X6LP53YUO", "Overall": "5.0", "Content": "Hands down the best tv I've owned. But to be fair, I was switching from a 32 inch to this 60 inch.Everyone's saying that the setup requires two people since the tv is so heavy. While the TV is heavy, it can be done with one if you don't mind doing a couple squats... I'm not a particularly strong guy either.Get the LG smart tv app, it's very important if you want to use the smart features on the TV.The picture is beautiful, and the sound seems great too. Plays Lord of the Rings quite nicely. the tv is surprisingly skinny too.Gaming seems to be flawless if you switch the AV mode to gaming (av mode button is bottom of the remote that comes with TV).  Doesn't seem to be any input lag whatsoever.This tv I believe is for, 2013, and it looks very sleek.", "Date": "November 30, 2013"}, {"Title": "GREAT buy for the price.", "Author": "Mark L Liptak", "ReviewID": "RMGFUII2RSC0S", "Overall": "5.0", "Content": "I bought this TV a few months ago and am extremely happy with it. The picture is outstanding and overall the TV performs exactly as advertised. It is a GREAT buy for the price.", "Date": "November 17, 2013"}, {"Title": "Fantastic Plasma from LG!!", "Author": "Joe Jimenez", "ReviewID": "R16S0AQP6O4FH2", "Overall": "5.0", "Content": "Picture quality is great, audio is great, features are AWESOME, with WiFi and network sharing I can view all my movies from my computer without a problem. Just wish it had more apps like Twit.Tv and Revision3. Oh well, the Netflix and amazon prime/crackle apps are fast and function just like they did on my PS3.BUY THIS TV!!", "Date": "January 28, 2014"}, {"Title": "But This TV!!!", "Author": "HeatherDionne", "ReviewID": "R367ORXI08N545", "Overall": "5.0", "Content": "Had been looking and researching tvs for about a month. Wanted the best picture we could get for the price. This means plasma. Also wanted a smart TV but didn't need all the 3d stuff.  This TV was on sale on cyber Monday for $849.00 with enhanced delivery. Read all the reviews and decided to pull the trigger. This TV is replacing our  42 inch Vizio LCD. Woozer!!!! I didn't believe how amazing the picture looked. Watched Pacific Rim on BRay the first night. though the plot line was lacking, the picture was not, simply amazing.  Also watched War of the Worlds a non BDay older disc I had. On this size TV there is no getting round that standard def quality stinks. Not forgiving at all.The Smart TV portion is Awesome. It DOES come with Amazon preloaded for movie watching and I like you can actually surf the web. Can use my phone to control channels as well as volume. Can also interface my phone with YouTube. My husband enjoyed that one.Overall the TV functions are very user friendly! Set up was very quick and easy. Have no regrets at all so far!!On a side note, though I think $849 is an amazing price, yesterday I found it on frys.com for $699.00. Contacted Amazon, provided information online and within a few hours received confirmation that they were price matching and credited my card.Amazon is my addiction. Best customer service around!If you are looking for a 60 inch with great picture quality, but this TV!!!! You won't regret it!!!", "Date": "December 10, 2013"}, {"Title": "Great picture, very reflective", "Author": "David W. Hunt \"Skipper\"", "ReviewID": "R1THIZX7J1SFPM", "Overall": "4.0", "Content": "The picture is great using factory settings - especially Cinema.  The TV is extraordinarily thin and looks good even on a table with its clucky base.  The speakers are tolerable for built-ins, but I notice that Netflix playbacks were sometimes distorted and sounded muddy.  I suspect this is due to conflicting Dolby settings, or some other software issue, since I got rid of it by changing Netflix sound settings.I had to watch a movie in SD, and expected a bad experience give the size of the screen. I actually forgot about this in a few minutes - it must have some kind of up convert.  Not HD, but watchable if you have to.The big downside is the front screen is essentially a mirror and reflects everything.  Even with relatively low light.  The screen is bright enough for broad daylight, good for football/baseball, but the reflections do not allow a suitable movie experience in rooms with a good deal of light - the TV will crank up the brightness but the reflection is too annoying. I kept the TV for two reasons.  The picture is really great, and at about $900 delivered this is an incredible bargain.  I can put the other $1,500 I almost paid to good use.The Smart TV section is pretty good now that Amazon has been added on the last update just this week.  This is so good I no longer use my Sony BD player for access to NetFlix/Amazon.  Updates load in background, so you do not need to wait - good thing since there have been a lot of updates.The remote is above average.  Just watch out for accidentally pushing the function buttons above and below the up and down arrows - I did this at least 20 times by mistake.More suggestions: The blue button at the bottom is the link to SmartTV and I use it constantly.On Netflix, the OK button pauses the picture.  This is the only way to do it since there is no pause button.The \"back\" bottom on the lower left corner of the arrow keys is essential - the only way out of some screens.Plug in a blue tooth mouse and it works for some functions much better than the remote. A BT keyboard is also supposed to work, which would be great for searches.", "Date": "October 15, 2013"}, {"Title": "Awsome value", "Author": "eyerobert", "ReviewID": "R1H2JEBIC4RXYH", "Overall": "5.0", "Content": "Have had the 5700 60' for 2 months and am very satisfied with its performance, picture quality is outstanding, very rich and natural.  It took a little while to get the picture settings just right and sound was a little disappointing as my old Sony rear projection had 6x9\" speakers but the sound actually improved as the speakers were broken in with about 50 hrs of use. Purchased at Fry's at an unbelievable sale price and decided to add on 4 year extended warranty from Costco at a very reasonable price.  My wife and I are very picky about clarity and sharpness as I am a retired optometrist, that being said we would not hesitate in recommending this HDTV to anyone looking for great enjoyment.Bob", "Date": "July 26, 2013"}, {"Title": "Love my LG Plasma Smart TV", "Author": "Debra A. Pangborn", "ReviewID": "R15NMHMYKOQQTF", "Overall": "5.0", "Content": "This TV is awesome!!! I cannot say how much I like it - it's so smart LOL - We don't pay for cable anymore because we got fed up with the high prices. So, hubby got an HDTV Antenna and took the dish down and put that up in it's place. The wires were already threaded through the house (or attic) so all that we had to do was hook that up to our LG TV and voila!! It set itself up and got even more channels on its own than we had before. PLUS we don't need that little box anymore - awesome! PLUS we get Amazon Prime on there and Netflix, Youtube, Internet if you want to hook it up via wifi - and so much more - very nice TV... Super color too. I like Plasma much better than the LED. Highly recommend", "Date": "May 9, 2014"}, {"Title": "Excellent picture", "Author": "alisha", "ReviewID": "R6RB0CHZQO481", "Overall": "5.0", "Content": "This TV is excellent.  This is my first big TV purchase and I love it!!! The price was exceptional as well.", "Date": "March 13, 2014"}, {"Title": "LOVE LOVE LOVE", "Author": "Sharon", "ReviewID": "R1PORYDD48624J", "Overall": "5.0", "Content": "My husband & I shopped & researched for quite a few months for a TV even actually purchasing one & returning it to the store (what a pain!). Anyway, we settled on this & its great. We've had it probably almost 6 months now & it is money well spent!", "Date": "March 5, 2014"}, {"Title": "Amazing Picture", "Author": "Rose Marie Soucy", "ReviewID": "R1RZ6RBBSM2FZF", "Overall": "5.0", "Content": "Beautiful picture! Quality and size perfect swivel base nice feature. Screen is reflective mostly during the day does not inhibit the picture. Sound is like most, speakers are lacking had to add sound bar for an amazing tv experience. I rated this LG plasma 5 stars because of it's picture quality and to me that's what it is all about.", "Date": "March 3, 2014"}, {"Title": "Do not overlook Plasma!", "Author": "Gil", "ReviewID": "R2S6J38WZ6JTTK", "Overall": "4.0", "Content": "It is beyond me why LCD became an automatic choice these days. Maybe it is the stores cranking up the brightness that makes plasma look dim in the store. It is a known fact that some TVs have a store display mode vs a home one.Plasma has great picture quality, black is black - not gray, no motion blur, wide viewing angle. And it is cheaper. I got this set for $700. For a 60\" screen! And I do not feel I made any compromise.I had a very good LCD TV for the last 4 years (top of the line that got an excellent pic quality ratings) and this TV has better image quality. It's smoother and the contrast is excellent. Dark scenes look just great and it seems like this set can handle any image scenario. I did notice loss of details in some cases, but I suspect it was the broadcast and not the TV. I really need to try it with some blu-ray content and update here. I could not notice any blurring in high-movement scenes (like NBA for example).Only thing to consider is that the screen is glossy, so you get reflections. If your room is very bright like for example has many windows (and you watch TV in daytime) or has many lights, you should consider if this TV is best for your and where it will be placed in the room.Tv has WiFi, 3 HDMI, 2 USB. Remote is standard. It is a smart TV so you can run apps. It comes with many pre-loaded apps. Netfix included. I personally don't care much about smart TVs. for up to $100 you can add a streamer and you're all set. I use a $35 Chromecast for Netflix and Google.", "Date": "February 9, 2014"}, {"Title": "Spectacular!", "Author": "Andrew R. Turner", "ReviewID": "R1W10QB0DQPTUG", "Overall": "5.0", "Content": "Bought this to replace an $8,000 2003 RCA 42\" plasma which finally began to fail. Just installed (professional install) in time for the Olympics opening ceremony.  Wow.  Great colors, especially blues,blacks & reds.  Cannot beat the price ($900).  And Wifi, easy to control with iphone app.  Needed plasma not LED because room full of windows.  Great TV.", "Date": "February 7, 2014"}, {"Title": "Excellent TV at an unbeatable price", "Author": "Vincent Frisina", "ReviewID": "R2RBYXY31CQ2YJ", "Overall": "5.0", "Content": "Pros:* Great picture quality and color* Easy to set up and tweak the color* Intuitive display and controls for smart tv features* 3 HDMI inputs where many of the lower cost units only had 2 or even just 1* PRICE! This was an amazing deal.Cons:* The rear-facing speakers get muffled a bit in my cabinet. Either clearing the space around it or a separate speaker set / sound bar would take care of it.", "Date": "February 4, 2014"}, {"Title": "Awesome tv love the app to", "Author": "Brandon", "ReviewID": "R2AU3TODVNMZ4L", "Overall": "5.0", "Content": "Tv needs to be in dark room because of the glossy screen but other than that one of the best pictures I've seen on a plasma1080p tv there is a clear and better difference vs the best selling LCD and LED tv's. The tv is very bright almost as bright as those led's get, also the tv has good style and design in the menus (good job LG). The LG app is fun and easy to use but doesn't take me away from using the remote that's probably just habit though.", "Date": "January 3, 2014"}, {"Title": "great tv for the money", "Author": "Lanny Marsh", "ReviewID": "R2FU3KFGED68DW", "Overall": "5.0", "Content": "It's everything the reviews said. I do wish it would come standard with the smart remote but I can live without it.", "Date": "November 29, 2013"}, {"Title": "The best TV I have ever seen!", "Author": "GreggB", "ReviewID": "R9SCAQB53FXZS", "Overall": "5.0", "Content": "There was a major issue with shipping but I won't let it affect the rating.  This is without a doubt the greatest TV I have ever seen.  The colors are crisp and bright and there are no negative motion when watching sports or playing PS3 games on it.  The only negative I can say is that it reflects lights in the room it is in but with curtains closed and lights off, the picture can't be beat!This is not a 3D television which is fine with me as I never would use it anyway.", "Date": "December 30, 2013"}, {"Title": "NOT A 3D DISPLAY! Great Picture. Fairly Easy Setup. Not enough documentation.", "Author": "occasionalgamer", "ReviewID": "RSM1DRX82ID6", "Overall": "4.0", "Content": "AT THE TIME OF WRITING THIS REVIEW, THE DESCRIPTION SAYS \"3D\". THIS MODEL IS NOT 3D! Only posting this so no one orders it if 3D is an important feature.Having said that, I am happy with this unit for the most part. I bought one on a deep discount about a week ago. However, I had to return that unit due to 'shadows' in the image. There were areas of the screen which were not as bright as the rest of the screen. They were slightly less bright than the surrounding image. On 99% of the stuff presented on screen you could not detect the flaw. However, it is now NHL playoffs and one of the first things I watched on this TV was a hockey game. So with a consistent white background displayed (the ice), these shadows became fairly obvious and were very distracting as the camera panned left to right etc. I then did some more testing and found these shadows to be apparent on different inputs as well as when using the built in internet browser. So I returned it as a defective unit. The new unit is much better, but there are still small areas where shadows are apparent. The shadow contrast is much much less than with the first unit and they are no longer distracting at all. The interesting thing is that they are in the same places as the first unit, so I'm guessing it is some kind of manufacturing issue. Not sure, just giving information. The issue is sooooo minor now, that I'm not sure I would have noticed it at all if I had my current unit first. But since I was looking for it, I can see them if I am looking for them. Again, these can only be detected if displaying a bright image of one color that spans nearly all of the screen. Like ice, or if a bright blue sky fills the screen. Or if displaying a 'test' webpage that is all one color. Examples: http://www.ledr.com/colours/yellow.jpg http://www.ledr.com/colours/white.jpg http://www.ledr.com/colours/cyan.jpg .One thing I'm not too happy with is the lack of documentation. Just one example: There is no supplied documentation on how to use the \"Smart\" features. They are fairly intuitive, but to supply absolutely nothing is a bit frustrating. Another example: There is a way to view content presented by your computers on your home network. But I will have to go onto LG's website, blogs etc in order to figure out how to set it up. And even on their website, you have to really dig to find what you need.As I mentioned above, I watch a lot of hockey and it is hard to find a unit that can keep up with the motion of the puck. This unit does as well as any I have seen.  I will also be watching a lot of NFL and based on what I have seen so far, don't expect any issues. I would recommend this unit to others, especially if they can get the deal I got ($700).", "Date": "May 31, 2013"}, {"Title": "complete bargain", "Author": "gregory j.", "ReviewID": "R3U2K2UX7A1E7F", "Overall": "5.0", "Content": "I decided to try plasma for my latest flat screen purchase. I currently have DLP, LCD and LED flatscreens and have avoided plasma entirely due to the negatives that are associated with plasma. The negatives that I had in mind included heat produced, energy consumption, need to be calibrated professionally and that plasma screens need to be in a darker room.I was unable to ignore the price point of this set despite being willing to spend about triple this price for a 60 inch screen.All of my previous concerns are smashed, it is cool, easy to get a beautiful picture using the picture wizard. The picture is definitely not as bright as a LED but at home rather than in a brightly lit store it seems to be more comfortable to view and the overall composition of the colors looks significantly more luxurious like the difference between a point and shoot camera (LED) and DSLR (plasma).The plasma image is much more like that of a high quality DLP without the viewing angle limits that a DLP has.A few words of caution, the screen is very shiny and reflection could be a problem if you have windows directly opposite from where you intend to view from. This is not a light weight item, you WILL need help particularly if you plan on wall mounting it. it is awkward and top heavyI believe the reason it is so affordable because it has excluded the available magic remote, 3D, and the pen touch feature. the pen thing and the remote are available separately.... 3D is NOT!If 3D is a feature you want you will need to shop elsewhere.I just watched the WSBK coverage on beIN today and it was completely beautiful!!", "Date": "June 30, 2013"}, {"Title": "Wow what a deal!", "Author": "Chad Hosegood", "ReviewID": "R2ZG7HFJHR7KW", "Overall": "5.0", "Content": "Bought on Black Friday to use in my newly built home theater in my basement. I hear plasma tvs are the best tv for rooms with no light. Let me tell you that this tv creates beautiful pictures and when you turn off the lights...it's breathtaking.This was bought for under $700 and is one of the best steals in terms of bargains I have ever taken advantage of. Overall I am extremely happy and know my family and friends will enjoy countless hours of amazing video quality for sporting events (hello 600hz!) and movies/shows for many years to come.", "Date": "December 30, 2013"}, {"Title": "AWESOME!", "Author": "Eric Richardson", "ReviewID": "R3U3DM0CE9SI9O", "Overall": "5.0", "Content": "I love this TV! The picture is awesome! The smart tv is awesome i love all the apps and all the cool stuff.", "Date": "December 19, 2013"}, {"Title": "Beautiful picture quality.", "Author": "Rusgirl01", "ReviewID": "RXRY1RK59BROP", "Overall": "5.0", "Content": "Just got it a few hours ago as a gift for my husband and I from each other.  Already mounted and playing.  Beautiful picture quality.  Woohoo!", "Date": "December 11, 2013"}, {"Title": "Really Enjoying It", "Author": "Eric Field", "ReviewID": "R3GPIYP334XDC1", "Overall": "4.0", "Content": "I've had this for about six months.  Having never purchased a TV at all, I wanted something that will show movies brilliantly.  This is great!  Really enjoy the picture for movies and video games.  Not particularly intuitive.  It's pretty obvious there is more depth to the hardware and the technology , but the TV doesn't really point you in any direction that will help understand what the TV's capabilities are.  That being said, I believe this is money well spent.  Just be prepared to do some research on ratio aspect, sound quality, video quality and so on.  Thank goodness for Google.", "Date": "May 4, 2014"}, {"Title": "Lg 60\" Plasma", "Author": "Gregory Madsen \"Greg M\"", "ReviewID": "R3EBL6U2VECWUX", "Overall": "4.0", "Content": "Ive had this TV for 3 months roughly and I love it. Lots of picture settings (Im still messing around to find perfection!) to play with and other features. I would give it 5 stars but the screen is extreeeeemmmlllyyy glossy making it reflective. I knew that based on other reviews before ordering but still... Overall great TV especially for the price!!!", "Date": "May 3, 2014"}, {"Title": "Awesome tv for Unbelivable price", "Author": "Anshu Pandit", "ReviewID": "RBS6HJ5GI6DNI", "Overall": "5.0", "Content": "Wow ! this tv is awesome !I had a samsung tv and the tv screen got cracked. So i had to get a new tv. I was looking for a samsung or sony. I almost bought a sony 70 inch for 1900 at hhgreg. But backed out at last moment because it was a floor model. Then I saw this as on slick deals.net that micro center is selling lg60pn5700 for 599. I looked online they were out of stock in our area. So I callled hhgreg and asked if they will price match. and they did ! I bought the tv home. and oh man. this tv is awesome ! its a smart tv. I can access so many apps and the browser. I used the lg picture wizard and now the picture is unbelivable ! I used the lg cloud etc. I am glad I didnt spend 2000 on a sony or samsung. I got the same for $600 ! love this tv !", "Date": "April 27, 2014"}, {"Title": "LG CUSTOMER SUPPORT IS TERRIBLE!", "Author": "Ohio", "ReviewID": "R4PHHZIQKCA45", "Overall": "1.0", "Content": "This TV arrived with a broken remote.  LG customer support asked me to try to reset it, I did... still broken.They told me they would send a new one out, 4 weeks went by and I never received the remote.  Mind you, I can't use the TV without the remote, it's next to impossible.I initially asked for expedited shipping, they refused and said I had to wait 7-14 days.I waited.  No remote.I called up today (4 weeks later) to find that the rep I spoke with didn't even submit the order for the remote.  The LG customer support agent told me I had to wait another 7-10 days just for the \"request to be approved\".  I've had nothing but good experiences with Samsung's customer support.  I will stick with them in the future.", "Date": "April 25, 2014"}, {"Title": "Glare is not a problem", "Author": "J Wright", "ReviewID": "RER0JZODZ50XE", "Overall": "5.0", "Content": "This TV has such an excellent contrast ratio, I cannot complain about anything. It wows everyone who walks into our living room. Nobody pays attention to any glare because the picture is just that excellent. LG really surpassed expectations for a budget tv.", "Date": "April 17, 2014"}, {"Title": "Great TV, terrible remote.", "Author": "CA Martino", "ReviewID": "R3H7WANEEN3FPN", "Overall": "4.0", "Content": "Great TV. Tons of functionality. Awesome picture. Only downside so far has been the remote scrapping out a week after we got it.", "Date": "April 13, 2014"}, {"Title": "Great TV Experience", "Author": "Eddie B.", "ReviewID": "R3TV4BYZVT0D54", "Overall": "5.0", "Content": "LG Smart TV is the way to go! Much better than running third party receivers in order to get the internet apps onto your TV. The remote is great, but what's even better is the app that controls the TV like a mouse on a computer would! And the LG sound bar is the best one for it's price also (under $200), and it syncs up beautifully with this LG TV. Shop around before you buy this TV though… I purchased mine for under $900 from amazon in late 2013.", "Date": "April 11, 2014"}, {"Title": "Excellent TV, but mine had to go in for warranty work right away.", "Author": "Truthworldwide", "ReviewID": "R3R4AMGMUN6CFJ", "Overall": "4.0", "Content": "Picture is sharp, the refresh rate makes motion blur unnoticeable, and the connectivity is excellent for Pandora and Netflix connections. However my set began having picture issues right away and was in the shop for 2 weeks. LGs warranty program was great and very little hassle. I ended up needing both the X and Y boards replaced. TV now functions outstanding.", "Date": "April 1, 2014"}, {"Title": "great picture", "Author": "Jeffrey Dodge", "ReviewID": "R15IJZJUM2R8S0", "Overall": "5.0", "Content": "We watch TV from 2 rooms and this TV has almost a 180 degree viewing angle. Picture is fantastic. Tied into my WiFi super easy. Haven't spent much time, but the apps look great. Once I figure this TV out I might have to cancel Dish.", "Date": "March 22, 2014"}, {"Title": "Great picture", "Author": "Jay H", "ReviewID": "RQELZ0PQW5N4T", "Overall": "5.0", "Content": "I have had this TV for 6 mos.Sound is great you don't need to go out and buy a sepirate sound system like I have read you have to do with some tvs.The picture is beautiful,If you watch the Game of Thrones the picture will blow you away.", "Date": "March 15, 2014"}, {"Title": "Nice!", "Author": "cleetllett", "ReviewID": "R1ETS95WZ2M060", "Overall": "5.0", "Content": "This Plasma TV is my first Plasma. I have to admit I was a bit hesitant to purchase a Plasma TV however I purchased this one based on the reviews and I am totally satisfied.The only negative I have like others have mentioned is the reflection on the screen. In my opinion it's the same reflection similar to that of an iPad screen.", "Date": "March 13, 2014"}, {"Title": "love it. got it mostly for my son's gaming.", "Author": "Jim in PA", "ReviewID": "R2ZZ3PKD934QZ5", "Overall": "5.0", "Content": "love it. got it mostly for my son's gaming.Make sure you find the setting for gaming on the connection type or you will have lag between the game console and the TV.", "Date": "March 12, 2014"}, {"Title": "Amazing TV at a great price", "Author": "Amazon Customer \"DMack\"", "ReviewID": "R3GGTW75QHWZ32", "Overall": "5.0", "Content": "I upgraded from a 2007 60\" Plasma Vizio and the difference was astonishing.  The picture is amazing and the smart apps are fantastic, especially if you have Amazon Prime.  The free shows and movies are endless and when you do need to pay for something that isn't free, it's still dirt cheap.  You can get lost for hours in the YouTube media as well.I had some issues with image ghosting, specifically dark objects moving across a light background so I called LG customer service.  They sent a LG technician in two days and all he had to to was tweak some of the settings to fix the problem.  He said that, in some cases, the more picture enhancement features you use, the longer it takes for the image to process and get to the screen.  By shutting down some of those \"features\" the picture became perfect again.  I felt much better about this solution versus taking the TV apart and changing random parts.Overall I'm thrilled silly with this TV.I bought from Amazon Prime in the week leading up to Black Friday for $849.99 pus tax.  I then a couple days later I found the same TV locally via microcenter.com for $629.00.  The problem is that Amazon.com will only price match certain retailers and MicroCenter isn't one of them.  So I called Fry's Electronics (Amazon WILL price match Fry's) and asked if THEY would price match MicroCenter.  They said yes.  After hopping on online chat with an Amazon rep, and explaining the pricing trail, they agreed to refund me the difference.  I was asked to provide the link to the MicroCenter page and the phone number of the store.  They did all the verification while I was in the chat session with the rep.  They never called Fry's to verify the price match.  Could be an oversight, but it worked.Shweet!Yes, it has a glossy screen.  Put some http://www.amazon.com/gp/product/B0026SAHAW/ref=oh_details_o09_s00_i00?ie=UTF8&psc;=1 on your windows and quit complaining. =)", "Date": "March 8, 2014"}, {"Title": "Excellent TV for a great price", "Author": "Brian D Long", "ReviewID": "R1ADA6QQDVZD4U", "Overall": "5.0", "Content": "The picture is very clear and its perfect for watching sporting events.  The set-up was easy and the smart TV features are pretty user-friendly.  The remote that comes with the TV is a bit unwieldy however, especially when attempting to navigate some of the smart TV features.", "Date": "March 6, 2014"}, {"Title": "Pure perfection !!", "Author": "travis h biglow", "ReviewID": "R1X8C4FG7YO7WB", "Overall": "5.0", "Content": "Item arrived safely, although 2 days late. I was skeptical about plasma TV's, as I had heard the horror stories. I read up on reviews and weighed my options versus price and settled on this product. I replaced my 37\" LCD with this plasma. The picture quality is amazing. I could not be more satisfied with the performance aspect. There are a few drawbacks though...some functions do not work without making the additional purchase of the \"magic remote\" (which it should have come with for that reason).  Being a smart tv, it comes with several apps, the only problem is most are at an additional fee. I highly recommend this product.", "Date": "March 5, 2014"}, {"Title": "So cool", "Author": "Timothy  Paul Petty", "ReviewID": "R2V3GKO9TA142M", "Overall": "5.0", "Content": "Very big very crisp connections are made easy cool Smart technology I do wish It had come with the LG smart remote AS some of the features are not usable without It. very simple to use and easy to get you A/V setting correct. Easy connection with home network and wireless devices.", "Date": "February 27, 2014"}, {"Title": "great plasma picture", "Author": "john gendron", "ReviewID": "RG44VSKTJNR4J", "Overall": "5.0", "Content": "Had a Samsung plasma for 6 years before it started to fail.  Looked at LCD and LED and liked them, but still prefer the overall picture of a plasma.,  Is not \"dim\" as some reviews say. I have a very bright room and picture has great brightness and contrast.  Black is very vivid.  Seems like plasma is on the way out.  Too bad.  Buy one soon!", "Date": "February 15, 2014"}, {"Title": "FANTASTIC", "Author": "Elizabeth Mojica", "ReviewID": "R389EA9A4T8III", "Overall": "5.0", "Content": "We  search and search for this size plasma and could not beat the price.  Nicetv sleek and very nice picture the colors are great.", "Date": "February 9, 2014"}, {"Title": "Good display and capabilities", "Author": "C. S. Wagner", "ReviewID": "R26EU7YN9QX3D2", "Overall": "4.0", "Content": "The display is good. It isn't outstanding. There is a bad pixel on the screen, but it isn't in the middle of the screen, so it isn't covered under the warranty. The smart capabilities are good. You will want one of their smart remotes (sold separately) to avoid spending half your time clicking around a virtual keyboard. I stream Netflix and Vudu. Both worked well. The built-in web is buggy on anything but a very plain web page. The smart TV organization is built on cards, but you cannot edit or remove LG's \"premium\" card, which is always the first card in the list. That is annoying. Overall, it is well worth the money compared to our previous two televisions.", "Date": "January 17, 2014"}, {"Title": "Amazing TV and very good price", "Author": "Ivan Rivera", "ReviewID": "R2138NPOMMNEP4", "Overall": "5.0", "Content": "This is my first Plama and I am very happy with this TV. It arrive on time and in very good condition. The picture is excellent and the sound is very good. The only point with this TV is that you have to view it with low light because reflect in the TV.", "Date": "January 15, 2014"}, {"Title": "Best I have ever seen!", "Author": "Terry Bue", "ReviewID": "R3853P6C67H8N6", "Overall": "5.0", "Content": "First we bought a 60 inch LED 120MZ. It had an ok picture, but returned it because there was a horizontal line that would not go away. We then ordered this one. The picture of this plazma is many times better than the LED picture quality. To add to our movie type viewing we ordered a sound bar, but returned it as it didn't noticable improve the sound.", "Date": "January 9, 2014"}, {"Title": "Great TV, great price", "Author": "PA Pennington", "ReviewID": "RC0XT52M6HK9T", "Overall": "5.0", "Content": "The TV arrived via Amazon- on TIME (during the holidays). We pulled it out of the box, hooked it up, downloaded the iPhone ap and it is amazing! With the iPhone ap, you can access your YouTube account favorite list and play videos straight off the phone onto the tv.Anyway- it has a wonderful picture and we have hooked it up to surround sound and are loving this TV. It was half the price of most other smart tv's and has a better picture!", "Date": "January 8, 2014"}, {"Title": "Great TV at an AWESOME price!!", "Author": "K. Burnett", "ReviewID": "R18E6MZE0FZKI9", "Overall": "5.0", "Content": "Just bought this at Fry's brick and mortar.  $599 and Fry's threw in Monster Brand power strip, two Monster HDMI cables and a tv cleaning kit.  This thing is freaking awesome!!!  It replaced a 65\" Mits DLP set that cost $4000 7 years ago.  Great picture and a whole bunch of stuff I didn't expect.  It's a smart tv with all sorts of extras.  Can even control the thing with my Iphone.  Only issue I'm having now is the Universal remote.  I don't know the brand of the stupid time warner digital adapter so it won't sync.  It's not the tv's fault.  Prolly just switch it out with the cable box in another room.  Looked at LED sets at a couple of hundred bucks more.  Yeah they're more energy efficient, but they don't pop out at you like plasma.  Besides....I have a 5.6kw solar system and don't pay for electricity anyways so who gives a heck.  This set is a deal at a few hundred bucks more.  At $600 I had to jump on it.", "Date": "November 29, 2013"}, {"Title": "Great value for the money", "Author": "george greco", "ReviewID": "R37EVU9W8BQXAB", "Overall": "5.0", "Content": "I just bought the TV at Fry's for $599.00.  Great value and picture quality.  You can always buy better at four times the cost - but this TV is no compromise.", "Date": "November 29, 2013"}, {"Title": "Outstanding TV", "Author": "BWL Cocoyo", "ReviewID": "R3PZCSJYAW5PKD", "Overall": "5.0", "Content": "I recently bought on the cheap 4K 55-inch TVs that have recently come out in the market.  After a serious disappointment with that unit  I saw an ad for this one in the local Microcenter at a great price so I decided to take the plunge and got it to replace the other one.What a difference this TV has been! It has extraordinary quality and amazing controls to set it any want you need, sharpeness, dynamic contrast, color, brightness, you name it...  The colors and sharpness are outstanding. The fact that it is a smart TV is surely a plus to lots of people but since we got PS3/XBOX1 there is no need.  Watching a blue ray on this TV is an absolute experience, the blacks are intense, and colors extremely vivid.At this price point this TV is an unbelievable deal.", "Date": "January 4, 2014"}, {"Title": "Great 60 inch for the price.", "Author": "SaidNoOneEver", "ReviewID": "R2LG36D89EB5ES", "Overall": "5.0", "Content": "The pros:1. 60 inch HD plasma at a good price that is perfect for football and movies2. Great picture - I calibrated with these settings but I'm on the 100 hr break in period with contrast and panel light at 45:http://www.amazon.com/review/R14PX1033ASBMH/ref=cm_cd_pg_pg1?ie=UTF8&asin;=B006Z9W6AW&cdForum;=Fx3CRR97OB5LGL7&cdPage;=1&cdThread;=Tx1J2WAHAXHFKVI&store;=electronics3. Smart tv streaming - Netflix and Amazon work and look great.4. Sound - Sorry, nothing on the tv speakers as they perform as normally what you'd expect.  I have it hooked up to the budget $300 Vizio 5.1 surround sound system with wireless sub and it sounds great with it.Cons:1. There is no anti glare coating so you will see the windows reflected while watching during the day. It's annoying but not unbearable with my non blackout shades pulled down.2. It does run hot which is fine if you keep the room cool. l have it at 65 and the room temp is fine with my new 60 inch heater3. No magic remote thrown in, however I'm adding back in a star for the LG App for iOS and Android. It's a serviceable replacement being that it is a free app. That's a savings value of $60-70. The other two cons one can work around.", "Date": "December 1, 2013"}, {"Title": "Really good deal", "Author": "Larry N Hovey", "ReviewID": "R2IE6DPM3XLKQZ", "Overall": "4.0", "Content": "Shipped in perfect shape! Really enjoying it. Can't beat the price for a 60\" smart TV. LG app works great with it.", "Date": "November 4, 2013"}, {"Title": "Great Plasma but Buyer Beware", "Author": "Jacob and Kylin Johnson \"-Jake n' Kylin\"", "ReviewID": "RNU50YB6EZ1HP", "Overall": "4.0", "Content": "This TV has flawless image quality.  The picture settings are pretty easy to configure and the tv is the best I've seen in a long time.  There are a few other retailers who have specials and offer a bit cheaper pricing.  I would like to send out a BUYER BEWARE of the title to this item.  This IS NOT A 3D PLASMA TV.  No 3D on this tv!  Please read this review and BUYER BEWARE!!!!!  But if you are looking for a fantastic Plasma (with NO 3D) then this is a great choice.", "Date": "May 27, 2013"}, {"Title": "Great TV for this price", "Author": "mfg275 \"mfg275\"", "ReviewID": "R3Y4MWL2S8KQ9", "Overall": "4.0", "Content": "Totaly great price and TV. The plasma is good works great, all the apps are here no need for all those extra boxs. You do get some glare from the tv in bright areas but other then that for the price and the LG name is great. I am an owner of LG 50 inch had it for 4 years and still work great. It was time to upgrade to the 60 inch. Let you know if i have any problems.For the price of the Square deal warrianty for 5 years is well worth the price.", "Date": "October 25, 2013"}, {"Title": "month later.  tv still broken.  it never worked out of box", "Author": "John D.", "ReviewID": "R2I7JMEVFN7D2J", "Overall": "1.0", "Content": "month later Tv still doesn't work.  horrible repair man from the warranty came and had my senior mother lifting the Tv and assisting in repairs which made Tv worse.  still waiting for a differeent repairman.  replacements take weeks.  repairs take weeks.", "Date": "March 12, 2014"}, {"Title": "Very good TV. Recommended.", "Author": "Chris", "ReviewID": "R20P9AVGRLDEVK", "Overall": "4.0", "Content": "Excellent product. Crappy remote, forces you to buy the smart remote for functionality. Would have given 5 stars. I would suggest that LG include a better remote.", "Date": "February 1, 2014"}, {"Title": "Great TV for a great price.", "Author": "Sharon L. Lowe", "ReviewID": "R111RTP8LJRO64", "Overall": "5.0", "Content": "Beautiful picture!  Scenery is vibrant and night scenes are easy to view unlike our old TV. Sports are fun to watch -- like being there. Haven't even used the \"Smart\" part yet.", "Date": "January 4, 2014"}, {"Title": "awesome tv", "Author": "bill", "ReviewID": "RXX9GVQJMLBS9", "Overall": "5.0", "Content": "this was a great buy.  would recomend this tv to anyone who wants a really good smart tv that is easy to use and with a quality picture and sound.", "Date": "December 31, 2013"}, {"Title": "Great Picture", "Author": "Donald E.", "ReviewID": "RAW46UA6O5IYE", "Overall": "4.0", "Content": "Can't figure out how to get virtual keyboard when trying to use smart features.  Neither owner's manual or user's guide address issue.Other than that it's a great product.", "Date": "December 31, 2013"}, {"Title": "Best TV for the value", "Author": "John", "ReviewID": "R2ZFVKFSJY6MZL", "Overall": "5.0", "Content": "Recently bought this TV over thanksgiving for $850. TV arrived surpassing expectations with superior performance in graphics. My parents has a 60 inch Sony, and needless to say i think this lg is better with the plasma graphics, plus the smart tv features.", "Date": "December 30, 2013"}, {"Title": "simply awesome", "Author": "Haaziq", "ReviewID": "R2BSEGUDG0YEG6", "Overall": "5.0", "Content": "I've just brought this Lg smart TV a couple days ago and all I can say is its the best tv out there so far hands down. I love it.if you don't have one you want one go get it you won't be disappointed", "Date": "December 12, 2013"}, {"Title": "Value for money", "Author": "Ken", "ReviewID": "RWYKIZLMNBA2I", "Overall": "5.0", "Content": "60\" TV for a very good price. Been using the TV for a week now and have found no issues. The price is great for a Smart TV. I bought it from Amazon and noticed it's currently out of stock.", "Date": "October 20, 2013"}, {"Title": "Decent Value for a 60\" Smart TV", "Author": "J. Cali \"Mr. Cali\"", "ReviewID": "R3J9L9MB0O88ZB", "Overall": "3.0", "Content": "I have to admit I paid a lot less for this unit than I expected to for a 60\" smart TV.  So for the value this Unit is nice.  My main issue is the wireless adapter in the TV.  Even though every other product I own would connect to my home network this TV wouldn't.  I ended up buying a range extender to pair with my router and that worked.  The other issue is that the TV takes about 3-5 mins to get connected to my home network after it is powered on.  Every other electronic device I own connects within 5-10 seconds if not immediately.  And as someone else mentioned the input and smart app feature has unacceptable lag time. We are talking about 5 seconds or so but when you are used to instantaneous changing or starting of devices or apps this is frustrating.The positive is that it fits perfectly into my built-in entertainment center, the picture is crisp and brilliant, and the speakers are above average.Going back I wish I spent an extra $300-$500 for different model but the price was too good to pass up at the time.  So if you can live with some minor irritations I think this unit is a good value.  I would recommend to get a unit without smart TV feature and buy a Roku 3 to go along with it.", "Date": "December 6, 2013"}, {"Title": "LOVE IT", "Author": "A. A. Henderson \"Pepper\"", "ReviewID": "R2BDW89PP2GA15", "Overall": "5.0", "Content": "I just purchased this smart TV yesterday and I am loving it! Great picture and sound and all the bells and whistles!! I love playing online games and to be able to play on a 60 inch screen is totally amazing. You will not be disappointed if you purchase this TV. I love LG products, so I already knew even before I purchased that I made the right decision.", "Date": "June 19, 2013"}, {"Title": "TV has 76ms delay!!! Not for gaming or Streaming movies!!!", "Author": "Lawrence Marchione", "ReviewID": "R31GBU7N9IBKAL", "Overall": "2.0", "Content": "There is a BIG delay on this TV when playing video games on this TV. Your only option to relieve some of this is to put the TV into \"game mode\" but the delay is still very noticeable and you lose your picture calibrations from expert mode. I also experience the delay when watching movies off of my PLEX media server which make it imposable to watch movies when their mouths are moving and the sound is catching up (I had ZERO issues with my other TV). This is really disappointing to me because this is what I wanted to use this TV for. The picture is grate on this TV after calibrating and doing a proper burn in with a picture slide show. my only complaint is the brightness but not a  big deal as it is in a dim room. My 46\" Samsung LED TV from 2008 handles everything better than this TV but i wanted a cheap bigger TV while i wait for 4K to drop. Again this TV is a big disappointment if you plan to play any games on it. LG please update firmware to fix this delay!!! other than that TV is made good, has a glass screen like any plasma, don't put off much hear, and isn't to heavy for a 60\" TV. 2 Stars for delay that makes this TV almost unusable for me.", "Date": "December 18, 2013"}, {"Title": "This is the best TV I think I have ever had.", "Author": "Joe D. Harris", "ReviewID": "R26PWT96NVZ2AN", "Overall": "5.0", "Content": "I had a lot of consternation about ordering a TV online, but this experience definitely made me a believer.  I wish the delivering company had have some knowledge in the set up as I still have to have that done, but the unit is wonderful.", "Date": "April 4, 2014"}, {"Title": "Great value", "Author": "Kirk Bodary", "ReviewID": "RYJCKL9JSC6P3", "Overall": "4.0", "Content": "Easy setup and great picture.  Use of the \"smart\" features not intuitively obvious and a bit cumbersome with the provided basic remote.  But for the price it is wonderful.  Will probably get the \"magic\" remote to better use the \"smart\" features.", "Date": "December 27, 2013"}, {"Title": "Beautiful TV that was almost a reality for my aging parents........", "Author": "Skeletor-Vixen", "ReviewID": "R2H8NVEXS5GZX9", "Overall": "5.0", "Content": "I did much research for this purchase which was to be a very anticipated surprise for my 80+ year old parents.  They were so excited by the delivery man and large box, only to have the box opened to produce a severely cracked screen.  Box was not damaged - so box much have been dropped on bottom side?  Amazon will give refund after I asked for another to be sent and they said they cannot obtain any more of these models.  Now......to find another comparable for same pricing?  I do wish Amazon would have offered a comparable model for same price or less.Beautiful TV - saw it in store.  Wish my parents would have gotten it intact and that their surprise was the wonderful one I'd intended it to be.  Price in store is not even close to what Amazon had offered when I purchased it.  Bad way to start my holiday shopping.......hope it's better from here on out.Thank you.", "Date": "November 18, 2013"}, {"Title": "Slow smarts and huge input lag", "Author": "Nathaniel Jarvi", "ReviewID": "R9QMPGEXTM3L0", "Overall": "2.0", "Content": "I chose this rating for GAMERS.The input lag is unplayable.  Even with adjusted settings the delay is easily noticed and will be quickly frustrating.The Smart TV option was just an extra for me...it's a pretty cool feature besides typing.  It's tedious and annoying when paired up with the TV delay (completely separate from the input lag)...you can easily start getting used to the delay and time your scrolls correctly but it's not worth the hassle.Additionally with the \"Smart\" TV, you couldn't easily switch between surround sound and TV sound.  It didn't auto detect and you would have to go through the menu and change everything.  We have several people living in the house so we always switch surround sound off when somebody goes to bed.  However, it takes awhile and the constant switching was a pain.This TV would be great for somebody who doesn't change settings and only watches TV or movies.  Picture quality was pretty good but if you're only going for picture quality then you might as well go w/ a LED anyways.I have since purchased a Vizio 60\" 1080p led Smart TV.  No input lag and the Smart TV option is awesome.  There's a keyboard on the opposite side of the normal remote controls and it is amazing.  Lag not included.", "Date": "October 21, 2013"}, {"Title": "Meh", "Author": "Niko", "ReviewID": "R2NNODZ149CX3Q", "Overall": "3.0", "Content": "Big screen, affordable price but I didn't know what 600hz actually meant until i bought a plasma. It's a 60hz TV basically, its just showing the same frame 10 more times, 60hz * 10 = 600hz. Terrible for gaming and action movies. Great for regular tv and other movies. NOT good as a computer monitor either, burnt images of start menus. I have my Graphics card output OC to 77hz, and it helps but still doesn't compare to 120hz led/lcd.Pros: Cheap, big, Color is great, bright, good speakers, sleek design, smart tv, 3 hdmicons: weak stand very wobbly, 60hz, Smart tv can't be customized, no DVI or Audio output (rca or 3.5)", "Date": "December 8, 2013"}], "ProductInfo": {"Price": "$949.00", "Features": "Access premium content providers like Hulu Plus, Netflix and YouTube direct from your TV with the fun and easy to use Magic Remote. Disclaimer: Magic Remote, Internet connection & some subscriptions required and sold separately.\nTired of streaky action or unclear plays during the game? See sports, fast action and video games in Full HD like never before. LG's 600Hz technology virtually eliminates motion blur.\nWhether you create a network with your compatible devices or access content stored in your LG Cloud, LG makes it easy for you to share content with friends and family.\nConnectivity:    Wi-Fi Built-in,    MHL Mobile High Definition Link,    Wi-Fi Direct,    Windows 7 Certified, DLNA Certified,    Intel® Wireless Display (WiDi)\nConnectivity: Wi-Fi Built-in, MHL Mobile High Definition Link, Wi-Fi Direct, Windows 7 Certified, DLNA Certified, Intel Wireless Display (WiDi)\nTV without stand (Width x Height x Depth): 54.6 x 32.4 x 2.2, Inches, TV with stand (Width x Height x Depth): 54.6 x 34.5 x 13.5 Inches", "Name": "LG 60PN5700 60-Inch Class 1080P 600Hz Plasma TV with Smart TV  (2013 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/31GDkdlf8DL._SX300_.jpg", "ProductID": "B00CPDRKWG"}}