{"Reviews": [{"Title": "First one arrived with non-functional HDMI ports", "Author": "Michael Souders", "ReviewID": "RPDZ57QWKSQF5", "Overall": "3.0", "Content": "Contacted sharp and tried all their methods to fixed it. None worked, they put me in touch with a company to come repair the TV. Not satisfied with that (would take weeks), I contacted amazon, got flipped to their \"large items\" group. The guy said \"Man that sucks, when do you want your new one to arrive.\"So great job amazon fulfillment services, bad job sharp. New one arrived a couple days later, shippers helped me pack the old one in the new ones box and even wall mount the new one. Very happy with Amazon, not so much Sharp.", "Date": "August 29, 2013"}, {"Title": "Amazing TV", "Author": "Jade Moore", "ReviewID": "REG89FPJQXXSI", "Overall": "5.0", "Content": "That being said it's almost too amazing. It's hard getting used to how clear this tv is. You have to learn the tv and utilize the filters for movies and sitcoms. The picture is so clear it distracts from the fact that movies are suppose to be fake. However that being said you do get used to it and there is no better tv available for sports, you are there! Also any production designed for super high def is beautiful. And the Black on this tv is perfect. It's not dark grey like most TVs it's truly black! Like I said AWESOME TV!", "Date": "October 14, 2013"}, {"Title": "Best Value", "Author": "AMG-PFD", "ReviewID": "R3EPCLLBKROAWA", "Overall": "5.0", "Content": "For those like me , this is the best picture for a bright room , wanting to watch sports and movies. without 3D glasses,this is tv for you. It still as motion problems, that only plasma can fix in a dark room.", "Date": "August 26, 2013"}, {"Title": "Great TV - confusing features, menus, and setup", "Author": "Chris", "ReviewID": "R2TCBXTKL6O26V", "Overall": "4.0", "Content": "First I'll say the picture quality is great on the TV.  Deep blacks, vivid colors, and no ghosting.  I upgraded from a 63\" plasma, so picture quality was very important to me.  It takes a little bit of effort to get the picture to look \"right\", but once you do it's great.  At first the Soap Opera Effect was a bit jarring so I disabled the features that causes it.  But - I ended up enabling them again and have gotten used to it.  In my opinion it makes everything stand out more and it feels like you're getting more out of the TV.  Again - that's my personal opinion... to each their own.Now - the reason for 4 stars and not 5 is this:  The menus/setup on this TV is really confusing.  It took me 10 minutes just to figure out how to turn off the built-in speakers and output sound to my AV receiver.  Sharp could have done a MUCH better job designing the UI and making it more intuitive.  My second gripe is minor for me, but may cause others some problems depending on their setup.  The power cord is NOT removable.  That to me is just silly for a high end TV.Hope this helps!", "Date": "January 14, 2014"}, {"Title": "A GREAT TV, AND THE TIMING WAS PERFECT TO ORDER", "Author": "R. J. Nodes", "ReviewID": "R32LPQSL60A8I1", "Overall": "5.0", "Content": "I was very satisfied with my purchase of the 70\" Sharp Aquos - start to finish. I had watched the price fluctuations, as I'm sure many Amazon purchasers do, and felt that it had reached its low in early December and was time to buy. First, the TV itself: it is everything that the manufacturer promised and more. The setup was fairly simple (I have to confess that year's ago, I sold high end TV's) and its performance is fantastic. My sole concern was in hoping I wouldn't find a lot of dead pixels, and there has not been a single one! The delivery truck arrived when they said it would, and two men brought it in (it's very heavy). Although the driver said that they \"weren't supposed to 'set it up\", they did a good job of putting the stand on and picking it up and putting it on the stand. (did I mention that it's heavy?) The price did increase within two days of my ordering it.I recommend this TV very highly if you're looking for a really big screen and a quality product. By the way, I was not interested in the 3-D model.", "Date": "January 13, 2014"}, {"Title": "great tv and a good buy", "Author": "SETH MCCORMICK", "ReviewID": "RW5YBXAIB3EP2", "Overall": "5.0", "Content": "I was sure about buying a recondition but it's GREAT can't tell from a brand new one!! wish I could buy another one", "Date": "August 30, 2013"}, {"Title": "AWSOME TV 240HZ WOW What a Difference BUT POOR AMAZON DELIVERY", "Author": "ski", "ReviewID": "R1WE6DUXZKIK0H", "Overall": "1.0", "Content": "TV is fantastic however AMAZON dropped the ball on delivery. CEVA was awful, showed up 2hrs late, dropped the tv and ran. They were supposed to open it for inspection and take the boxes away, did they heck no, opened the huge box myself now I have to figure out how to get rid of the box. SHAME ON YOU AMAZON. Luckily the tv worked and im in HDTV bliss don't listen to the folks that say 120hz is sufficient. If your ok with super Nintendo movement get a 120hz, but with 240hz football has never looked better. ALso TV apps are useless they are missing amazon, BOOOO", "Date": "December 13, 2013"}], "ProductInfo": {"Price": "$3,299.99", "Features": "QUATTRON Color Technology: Exclusive Quattron color technology delivers a billion more colors, so you get a more powerful picture with brighter yellows, deeper blues, and richer golds. By adding 2 million yellow subpixels, Quattron creates a more realistic picture with greater detail and brightness - a feat that standard TV simply can't achieve.\nAQUOS 1080p LED Display: Using photo-alignment technology that's precision crafted to let more light through in bright scenes and shut more light out in dark scenes, the AQUOS 1080p LED Display with a 4 million: 1 contrast ratio creates a picture so real you can see the difference.\n240Hz Refresh Rate: See sharper, more electrifying action with the most advanced panel refresh rates available today.  240Hz technology delivers crystal-clear images even during fast-motion scenes.\nSmartCentral Smart TV with Dual-Core Processor & built in Wi-Fi: Sharp®'s intuitive Smart TV lets you quickly connect to your favorite content and instantly access apps like Facebook®, Twitter®, and YouTube®, plus streaming movies, music, games, and websites you love.\nSlim Design: The brilliant AQUOS® LED display is embraced by a striking new frame that's thinner around the screen and slimmer in depth, so it can fit just about anywhere.", "Name": "Sharp LC-70LE750 70-Inch Aquos Quattron 1080p 240Hz Smart LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51fagoUembL._SX300_.jpg", "ProductID": "B00CMP77DE"}}