{"Reviews": [{"Title": "We have a Winner!!! Best TV on the market", "Author": "Eric Nichols", "ReviewID": "R3PQA5T7365BE5", "Overall": "5.0", "Content": "I/we (wife and I) purchased/ordered this Sharp LC60LE750U from Best Buy on Sunday, September 29,2013 and picked it up on Wednesday, October 2, 2013.I was so blown away at the awesomeness of this TV, I went back to Best Buy and purchased a second LC60LE750U for our bedroom. Yes, a 60 inch TV in the bedroom...I don't do anything half way...LolThe only reason I did not buy this from Amazon is because of the price. Best Buy had a sale and was a few hundred dollars less than anyone, anywhere, but it had to be ordered as this model was not normally stocked.Okay, that being said, let me get into the details....We have been shopping around for the last couple of years for a new TV. We actually still have 2 CRT TV's (36 inch Magnavox and a 32 inch Panasonic - both weigh like 300 pounds each) that are well over 10 years old, but still had a lovely picture. I just could not justify spending over a thousand dollars on a TV.I mean, these new Smart TV's are getting updated constantly; seems like every 6 months, a newer, faster, bigger, etc. is being rolled out.Well, we had our minds basically made up on the Samsung smart TV's. We went to stores such as Sears, Best Buy, local electronic stores, ....heck even Wal-Mart.  We spoke to the sales staff (not Wal-mart staff though); I mean these younger people are so knowledgeable on what's in and out, what's coming out, what to stay away from, and what to be really looking at. Coupled with our own research, everything was pointing to Samsung, but Samsung is very proud of their smart televisions in terms of price. This pricing kept making the decision extremely difficult.Anyway, I started looking at other manufacturers and making hard comparisons against Samsung, and found that Sharp really had something going on. So in about late June or early July, Sears had some new Sharp TV's on their wall right next to the Samsung line. Well, the picture quality of the Sharp next to the Samsung was almost identical. Almost meaning Sharp was a little darker...hmmm but the other detail was identical. So I found out that Samsung ships their TV's video default set to a very bright dynamic picture.Bingo... I messed with the floor models of the Sharp TV's and when dialed up to other dynamic video settings, Voila!  Big difference from the Samsung; richer colors and a lot more reasonably priced.This Sharp smart TV also has the Quattron technology which means it incorporates Yellow into the color spectrum, and I believe Sharp is the only one that does this. So not only does it have the Red, Green, and Blue....it also has Yellow. In my opinion, the colors compared side by side to the the Samsung, as well as all the other manufacturers, this Sharp TV has a much more rich and vibrant image.So now my focus was turned toward the Sharp brand. I wanted to get a 240Hz as this is what is replacing the 120Hz, and all my research indicates that is where I needed to be considering. Even the top of the line Sharp 240Hz was still priced a lot more reasonably than even the Samsung 120Hz models.Anyway, here I/we are enjoying our new Sharp TV's. I absolutely would recommend this TV to anyone who is getting ready to make a big purchase. The quality and the picture are absolutely impressive!The menu settings are easy to navigate and easy to understand. The initial set up walks you through and confirms things like what is plugged into the back, internet settings, etc. The instructions are easy to understand, which also made setting up a snap. The TV is surprisingly heavy (though nothing like the old CRT televisions ...lol), so you would probably need a second person to help you lift it into place. The stand that comes with this TV is very sturdy so you don't have to worry about it tipping over.The remote is very straight forward and simple to use. The video input selection button is easily identifiable and makes switching from games, DVD player, Roku player, DirecTV receiver, etc. super easy. The dual core processor makes menu navigation very fast.The built in speakers, in my opinion are actually very good. I was worried that I would need to purchase a high end sound bar or other external audio system, but that can wait for now.  You can feel confident that right out of the box, you can rent a movie and actually enjoy it as the TV is equipped. I may end up getting a sound bar in the future, but for now, I am very satisfied with the built in speakers.So put your worries to rest. This Sharp TV is far superior to most of what is out on the market today; you will not be disappointed.", "Date": "October 6, 2013"}, {"Title": "A true LED TV competing with the best of them.", "Author": "P. Smith", "ReviewID": "R36212M3NNUAFI", "Overall": "5.0", "Content": "I sold my LCD because it put out so much heat.  I bought this one-inch thick TV \"Used - Very Good,\" saving $400 off list price.  After 3 hours of this LED on, the vents on the backside are at room temperature.  Also, the 240Hz is a must -- crystal clear on this TV.  Honestly, if you're hell-bent on finding some blur, you'll see a little bit once in a while during Blu-ray, but it's near perfect compared to 120Hz.  Oh, and the speakers are very realistic and loud with extra bass, not muffled like cheaper tv's (altho I use surround sound for movies).  The last thing I like is an auto-dimming feature, depending on sunlight in your room.  As the sun sets, the dimmer changes power consumption on the screen for the most energy efficiency, giving movies more of a \"cinematic feel\" at night time.  I turn this off because I like the bright colors no matter what.  Overall, I couldn't be happier.", "Date": "November 22, 2013"}, {"Title": "Great picture, great connection options.", "Author": "Stephen Parker", "ReviewID": "R24NT8H239U833", "Overall": "5.0", "Content": "Crystal clear picture after running calibration DVD on the picture settings. Side note... If you're going to use a calibration DVD be aware that they aren't used to a TV that has a yellow feed so the DVD will only get you close. After that its fine tuning to taste via viewing habits. Plenty of connection options and network functionality is great. Love this TV!!", "Date": "November 20, 2013"}, {"Title": "Sharp is better than Sony", "Author": "James M. Bensberg", "ReviewID": "R3802MRKWYIPSC", "Overall": "5.0", "Content": "This new Sharp 60\" with Quatron technology is an outstanding product which is sure to brighten anyone's living room with viewing pleasure. It is far superior to the comparable Sony.", "Date": "January 13, 2014"}, {"Title": "Great picture, terrible sound", "Author": "Warren Steffey", "ReviewID": "R3RGXHKJUK008M", "Overall": "4.0", "Content": "This is our second big screen, first LED.  Picture was very good right out of the box, but a simple adjustment to the backlight made it perfect.  The sound, however, is terrible, terrible, terrible.  None of the adjustments made it any better, but hooking up a pair of spare computer speakers via the headphone jack at least made it usable. Eventually we will purchase a sound bar.The list of tasks the Enhanced Delivery team were not authorized to do was revealed after we purchased the TV. Basically it was a stop and drop, and we ended up with an 85 pound $1,400 tv leaning against the wall.  By using the pillows from the couch I was able to attach the stand, then my wife and I (both in our 60's) lifted it up to our (tall) TV stand in three seperate lifts.  Scary, but we made it.  I had no problems with the hook-up, but be aware of the tasks the enhanced delivery team will not do.", "Date": "January 9, 2014"}, {"Title": "Wow !!!!", "Author": "CRIPPLE KING", "ReviewID": "R1CRGKUU8JWYC9", "Overall": "5.0", "Content": "Came perfectly Packaged, delivered  on time, beautiful picture, gorgeous TV, works great I love it best TV ever. Was overjoyed with the amount of extras that came with the TV with the smart Central", "Date": "November 27, 2013"}, {"Title": "Love it!!", "Author": "Bubbles", "ReviewID": "R2JCG34O24Z0RZ", "Overall": "5.0", "Content": "What can I say. Love it! Sound is a lot better than in past Sharp Aquos TV I have had. Picture is great and wifi set-up is very easy as well.", "Date": "November 20, 2013"}, {"Title": "Poor picture for a high price.", "Author": "Mark O Goodchild", "ReviewID": "R1GZLM1N630M47", "Overall": "2.0", "Content": "After owning an older, smaller Sharp TV that looked great for years, I tried to stay loyal and went for this set as my big upgrade. Unfortunately, from the very first moment I turned it on I was displeased. There was graphic streaking going right from the startup SHARP logo. I tried to convince myself it was of no issue since I just turned it on for the first time. But it never went away. The bigger issue was the color and blacks. The default picture setting (Dynamic Fixed) was terrible so I tried all the other preset calibrations. None of them \"just worked.\" I studied online and tried a lot of different recommended settings with no luck. I used the THX Tune Up app and still couldn't get this to look very good. My default test movie was \"Skyfall.\" From the very first scene when the first horn hits and Bond appears in the hallway, the blacks were incredibly grainy. I synced up my laptop and iPhone 5S along with the TV all playing the same thing, and although I will admit the detail and vibrancy at times was quite astounding on the Sharp, the blacks were often deplorable and the colors never seemed right. (I'm an audio engineer so I'm pretty strong when it comes to technical settings.) After three weeks and hours of trying different settings, system resets, and even a sub-par effort tech call with Sharp I've decided to send this back and go with the Panasonic ST60.My room conditions are overall average bright with not a lot of direct sun, but because I'm on a high floor I have no obstruction of light getting in. My TV service is Verizon FiOS. I also use AppleTV to stream Netflix and items from my iPhone.", "Date": "November 17, 2013"}, {"Title": "Worst Customer Service", "Author": "Ray M. Coates", "ReviewID": "R19NZFP82UW2AC", "Overall": "1.0", "Content": "I purchased the TV from Sam's Club and it stopped working after a month in a half. It is going on 2 months and Sharp has not fixed or replaced the TV. At first they told me a service man would be out within a couple of days. After a week I called the repair shop and was told the part had not come in. I then called Sharp and the customer service representative told me the repair man would be out the next day. No one showed up the next day. I called Sharp and they decided to replace the TV but none were available at this time and if they could not get one within 2 weeks they would upgrade me. That was a lie. Two weeks passed and I was told management decided that I should wait until they get a replacement TV. I will update if I ever receive a replacement TV.", "Date": "November 23, 2013"}, {"Title": "Amazon Prime will not work", "Author": "Sam", "ReviewID": "RU0U3716RPAGF", "Overall": "4.0", "Content": "We love the TV.The picture is incredible.The only negative is that Amazon Prime is disabled by Sharp.Something to do with licensing.We have a smaller Vizio that Amazon Prime works on.", "Date": "August 3, 2013"}], "ProductInfo": {"Price": "$1,799.99", "Features": "QUATTRON Color Technology: Exclusive Quattron color technology delivers a billion more colors, so you get a more powerful picture with brighter yellows, deeper blues, and richer golds. By adding 2 million yellow subpixels, Quattron creates a more realistic picture with greater detail and brightness - a feat that standard TV simply can't achieve.\nAQUOS 1080p LED Display: Using photo-alignment technology that's precision crafted to let more light through in bright scenes and shut more light out in dark scenes, the AQUOS 1080p LED Display with a 4 million: 1 contrast ratio creates a picture so real you can see the difference.\n240Hz Refresh Rate: See sharper, more electrifying action with the most advanced panel refresh rates available today. 240Hz technology delivers crystal-clear images even during fast-motion scenes.\nSmartCentral Smart TV with Dual-Core Processor & built in Wi-Fi: Sharp®'s intuitive Smart TV lets you quickly connect to your favorite content and instantly access apps like Facebook®, Twitter®, and YouTube®, plus streaming movies, music, games, and websites you love.\nSlim Design: The brilliant AQUOS® LED display is embraced by a striking new frame that's thinner around the screen and slimmer in depth, so it can fit just about anywhere.", "Name": "Sharp LC-60LE750 60-inch Aquos Quattron 1080p 240Hz Smart LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51fagoUembL._SX300_.jpg", "ProductID": "B00CMP77BG"}}