{"Reviews": [{"Title": "Nice TV. Good HD image quality but poor SD quality", "Author": "M. Paganini", "ReviewID": "RP3MYUQQJVDJ4", "Overall": "4.0", "Content": "Note: Please look at the end of this review for important updates.This unit is very similar in features to most sets in this class and price range. I paid $349 for it at a local store and believe that the sweet spot in terms of price/features for this TV would be somewhere under $400. I'll add details on the various features of this unit below.AppearanceExternally, this TV has a nice appearance with a glossy finish and thin bezels. It uses LED backlighting, which allows it to be thinner and lighter than the older LCD/fluorescent based units.The TV has some controls on the side of the unit (a nice touch, as it allows you to perform quick actions while setting it up). Another positive point (in my opinion) is that some of the HDMI connectors are on the back of the TV, allowing shorter HDMI cables and consequently less excess cable dangling from the back of your A/V rack/unit.Inputs & OutputsThis set has 3 HDMI inputs and a \"mixed\" component/composite input (meaning you can only use one or the other.) It also comes with a PC Input (D-Sub 15 pin), the usual RF input, two audio inputs and two audio outputs, being one of them optical.Of note is the USB connector input: When plugging a USB stick, the TV will read its contents and allow the playback of movies, music and photos. I normally don't use this feature on my TVs, but a quick test revealed that it cannot deal with H.264 content inside Matroska (MKV) containers (most TVs can't anyway.) I haven't tested music or photos, but assume it can play MP3s and display JPG files without problems. The USB connector is on the side of the unit, right next to some of the HDMI connectors.Image QualityImage quality for HD is pretty good, and viewing angles are very decent. However, SDTV sources display horrid images (blurry, with all kinds of saturation problems. I couldn't understand why this is so and tried pretty much every setting without much success. In short, if you use HD only, you're all set. For SDTV use (over composite cable, at least) I'd suggest another TV.Another interesting quirk is the display of closed captions: No matter what settings you try, it always displays text as if \"half a space\" exists between letters (in other words, the spacing between letters is too large.) It bothers me a bit, but I think I can live with it. Your mileage may vary.By default, the TV comes with the image settings set to \"Standard\", which has power saving mode turned on. This makes the image darker than it needs to be and is a somewhat silly setting in a unit that consumes only 11W of power. One of the first actions after the initial setup should be to configure your video to \"User\" and manually set backlight to 75% which should be good for most light levels without being excessive. This is, of course, a matter of personal taste. I also like to turn off all automated methods of adjusting brightness according to local lighting. I think most if not all TVs get this wrong and this one is no exception. Fortunately, this set provides a way to turn it off.SoundSound is somewhat tinny like most LED TVs (the case is too thin for powerful speakers.) This TV is somewhat better than the average and comes with two 10W speakers which should improve things a bit. I haven't tried to pump the volume up all the way to see where distortion starts yet.RemoteThe remote has decent sized buttons with a rubbery feel to them. I'm sure the lettering will rub off in a year or so, but I normally don't use the factory remote -- instead, I configured an old Harmony to use this TV (Logitech had no codes for this specific TV, but it allows you to \"teach\" the remote rather quickly.) I haven't tried it with the all too common DirecTV \"universal\" remote yet.Interesting featuresThe TV is very standard for its class and has no \"smart\" apps or network connectivity. It does however has a \"smart contrast\" feature which improves the display quality of certain programs (it can be disabled if desired.) It also can turn itself off in the absence of signal and has a \"Freeze\" button that will freeze the image on the screen until it's pressed again. This feature, despite interesting, is somewhat useless in these days of DVRs.60Hz only?Yes, this is a 60Hz TV only, and that's a good thing. If you never saw a TV with a refresh rate above 60Hz, believe me when I say it that anything above 60Hz is \"interpolated motion\" and will make all your movies look like camcorder made soap operas. If you don't believe me, google for \"LCD Soap Opera Effect\" and see what I'm talking about. 60Hz to 120Hz (and beyond) interpolation causes all kinds of horrible artifacts in the image and only improves certain programs for certain people. I have this feature on other sets and make sure it remains disabled at all times. If you truly believe you need 120Hz, go waste all your money on a much more expensive set and boast to your friends how your TV is much better than theirs because \"it has more Hertz to it\". :)ConclusionThis is a good TV for a bedroom or if you don't care much about any \"smart\" features found on higher end sets. Also, despite the good quality of image in HD, I couldn't recommend this set to people with SD sources over composite cable (I don't have a SD source with component, but believe it would be a bit better.) I substracted one star because of the quality of SD sources and the somewhat annoying spacing of the closed caption subtitles.I'd say this TV is a go for purchasing for any price under $400 (as of Jul/2013.)-- Update 2013-11-10 --After four months of very lightweight use, the TV stopped working completely. I called Sharp, they opened a claim and sent me a box with packing materials, instructions, and a pre-paid shipping label. Today (2013-11-24, four days after they received the set) I received a call from Sharp explaining that the problem is not \"fixable\". They gave me the option to process a return authorization from the place I purchased it or get a refurb.Pretty responsive customer service so far, but I wonder if this was a dud or quality control for Sharp has gone down the drain completely.", "Date": "July 21, 2013"}, {"Title": "Good Budget Buy", "Author": "Jim1978", "ReviewID": "R2M8GWPNKXEXLC", "Overall": "5.0", "Content": "Picked up this TV when it was $379.99 at Best Buy. I've had it a week and wasn't sure if I made a good decision or not, and if you're reading this you are probably asking the same question.There aren't many reviews for this set for whatever reason, so I figured I'd add whatever I can to help people out. Let's start with the design of the TV. Aesthetically it won't win any awards but it does have a pleasing look with the typical black matte finish. The most pleasing thing about he overall look of the tv is the thin bezel, which is harder to find in a tv of this price range. The stand is easily assembled with 4 screws and feels very sturdy. The screen isn't gloss but it does have some light reflection in bright rooms so proper placement and lighting can effect the picture more than other LCD/LED's I own.The picture quality on the set is really the most important aspect, and it's also where some points of contention might rise. I read numerous reviews of sharp tv's and some are known for having slightly off colors, most notably muted reds and deep blues. One review I read said this model does that exactly, and it may very well be the case, but in all honesty I can't notice it. The picture looks very vivid and once calibrated the colors seem quite good to me. If you're into perfection you may notice color issues more then me but honestly for the price the picture and color saturation is quite good. I had no problem getting flesh tones to look good and keep everything within a balanced spectrum.The biggest surprise I noticed on this tv was it's contrast ratio. It's amazingly good for being an LED tv let alone the price tag attached. It has some of the best blacks I've seen outside the high end plasmas and the whites reach a nice bright sparkle when needed. The tv has an \"active contrast\" feature that is sort of hit or miss to me. On some content it does make the picture jump that extra notch of realism, but overall I found it rather distracting and the greyscale color saturation seemed off on some scenes. Shadow detail also drops greatly with the active contrast on, so overall for the best realistic picture I'd disable it, but some might find it useful for certain content.The tv is 60hz and at 40 inches you are pushing the limits of where motion blur and judder really start to show more. This tv has the typical blur and judder you find in any ~37-42\" 60hz tv, and while some do handle this better than others, they will all suffer from it to an extent, so to me it's not really a fault of the tv or manufacturer. I can say gaming content etc.. is fine on this and I don't personally notice much judder or artifacting on fast moving scenes, but some people are more sensitive to this than others.As for the sound it's surprisingly good for the price. The two downward speakers put out a pleasing sound which can fill a room easily. So if you do have to use the tv's built in speakers and that is a concern then know they are are pretty good.So to conclude I feel this is a good budget tv for the price. You get amazing black levels, strong color saturation, and good sound. If you can snag this tv on sale for under 400 I think it'd be hard to do better. The closest competition there is the LG 39\" LN5300 and while it is a strong tv also, it suffers from the same motion issues this one would. The difference may be in the color rendition. There are no perfect tv's for this price range, but I can honestly say this is a good set for the price.", "Date": "August 21, 2013"}, {"Title": "Great low price set", "Author": "Bill McAfee", "ReviewID": "R1PJ9SEGB0US4O", "Overall": "5.0", "Content": "Love this set.  Replaced a 32-inch LCD unit that had problems with overheating in the living room cabinet we use.  This set runs super cool and looks great.  Shipping was quick, and the original packaging protected the unit well.", "Date": "October 2, 2013"}, {"Title": "Better than average, but with two issues", "Author": "George Pieleanu", "ReviewID": "R3L9QRFIRCLGK0", "Overall": "3.0", "Content": "Decent television if you can get a good deal on it (I paid $357.00 with shipping and taxes included in this price), but two somewhat annoying drawbacks. The first, which only happens less than 1 percent of the time and is temporary, is when the picture gets a weird \"squiggly\" quality to its resolution on certain images, most noticeable when looking at peoples' faces on-screen; that is, the contours of the face and body do not look defined - as in a solid line - but rather foggy, wavy, and grainy. Think of it like this; draw a shape - square, circle, triangle, or whatever - with solid, straight, sharp lines. Then draw the same shape with a shaky hand and the pencil barely touching the paper. And the worst part is, there is nothing in the settings that can fix this; I tried adjusting them for two days. Now, again, this is only noticeable on certain images  and usually only when there is slow movement.The other problem was that it does not come with any screws for the base, and you only find that out if you read the manual cover-to-cover and are lucky to notice the small sentence in there regarding this ridiculous oversight. I mean, how cheap and miserly is Sharp to not include an obviously necessary, yet very small and inexpensive part??? I had to search seven different hardware stores to find screws that were the proper length and width, and had the correct type of threading on them.Other that those two things it's an ok tv set. The sound is slightly above average, considering the size of the speakers, and other than the occasional issue that I've mentioned, the picture is pretty nice.", "Date": "August 27, 2013"}, {"Title": "Sharp is sharp", "Author": "Leo Tick", "ReviewID": "R85F0DVWD3SSN", "Overall": "4.0", "Content": "sound could be better need another component input terminal. Picture is excellent.Easy to set up but one need a magnifying glass to read manual.", "Date": "October 4, 2013"}, {"Title": "Sharp is having quality issues.", "Author": "A Writer", "ReviewID": "R2W79I0VT6576G", "Overall": "2.0", "Content": "This item came damaged. No it was not shipping damage, it was damaged when it was packed in the box. The top bezel was cracked and was dislodged slight so that the top of the LCD screen was exposed. Sharp used to make excellent TVs but recently their quality has slipped. In the past week, I bought two Sharp TVs that had to be returned due to problems and one that was OK.", "Date": "November 21, 2013"}, {"Title": "Only worked for one week", "Author": "Doreen Zautner", "ReviewID": "RJY3IMJY7KF6C", "Overall": "1.0", "Content": "I received this television as a gift and I was thrilled with it for the one week it actually worked. Then it would no longed display a picture or power off.  I contacted Sharp and they sent a box to ship to their repair center.  I was told it could not be repaired and they did not have any replacements in stock.  Later they offered me a refurbished TV which I refused.  Weeks past and no contact.  After yet another call, I was told they would send a TV but they wanted a credit card number, which I refused to give them.  They had my email and yet I only received updates on my case if I initiated a phone call to Sharp's repair center.  After 2 months, I finally received an email stating that my \"unrepairable\" television had been repaired and was being shipped.  I received the TV and it was not repaired and is just the same as when I sent it in for repair.  This is my first experience with Sharp and it does not reflect well on the company.  What happened to companies standing behind their products?  I'm right back where I started, contacting Sharp yet again.", "Date": "January 5, 2014"}, {"Title": "Great picture and sound for a great price (with some fiddling)!", "Author": "Scruffy Mcblueballz", "ReviewID": "RG9SYWFQ5KTXQ", "Overall": "4.0", "Content": "Well I got this tv 4 months ago from Best Buy after having them price match Amazon. Out of the box, I was disappointed with the picture.However, after adjusting the sound and picture settings, it's almost perfect! Understand, I got this TV for $350. Don't expect a flawless experience for that price. One flaw that I have noticed with the picture is this blue shadow or hue every now and then, usually during quick motions. I also notice some ghosting. But, I am still VERY happy with this tv despite those two nitpicks. These small drawbacks are by no means a deal-breaker for this TV. It is a solid unit and I recommend it for its incredible value. The design is very sleek, slim and pleasing to have in my bedroom. For reference, I have it hooked up to DirecTV via HDMI.Pros:1) Slim, Sleek, Light2) 3 HDMI Ports3) Headphone port (great for external speakers)4) USB media playback (Videos, Music, Photos)5) Decent Remote6) Decent sound for an LED TVCons:1) Takes some fiddling to get best picture & sound2) Occasional blueish shadow or hue outline around people during fast-paced motionsFor those of you that complain of the picture and sound quality, then just follow my settings below and you'll have awesome picture and sound in no time!Picture Settings:AV MODE: DynamicOPC (auto adjusts backlight based on light in room): OFFBacklight: 70-100 (I'm at 100)Contrast: 37Brightness: 50Color: 27Tint: 0Sharpness: 8Now go to advanced:Color Temp: StandardActive Contrast: OffDI Film Mode: AUTOExtra Credit: Press View Mode on remote and set it to \"Dot-by-Dot\". If you like what you see keep it, if not then just leave it at \"Stretch.\"Audio Settings:DynamicTreble: 30Bass: 16Surround: OnAnd......you're done! Enjoy your new tv!", "Date": "December 22, 2013"}, {"Title": "Great LCD TV with good quality picture", "Author": "Aamir Syed", "ReviewID": "RQ0KP9U1EWL77", "Overall": "5.0", "Content": "Great LCD TV for our bedroom with good quality picture. Shipping was fast and safe, we love it and thinking about purchasing one more for my sons bedroom.", "Date": "November 21, 2013"}, {"Title": "Not too many beefs with it but a couple", "Author": "djjeesh", "ReviewID": "R2Y08SP5R9LMMF", "Overall": "4.0", "Content": "So far I'm only annoyed at:1. When you use the antenna to watch tv you have to hit the display button a few times to figure out what's on. Some TVs are a little better at telling you what's currently on and what's on next. Also, probably the more annoying thing is that on other TVs if I wanted to watch a station I could hit 4 and it would automatically go to 4-1. When you hit 4 on this TV it will go to channel 4 and of course nowadays there's nothing on that ch 4 anymore. You have to hit ch up or type in the full 4-1.2. Playing video files from USB is a great feature. If you have the right type of format (I've tested standard def and hi def MKV files with no problem) you can save yourself from buying something like a WDTV. However, if your file is wider than 16x9 (like a lot of feature films) it will play at 16x9 stretching it, or play it in 4x3 squishing it, or zoom in on your video. None of these 3 format options show it how it should be. If you decide to make your own video files, I would suggest making your own black bars to make your cinema wide file a 16x9 file.", "Date": "August 29, 2013"}, {"Title": "Great quality, and it's wonderful to have three HDMI ports.", "Author": "Mike M", "ReviewID": "R3NFKN8MVY91AT", "Overall": "5.0", "Content": "Great quality, and it's wonderful to have three HDMI ports.  Nice not to have to worry about that 120hz picture-smoothing crap, too.", "Date": "November 5, 2013"}, {"Title": "For a Better View", "Author": "Judy", "ReviewID": "R3D371E6X059NM", "Overall": "5.0", "Content": "I compared several options for a 40 inch TV.  The Sharp says it with its name. It definitely offers clarity of picture, is easy to use, can be accessed by android phone ( a handy feature when the 18 month old grandson hides the remote).  I would recommend this product to anyone.", "Date": "January 14, 2014"}, {"Title": "Nice TV", "Author": "J. Werner", "ReviewID": "R1MA6JS1QWOS05", "Overall": "5.0", "Content": "If you're looking for a nice TV at a good price, this is it.  If you're looking for a TV that has a good picture, good sound, and all the basic necessities without wasting time and money on extra bells and whistles, you can't do any better for the price.", "Date": "January 13, 2014"}, {"Title": "Works great but, all non HD video stinks, and are out of focus", "Author": "Steve Donato \"sailor.in.florida\"", "ReviewID": "R37HG0WM96JQXM", "Overall": "4.0", "Content": "Unfortunately this is a problem with all LCD  TVs, which is why I still give it 4 stars. LCD TV's (for some reason) cannot play non HD videos clear, regardless of, back lit,front lit,edge lit, etc.  I understand Only the older technology (not too old) PLASMA TV's can play non HD video fine.", "Date": "December 28, 2013"}, {"Title": "Great deal", "Author": "George J. Vernau", "ReviewID": "R2YEF6X35PL7OA", "Overall": "5.0", "Content": "Very good deal on a very nice tv. Low priced but still very good quality. I bought this for our lakehouse and we don't have any HD signal but the standard definition signal still shows up quite nicely on this TV. I would recommend it to anyone who wants a good basic tv.", "Date": "December 25, 2013"}, {"Title": "Sharp Brand", "Author": "shoe fanatic", "ReviewID": "R1GWGHK6OPUGIQ", "Overall": "3.0", "Content": "Well this was a replacement television for a previously owned LG 42 inch tv that started having intermittent on and off problems.  This TV is VERY SHARP.  So much so, that in some cases it distorts the picture of faces to some degree.  So far, I only find this with commercials so I don't care.  Nice picture quality.  I didn't even adjust out of the box, just left it the way it was factory set.  Purchased a Warranty because nowadays these t.v.'s don't last that long.  This is in my bedroom, so the fact that the sound is not that great is alright by me.  I wouldn't recommend it for any other room in the home unless you enhance the sound.  Otherwise, a decent purchase for what I paid here on Amazon.  Couldn't find a price anywhere better.", "Date": "November 27, 2013"}, {"Title": "TV for living room movie/tv watching only", "Author": "Nicholas Wright", "ReviewID": "R1MVELEYKOIFLX", "Overall": "3.0", "Content": "As long as you are in HD on regular tv channels, the TV looks great.  When I try to play videos on Prime, Netflix, or Hulu the TV distorts and looks very grainy in high def.  I have yet to try video game systems on this TV yet and frankly am afraid to do so.  I would not recommend this TV for anything other than channel watching.", "Date": "November 23, 2013"}, {"Title": "BIGGER is better", "Author": "Kevin Preston", "ReviewID": "R34QRG37BNBA1E", "Overall": "5.0", "Content": "It's a sight for sore eyes.  I only use this with my computers.  I like it because it helps prevent eye strain- letters are nice and BIG.", "Date": "November 18, 2013"}, {"Title": "functional, with limits", "Author": "aged parent \"Scott\"", "ReviewID": "R17CW5U91FGH0X", "Overall": "4.0", "Content": "I am probably not using this for the intended function: we use it as a visible computer monitor in our conference room.  It is light weight enough that we could set it on a monitor stand, but the vesa holes are not compatible with any monitor stands I have found, and the wall mounts won't work for where we would like to mount it.  So, not 5 stars.  It worked well out of the box, and the sound and picture are certainly more than adequate for our needs.", "Date": "October 30, 2013"}, {"Title": "Nice picture.", "Author": "cecil kelts", "ReviewID": "R461YSHRZ2DAO", "Overall": "5.0", "Content": "Great tv great price would tell others about it and purchase another one .We have bought this product in the past in different Size.", "Date": "October 7, 2013"}], "ProductInfo": {"Price": "$549.99", "Features": "Full 1080p LED Display\n4M:1 Dynamic Contrast Ratio\nThin Bezel Design\nPowerful 20W Audio,3 HDMI\nTV without stand (Width x Height x Depth): 36-3/8' x 23.0\" x 9-1/8\", TV with stand (Width x Height x Depth): 36-3/8\" x 21-1/2\" x 3-1/2\"", "Name": "Sharp LC-40LE550 40-inch 1080p 60Hz LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51PERYdlXwL._SX300_.jpg", "ProductID": "B00C9Y2NDM"}}