{"Reviews": [{"Title": "Samsung UN65F8000, Very, Very Good", "Author": "Jimmy D. Tracy", "ReviewID": "R3S5821H5QK04Z", "Overall": "5.0", "Content": "Basically got 2 TV's for the price of one.  The 29\" will be a nice addition to our fifth wheel.The real purchase was the Samsung UN65F8000.  I would suggest reading the CNET and other technically proficient reviews for the real scoop, but I will say the TV is magnificent.  It has the deep blacks and colors that are generally reserved for plasma TV's, which is what this one replaced.  The off angle viewing is okay for an LED but not a concern in our living room.  It does have some reflections from our bank of windows which are on the opposite wall from the TV but is easily corrected with our blinds.  Most of the time we don't bother because it is not that bad.I am certainly not an expert in TV's so I followed the calibrations settings I found on CNET and some other sites.  All were for the movie mode but my wife did not like any of them.  We found the natural setting to be our favorite.  At first I didn't realize that each picture setting has it own calibrations but when I figured that out I started playing with the settings for the natural mode and really like the results.  I'm sitting here watching the Ohio State/Michigan State game and what a beautiful picture.  I can't say much about the sound as I run my satellite thru our receiver and surround sound.  I ran an Ethernet cable from my modem so we get good results from the smart part of the TV.  Some of the kids shows we have run from our Amazon Prime app for the grandkids have been flawless.  I programmed my Logitech 650 remote to handle all my functions as I am familiar with it and found the Samsung remote to be a bit confusing, for me.Basically, this is a very good TV.  It is a bit pricey and probably not for anyone wanting a plug and play or maybe not willing to spend some time getting it set right.  I've spent a couple of weeks getting it where I wanted, a little at a time.", "Date": "December 7, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DOAHH7W"}}