{"Reviews": [{"Title": "Bad description", "Author": "A & J", "ReviewID": "R15GT3LDBGY8W3", "Overall": "3.0", "Content": "As a TV, this model is actually not bad. Unfortunately Amazon is advertising it as a 3D LED TV which is outright wrong. There is no 3D, unless your considering the Length x Width x Height of the tv itself or the box it came in. I could have gotten a smart TV this size for the same price or cheaper. This is the first time I've trusted Amazon on a tech purchase without doing a bit of legwork, they've never let me down before. All this after waiting a month and a half because they back ordered it after I bought it! I'm sure Amazon will return it but that's extra trouble for me and we already donated our old TV. Would I have to go another month and a half + return shipping time and processing? Probably...Update: After a call with Amazon and some thought, I've decided to keep it. It's already installed and isn't a bad picture at all, plus we would likely have to wait for another one. Amazon issued a small credit for the mistake and will be changing the description (hopefully sooner than later). I'll chalk it up as a reminder to do my own research before I make a tech purchase online.", "Date": "October 24, 2013"}, {"Title": "It is what it is.. and that's good", "Author": "Amazon Customer \"ultrapenguin\"", "ReviewID": "R2KSC2J7RITBDY", "Overall": "4.0", "Content": "Great TV for the price. Only has digital audio out, no headphone jack. Perfect size for my home office. The Samsung 32 I bought from Costco for the same price had NO audio out at all.", "Date": "November 27, 2013"}, {"Title": "Lower price on Bestbuy.com", "Author": "Demond Davis", "ReviewID": "R3UDFLT6KA9ACD", "Overall": "5.0", "Content": "The LG 32in TV is awesome.  Great display and quality.  However, this product is listed on Best Buy.com for $249.99!!!!", "Date": "December 12, 2013"}, {"Title": "A great TV", "Author": "Matt", "ReviewID": "R1C73LPVNGOBYL", "Overall": "5.0", "Content": "I bought this TV for my brother for Christmas. I hooked it up just to test it and make sure everything worked well. The TV is not bulky at all and the stand seems sturdy enough that one bump on the TV table wont knock it over. The color on it is vivid in 1080p so its a perfect TV for gamer's such as my brother and I. The sound is great on it as well. Some TV's you have to turn up more than half just to hear what people are saying but not with this one the sound is perfect. All in all its a great buy for any gamer's bedroom or game room. Nothing bad about it as far as my opinion goes.", "Date": "December 23, 2013"}, {"Title": "great product using it right now", "Author": "Dave", "ReviewID": "R2RTWSF5G4QCEZ", "Overall": "5.0", "Content": "it arrived on time in great condition was as described. have it hooked up to a computer with full surround sound it is awesome.", "Date": "January 6, 2014"}, {"Title": "Avoid this TV", "Author": "Dan", "ReviewID": "R2I26UKGE8LHB4", "Overall": "1.0", "Content": "This TV suffers from a known LG power supply issue.  The screen will go dark and then come back on sporadically.  When this does happen there is no control over the function of the TV.  You can not turn it on or off.  LG's solution is to plug it in to another plug in your house and if that doesn't work they have you contact a local technician to attempt a fix.  While customer service is good, it does NOT make up for an inferior product.  This has been a huge hassle over a inexpensive screen.  Do yourself a favor and purchase something else.", "Date": "February 21, 2014"}, {"Title": "Great TV for the price", "Author": "LeAnn", "ReviewID": "R14NASL5WJW0KB", "Overall": "4.0", "Content": "It has a very nice picture and is a good size for a bedroom. The only complaints we have are that it took a while for us to find the right settings to make the colors look good for us and there is a horrible glare on the screen at times, even with blinds on the windows. Overall, we're very happy with it and I don't think I could have gotten anything better for the money I spent.", "Date": "January 12, 2014"}, {"Title": "i am satisfied", "Author": "steven daley", "ReviewID": "R2FGUHN83ODKPX", "Overall": "5.0", "Content": "Beautiful picture, decent enough sound but I do recommend getting a soundbar.  I couldn't ask for more given the reasonable price.", "Date": "December 30, 2013"}, {"Title": "Best tv I have ever purchased.", "Author": "Johnmrrs", "ReviewID": "R3N5ADQ706ZZS5", "Overall": "5.0", "Content": "I have a large Samsung tv in my living room and was going to go with another one for the bedroom but I saw this 1080p Lg on sale during black Friday for 249.99 and desided to take a chance. The picture is amazing I really couldn't believe how well my ps3 games look on it. Some reviews talking about it not being a 3d tv It wasn't listed as one when I bought it but yea give this tv a chance and you will thank yourself.", "Date": "December 27, 2013"}, {"Title": "Would be great if it worked", "Author": "Nicholas Steven", "ReviewID": "R1H6OETVWFUA9Z", "Overall": "1.0", "Content": "What an absolute piece of s***. The TV was great, had an amazing picture, and I was loving using the thing as a monitor.3 days of use and it starts randomly turning off, then back on for a split second, then off. At first I think maybe the HDMI port is bad? I get enough time in between one of its fits to switch it over to the other input. Still doesn't work. Maybe the cord? Use another cord... still bad. Maybe my video card is being wonky? Nope, everything checks out, swapped to my old monitor and it works great.The TV seems to be ok/last a little longer if I have it on the highest eco-setting. Is this some sort of power issue? I barely leave the thing on and I run it in standard, not to mention it's PLUGGED INTO THE WALL. What a piece of junk, stops working after three days.", "Date": "January 14, 2014"}, {"Title": "Love those LG TV", "Author": "Nancy still", "ReviewID": "R1WXTDEZSOQTFJ", "Overall": "4.0", "Content": "This the only brand that I buy. This makes my second one. Show a great picture and have all the hook ups I need.", "Date": "April 5, 2014"}, {"Title": "Best TV Ever Owned", "Author": "Jeff", "ReviewID": "R352MR42SEAMR", "Overall": "5.0", "Content": "This TV by LG is great. Images looks great. Size is great for both watching TV and gaming. I would recommend this for any room in the house.", "Date": "March 8, 2014"}, {"Title": "great picture", "Author": "A. Delaney", "ReviewID": "R2UIJ67SG237YS", "Overall": "4.0", "Content": "This was given to me as a gift and I love the picture. Would have given it 5 stars, but the manual could be better for guiding the final setup and picture adjustments. It took a while to figure it all out and was more trial and error than easy, smooth process.", "Date": "February 28, 2014"}, {"Title": "Very pleased", "Author": "Kathy K", "ReviewID": "R187I0H5KMV2R8", "Overall": "5.0", "Content": "At first, we thought this size would be too large for the room, however, after ordering a 24\" we opted for this one. Because the new TVs don't have as large of a frame profile as the old TVs, this one provided the right size for our wall cosmetically.As far as the quality of the TV itself, we are very happy with the picture, sound, etc. The LEDs are so much nicer than my older LCD and mounting the unit on the wall is extremely easy due to the light weight on the LED.I have had good experiences overall with LG products. I have a LG washer/dryer and LG Kompressor vacuum. All have been very consistent for years of use.", "Date": "February 27, 2014"}, {"Title": "LG TV good value", "Author": "JB GeGe \"Avid Reader\"", "ReviewID": "R2MJ5HDHYHA3PE", "Overall": "5.0", "Content": "Really nice TV with a great picture. It has good color and is clear. The sound is excellent.  It was easy to set up and program. Excellent price. Fast shipping also.", "Date": "February 24, 2014"}, {"Title": "another great LG  buy", "Author": "Dameion R Helfrick", "ReviewID": "R1LD2PB2YM8N3Z", "Overall": "5.0", "Content": "2nd LG TV and both are great. This one has the 60hz processor which is fine for the 32\" display. Crystal clear and easy plug and play set up.", "Date": "February 21, 2014"}, {"Title": "Great Television", "Author": "Nick B \"Nick\"", "ReviewID": "R22LO9U4A3M9X9", "Overall": "5.0", "Content": "I purchased this to replace a 32\" television of a different brand which did not last even a year.  This tv is great.  The picture is very clear and you can tell it is a quality LG product.  The sound system in this television is noteworthy.  One would think the sound was coming from a much larger system.  I would definitely purchase again.", "Date": "February 15, 2014"}, {"Title": "Crystal Clear", "Author": "Mike J. Cianciosi \"Mike\"", "ReviewID": "RDZQ4017FXQ10", "Overall": "5.0", "Content": "Bought for my son for xmas. He loves it and plays xbox on it. Would consider another one for me.", "Date": "February 10, 2014"}, {"Title": "Great free tv", "Author": "Steve Wade", "ReviewID": "RO9J6OW7LGRG1", "Overall": "5.0", "Content": "I bought it for my mom. She loves it. The picture is great. She uses a $12 antenna and has great free tv in the Detroit area..", "Date": "February 10, 2014"}, {"Title": "AWESOME PRODUCT", "Author": "paulette_2003", "ReviewID": "R3OQS4M2NFVXEB", "Overall": "5.0", "Content": "great tv. came in a timely manner as expected. it has crisp and clear pictures and sound is great. very satisfying and a great investment. I love this tv and was a great price for the product itself. good for bedroom or small living room. shipping box came in great shape and was safely packaged.", "Date": "February 9, 2014"}, {"Title": "OUTSTANDING LED 32\" TV", "Author": "CAW", "ReviewID": "R1JZBIJVXPV84L", "Overall": "5.0", "Content": "This tv has great connectivity.  It connects to all my peripherals.  Screen quality is excellent.  Built-in sound is good quality.  Installation instructions were clear and simple.", "Date": "February 8, 2014"}, {"Title": "Brilliant gaming monitor!", "Author": "D. Schaumann \"dannyS\"", "ReviewID": "R3C3EKCOLRU7I4", "Overall": "5.0", "Content": "This is one sharp 32 LED panel for the price of lousy 27\" monitors. I use this via HDMI to extend my W8 desktop, and after some fiddling with picture settings I cannot be happier. I tend to prefer increased sharpness on and medium warmth for work, while cinema and gaming mode are very much perfect for their intentions. This TV is a steal for little bit over $200. It also still manages to look very trendy on top of a dark office furniture.", "Date": "February 1, 2014"}, {"Title": "Nice TV", "Author": "Cathy", "ReviewID": "R6UJSW0HXYKHB", "Overall": "4.0", "Content": "Nice picture, not the greatest sound.  There was lots of buzzing when there was more bass (even from a person that has a lot of bass in their voice).  We had a technician look at it while under warranty.  With suggestions from us, because he didn't have anything that would really fix it, he removed the back and took some foam pieces that we had and blocked them into the empty spaces to stop the vibration of the back panel.  We think that Vizio has the best sound on their LED TVs.  The LG really needs a sound bar.", "Date": "January 31, 2014"}, {"Title": "a Nice tv with a few simple flaws", "Author": "Tim", "ReviewID": "R2AN6FVZL4V61B", "Overall": "4.0", "Content": "Ok to tell my story i have to start at the beginning. I bought one of these tvs on black friday and opened it after christmas at my family's house. 5 days later, the tv died, ( no sound no audio). After checking everything i called LG who was in fact very, very helpful. They had a repair guy come to my house 2 times, (with different parts to try and fix it) to no avail, so Lg gave me a new tv. All in all Lg has wonderful service and even if you come across problems, they will take care of you, and pretty quickly.Ps-my only complaint is that the cable and hdmi sockets on the back of the tv, come right out of the back of the tv, meaning you cannot hang the tv flat on the wall if anything is plugged in to those 2( who doesnt use hdmi and cable connectors on their tv?)", "Date": "January 30, 2014"}, {"Title": "LG television", "Author": "Vicki L. Ham", "ReviewID": "R2JDCDU4N3YS7P", "Overall": "5.0", "Content": "I bought this television to use in our guest bedroom.  It is a nice size for a bedroom and doesn't take up a lot of room. I would highly recommend this product.", "Date": "January 29, 2014"}, {"Title": "LG TV", "Author": "William P. Yerzyk", "ReviewID": "R32YC4MOAA4DZ5", "Overall": "5.0", "Content": "Picture and sound excellent. Size perfect fit in my entertainment unit. Cable and HDTV inputs easily hooked up and function properly.", "Date": "January 27, 2014"}, {"Title": "Best price and great quality", "Author": "V H Butterfield \"Retired\"", "ReviewID": "RE07C44546L7E", "Overall": "5.0", "Content": "I shopped all the major sellers and this was the best price.  It was a gift for my daughter and they love it.  It was connected to a Sony WiFi Blu-ray player and so the 1080p resolution was perfect.  Don't need this resolution if you just watch tv or satellite as they broadcast in 720p.", "Date": "January 25, 2014"}, {"Title": "Astounding!!!", "Author": "Chris", "ReviewID": "R1VW37YVAZXDPA", "Overall": "5.0", "Content": "Wow, this tv, I've had it already for I wanna say about 2 months already... this tv is amazing, the picture quality, the settings, easy to use, the sound is superb, I'm always getting yelled at to lower the volume when its only like at 15 lol, LG never ceases to impress, I recommend this tv in your room, if you want a bigger tv for the living room look under LG though, these guys know what's up when it comes to home entertainment!", "Date": "January 22, 2014"}, {"Title": "LG 32 inch LED tv", "Author": "R. A. Macgregor \"StreetRod\"", "ReviewID": "R133MUY73F5XV8", "Overall": "5.0", "Content": "Hard to beat for the money. I had problems hooking it to Directv but that's not an LG problem. (It finally worked)If I  could have anything I would ask for a SD card slot in the side. The USB port can be tapped but it is at the rear.", "Date": "January 22, 2014"}, {"Title": "pain to use with hp pc", "Author": "william lasher", "ReviewID": "R37KVJZ8DM9W1L", "Overall": "3.0", "Content": "spent another $70.00 on Chords & adaptor to use it as a monitor. Then it cut of my external surrond sound so that won,t work.wish I had my older vizio back. you should let people know it can'i work well with usb port systems. Mine is a newer hp pc", "Date": "January 17, 2014"}, {"Title": "great Christmas gift", "Author": "Greg OConnor", "ReviewID": "R12A8TIU025VNF", "Overall": "5.0", "Content": "It is more TV than my daughter was hoping for Christmas at a pretty good price. We all were very happy with this purchase.", "Date": "January 17, 2014"}, {"Title": "Great price!", "Author": "Robert Fields", "ReviewID": "R1329EKMVTDABV", "Overall": "4.0", "Content": "Great HDTV for the price. Bought it as a gift for my son to put in his room and he loves it.", "Date": "January 17, 2014"}, {"Title": "Good Shape!!", "Author": "Jose Samuel Mejia Perez", "ReviewID": "RGRQ34NWSDMM1", "Overall": "4.0", "Content": "Good definition, sound all about it is really good!, is not a smart tv but is perfect for his function.", "Date": "January 13, 2014"}, {"Title": "Thanks for having it to us in time for Christmas.", "Author": "Sarah R. Brown", "ReviewID": "RZF0OH6Q777GE", "Overall": "5.0", "Content": "It is Perfect size for our grandkids room and very clear. Great quality. Thanks for having it to us in time for Christmas. Our grandkids love to watch TV in their room.", "Date": "January 9, 2014"}, {"Title": "Fantastic  TV", "Author": "Ladybug", "ReviewID": "R13RAWZ7WYOUON", "Overall": "5.0", "Content": "I bought this TV for My son for Christmas and he love it.The color is bright and vivid,the sound is perfect too,Overall A great TV at a great price", "Date": "January 5, 2014"}, {"Title": "Awesome deal!", "Author": "Reese :)", "ReviewID": "R2OSGTHI8KTPBJ", "Overall": "5.0", "Content": "We bought this TV as a Christmas present for someone and we were very pleased with the outcome!  The picture was crisp the sound was great also.  We couldn't measure the spot where the TV was going to placed so we had to keep our fingers crossed.  Fortunately it was the perfect size for the placement of the television.I did have a little trouble finding out whether or not it had cc for the hearing impaired but overall it was a great buy.  By the way, it does have cc for the hearing impaired, thank goodness!", "Date": "January 4, 2014"}, {"Title": "perfect for the price", "Author": "lisa5698 \"Lisa\"", "ReviewID": "R2FZFF8JFX1O0C", "Overall": "5.0", "Content": "Exceeded my expectations. I bought this TV on Black Friday and it was really inexpensive. It is great and actually rather attractive. I like that the frame is thin around the screen. Really fits with my minimalist style.", "Date": "January 3, 2014"}, {"Title": "Excellent Tv", "Author": "Tecnomundo", "ReviewID": "R2AJHT66ORA4ET", "Overall": "5.0", "Content": "Is a 1080p fullHD with all pros of a hdtv but in a small size, very thin, very stylish so bright!!", "Date": "December 29, 2013"}, {"Title": "A quality 1080p hdtv", "Author": "L. Moccia", "ReviewID": "R1A3Q9EBRXEHMT", "Overall": "5.0", "Content": "Quality product in this price range, especially for a top name-brand.  While not a \"smart tv\" or 120hz, this tv is full of features that should satisfy most video/audio tweakers.  Connected to Xfinity hd service using an RNG200N box (1080i) and hd channels look great to me (even the 720p ones).  Also using a WD TV Live (1080p) and high-quality videos from the computer look fantastic.  Can't go wrong with an LG product!", "Date": "December 21, 2013"}, {"Title": "great tv", "Author": "Wyatt Bryson", "ReviewID": "RO0C64Y6F4YJR", "Overall": "5.0", "Content": "i hate that there weren't any real discounts on TVs. i was looking for an awesome deal. i however also have noticed a ton of bad reviews on a ton of different televisions from various vendors. i also asked around locally to friends. the LG was said to be trusted and some other names were said to be avoided so i found a balance between quality and price. i am not disappointed with my purchase. i would recommend this product and this vendor. my only complain is it is not internet ready but it never claimed to be so that was my fault. it's all good though, i didn't really need that function anyway. if i choose to get another tv for the living room however i will want to get one that is wireless so i can play my xbox from the next room without having to cable it up.", "Date": "January 11, 2014"}, {"Title": "A  Very good basic 32\" TV", "Author": "Philinbos", "ReviewID": "R28I38HFOMM0L1", "Overall": "4.0", "Content": "We do not have cable, nor do we plan on getting it. We read the reviews before ordering this unit, so we knew what to expect. The clarity and crispness are adequate. After coupling it with a digital antennae, we receive all the channels we expected to and more. The buttons on the remote are large enough to read, and find, however the buttons on the television itself  are located on the back of the unit giving the front a nice clean look. This may prove problematic if our daughter's Dog eats this remote, as she has 3 or 4 already.In conclusion, we are quite satisfied so far...By the way, The sound and volumne is very good,  There are inputs for the antennae ( screw on) one square output, labeled optional digital audio out and 5 plugs, 3 for a VCR and two labeled mono audio in. It does not appear to me that we could have both a VCR and a Roku  connected at the time, however I could be mistaken... The stand is solid and sturdy, so no fear that a cat will knock it over... Our St Bernard Might be a different story- time will tell!", "Date": "December 29, 2013"}, {"Title": "Not sure if was packaged wrong...", "Author": "caryzoo \"caryzoo\"", "ReviewID": "R24OAXTB1ZMJBW", "Overall": "2.0", "Content": "Just the box dumped in my driveway, no outer packaging. This died two weeks ago, returned it. Very easy and simple return process. It was a Christmas present, it lasted less than a month....", "Date": "February 4, 2014"}, {"Title": "great product", "Author": "Jon", "ReviewID": "R2YN5QJJB9991E", "Overall": "4.0", "Content": "exactly what i was looking for, would like to have seen a little cheaper sense none smart. works great, looks great easy to use and hook up.", "Date": "February 3, 2014"}, {"Title": "TV in my bedroom.", "Author": "vanhafner", "ReviewID": "R58J5C4E0AZIT", "Overall": "5.0", "Content": "Pros I like:SLEEP TIMER! (My last tv had none, so I woke up often forgetting to turn it off from the night before.)GREAT PICTURE! Father recently purchased a larger Aquos for his living room and I personally think this is a much better picture.LED, 2 HDMI, VGA, USBThe stand seems very sturdy. Don't think I'll need a wall mount, but may invest in one soon. Also many features I haven't used yet.Cons:Hmm, nothing I can see. LG hats off. Great shipping and arrived in good packaging.", "Date": "February 2, 2014"}, {"Title": "Came in just in time for the Super Bowl", "Author": "tigersbh", "ReviewID": "R1Q5MSCCGHXR4P", "Overall": "5.0", "Content": "I waited until a football game came on so I could look for any kind of smearing. I was a little worried about the 60 Hz refresh rate. However, I had nothing to worry about it. This tv gets a great picture, plenty of brightness, and no smearing. I heard that there might be a problem with glare on the screen but I don't have any. Maybe the lighting in this room just works out.The only problem was that the stand did not come with all of the screws. I took the stand to the hardware store and the guy just shook his head. He said it happens all the time, and not just with LG. He was able to hook me up and I was in business.", "Date": "February 2, 2014"}, {"Title": "What a steal! You get what you pay for, and this makes a nice monitor", "Author": "Speckk", "ReviewID": "RM4UA1NJTJGDS", "Overall": "4.0", "Content": "Good luck finding many other 1080p monitors between 24\" and 40\" in size, let alone for $250. Yes, you can't really see 1080p when watching HDTV or movies, but I bought this to use as an oversized monitor, just as much as a TV and gaming screen. Good luck seeing many pixels or a full webpage on all the cheap 720p TV's and 15\" low resolution laptops.My 3.5 quibbles with this HDTV so far are as follows- The sleep sequence requires me to press the power button on the remote, instead of just waking up when I start using my keyboard. It would be nice if it could pick the HDMI signal return up from my computer.--- Even worse, when it powers back on, it moves all my windows around on Windows 7 and I have to rearrange and resize them.- All the buttons are hidden 3\" into back right frame. This makes menu navigation without the remote practically impossible--- As a result, when I turned it on the first time and it came up in Cable TV mode with blasting loud static noise, it took a few minutes to shut the dumb thing up. Good thing that was a one time problem.That said, good luck finding a mid-range quality TV/monitor that performs this well.*People have expressed concern about the sound dropping out on a similar LG HDTV model, requiring a TV reboot to fix and service calls to fix. You'll hear back if I have any trouble here.", "Date": "January 1, 2014"}, {"Title": "intput and outputs hold it back", "Author": "Chad Richardson", "ReviewID": "R3B4FHPQ7Q0ZT5", "Overall": "3.0", "Content": "The set up is easy and the navigation with in the tv is simple to use.  A challenge that I knew going in after doing my research is the lack of inputs and outputs.  There are lower end tvs that you can connect anything to and this is going to require a little more specialization to do that.  I did buy it it a chrome cast though so much of the plugging I was doing with a VGA on my older set is now done via the that.", "Date": "December 13, 2013"}, {"Title": "Not happy", "Author": "Peter \"pjopie\"", "ReviewID": "RMSDIUHQ9N0BL", "Overall": "2.0", "Content": "Just purchased this tv and set it up to my Verizon HD box, i'm not at all happy with the picture on the HD channels, I see no difference from a regular channel then to a HD channel. I got this because LG is a good name but I think this is going back.", "Date": "August 29, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "You won't believe your eyes. LG's LED technology delivers amazing brightness, clarity and color detail.\nGet nearly double the pixel resolution of standard HD with Full HD 1080p resolution.\nGetting your picture looking great is easier than ever with Picture Wizard.\nTV without stand (Width x Height x Depth): 29.1 x 17.2 x 3.1, Inches, TV with stand (Width x Height x Depth): 29.1 x  19.6 x 8.2 Inches", "Name": "LG Electronics 32LN5310 32-Inch 1080p 60Hz LED TV (Discontinued by Manufacturer)", "ImgURL": "http://ecx.images-amazon.com/images/I/41n18NozcVL._SY300_.jpg", "ProductID": "B00DQHZXQA"}}