{"Reviews": [{"Title": "Sometimes size does matter", "Author": "Greg \"zen_greg\"", "ReviewID": "R39Q0VDEUVOAPE", "Overall": "4.0", "Content": "I've been using this television for a few weeks now and I really enjoy it.  If it wasn't 90 inches, however, I am not so sure I would be so thrilled.  The picture quality is there but for some reason I haven't been able to tweak it to the point that I like it as much as my 60\" Samsung plasma or even my old 40\" Sony XBR.  I don't suppose you buy this T.V. expecting to beat Samsung or Sony quality (I know I didn't).  You buy this television because it is really, really, big.  I am using this monster in a setup that requires the normal viewing distance to be around 25'.  Works great for that purpose in a way that even the 60\" Samsung looked like a postage stamp.  Viewing angle is best head-on but then again, at 90\" it is hard to find too many places in the room where you are looking at it from the side.  Haven't used the 3D as of yet but I am not a big fan of 3D television so I will leave it to others to discuss.  In all, very happy with my purchase.", "Date": "September 27, 2013"}, {"Title": "very bad crosstalk(ghosting)in 3d mode", "Author": "lionel", "ReviewID": "R3TIV92M5ZPSAN", "Overall": "2.0", "Content": "Let me just start out by saying if you are looking for a large screen tv for viewing 3d blu-rays,I would not recommend this tv,the crosstalk(ghosting)is very bad(enough to cause serious problems with your eye's)We have talked with sharp for three months over this issue and they have gone as far as to bring another tv to our house for testing(that tv had twice as much ghosting as compared to the tv we have now).First they said it was normal,then the tv tech replaced two circuit boards,then they had a tv tech bring us another(same model#)to test,they won't admit to having issues with the 3d mode(and not many people are complaining about it)mabe because they don't use the tv for 3d or the people are just too blind to see it.I have no problem with the normal 2d mode(it does show a pretty good picture)but dealing with customer service is a joke with sharp and their technicians act like they have never seen a 3d tv before nor repaired one before,sharp says that these panels are almost crosstalk free(they lie)these tv's are not using new boards(they are the old boards from late 2011-early 2012)these boards are the same that were used for the previous generation that had serious crosstalk issues(don't just believe what I'm saying look at cnet and other online reviewers)I have wasted my money on this tv when all I ever wanted was a tv with good 3d picture.If 3d is not what your looking for then this tv will be alright for you but if your a 3d gamer or movie fanatic then I would spend my money on a different name brand besides sharp(besides the fact that the customer service and their tv techs are clueless and unhelpful and sharp does not want to admit that they have a problem)that alone should turn you off of these tv's.Model #s657u,757u and 857u all have very bad crosstalk in 3d(before you buy, check the tv that you like with the I-max disc under the sea)this tv will show in the beginnig of the credits not one not two but three images in each name)almost as if you have your 3d glasses off(Yep!it's that bad)I also use a 3d benchmark calibration  test disc that can show how bad the crosstalk actually is =18% so the choice is yours,I'm only writing this because I'm still fighting to get this issue resolved,that and I hope nobody falls into the same place I did(buying a 3d tv for 3d and getting screwed out of my hard earned money)", "Date": "February 24, 2014"}, {"Title": "GOT MINE UP AND MOUNTED YESTERDAY...OH YEAH", "Author": "orandy", "ReviewID": "R88FW1LVWZKJM", "Overall": "5.0", "Content": "Now my 55-inch may have had a better overall resolution, but nothing beats the size of this thing. The picture is fantastic, especially after you apply the finishing touches by fine tuning your settings.I actually got mine online for several hundred dollars cheaper at BuySquad, a company I highly recommend. Delivery was fast and coordinated. I got the 1-year manufacturer's warranty, then bought an extra 2-years through BuySquad, I even got an extra year thrown in free. With installation, all toll I'm over 8-grand, but this is my 50th birthday present from my wife... so \"book em' Danno\"!It was mounted last night where my old 55-inch Samsung was. They then mounted that same Samsung upstairs where our 32-inch Samsung used to reside, now the 32-inch is my computer monitor.Although this television is the size of a dining room table, it surprisingly still manages to maintain a slim and stylish physique. Kudos to Sharp for easy setup and a well designed menu. I easily added this TV to my Logitech universal remote, after I deleted the Samsung. As far as viewing distance goes, Sharp demoed this TV at only a 7-foot distance. However, our love seat is positioned 12-feet back, and only JLO has a better figure than this baby.I am extremely happy and I plan to test drive a 3D movie soon. Size is king, and this TV is such a stand out, you're always both aware of and impressed by it's overwhelming presence.UPDATE: 3D MoviesI had to order a 3D bluray player, and I found one on Amazon, the Samsung BD-F5900. This television comes with 2 pairs of 3D glasses. Once the 3D bluray loads onto the \"start menu\" screen, all you have to do is press and hold the button on the glasses for a couple seconds. Then the glasses come on and a 3D menu appears on the screen, prompting you to put the glasses on... that's it!It's a very simple process and the 3D images are nothing short of crystal clear, amazingly life-like, and utterly spectacular. Sharp has really done a remarkable job with this set. I couldn't be happier. I hope this review helps those who are looking into purchasing this television. It's been a huge investment but worth every penny. I take my hat off to Sharp for pushing the envelope and exceeding my expectations on every conceivable level.", "Date": "January 25, 2014"}, {"Title": "Back from the future", "Author": "Amazon Mummy", "ReviewID": "R7VOCE1H88XKQ", "Overall": "5.0", "Content": "Hi, This is me traveling through time. It is now year 2015 and the TV is now worth only $600. But I still love it nonetheless.", "Date": "June 4, 2014"}, {"Title": "Mine's Bigger Than Yours", "Author": "tvtv3 \"tvtv3\"", "ReviewID": "R1QRU9YSYO8SND", "Overall": "5.0", "Content": "I recently had some remodeling done in my house. I decided that since the world is such a mean, cruel, and horrible place, I didn't want to look at it anymore. So, I replaced all of the windows in my house with these 90 inch SHARP LC-90LE657 SMART LED 3D HDTVs. Money wasn't an issue because of all that gold I own after killing that leprechaun last March. Now, I no longer have to look at that stray cat attacking the birds and squirrels in my backyard or see those flying insects buzzing around during the summer and hitting against the glass or watch the lovely widowed Mrs. MacDonnell prepare for her evening bath. With these 90 inch SHARP tvs, I've tuned it all out. I use the Internet on these suckers and have all my groceries and necessities delivered to my front door. I've got Netlfix, Hulu, and HBOgo so I have no worries about missing any of my favorite tv shows (love me that GAME OF THRONES). I've never liked people very much so now I don't even have to interact with them. I mean, I work at home designing home security systems and Internet privacy software so all I have to do is email, text, and call people. Now that I have replaced all my windows with these 90 inch SHARP tvs, unless there is some catastrophic disaster I don't think I'll ever have to see a real-life human being. For a hermit like me, that's pure bliss.", "Date": "April 17, 2014"}, {"Title": "\"Mega\"pixels", "Author": "cmd", "ReviewID": "R154OKL3OHI9GC", "Overall": "3.0", "Content": "First to state the obvious: this screen is enormous.While there is something to be said for the theater feel, I would probably pass on this device and wait for 4k if I had the luxury of time.That said, it definitely brightens up our conference room. ^^", "Date": "April 18, 2014"}, {"Title": "A Big change", "Author": "Cagney & Lacey's WebSquad", "ReviewID": "R3H504FEY7CZU", "Overall": "4.0", "Content": "And I do mean big. It is new in the house so I reserve one star until I have the opportunity to try out all of its features. So far/so good.", "Date": "February 3, 2014"}, {"Title": "Awsome", "Author": "S. Siemiatkowski \"LegiaFan1\"", "ReviewID": "R2IJ7FMTPT3FAS", "Overall": "3.0", "Content": "Did anyone buy this TV with the Farudja Video Optimizer? I did and would like to compare the experience with it.", "Date": "January 20, 2014"}], "ProductInfo": {"Price": null, "Features": "Refresh Rate: 120Hz (Native); AquoMotion 240 (Effective)\nBacklight: LED (Full Array)\nSmart Functionality: Yes - SmartCentral\nDimensions (W x H x D):  TV without stand: 80.8'' x 47.7\" x 4.5'', TV with stand: 80.8'' x 48.9'' x 17.1''\nInputs: 4 HDMI, 2 USB, PC input, RS-232C, MHL\nAccessories Included: 2 pairs of Bluetooth 3D glasses, Universal Remote", "Name": "Sharp LC-90LE657U  90-inch Aquos HD 1080p 120Hz 3D Smart LED TV", "ImgURL": "http://ecx.images-amazon.com/images/I/41ikpvz43mL._SX300_.jpg", "ProductID": "B00DBYE1ZM"}}