{"Reviews": [{"Title": "Great tv for the price, excellent upgrade from a tube tv!", "Author": "HaCk_ThE_pLaNeT", "ReviewID": "REHAF45JYAWM7", "Overall": "5.0", "Content": "I bought this tv at a massive retail outfit based out of AR, and have it mounted on my wall. [It was an upgrade from a 20 inch tube tv.] The picture and sound are good.It does not have the internet apps, but I knew that before I bought it.  I paid less then what Amazon.com is charging for it.. [$198 ] before sales tax..Note to Amazon... this is not a 3D Tv.. per Vizio: hxxp://store.vizio.com/eseries/e320b0e.html", "Date": "November 14, 2013"}, {"Title": "Excellent", "Author": "Kishan Ahir", "ReviewID": "R2LMMJU7X79H52", "Overall": "5.0", "Content": "i love it!!!! very good for the price. some channels did not work but i updated the firmware from the website and now its working like a charm........ don't listen to the bad reviews because vizio released an update so that there are no problems with the channels. just go to the support website and download the new firmware for this model TV and put it on a USB flash drive and then install it on the tv..... hope this helped!!!!", "Date": "December 7, 2013"}, {"Title": "Needed Firmware upgrade", "Author": "Cueball03106", "ReviewID": "R7YN6H6NCQE74", "Overall": "4.0", "Content": "TV worked ok until you shut it off, but then \"forgot\" the scanned channel(s).  This is using a digital cable box that changes the channels, so the TV only needs to remember 1 channel, the cable input.  I had to do the firmware upgrade described in the vizio web support page.  This fixed the problem.  But seriously - why should I have to do this on a brand new TV out of the box?  Very frustrating on Christmas day.  :-(", "Date": "December 26, 2013"}, {"Title": "Wish I had gotten tv locally", "Author": "K. Brumm", "ReviewID": "RRKX18D7MVAJ", "Overall": "2.0", "Content": "After I set it up for my husband's Christmas present it did not get all of the channels as the previous set!  Sometimes it bips off (sound it makes) and a no signal comes up even though it is a standard station.  Ugh!", "Date": "December 31, 2013"}, {"Title": "REVIEW OF VIXIO E320-BOE TV", "Author": "linda f ledford", "ReviewID": "REXT6YAIJUVHU", "Overall": "2.0", "Content": "No manual controls provided except on-off. If remote fails there is no way to control volume, change channels, adjust picture. etc. Otherwise this is an exceptional bargain,", "Date": "December 26, 2013"}, {"Title": "Turns itself off in the middle of movies", "Author": "R. Tipley", "ReviewID": "R1G130JZHI8CY", "Overall": "1.0", "Content": "Set-up: S-Video for connection to cable box and DVD/VCR, and HDMI for ChromecastWe've never (yet) had a problem while viewing a regular TV/cable show, BUT intermittently and unpredictably during either Chromecast viewings of Netflix or playing a DVD movie, the TV will suddenly turn itself off.  It is VERY annoying!!I downloaded and installed a new driver from the VIZIO, and it didn't fix anything.  I tried a few suggestions on setting, from postings I've seen on the 'net, and that didn't help.  It doesn't just happen on bright screens or on scene changes.  It doesn't matter whether we have the power cord straight out of the wall plug or through a high-quality surge protector.  That it never turns itself off during normal broadcast TV is odd, so I assume the higher quality video from DVD and Chromecast is a factor.After trying the firmware upgrade, I called VIZIO support and the best he could suggest was changing which HDMI input we plug Chromcast into (didn't help).  The TV was a gift, so we can't even send it back.", "Date": "April 4, 2014"}, {"Title": "Do not buy", "Author": "S Haring", "ReviewID": "ROGEQPPPBV7R7", "Overall": "1.0", "Content": "I bought this as a Christmas gift for my inlaws and approxmately 1 - 1.5 months from Christmas it stopped working. Will never buy again!", "Date": "March 21, 2014"}, {"Title": "because it fit", "Author": "Ron", "ReviewID": "R1H15KDQYN8WM3", "Overall": "4.0", "Content": "Although we have 2 other Vizio TVs in our house, the main reason I purchased this one was because of its dimensions.  I wanted the biggest TV that could fit in the area were it was to go. This one made it into a 28.5 width cabinet, barely.  All other TVs were wider by  a quarter inch or more.  This TV will not be used this much, but I wanted to replace the last tube TV in the house with a flat screen, making all  seven TVs in the house flat screens.  I also had to contact Vizio to get an updated memory stick to reprogram internal data, because the TV would not work at first, so that took a week before the TV worked properly.  Color and picture are fine, and all seems to be okay now.  Our first 40 inch Sony flat screen cost $3000.00, so $250.00 for this 32 inch TV was a deal for the size.  Just like all electronics, time and mass production has brought the cost down to reasonable prices.", "Date": "January 9, 2014"}, {"Title": "Great value, but has some disappointing qualities.", "Author": "J. Palmer", "ReviewID": "R38MHJ2JIU5S7T", "Overall": "4.0", "Content": "We bought this TV to upgrade our older Vizio 22\" in our bedroom. The picture is great, especially after adjusting the brightness, color, etc. We were extremely disappointed in a few items: 1: The is only one physical button to turn the tv on and off or switch inputs. You better have your remote with you if you walk across the room to turn it on, because if the volume is too high or its on the wrong channel, you are SOL. 2: You can't activate the sleep mode with one button like our older model can. You have to actually open the menu, navigate to sleep mode, and toggle the different times. Which means if you want to set the Sleep timer, you will need light to find the menu button, and your glasses to find the correct setting. There's no way to verify that the sleep timer is on without repeating the process. 3: I don't like the new remote at all, it's a shiny rectangular slab. The old one fits your hand much better and looks better, as well. So, we kept the old remote. No biggie. 4: There aren't as many inputs, especially HDMI as our old one. Other than that, it's a good brand and tv for the price!", "Date": "March 6, 2014"}, {"Title": "Dead on arrival", "Author": "Gabriel Orellana", "ReviewID": "R284Z1IIIHK5YU", "Overall": "1.0", "Content": "this arrived broken, with the screen really messed up, so a note to the packageers, mailers or any other hand who handle this, please take a little bit more of care with it...", "Date": "February 26, 2014"}, {"Title": "Sweet TV!", "Author": "Camille Wasek", "ReviewID": "R3AU5X0WG3DQV4", "Overall": "5.0", "Content": "I LOVE my tv. The quality and sound are great. Totally fits the description that was written. Would recommend to anyone.", "Date": "February 4, 2014"}, {"Title": "Christmas gift for my mom", "Author": "expertrifleman", "ReviewID": "R3JVIG2QLX9ZEZ", "Overall": "5.0", "Content": "she had a hard time switching from the old to the new, but she loves it now. Worth every penny as long as you are not after 3D, ect...", "Date": "January 28, 2014"}, {"Title": "Vizio TV", "Author": "Linda Geragosian", "ReviewID": "R261ZJE0IE7FSQ", "Overall": "5.0", "Content": "This was a Christmas gift for are son and his family..The picture is beautiful and the sound is great..They love it", "Date": "January 23, 2014"}, {"Title": "Great tv!", "Author": "rpgmaker", "ReviewID": "RF1B1FJVB9DDK", "Overall": "4.0", "Content": "I can't believe I bought this for grand total 198$ in amazon (no sales tax or shipping). This is a steal, the quality is great a couple of things that costed it one star though: you can't play videos from the USB port, just watch pictures which is kind of a letdown. The other is that there are not manual controls on the tv as another reviewer said, so if you lose the remote you will need to buy another in order to get most of the basic functions except turning it on and choosing the input (which you can do from the single, power button on the TV). Since I always planned to use this tv in conjunction with my laptop those two aren't deal breakers for me.", "Date": "January 19, 2014"}, {"Title": "great tv", "Author": "Lynn Kelley", "ReviewID": "R2QKE2GDTQ78S8", "Overall": "5.0", "Content": "excellent color and easy to use I purchased it for my3 year old grandson for us to cuddle in my loft andwatch old timey cartoons.", "Date": "January 16, 2014"}, {"Title": "Great TV & would purchase again", "Author": "Rick", "ReviewID": "R32RY4J80Q1BO5", "Overall": "5.0", "Content": "This television was received a few days late as were many other shipments this year.The television arrived in good condition including packaging. The TV was easy to assemble and was up and running in minutes. Would definitely purchase again.", "Date": "January 13, 2014"}, {"Title": "Lightweight TV, great picture...volume too low", "Author": "M. Rodriguez", "ReviewID": "R1UKFIYWXY1VA6", "Overall": "3.0", "Content": "I purchased this TV for my daughter for Christmas present. She loves the picture quality but complains, a lot, about how low the volume is even at it's highest settings.", "Date": "January 6, 2014"}, {"Title": "sounds and colors", "Author": "blanco", "ReviewID": "R3BRM6100CP110", "Overall": "4.0", "Content": "the sound don't reach my expectations and colors need more brights the size is good but the storage for shipping is very fragil", "Date": "January 6, 2014"}, {"Title": "The quality and sound is as described", "Author": "jerry", "ReviewID": "R25OGJJQCI25G", "Overall": "4.0", "Content": "I like the tv however, i am disappointed because when I purchased the tv the description said smart and i thought it was. Because of that I cant use it fully as yet until i can get a smart device", "Date": "January 1, 2014"}, {"Title": "Super TV", "Author": "Karen Wilson", "ReviewID": "R1ESIDOU4YHT6I", "Overall": "5.0", "Content": "Bought this for my son for Xmas and I am officially the best mom in the world. We don't have our Direct TV attached, he is just playing games on it.", "Date": "December 31, 2013"}, {"Title": "It did what we expected", "Author": "James Hall", "ReviewID": "R2IJOUJJ4C6VD8", "Overall": "5.0", "Content": "It has the inputs and outputs that we needed, and picture and sound are excellent.I would rec commend it to others.", "Date": "December 30, 2013"}, {"Title": "Christmas present find", "Author": "Tina Lilly", "ReviewID": "RCC4IIVQYFSA1", "Overall": "3.0", "Content": "The back plastic part is sort of cheap the wall mount cracked the back  of the tvWe fixed with adhesive and is now working . Picture is fine.", "Date": "December 28, 2013"}, {"Title": "good tv", "Author": "John R Peck", "ReviewID": "R3F0K9XJJSRIPZ", "Overall": "4.0", "Content": "works great and looks goodbut had a little trouble setting it up.got it working good now and it works great", "Date": "December 26, 2013"}, {"Title": "looking for a good TV this is one", "Author": "Jacobi", "ReviewID": "R1HLEOFYWPKHSH", "Overall": "4.0", "Content": "this TV came in very good condition I bought the Samsung Smart TV and it's a good its a good gig", "Date": "December 26, 2013"}, {"Title": "great tv", "Author": "telling the truth", "ReviewID": "R38GYCMJNMXGOK", "Overall": "5.0", "Content": "make sure to get a swivel mount because the plugs are all on the back. If you have a stationary mount it's hard to access the connections.", "Date": "December 25, 2013"}, {"Title": "Vizio E320-B0E 32 Inch 720p", "Author": "Arden Wright", "ReviewID": "R1BSBRHZ0V4MVR", "Overall": "5.0", "Content": "ProHigh QualityGood PictureAverage SoundEasy to set up and useGood PriceConRemote control while easy to use is limited to the Vizio TV onlyViewing angle is narrower than expectedSound quality could be improved", "Date": "December 13, 2013"}, {"Title": "Vizio 32\" 720p 60Hz LED TV", "Author": "kimie zajac", "ReviewID": "R2Y10MDOOGSDEW", "Overall": "5.0", "Content": "Great tv, beautiful colors use it as a monitor for my Lorex 8 camera security system when I switch it to 1 camera it looks like I'm looking out my window and when I have it on the 8 cameras for viewing I don't have to strain to see the viewing area of the 8 cameras. The tv is superior with the bright colors and hi def even at 720p. Check at your local store and you'll see and then purchase from Amazon  Thanks Again  Amazon", "Date": "December 13, 2013"}, {"Title": "It's okay", "Author": "Karen J. Eller Baker \"ellerbaker\"", "ReviewID": "R1U4W34XYN0PK5", "Overall": "5.0", "Content": "Was a good idea, but the TV has some bugs in it. If you hit the wrong button, you will need to reprogram it. Seem with technology to day you should be able to just go back. Not the case in this model. Has beauitful picture", "Date": "December 12, 2013"}, {"Title": "32 inch Vizio", "Author": "laurie miller", "ReviewID": "R3V938TYFI6SGA", "Overall": "5.0", "Content": "I love my new TV, the picture is great and sound meets my expectations.  Very easy to set up and was able to hook my DVD player to it easily!!", "Date": "December 10, 2013"}, {"Title": "Channels didn't work right.", "Author": "Wilma J. Norris", "ReviewID": "RNB2VKBGFSSBS", "Overall": "2.0", "Content": "We bought this from Best buy over Thanksgiving per internet sales.  Was delivered fast, and after we set it up and scanned all the channels in, that is when nightmare started.  I would surf up through channels and when I hit golf channel it would come on then disappear and go black as well as hallmark, animal plannet and tcm.  When you tried to manually put in another working channel it would revert back to hallmark that would black out as well.  So I spent on hour on phone with tech who walked me through stuff and they said they couldn't fix it and I could take it back or they would sent a repair man out in 6 days.  It was a new series so we said we would take it back.  Best buy refunded whole amount and we walked over to the shelf and got a insignia for same price.Vizio appeared nice and sound was great, just had channel problem and we didn't want to deal with that.  Might have been a fluke we got the bad tv but if you get it for someone for Christmas you might want to check it out.", "Date": "December 7, 2013"}, {"Title": "Nice TV for the money", "Author": "Jordan", "ReviewID": "R2OHLSUXYKLF0F", "Overall": "5.0", "Content": "I bought this TV for my step dad when he got diagnosed with colon cancer. Figured he'd need something better than a little 20 inch CRT (is that the right word for those TVs?). Set it up with a roku and the picture on it is crystal clear. Almost looks better than my 42 inch 1080p Vizio that I bought last year. Unfortunately, my step dad hasn't got to use it much because he's been in the hospital from complications of his surgery.", "Date": "January 27, 2014"}, {"Title": "Great 32\" VIZIO HDTV for the price", "Author": "Daniel R. Kinney \"danno50ny\"", "ReviewID": "R2NFJB8DYBLFHY", "Overall": "5.0", "Content": "My old 32\" HDTV bit the dust a couple of weeks before Black Friday. Not good, but just in time for all the great deals on Black Friday. So I started to do some research. I found this VIZIO on sale at Target. But it was not available through Target on their website. You had to go to a store on Black Friday to get this HDTV at this price. I did some more searching and found the exact same 32\" VIZIO HDTV on Amazon about a week before Black Friday. I added it to my wish list and figured I would wait until Black Friday to see if I found a better deal. I browsed all the ads in the paper and on the internet and could not find a better deal on a name brand HDTV. So I bought this one on Amazon (No sales tax and no shipping). I found this same VIZIO HDTV at my local BJ's for the same price $198.00, but I would have had to pay sales tax. My VIZIO HDTV arrived last Wednesday as promised and I couldn't be happier. It is very light weight and a very SHARP and CRISP picture. It was very easy to setup and within 10 minutes it was up and running.PROS: EverythingCONS: NothingEven at the regular price of $248 it is still a good deal. If you see this on sale at $198 jump on it.", "Date": "December 8, 2013"}, {"Title": "Smart tv????", "Author": "Rachel Hardesty", "ReviewID": "R3PC8X301BGQQZ", "Overall": "3.0", "Content": "Thought this tv was a smart tv that allowed access to the media.  But, I have tried to configure it through the settings but cannot get it to work.", "Date": "January 9, 2014"}], "ProductInfo": {"Price": "$245.55", "Features": "LED delivers richer colors and more vivid details\nSlim frame design for a more immersive picture with less frame\nUp to 50% more energy efficient than conventional LCD TVs\n720p HD resolution for high definition clarity", "Name": "VIZIO E320-B0E 32-Inch 720p 60Hz LED TV", "ImgURL": "http://ecx.images-amazon.com/images/I/51NWp%2B%2BiXxL._SY300_.jpg", "ProductID": "B00ESZJ3K6"}}