{"Reviews": [{"Title": "What a disapointing product by Samsung", "Author": "Sabre39", "ReviewID": "R2K43OFIAZCDHS", "Overall": "1.0", "Content": "I got this at Walmart just the other day for $398, got home and set it up in my living room. I was first pleased with how great it looked, nice clean design, the depth of the tv was a bit more then I expected but it is surprisingly light for a 39\" tv. After watching tv and playing games for a bit I notice that the colors looked a bit off and went into the picture settings and found it only had three presets, movie, standard and vivid. Now I always cycle through the presets and then do fine tune abutments after the fact, but all the presets were bad. I just couldn't get the picture to look right everything looked washed out and over saturated and if you adjusted the over saturation out the picture was too dark. Also in the settings the TV has \"game mode\" which only makes the picture look blurry and helps with nothing and \"Motion processing\" which is apparently is to help with motion blur and fast action on the screen but dose nothing as well. Don't buy into the \"120CMR\" crap as stated it a 60hz panel and not a very good one at that, I've seen good 60hz tv's that produce a far superior image then this tv could ever do. Viewing angles are poor, the image looks ok but how the tv produces the image on the panel produces a double vision effect if your not sitting closer to the center of the tv. Sitting to the left or right of the TV on the edges of the TV I could see the image twice and could look past the top panel of the tv to the image being produced inside the tv. In closing the options menu in an insult to your inelegance with how limited and how little change take effect changing the sliders. You can tell this is a very half harted attempted by Samsung. I know this is an entry TV from Samsung but if you need a good entry TV go with something like a Vizio", "Date": "December 16, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00E2U3N6C"}}