{"Reviews": [{"Title": "Connection information:HDMI, VGA, YPbPr, COAXIAL, AV Audio/VIDEO,PC Audio Headphone & RF", "Author": "Amazon Customer", "ReviewID": "R1DSF60UX8C7WF", "Overall": "3.0", "Content": "This rating is to provide you with the connections information not provided by Amazon:HDMI, VGA, YPbPr, COAXIAL, AV Audio/VIDEO,PC Audio Headphone & RF. From side panel of box.", "Date": "November 25, 2013"}, {"Title": "Good quality for the price.", "Author": "H. Brandon", "ReviewID": "R3L4QPCQ48OXL7", "Overall": "4.0", "Content": "Picture is fine.  Sound is a little \"tinny\" but can be improved by adding a set of quality speakers.  DVD player is a little stiff to load and eject.  Overall it is a good television at a really good price and meats my needs for a second set.", "Date": "November 16, 2013"}, {"Title": "Good picture. terrible sound!!!!", "Author": "craig", "ReviewID": "R2TGF7G3PEZC9H", "Overall": "3.0", "Content": "Picture is good...Dvd player makes noise.  But the sound quality is terrible. Kids tv and they even said sound is bad!!!!!!", "Date": "December 2, 2013"}, {"Title": "My first TV", "Author": "Xichao Wang", "ReviewID": "R1SFI55C491RRV", "Overall": "4.0", "Content": "My first tv. The price is affordable for a student like me. Before the tv arrived, the price went down and I got the refund of the difference, which is very cool.Have not got my cable yet, hope I will get one next year. Now I am watching The King of the Rings. The picture and the sound are pretty good.", "Date": "November 8, 2013"}, {"Title": "I guess you get what you pay for.", "Author": "Mr Koko \"Mr Koko\"", "ReviewID": "RO3K16PTWEAUZ", "Overall": "2.0", "Content": "Sound quality is horrible. Sounds like a cheap transistor radio from the 60's. Proscan is suppose to be RCA's high end line. Had me fooled!", "Date": "November 15, 2013"}, {"Title": "great flat panel for the price", "Author": "Brendan Ballard", "ReviewID": "R3TFDEVJLCVJB8", "Overall": "5.0", "Content": "For the price everything worked perfectly on the tv. We have it mounted in my daughter's play room and it has been constantly looping dvds without a problem. Picture is good, sound is kind of tinny but acceptable.", "Date": "December 15, 2013"}, {"Title": "Not worth the money or trouble", "Author": "A. Santiago Jr.", "ReviewID": "RAZS2395BBRKI", "Overall": "1.0", "Content": "Received it in time for a Christmas gift.  The HDMI port does not work, tried two different HDMI cables.  The sound is worse than a small transistor radio.  Bought some Logitech PC speakers that sound much nicer.  Returned the TV because the HDMI port does not work, received a replacement in two days and same thing.  No luck with the HDMI port.  We called the Proscan customer support number, and after being on hold for 10 minutes, it hung up.  Called back, after 15 minutes a guy answers and says to call back in an hour!  This was at 9 pm at night, so I'm surprised first of all that anyone even answered the phone.  If I can find a box to send this other one back, I will also return it.  Next time I'll stick to a good brand name.  Only bought this one because it has an internal DVD player and it was cheap.  You really do get what you pay for.", "Date": "January 8, 2014"}, {"Title": "Crisp image. Distant sound.", "Author": "P. W. B.", "ReviewID": "R3AQKQNF7FGQZW", "Overall": "4.0", "Content": "As others have said in their reviews, the sound issue is immediately obvious. It sounds as if you're sitting in the back seat of a car and listening to the radio with only the front speakers activated; clear, but distant. It's still a great value for the price, especially when connected to good quality home theater speakers. The DVD player is easy breezy and super convenient.", "Date": "January 8, 2014"}, {"Title": "Wouldn't buy another one", "Author": "Linda", "ReviewID": "RTZTL9M88S1O4", "Overall": "3.0", "Content": "It's OK but the picture really isn't what I had hoped. The setup was simple and it did arrive promptly but I won't purchase another of this brand.", "Date": "April 19, 2014"}, {"Title": "Very cheap tv - you get what you pay for...Speakers are bad", "Author": "MyBlueMoon", "ReviewID": "R3V69ABQR2W6AE", "Overall": "3.0", "Content": "Probably gave this three stars because of the cheap price but when you see Vizio or other Smart TV's going on sale for close to this price for the same size or bigger, you kinda wish you would have spent $40 more for a smart tv with better speakers.  This does come with a DVD but it is all pretty cheap.  Worth the price that is about it.", "Date": "March 20, 2014"}, {"Title": "Very good deal", "Author": "Jessie", "ReviewID": "R3IRSXFBNVAAL0", "Overall": "4.0", "Content": "I wanted the TV& DVD to use in my camper This size will give more space and the price was reasonable", "Date": "February 15, 2014"}, {"Title": "NOT TO SHABBY!", "Author": "DAB", "ReviewID": "R3AJCZKGGFXBT4", "Overall": "5.0", "Content": "THIS THING DOES THE JOB AND WAS WORTH THE PRICE....NO COMPLAINTS SO FAR WORKS WELL AND PICTURE LOOKS GOOD...OBVIOUSLY ITS A DVD COMBO NOT A BLURAY....A GOOD ASSORTMENT OF DIFFERNT VIDEO HOOK-UPS IN BACK..PERFECT FOR A WORKOUT ROOM, KIDS ROOM OR KITCHEN...I MOUNTED IT WITH THE UNIVERSAL WALL MOUNT FOUND ALSO ON AMAZON FOR $30 BUCKS WHICH ALSO CAME WITH A HDMI CABLE....BONUS!", "Date": "February 8, 2014"}, {"Title": "no issues", "Author": "michelle", "ReviewID": "R203A2POW3JV3T", "Overall": "5.0", "Content": "Bought this even though the reviews went great.  I needed a tv while visiting my parents for a month.  I don't have any issues with the volume as other reviewers stated.  The dvd player is a little weird while ejecting and putting in dvds. Overall for the price it is a decent tv.", "Date": "January 25, 2014"}, {"Title": "Sound quality is bad!", "Author": "Carol Mallory", "ReviewID": "R29FPTFWS2Z9EQ", "Overall": "3.0", "Content": "The TV itself is fine.  The problem is the sound quality which is really \"tinny\".  I've adjusted the bass and treble, but still have an unacceptable sound quality.  Must be a cheap sound system in it.", "Date": "January 4, 2014"}, {"Title": "poor picture, poor sound, dvd player did not work", "Author": "Brenda", "ReviewID": "R1AL0NIK0V6Z1H", "Overall": "1.0", "Content": "1. Horrible sound. I could get better sound from my phone sitting on a table.  Added a speaker to fix.2. TV was for computer room to watch news/movies while surfing the web.  When TV was placed on shelf directly above the computer monitor the view angle was too steep to see picture.  Everything looked like a color negative. Was going to have to steal the table from the other room to lower it.3.  This was the deal breaker:  built in DVD player did not work.", "Date": "January 3, 2014"}, {"Title": "Recomended very highly", "Author": "Sharon Jewell", "ReviewID": "R2BQ3V99WPIB93", "Overall": "5.0", "Content": "Easy to use. Looks great. And the built in DVD player is awesome. Glad I bought it!  Recommended very highly.", "Date": "January 3, 2014"}, {"Title": "Proscan PLEDV2491A", "Author": "Wilfred Pille", "ReviewID": "R245PEK1HFWC6D", "Overall": "1.0", "Content": "Very poor sound quality.  I would not recommend purchase of this television.  The picture quality is not the best either.", "Date": "January 3, 2014"}, {"Title": "Great for what it is", "Author": "dariusran", "ReviewID": "R2DPVDP86G7X9A", "Overall": "5.0", "Content": "Purchased this as a downstairs TV for workouts. Great for what it does. I like that I can easily move it around my house and not need to bring a DVD player with me. Overall a great product.", "Date": "January 3, 2014"}, {"Title": "Got what was expected", "Author": "pj2116", "ReviewID": "R3SBPMBCSG3TU3", "Overall": "3.0", "Content": "I read the previous reviews and heard that the sound was thin and not very good, but for my 7 year old in his room, I guess I got what I expected", "Date": "December 31, 2013"}, {"Title": "Sound is not that great.", "Author": "K M G", "ReviewID": "R2FCWOIVIUAGD5", "Overall": "4.0", "Content": "The picture is perfect, but the sound is not that great. We're pleased with it, overall. It made a nice gift!", "Date": "December 30, 2013"}, {"Title": "So far, so good.", "Author": "Terry Lund", "ReviewID": "R1TYJ4BZU886XJ", "Overall": "5.0", "Content": "Seems to work fine. Good picture, crappy sound but expected in flat screen tv's. DVD player works well. Anxious to see how long it lasts before it is junk.", "Date": "December 29, 2013"}, {"Title": "for the price.no regrets\"", "Author": "frank", "ReviewID": "R2F9NYG7X6JQZI", "Overall": "4.0", "Content": "For the price,good deal. TV and built in DVD player is perfect for my room.sound could be a little better.get what you pay for.. gave it a 4!", "Date": "December 24, 2013"}, {"Title": "Ok", "Author": "Rebecca", "ReviewID": "R2KC2WL5320FAZ", "Overall": "2.0", "Content": "This is an ok TV. Picture good for the money. Sound quality not impressive. I bought this to keep in the basement for workout DVD's. Can hardly hear the instruction, but I get the idea.", "Date": "December 17, 2013"}, {"Title": "You get what you pay for", "Author": "Karen Smith \"I'm Just Like You\"", "ReviewID": "R22HYKXNF2Z0YV", "Overall": "1.0", "Content": "Cheap price, cheap product.  DVD was problematic from the beginning and completely stopped functioning after 2 months.  Remote is not intuitive.  Aaargh!", "Date": "May 29, 2014"}, {"Title": "Nice TV for the $$", "Author": "john bird", "ReviewID": "RTXEG4YN3L9B3", "Overall": "4.0", "Content": "I read that the sound was not great and it is true. One small annoyance is that you have to have the TV in DVD mode to eject the DVD, it would be nice to be able to eject the DVD while watching TV or even with the TV off.Overall the picture is good and the sound is sufficient for a small bedroom...just consider that you get what you pay for.", "Date": "May 27, 2014"}, {"Title": "Awful TV terrible sound and DVD player quit working after just 4.5 months of owning", "Author": "christiana kelly", "ReviewID": "R2BO1FW8Z4D345", "Overall": "1.0", "Content": "Absolutely terrible sound AND DVD player stopped working after having for just 4.5 months....like others said, you get what you pay for :( name brands for is from here on out....", "Date": "May 18, 2014"}, {"Title": "Exactly what I was looking for!", "Author": "Marsha", "ReviewID": "R2UW8NU2JG046G", "Overall": "4.0", "Content": "Great little TV, lightweight, good picture, awesome for watching my granddaughter's movies. The price was also very good. I'm very pleased.", "Date": "April 30, 2014"}, {"Title": "TV", "Author": "BGrumme", "ReviewID": "R2OV5BL3WC0F6W", "Overall": "4.0", "Content": "The set up was quite easy.  Picture quality is very clear.  Tone is somewhat tinny.  The sound is the only thing I would change.", "Date": "April 28, 2014"}, {"Title": "A great buy", "Author": "Linda Neid", "ReviewID": "R9D7OLPQQRLL5", "Overall": "5.0", "Content": "I gave it 5 stars because it was purchased as a gift for my Mom in the nursing home.  A great picture and the buttons on the remote were big enough for her to work.", "Date": "April 28, 2014"}, {"Title": "got my money worth", "Author": "synita", "ReviewID": "R2H88H948JQAZH", "Overall": "5.0", "Content": "it works great! very clear. i thought since it was so cheap that it really wouldnt work that well. i had it fir 2 months now and still working the same since i bought it.", "Date": "April 25, 2014"}, {"Title": "The Proscan to/DVD  Met My Expectations", "Author": "Kirsten Lind", "ReviewID": "R2ZDEZV0WTF2F0", "Overall": "4.0", "Content": "The ProscanDVD arrived quickly after ordered and was easy to assemble. It has multiple settings for the user to adjust picture, audio, type of picture mode, etc. My main criticism is that the instructions leaflet isn't helpful to the user. It doesn't catecorize areas for obvious questions, e.g., how to select the DVD ,which buttons on the remote eject a DVD, play, pause, etc. You have to trial and error what the button symbols mean. THe other evaluation is that the sound has a tinny quality een after adjusting it. Otherwise I am satisfied with my purchase and at a great price.", "Date": "April 25, 2014"}, {"Title": "Screen too Small", "Author": "Dessa L. Wright", "ReviewID": "R1CFK5P98E0AW1", "Overall": "4.0", "Content": "Yes it did, but I  should have waited until the 32\" inch was in stock. This unit will go in the guess bedroom and before the yr. is out I will purchase another one the 32 or 40+ screen.", "Date": "April 22, 2014"}, {"Title": "Where is the eject button???", "Author": "Lisa Milan-Rogers", "ReviewID": "RSYIT18QNAD4X", "Overall": "1.0", "Content": "Called Proscan Cust Service they said there is an eject button on the right side of TV.  I see the DVD insertion slot but NO eject button. Am I crazy? or is this a defective unit?", "Date": "April 9, 2014"}, {"Title": "it's okay", "Author": "corgi mom", "ReviewID": "R1DM49DD997Z8L", "Overall": "3.0", "Content": "Like other reviewers stated the sound is very tinny. I can't seem to get the color adjusted right either-still working on it. the remote is too complicated like other has stated as well.  You get what you pay for.", "Date": "April 9, 2014"}, {"Title": "DEFECTIVE TV. BAD PURCHASE.", "Author": "Anon", "ReviewID": "R3PJN42D5USML", "Overall": "1.0", "Content": "Bought the TV thinking would be cost effective. TV stopped working after 3 whole months. To get repaired, forced by company to pay for shipping (nice) and wait 2 months to get repaired. Wonderful.Sometimes when you think you're saving money in the short run, you're wasting time/money in the long run.Advice: spend the extra money on a better TV from a more reputable brand. I wish I did.", "Date": "April 7, 2014"}, {"Title": "Love it!", "Author": "Dean Saadallah \"IronMan\"", "ReviewID": "R2RM2B6Z3O5C33", "Overall": "4.0", "Content": "Nice: no complaints so far. Good quality, nice size, good image quality, so many ports. Picked up a wall mount whuch makes adding connections a little tedious but not difficult.", "Date": "March 29, 2014"}, {"Title": "Waste of Money", "Author": "Gina Rittatore", "ReviewID": "R1W6K6TTNK7M1U", "Overall": "1.0", "Content": "This TV's speakers died in less than 3 months. Seller only allows for returns within first 30 days. Truly a waste of money and very disappointed in this product. For a TV that gets used seldom should not have gone out in 3 months.", "Date": "March 29, 2014"}, {"Title": "Great", "Author": "M. Robino \"Coastal Carpentry llc\"", "ReviewID": "R10WJX2A9U60R", "Overall": "5.0", "Content": "Really great for the money.  No problems after using it for 4 months even in my cold garage. Love it.", "Date": "March 27, 2014"}, {"Title": "Awesome Customer Service!!", "Author": "Marci", "ReviewID": "R28B5KF3UK1NHV", "Overall": "5.0", "Content": "Even though I did not get this item with the free 2 day shipping deal, I did get a great tv! The TV I purchased was out of stock so they upgraded me to a higher pixel TV with everything I was still wanting in one! Great work and customer service!! Love my new tv!!!", "Date": "March 10, 2014"}, {"Title": "Do not purchase", "Author": "Tara Riggenbach", "ReviewID": "R1EYHVEJ0UYGXL", "Overall": "1.0", "Content": "Just a warning; had a very negative experience trying to purchase this DVD/TV combo. Should have learned my lesson after the first time buying it, tracking said it was shipped for about 10 days, it never arrived. Finally contacted Amazon, they then contacted UPS who told them they had never received it. So they sent out a second TV. We received the second one thinking all was fine only to find out that the hardware provided was not usable to mount the TV. Further, the TV does not accept any disk and does not work, period. We cannot return it. Seller is unwilling to cooperate with us. Please spare yourself!", "Date": "March 2, 2014"}, {"Title": "Have to sit eye level with it.", "Author": "Jeff Manbeck", "ReviewID": "RLJCR0G65JJYU", "Overall": "3.0", "Content": "I put this in my sons room at the end of the bed on the wall.  The window is on the opposite side of the bed.  The TV is very hard to see unless you are sitting eye level with it and even worse if there is any type of glare from the window.  Even with the blinds shut (a little light still comes through), you have to be sitting exactly eye level to see it very well.  I ended up getting a wall mount that I can adjust the angle downward a little bit to see better.The DVD player is kind of loud and the sound quality isn't the greatest, but I bought it for a 7 year old so I'm not overly worried about those.", "Date": "February 18, 2014"}, {"Title": "Sound quality is poor, but TV is good for the price.", "Author": "Jan Kafka", "ReviewID": "R1656A2KWGN5LM", "Overall": "4.0", "Content": "As other reviews have said, the sound quality is tinny at best. The picture is good, though, and the price very reasonable. The remote is cheap and flimsy- and you have to point it right at the sensor or the signal doesn't register. I'd recommend speakers (it has a headphone jack and HDMI out) and a universal remote to be completely happy.", "Date": "February 3, 2014"}, {"Title": "Works good. Good price", "Author": "Tanya Humphrey", "ReviewID": "RVZI4Z6AAQXW2", "Overall": "4.0", "Content": "Works fine. Perfect for my room.  Picture clarity could be better. My son said that was adjustable but I'm not sure it is. Lightweight. Almost flimsy. Christmas gift.", "Date": "January 20, 2014"}, {"Title": "Easy to install", "Author": "Sherry Englert", "ReviewID": "R21GTKYO2TEZ0X", "Overall": "5.0", "Content": "Great price for TV with DVD player mounted on wall installation quick and easy. I purchased two for my twin grandsons and other two grand kids to share.", "Date": "January 16, 2014"}, {"Title": "Perfect size for my need", "Author": "J. Bo Stahl \"The Stahl 6\"", "ReviewID": "RUMEVWPUTV5PH", "Overall": "4.0", "Content": "Bought for my grandkids to enjoying a few movies while on a trip in a small cabin.  It works well and they are excited that they get to carry it home for their rooms.", "Date": "November 18, 2013"}, {"Title": "Good for the money!", "Author": "Wilma Lopez", "ReviewID": "R3K2RT000XEOYU", "Overall": "4.0", "Content": "I bought the TV for my young grandson so that he may watch tv, watch dvds and play his PS4 games. It has a clear picture on it, but the audio is not very good. However, considering kids like to raise the volume for the games, it's just as well.", "Date": "January 5, 2014"}, {"Title": "TV needs improvement", "Author": "liz", "ReviewID": "R3HTQCJKDBPNNZ", "Overall": "2.0", "Content": "the picture on the TV is great , the sound is horrible the speaker r not in front of the TV  inorder to hear anything you have to turn the TV almost all the way up and even then it sounds like the TV is in the ohter room", "Date": "December 27, 2013"}, {"Title": "Not acceptable", "Author": "TR", "ReviewID": "R3W1FWNPILSA9K", "Overall": "1.0", "Content": "I returned this item.Picture was not acceptable.  Fuzzy, bad color. Sound is terribleAlso realized this is not a great price.", "Date": "April 24, 2014"}, {"Title": "Should do the job!", "Author": "KSalgado", "ReviewID": "R3HNPX82E68U8O", "Overall": "4.0", "Content": "Haven't used it yet it looks nice and honestly it will be used in our camper so it will rarely get used. Read reviews sound isn't great but again haven't tried it.", "Date": "February 21, 2014"}, {"Title": "The sound is poor", "Author": "Patrick King", "ReviewID": "R1ES4QU04Y6UJ6", "Overall": "3.0", "Content": "This is a good value but if you buy it you need a sound bar or a surround sound system. The audio is awful. You can't hear it six feet away. This picture is beautiful and the built-in DVD offers a handy option to wiring in a separate unit. Still the audio is a serious issue... easily corrected but at an additional cost.", "Date": "February 15, 2014"}, {"Title": "DVD player broke after one month.", "Author": "Jana Morgan", "ReviewID": "R1BNHUH00YVJ66", "Overall": "2.0", "Content": "We need repairs on this TV.  Do we have to return the TV?  DVD stopped working during the movie. Strange.", "Date": "February 1, 2014"}, {"Title": "Tradeoffs...", "Author": "Joseph R. Dreyer", "ReviewID": "R1YDQ6TX0861W0", "Overall": "3.0", "Content": "The picture quality is good, but the sound quality is so poor is sounds like I'm listening to the TV over the telephone. The DVD function works fine, but you need to use the remote control to go into DVD mode. Inserting the DVD does not trigger DVD mode. If I was buying again, I would look for something a little better - of course it would probably cost more than the bargain basement price of the Proscan.", "Date": "January 25, 2014"}, {"Title": "Function use very difficult to learn.", "Author": "cynthia", "ReviewID": "R1ZHWWYDD1RLK1", "Overall": "3.0", "Content": "Though the product has a clear picture and seems to be difficult to do certain operations and the manual that comes with it is not very clear on the functions.  Find it confusing to operate.", "Date": "January 10, 2014"}, {"Title": "Gift", "Author": "Victoriatado", "ReviewID": "R11ENHF5TZG425", "Overall": "5.0", "Content": "I got this for my grandsons that share a room. The size is good for their room and having a built in dvd is a must.", "Date": "January 6, 2014"}, {"Title": "Perfect for what I wanted for", "Author": "Jeff", "ReviewID": "R13XXC6D5B3NHF", "Overall": "4.0", "Content": "I would of gave it 5 stars however I found out that you need the remote to operate the DVDs function.....so if you lose the remote your screwed...other that it's great", "Date": "December 16, 2013"}, {"Title": "Just ok", "Author": "Gayle R. Parkhurst", "ReviewID": "R16MCZ9Q2PPPGE", "Overall": "3.0", "Content": "The Tv it self is light in weight, wich is good for moving place to place, the picture quality is excellent, however I am not to keen on the sound quality it gives, very pitchy no matter what setting I use, doesnt seem to change. other than that it's a ok expense for now.", "Date": "November 17, 2013"}], "ProductInfo": {"Price": "$183.44", "Features": "24\" LED HD TV with Built in DVD Player\nSlot Loading DVD Player\nATSC/NTSC Tuner\nDisplay Capabilities: 480i, 480p, 576i, 576p, 720i, 720p,\nAspect Ratio: 16:9", "Name": "Proscan PLEDV2491A 24-Inch LED HD TV with Built in DVD Player", "ImgURL": "http://ecx.images-amazon.com/images/I/41QPHgSOqyL._SX300_.jpg", "ProductID": "B00EE18N7I"}}