{"Reviews": [{"Title": "Great LED 120hz tv.", "Author": "Darkenoid", "ReviewID": "R1RVM74PE0OWK3", "Overall": "5.0", "Content": "This TV looks great with my PS3. I played The Last of Us on this and it was wonderful. The color and brightness is good. I love how thin this TV is and it's very lightweight. This only comes with 2 HDMI ports but I already had a HDMI switch box laying around and now I can use up to 4 HDMI devices at once when needed. The speakers are ok but I don't use it often since I hooked up my 5.1 surround sound. I use the coax out from the TV to my radio and now I can hear my cable box on my 5.1 system too.I love how thin the bezel is. The remote is very basic but works fine. I watched a few blu ray movies on this and it looked great. I have no complains about the picture. I'm sure some other TV's the same size will look a little better but it will cost a good deal more. This TV looks good and I have had others tell me this TV looks very good too. In fact, two people that saw this TV have asked me where did I get it and how much it was since they want to get the same one.The price I paid was a good deal ($413). So far it has been worth it but if something happens I will update this review.", "Date": "November 21, 2013"}, {"Title": "Great TV!!", "Author": "Antonio Rodriguez", "ReviewID": "R11B7DOFYWQRYG", "Overall": "5.0", "Content": "It's amazing!!!! I love it!!! It looks greats and for the price. It doesn't have any apps or anything like that but my cable, PS3, and Computer look amazing on it.", "Date": "December 14, 2013"}, {"Title": "Find a Decent Brand", "Author": "Abdullah Bokhary \"book hunter\"", "ReviewID": "R2923BPS4M57R1", "Overall": "1.0", "Content": "I bought this TV in Jan 2012. After one and half year dark spot started to cover some places until it be came all dark. I tried to contact the costumer service several time. Evey time they premised to recontact me but they never did. My advice, find a decent brand even if you have to pay more.", "Date": "November 14, 2013"}], "ProductInfo": {"Price": "$479.98", "Features": "Westinghouse 46\" Class 1080p 120Hz LED HDTV", "Name": "Westinghouse 46\" Class 1080p 120Hz LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/41Q1OmhSU7L._SY300_.jpg", "ProductID": "B00F0SRPDC"}}