{"Reviews": [{"Title": "great picture.  great deal", "Author": "Annalisa", "ReviewID": "R1ZLNPGQYXTBQN", "Overall": "5.0", "Content": "out of the box the picture needs adjusting.  I used the below setting found on cnet forum.  like night and dayOPC - OffBacklight +10Contrast (White Level) +25Brightness (Black Level) -3Color 0Tint +2Sharpness +2C.M.S. Hue 0C.M.S. Saturation 0C.M.S. Value 0Color Temperature (Set the Low preset to the following numbers for 6500K)Red Gain (Lo) -16Green Gain (Lo) +3Blue Gain (Lo) -20Red Gain (Hi) -15Green Gain (Hi) +6Blue Gain (Hi) -21Fine Motion - OnGamma +2Film Mode - Advanced HighDigital Noise Reduction - AutoThese are the settings I'm using now.", "Date": "December 15, 2013"}, {"Title": "Good but. . .", "Author": "Dave Howard", "ReviewID": "R311Z4WESORM76", "Overall": "3.0", "Content": "I looked at a lot of televisions at a bunch of stores, did some research, looked at prices and ended up purchasing the Sharp LC-60C7500U.  The picture is very good but suffers from a problem I noticed in a lot of large wide-screen TVs:  The details in faces tend to be sort of wiped out and featureless, like everyone is wearing pancake stage makeup.  This is highly dependent on the source, too, and doesn't always happen.  But it happens enough to be mildly annoying.  I find that the 240 Hz (augmented to 480 Hz by Aquamotion) accentuates this flaw, so for most viewing, I turn all this stuff off.  I was watching a nature show about leopards and the spots were kind of swimming around as the Aquamotion tried to blend the pixels to hide any jitter.  I also usually turn off automatic contrast control.  It makes the screen get noticeably brighter or darker, depending on the scene, and is, again, mildly annoying.  However, for watching sports or other fast moving sources, these features work great.The sound is very good, with enough bass that I usually don't feel the need to run audio through my stereo system.  It doesn't get very loud, but loud enough for viewing.  Since it is advertised as 35W, it seems they could have put some speaker terminals in the back to allow secondary speakers, but apparently no one does this.As mentioned before, I find myself adjusting picture quality a lot.  This will surely taper off as I get more used to what settings I like, but for the time being I have to keep the TV remote close by.  One thing I am finding that has to be adjusted is zoom and stretch.  You can pick which format you want, but you can't simply turn it off and rely on whatever the source provides.  So when I switch from TV to DVD, I have to fiddle with the controls to make the screen look right, depending on the movie.  \"The King's Speech\" requires one setting, while \"Casablanca\" requires another.Overall, I'm pleased with my purchase.  In retrospect, I could have purchased a 55\" and been just as happy, but I'm not bringing this one back.UPDATE 1/16/14I have gotten used to the controls now and find that I am happy leaving the Aquamotion 480 on all the time.  I don't know if I just got used to it or what but I don't notice any pancake makeup look any more.  I still leave the auto contrast off.There have been a few times when I turn the TV on and the picture is fuzzy.  I turn it off for a few seconds and turn it back on and it's fine.  Overall, the picture is really crisp.Another minor annoyance is that the audio and video get a second or so out of sync sometimes.  This is at least, or maybe entirely, the fault of the cable DVR, because hitting pause and then play fixes it.  I just don't remember ever seeing this on  my old TV.  And actually I watch enough sports, where the camera is pointing to the field, that I rarely see this.UPDATE 2/14/14I had only watched a few movies on this TV until recently and there is a major bug.  As I mentioned earlier, in DVD mode the stretch feature cannot be turned off.  You have the choice of Stretch (picture is bigger than screen), Widescreen (left and right of picture go past the borders of the screen), Black Bars (squeezing picture between two vertical black bars on left and right), and Smart Stretch, which I don't understand.  I had watched a movie in Smart Stretch and it appeared to be OK.  Then I recently watched \"Doubt\" and found that Smart Stretch distorted the picture so that all the people were squashed vertically.  I put it on Stretch and that cured the squashing but extended the picture beyond the borders of the screen.  Neither of these is acceptable.  I sent a request for technical support to Sharp and here is the response I got:\"Thank you for contacting Sharp Electronics Corporation.There is not a way to turn off the view mode the view mode ensures that the TV and the device can be changed to be in sync.\"In other words, we don't care and we're not going to do anything about it.  You'll have to diddle with the controls every time you want to watch a movie.I assume that all Sharp TVs have this bug so I would caution anyone to check this before buying any Sharp TV.  Had I bought this TV to watch movies I would have returned it.UPDATE 6/8/14I was constantly annoyed by the color in movies.  I could tell it had something to do with black level, but no amount of adjusting could fix it.  Then one night as I was messing with it again, I ran across a menu that said, \"black level high\" or black level low\".  It was set on low.  I switched it to high and voila!  Problem solved.  I have no idea why Sharp would set something like that as a default, but then I don't understand why there is no setting for watching movies without stretch, either.  That's still a major annoyance and would prevent me from buying this TV if I had it to do over again.", "Date": "August 27, 2013"}, {"Title": "\"Smart\" Features are awesome! Esp Netflix...", "Author": "Kristine", "ReviewID": "R3H3G5LQEYEIRK", "Overall": "5.0", "Content": "Great Image quality.  Fits perfectly in my living room. I love the Netflix & Pandora features!!My brother in law first introduced us to the Sharp brand because he believes they are the leader in big screen TVs..and he was right! I am amazed at how awesome the quality is...", "Date": "November 21, 2013"}, {"Title": "Great TV", "Author": "Irineo F Barron", "ReviewID": "RP0FUBQP00X7D", "Overall": "5.0", "Content": "This TV has a great picture and is everything I needed. I have seen a few bad reviews and I'm not understanding why. If your a TV snob and only want the best TV on the market then this is not for you. Go ahead and spend 3000 dollars more so you can get a TV that's only a little better than this one. If your looking for a very nice TV at an affordable price I suggest you give this one a shot. I've only had it a few weeks so I cant speak to the longevity but from my experience things last as long as you take care of them. There are a few lemons here and there but that happens with any product from any company.PS. Make sure you hook this thing up to the internet and update the software when you get it.", "Date": "January 8, 2014"}, {"Title": "Its nice, I was expecting better.", "Author": "Todd", "ReviewID": "R24457YJ4GEM3Y", "Overall": "3.0", "Content": "Shipping/Delivery:Good!The TV showed up on time and was not damaged. The packaging around the TV was sufficient to protect it during shipping which was a worry for me when buying such a large TV online.Build Quality:Good!I got the TV home and started to get it unpacked. I was very happy with the quality of build. The TV seems very sturdy and not likely to get damaged from a weak or sagging frame (I have heard this happens with other TV's like Samsung). I first had it sitting on the pedestal stand the unit came with but after walking around on the floor next to the TV it appeared to shake so I bought a wall mount to secure it to the wall.Picture Quality:Okay.This is the 240Hz Quattron TV and I expected a better image. I was actually in the market for the standard Aquos 120Hz but when they offered this through the lighting deals, I was sold as it was only a little bit more than I was willing to pay for the Standard version. The image appears to ghost or chop when someone waves their hand on screen. I adjusted the frequency setting in the TV but this did not seem to help enough to eliminate this problem completely. I do not watch a lot of sports but I imagine this would be very disappointing if I did. I think that a lot of this comes from the physical size of the screen. Prior to this we had a much smaller TV built by an off brand manufacturer and did not have this problem although the screen size was only 25\". The color of the TV is exceptional and having the various color settings is nice because some of the shows we watch can look fake without adjusting the color.Apps Quality:Okay.The Smart Center control they have is nice. When you hit the smart center button on the remote, you have quick options that appear at the bottom of the screen to navigate quickly to thing like Netflix and Pandora. Clicking on the smart center button that appears on screen takes you to larger list of apps available. They are organized in different categories like music, movies, lifestyle, games, ect. The apps within some of these categories do not seem to work as well as they should. For instance, I clicked on the motorcycle app and the various short films are constantly stopping to buffer before the film is complete. This does not happen with other streaming services like Netflix so I do not think it is my internet connection speed. The Pandora app buffers between each song which is a little annoying. I have a blue-ray player which does not do this. The other slight gripe I have is that at the time of this review, Sharp does not anticipate adding the Amazon Prime app to its list of movie apps. I tried a work around on this by using the browser built into the TV but this did not work. I will probably try again if I find a wireless keyboard and mouse that work with the TV. As it was difficult to navigate the page with the remote.Sound Quality:Good!I bought this TV in bundle package with the Sharp HT-SB40 sound bar and Wireless Sub. But when I first connected the TV I ran it without the sound bar and it was more than sufficient at filling my living room with sound. The TV also has a different sound profile for wall mount situations but I have not tried that setting because I was going to hook up the sound bar that came in the bundle.Connectivity Issue:I have satellite service and when switching between inputs, the TV does not pickup the signal from the satellite box. I have to unplug the HDMI cable and wait 5-10 seconds before plugging it in to the TV. Once the TV picks up the satellite signal. The picture and sound drops out about once every five minutes. I am still working on this issue but I am thinking it is because I do not have HD programming coming into the box from the dish.In closing, if I had to do this again, I would have probably bought a smaller TV (to reduce the amount of ghosting).But would have stayed with 240Hz or better to minimize the chances of motion blur. I would have also looked at a TV with an app store as well so that as apps become available I would have the opportunity to install them.", "Date": "January 3, 2014"}, {"Title": "Not as sharp as I would like", "Author": "Amazon Customer", "ReviewID": "R37DPQZH07KPP6", "Overall": "3.0", "Content": "I was a little disappointed when we received the TV. I read so many good reviews that I really thought it would be great. My smaller LCD was so crisp that I expected the same. I think the quality is inferior. The factory presets were extremely dark and I had to adjust it several times before I was happy with it. I also had to turn off the energy saving features to get it bright enough to watch.", "Date": "May 2, 2014"}, {"Title": "Nice TV", "Author": "selq", "ReviewID": "R2RD1Z6MSLDV9U", "Overall": "4.0", "Content": "Nice looking tv, it has a good pic, remote is a but touchy,  amazing price, I would buy this TV again", "Date": "April 3, 2014"}, {"Title": "Solid TV with great color and picture", "Author": "LS", "ReviewID": "R3PMSON4BFFR8J", "Overall": "4.0", "Content": "I order this from the black friday lighting deal in which I paid $1300 for the tv and the Sharp HT-SB40 High Power SoundBar and Wireless Subwoofer. Great deal! The tv picture is excellent. Sometimes it is too good and actually makes what I'm viewing seem a bit amateurish. The camera angles whip around making it a bit distorting. When that happens, I think the motion speed is too high and needs to be reduced. Sports look awesome on this tv.The only big issue I have with the tv is the smart functions aren't that great. While watching netflix on the tv is useful, the remote to play/stop/rewind/fast forward is terrible. also for no good reason, the signal weakens and sometimes stops working all together and I have to turn the tv on and off again just to make it work.The sounds seemed ok before the sound bar but with the sound bar, it is excellent. The sound bar integrates with the tv since they are both sharp and I can control the volume on the sound bar through my cable box remote. Someone recommended using an optical cable but when I tried, no sound came out. I just used an HDMI cable instead and it sounds great.Now, if you're paying $2,000 for this tv, i don't think it's worth it and you should look into the 60 inch samsung. If you are paying under $1,500 I think it's a good deal.", "Date": "January 10, 2014"}, {"Title": "Amazing TV!", "Author": "Chris Bergs", "ReviewID": "R2FTM1Q25SJ0ZE", "Overall": "5.0", "Content": "Bought this set as part of a cyber Monday deal here on Amazon and it included a sound bar (B00BM0K8VI as well. We are very happy with both products! The picture on the TV is amazing! I don't care for the 3D TV except for the fact that they help \"old\" non 3D TVs like this one cheaper! I would recommend this TV for anyone looking for a great 60\" TV that, like me, doesn't care about having a 3D TV.", "Date": "January 7, 2014"}, {"Title": "Great television", "Author": "A. F. Wooten \"Lost in Snow\"", "ReviewID": "R3SN3ORKGTS11S", "Overall": "5.0", "Content": "Upgraded from a Toshiba 46\" LCD and let me tell you it is night and day.  This tv is fantastic!  Vibrant colors, and great picture quality.  Truly amazing.", "Date": "December 8, 2013"}, {"Title": "great picture and colors", "Author": "Sunil Patel", "ReviewID": "R2NBSBCV99ZWFM", "Overall": "5.0", "Content": "great picture and colors! met my expectation.I am satisfied with my purpose. Voice little weak, but realized it is the case with majority slim LED tvs.", "Date": "December 8, 2013"}, {"Title": "60 In. AQUOS 1080p LED SMART TV with 240Hz", "Author": "mivu11", "ReviewID": "R2JU7J57IX35IF", "Overall": "5.0", "Content": "60 In. AQUOS 1080p LED SMART TV is all what i expected. this is my third sharp TV i have a 50\" and 60\" 3D  and now this.both 60\" TVs  are Qua tron and i recommend it to all. the sound is not as loud but, with  sound system your just fine.", "Date": "October 5, 2013"}, {"Title": "Great TV!", "Author": "Heather Voight", "ReviewID": "R11RLB2J1R19DG", "Overall": "5.0", "Content": "This is a crystal clear televsion, Great Quality and I would highly recommend it! The price was reasonable, it was great size for our living room!", "Date": "January 2, 2014"}, {"Title": "Works as advertised and picture quality is great.", "Author": "Amazon Customer", "ReviewID": "R31670EVVNSUJH", "Overall": "5.0", "Content": "I am very pleased with the quality of the picture on this TV. All the features represented in the promotional material are implemented. One feature I didn't realize it had was the ability to use you Android tablet or phone to access the Netflix site through the Netflix app and then sling the image on the TV using the Google Chromecast button in the app. No pairing is required. The only requirement is that both devices have to be on the same local area network. Finding what you want to watch on Netflix is much easier using the touchscreen on an Android phone or tablet than it is using a simple TV remote without a keyboard.The one thing that seems to be missing on this TV that was available on my last Sharp TV is the screen overscan adjustment. This may reflect incorporating this feature in the digital electronics automatically, since no adjustments were needed on any of inputs.The buttons on the TV remote above the number pad are very small compared to the remote on my old Sharp. I have to been extra careful to make sure I've got my finger on the right button.", "Date": "December 18, 2013"}, {"Title": "Great 60\" TV", "Author": "Lance Ramsay", "ReviewID": "R1V1IIPSLTINAA", "Overall": "5.0", "Content": "Got a package deal on Amazon with a Sharp sound bar - http://www.amazon.com/gp/product/B00BM0K8VI/ref=cm_cr_ryp_prd_ttl_sol_5I upgraded from an older 40\" set and it very striking at first how much detail you see with a TV this large.Netflix app is great, but no amazon streaming app. The built in sound of the TV is joke, I used the built in sound for a week before installing the sound bar, made it a whole new experience.", "Date": "January 30, 2014"}, {"Title": "TV", "Author": "Donnie M. Smith", "ReviewID": "R3IUMUDZWXJTUP", "Overall": "3.0", "Content": "I ordered the sharp 757 but they sent the sharp 7500u only deffrence is 757 has 3D 7500u doesn't have 3D", "Date": "January 19, 2014"}, {"Title": "Saw in store", "Author": "Jeffrey D. Sheets \"Avid Reader\"", "ReviewID": "R3UFDDK8FLHZOH", "Overall": "5.0", "Content": "My husband and I went to several stores to view tv pictures on display and this one was amazing, waiting on price drop but will be buying for sure!", "Date": "December 31, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Quattron: Exclusive Quattron color technology delivers a billion more colors, so you get a more powerful picture with brighter yellows, deeper blues, and richer gold's - a feat that standard TV simply can't achieve\nAquos Display: The Aquos 1080p LED Display with a 10 million: 1 contrast ratio creates a picture so real you can see the difference\n240Hz Refresh Rate: See sharper, more electrifying action with the most advanced panel refresh rates available today. 240Hz technology delivers crystal-clear images even during fast-motion scenes\nSmart Central 2: Sharp's intuitive Smart TV lets you quickly connect to your favorite content and instantly access apps like Facebook, Twitter, and YouTube, plus streaming movies, music, games, and websites you love\nTV without stand (Width x Height x Depth):   54-1/4\" x 31-57/64\" x 2-9/32\", TV with stand (Width x Height x Depth): 54-1/4\" x 32-61/64\" x 14-11/64\"", "Name": "Sharp LC-60C7500U 60-Inch Class Aquos 1080p 240Hz Smart LED HDTV with Quattron", "ImgURL": "", "ProductID": "B00FXTNWX0"}}