{"Reviews": [{"Title": "Words fail me.", "Author": "Amazon Customer \"Stay Frosty\"", "ReviewID": "R333UMAWCD81G4", "Overall": "5.0", "Content": "I don't normally sell my first born virgin daughter to Slovakian human traffickers. But when I do, it's so I can afford a TV that costs about forty grand.Best decision ever.", "Date": "February 1, 2014"}, {"Title": "Like being on the USS Enterprise", "Author": "Mat1974", "ReviewID": "RK5DLH1OLUMMD", "Overall": "5.0", "Content": "After being turned down by NASA and watching way to much Star Trek, I decided to purchase 20 of these TVs.It took me several weeks to line them up on the walls and ceiling, but when I had finished I had created my own Holodeck, just like on the Enterprise.  Now I can go back in time and experience things I could only dream of.  Now NASA is calling me to use my Holodeck.  I recently purchased a space suit from e-bay and now I can do my own space walks.  Thank you Samsung!", "Date": "February 13, 2014"}, {"Title": "This TV saved my family, and my sore back", "Author": "Phil Grant", "ReviewID": "R2KD4339INNIU1", "Overall": "5.0", "Content": "Let me just be clear up front, our last family tv was only a 42-inch piece of crap so it wasn't hard to find something that put it to shame. But wow!!! In the past when the disgruntled spirits dwelling beneath our house would suck our 5 year old daughter into the inter-dimensional limbo through our television it was a real pain in the butt trying to recover her. Well not anymore! Two days after this baby got delivered those pesky spirits were up to their old tricks again, sucking my daughter into the void, but this time it was practically no hassle at all! I was able to essentially walk directly into this tv, no crouching, slouching, or crawling for this guy! There was even enough room for me to take a couple of my buddies who were interested to see what my wife is always complaining about! I don't expect the ghoulish abductions to cease anytime soon, and there's no way we're moving (our mortgage is unbelievably low!), so this much more conveniently sized gateway to hell is going to be cherished for years to come. Thank you Samsung!", "Date": "February 12, 2014"}, {"Title": "Greatest tv ever", "Author": "Karna Seoparsan", "ReviewID": "R1JN6LSUEU5WT6", "Overall": "5.0", "Content": "I love this thing. I can still remember the first time my friends came over. their faces were almost as much as this tv but not priceless. The picture is the greatest the sound is sublime. The sharpness  and color is unparalleled. Was completely worth joining forces with Daedric Prince Molag Bal and allowing him to take my little sister.", "Date": "February 17, 2014"}, {"Title": "Lowest price ever", "Author": "AFlyingChicken", "ReviewID": "R1JZ2IRE2UQ1IA", "Overall": "5.0", "Content": "l was looking for a t v with a great picture and price value.After I Saw the price drop of 5k how could I turn this price down.I help out alot at my local homeless shelter.The homeless shelter does not have a tv so I deceided to put this in the back of my monster truck and head down to the homeless shelter.Everyone loved the picture quality and there was no blurry images even though manning was sacked often .It was a great time except no one brought any food. Thank you Samsung!", "Date": "February 28, 2014"}, {"Title": "Great buy", "Author": "doug smith", "ReviewID": "R1WFRFQ41CC0YT", "Overall": "5.0", "Content": "I can't find the words to describe the pleasure I find in watching this magnificent piece of modern technology. The picture is sharp with true to life colors. There is no blur during any sports or fast action on screen. My wife would have liked it but she is too busy working four jobs to pay for it. And with my kids making shoes for Nike I can sit and watch mtg tv in peace.", "Date": "February 26, 2014"}, {"Title": "simply breathtaking", "Author": "wjmoore86", "ReviewID": "R2U2MXS6MJ13S1", "Overall": "5.0", "Content": "When I saw one Samsung 85 inch 4k ultra HD TV I thought that it was the perfect mate to my living room. After taking out a second mortgage I was ready to start enjoying the best TV ever. Then I saw that Samsung has done it again. Goodness gracious! I said to myself. I need it for the master bedroom! But the bank will no longer allow me to finance.  I had tried to sell my plasma but it was not getting me the cash flow I needed. My doctor did tell me that I had an extremely rare blood type that would allow anyone to be able to take my blood and, if nessesary, my organs. That was it! I would sell one of my organs I did not need. Perhaps my kidney or a part of my liver. I contacted a friend who contacted a friend who had Mr.Black contact me. Mr.Black stated with my blood type a kidney would only fetch me 20,000. And a piece of my liver was a mere 8,000. He did however inform me that if I were to sell one of my lungs, he had a buyer who was willing to pay 45,000. Now I was skeptical at first but the thought of a falling  asleep in the warm glow of that Adonis of TV's convinced me. Long story short my oxygen mask obscures my vision occasionally but in the end i have no regrets. Thank you Samsung!", "Date": "February 13, 2014"}, {"Title": "You get what you paid for", "Author": "avox", "ReviewID": "R29C4E0508LXJZ", "Overall": "5.0", "Content": "Don't be tricked into buying cheap TV's that promise to have a lot of features.  This $35,000 \"steal\" may seem like a killer deal, but it is not.  First of all 4K HD is already old news.  Materials researchers and scientists are working on a 4x4xHD TV.  That is like 16 regular HD TV's, which is 4 of these TV's.  The reason it is so cheap is because it is about to become obsolete technology.  Second, this TV may look big in the photo, but in reality 85 inches is only enough to take up a living room wall in a tiny apartment.  If you own a house with a full sized living room you are going to need 3 of these just to cover up your wall.  Third, this TV broadcasts only in 3 dimensions.  String theorists theorize there are at least 11 dimensions.  3/11 is not acceptable.  Fourth, the TV does not float in the air as pictured, magnetic levitation does not come standard on it.  The smart thing to do would be to wait for the $249,999.99 model to come out and buy that.", "Date": "February 28, 2014"}, {"Title": "Peeved!", "Author": "Chauncey Alexander", "ReviewID": "RB98XPNVR3ZV4", "Overall": "1.0", "Content": "Fair market value for the tv. What I didn't like was the outrageous amount for a restocking fee when I attempted to return it. Really contemplating contacting the Better Business Bureau….", "Date": "March 11, 2014"}], "ProductInfo": {"Price": "$39,997.99", "Features": "4K Ultra HD with Micro Dimming: Best picture quality\n120Hz Refresh Rate: Better for general viewing, video games, action movies, and sports\nSmart TV with Voice Control: Interact with streaming content and the web\nLED Design: TV without stand (Width x Height x Depth): 74.9\" x 43.0\" x 2.2\"", "Name": "Samsung UN85S9V 85-Inch 4K Ultra HD 120Hz 3D Smart LED UHDTV (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/31uuG8%2BKl%2BL._SX300_.jpg", "ProductID": "B00GIB9SKS"}}