{"Reviews": [{"Title": "Best 1080 picture thus far on Planet Earth!", "Author": "dhadam", "ReviewID": "R3C99T91ICTU7O", "Overall": "4.0", "Content": "9I'm not quite ready for the 4K plunge due to the current (as of May 20014) 'content vacuum' but definitely wanted the sharpest picture possible with current content over the next several years.  I came from an awesome 65\" Panny plasma, loved it, still have it in bedroom now.  I've had this one for about 4 weeks and have been giving it the business throwing everything at it 'source-wise.'1st ...The color and brightness is amazing and 'unique,' I believe because of the yellow pixel addition... man, the BLUE skies are a blue like no other, the YELLOW/ORANGES are stunning and the green grass and green jello are in a whole new dimension of \"pop!\" Wow, really delicious stuff that on some well filmed content is just hard to peel your eyes away from!2nd ...Detail, and crispness for a 1080 is really, quit a substantial piece of the pie. I know this isn't part of the review but it is because with better content feed into this beast it can handle it and show you what you've NEVER seen from 1080 before.  I added a new Oppo 103D 3D Blu-ray (this is a $600 blue ray unit ... I know, I know but read on! After adjusted the Darbee video enhancement on the 103D the detail I just wet myself!  It isn't a 4K, no.  BUT, it definitely doesn't look like any 1080 I've ever heard of or seen before, dang!  Absolutely jaw dropping detail! You will not likely think of 3 thinks the same ever again ... sand grains, the human eye and hair!3rd ...Smart Apps, well they do look nice but the duel-core processor just doesn't cut it for me due to sluggishness.  I'm sticking to an zippier external source such as a combo of Oppo/Roku/AppleTV for all the extra app-goodness for 'speed-sake.'  I think the menus looks nice but just doesn't work for me. This is too much money for it to be painful at ANY level.  Really, put a quad-core in there and call it a day for a winning combo or rewrite the heck out of your code to be more processor efficient. The \"adjustments & setup menus\" work flawlessly!4th ... Currently I'm having a real tough time with 'external USB drive' support. In all fairness, I haven't called support directly yet.  I like to be up to my belly button in alligators (understanding all the equipment and how they interact)  before I call so I don't waste their or my time for substantive answers, and I am hopeful their will be a way to make it all work smoothly as I am a serious photographer and rely mostly on video to display my work so this is a particularly important feature set to me. Firmware is up to date. USB 2.0 worked, USB 3.0 did not (so much for backwards compatible.) And I ensured that the proper files system was being utilized and formatted all my media to that standard (I think it was FAT 32 or MSDOS FAT), I run MAC products but keep windows on one mac for such silliness.5th ... 3D is pretty much an 'outer body type of fabulous.'  Don't overly rely on this as I'm new to HOME 3D. I didn't buy it for that 3D function but it works so well and is emplacements pretty dark well too that I bought a dozen 3D movies I was so enthusiastic about it's functionality. A 2D conversion is above \"moderate to okay\" as long as you max out the effect but I don't think we'll be bothering with much that isn't full-on 3D master conversions from studios. We are in our mid 50's so it takes a impressive 'dog and pony' show to excite me about such things. The OPPO's 3D works muck better but the Sharps is pretty good too (on 2D conversions.  On 3D original source, as long as your not immune to the effect and I understand some 5 to 10% of us are, I think it to be a totally immersive experience.  This is where I suggest following the distance guide provide by Sharp, For mine is about10' but I use 20 because of the size of the room...still pretty delicious stuff!6th...When you shut the unit off it goes into a dimmer energy saving mode and rotates classic art. Looks like Monet & Renoir paintings. It's perfect for our multimillion dollar home so we don't have this monster eye sore in our face when its shut off.  Now its very respectable, pleasing, calming and I say quite classy.  It looks like our oil paints which we keep most lit in the evening so it blends in and gives you quite a \"night-light!\"7th... Maybe it's just how I set it up but the sound on mine is lousy, like terrible.  Why no fuss?  I put all sound through external sound devices/amplifiers (using BOSE V-30). IT makes all the difference in the world in your enjoyment experience as well the quality of your immersive experience.  I like to totally get lost in the experience ... sound, music and of course PICTURE!All in all we are pretty delighted with our unit, especially since I made some work a rounds with extra Darbee video processing with the Oppo and using externals units for the extra goodies. With the new H.265 codec created last fall for internet extended compression thus freeing up bandwidth, all steaming devices will require new hardware to handle it so this TV is out of luck unless they make a hardware update available or run two codecs simultaneously.  That's all above my pay grade.I threw away the box and am keeping this fine, fantastic looking, well built (other than the duel-core issue) fair priced beast of an 'eye candy dispenser!' I'm sure as with all electronics their may be improvements in the months and years to come but for the 'here and now' this is the one for us!  Happy buying and hope this helps! - The Don, Columbus, OH (non paid reviewer, bought and paid for my unit, I own my unit, I do not nor have I ever worked for Sharp or Amazon.  I'm a retired chemical guy with an interest in all things technical.  Main hobbies are photography, fishing and sport shooting ... oh and watching great television and movies!", "Date": "April 24, 2014"}, {"Title": "No Dead Pixels and Amazing Picture", "Author": "Kent Rogers", "ReviewID": "R2GRZ3QTRI9NXF", "Overall": "5.0", "Content": "I took mine home from Best Buy and did not have any dead pixels or damage what soever from laying flat in the back of my pickup.  Either I'm lucky or there may be a bad batch at Amazon warehouse.  Picture is amazing with the upscaling.  I sit 15 feet away from this 70 inch TV so I'll never be able to tell the difference between Q+ and UHD.  At that distance, I can definitely tell the difference between 1080P and Q+.  I'm completely satisfied except I have to go out and buy the 3D glasses.  I have seen the Sony 4K demos and this Q+ is equally as impressive.", "Date": "April 2, 2014"}, {"Title": "Beautiful 80 inch 2014 HDTV", "Author": "URCME \"urcme\"", "ReviewID": "RP8S5LGXF3NIB", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moCJZCYP9YC3Z2embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moCJZCYP9YC3Z2refresh_preplay() {\n\ndocument.getElementById(\"cv_moCJZCYP9YC3Z2chiDiv\").innerHTML = document.getElementById(\"cv_moCJZCYP9YC3Z2hiddenPre\").innerHTML;\n};\ncv_moCJZCYP9YC3Z2refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moCJZCYP9YC3Z2so;\t   \n\n\nfunction cv_moCJZCYP9YC3Z2loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moCJZCYP9YC3Z2so = new SWFObject(swfLocation, \"cv_moCJZCYP9YC3Z2AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moCJZCYP9YC3Z2so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moCJZCYP9YC3Z2so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moCJZCYP9YC3Z2so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moCJZCYP9YC3Z2so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moCJZCYP9YC3Z2so.setAttribute(\"height\", swfHeight);\n          cv_moCJZCYP9YC3Z2so.setAttribute(\"width\", swfWidth);\n          cv_moCJZCYP9YC3Z2so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moCJZCYP9YC3Z2so.write(\"cv_moCJZCYP9YC3Z2flashcontent\")) {\n          fp_resizePlayerSpace('cv_moCJZCYP9YC3Z2', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moCJZCYP9YC3Z2';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moCJZCYP9YC3Z2', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moCJZCYP9YC3Z2loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moCJZCYP9YC3Z2\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m39ZEQJ9L6S9PT\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m39ZEQJ9L6S9PT\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RP8S5LGXF3NIB\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m39ZEQJ9L6S9PT/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moCJZCYP9YC3Z2duration')) {\n      document.getElementById('cv_moCJZCYP9YC3Z2duration').style.display='none';\n    }\n    cv_moCJZCYP9YC3Z2loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moCJZCYP9YC3Z2loadSwf(movieID, playerVersion) {\n   return _cv_moCJZCYP9YC3Z2loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moCJZCYP9YC3Z2newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moCJZCYP9YC3Z2', 0, h);\n}\n\nfunction cv_moCJZCYP9YC3Z2resetPlayer(w,h,bw,cc) {\n  cv_moCJZCYP9YC3Z2newHeight(h);\n\n  cv_moCJZCYP9YC3Z2so.addVariable(\"resetBandwidth\", bw);\n  cv_moCJZCYP9YC3Z2so.addVariable(\"cacheCode\", cc);\n  cv_moCJZCYP9YC3Z2so.setAttribute(\"height\", h);\n  cv_moCJZCYP9YC3Z2so.setAttribute(\"width\", w);\n  cv_moCJZCYP9YC3Z2so.write(\"cv_moCJZCYP9YC3Z2flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moCJZCYP9YC3Z2RollOverImg = new Image();\ncv_moCJZCYP9YC3Z2RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81Mj0-kaCBS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moCJZCYP9YC3Z2preplay = document.getElementById('cv_moCJZCYP9YC3Z2preplayImageId');\nif (cv_moCJZCYP9YC3Z2preplay) {\n  cv_moCJZCYP9YC3Z2preplay.onmouseover = function() {\n    cv_moCJZCYP9YC3Z2preplay.src = \"http://ecx.images-amazon.com/images/I/81Mj0-kaCBS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moCJZCYP9YC3Z2preplay.onmouseout = function() {\n    cv_moCJZCYP9YC3Z2preplay.src = \"http://ecx.images-amazon.com/images/I/81Mj0-kaCBS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moCJZCYP9YC3Z2preplay.parentNode;\n\n  var cv_moCJZCYP9YC3Z2currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moCJZCYP9YC3Z2currentClick) {\n      return cv_moCJZCYP9YC3Z2currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:13 Mins  This is my second Sharp HDTV and this LC-80UQ17U is ultra fast and ultra modern. First off the TV sits higher off the TV stand. You can get your hand underneath and easily clean. The TV is more sturdy with two mounting feet as opposed to one mounting stand, therefore reducing overhead fan vibration as in my living room and cracking sounds from cooling and heating during power up and power off.  The Browser is 100% faster than lasts years model and plays Flash Content, and Netflix has been reformatted and very pleasing to the eye. When you first power the TV on it defaults in Standard Energy Star, or it's lowest resolution setting and it's makes lovely picture. After calibrating the picture settings using the Energy Star it gives an all around beautiful picture with super brilliant \" whites, blacks, reds, blues, and skin tones\". I have not tested the 4k content yet but will order from Amazon some 4k movies soon. The remote is almost identical to last years Sharp LC80-LE857U. Smart Central is very fast and Youtube plays so clean.  Having the privilege of two 80 inch Sharp TV's in two years the first being a LC-80LE857U and now a LC-80UQ17U  I can honestly say  with much experience that the 2014 Aquos + is a knockout in the first round and has overly pleased me in the short time I have owned it. I will update in one week after playing 4k HD dvd's in my 4k ready Sony DVD player. The voice on the attached video could have been better had I used my camera rather than my cell phone camera.  Sharp shipped my TV directly from their distribution center to my home with a free setup on April 14th 2014 using NVC Logistics Group  Pro #45735433. It pays to have your friends and family convert to Sharp!!!", "Date": "April 15, 2014"}, {"Title": "Lc60UQ17U", "Author": "Charles M Reynolds", "ReviewID": "R2MVWAVD1DT6W5", "Overall": "5.0", "Content": "Love the smart feature and built in wireless. Had to E-mail sharp to down load the manual and print it out to make it easer to use. The on screen one is good, but takes a lot of time to get through. I've only had this set for 4 weeks but it has been great so far.", "Date": "April 30, 2014"}, {"Title": "Great TV", "Author": "Hoops", "ReviewID": "R20PGGHMIGLTEZ", "Overall": "5.0", "Content": "I love buying everything on Amazon, and I usually do. I recently purchased the LC-70UQ17U and it was an exception to my usual Amazon buying sprees. When I heard about this tv, I thought it was a great idea. Something decently priced (not $8-17K like a few other models) and it has the ability to play 4k video (the THX certification is a major plus too). At it's current price this tv is still a big purchase, so I had to see it in person before I bought it. Just looking at online stats wasn't enough for me.I searched and found that apparently in my area (Southern California) only Paul's TV had any of the UQ series in stock, so I went there. I saw it on the wall playing a 720p signal (due to some of their tv's not being able to handle higher than 720p), even as close as a couple feet away it as good as 1080p to me. Of course I compared the UQ to its neighbors a HD Sony and a HD Samsung of similar size. The UQ was much clearer. I noticed that they had one UQ hooked up to Direct TV and running at 1080p in the corner, it  was incredibly clear in 1080.Then I went through the store comparing the UQ to the expensive UHD tv's. Normally I can easily spot the difference between 1080p and 1080i, but I couldn't tell the difference between the UQ and the UHD tv's they had on display running the same signal. They made me an offer for the tv that I couldn't refuse (free soundbar), so I bought it there instead of on Amazon.It has arrived at my house, it's setup, it's on right now and it's a handsome beast of a tv. When you initially turn it on it's in energy saver mode and it looks very good, then you change it to THX mode and it looks even better (I don't plan on tweeking either of these settings, they are great right out of the box). When playing Direct TV at 1080p it is crystal clear, when playing Blu rays at 1080p/24p it's amazingly clear with great depth of color. Haven't seen a bit of LCD lag yet when playing action movies or sports either.The tv itself is amazing, and future ready since it can play 4k content. The only small issue I have is that I haven't found 4k content that it can play yet, but this is most likely due to me trying do it the wrong way. I'm too cheap to buy a 4k media hub that will plug into the tv through HDMI, so I keep trying to play 4k content through USB. Hasn't worked yet, but I'll let you know if it does.Ps. Not a single dead pixel on mine.", "Date": "April 9, 2014"}, {"Title": "Stop searching and BUY this TV!! This is the absolute clearest and brightest 1080P on the market today.", "Author": "Jenksie13", "ReviewID": "R35343UOWBO9VP", "Overall": "5.0", "Content": "I originally bought the Samsung UN60ES8000 and noticed some severe \"pixel-ation\" issues and shadows behind and around the letters on the screen so I returned it and got the Sharp LC-70UQ17U after doing some more in depth research and visiting Best Buy a couple times to look at the tv's. At Best buy I was told that the Samsung 8000 series was one of the best on the market. Honestly I could not believe that 8000 Series looked like that. Once I got home and hooked the Sharp up it proved to be a great choice. This tv blows that Samsung out. There is no square pixeling around the letters and the round letters are nice and smooth. The image is super bright and just as clear as an Ultra 4K. If you buy this you will not be disappointed. If you read the bad reviews on Amazon they are all about dead pixels or a cracked screen. So they're not accurate of the actual quality of the image. For the reviews saying there is image loss from a side angle that is completely wrong. Go to Best Buy and look for yourself. The 3d isn't the best when simply converting regular 2d to 3d but when watching a 3d movie it is just like the theaters and how often do you watch regular tv is 3d? I would definitely recommend buying this tv but make sure you pay for the better Q17U model with the THX and 12,000,000:1 contrast ratio and you won't be disappointed. This thing weighs like 100lbs and has a super solid base made of metal and weighs about 10 lbs alone. To me a heavier tv means better quality. No cheap plastic here. The Samsung had a really light base and wasn't stable at all. If you buy this Sharp and think you may like another tv more then buy a Samsung or Sony and compare them at your house side by side and see the difference. Best Buy will allow a return for any reason with in 15 days. You will see there is no comparison. This tv is the absolute best 1080P out there.", "Date": "May 24, 2014"}, {"Title": "Good unit", "Author": "Jim Savoy \"Simple Jim\"", "ReviewID": "R16UJHV388ITPH", "Overall": "5.0", "Content": "I bought mine through Best Buy locally, but did get them price match when amazon dropped the price a couple of hundred bucks momentarily....Black levels are awesome, color is vibrant in game or dynamic mode, if that is your taste. I did find there is a break-in period. The break-in seems to be about a 100 hours. I noticed better black, better color, better off angles after in ran a while. The audio is pretty good, I have several other flat panels and the Sharp seems to have the best sound, it has a little subwoofer built in.Clarity is the deal, the extra pixels really seem to matter and I use mine for basically Dish TV with an occasional Blu-Ray. I live rurally so no 4K yet but I'm going to rent or buy something just to check it out.So far no negatives at all, and the betterment with break-in was a nice surprise.Bon appetite.....", "Date": "April 26, 2014"}, {"Title": "Expect the best possible picture quality - bar none!", "Author": "Alex King", "ReviewID": "R7X56MHS5HS6B", "Overall": "5.0", "Content": "Suffering from thick cataracts and macular degeneration in both eyes, I need highest possible resolution and contrast ratio in order to view an 'acceptable' picture. I tried a VIZIO advertised with 10M-1 Dynamic Contrast Ratio to no avail. After much research, replaced the VIZIO with this Sharp that has an advertised 12M-1 Dynamic Contrast Ratio.  It is 3D, and although I do not use 3D, the 2D picture rendition is nothing short of fantastic when viewed in fixed dynamic picture mode.  I can now sit much further from the TV screen and still enjoy it. Although expensive, in retrospect, I consider this set well worth the price.", "Date": "June 3, 2014"}, {"Title": "Exellent. Throughly satisfied", "Author": "pusya", "ReviewID": "R1DQKTWAM2SHO8", "Overall": "5.0", "Content": "Good stuff. Pleasing picture quality. Good-looking TV. Went with this as Quattron+ is the best TV display tech out there right now, save the 4K", "Date": "May 17, 2014"}, {"Title": "Good TV", "Author": "M", "ReviewID": "R3SQZ958KR5W5A", "Overall": "5.0", "Content": "Great Picture - great features - love the TV - only problem is sound output via optical digital connection - yet to figure this one out", "Date": "April 26, 2014"}], "ProductInfo": {"Price": "$2,997.00", "Features": "Refresh Rate: 240Hz (Native); AquoMotion 960 (Effective)\nBacklight: LED (Edge-Lit)\nSmart Functionality: Yes - SmartCentral 3.0 with Smart Guide, apps, and mobile connectivity\nDimensions (W x H x D):  TV without stand: 62.1'' x 36.7\" x 2.3'', TV with stand: 62.1'' x 38.5'' x 15.2'\nInputs: 4 HDMI, 2 USB, PC input, RS-232C, MHL\nAccessories Included: 2 pairs of Bluetooth 3D glasses, Universal Remote", "Name": "Sharp LC-70UQ17U  70-inch Aquos Q+ 1080p 240Hz 3D Smart LED TV", "ImgURL": "http://ecx.images-amazon.com/images/I/41bR2z-7AGL._SX300_.jpg", "ProductID": "B00HZZZMNI"}}