{"Reviews": [{"Title": "Sharp LED 70\"  Overall great picture for the price.", "Author": "jbc1480", "ReviewID": "R3KLYCDN58SFON", "Overall": "5.0", "Content": "Overall the TV has been great.  I am loving all 70\" of it.  For the price its a great TV.You do need to adjust the settings.  The picture settings out of the box are not satisfactory.  The picture seemed very washed out.  I tried some settings recommended by another user on last years Sharp 70\" model and they were not satisfactory either.  I Just tinkered with the settings myself and adjusted it accordingly to my taste and found a great picture.  It does take a few days watching different types of programming(cartoons vs sports vs movies) to find the setting that I enjoy.  I was able to get the blacks nice and dark that I prefer since I was moving from a plasma to a LED.  Also realize the TV came defaulted to 120Hz and needs to be changed to 240Hz to get the most from the TV.  The difference in the 120 vs 240 is very noticeable to me.**UPDATE**I mentioned earlier that \"Also realize the TV came defaulted to 120Hz and needs to be changed to 240Hz to get the most from the TV.\"This is NOT accurate.  This is the motion enhancement setting.  I have actually changed this setting to 'OFF\" to eliminate \"image halo\" that I noticed while watching golf and hockey", "Date": "March 31, 2014"}, {"Title": "Impressive out of the box", "Author": "Chris J Salmon", "ReviewID": "R11D79X9SNZWAZ", "Overall": "5.0", "Content": "Very impressed with this TV so far... Admittedly, I've only had it for 24 hours.  Setup was very easy, however did notice incorrect instructions on how to setup the stand.  Picture quality is very impressive.", "Date": "March 7, 2014"}, {"Title": "A great upgrade from our older Aquos", "Author": "Linda", "ReviewID": "R1DEERSA6AQ9AF", "Overall": "5.0", "Content": "We've had the unit for two weeks now, and are very pleased. Upgraded from an older Sharp Aquos 42 inch to this more modern 60 inch. Our smaller set was on a shelf sticking out from a floor to ceiling bookcase. The base on this one is a bit larger than the old one, so I did away with the shelf and installed an articulated wall mount to hang this one on. Makes for a much more stable install, and it's easier to access the back for cabling, etc.The picture quality is excellent, and it actually consumes less power than our older model. At first, wasn't sure about the downward firing speakers, as our older unit was front-firing- no problem at all. For our room, there is plenty of volume. I'll get the external amp/speakers connected for when we want that immersive experience...We haven't really access the \"Web-based\" features yet, but I have streamed movies from my DLNA server on the PC here, and from a USB \"thumb drive\". That works quite well.We watched the price on Amazon after we ordered, and were able to take advantage of a $70+ price drop within the price match guarantee period.Overall, we are very pleased with our purchase. Recommended.", "Date": "March 21, 2014"}, {"Title": "great tv", "Author": "nicole trotter", "ReviewID": "R216BYYQCV0RHE", "Overall": "5.0", "Content": "I installed this tiv in my media room and love the picture after a little adjustment of the settings.  well worth it", "Date": "March 13, 2014"}, {"Title": "stunning", "Author": "Ronald L. Kelley", "ReviewID": "R25Q0PP2GRDGBH", "Overall": "5.0", "Content": "Amazing picture. Skin tones are very natural and colors are brilliant. Images are sharp and detailed, didnt see any motion blur, black levels were good. Couldnt be more pleased with the tv. I dont care about internet connectivity so I didnt try it. This is not a 3D tv if you care about that but if you just want to watch tv with a great HD pictue I highly recommend it.", "Date": "March 10, 2014"}, {"Title": "Outstanding picture, nice features with a few issues", "Author": "Andrea Polk", "ReviewID": "RZ373OVWROL82", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moFK0Q7TMTGWNDembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moFK0Q7TMTGWNDrefresh_preplay() {\n\ndocument.getElementById(\"cv_moFK0Q7TMTGWNDchiDiv\").innerHTML = document.getElementById(\"cv_moFK0Q7TMTGWNDhiddenPre\").innerHTML;\n};\ncv_moFK0Q7TMTGWNDrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moFK0Q7TMTGWNDso;\t   \n\n\nfunction cv_moFK0Q7TMTGWNDloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moFK0Q7TMTGWNDso = new SWFObject(swfLocation, \"cv_moFK0Q7TMTGWNDAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moFK0Q7TMTGWNDso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moFK0Q7TMTGWNDso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moFK0Q7TMTGWNDso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moFK0Q7TMTGWNDso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moFK0Q7TMTGWNDso.setAttribute(\"height\", swfHeight);\n          cv_moFK0Q7TMTGWNDso.setAttribute(\"width\", swfWidth);\n          cv_moFK0Q7TMTGWNDso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moFK0Q7TMTGWNDso.write(\"cv_moFK0Q7TMTGWNDflashcontent\")) {\n          fp_resizePlayerSpace('cv_moFK0Q7TMTGWND', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moFK0Q7TMTGWND';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moFK0Q7TMTGWND', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moFK0Q7TMTGWNDloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moFK0Q7TMTGWND\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1EEOVAKNU5NLM\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1EEOVAKNU5NLM\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RZ373OVWROL82\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1EEOVAKNU5NLM/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moFK0Q7TMTGWNDduration')) {\n      document.getElementById('cv_moFK0Q7TMTGWNDduration').style.display='none';\n    }\n    cv_moFK0Q7TMTGWNDloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moFK0Q7TMTGWNDloadSwf(movieID, playerVersion) {\n   return _cv_moFK0Q7TMTGWNDloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moFK0Q7TMTGWNDnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moFK0Q7TMTGWND', 0, h);\n}\n\nfunction cv_moFK0Q7TMTGWNDresetPlayer(w,h,bw,cc) {\n  cv_moFK0Q7TMTGWNDnewHeight(h);\n\n  cv_moFK0Q7TMTGWNDso.addVariable(\"resetBandwidth\", bw);\n  cv_moFK0Q7TMTGWNDso.addVariable(\"cacheCode\", cc);\n  cv_moFK0Q7TMTGWNDso.setAttribute(\"height\", h);\n  cv_moFK0Q7TMTGWNDso.setAttribute(\"width\", w);\n  cv_moFK0Q7TMTGWNDso.write(\"cv_moFK0Q7TMTGWNDflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moFK0Q7TMTGWNDRollOverImg = new Image();\ncv_moFK0Q7TMTGWNDRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81REc5KH0ES._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moFK0Q7TMTGWNDpreplay = document.getElementById('cv_moFK0Q7TMTGWNDpreplayImageId');\nif (cv_moFK0Q7TMTGWNDpreplay) {\n  cv_moFK0Q7TMTGWNDpreplay.onmouseover = function() {\n    cv_moFK0Q7TMTGWNDpreplay.src = \"http://ecx.images-amazon.com/images/I/81REc5KH0ES._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moFK0Q7TMTGWNDpreplay.onmouseout = function() {\n    cv_moFK0Q7TMTGWNDpreplay.src = \"http://ecx.images-amazon.com/images/I/81REc5KH0ES._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moFK0Q7TMTGWNDpreplay.parentNode;\n\n  var cv_moFK0Q7TMTGWNDcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moFK0Q7TMTGWNDcurrentClick) {\n      return cv_moFK0Q7TMTGWNDcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 7:49 Mins\"New for 2014, the Sharp Aquos Q LC-60EQ10U LED Smart TV with up to 240Mhz refresh rate offers a budget-friendly option at the 60\" size; giving consumers 20% more viewing area than 55\" TVs in the same class.\" That's something you could get if you simply read the product description on Amazon, and it's what I'll try to avoid in this review.I think it's important to share personal experience as a user, and be honest about what you like and don't like about the product, when writing a review that is intended to be helpful to others. Being an Amazon shopper myself, I read a lot of reviews and truly appreciate the ones where people have taken the time to explain issues and mention problems they encounter. We are all coming from different points of view, but more information is always good in my book. Especially when I'm considering dropping over 1K on a TV!The bottom line for me on this HDTV, and what I hope to illustrate with the written and video review is that the Sharp LC-60EQ10U is a VERY good 60\" LED HD smart TV. However, it does have a few issues that may be major problems for some users, and make me unable to give it a full 5-star recommendation.WHY THIS LONG REVIEW?Forgive me for making this review so long. I'm really lucky. I got the opportunity to review this product for the Amazon Vine, versus purchasing it myself. No, I do not work for Sharp or Amazon, nor do I get paid for my reviews. This review is that of an electronics enthusiast, who is also a cord cutter (no cable TV - I use over air and streaming media) with an above average understanding of how to setup and use all kinds of electronic devices. I've drooled over TVs of this size, but have never been able to afford one, so this opportunity to review this Sharp was amazing!That being said, I write all my reviews with the same goal in mind. I want to provide you, a potential buyer of this product with a honest review that shares my experience with the product, and points out potential issues you may have with it - should you decide to buy.I'm not an 'expert', but I am like you, looking for good products at the right price.MY EXPERIENCE:For me, moving from a 7 year old 42\" Samsung plasma HDTV to the Sharp Aquos Q smart TV was a big change. Both in terms of viewing area, functionality and picture quality.The overall impression I have of the Sharp Aquos Q is mostly very good. I would recommend it to others as a good option if you're looking for a big screen size with smart TV functionality that's good for sports, movies, and gaming, at a reasonable price.NOTE: Those who are looking for a 3D TV should check out the Sharp LC-60SQ15U  60-inch Aquos Q+ 1080p 240Hz 3D Smart LED TV; also well priced and feature-rich with other perks. (You can check out SharpUSA dot com to see the differences in the models.)SETUP: UNBOXING & STAND ISSUESAfter the TV arrived via UPS my husband and I slit the sides of the box to expose the TV.NOTE: The included directions suggest leaving the box in tact to use it as a work space; placing the TV face down on it to put on the stand. We failed to see this prior to the 'slit' action.On the top portion of the box, embedded in Styrofoam is the remote, some screws, batteries for the remote, Product Registration card, and a general Setup Guide for 13 different Sharp Aquos models in English, Spanish and French.NOTE: No `User Manual' is found in the box. It can be found in the Menu on the TV and downloaded in PDF form online - see Questions section of the product page to find the link.We removed a layer of Styrofoam to find the TV stand base, which we would be using instead of mounting the TV to the wall. The TV appeared well packaged, and unharmed by transport.We decided to dive in immediately and setup the stand. This small job turned into a nightmare when the stand would not easily slide into place. We ended up loosening some screws that were probably not supposed to be loosened - just to get the stand onto the TV.We then re-tightened those screws when the stand was in place.NOTE: Arrows towards specific screws on the back of the TV indicate where the included screws are to go which becomes apparent when you are mounting the stand.The Setup Guide had been very confusing; small diagrams and several stands mentioned with different configurations. We are both college educated folks, but these poor directions left us a tad stumped. Eventually we figured it out by looking at it without the directions in hand, but it was a frustration!In the end, we determined we had been sent the wrong set of screws for mounting of the stand to our TV. Instead of calling up Sharp and waiting several days for the right screws, I ended up at Home Depot and returned with #5 Metric 1\" screws (4) which did the job.We used the Styrofoam to make a table to set the TV on to mount the stand, and once in place lifted it into place on the TV console bench. On a 60\" bench, it fits perfectly with inches to spare on either end. Our home theater front side speakers are slightly behind the TV and angled upward. (I'm considering placing them on the floor or mounting them behind and above the TV, but they will not fit in front of the TV on the Sonax FB-2600 Fiji 60-Inch TV Component Bench, Ravenwood Black which we purchased to use with the Sharp Q.)NOTE: The Sharp Aquos Q has very little gap between the stand and screen, so thick sound bars may obscure remote access and/or block the lower portion of the picture.CONNECTIONS ON TV:There are (4) side HDMI ports may need adapters to angle the HDMI cords backwards (so they don't show), but are fairly cheap. I got some Cable Matters 2-Pack, 270 Degree HDMI Male to Female Adapter that worked perfectly.(2) USB 2.0 ports, (2) composite video ports (red/yellow/white - 480 resolution - older standard), (1) component video (blue/green/red/white/red - my 1st Gen Wii hooked up effortlessly to this port), (1) PC-In (VGA - blue; can be fitted with a VGA to DVI adapter), wired Internet (Ethernet port) and Ant-In (for over-the-air antennas requiring digital tuner) where I attached my Mohu Leaf 50 Indoor HDTV Antenna.NOTE: If using an AV Receiver, connect to the HDMI 1 port to get it to perform correctly with the TV.A special feature of this TV is the MHL (HDMI 4 port) which allows smartphone users to connect to the Sharp Aquos Q and show their device screen on the big screen while is simultaneously charges their phone. A nice perk for those of us always looking for ways to charge our phones and share content!FIRST USE & SMART GUIDE:On scree setup is very easy, even without a decent manual included in the box. (Again, see the `Questions' area for this product to get a link to the manual.) Follow the prompts and other than setting up the WiFi (which may be tricky - I never did get it to work), you should be watching TV in less than 15 minutes.Prior to turning on the TV I attached an AV receiver, Windows 8.1 laptop with free XBMC media software, Roku 3, Apple TV, Blu-ray player, and Wii game system to the Sharp Aquos Q.As the TV comes on the `Sharp' logo appears. (This can be removed in Settings if you desire.) After this logo disappeared the system setup began.NOTE: If at any time you want to start over with your setup or make anything like factory settings in the Menu  - RESET is what takes you back to default settings in the Menu.Some basic info: zip code and provider; satellite and cable providers appear based upon your location.  I chose `Local' as I use an over-the-air antenna to get free network broadcasts in HD over air - wrote a book about how to do it: Simple Guide to Over-the-Air Free TV.You are given the option to setup an internet connection; wired or wireless in the setup. FYI... you may want to go with a wired connection.Prior to the arrival of the Q I setup a wired connection; just in case the WiFi in the TV wasn't good. I have excellent Wifi throughout my house thanks to the NETGEAR Nighthawk AC1900 Dual Band WiFi Gigabit Router (R7000) router and 60Mbps high speed internet, but I had read that some users had issues with connecting using the Sharp Aquos Q, so I purchased the TP-LINK TL-PA4010KIT AV500 Nano Powerline Adapter Starter Kit, up to 500Mbps to create a wired option. Thankfully I did, as the wireless connection would not work with this TV, so I used the wired; which was recognized immediately, and it's great!The Smart Central 3.0 (new for 2014) and the Smart Guide are nice options on this TV. After inputting my location and services I use (HuluPlus and Netflix), the guide provides a quick look at what's currently on and available from streaming sources, which is a very nice feature and works well.The guide offers you a glimpse at what's on and available, while also giving you easy access through Smart Central 3.0 to lots of apps, including games, social media, and streaming services.NOTE: These apps DO NOT INCLUDE Amazon Instant Video however, which I hope Sharp will fix in later software updates! I'd also like to see Target Ticket and Redbox options.There is a button near the center of the remote that launches the Smart Central interface, labeled `Smart Central'. Below it is a large Netflix button, but that is the only instant access app button clearly labeled. There is an option to setup your favorite apps on 4 buttons below it however.HDTV CALIBRATION RECOMMENDED:When I learned I'd be getting this TV, I purchased the Wow: World of Wonder [Blu-ray] (it also comes in a DVD version). This disc was very helpful in allowing me to fine tune this TV's settings.Out of the box the vibrancy of colors was there, but the clarity and sharpness was not. The calibration disc really helped to dial that in and I only used the `beginner' lessons. I'm working my way through the extensive `advanced' section now and will update this review with new settings as I tweak the system.The one thing I did note that was that out of the box very little `black' or contrast adjustment was needed. Blacks and whites appeared quite true without any need to fix them. That 8 million to 1 dynamic contrast ratio really is great!I highly recommend using any calibration DVD or Blu-ray disc tutorial to help setup your picture the way you like it.Be aware that this should be done during a time when you would most likely be watching TV, as the conditions change and thus, so does how your eyes perceive colors and light. You may want to setup your settings in a dark room and in daylight and then compare the two, to see what changes.This calibration also addressed the `Soap Opera Affect' that I had out of the box when viewing Rescue Me on Netflix. More on that later.MY TV SETTINGS AFTER BASIC CALIBRATION:These are my settings after a very basic calibration done with the Disney WOW disc on my Sharp Aquos Q. I hope you find them helpful in setting up your TV.TO GET RID OF SOAP OPERA AFFECT:Go into Menu-Picture Settings - Advanced and change Motion Enhancement to 120 low or `off'. NOTE: Any higher than this setting gave me a much darker picture, despite having auto light adjustment settings turned off!Then go to Film Mode and turn Advanced to `0' (I think it's on 7 to start), and then click on Standard.  Doing these (2) things should eliminate the Soap Opera Affect.You can pump the Motion Enhancement up to 240Hz during movies like Skyfall (Blu-ray/ DVD + Digital Copy) where there are intermittent fast-action sequences. I noted no soap opera affect using it then or with fast sports like NHL hockey.PICTURE SETTINGS:  All done in small increments and based upon personal choice.Turn OFF Automatic Light Sensor.Backlight +6Contrast +34Brightness -3Color +10Tint +5Sharpness +6Quad Pixel Plus (2) - Standard120Hz Low Motion Enhancement (*Sports look great!)C.M.S. - HUER +2Y 0G 0C +2B 0M 0C.M.S.  - Saturation (all on zero `0')C.M.S. - Value (all on zero `0')Monochrome - OFF (If `on' you get black and white effect.)Digital Noise Reduction - AutoColor Temp - High with 10 Point OffActive Contrast - AdvancedGama Adjustment - `0'Film Mode - Advanced - `0' with Standard selected.View Mode - Auto (corrects for 4:3 programming and 16:9 to render correctly on display.)MY VIEWING EXPERIENCE:Viewing most anything on this TV is a wonderful experience. The more I watch it... the more I love it!While this TV isn't a 4K capable one, this Full HD (1080P) capable display combined with smart features makes for an excellent TV. I've experienced rich color saturation, smooth movement transitions and extraordinary definition when viewing HD broadcast TV, Blu-ray movies, and streaming, 720, 1080i or 1080p HD video.I did notice the Soap Opera Affect initially, and as stated earlier in the review, and I found a fix for it. Edge lighting may be to blame for the transitioning black and gray blotchiness, and corner darkening, but as time goes by, neither have really affected my viewing or overall enjoyment of this TV.POTENTIAL SCREEN ISSUES:The four corners of the display sometimes show a darkening - similar to a photo affect I sometimes use to accent pictures. Most pronounced when I am viewing something with a light background, the saturation level of this darkness varies. I've yet to determine if it varies with all inputs, but I see it most often when watching broadcast TV.I also note that when the screen is black - changing from one broadcast TV program to another, I will see subtle gray blotchiness on the black screen. I don't note this when viewing movies (yet...), but it may be an issue when watching very dark programs. I believe this is due to the edge lighting that is part of LED TVs, but coming from a plasma, this is new to me. Similar to ghosting (seen on plasmas after they've been on and turned off), but happening all the time when a black screen occurs.Blacks are deep and whites are bright, but these two issues with darkened displays give me pause. They may just be inherent in LED TVs, although I have a LED computer monitor that has never shown these issues so I kind of doubt it.OVERALL PICTURE QUALITY IS STELLAR:33% more subpixels and Quattron technology adding yellow to the mix makes for a gorgeous display. Deep color, fine detail and highly responsive with adjusted refresh rates up to 240Hz.I absolutely LOVE Blu-ray movies on this TV! Unbelievably gorgeous clarity and beautiful colors that were never even close with my plasma HDTV. The Quattron technology that adds those subtle shades and 8,000,000: 1 contrast really shines through.Broadcast (over air) TV in various resolutions all looks great too, but varies based upon the broadcast resolution. 1080i over air in HD (which is uncompressed 1080P which is used by satellite and cable providers) is fabulous!Using the Smart Central app to stream Netflix offers great picture quality too (720P in most cases). This will vary if your Wifi or wired internet connection is buffering a lot or not. Mine was very stable. Using the Roku 3 to stream Amazon in HD was excellent as well, thanks to the TV and a stable, fast home network connection.I connected my Sony Vaio laptop (Windows 8.1) and am using XBMC (free media center software) to stream content to the Sharp Aquos Q. I set the laptop screen resolution to 1920 x 1080 and use a HDMI port to connect it through my AV receiver. I then use a Logitech K400 wireless keyboard to navigate the PC. The Sharp TV gives me a vivid, clear picture using this peripheral.You can also tweak the Aquomotion settings to smooth pixels, which in theory gives a 'higher' high definition picture - more towards 4K. Since 4K (4X's the pixel density of FULL HD means clear pictures on big screens - even close up) or ultra-HD is still being developed, there is very little content for it at this time. I think this TV is a good compromise for those of us who don't want to pay premium prices for upcoming technological readiness. (*I know Vudu has some streaming content in ultra-HD, but again, it's not the standard yet.)You can set this TV to be on `Wallpaper' mode; either stock images or via a connected USB flash drive with photos on it, to provide low light (and low energy consumption) art versus a black screen when not in use.NOTE: Chromecast also works well with this TV, but I decided not to connect it to mine as my needs are met by all the other things I'm using right now without this addition. The Chromecast does attach easily to the HDMI ports on this TV, angled out to the side, but not visible from the front.SOUND ADVICE:The sound coming from the 20W speakers in this TV lacks depth and most will not even use it. Installed speakers are not home theater quality by any means, but you do have both an optical audio (digital - best quality) input and the old red/white analog audio inputs on the TV to add a sound bar, sound plate or connect to an AV receiver to use external speakers.I'm using the optical (digital) connection for the best sound, and going through a Denon AV receiver with Kipsitch speakers and sub woofer. Sounds amazing!I did go into Settings in the Menu and turn on Surround Sound and Voice Enhancement. I think the Voice option helps to clarify dialogue, especially when watching television programming.MISCELLANEOUS:These are things that come to mind in no particular order.  As with my entire review, some of it is subjective and thus your experience may vary based upon your previous experiences with other TVs.SMART CENTRAL APP:If you want to control your TV and its functions via an app, get the free Sharp Smart Central app (Google Play store for Android version or Apple for iOS version) for your tablet or smartphone.I installed the iOS app on my iPad 3 and it works really well! It enables me to change channels, input searches into the Smart Central Global Search internet browser, mirror videos and photos from my device onto the Sharp Aquos Q, launch apps, and much more!TIP: Some videos would not play correctly on the big screen, so play with your device orientation to figure out what works with your TV prior to taking more videos - for best results.Initially I had issues with my TV's apps not showing up on the iOS app, but after pairing and re-pairing the TV with the app, that seemed to be fixed.AUTO LIGHT ADJUSTMENT:Please note that on the Sharp TV there is an automatic lighting feature that dims the display in a bright room and auto adjusts for changes all the time. I found this to be very fussy, and turned it off. It's an Eco-friendly feature which is good, but I found it way too annoying to consistently use it.WIFI vs WIRED INTERNET:As mentioned above, I ended up using a wired connection to experience the Smart TV features on this TV. I have yet to get the Wi-Fi to connect, and I'm pretty good about techy-stuff, so this is a disappointment. I will continue to try to get it to work, and update this review as needed.I highly recommend the TP-Link Powerline products for getting a wired connection though, and setup was nearly effortless with that port available to this TV. \"Frustrating problem, easy wired fix!\"THE REMOTE:I wish the included remote had back lighting, launch buttons for Hulu Plus and Vudu that are as big as the Netflix button and larger buttons for Volume, Channels, Input and Smart Central.NOTE: In Settings you can setup Parental Controls for this TV to limit access and mature content.In all honesty, I think I'll be using my iPad as a remote much of the time using the Smart Central app for iOS instead of the included remote.APPS IN SMART CENTRAL:You'll have a lot of fun options for apps to use with the Sharp Aquos Q, but Amazon Instant Video will not be one of them. A major negative for people like me who use it daily, but can be overcome by using a Roku or the Miracast function (Android tablets with an Amazon app).Netflix, YouTube and Hulu Plus users will enjoy the integration with the Smart Guide in addition to satellite, cable or OTA broadcast TV programming. Facebook, Pandora, Vimeo, Cycle World, and more, can be viewed side by side with TV viewing in a split screen - which is very handy. Launching apps with the Smart Central iOS app has been easy to do too.DUAL CORE PROCESSOR for SMART FUNCTIONS:The speed, with which the Sharp Aquos Q opens apps, navigates the Settings menu and provides information and programming, is impressive. There is very little delay when opening things like Netflix, and with a fast internet connection, that ease is made even easier.Could it be faster? Of course! But by comparison to a 48\" Samsung Smart TV that I just purchased for my mother (2013 model), the processor in the Sharp is at least 4x's faster, which to me was a thrill!The color reproduction is stellar, the rich picture detail amazing, and the smart functions are a joy to use on this TV. The processor and software in this TV make it happen.CONCLUSION:Would I recommend this TV?Absolutely, as long as you're willing to accept and/or deal with the following issues.1. No Amazon Instant Video as an app, but you can get it via other sources.2. Need to calibrate to find the `sweet spot' for picture quality to be optimum at your location with your desired programming, all of which is affected by viewing conditions (lighting).3. Sound reproduction is lacking, thus a sound bar, sound plate or AV receiver to reproduce sound is necessary.4. Possible dark edges and blotchy blacks in dark environment.5. No 3D or 4K, but if you get the Sharp Aquos Q+ model you can have those.6. Possible WiFi connectivity issues with this TV. *(I've been unable to connect wirelessly, and other reviewers mention it too.)This is a feature packed 60\" smart TV that has tons to offer the budget minded consumer. Sports, movies, and broadcast TV all look great on it, with Blu-ray playback incredibly lifelike!The ability to adjust for high speed motion, the MHL port, the onscreen guide integration, smart TV functionality, multiple connectivity options and Quattron processing that adds a BILLION more shades of color missed by other TVs , make it a solid choice at this size of display.I think most consumers, including gamers and sports fans, will find a lot of enjoyment in this well priced smart TV. Just be aware of potential issues as mentioned, and make a purchasing decision that's right for you.NOTE: Regarding the video review, I had to compress the video to upload to Amazon thus the video quality is not 100% representative of the high quality I am seeing in person.PRODUCT SPECS: Sharp Aquos QScreen Size 60\"Refresh Rate 240HzNative Resolution 1080pContrast Ratio 8,000,000:1Headphone Jack NoSpeakers:  Bottom, Down FiringSpeaker Output: 10W x 23.5mm Mini Jack (1) Headphone Out; (1) PC Audio InCoaxial Input (Ant.) YesComponent Video Input 1Composite Video Input 2 (1 Shared)Ethernet Connection YesNumber of Rear HDMI Connections 4Number of Side / Front HDMI Connections 0Optical Digital Output YesPC Input VGA / HDMIPhoto Card Reader NoUSB Input 2Wireless Connectivity Built-In Wi-Fi (**Reviewer has been unable to get this to connect.)DLNA Certified YesDual Core Processor YesIncluded Remote Control StandardPanel / Backlight Type Edge-Lit LEDResolution Upscaler NoSmart TV / Apps Platform SmartCentral(tm) 3.0 (2014)Speaker / Surround Processing Virtual SurroundTHX Certified NoWeb Browser YesPower Consumption when off Exceeds Energy Star StandardsPower Consumption when on Exceeds Energy Star StandardsDimensions (H x W x D) - with stand 33.9\" x 54.3\" x 14.6\"Weight - With Stand 61.7 lbsDimensions (H x W x D) - without stand 32.5\" x 54.3\" x 3\"Weight - Without Stand 55.1 lbsDimensions (H x W x D) - Shipping 37.3\" x 59.9\" x 9.8\"Weight - Shipping 80.5 lbsLabor Warranty 1 Year Manufacturer WarrantyParts Warranty 1 Year Manufacturer Warranty**Extended service plans available on Amazon.**", "Date": "May 31, 2014"}, {"Title": "Buy this tv!!!!!!!!", "Author": "Michael Biancuzzo", "ReviewID": "RCVSL9Y8CEOTZ", "Overall": "5.0", "Content": "The tv is exactly what I expected!!! The ONLY drawback maybe the sound quality but I have a sound bar. So to me this was a great purchase and I HIGHLY recommend purchasing this tv.", "Date": "April 13, 2014"}, {"Title": "Excelent product!", "Author": "Andrea C.", "ReviewID": "R3Z6X002PQQ50", "Overall": "4.0", "Content": "A very nice TV with plenty of features and great image. Low lag input and smart functions are a great addition.Downside are the Speaker quality and inability to read AVI files.", "Date": "April 11, 2014"}, {"Title": "WiFi connectivity issues / Lots of wasted time involved", "Author": "cnlsn", "ReviewID": "RPJ3KIILSMP9R", "Overall": "3.0", "Content": "The unit I received would not connect to my network. I tried the auto setup and also the manual. It recognizes my network, just will not connect after the password was entered. Also tried the WPS button method by both just pushing the button on my router and also creating a PIN on the TV and then entering it into the router over the internet. Sharp was OK in their response after I convinced them that I was in fact able to type the correct password and have updated the software. (I have 2 laptops, 2 cell phones, a tablet and a blu ray player all on my router and each one of them took only about 3 min. to figure out connections) Its shouldn't be that big of a deal to log into a network! They had a tech set up to come out though they called and said the parts they thought they needed, a new WiFi module and also maybe a mother board, were not 'in stock' at Sharp. I then called Amazon and they of course were awesome and are sending a new unit out and will pick up the original. This takes like a week though for shipping. I still have the repair tech on schedule to fix if the parts come in, I'm half worried the new TV will have the same issues. Which ever fix happens first, I will accept. Will let you know.By the way no Amazon app on this television either. Should of got a Panasonic, I think...", "Date": "May 23, 2014"}, {"Title": "Spectacular out of the box (NO CALIBRATION NEEDED)", "Author": "DVLDOG", "ReviewID": "R18F8IOZXW5TG0", "Overall": "5.0", "Content": "Spectacular out of the box(DEFAULT)Standard  Energy Star picture setting.This TV didn't need any calibration and the HD cable TV picture was perfect and this TV made my regular DVD,s look like BLUE-RAY.The other pictures options screwed up the picture and make sure the TV isn't in DEMO MODE.The sound isn't that bad after you adjust the audio settings.This TV had the best picture out of all the TV,s I have owned.PS. I DON'T WORK FOR SHARP!", "Date": "April 22, 2014"}, {"Title": "Sharp LC is a nice TV...for the money", "Author": "Paul G. Depace \"Paul D\"", "ReviewID": "R3H7ZAYITZDYIS", "Overall": "4.0", "Content": "I bought this TV because I was looking for a really BIG big screen, and I did not need 3D.  Of course, I was looking for nice quality, and the best deal possible.After installation...I realized that there are even more variables that can affect a TV's picture than just the hardware. The quality of the signal...minor color adjustments...you TV gurus know what I mean.  But you have to have the hardware to begin with...  My installer (guy mounting my TV) was a TV expert, having been in charge of adjusting banks of televisions at a major TV network.  Bottom Line?  I paid him a little extra to fine-tune my TV after installing it.  When I noticed the picture was not \"perfect\" on all stations;  he agreed and had to confide that the same TV from SAMSUNG would have been superior.  And when I say \"superior\"I am talking about the most important priority in your new TV...THE PICTURE.I noticed, on some stations / shows, that the people's faces, only when in the center of the screen, looked just a little \"washed out\"...and there was no way to further improve the resolution.  My installer said that the Sharp was just a little weak in the center of the screen, not bad, but just a little week in the center of the screen, especially on these really large models.  My installer clearly preferred the Samsung...  Wow.  It was a little LATE to hear that.  But it is not too late for you.My smaller TV is a Samsung...beautiful.  I kind of pulled the trigger on the Sharp, and wish I had waited.  I try to never do this...but I had to look up a very comparable Samsung (they only make a 65\"...not a 70\"...OK, not a big deal).  The Samsung, more-or-less, was about $400 more.  That is not huge money when you are talking about your \"big TV\" and you will be keeping your TV for a long time.So...not to pan my Sharp.  It is a really nice TV...  And I have no right to complain about my lot when I have a really nice 70\" TV?!  Shame on me.  But if you are reading this, trying to make a decision, pop that extra $400 for the Samsung, if you can afford it.PaulTexas", "Date": "April 12, 2014"}, {"Title": "Great value", "Author": "tammy hall", "ReviewID": "R1GUXUP76YMARO", "Overall": "4.0", "Content": "We love the TV and are pleased with our purchase. We returned a Samsung Plasma due to light reflection and this TV (LED) does a little better, but due to direct light hitting the screen, it certainly does not eliminate the reflection. Netflix movies look great as do some of the HD, cable broadcasts/signals. Sound is standard for flat panel so we purchased a Vizio wireless soundbar/surruond which we love. Smart Central aspect is a great user friendly feather. We have the TV in our basement with our wireless router on the ground floor.....Netflix streams flawlessly but youtube does buffer some....evaluate power line extenders or maybe a new router (currently have g, may upgrade to n) to improve bandwith/speed.Over all, great picture and features for ~$1,300.", "Date": "May 8, 2014"}, {"Title": "Best Picture EVER !", "Author": "Kevin Rutherford", "ReviewID": "R1DLWFU6EOKUAR", "Overall": "5.0", "Content": "OMG ! its so Clear its like looking out a Window ! This is my Second Sharp & they are Clearly the BEST !", "Date": "April 27, 2014"}, {"Title": "Love it!", "Author": "kenneth wall", "ReviewID": "R1WCAGOCNCJ3VU", "Overall": "5.0", "Content": "Great picture. Love the smart TV features. Delivery was a breeze, even though I had to assemble the base and place on TV Stand myself, but I understand why the shopping company doesn't do that. Saved over 300 dollars over in store Best Buy price and delivery was 5 days faster than expected (delivery company called as soon as the received it locally and asked if they could deliver it sooner).  As far as the picture goes.... I watched a regular dvd the other day using my blu-ray player and I could have sworn I was watching a Blu-ray discuss.  The picture quality is awesome!!!", "Date": "April 19, 2014"}, {"Title": "This TV is Legit", "Author": "Rob R8ge \"RobR8ge\"", "ReviewID": "R1UB0LLSPSJ03Y", "Overall": "4.0", "Content": "I actually traded in a Samsung 7100 for it. The Samsungs blacks were putrid, and with this TV i've noticed a difference in the positive. The sound is less than desired but with TV this big, just get a sound bar. I'm still torn with the 240HZ as i have noticed a little drag with sports, but not horrible. The picture is even if not better than Samsung and the controller is far more easier to use. I like this tv, however, I'd love to get some settings from others with it for perfect picture. Enjoy all.", "Date": "March 31, 2014"}, {"Title": "Great picture.", "Author": "John", "ReviewID": "RHKAJ520DM2L6", "Overall": "5.0", "Content": "This TV has about the best picture I have seen.  I love the colors with the four colors instead of three like the rest of the manufacturers.", "Date": "May 24, 2014"}, {"Title": "Great TV", "Author": "keith ambrose", "ReviewID": "R1XNCC46IVQDK5", "Overall": "5.0", "Content": "Great TV and Value, very real color and dark blacks, mounted it on the wall and it worked out perfect", "Date": "April 18, 2014"}, {"Title": "nice tv", "Author": "Frederick P Van Houten", "ReviewID": "R2PO6CZNCADRE4", "Overall": "4.0", "Content": "Our first hd tv.  60\" fits and works well in a 16 ft depth room, off center veiwng is fine and bright sun light room is good.  Find I get some motion sickness from the fast motions on the set; starting to get use to it. We held off getting a 2013 model to get the 240hz refresh rate which I find not needed; you can select either 120 or 240 by adjustment; 240 requires adjustment to brightness, sharpness and contrast settings.  The tv has too many adjustments for me.  Pretty much sticking with mfr settings.  Viewing photos from a usb drive is cumbersome; sequencing through many files is long.  Prefer viewing pics by hdmi cable to laptop or tablet using tv as just a monitor.  Same applies to the internet.  Using the internet even with a wireless mouse and keyboard is tedious. The large red Netflix button on the remote is easily pressed when doing other functions with the down arrow.  Best viewing for me is live news broadcasts and sports.  the fact that news broadcasts in hd will have sd content distinguishes there differences and is annoying.  Overall a very good picture and tv.", "Date": "April 9, 2014"}, {"Title": "Great", "Author": "Eileen", "ReviewID": "RRBV9GBUP6A44", "Overall": "4.0", "Content": "liked almost everything except the sound.  Love amazon sending someone to deliver and hook up plus remove the cartons.  disliked that only one person delivered the tv and my husband who is almost 80 had to help with the delivery.  when I called for the delivery I should have been told that only 1 person would be available on a Friday, so I could arrange another day. I love Amazon and always recommend this site", "Date": "April 30, 2014"}, {"Title": "Gorgeous Television!", "Author": "EuReka", "ReviewID": "R32RK62IAJDI5O", "Overall": "5.0", "Content": "I watch a ton of TV and I am going to try to touch a little bit on everything that I have experienced and encountered over the past few weeks of using this TV, Given as much TV as I watch I think the couple of past weeks have been rigorous testing for it and I'm really picky about certain things as well. With that said, Let's get to it..First Impressions:Minimalistic packaging, Typical brown box with a little bit of color but it seemed to have held up pretty well during shipping. Inside, You will find the TV has been nicely secured in many pieces of thick styrofoam! Included at the top were indents for the remote and all accessories, The stand itself was packaged with the TV and attached to the bottom chunk of styrofoam and was secured with tape and foam wrapping. The TV itself was encased in foam wrapping as well as the middle pieces of styrofoam coming down the box to protect from any \"banging around\" during shipping. Upon removal from all packaging the TV looks gorgeous and has a nice shine to it.. The frame and stand have a matte like dark black finish which goes very well with my decor. It also has a small energy savings guide sticker on the front that easily peels off, It appears to be coated in a special material that will leave no chance of it ripping and leaving part stuck onto your TV screen (like most stickies of that nature do.) Please have someone else to help you unbox and move the TV around, You run the risk of hurting the TV or worse, Yourself as this set is pretty heavy, I'd say it's true to its 80 pound description!Stand Setup:This TV includes a nice and heavy stand to secure it, It includes 8 screws, Half are used to secure the metal prongs to the stand and the other half are used to secure the TV to the prongs. This does NOT come with a cover and the entire backside is just ugly and non-shiny metal so keep that in mind if you are placing this where someone will be able to glance at the back of it. The stand seems very sturdy and required a little bit of \"wiggling\" on the last screw before it became tight enough to appear stable but it works extremely well.Inputs:2 VGA PC Connections1 USB Connection1 Hardwired Ethernet Jack1 Coax Connector (For Antennas or Cable Passthrough)2 Composite & 1 Component (older devices)2 Headphone Jacks (One Input & 1 Output)4 HDMI Inputs1 Toslink Output (Digital Audio Connection for Sounbars)TV Setup:Setup was a breeze, This thing includes so many inputs that I think it would have room for any and everything you could possibly throw at it! I evened hooked up one of my old school nintendo's for nostalgia and that was amazing! (Alot of newer TVs just don't offer the composite options anymore!)  Upon first boot the TV looks really good but we are all different and will all think a different setup is \"perfect\" so I will go ahead and post my changes and how I have all the picture settings setup and show you guys what is my \"perfection\"..AV Mode: Energy Star StandardLight Sensor: OffBacklight: +7Contrast: +36Brightness: +1Color: +12Tint: +3Sharpness: +7\"Under Advanced\"Quad Pixel Plus 2: AdvancedMotion Enhancement: OffCMS Hue: R -3, Y 0, G 0, C 0, B 0, M 0CMS Saturation: R +2,  Y 0, G 0, C 0, B 0, M 0CMS Value: 0's Across The BoardColor Temp: High10 Point: OffActive Contrast: AdvancedGamma Adjustment: 0Film Mode: Standard +0Digital Noise Reduction: AutoThese settings are what I have found to work best for me when viewing shows via my TiVo Premiere & WD TV Live Media Player. When ever I want to play video games or watch a bluray I switch over to the default Video Game & Movie settings and they work perfectly out of the box for those!! It all depends on personal preference but I know what works for me might looks horrible for someone else so just experiment and set everything to you're tastes.Sound/Speakers:Let's just get this outta the way, The built in speaks are extremely bad, but that is not a knock against this TV, In this small form factor the speakers stink in all of them! They just don't have the space for good front facing speakers and often have speakers that fire downwards or backwards instead of forwards.. This particular model has down firing speakers. I highly recommend a nice Soundbar for this gorgeous TV to accompany the crisp clean picture and I don't advise on using the onboard sound unless you really don't have an option.. With that being said here are the sound settings that will make the most of the built in speakers:Adaptive Volume: OffTreble: +15Bass: +15Balance: 0Digital Surround: OffExtended Harmonics Enhancer: Low RangeClear Voice: OnWall Mount Setup: On/Off (Use On if Mounted or Off on Stand)This will make all voice sound louder than background noise and will help to drown out some of the high action noise in the background when necessary.. You can tell there is a little bass given the speakers quality but it's not dominant by any means.Smart TV Experience:TV startup time is around ~5 seconds, Alot faster than some others I have owned in the past. Netflix and Youtube run extremely well and are snappy to remote presses. Wifi setup was okay but it took a couple of tries, The signal isn't as good as my laptop or phone but it never disconnects and streams content fine. The sound effects when using the built in smart tv functions are nice and classy.CONS:Yup, There are a few things that bother me..The Remote: It's huge, ugly and feels cheap. I'm not sure how long it will hold up to constant use if you don't have a universal remote.The Speakers: I mean yes as stated before all flat panel TVs are notoriously known for their bad speakers but of my previous LG and Sony TVs these bring up the rear for the bunch with being the \"worst\" of the worst.Screen Glare: This TV is great at blocking natural light when it was on but the opposite is true of man-made light.. This is a problem for me when I want to watch tv at night when it's dark and I have a lamp on that is in screen shot of the TV and it can be really distracting so I have had to make some accommodations for lighting the room at night.Conclusions:All in all this is an amazing TV for the price, It has anything and everything that a general user would ask for and then some! I would highly recommend it to anyone that can afford it, With a soundbar of course!! You will have countless hours of enjoyment on this set from your favorite shows and movies to crystal clear gameplay, The vivid colors of this set surely won't disappoint and we will be with you for many years to come!!", "Date": "June 6, 2014"}], "ProductInfo": {"Price": "$1,997.00", "Features": "Refresh Rate: 240Hz (Native)\nBacklight: LED (Edge-Lit)\nSmart Functionality: Yes - SmartCentral 3.0 with Smart Guide, apps, and mobile connectivity\nDimensions (W x H x D):  TV without stand: 62.6'' x 37.3\" x 3.3'', TV with stand: 62.6'' x 38.7'' x 14.6''\nInputs: 4 HDMI, 2 USB, PC input, RS-232C, MHL\nAccessories Included: Universal Remote", "Name": "Sharp LC-70EQ10U  70-inch Aquos Q 1080p 240Hz  Smart LED TV", "ImgURL": "http://ecx.images-amazon.com/images/I/41ZeiXKEbTL._SX300_.jpg", "ProductID": "B00HZZZM56"}}