{"Reviews": [{"Title": "Awesome! Almost as good as 4K.....BUT...", "Author": "Well Trained Plastic Surgeon", "ReviewID": "R2X9CXIYA4OWR", "Overall": "5.0", "Content": "Well I had a 7 year old Sharp Aquos 52\" that died recently and instead of repair chose a new TV. I looked at several makes and models but all had to have at least 60\" and 3D with excellent quality. Several were in the running and I narrowed it down to one of the Samsung 1080p or 4k models, or the Sony XBR 65\" 4k model or this one. I just could not bring myself to pay nearly $1800 more for a TV than this one. So, that left the 1080p models in my price range. I chose Sony because it had nearly the same processing as their XBR 4K model which I thought was the best TV on the market at present. Also this one is 70\" and that was also a big plus. I looked at this in this showroom of local dealer and thought the color accuracy was much better than any other TV except the Sony XBR.I am a self proclaimed Home Theater SNOB so I am VERY picky about audio and video and I am usually an early adopter of new technology except this time I chose to not pay more for 4k technology.When we first received this TV out of the box the settings absolutely suck!! So I popped in my ISF HDTV Calibration DVD and calibrated my TV as I always do with a new TV. (For those that do not know ISF is the Imaging Science Foundation and makes standards by which many Movie Theater screens are calibrated. Consider it the THX of the Video world.) Anyway, that made the set MUCH better BUT it still sucked....only less than before. Sony has absolutely NO info in the Owners Manual about calibrating the TV or using the settings available in the Options Menu.My wife initially complained that we spent nearly $3000 for TV, home delivery, install/setup, removal of old 52\" TV, and 5 year warranty and got a fuzzy weak washed out video even after ISF Calibration.  After an argument, frustration, and an element of buyer's remorse I decided Sony couldn't possibly send out a TV of this Caliber with NEARLY the same guts as their 4K XBR I drooled over and have such poor clarity and washed out image as I was seeing. So I fiddled with the settings and my wife and I both agree it is INFINITELY BETTER. It looks like a top quality cinematic picture with just about any HDTV source. It looks completely transformed compared to initial or even ISF calibration settings.I ended up with a custom setting on the TV that I think is as good as it gets short of Sony's 4K XBR.  My settings are:Picture Mode - CUSTOMBacklight - MAXPicture - 92Brightness - 53Color - 56Hue - 0Color Temperature - NEUTRALSharpness - MAX.  (I realize that usually Sharpness should be low but,...it just looks better with NO Ghosting)Noise Reduction - HIGHMPEG Noise Reduction - HIGHDot Noise Reduction - AUTOReality Creation - MANUALResolution- MAXNoise Filtering - MAXSmooth Gradation - OFFMotion flow - SMOOTHCinemotion - AUTOAdvance Settings- Black Corrector - HIGH- Adv. Contrast Enhancer - HIGH- Gamma - 0- Auto Light Dimmer- OFF- Clear White - OFF- Live Color - MEDIUM- Detail Enhancer - HIGH- Edge Enhancer - HIGH- Skin Naturalizer - OFFWith these settings the skin tones are natural, colors are believable, images and sharp and so real they are ALMOST 3D even without the 3D feature turned on. There is NO significant Jittering of the image even with fast moving objects. Motion is cinematic quality and very fluid. Blacks and whites are near perfect. The level of detail and crispness of the image even in low lit screen images is AWESOME. One of the most difficult images for any video screen to display is a checkered or tweed type pattern typical on a male tweed jacket. There is NO discernible ghosting or edge enhancement/glowing which is easily noticed on a males checkered/tweed jacket. Detail is so good you can see most pores on someone's face and even the fibers and texture of a T-shirt. Hair strands on someone's head or beard are crisp. It truly is an AMAZING VIDEO QUALITY!! As long as you fiddle with the settings you will be happy. I suggest starting with my settings above and adjust to your liking.Also in my opinion the remote is terrible. I have a universal remote so I rarely use the remotes that come with electronics except for first time setup. This remote is NOT intuitive and buttons are not laid out in a manner that makes sense except the Play/Rec type buttons and keypad as those are standard. The center buttons are what I mean by poor lay out. Once you get past that then calibrating the TV for AWESOME video took some time but is very doable.I hope this helps others that are in the market for a Top notch HDTV.", "Date": "May 7, 2014"}, {"Title": "GREAT QUALITY FOR AN EDGE-LIT", "Author": "Joe Phil", "ReviewID": "R2771HM7CHLE8", "Overall": "4.0", "Content": "First I would like to start by saying THIS ITEM JUST GOT A PRICE DROP.Second, IGNORE THE 1STAR REVIEWS. They were made by immature people who do not own the TV and just lowered the ratings!Now this is an initial thought and opinion review. Keep in mind that this set is EDGE-LIT and does not offer local dimming. With that aside there is very minimal edge \"clouding\" but, picture quality is flawless! Blacks are true and colors are vivid with the presets. You will however, definitely get the most out of it if you do some slight advanced picture tinkering. The new wedge shape allows for better speaker placement so sound is very crisp and clear, just as with the picture, it is best to tinker a bit with the audio settings to find what best suits you.CONS: The remote needs some getting used to. It doesnt have a MENU button and some settings are hidden. Using the options button pops a number of settings on the side of the TV but not the full package(if that makes sense). To get your complete settings you need to press the HOME button which will take you to Sony's PS4 style interface and scroll to the settings tab3D is okay at bestMY TOTAL RATING-3.8 out of 5", "Date": "April 7, 2014"}, {"Title": "I am a bit underwhelmed after owning the KDL65W850A", "Author": "J. A. Torres", "ReviewID": "R1MWK1J3Z086L2", "Overall": "4.0", "Content": "After 2 months of anticipation I am not jumping for joy about this TV. I originally owned the KDL65W850A and was wowed from the second a picture came on to the screen. The blacks were deep an rich the color popped and was accurate. Unfortunately I kept receiving TVs with panel problems (Banding then clouding). I tried four of those before I gave up and decided to wait for the new models due on March of this year.After taking Amazon forever and a day to get this TV (KDL70W850B) in stock, I finally got my TV delivered today 4/10/14 and when I turned it on I immediately knew this TV was not going to wow me like the KDL850A. The colors looked dull and not as accurate in comparison. I also noticed a bit of white clipping before making adjustments. I noticed also some ghosting and luckily after a bit of tinkering it seemed to subside or it could have been the specific TV channel picture was of poor quality. The blacks are good but not great. I also noticed a bit of clouding and ever so slight flash lighting while looking at a total black background (Windows desktop) while sitting in a darkened room. I was a bit bummed to see that since only 1 out of the 4 KDL850As I had received had those issues. I can definitely tell you for sure that the TRILUMINOS  display makes quite a bit of difference and SONY made an big error removing it from this TV. Sony should have forgone the extra 5 inches in screen size and just tried to continue improving on what they produced last year with the KDL850A. I also read somewhere (not 100% sure) that the panel manufacturer for this TV are not the same as the one for the KDL850A.Some other quick things of note. Sony Changed the home screen layout from the KDL850A. Now the configuration icons are located at the top right hand corner of the screen and are quite a bit small for such a large screen. Looking for the software update location was a bit frustrating as they also moved that. You have to hit home on the remote then go to the upper right hand corner of the screen and click on the question mark and scroll down to I believe is Support and click that and then scroll down again and click update software. I also want to add that the GUI seems like it lags a bit as well as the response time in the remote. Also a lot of the pro calibration features have been stripped from this TV.I will add more info and correct any while also adding pictures in the coming days. For now I am rating this TV a 3.5 out of 5Update#1Noticed the picture on the TV no matter how much you calibrate looks soft and lacking in clear detail also there seems to be a slight motion blur and the only thing that helped was changing the settings so I ended up with the Soap Opera Effect.Another thing, the clouding is much more pronounced than I originally thought. Earlier I was watching in a semi dark room and it was noticeable but not overly distracting but at night in a pitch black room watching a dark film like Tron or Riddick was painful. Increasing the Advanced contrast feature helped reduce the clouding a bit but it also degraded the picture quality. I tried using the Disney WOW disc and while it made some slight improvement overall, I don't think it will be enough to keep me from returning this TV. I think since I can not afford the 4k SONY tvs that I will try the KDL65w850A once more and see if I get lucky this time. At this point I would of even gone a lot smaller and tried the KDL-55W900A but it seems Amazon is not carrying it anymore other than used ones through it's Warehouse Deals.Update#2Some additional things I want to add. First the viewing angle is not fantastic. At about 45 degrees about a 1/3 of the screen or slightly more seems to become a bit washed out. So if you have a large L shaped sectional or a side chair setup off to the side of your main seating area, the person sitting there is not going to have the best viewing experience but then again very few TV offer anything better. Second my experience playing FPS games. I played COD BO 2 multi-player for 2 days (Not 2 days straight, heh) and felt there was a considerable amount of lag on Game mode scene select. I tried other modes and it just made it worse. I don't know what the lag time is on this TV but I cannot believe that is the same as the W850A (18 ms). It's not horrible like with some TVs where it takes away from the total gaming experience but it was noticeable and took a bit of time to get used to. I personally would not recommend this TV to anyone who does a lot of FPS multi-player gaming. Last thing I want to add is that I was very irritated at the fact that the 55 inch version of this TV has the TRILUMINOS  display tech on it but the 60 inch and 70 inch do not. I have a really hard time understanding SONYs thought process on this. Although it might explain why the 55 inch and the 60 inch are the same price currently on Amazon. It just makes no sense to me. I would of gladly spent a few bucks more if they included the TRILUMINOS  tech on the 70W850B so I didn't have to fork over $2000 more just to get that tech in a 65 inch 4k TV. But maybe that is SONYs plan to force people to buy the new tech.Unfortunately Amazon has no more NEW KDL65W850A TVs in stock as of 4/16/14 only used TV through the Warehouse Deals But most of those have bad pixels or scratches on the screen and housing( I don't know if they are getting any more). I am very curious about the 55 inch version KDL55W950B(This is the successor to the KDL55W900A. The specs look promising especially some key specs below. Too bad you have to go smaller to get better specs.KDL70W850B: Frame Dimming/No TRILUMINOS /Blinking Type:Line Blinking/ No mention of XDR/  Motionflow XR 480KDL55W950B: Local Diming/Yes TRILUMINOS /Blinking Type:Frame Blinking/ XDR? for 2x brightness/  Motionflow XR 480(This TV received a pretty harsh review. I hope the same doesn't hold true for the 65 inch version) www dot hdtvtest dot co dot uk/news/kdl55w955b-201403103661 dot htmKDL65W950B: Local Diming/Yes TRILUMINOS /Blinking Type:Frame Blinking/No mention of XDR?/  Motionflow XR 480Note: The (2014) KDL55W950B has Motionflow XR 480 Last Years model the (2013) KDL55W900A had Motionflow XR 960 (I have read this makes a big difference to Gamers.Update# 3I found out that this TV (KDL70W850B)is not the successor to the KDL65W850A. Just went to the Sony store site and found the KDL65W950B.The specs seem more in line with the KDL65W850A. The new KDL65W950B has local dimming and the TRILUMINOS display and the pro calibration settings are included. Retail is $3299.00 but I saw it for sale or pre-sale at ABT for $2798. I am glad I did not convince myself to keep the KDL70W850B and did more digging. I will wait for Amazon to get the KDL65W950B in stock and order it. Since ABT electronics has this listed as back-ordered (I think they meant pre-order) for 1 to 3 weeks, I am assuming that to mean that this TV will be available in 1 to 3 weeks at the Sony store and hopefully shortly after that on Amazon.KDL-65W950B @ the SONY Store (hopefully Amazon is soon to follow)Accepting Pre-Orders Now. Estimated Ship Date 05-24-2014$ 2,799.99", "Date": "April 10, 2014"}, {"Title": "Excellent Picture quality and Sound", "Author": "vufindr \"C TRUE\"", "ReviewID": "R3NX7AXZWBBF5Z", "Overall": "5.0", "Content": "Excellent picture quality out of the box(KDL60W850B). No setting changes required. This is the 2nd Bravia TV I own and both surpass my expectation.", "Date": "May 24, 2014"}, {"Title": "Best display for the money", "Author": "Stewart Lingle", "ReviewID": "R1QDVQBLQMP94A", "Overall": "5.0", "Content": "I am not sure what other reviewers are expecting from a display of this size at this price point, but I'd challenge anyone to find one more impressive than this item. The clarity, color and contrast are absurdly good. As others have indicated, however, the out-of-box settings are lacking so configuration is a must to get optimal performance. That being said, no one sells a display that doesn't require adjustment so I can't fault the product for this requirement. The design makes it thicker than competitor's offerings to provide sound enhancement. I question Sony's decision to go this route as most people who are in the market for a 70\" television probably have external audio to pair with the device. Additionally I am not thrilled with the choice to locate the IR sensor in the middle of the bottom bezel. Regardless, these are minor gripes. I bought the display for the viewing experience and it delivers this exquisitely. The set also has 4 HDMI inputs which is a selling point for me as I have exactly 4 other devices that I use for content.Another major factor in my choice of this display is a feature that TV manufacturers do not advertise: Input latency (display lag). This display has an average input latency of less than 25ms. Why does this matter? Video games! There is not another display of this size that even comes close to this low of a latency rating.If you are shopping for a 70\" display you will not find a better product dollar for dollar.", "Date": "June 6, 2014"}, {"Title": "Great tv- excellent picture quality", "Author": "S_11", "ReviewID": "R5DVZTJAJDOJ4", "Overall": "5.0", "Content": "Great tv. Sd as well as hd looks great. Tested 3d and it looks great as wellthe tv received an update as of May 13th and now the interface seems to be faster. Overall very impressed", "Date": "May 24, 2014"}, {"Title": "Excellent TV with nice features!", "Author": "Alex", "ReviewID": "RDNOC6HE06QSD", "Overall": "4.0", "Content": "The new 70W850b is a great TV.  Sony just replaced my 70R550a with this one as I previously had issues with the 550 and it seems that they corrected all their issues with the new 850.  The picture looks nice and crisp.  Although it is missing the Triluminous feature that was included in the previous W800 series, this TV still will not dissapoint.  I noticed that it also looks great when watching sporting events.  Obviously, the further you sit from this TV, the better picture you will get as this is a large screen.Sony has also revamped its interface when accessing the settings and smart features.  There are a lot more options to play with the TV settings than there were with its predesessor, the 70R550 so you will be able to adjust your display settings a lot better.  This TV also features a few extra buttons on your remote.  There is a 'football' button that will change the settings on the TV to best possible video and audio settings for a football or soccer game.  There is also 'social' button that will split your screen and allow you to continue to watch TV as well as see what is tranding in the social world.The 3D on this unit is Active and not Passive so you will have to spend a little more on the battery powered glasses.  Being Active in my opinion transmits a better HD picture than if it were Passive so although glasses do cost more, you gain picture quality.The design is also very nice and sleek with the new Wedge design.  Although I wont benefit from the new improved sound system as I have a Bose system already, I can tell you that the sound is way better than any other flat screen I have owned.  It is like having a built-in soundbar at the bottom of your TV.  If you are going to have it up on the wall, the thickness of the Wedge probably will not bother you but I can see if you have it on a stand where it might not look as nice as the thinner TV's.  It does have a nice design so it still looks like a updated TV even though it is on the thicker side than most flat panels.Overlall I think this TV, although it is missing a few features that would bring it over the top, it is an excellent TV.  I would definetly reccoment this TV if you are looking for a large screen as you will not be dissapointed.  This is the largest Sony screen you can get before jumping into the 4K so for the size and price, it really can't be beat.", "Date": "April 23, 2014"}, {"Title": "Picture quality is great, Smart Interface could be a little faster", "Author": "B. Nguyen \"Yes?\"", "ReviewID": "R5QER0NLIXJYF", "Overall": "4.0", "Content": "I bought this from FRYS from one of their sales. $1799  shipped home by freight services. No issues, no damage to tv.TV come with stand already attached, Total weight is about 98 lbs so this is a 2 person job. The metal stand seem strong but the TV still wobble a little bit. Sony manual recommend using a wire to secure the tv to the wall so it doesn't fall forward.Color of tv out of box was good, there was just small amount of adjustment to my liking. I haven't seen a triluminous screen in store (no store seems to have it setup) so I can't compare to that one but this screen is beautiful, I can't complain.After the initial setup, the tv connected to the internet and download and update (I used LAN port).I watched 3D movies and the 3D was impressive. Did not notice any ghosting may be the update I download fixed this as people were complaining the 3D wasn't working well before.Smart center works good but occasionally they're a little lags and studded. The speakers volume is decent. Being 10 watt each and downward firing. They were much better than my samsung LED tv (slim with like 3 watt) but no match for the other samsung plasma tv that has extremely loud speakers.Things to note:- Included sony 3D glasses were heavy but works fine. They also were foldable. Went to bestbuy and bought 2 set of $20 samsung 3D and they works fine also, no issue with quality. The samsung glasses to be are better b/c they're much lighter. Both use coin battery.- When you turn on your TV, you can watch stuff from your cable or one of your input. The smart functionality is still booting and if you try to access it during that time it will tell you to wait. This is a 20-30 second wait after your TV is on. I haven't use the other tv like samsung and LG at home so I do not know if this process are the same for them. This could be annoying if you want to turn on your TV and watch netflix right away.- When using my home media server (my nas), the tv was trying to aggregate all the content so I had like 1000+ videos it was showing it all there and very messy. I didn't know how to fix this. The next day using it. it was showing the standard DLNA setup with folder and stuff.. so I'm not sure what's going on there.", "Date": "May 8, 2014"}, {"Title": "Bought it on the spot!", "Author": "Elliott Marshall", "ReviewID": "R3236N95RSMJUD", "Overall": "5.0", "Content": "Saw this TV yesterday and the Sony rep showed us features that were very appealing, as was the fantastic and realistic picture and resolution. We are taking delivery sometime tomorrow, so I will update my review after I spend some quality time watching it.", "Date": "March 31, 2014"}, {"Title": "REVIEW?", "Author": "Robert Troeger", "ReviewID": "RS0GURYWM8XF5", "Overall": "1.0", "Content": "Why would anyone write a \"review\" if they don't even have one?  Useless!It might be OK if a family member or neighbor has one and you could check it out - then a review/comments would have SOME validity.  But, you really should have one to use for several weeks first to evaluate picture and features properly.", "Date": "April 3, 2014"}, {"Title": "2nd useless review", "Author": "CharlesO", "ReviewID": "R1VOVNETQLJOP0", "Overall": "1.0", "Content": "Saw this TV online and thought I'd write a review.  Dunno if its any good cause I dont have it.  Dont know if it will blow out in a month, or if it is flawed, or how the remote works, or how it interfaces with Netflix.  So i'm giving it 1 star.  Maybe someday i'lll change my review if I actually know anything about how good it is.  Oh wait, I cant change my stars rating after I post it.  So my reivew is useless.", "Date": "April 1, 2014"}], "ProductInfo": {"Price": null, "Features": "Refresh Rate: 120Hz (Native)\nBacklight: LED (Edge-Lit)\nSmart Functionality: Yes - Skype, Twitter, Internet Browser (Opera)\nDimensions (W x H x D):  TV without stand: 54'' x 31.5\" x 3.75'', TV with stand: 54'' x 33.1'' x 12.75''\nInputs: 4 HDMI, 3 USB, MHL\nAccessories Included: Remote, 2 3D Glasses, IR Blaster, Table Top Stand", "Name": "Sony KDL60W850B 60-Inch 1080p 120Hz 3D Smart LED TV", "ImgURL": "http://ecx.images-amazon.com/images/I/418eKVSTZcL._SX300_.jpg", "ProductID": "B00HPMCN74"}}