{"Reviews": [{"Title": "Great picture, poor black levels", "Author": "Wade", "ReviewID": "R1DS6LN2NB7ZM9", "Overall": "4.0", "Content": "I bought this tv as soon as it came out as last year's model (KDL55W900A) was getting great reviews, so I figured I'd pick up the latest and greatest from Sony. The trouble is, they completely switched up the panel for 2014 and unfortunately it took a turn for the worse. The backlight brightness and consequently the black level on this tv are nothing short of disappointing. They are on the same level as my 6 year old XBR4 which is unimpressive. There is also significant clouding of the backlight as well (a common issue for LED/edge light screens) which doesn't help the perception of poor black level performance. The upside to this new panel is that the daylight performance is quite good and the viewing angles seem to be reasonable. If you can get over the black levels this television can be coerced into producing a pretty good looking picture as long as there aren't large areas of black. The colors and sharpness are very very good and are definitely a big improvement over my old XBR. The picture depth was also noticeably improved which under the right circumstances looks almost 3D. The new wedge enclosure for this year looks good but mounting it to a wall requires stand-offs that add a gap behind the tv that a more traditional design wouldn't require.The takeaway is that if you don't necessarily care about black levels, this tv is fantastic. If you want the blackest blacks in a dark room, look elsewhere.Update: revised star rating to 4 (from 3) as this TV is quite good other than the poor black level.", "Date": "April 21, 2014"}, {"Title": "Mixed feelings about this TV", "Author": "J. A. Torres", "ReviewID": "R2OV9J69QTMCAX", "Overall": "4.0", "Content": "I will save the long winded back story and just layout the pros and cons.Pros:Black levels are not as good as they were on the W850a but are definitely acceptable (after some tweaking)Colors are rich and pop because of the TRILUMINOS display technologyAccurate colors except for green which seems only slightly off IMOSound is clear and full thanks to wedge shaped design and the added sub-wooferViewing angle has greatly improved over the 65W850A and the 70W850B (SONY Changed the Panel which was good and bad)PRO CalibrationPlenty of HDMI and USB connections in the backSemi-Matte screenNo dark edges around the screens borders. No dirty screen effect. Very little banding and whats there is barely noticeable.Cons:Back light bleed. A lot of it. Forget about having this TV in a dark basement like setting. Watching dark movies was awful and if the movie was letterbox it was worse.Not a fan of the wedge design. Makes you feel like the TV is never standing straight and just looks funky. Not to mention it is a pain to wall mount.Did not like the chrome finish on the feet (looks cheap).Most of the bezel of the TV except for the brushed steel sides feels like cheap plastic especially the back. The back of the case flexes easily especially at the top.Slow response from the GUI (maybe an update can fix) (No update was available as of 5/29/14)Game mode scene select was slightly worse than the 65W850A but much better than the 70W850B (Multi-player FPS was doable)The KDL65W950B comes with a camera at the top of the TV for Skype and possibly other apps. Unfortunately is looks like something that can easily break as SONY choose to not integrate it as part of the TV case. I like the idea but since I have not played with it yet I cannot comment to it's performance.Some pictures are posted with more to come.I am going to exchange this TV and see if I receive one with less back light bleed if I do I will update my review and rating as needed. Definitely exchanging because at nearly $3000 after tax I am not going to settle on a TV with horrible BLB.", "Date": "May 30, 2014"}, {"Title": "Amazing TV with a beautiful picture quality!", "Author": "Mark", "ReviewID": "R2J89RWE0ZHF6T", "Overall": "5.0", "Content": "Pros: + Amazing picture quality + plenty of 3D options + Dozens of application choices like Skype, even comes with a camera! + Two remote controls so you don't have to fight for the controller :D- Cons: - It's not really a TV problem, I just wish I spent the extra couple of dollars and bought the bigger one :Dhttp://www.amazon.com/gp/product/B00HPMCLCG/ref=as_li_tl?ie=UTF8&camp;=1789&creative;=390957&creativeASIN;=B00HPMCLCG&linkCode;=as2&tag;=wwwquickfixau-20&linkId;=FDEITIFIPV6V76VTI'll definitely be getting a second one!", "Date": "May 25, 2014"}, {"Title": "Best tv I had so far", "Author": "UzbekUS", "ReviewID": "R3JWU1FSG43AAM", "Overall": "5.0", "Content": "I bought this tv from Amazon, Best picture quality, love the 3d options it gives you, it has a camera on top for skype,lots of aplications,and it has two remote controls too.", "Date": "May 13, 2014"}, {"Title": "Worst Tv to watch movies at night.", "Author": "Dani \"Dani\"", "ReviewID": "R3UMO8V1P5IWIH", "Overall": "1.0", "Content": "This tv is awesome in daylight, great colors and definition, but if you want to watch a movie in a dark room or at night go for another brand.", "Date": "June 2, 2014"}, {"Title": "BE AWARE SONY DOES NOT SUPPORT 3D STREAMING ON VIDEO UNLIMITED ON ALL TV's DESPITE CLAIMS", "Author": "B. Morgan", "ReviewID": "R23QYKEL8WRQ0I", "Overall": "1.0", "Content": "If you are thinking about either the KDL55W950B or the older KDL55W900A.  be careful even if you do your research and check that 3D video streaming is supported, buried  deep in Sony's technical bulletins .. somewhere they state that only a VERY few of the older TV's actually stream 3D content from Video Unlimited.  Also note that Sony don't have the VUDU app on their TV';s - So your main source of streaming content is Video Unlimited.  You will have to buy either a 3D Player - and play disks - or find one that streams 3D to the HDMI port or use a PS 3.  If you are looking for a good TV that provides decent 3D support look to Samsung or even VIZIO, avoid Sony like the plague!!  I would add that their Technical support is really poor as well, poorly informed and poorly trained.", "Date": "May 9, 2014"}], "ProductInfo": {"Price": "$1,798.00", "Features": "Refresh Rate: 120Hz (Native)\nBacklight: LED (Edge-Lit)\nSmart Functionality: Yes - Skype, Twitter, Internet Browser (Opera)\nDimensions (W x H x D):  TV without stand: 48.8'' x 29.55\" x 3.6'', TV with stand: 48.8'' x 31.2'' x 9.9''\nInputs: 4 HDMI, 3 USB, MHL\nAccessories Included: Remote, 2 3D Glasses, Touchpad Remote Control, IR Blaster, Table Top Stand", "Name": "Sony KDL55W950B 55-Inch 1080p 120Hz 3D Smart LED TV", "ImgURL": "http://ecx.images-amazon.com/images/I/4149YXGm-IL._SX300_.jpg", "ProductID": "B00HPMCLCG"}}