{"Reviews": [{"Title": "A Review Covering the Basics UPDATED", "Author": "Danny SW", "ReviewID": "R2X78YBJ5288C4", "Overall": "5.0", "Content": "From what I can see, I am the third person to review this TV. Before I get into the specifics, I just want it to be known that I normally don't write reviews for anything, but seeing as how I am one of the first people to buy this model, I felt as though feedback would only be fair to potential buyers. I am not an expert when it comes to electronics and high-tech products, but I wouldn't consider myself an amateur either, as I follow the tech world and do a lot of research into electronic devices before buying deciding to buy them. Part of that research includes reading reviews and a lot of times, a good or bad review can be the difference in purchasing a product. I am sure that's the case with many Amazon customers.I have had three previous LG televisions and I have yet to encounter an issue with the quality and construction of these TVs. I'd like to consider myself unbiased, but I can't put aside my previous experiences with LG. I wouldn't really consider them the best of the best when it comes to TVs, but they're definitely working their way up there and are proving to be a good choice compared to Samsung or Sharp, especially for all the features you're getting when you buy one of their high-end TV models.55LB7200 REVIEW:DESIGN QUALITYThe TV itself is very appealing, constructed of a brushed aluminum style along the bezels, and very thin from front to back. You have plenty of screen space as the bezel is very narrow on all sides. Short of that, I can't really say much in regards to the design. It is simple, yet very refined. Overall, this is a very good looking TV constructed of premium materials, just the way a TV of this caliber should be.TV SETUPOut of the box, setup was a breeze, Depending on your preference for mounting, you can used the provided legs for the stand or you can mount it on the wall, as you can with most modern TVs. If you're using a TV stand, take into consideration the width of this TV and the placement of the legs. In total, the legs are about 47\" apart at their furthest point, which is in the front. This TV is also very heavy, weighing in at just over 40 pounds, so also take that into consideration should you decide to mount it. The power outlet is flat so that makes a difference as well.Upon plugging in the TV and starting up, you'll be guided through a very user friendly and simple setup process with the included Magic Remote, including registering your set top cable and satellite devices, and setting up either a wired or wireless internet connection. In total, setup took me no more than 5 minutes.PICTURE/SOUND QUALITY & 3DThe picture is very clear and crisp, which is one of the very first things you'll notice when setting up the TV. First thing I did after setting up was pop in a blu ray into my Xbox One and immerse myself into the experience of the TV. The vibrant colors, the clarity, and brightness are all absolutely superb. A few minor changes to the settings may be required as the TV has an auto-dimming feature which you'll immediately notice at the end credits of a movie. But overall, stunning picture quality. To take full advantage of the high definition, I definitely recommend a blu ray player and HD capability with your cable/satellite devices.As for the sound, the built in speakers do seem a bit low at times. I haven't quite optimized the sound to my personal tastes but I'm sure some tweaking will get it right where I want it. I have yet to be disappointed with LG's sound quality and I'm confident this will be no different once I get it right. Overall, it sounds very good.I haven't tried the 3D yet, so I can't comment on that.SMART FEATURESThis is the FIRST Smart TV I have purchased and so far I am very pleased with the interface and the layout of different apps you can choose from. It appears that LG completely redesigned their Smart TV interface, judging by older LG models. I can't provide a comparison between the two (again, this is the first Smart TV I have owned) but this one is definitely very smooth and simple to use. You can even customize the arrangement of apps based on personal preference.This TV boasts a powerful processor, so playing a movie on Netflix or browsing the web on the Web OS app, proves to be an easy task, with no lagging or freezing whatsoever. You can watch a movie, pause it, do a web search, and simply switch back to the movie without restarting the app. The Magic Remote makes operating the Smart features much easier. It is very light and fits comfortably in your hand.The LG Store has yet to be introduced, but hopefully it will provide more features to take full advantage of what this TV has to offer.OVERALLSo far, I am very happy with this TV. It is very simple to use and provides a great viewing experience. I am giving this TV a 5 Star rating as it has thus far proven to live up to its hype in regards to picture quality and the features it provides. It has operated flawlessly and I have yet to encounter an issue or something for me to gripe about. For someone who points out even the slightest of flaws, that is saying something.As the title of this review states, this is a basic review. I hope it will provide some insight to potential buyers looking for a TV that packs a lot of features for a reasonable price. As time goes on, I will provide more details on my experience with this TV.UPDATE 5/1/14: After having this TV for a little over three weeks, it is still working flawlessly. I ran into an issue with the picture, but that was because I altered the settings and it has since been fixed. I still have yet to find optimal picture settings for this particular TV because there's so many possible ways to adjust the picture. Still though, right out of the box, it has amazing quality and stunning detail. It's a bit surprising to see other people running into issues, because I have yet to...knock on wood! This is definitely one of my best purchases to date and I will continue to provide more input in the future!", "Date": "April 13, 2014"}, {"Title": "WORST back light uniformity I've ever seen in any display EVER. *** Updates with 2nd set****", "Author": "M. Kim \"gadget freak and man-toy expert\"", "ReviewID": "RHJ5FK4RI7XE5", "Overall": "2.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo7UZLHAHN22OZembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo7UZLHAHN22OZrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo7UZLHAHN22OZchiDiv\").innerHTML = document.getElementById(\"cv_mo7UZLHAHN22OZhiddenPre\").innerHTML;\n};\ncv_mo7UZLHAHN22OZrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo7UZLHAHN22OZso;\t   \n\n\nfunction cv_mo7UZLHAHN22OZloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo7UZLHAHN22OZso = new SWFObject(swfLocation, \"cv_mo7UZLHAHN22OZAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo7UZLHAHN22OZso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo7UZLHAHN22OZso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo7UZLHAHN22OZso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo7UZLHAHN22OZso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo7UZLHAHN22OZso.setAttribute(\"height\", swfHeight);\n          cv_mo7UZLHAHN22OZso.setAttribute(\"width\", swfWidth);\n          cv_mo7UZLHAHN22OZso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo7UZLHAHN22OZso.write(\"cv_mo7UZLHAHN22OZflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo7UZLHAHN22OZ', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo7UZLHAHN22OZ';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo7UZLHAHN22OZ', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo7UZLHAHN22OZloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo7UZLHAHN22OZ\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m186WNBV3TDLFO\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m186WNBV3TDLFO\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RHJ5FK4RI7XE5\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m186WNBV3TDLFO/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo7UZLHAHN22OZduration')) {\n      document.getElementById('cv_mo7UZLHAHN22OZduration').style.display='none';\n    }\n    cv_mo7UZLHAHN22OZloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo7UZLHAHN22OZloadSwf(movieID, playerVersion) {\n   return _cv_mo7UZLHAHN22OZloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo7UZLHAHN22OZnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo7UZLHAHN22OZ', 0, h);\n}\n\nfunction cv_mo7UZLHAHN22OZresetPlayer(w,h,bw,cc) {\n  cv_mo7UZLHAHN22OZnewHeight(h);\n\n  cv_mo7UZLHAHN22OZso.addVariable(\"resetBandwidth\", bw);\n  cv_mo7UZLHAHN22OZso.addVariable(\"cacheCode\", cc);\n  cv_mo7UZLHAHN22OZso.setAttribute(\"height\", h);\n  cv_mo7UZLHAHN22OZso.setAttribute(\"width\", w);\n  cv_mo7UZLHAHN22OZso.write(\"cv_mo7UZLHAHN22OZflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo7UZLHAHN22OZRollOverImg = new Image();\ncv_mo7UZLHAHN22OZRollOverImg.src = \"http://ecx.images-amazon.com/images/I/717oGUffyMS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo7UZLHAHN22OZpreplay = document.getElementById('cv_mo7UZLHAHN22OZpreplayImageId');\nif (cv_mo7UZLHAHN22OZpreplay) {\n  cv_mo7UZLHAHN22OZpreplay.onmouseover = function() {\n    cv_mo7UZLHAHN22OZpreplay.src = \"http://ecx.images-amazon.com/images/I/717oGUffyMS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo7UZLHAHN22OZpreplay.onmouseout = function() {\n    cv_mo7UZLHAHN22OZpreplay.src = \"http://ecx.images-amazon.com/images/I/717oGUffyMS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo7UZLHAHN22OZpreplay.parentNode;\n\n  var cv_mo7UZLHAHN22OZcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo7UZLHAHN22OZcurrentClick) {\n      return cv_mo7UZLHAHN22OZcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 6:09 MinsConsider the title of my review. I've literally had hundreds of TV's and monitors in my life (work in tech). So to say that I've never seen such terrible back light uniformity is a crazy (but true) statement.I had high hopes for this TV due to the gorgeous physical design of it. It was to live in my main family room on a limestone fireplace, so the design had heavy weighting in why I chose it (among other things).Well, opened it up, turned it on, and IMMEDIATELY noticed 2 large black shadows on both sides, shadows in ALL 4 corners, and literally an entire GRID of shadows on the entire panel.To clarify, when you first set up this TV, you're guided through a wizard, which actually is very well done and a great user experience (web OS based). The kicker, is that all these setup screens, use large blocks of solid color for a background, making this issue clearly evident up front. The worst was during one of the settings screens, and the entire screen was white.I did a double take because I couldn't believe what I was seeing.So I packed it back up, took it back to Frys(also have one on order from Amazon, but will cancel obviously). Giving the TV the benefit of the doubt, I walked over to the floor demo unit and asked an employee to reset the TV so the wizard would appear again (they were only playing \"Dark Knight\", so this was the only way to get it to a solid screen).Lo and behold, it had the EXACT SAME PROBLEM. The sales guy was pretty dumbfounded when he saw how horrible it looked.It seems like this could be a running defect for the entire model line.Just to be clear, this problem isn't so evident when there's a lot of colors and motion on the TV, which is why I believe why some people don't see it.However, if you're watching any scene that has a light solid color at any time, then it looks downright horrible. For instance, there was a PGA tournament on TV today. Everytime the camera panned to the ball in the air, the entire blue sky looked like a grid of shadows.Same with an NHL game where you have a large white ice background. Shadows everywhere. I played around with the settings in expert mode, but nothing helped.I'm pretty speechless. I've owned insanely awesome TVS (Panasonic ST series plasmas) and cheap budget tvs, and I've never.. ever... seen a backlight this bad.I took a brief video of it. My advice is to stay away. LG seems to be having QC issues. Wouldn't be the first time.******* UPDATE 5/2/2014 *******Amazon seems to have received a handful of these in stock, so I just bought the last one. I've been looking and looking for a TV that looks good on a wall and have good picture quality. Judging from some of the replies to this review, I bit the bullet and ordered another one in hopes that it won't have as prominent an issue.You can expect another video and update after I receive my Amazon LG LB7200. Should be here next Friday (May 9th).\\******** UPDATE 5/13/2014  ( Received 2nd TV) **************Received my 2nd LG LB7200 from Amazon yesterday. Had a chance to set it up, and actually watch some shows/movies on it last night. Here's some additional thoughts....Pros:------------ Overall black levels are quite good for the price point (low 1000's).- viewing angles are pretty god- semi-matte screen seems to hold up well vs a lot of light. There ARE still reflections however...- The design still looks quite beautiful, despite backlight issues- sound is better then the average set, still not quite as awesome as LG says it isCons----------- I am 100% sure that there is a running issue with this model regarding backlight uniformity. I have now personally owned 2, and have seen an additional 2 in the store (demo models), and EVERY single one has the same uniformity issues. Specifically, 2 vertical bands on either side, shadows in all 4 corners, and LED array shadows gridded across the entire panel. I find it too coincidental that 4 out of 4 sets that I have personally seen all have the same problem.That being said, my 2nd set is noticeably better then my first one. Both the vertical bands and the LED array shadows are not nearly as pronounced, but to my eye, they are still noticeable in certain scenes. I did notice on this 2nd set however, that when viewing the TV as normal, the issue can be forgotten about pretty easily. You mostly see the problem anytime there is a large block of solid light color on the TV. I mentioned some examples in my earlier review, but another one would be when I was watching House Hunters on HGTV. There's a lot of scenes where they just kind of stand in front of a blank wall. I can clearly see the LED array shadows making the wall actually seem like 3 shades of paint rather then 1.In a real world scenario, I have found that this is the exception, not the norm, since there aren't too many scenarios where you'd be required to put up with that kind of scene for prolonged times.- Web OS is quite beautiful with LG's implementation... but it can really laaaaagg at times. Like switching from Netflix back to your TV input, or making picture adjustments. The remote is quick to navigate through the menu, but the problem is if you go to fast, the menu can lag.Conclusions----------I'm really torn about this TV. I just moved into a house with a dedicated home theater, so I don't have a need to have THE best picture quality HDTV in the living room. The LG LB7200, by far for the price point, is the PRETTIEST looking TV available. It's just damn sexy. Super thin, edge to edge glass, almost no bezel, metal frame, brushed speaker grill.... it really does almost look like a piece of art.That being said, there is no denying that LG put out a sub-par backlight panel on this product, and I'm not surprised. I've had LG monitors in the past with issues as well, and overall, LG TV's are somewhat known to have backlight uniformity issues. The only problem is, on edgelit LED's, uniformity problems never manifested as grids, since there is no grid of LEDS. On this direct LED panel, the shadows appear as a grid across the entire TV.I also know, that while this problem exists, the severity of each TV definitely varies (as reported by other reviewers who don't notice it, and myself personally). I believe that other people claiming that their TV is \"perfect\", is in fact, not perfect, but just a combination of their high tolerance for the defect, as well as whatever conditions they're watching their TV in. To be fair, the issue isn't  evident in 99% of viewing of normal TV programming.Since the 2nd set is noticeably better then the first, I'll upgrade my rating to 2 star. Slightly better, but enough of a problem that I would still not recommend it (generally speaking).And another thing, the image for this product is actually slightly inaccurate. If you zoom in to the bezel, it appears as though the picture goes literally from edge to edge. This is actually not the case at all. There is a small bezel hidden underneath the glass that creates a thicker black border then what the picture shows. Still very thin, but very much present. The product photo is obviously a misrepresented photoshop of the actual TV.So that's why I'm torn. I'm all about real-world usage, not theorizing about specs and what not on paper. And in the real-world, the problem is a lot less of a problem. The question is (for me as well as for you)... are YOU comfortable spending 1200-1400 on a TV, KNOWING it has an issue, but not necessarily \"consuming\" the issue during use.For many, the answer will be \"no, it doesn't bother me because it looks just fine when I watch it\", which is a completely viable option.For others who have a little OCD in them, it will bother you to no end just based on the principal of spending this much money on something that may not perform at an expected level.Personally, I'm kind of the latter, but it's being offset by how FREAKING GORGEOUS the TV is. I haven't fully made up my mind yet.Good luck in your decision-Noah", "Date": "April 26, 2014"}, {"Title": "Cannot argue with success", "Author": "Sam P. Morgan Jr.", "ReviewID": "R2ADOW986QE1R4", "Overall": "5.0", "Content": "Delivered on time and \"out of the box\" is working great.  It the TV continues to work this well I will be happy with it.The picture quality is great but you have to fiddle with the settings a little.  Out of the box the auto-dimming feature is set too low.  When I would turn off the room lights the picture would go very dark.  It took a bit of fiddling with the controller to reset this feature to \"medium\" and that is just right.  The only manual you get with the set that would guide you on stuff like this is online and the settings are not totally intuitive.  So far I am very happy with the performance of this TV.", "Date": "April 8, 2014"}, {"Title": "Love the design but major flaw", "Author": "Paul B. Elam", "ReviewID": "R2GTTCPWBIHYDZ", "Overall": "3.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo145R6K9MXLNRDembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo145R6K9MXLNRDrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo145R6K9MXLNRDchiDiv\").innerHTML = document.getElementById(\"cv_mo145R6K9MXLNRDhiddenPre\").innerHTML;\n};\ncv_mo145R6K9MXLNRDrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo145R6K9MXLNRDso;\t   \n\n\nfunction cv_mo145R6K9MXLNRDloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo145R6K9MXLNRDso = new SWFObject(swfLocation, \"cv_mo145R6K9MXLNRDAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo145R6K9MXLNRDso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo145R6K9MXLNRDso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo145R6K9MXLNRDso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo145R6K9MXLNRDso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo145R6K9MXLNRDso.setAttribute(\"height\", swfHeight);\n          cv_mo145R6K9MXLNRDso.setAttribute(\"width\", swfWidth);\n          cv_mo145R6K9MXLNRDso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo145R6K9MXLNRDso.write(\"cv_mo145R6K9MXLNRDflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo145R6K9MXLNRD', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo145R6K9MXLNRD';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo145R6K9MXLNRD', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo145R6K9MXLNRDloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo145R6K9MXLNRD\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m6SRZJ4FZZ7F2\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m6SRZJ4FZZ7F2\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2GTTCPWBIHYDZ\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m6SRZJ4FZZ7F2/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo145R6K9MXLNRDduration')) {\n      document.getElementById('cv_mo145R6K9MXLNRDduration').style.display='none';\n    }\n    cv_mo145R6K9MXLNRDloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo145R6K9MXLNRDloadSwf(movieID, playerVersion) {\n   return _cv_mo145R6K9MXLNRDloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo145R6K9MXLNRDnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo145R6K9MXLNRD', 0, h);\n}\n\nfunction cv_mo145R6K9MXLNRDresetPlayer(w,h,bw,cc) {\n  cv_mo145R6K9MXLNRDnewHeight(h);\n\n  cv_mo145R6K9MXLNRDso.addVariable(\"resetBandwidth\", bw);\n  cv_mo145R6K9MXLNRDso.addVariable(\"cacheCode\", cc);\n  cv_mo145R6K9MXLNRDso.setAttribute(\"height\", h);\n  cv_mo145R6K9MXLNRDso.setAttribute(\"width\", w);\n  cv_mo145R6K9MXLNRDso.write(\"cv_mo145R6K9MXLNRDflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo145R6K9MXLNRDRollOverImg = new Image();\ncv_mo145R6K9MXLNRDRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81cCm40vaFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo145R6K9MXLNRDpreplay = document.getElementById('cv_mo145R6K9MXLNRDpreplayImageId');\nif (cv_mo145R6K9MXLNRDpreplay) {\n  cv_mo145R6K9MXLNRDpreplay.onmouseover = function() {\n    cv_mo145R6K9MXLNRDpreplay.src = \"http://ecx.images-amazon.com/images/I/81cCm40vaFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo145R6K9MXLNRDpreplay.onmouseout = function() {\n    cv_mo145R6K9MXLNRDpreplay.src = \"http://ecx.images-amazon.com/images/I/81cCm40vaFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo145R6K9MXLNRDpreplay.parentNode;\n\n  var cv_mo145R6K9MXLNRDcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo145R6K9MXLNRDcurrentClick) {\n      return cv_mo145R6K9MXLNRDcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:48 MinsI am no expert, just wanted a really good HDTV for new house. I have a 2012 Samsung ES6100 I am moving to the bedroom and this LG 55LB7200 was to take its place and my main family room TV.I ordered this TV for a couple of reasons. I wanted front firing speakers and a good viewing angle. The set delivers on both. Colors are very good, and I like how they provide 2 picture inputs that you can tailor yourself (on my Samsung you have to alter one of the existing settings). The set itself just looks cool. Many of the LG units I saw in-store looked dated. This unit has almost no bezel and even looks great turned off!The \"smart\" features blow away my Samsung. The webOS really zips and I like how LG uses a ribbon at the bottom. It may not have as many apps as Samsung, but love the fact you don't have to go into panels when exploring these features. The ribbon just sits at the bottom of the screenThe \"Wiimote\" is pretty cool also, although the lack of physical number buttons could be a pain if you were actually trying to use to control a cable box. I mainly use my Uverse remote so not much of an issue.3D is kind of gimmicky, but will say my son and I watched \"Nitro Circus\" on Netflix in 3D and it was totally amazing.  The picture truly just comes alive.  Blueray disc looks great as well.Unfortunately the only negative on this set is the Dirty Screen Effect-DSE others have mentioned. And it is a huge negative. I really thought I was seeing things at first. I almost never watch hockey, but turned it on while testing TV. I was the spotting and dark vertical bands near the left and right sides others have mentioned. It mainly happens when the camera pans left or right quickly against a light background.Hockey isn't a big deal to me, but golf is. I watch golf a lot and the DSE is very noticeable when the ball is in the air against the sky, and on greens as the ball travels towards the hole. Same issue on football games when the ball is in the air or when the camera quickly pans right or left(usually to the endzone).  I'm unsure if this is something I will eventually get used to, or if it will drive me crazy forever.  Now that I know its there, I see it all the time.  My eyes are just drawn to the imperfections.  Even my wife who is decidedly not into technology says it is annoying. I plan on using my full 30 days to evaluate and am truly on the fence.EDIT 5/6/14I have been so focused on the DSE, that I failed to really test out the TV on the dimming issue others have mentioned.  I turned all dimming settings off and watched Silver Linings Playbook a couple of nights ago.  There are multiple scenes (mostly dimly lit) where the dimming goes haywire.  I've posted a video which isnt great but hopefully you can see how the entire scene goes from bight to very dark and then back again(no sound in video for language used). It is very distracting and I dont believe can be turned off?Sadly this is kind of the straw that breaks the camel's back.  I had almost convinced myself I could deal with the DSE but the dimming issue is even worse.  I've already called Amazon to arrange my return.", "Date": "May 4, 2014"}, {"Title": "Awesome 240Hz TV", "Author": "S. Brewer", "ReviewID": "R1OLD0IJ5CGVDN", "Overall": "5.0", "Content": "a Friend of mine bought this TV and it looks great. the 240Hz works great as well, smooth pictures and great gaming experience.some posted that its not 240hz, that guy i guess has never owned an LG TV. all LG TV's will display 60hz in the top corner even if its a 120/240hz TV. its been like that for several years now. the 60Hz you see in the top corner is the TV telling you what it is 'Receiving' from the external source. since Cable box's only output at 60hz thats why you will see 60hz at the top corner....even though the TV DEFINITELY 240hz.", "Date": "April 18, 2014"}, {"Title": "Does LG actually have QC?", "Author": "FF", "ReviewID": "RIWCWKTIW1DTW", "Overall": "3.0", "Content": "I bought this TV from BestBuy and it has been a replacement for a similar characteristics VIZIO set.First the goods:The design of the TV set is top notch. Very solid construction, the screen is almost frameless which adds to the presence, the sound system is perfectly placed and designed, and it also sounds excellent for a TV set, much better than my previous system.The software and the apps are very nice and load relatively fast.The magic remote is of great help when navigating or typing. (For those who do not know what \"magic\" remote means, think about of a Wii controller, or a PC mouse, it moves on the screen as you move you hand).The bads:I've noticed the same backlighting issue as other reviewers. It isn't as bad as to make me return it right away, but still noticeable even after various Picture Settings tweaking. For a $1,400 piece of equipment this is unacceptable, and I really wonder if LG has a Quality Control department at all, since this doesn't seem to be an isolated incident.The other bad thing is the crispness of the screen. The VIZIO that I replaced with this LG set, right out of the box had a much crisper and clear image. It made almost all movies played on Blu-Ray look like you were watching them directly in the studio and the animated movies as if you were watching the CGI rendering, that's how crisp it was. The Live HD channels were also clear crisp on the VIZIO. But not so with the LG. After much tweaking I get an OK image. The Blu-Ray movies are now clear but not as crisp as my previous VIZIO. The live TV channels are just OK.Again, for a TV that costs several hundred more than the VIZIO I expected at least the same picture quality if not better.While the LG set has a splendid design and the sound is maybe one of the best in class, I expected more from the picture quality. I am still debating whether to go through the hassle of returning it or not. The LG quality control has serious issues since my findings are not singular about this TV set.-------------------------------------------------------------UPDATE 5/5/2014I think it's official: this line of TV sets have an issue with screen \"dirtiness\" on white or light color solid backgrounds. I've just been through the hassle of exchanging mine at BestBuy and the new set has the exact same shadowing problems as the previous one. It's just less noticeable on the new set, it's more faded, but it's located on the same areas: two lateral vertical side bars and on the corners.The new TV does seem to give me a clearer picture, I am now satisfied with the crispness of the image.I decided to keep it for the overall value. Everything except the annoying side lines is perfect about this TV. Those lines are not noticeable for most of my activities so I'll go with it.It's a pity LG hasn't done better with the screen.", "Date": "April 30, 2014"}, {"Title": "This TV is amazing!", "Author": "js057", "ReviewID": "R3O3UAKW5EVFLC", "Overall": "5.0", "Content": "UPDATE: 05/01/2014The TV doesn't save the \"Expert Settings\" system wide.  Picture Settings are independent for every input HDMI1, HDMI2, HDMI3, Netflix, Amazon, and even separate Blu-ray movies.. not exactly ideal.Looks like the development team is hard at work, they released an update today.http://youtu.be/C8K9B58dcoIUPDATE:  04/29/2014After spending a good amount of time with the TV. I noticed one very annoying \"feature\",  it's called global dimming. Global dimming dynamically adjusts the brightness regardless of energy settings. There is a dark scene the picture gets very dark. It also does the opposite and gets very light. It's super distracting not really something that should be on at all.You can disable this by opening the input options and changing the icon to PC. You will need to adjust your Picture Settings after changing to PC mode. Seems odd we need to do this... I hope LG decides to implement a toggle in an upcoming update.Original:As of today there are almost no reviews for this TV. So let me start by saying this is the best TV have ever used. The picture quality is outstanding. The design is super sleek with almost no bezel.The redesigned webOS is great. It is jam packed with features and runs incredibly smooth. Some parts of the interface are slightly confusing at first; like customizing the HDMI input labels. (To do this hold down the input button on the remote, it brings up a menu, select all inputs. It brings up a nice window with all your sources; with the ability to select an icon, change the name, etc.)  Now that I've played with it for a couple hours I find it easy and natural to manipulate.This TV retains the ability to play MKV video files even though it's not mentioned. It also decodes DTS audio.The media player app called \"Smart Share\" works pretty well, but it lacks some features. Such as the ability to disable subtitles on default. It's also missing the ability to set a default view. If you close the app and reopen it the view switches to an \"All Media\" interface. Besides that, it works great and played everything I threw at  it. Even handles full 1080p video files like a champ.3D is crisp smooth and has good viewing angles. Switching in and out of 3D mode is incredibly quick.The only remote included in the box is the small magic remote. It's fine though, it finally has enough buttons. The motion tracking has also been improved.  The old  \"full feature\" remote works as well; the last gen magic remote doesn't work.If your looking for a great TV, like to stay on top of the latest tech, or just love webOS buy the TV. I can't recommend it enough.", "Date": "April 17, 2014"}, {"Title": "Great picture, great features, great TV", "Author": "Steward Willons", "ReviewID": "R14ACMJ4ETJ58B", "Overall": "5.0", "Content": "This TV has some mixed reviews, so I will try to address most of these issues when I describe my experience with the LG 55LB7200.Picture Quality -This is obviously the most important feature. I’ve had a fairly nice Samsung for years, and I always always happy with the picture quality, but the LG is even nicer, I think. The picture is brilliant, clear, bright - pretty much everything you want in a TV. The colors seem natural. It works in all light levels. The viewing angles are impressive. It basically looks the same no matter where you position yourself.  I have absolutely no complaints.I’ve noticed some reviewers commenting on uneven backlighting, weird color artifacts, and some sort of dimming issues. I’ve not experienced any of these. The picture looks great all the way to the edges. The TV will change the brightness level of the backlight in accordance with the ambient light of the room, and this can be annoying. The solution is easy: if you turn off the energy saving feature, the screen maintains a constant backlight level, and the dimming issues go away. You’re using more energy, but the picture is consistent.Sound Quality -Does anyone seriously use the built-in TV speakers? I see people complaining about the TV speakers, but common - don’t blame the LG. I’ve never seen a TV with good built-in speakers. They play loud enough to be usable, but they’re not amazing. Who cares. It’s like complaining that the speakers on your laptop don’t have enough bass.Remote -The remote is pretty cool. Instead of limiting you to a four-direction arrow key thing, you get a wii-mote-style cursor that allows you to click wherever you want. This is really nice because it saves you so many clicks when navigating menus. It’s probably cool for some games as well, although I haven’t purchased any from the apps store. If you have a Wii or a second generation Roku, you know what to expect. The remote is slightly more responsive than the Roku remote and the cursor moves a bit faster.Of course, if you don’t like using the cursor, you can use to the knob in the center kind of like a tiny track ball. You can press it to scroll, and you can move it side-to-side. There is a voice activation feature, but this is usually more trouble than it’s worth.The only downside to the remote is that it’s so unique that if you want to use a fancy universal remote with your TV, you lose some cool functionality. Thus, you’ll need to have at least two remotes for your AV system. It’s not a big deal to me - I don’t mind switching remotes - but it is to people like my parents who love their single remote system.Menus -The menu system on TVs varies greatly. The Samsung menus are pretty basic, but you have to click through a lot of submenus to get what you want. The Sony menus are a bit better, but not by much. The LG gives you a horizontal list that pops up anytime you hit the home button. My complaint here is that I would like to rearrange the menu items. I rarely watch things on Hulu, and yet it’s always my second option. It’s way more common that I watch a Blu-ray movie, but this means I have to move to a second screen to see the option. Other than that, I find the menu system to be very intuitive. Without reading the manual, I was able to navigate to any feature I wanted on the first try. As long as you have a typical amount of GUI intuition, you’ll find the menu system to be logical and user-friendly.Hardware/Software -My parents use a Sony system where everything runs through the Blu-ray player. It’s a nice, simple AV hub, but it feels a bit sluggish when compared to, say, a PC. It takes a few seconds for various things like Netflix to load, and it takes a bit of time to power on. The LG is surprisingly spritely. Startup takes maybe 10 seconds, but once the TV is going, the apps load quickly. Netflix pops right up, as does Hulu, YouTube, and whatever else you try.Interestingly, the LG keeps apps running in the background, which allows you to switch between video sources quickly. Say you’re watching Netflix, but you want to check out a YouTube video. Hit the home button, navigate to YouTube, return to the home menu, and Netflix appears in your recent apps section so that you can pick up right where you left off. This is way cooler than the Sony system where you have to completely exit Netflix to do anything else.Each app works a bit differently. The YouTube app is the worst by far because instead of giving you a grid of characters, you get a single row of letters. Searching takes forever. However, this is not, as some have claimed, LGs fault. Apparently, YouTube supplies electronics manufacturers with their own software. The LG YouTube interface is exactly the same as on my parents’ Sony and my old Samsung. Fortunately, YouTube allows you to pair the TV with your smartphone or computer very easily, so you can bypass the apps annoying features entirely.3D -I think 3D is a gimmick. I don’t like paying extra for 3D in theaters, and I don’t care to pay extra for 3D blu-ray discs. Whatever. It’s my prejudice. The TV works just fine though. I don’t have enough bandwidth to stream 3D movies through Netflix (although it’s possible to do so), so my experience is limited to Blu-ray discs and HD broadcasts. Playing through Blu-ray looks amazing. The TV will simulate a 3D effect for HD broadcast input. I don’t get many stations over the air, but I did watch part of an episode of Ellen (it was all that was on the afternoon that I tried it), and it actually looked kind of decent. It’s not something I’d do every day, but it’s a fun gimmick to show friends. The glasses are just regular, 3D glasses like you’d wear at in a movie theater. No batteries required. You get two pairs, and extra pairs are kind of expensive. You could always just hold onto the 3D glasses you get next time you’re at the local multiplex.The only thing to keep in mind is that if you’re hoping to stream 3D movies through Netflix, you’ll need a lot of bandwidth. I pay for 5GB/sec from AT&T;, but realistically, they never give me more than 756k/sec, and that’s not enough. Make sure you are getting more like 1.5g/sec if you want to use this feature.Mirroring / Sharing / Pairing -Screen sharing is available via Miracast. I have Apple products, and they use Airplay. It’s not a huge deal because I can just connect through my AppleTV. If you have an Android device, you should have the functionality built in. I had a friend test it out, and he was able to connect very easily.Setup -Setup was a breeze, although it helps to have two people. Some TVs allow you to set up the base, which the monitor part slides onto. The LG involves screwing in two feet, so you kind of need someone to hold the monitor while driving the screws.Once you power it on, the software setup is fast, intuitive, and easy. An animated penguin character guides you through various steps. It’s mostly graphical, so you don’t have to read any obscure instructions or decode any jargon. It’s quite easy.Design -The appearance of the TV itself is difficult to comment on because with the incredibly narrow bezel, the frame virtually disappears. Essentially, it looks like a big plane of black glass until you turn it on. The minimal design works very well. It has taken me a little while to get used to the apparent lack of a bezel because I’m used to seeing the image framed by a black rectangle, while with the LG, the picture appears to go all the way to the edge, in a manner of speaking.Overall -Overall, I’m very pleased with the LG. It’s the nicest, best looking, most full-featured TV I’ve ever owned. At this point, I have no substantive complaints. Everything works as it is supposed to. Everything looks beautiful. If something changes, I’ll update the review. For now though, I’m going to get back to watching movies!", "Date": "May 14, 2014"}, {"Title": "great smart functions, sub-par picture quality", "Author": "E. A. Jones \"movie buff\"", "ReviewID": "R3K3XSFAZ0XH72", "Overall": "3.0", "Content": "I've used this TV for three weeks, and hope to keep updating the review as I find more out about it. It's my first LED smart TV so much of this review might be dealing with basics and less advanced options. Quick summary: The setup and use of this TV is great, Netflix works perfectly, but the picture has some real problems with dark spots and backlight, and the sound quality isn't all that great.SETUPThe stand goes on really easily, just four screws and it's done. There is only one way to put the legs on, though, and you need a minimum of 48 inches to set this TV on (it's 47 inches from the outer edge of the left leg to the outer edge of the right). The TV itself weighs about 45 lbs and was easy enough to lift, though the size of it makes it difficult for one person to lift. Get two people, one for each side. The plugin is flat so it lays right up against the wall, though we got a nice surge protector to plug it in to. Once you get the TV placed, turn it on and an automatic setup screen appears, walking you through the steps. You need your wireless ID and password but even after unplugging the TV during an electrical storm, it remembered the login, which is nice.Once logged in and through the set up screens, you can hit the SMARTHOME button -- the house on the upper right of the remote -- and a menu with basically everything you need comes up along the bottom of the screen. Netflix, YouTube, Hulu, Vudu, Amazon, etc. plus Notifications, Live TV, and other basic menu items are there. It looks just like it shows in the picture, and it's super handy, easy to navigate with the remote.If you're looking for various preferences like sound and picture, you want the little gear symbol that pops up in the upper right hand corner when you hit the HOME button.APPEARANCEThis is a really good looking TV. The bezel is very thin, just shockingly thin, and the entire TV is thin from front to back. Honestly, they could have made both a little thicker and it might have helped with the backlight bleed issue (see PICTURE below). We have the set sitting on a cabinet with plenty of air flow around it to keep the heat down, and it looks great, but I think a console would probably be the best bet. It did arrive with some damage on the bezel areas of the top two corners, however, worse on the right than the left. Check it before you leave the store with it.FIRMWAREThe TV came with a notice that a firmware upgrade was required before use. However, when I went to upgrade it, the TV said it was already using the most up-to-date OS. We used it like this for ten days when suddenly the TV notified us there was a firmware upgrade available. We clicked \"install\" but nothing happened. This went on for three days until finally the firmware really did install, and even then, it was the next day before the magic remote upgrade installed, too. It was very irritating. However, the good news is that a lot of options in the preferences settings opened up once the firmware installed. If you can't get to the equalizer or other options, wait until the firmware upgrades, and those preferences will probably be available.REMOTE, POINTER, SCREEN PREFERENCESThe remote is one of the small, bullet-shaped ones, much like a WII remote, with very few buttons, though large enough to use comfortably. The pointer is this salmon-colored teardrop thing that actually kind of irritates me, and I wish it could be changed. If the pointer disappears off your screen, to get it back, just scroll the middle button on the remote up or down and the pointer will return. Movement is kind of tricky -- I loathe the keypad with this remote with every fiber of my being, and even on the slowest speed (changed under \"Accessibility\") this pointer can go renegade on you pretty easy, and you find yourself clicking the wrong thing.Changing sound, video, and other preferences on the screen is actually pretty easy. As mentioned, you hit the HOME button, then a gear inside a circle shows up on the top right of the screen. Click it with the pointer, then on the left side a menu shows up. The top option is Quick, which has basic options for video quality, etc. Below that are Picture, Sound General, Network, Safety, Accessibility, all with much more detailed options.You can do all this while you've got a movie on and have it paused, so you can see immediately how the visuals will change. Or leave the movie running and fiddle with the sound, and hear how that changes, too. There are some sound options that appeared once the firmware updated that I haven't gotten to yet (Surround and ClearVoice), but once I do, I'll update the review.Personally, I like the presets and use them with just a little adjustment. \"Game\" is great for older TV shows; I use it to watch \"Twin Peaks\" and other 1990s and earlier shows on Netflix. \"Standard\" is great for YouTube and the browser, and \"Cinema\" works really well for quite a few modern films. On all of these I reduce the backlight because of the picture issues, then make a few little adjustments to color warmth and such. Any tweaks made to the presets stay even if you switch to a different preset and then go back, so that's nice.PICTUREThis is the big issue with the TV. The picture quality really leaves something to be desired, especially for a set with this price point. Overall, the picture is nice and clear if you're not looking too closely. The colors are nice, the sharpness is good, but what others call \"the soap opera effect\" is pretty noticeable. Fortunately, it's all very tweakable with the preferences and presets. But it doesn't take long before you realize all four corners are dark. There really IS a grid of dark spots across the screen, most noticeable when you're watching a show that pans across a light surface or wall. It's the \"dirty screen\" issue and it's very noticeable.Also, on the right hand side of my set are three arcs of color that bleed into the screen, the top one teal, the middle yellow, the bottom blue. It's like seeing the very edge of three colored circles of light. Adjusting the backlight helps some, but not always. I've adjusted every picture option I can and those colors will not completely go away. It's most obvious on black background (especially if you're watching something that's 4:3 Academy aspect ratio, in black and white) and the intensity of these colors change with what's on the screen. It can be pretty distracting. On the right hand side are two of these same arcs but without color, just dark.It's not that the picture quality is unwatchable, because it absolutely is. That said, I received a free review copy of this TV (as the green note at the top of this review says) and I'm a little put out by the picture issues; if I'd paid full price for it, I would find this completely unacceptable. The dark grid, the corners and the color bleed on the edges would have been a deal breaker.Just to note: I haven't had the dimming issue others have written about yet. I'm not sure why -- maybe I just haven't noticed it -- but if it comes up then I'll update my review.SOUNDThe sound options are varied and easily changed in the preferences. I love that the sound in movies is much more even; no matter what setting we use, there's no more loud music with soft voices. I don't really care for the sound quality when it comes just to music, though. It's kind of flat, no matter how we listen to music, via YouTube, our own mp3s, etc. This is a TV that would benefit from a full sound system attached (and there are the connections for this) if you were use it in a theater room.HEADPHONESI don't think you can use headphones with this TV. Weird, right? But the 3.5mm hookup the specs promise is actually a \"service only\" port on the back of the TV, and neither our wireless nor our Bluetooth headset work with this television. If I ever figure out what headphones can be used on this TV, I'll let you know. This has been the most irritating issue, thus far.NETFLIXNetflix works like a dream on this TV. I didn't get the free year, which I assumed was because I got the TV through the Vine program, but other reviewers who bought these sets report problems getting their free year. I had Netflix already, and logging in was a snap. Once logged in, I couldn't figure out how to add movies to my instant queue, but I just add them on my PC and they show up on my list on the TV. There is no freezing, no lag, though occasionally it might take 5-10 seconds for the picture quality to fully adjust. It's terrific. This is a Netflix TV, no question.YOUTUBEOh boy, I do NOT like this YouTube interface. On the left hand side there is a series of icons you can click for genres; \"LOL\" for comedy, a movie reel for films, etc. The thing is, what YouTube decides is comedy is not exactly what I would call comedy. So I should just search, right? Nope. The search is pitiful and slow, and YT recommends you connect another device to speed up searches. I was able to connect my smartphone to the TV's YT interface quickly, but the search on my phone didn't seem any better than the one on the TV. Using YT on my phone is nice, but NOT when it's connected to the TV, which limits the search options and makes everything so very, very slow. Scrolling on YouTube is soooo slow.BROWSERNot a fan of this browser. It's pretty bare bones, the scroll is really jerky and uneven, and because it doesn't have Flash (which I can't really blame LG for, considering the security issues) there are several websites I can't even get to. I like to use my TV for background music during dinner or chores, and if I can't get to online radio stations because there's no Flash, then it really limits my options. Also, for my job, I go to websites that require flash, so I can't do that from my TV, either. That's a big disappointment for me.DVD PLAYERSWe have two players hooked up, one via HDMI, one via Component. Both work just fine, and a quick change of aspect ratio on both the set and DVD player options allows me to switch between 4:3 (which I use a lot, because I watch a ton of old movies) and various widescreen options. \"Just Scan\" is one of the TV's aspect ratio options, and it works fine on one of my DVD players, but not the other, I suspect because the second player is a little too old to be fully compatible. The quality of the picture on rental and storebought DVDs is quite good. We couldn't get the universal control options to work on these DVD players, but that wasn't an issue for me personally.USB CONNECTIONS (MOVIES AND MUSIC)We have both Sandisks and external hard drives that I used to store backup copies of old VHS films, and out of print DVDs. All of our mp3s are also on these drives. We got a little USB extension hooked up to the back of the TV, pulled it out to the side of the TV so it's easy to get to without moving the TV, and now we can just plug in a Sandisk reader or external hard drive. Through the on screen menus we can easily pull up one of our backup movie files. That has been incredibly handy. We also use it for music, though I don't care much for the default music player on the TV. It takes an hour before it goes into screensaver mode, and the commands aren't 100% intuitive. A little clunky but ultimately it works well enough.Another note: If you watch old movies or TV shows, and have old copies from VHS or DVDs more than a decade old, the picture quality might really stink on this TV. When the video is \"blown up\" on older shows, serious pixelation and other issue arise. For instance, my \"Corner Gas\" DVDs look just rotten, because they were kind of low quality anyway. Just keep that in mind if you're someone like me who watches a lot of old shows and movies.LG STOREYou have to sign up for the store to get the free apps, and so far, only one of the apps I've played with  worked (the air traffic controller game). The museum app is free but once you get in there it says you need to sign up to their pay service to get the full features. By that they must mean ANY features, because nothing works on it. I couldn't even get the weather app to work at all. I won't be bothering with the LG Store.TERMS OF SERVICEWe didn't have a TOS to sign until we signed up for the App Store, and it was the usual TOS agreement. I didn't have to give a credit card and I didn't see anything indicating my other internet connections (PCs, smartphone, etc.) were monitored. Another review here says they cannot access any apps until they agree to the TOS, and I haven't had that problem yet, but if I do I will definitely come back to update.OVERALL IMPRESSIONLet's be honest: I got this TV for free through the Vine program, but I would not pay what they're charging, simply because of the video quality issues. Setup is great, Netflix is a breeze, the smart features are smooth and quick, and playing from USB is great... but seriously, the picture quirks are really bad for a set at this price point. It feels like this was rushed out to stores before all the quirks were worked out, and it shows.", "Date": "May 13, 2014"}, {"Title": "Awesome TV with a flaw(global dimming)", "Author": "Robert L. Smith", "ReviewID": "R1KJ5GDAXVDMWA", "Overall": "5.0", "Content": "Update 5/15/14I returned the 2nd one I got because of the light bleed and creaking noise when I was cleaning the screen. I got the 60LB7100 and this one is awesome. There is no vertical lines on mine, just a hardly noticeable vertical line on the left hand side. I don't think it is the vertical lines everybody is talking about because this is on the very edge of the screen.Hardly no DSE(Dirty Screen Effect) I cant believe it, I thought the 55LB7200 was great this one I dont see anything, I have the NHL and golf on and dont see anything. WOW!!!The only downside is the 60LB7100 does have a WiFi issue. A lot of other people are having the same WiFi issue. It connects but slow connection and buffers a lot on Netflix, especially with 3D.Update 5/8/14Well I exchanged my 55LB7200 with another one because of the small crack in the top right corner. Now this one has a very bad light bleed in the same corner. Also when I was cleaning it in that corner it was making a creaking noise. I chatted with LG and they are going to send out a tech to look at it.Also this panel has the vertical lines on both side pretty noticeable while my first one was hardly noticeable. This was made in April while my first one was March.Edit,Well I thought about it and set up to have the Tech come look at it. I called the tech and he said I should just send it back to Amazon and get a new one. I guess some of these tech work at local TV shops here and he said that is what he tells all of his customers that buys TV from them.So, I chatted with Amazon and now, I am getting the 60LB7100. I hope its better than the 55LB7200. I still dont know if there will be a real big difference because of the model numbers. I know the 7200 has no bezel and it has a subwoofer.I really love this TV but this replacement one I got is pretty bad. I hope the 60LB7100 is better. Good luck all of you. I will keep all of you up to date.Original reviewThis TV is awesome and I love it. Mine came with a very small crack in the top right hand corner out of the viewing area but I am going to exchange it when they get more in. Amazon also offered me $300 off the 60LB7100 if I wanted that one but I really like this one.The picture is very clear and beautiful. All of the features are nicely implemented. I really love this TV. This is Direct-Lit LED which mean the LED's are behind the panel and not on the edges(Edge-Lit). There is not clouding, light bleed or anything like that. The only thing I see is there should be more local dimming zones. I think there is 12. There is 2 columns and 6 rows. A good example is when credits scroll up you can see the zones and since the credits are in the middle the you can see the light coming across the screen.The problem I am having is when there is a dark scene the screen dims very dark and you can barely see anything. I posted a video on youtube and I will provide the link. I calibrated the TV and turned off energy saving and I also tried to turn off local dimming but it is still there.Global dimming is the problem. It adjusts the brightness regardless of energy settings. There is no way to turn this off. This is a stupid feature, I was reading and it has been a problem in the last 2 years and everybody hates it.When playing PS3 or PS4 game and you have a dark scene you will not be able to see anything. LG dropped the ball on this. I am very disappointed because everybody complains about it but LG does not do anything about it. They will not fix it.Here is the link......http://youtu.be/9m5a0Ph5YZ8", "Date": "May 1, 2014"}, {"Title": "Large shadows on sides of the screen", "Author": "MarkUS", "ReviewID": "R2MOPZ8Y0XGEM0", "Overall": "2.0", "Content": "I had enhanced delivery, so the packers setup the TV on the stand for me. That's pretty awesome, I think. Anyway, the TV didn't pass my quality check. As other reviewers here mentioned about back light issues. Mine had this two inch shadows on both sides of the screen. This is visible if you're watching hockey or golf. I can't stand it, so I returned via Amazon. Again, packers came and packed the TV inside the box. Dealing with Amazon is the only positive experience I had with this model. BTW: I owned the LG 55LA6900 and that model didn't have that issue.", "Date": "May 20, 2014"}, {"Title": "I Love It!", "Author": "Shirley Priscilla  Johnson \"Author/Reviewer -...", "ReviewID": "R3PLMYPQUS1J9E", "Overall": "5.0", "Content": "It certainly was with great excitement that I awaited the delivery of the LG Electronics 55LB7200 55-Inch 1080p 3D Smart LED TV, and I was not disappointed. Upon arrival,I unpacked the box to find the instructions, legs and screws for the TV, power cable, remote, two pair of 3D glasses and some stuff to secure the TV to the wall if needed and group wires. Everything looked pretty easy. I screwed the legs to the TV as the instructions clearly stated to do, placed it on the table plugged my cables in and I was ready to go. Once I put a battery I provided in the remote I had spent about 10 minutes total on the setup That was great.Once turning the TV on it asked for internet access info. I use a router for the house so I added my password, done. Next it was cable provider info, I use DirecTV and that was simple as well I just told it which channel I receive cable on and which port I had it hooked to. Now I was about fifteen minutes into the setup and ready to watch TV!The picture quality is amazing and with the TV being so large I saw things on my regular shows that I had never noticed before. I feel in love with this TV with the very first viewing. However, there was so much more to see. I went to You Tube to find a 3D video. I watched the Avatar trailer in 3D. Wow, I can't believe it. It really is 3D. What is more amazing is I can watch all my You Tube videos on a 55inch screen. I had to adjust the audio to suit TV and my videos but it was easy to find on the menu.The menu appears on the bottom of the screen when you push the button on the remote. you can scroll through it easily and adjust it by moving the icons you use more frequently closer to the front. The remote looks like something from a space age movie. It is sleek and shaped like an elongated diamond. It has a tracker ball type thing in the middle that you can use to move the mouse around. Yes an arrow appears on the screen by shaking the remote and you move it around to make selections like the computer. Pretty cool if you ask me.I love that I can surf the net too. I was able to pull up and view all areas of my website.  My granddaughter is super excited about the game features and LG store. The apps are very easy to use. The first time you use them they have to update. It only takes a few seconds. You can choose to use HULU plus, VUDU, or Netflix to purchase movies or TV shows too. All in all it was very easy to set up and easy to use! The picture quality is amazing and the sound quality is good too. I highly recommend this to anyone looking for a 3D TV or an HD TV because the cost is considerably less expensive than other name brands. It is definitely a product that will give you more than you imagined. Each day I am amazed at the different features I find.I just have two problems now. One is keeping everyone in my household from consuming it and two is making myself turn it off to do what I need to do in my life. I truly love this TV, it has everything I could ever want, and some features I never thought possible. Again, Very highly recommended.", "Date": "April 28, 2014"}, {"Title": "TV is amazing in every way.", "Author": "Frank D. Tank \"Frank D Tank\"", "ReviewID": "RCASHGR7EPICM", "Overall": "5.0", "Content": "Love everything about this TV.1. The TV itself is a beautiful piece of furniture and is an awesome centerpiece in my living room.  They knocked it out of the park with the minimalist look.  With a near-frameless design, the glass goes to three edges, with only a thin bezel on the bottom edge of the TV.  Even the legs look great--some other TVs look too alien-spaceship-like.  The beauty of this TV is that it doesn't look too gaudy/showy like some electronics tend to be.2. Set-up was easy enough to handle by myself single-handedly.  The TV itself is super-thin and really light for its size.  The legs look great and are more stable than I thought they'd be.3. Although I've attached this to a 5.1 surround sound system, the built-in speaker system on this thing is pretty great.  Super-thin TVs like this usually have anemic-sounding speakers, but not on this.  The built-in speakers sound crisp and clear, and even have a decent bass.  Of course, getting extra audio equipment such as a soundbar, or surround speakers, and a subwoofer would improve the audio experience, but you could get away with using the TV speakers by themselves.  Honestly, if you're buying a high-end TV, you really should get extra audio equipment anyway to get a better home theater experience.4. I'm not exaggerating by saying the picture quality is stunning.  STUNNING.  Parents, friends, and visitors who have seen this thing in action are blown away by the clarity, sharpness, and beautifully rendered colors.  They had not realized that HD could be so clear and sharp.  It's almost disconcertingly too sharp, especially with how smooth the movements are.  This is also known as the \"soap opera effect,\" but hey, this how HD is supposed to be!  Once you get used to it, you can't live without it, and everything else looks grainy and inferior.5. We watched Pixar's \"Up\" in 3D; we were freaking out and dodging balloons.  \"Pacific Rim\" in 3D was pretty stellar.  \"Nitro Circus 3D\" can be watched through Netflix--stunts and action in 3D is outta control.6. This TV comes with 1 year of free Netflix, therefore helping reduce its net cost.  Hooray!  Check the LG website for details.7. The Smart TV interface utilizes WebOS, and it's the best Smart TV interface I've yet encountered.  I was surprised and impressed that you can open several apps all at once, and switching between open apps AND video inputs is a breeze.  Each active app/input displays a little miniature window, offering an easy glance at what's going on.  There aren't many apps available yet, but I'm content with the current offerings (Netflix, Youtube, Amazon, Vudu, etc).  The Smart features/apps also run pretty darned fast.  Temper your expectations though--this is not a tablet, smartphone, nor laptop.  It is a TV first and foremost, but I'm definitely impressed with the speed and ease-of-use of WebOS.8. My only complaint is that this TV set only came with two pairs of 3D glasses--not enough for movie night with friends and family.  I'd have been happier if it had four.  This is too small a shortfall for me to dock points off its score, but other potential buyers should take note.  (This is my second LG 3D TV, so I have six total 3D glasses:  plenty for movie night!)Even if you're not interested in the Smart TV or 3D features, this TV is excellent just by itself because those features necessitate a well-built panel.  I use this TV for regular TV viewing and blu-ray watching 99% of the time, and I'm extremely satisfied.  This is my 3rd LG TV, and I've become a huge fan and loyal customer.  The LG 55LB7200 hits the elusive mark of good value and high quality.  I could not be happier with this purchase.", "Date": "April 25, 2014"}, {"Title": "2014 LG 55-inch 1080P 3D Smart LED Flat Screet", "Author": "Bob Marsh", "ReviewID": "R2AUB5U83P7U4D", "Overall": "5.0", "Content": "What a great TV.  I love the new style, they cut the frame down to about a half inch.  Picture is super sharp.  WiFi, very low energy cost.  240 Hz. New Magic Remote is very easy to use, have not tried the Voice Mate yet but it is on my list to try.  The 3D function with the new glasses (no more batteries to be charged), are fantastic and the picture is very sharp and the 3D reaches out and grabs you.  If you are looking for a great TV, take a look at this one.  And if you want a great Blu-ray player, take a look the LG BP730 4K Upscaling Smart 3D Blu-ray Player with Built-in Wi-Fi.", "Date": "April 27, 2014"}, {"Title": "Flawless High Def Television at it's finest", "Author": "Kane B", "ReviewID": "RZ9FUSPH7JSWF", "Overall": "5.0", "Content": "I always try to do my homework when I make a large purchase, that being said, for the past two years I've researched LG smart TVs before I bought one. I also took the liberty of talking to a couple of the top TV reviewers, who blog and do reviews for a living. With all the information I needed to make an informed decision, I selected this set, for it's rich features, right price and quality design.The design is breathtaking to say the least, highlighting the screen and an almost a nonexistent bezel; even with the set not on, it still is very beautiful and will easily become the center of whichever room you decide to put it in. The silver luster feet also add to the effect of pure modern design. Hands down this is one of the best looking TVs I've seen.It was very easy to set up, with a mini cartoon for help. I though it was cute. As soon as you open it, and cut on the motion remote, the menu are it are there to make your life a breeze. Once the TV is on the menu will pop up, Netflix, LG store, Vudu, Amazon, your connections (cable box, or dish and hdmi), and YouTube. The magic remote once you get use to it is easy to work along with the motion selection. The only draw back I didn't like was the voice recognition, it needs work.Web OS app can navigates the strong processor the TV has.The picture is crystal clear, I mean pixels are so detail to the last point, simply immaculate color dances across the screen. The color is like gel it moves so fluid and natural on the screen. Sports, fast paced action, and video games all look amazing. The color spectrum is fully represented while watching your favorite shows and blu-rays. My guess couldn't believe how great the colors is. I can not express how pleased I am with the picture, the quality is the best out of my ownership of 7 previous other sets of various brands. Picture defines the word dramatic.There are all kinds of setting to change the colors if you like, and you can also calibrate it and adjust the back lighting. The back light is even and very bright in a pitch dark room. Here is the link to calibrate this model. [...]3D REVIEWLet me just say this first and foremost \"You have not lived until you watch the Hobbit the Desolation of Smog in 3D on this bad boy!\" It was masterful just to watch the entire movie with the that special dimension added to it. We watched a couple of movies with the family and some friends in 3D. Kids loved it, a friend of mine who didn't care for 3d is now a full believer because of this TV. It made him eat his own words. We also watched the Avengers, we were dodging bullets, debris, and the Hulk all while having a blast. We hadn't had that much fun in awhile. Tara, my cousin said that it was better 3d and picture then going to the movies. The side angels and depth are about a 9 out of 10. Be warned the 3D will suck you right in and you will become part of the story!The speakers get loud up to 100 in volume. I would recommend this TV for anyone, but especially families. Parents and kids alike will enjoy setting up the TV together, not to mention the tons of content of the apps and TV. My over all score for this TV would be a 98-99 out of a 100 because everything is almost perfect with the exception of the voice commands but hopefully the software update will solve this woe.Also we received a year free subscription to Netflix. Lastly one of the best features of this TV is the ability to change anything in to 3d.Just a quick note about 2-3 of the one star reviews on this set, these are people who DO NOT have this particular TV model or have even seen it in person. They were just making a general blanket statement, about LG as I have read them. Personally I do not write reviews unless I have used the product for sometime.", "Date": "June 4, 2014"}, {"Title": "Excellent picture quality and the 3D is nothing short of amazing!", "Author": "Cute Chihuahua", "ReviewID": "R3TVMQHXQSSCYS", "Overall": "5.0", "Content": "We recently upgraded from a 42\" 1080p LG LCD TV that we purchased several years ago to the LG 55\" 1080p 3D Smart LED TV. Let me first start of by saying that our old TV is still going strong and I have never had a problem with it. We own quite a few LG products and we have found the brand to be reliable and well made. While my old TV was top of the line several years ago it already seems like ancient technology compared to the LG 55LB7200 55\" 1080p 3D Smart LED TV. I will list some of the best features about this TV below.The first big improvement on this TV is the size of the border around the screen. My old TV has a section around the TV screen that was about two inches wide. This TV is basically all screen and that's all you see. The screen goes edge to edge on the top and sides. There is about 1 mm of high quality metal framing. On the bottom there is about ¾ an inch of black frame because there is s power indicator light installed in that section and several buttons as well.This TV weighs in at 41 lbs. which is expected for a TV this size. It's extremely thin so it looks very professional if you choose to mount it on the wall. Our last TV was sitting on an entertainment stand but this TV was too large to fit on the stand. So we decided that it would be best to wall mount it. There are tons of different wall mounts but most of them have one thing in common and that it how expensive they are. We decided to save some money and go with the Cheetah Mounts APTMM2B Flush Tilt (1.3\" Profile) TV Wall Mount Bracket for 32-65 inch LED, LCD and Plasma Flat Screen TVs Up To VESA 684x400 and 165lbs, Including a Twisted Veins 10' Braided High Speed with Ethernet HDMI Cable and a 6\" 3-Axis Magnetic B.... This wall mount is rated very good on Amazon with thousands of reviews. We are extremely happy with our decision to purchase this wall mount. It's not only one of the least expensive wall mounts that I have seen but it's also one of the best. The wall mount is excellent quality and the instructions are easy to understand. It also includes every nut, bolt and screw you could possibly need. It took a little work but this TV looks awesome mounted on my wall and I am glad that I did it. If you choose to sit this TV on the floor or on an entertainment stand it does come with sturdy legs that are chrome on the front. They look nice if you prefer not to wall mount it. If you intend to mount it on the wall you may want to hide the wires that are coming out of the bottom of the TV. I purchased the Legrand C30LG Flat Screen TV Cord Cover Kit and installed it below my TV. Once installed you can put all of the wires inside and snap the cover into place and it really gives it a professional appearance.The IPS panel on this TV makes viewing at any angle equally good. We have family over a couple times a month to watch movies and this TV is much better for living room full of people. I usually have to be directly in front of the TV but that is much less of a problem since we upgraded to this TV.This smart TV can do it all. It has built-in WiFi and an ethernet port if you prefer a wired connection. It has an internet browser that is easy to navigate and use. The internet browser looks a lot like google chrome with favorites and quick links to recently accessed pages. It also has a smart remote that has a pointer on the screen similar to a computer mouse. It automatically updates the software in it each time that you turn the TV on. It's used for changing channels, volume, settings, apps, games and everything. It has built-in voice recognition so you can push a button and talk to it and it will follow certain commands. It seems to understand what I am saying about 90% of the time which is pretty good in my opinion. It's also easy to program so it will control your cable box or other devices like a blu-ray player after the initial set up. The remote is really excellent with one minor exception. Like I said before every time you turn the remote on it will check for a remote update. This causes a delay of about 10-15 seconds sometimes before you can control the TV. It's not a huge deal but it can be annoying at times.There are tabs for all your favorite movie streaming apps like Netflix, Hulu Plus, Vudu Movies & TV and Amazon Instant Video. The tabs are there by default but it will still need to install the app the first time you run it and it will need to occasionally need to run an update to the software. Once you are set up there apps are quick and easy to use.There are also tabs for YouTube and Skype as well.  The YouTube app is well organized and easy to find your favorite videos. It has many different tabs so you can easily flip through to different categories. Then there is the LG store where you can download both free apps like Pandora and Crackle and many other of your favorite apps. There are many other apps that you can purchase.There are games that you can download directly to your TV that you mostly have to pay for but there are occasionally free games like Air Traffic Control that I have been hooked on playing lately. Most of the good games you will have to pay for though.There are regular movies, high definition movies and 3D high definition moves that you can view, rent or purchase. Select titles will be free from time to time but most of them you will have to pay for. Surprisingly there are some cool 3D shows for kids for free like several about dinosaurs, planes and nature.Visually speaking this TV is stunning in HD. I have never seen a better picture on any TV regardless of the price. My last TV had the same 1080p resolution but this TV looks much better and brighter. The colors are so much more vivid and lifelike looking.This TV is 3D compatible and comes with 2 pairs of passive 3D glasses. These are the type that don't take batteries of have power cords and they are just black lenses not the old fashioned blue and red lenses. We have a family of four plus we always have people over to watch movies so two pairs of glasses wasn't enough for us. The glasses aren't very expensive to purchase extra pairs so it's not that big of a deal. I used to think that 3D technology was never going to be mainstream because of the added cost. However we purchased a couple movies recently in 3D including Marvel's The Avengers (Four-Disc Combo: Blu-ray 3D/Blu-ray/DVD + Digital Copy + Digital Music Download) and  The Hobbit: The Desolation of Smaug (Blu-ray 3D + Blu-ray + DVD + Digital HD UltraViolet Combo Pack) and the effects were wicked when watching the movies on this TV. I have watched some good 3D movies at the movie theater before but didn't think they could look so good at home. This TV absolutely proves that it can product excellent 3D picture and really bring the movie out to you.I would say that this TV is pretty standard when it comes to the audio and video inputs that are on the back. This is a list of the available ports and plugs.3 HDMI 1.4 Ports3 USB 2.0 Ports1 Component and Composite set of ports1 Optical Cable Port1 PC AudioEthernet Port1 Headphone PortAs an added bonus when you purchase this TV before August 16th 2014 you will receive a one year gift subscription to Netflix. This is a great little perk and it's easy to redeem. All you have to do is register online and upload pictures of your receipt and the back of the TV where it lists the serial number and model number. Once you do that they will send you a gift code that you enter online to redeem. I think Netflix is currently about eight bucks a month so this is a big bonus. I like Netflix so this was a nice little perk that we can enjoy all year long.Overall I couldn't be more pleased with this TV and find it hard to believe that are so many poor reviews on it. I can only speak for myself but I have had no problems at all.", "Date": "May 25, 2014"}, {"Title": "Great UI, sleek design but major dimming problems", "Author": "James Beswick \"Thanks for your time\"", "ReviewID": "R3BGW7SIIJEZQ3", "Overall": "3.0", "Content": "First the good: the SmartTV feature is very well implemented with a good selection of apps, a well designed user interface and the speed that's missing from my Phillips SmartTV. They've clearly put a great deal of thought into the bridge between the TV and computer-like experience and it's both intuitive and simple to use. The 3D works flawlessly with the included glasses though it feels a little gimmicky and in reality is the sort of thing you can use once in a while but not every day - Avatar looks great on the TV though it suffers from the smallness of the screen. It seems that 3D really requires a massive area to be as convincing as in the movie theaters.Set up is easy, the Wii-style remote works well (especially if you're used to these gaming controls) and is great for entering text compared with a standard remote. The device overall is aesthetically pleasing and fits in with a modern-style lounge or living room environment. The audio isn't bad by itself considering the size of the speakers and compares very favorably with other high-end TVs at this price point but truthfully you're going to want a separate sound system if you're investing this heavily in home entertainment.The elephant in the room is the problem that other reviewers have described and it's been driving me crazy. There's a constant dirty screen effect that starts to become really annoying. At first I was wondering if it was caused by compression artifacts but I've played the same scenes on different TVs and this is the only one that features a constant haze like the screen isn't cleaned properly. It's particularly noticeable with rapid movement too (such as when watching sports). It's a serious issue that I've not seen before on any 50\"+ TV screen and even others in my household keep asking what's wrong with the TV.By itself, this might be manageable but it's compounded by a bizarre auto-dimming effect that completely screws up the transition between dark and light scenes in a film. It's like the TV is auto-adjusting the brightness and there doesn't seem to be any way to disable the 'feature'. It's a real shame since the rest of the TV is a 5-star, high quality piece of hardware and it fails at this important but critical point. I've switched back to my 2-year old Phillips which has a worse UI but at least doesn't distract when playing video. Hopefully they can push out a firmware update to fix the problems and if they do, I'll post a new review.", "Date": "May 9, 2014"}, {"Title": "Dirty Screen Effect", "Author": "Mark", "ReviewID": "R3LARLNKB2QOFH", "Overall": "2.0", "Content": "I bought this TV from Best Buy on recommendation from the manager of the home theater department.  He felt it was the best buy for the money, and also noted it was part of their Magnolia line.  The picture seemed pretty awesome at first, until I turned to hockey........which I watched a lot of recently.  I had the same issue as others with the DSE.  I really haven't seen anything like it on any other set before.  I went to my neighbor's houses, friend's houses, etc, to make sure that this wasn't just something I had not noticed before.  But unfortunately, no other TV had it.  Agreed that other TVs being edge lit have other issues, but the DSE here is something I simply couldn't put up with, even though I loved the design.  Had to return.", "Date": "May 8, 2014"}, {"Title": "Excellent sharp and bright TV, some (minor) issues", "Author": "Herb Gellis", "ReviewID": "R3VYINKDR9RWA0", "Overall": "4.0", "Content": "As we bought this under my wife's account I imagine this won't appear as a \"verified purchase\". In any case we've had it for about a month and a half and it has been excellent in most regards - sharp picture, excellent color - with many many controls to help zero in on \"best\" picture quality, and you will probably want to do at least some tweaking. Unlike another reviewer I really like that each generic picture setting is a separate definition so you can mod them independent of each other. E.g., there are two separate ISF \"Expert\" generic settings you can define, plus the more targeted ones like Vivid, or Cinema (my personal choice), Game, etc. You can then choose from any of these settings for each input, independent of each other (so you could use the \"Game\" setting for an input with a game controller, defined differently than watching cable TV, or blu-ray, etc.)This is our first smart TV, and it's pretty smart. You can use the on-screen programming to define some of your other components, such as blu-ray player, and use the magic remote to control them via on-screen controls; these are somewhat generic controls so not every function on your blu-ray player can be operated this way. I discovered that after registering our fairly early generation Samsung player to the TV, that when you turn the player on the TV automatically switches to the blu-ray input (if it's connected directly to the TV); unlikely to be able to do this if you are connecting your HDMI devices through a surround processor or receiver).The magic remote is like a Wii controller but it doesn't seem to be laggy (don't know about the Wii U). It does seem to drift though, in the sense that where you are pointing may change away from where the cursor is on the screen; you can resynch this by pointing the remote to a side or corner until the remote is actually pointing right at the cursor on the screen again.Our TV has a mild case of the DSE (dirty screen effect) that others have mentioned. I never had even noticed it until, after several days, I asked my wife what she thought of it vs. our older DLP set. We were watching ice hockey and she mentioned the DSE. On light and fairly consistent colored background you can see a very light matrix of dimmer areas across the screen, plus the corners, and the vertical left and right bars at the extremes, but all of this is quite faint. 99% of the time I don't notice it. We decided to keep the TV after using it for the 1st month when returns were still possible.Although most LCD sets have bad audio I was surprised that this one was pretty decent - mind you it's not going to replace a home theater system by any means, but the sound had a fullness that was quite pleasant, compared to others that sound more like thin telephone audio.We've tried the Netflix, Amazon and web browser apps, all of which work well, though the browser is more basic. A test short movie in 3D via Netflix seemed crystal clear and very bright. We have the TV wired via ethernet cable not WIFI and currently have DSL, so way under the curve of what is possible speed-wise. We've only had trouble with buffering over and over once, but that was when the internet was \"acting up\" in general when we had trouble even on our computers.The more we watch the more I enjoy the set's positive qualities - DSE was the only thing that gave us pause, but for us it was pretty minor. If LG could fix it with a firmware update I would have no problem giving this a 5-star rating.", "Date": "May 26, 2014"}, {"Title": "Technology keeps getting better....", "Author": "Quixote010", "ReviewID": "R2I04TGJJYHNPY", "Overall": "5.0", "Content": "I'm not a \"technophile\"... I have an IPad, a desk-top computer and a basic phone.  I wouldn't consider myself an expert, but I'm beyond being a novice.  What I want from a TV is that it gives me a good picture and works.  This TV gave me that and even more.  Apparently the set was fawned over at the 2014 Las Vegas technology convention, and I can understand why.Let's start with the basics...1- First impressions:  right out of the box this looks like any normal TV except I immediately noticed that there is a minimal border.  The picture goes nearly to the edge.  What this means is that I picked up at least 2 inches on my wall in usable space.  This might not seem like much at first, but I was able to put this in the same place I previously had a 46\" monitor and didn't have to move or adjust anything except to move the bracket up a bit.2- Set-up:  First, recognize that this is really a big computer.  You plug it in and it uploads and updates all the software you need. The picture was great right out of the box, but the unit was set to energy-save meaning that it tended to go darker some 15 seconds into changing channels.  LG was able to immediately tell me about the problem and a one click adjustment took care of it.3- Adjustments:  Because it is essentially a computer, I wanted to see what other settings were available.  The coolest think about this system is that it comes with a mouse-like pointer that allows you to access the features of the set with a simple point and click.  Along the bottom of the screen is a variety of choices of other applications like HULU or Netflixs or Youtube.  Another is  a help screen.  It took me a bit to figure out how to change contrast and color, but the pointer made it a breeze to make my changes.  I discovered that a simpler way to change your settings is to click on a \"star\" that appears in the upper corner of your set and immediately takes you to settings where you can do your thing.4- Help features:  Want to connect a sound-bar? One application on the set in the main menu deals with \"connections\". By simply pointing and clicking, the set finds your sound,bar and automatically connects with it.  Other settings include connecting with other computers and cameras although I have not tried those.  I assume it would work just as easily.  If you are into music, you can also connect your phone via Bluetooth and stream the sound thru your set.5- Picture and sound quality:  Unquestionably this set has the best picture quality I have seen.  I was concerned that being so large I would lose some quality, but honestly, this picture is outstanding.  Apparently there is a feature that increases and decreases the back lighting, but I haven't paid a great deal of attention to it.  All I know is that the picture is exceptional.  Watching sports on it like golf allows you to see the natural shading and variations of the course and I recently watched a travelogue where the countryside was spectacular.  Unlike other LED sets, the sound from this TV emanates from the front of the screen rather than the sides or back.  Although the sound quality is fine, I have an LG sound bar beneath that boosts the chatter and noise.  I like it, however I have to control the sound with my LG clicker.  AT&T; Universe does not have a code that allows me to control the sound like I do the channel selection.  It is a new sound bar so maybe in time I can get it to work.  Otherwise a setting on the TV allows me to control the sound on my TV mouse.6- Connections: an HDMI cord, power cord, and internet interface USB device is all you need.  Although I previously had a LG, the operating system in this one seems to connect me to Netflixs and YouTube almost immediately. I have an Amazon Prime membership and I have been able to watch streaming movies there, also.  LG also has their own application can gives you access to some movies and television shows and the sets connects easy. Apparently LG is adding more selections.  Again,  the picture quality is outstanding and although streaming from an internet source, uninterrupted.7- Operating system:  LG touts its WebOS which apparently is responsible for its quick internet interface.  I'm not a gamer so I'm not certain what other advantages I directly get other than those I have already mentioned.  My next step is to hook up a camera to the system and talk to my son via Skype.  Eventually I want to see how my computer connects and operates.  One feature on this particular set is that it allows you to watch in 3D.  Unfortunately television hasn't made that conversion so the only this available is usually an animated movie from Netflixs.  I haven't ventured that far yet so I can't comment fairly on it.Final analysis:  This TV is probably 50% more than I need.  I doubt I will ever get all of the benefits out of it.  I suppose if a gaming system was connected to it, I would find future features.  Still, the picture quality is superb and I'm discovering new things with it that have enhanced my viewing experience.  My wife thinks its rather large, but that seems to be the way of television technology today and is more a personal preference.  I've looked at a variety of sets and strongly feel this is as good as it gets.", "Date": "May 10, 2014"}], "ProductInfo": {"Price": null, "Features": "Refresh Rate: 240Hz (Native); Motion Clarity Index: 960 (Effective)\nBacklight: LED (Edge-Lit w/ Local Dimming)\nSmart Functionality: Yes - WebOS, Includes Magic Remote\nDimensions (W x H x D):  TV without stand: 48.5'' x 28.3\" x 2.2'', TV with stand: 48.5'' x 30.3'' x 9.7''\nInputs: 3 HDMI 1.4, 3 USB 2.0, 1 RF, 1 Component, 1 Composite, 1 Digital Audio Out (optical), 1 PC Audio, 1 LAN, 1 Headphone\nAccessories Included: Magic Remote and Two Pairs of Battery Free Passive 3D Glasses", "Name": "LG Electronics 55LB7200 55-Inch 1080p 3D Smart LED TV", "ImgURL": "http://ecx.images-amazon.com/images/I/51VkgsYGW5L._SX300_.jpg", "ProductID": "B00II6VYI0"}}