{"Reviews": [{"Title": "Fantastic TV", "Author": "B. Goldfarb", "ReviewID": "R1V47GY12B6144", "Overall": "5.0", "Content": "So far I am impressed by this TV. The picture is fantastic. Right out of the box the picture looks great! Connected right to the internet and started using the smart hub. Very easy, very fast, no issues.Again this TV for the price and what it offers is fantastic. I was looking between Sony and Samsung. I wanted first and foremost a fantastic picture and both I feel are the best. All others are second, third and .... But with Samsung you have about 8 models to choose from with fantastic price points. Sony had two, both double what I spent. I got this one because it had everything you need. This isn't their thinnest TV but I'm not hanging it n the wall so does it really matter if it's 4 inches or 2 inches. Didn't need 3D but really wanted a smart TV and looking at all I think Samsung has the best smart features out there. I know there are several other features on the more expensive that upgrade the picture,etc... But I'm telling you this picture is crystal clear, the detail on the picture is fantastic and my wife who used to watch the channels on the non-high def channels on the old TV is even impressed with his picture, amazing. One last thing, I have this connected to my surround sound system which I mainly used for my blu ray player and was concerned about the quality of the speakers because of what everyone says about the thin TV's. Well for everyday TV viewing these speakers are fine, you don't have to turn them up full, I'm at about a quarter to a third and the clarity is fine. It also has some settings to change the sound for music, movies and it has clear voice. This blocks out all the music background and you just hear he voice, very nice. Overall this is a fantastic TV.", "Date": "March 4, 2014"}, {"Title": "4.5 Stars really...great Smart TV though", "Author": "Lee McCoy", "ReviewID": "R2MPR1T0GOVOCW", "Overall": "5.0", "Content": "I've had this set for about a week now. A lightning storm fried all my HDMI ports on my previous living room set (LG 47LW5600), so I decided that $799 for a 55\" Samsung was too good of a deal to pass up.  One thing that I noticed when going up in size to 55\" is you notice any blemishes in picture quality.  Fortunately (with the proper picture calibrations) this set delivers in spades.Pros:- The size...it's perfect for the average living room.  Big movies look bigger (Pacific Rim, Avengers, etc.)- Samsung Smart Hub has a pretty decent user interface and is very pleasing to the eye.  It also has most of the essential apps (Netflix, Hulu, Vudu, HBO Go, etc), and an app store.  It also features a great browser.- Functionality! When you input a new source, the TV navigates without you having to manually change said source (i.e. pop in a blu-ray, the TV automatically goes switches to the source if you're not already on it).- It's a sexy TV for the most part...all black trim, and the screen takes up most of the size because of the thin border.- Built-in Wifi.  I was online in under 2 minutes with this thing.  Also streams without buffering or hiccups unlike my last TV.- There are LOTS of picture setting options to play with, so you're sure to fine tune your display to your specific needs.- The price.  This is a great TV for someone on a budget.  You still get a quality HD set.- This TV is actually really light for it's size.  I was able to hang it on my wall by myself, although I would recommend having a helper for all the cables and whatnot.- Many more...Cons:- I strongly suggest having a external sound system, like a sound bar.  The audio is not the best.  This wasn't a concern for me though.- Only 2 HDMI ports.  Luckily I only needed 2 for my blu-ray player and Directv receiver.  This is easily remedied if you have an audio receiver.- The picture presets, while great to the average viewer, can be a LOT better with the proper calibrations.  I suggest heading over to a good home theater site to get some good calibrations.  My set sings now.- I've read that the stand isn't the best, but I hung mine on my wall so this wasn't a concern.Overall, I would rate this TV a 4.5/5.", "Date": "May 7, 2014"}, {"Title": "Great picture and features.", "Author": "Steven Guin", "ReviewID": "R37MHG21S3JFFB", "Overall": "5.0", "Content": "Excellent picture. Great audio, smart menu and options are great, but a little slow.  Got my moneys worth and then some.", "Date": "February 24, 2014"}, {"Title": "More HDMI inputs please!!!", "Author": "Wallace", "ReviewID": "R35TLWXQ1BSL1J", "Overall": "4.0", "Content": "Awesome set in every respect.  The picture quality is unbelieveable.  My only complaint is that it only has 2 hdmi inputs.", "Date": "May 6, 2014"}, {"Title": "Worth the price", "Author": "Viswanath Putcha", "ReviewID": "R39LSW4ZTAKP90", "Overall": "4.0", "Content": "Though its a 2013 version. I got what I wanted from a smart TV. Apps, Speed and best of all the 240CMR. happy with this product", "Date": "May 22, 2014"}, {"Title": "No YouTube, No Screen Mirroring", "Author": "S Khan", "ReviewID": "R1XZ687EZOW53B", "Overall": "3.0", "Content": "I bought this TV so I can enjoy \"YouTube\" on my Smart TV, but there is NO youtube app for this TV. Samsung says everywhere on their site \"2013+\" models have screen mirroring option, that means I can Mirror my Samsung Galaxy Screen on my TV. This TV is a 2013 version and it does NOT have screen mirroring option.Great Tv, but Smart Tv? I dont think so.", "Date": "May 30, 2014"}, {"Title": "tv", "Author": "Ann A.", "ReviewID": "RYFK21ZDZUF11", "Overall": "4.0", "Content": "took a little while to get settings correct.now I am very satisfied with the picture.I would recommend this tv.", "Date": "May 12, 2014"}, {"Title": "great tv", "Author": "Colton Smith", "ReviewID": "R2E7MGVOYQZ1XJ", "Overall": "5.0", "Content": "this is a great tv. it has a good picture, the smart tv is nice and the thing works well. the only downside is that 2 hdmi ports is too few.", "Date": "June 2, 2014"}, {"Title": "Super !!!", "Author": "Greg L.", "ReviewID": "RHEY2MDT7W05F", "Overall": "5.0", "Content": "Very impressed with color quality and super sharp resolution! Assembly was simple. Initialization and F/W update was painless. One disappointment was no channel program forecast, only lists current program. Could have saved a few dollars at Best Buy but Amazon had it delivered to my front door for free.", "Date": "May 27, 2014"}, {"Title": "Smart = Dumb", "Author": "John Doe", "ReviewID": "R2KK16LN8HF00D", "Overall": "1.0", "Content": "The picture and such is OK.  The real sanfu is the Smart component.  Save yourself $300 and get anything that is not Smart.  You have to enter all the commands via the hunt and peck remote.  There is no way to hook up a keyboard to this.  You may be able to use a keyboard for some things but not You Tube or Net Flex.If you want to determine who has the best TV - call their customer support.  Samsung's customer support is a joke.TV might be OK but the Smart aspect is bad.  You will be stuck with this.  It is not like the other pug ins that will be upgrading.  If Samsung ever up grades it Smart component they will want you to buy a new TV.Smart = Dumb", "Date": "May 19, 2014"}, {"Title": "HDMI will fail spontaneously. Avoid Samsung sets.", "Author": "Lori", "ReviewID": "RZ5YVSM1NDFN", "Overall": "1.0", "Content": "I have owned it for 3 years and it failed one day out of the blue and stopped recognizing PC or PlayStation.  Remote is horrible also on this TV. Avoid it, it is buggy product.", "Date": "May 15, 2014"}], "ProductInfo": {"Price": "$949.97", "Features": "1080p HDTV : Better picture quality\n120Hz Refresh Rate: Better for general viewing and good for video games, action movies, and sports\nSmart TV: Interact with streaming content and the web\nTV without stand (Width x Height x Depth): 54.1 X 31.5 X 3.7 Inches, TV with stand (Width x Height x Depth): 49.2 X 31.1 X 9.0 Inches", "Name": "Samsung UN55FH6200 55-Inch 120Hz 1080p Smart LED HDTV (2013 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/31zIonagZ%2BL._SY300_.jpg", "ProductID": "B00I2MPHM4"}}