{"Reviews": [{"Title": "Good tv", "Author": "Mike", "ReviewID": "R1HDMUM2BWT3XP", "Overall": "4.0", "Content": "This TV is good for one player gaming. The TV can read only pictures from a usb device. Great picture quality, and decent sound. Not a lot of bass, but is loud. If you plan on using it as a computer monitor it only has VGA and HDMI, no DVI.", "Date": "March 22, 2014"}, {"Title": "Great picture, mediocre sound", "Author": "A. Plaut \"Tech Junkie\"", "ReviewID": "R3HWG9S07QY3Z", "Overall": "4.0", "Content": "I've been using this TV for three weeks, and I must say I'm very impressed with the picture quality. It blows away the Philips 720p TV that I replaced. The 60 Hz refresh rate is usually not noticeable, so why pay more for 120 Hz or 240 Hz? The thin bezel and lack of embellishments make the TV look stylish. The only complaint I have is that the sound is a little \"tinny\" (poor low frequency response -- hence four stars). I fixed that by investing in an inexpensive sound bar with a subwoofer. Now I have both a great picture and great sound for not a lot of money. Would definitely recommend to a friend.", "Date": "May 15, 2014"}, {"Title": "Great bargain.", "Author": "Peter Dzanbozoff", "ReviewID": "R1NMMF4C5JCXVH", "Overall": "5.0", "Content": "This TV has a great picture and the price was right. Very easy setup. I like the narrow frame, makes it look like all there is is picture.", "Date": "April 18, 2014"}, {"Title": "Perfect TV and great price", "Author": "Joseph Santiago", "ReviewID": "RTEVBA3E2KK8Q", "Overall": "4.0", "Content": "This television is perfect for anyone. The picture is great and very vivid and fluid (you MUST adjust picture settings, do not use default). The price tag is incomparable. At first I was set on getting another product, but then I noticed that it was REALLY thick so I switched to this one. Beware, most products around this price tag are pretty thick for a 'flat' screen, however this TV is really thin and modern and is perfect for me! Some people complain about the sound, but with the surround sound setting on the sound is pretty good! I would not call it perfect, but it is the best sound I have heard thus far compared to my old Westinghouse. My only complains are: there are only two HDMI outputs, I think there needs to be at least three, and there are no buttons on the TV so you cannot lose your remote! At this price tag, definitely buy this TV if you want a great product for this budget price. NOTE: Beware this TV might not withstand rough shipping. I originally purchased this TV from Best Buy, and after UPS was through with it the TV screen was broken and I had to exchange it at the store, I would have been seriously upset if it was from Amazon with no physical store. I suggest that you purchase this TV from an actual store rather than risk UPS/other carriers with the screen. (Best buy has the same price in store right now.)", "Date": "May 16, 2014"}, {"Title": "Great picture, disappointing audio", "Author": "Willard J. Stluka", "ReviewID": "R1BVV8J6ZJDCBN", "Overall": "3.0", "Content": "Just received this set today.  Clean design.  Just the right size.  Great picture, but very poor sound quality.  Could be why they sell a sound bar?", "Date": "May 1, 2014"}, {"Title": "Just okay", "Author": "claybob", "ReviewID": "R20BS04WLKLEF3", "Overall": "4.0", "Content": "I got this after a review on the wirecutter recommended the smart version. I'm glad I got the dumb one so I can move my chrome cast to another TV in the future.The wirecutter review said you couldn't really see a difference between 1080p and 768p. Not true. I have a 24\" iMac that has a higher resolution screen and I can definitely see a difference from 8-10 feet. It's not that the image quality is bad on the Vizio, it's just not tack-sharp.The sound is mediocre at best, with some bad distortion at higher volume.The design is elegant and functional. The stand is a little wobbly, but I don't worry about it.I use this TV in a small room with a chromecast player. It's a good combination that gives me the content I want. It's not perfect, but at this price I have a good product.", "Date": "May 21, 2014"}, {"Title": "Excellent value and great video quality", "Author": "David Ebel \"CoachDavid\"", "ReviewID": "R1JUYM4NRUQU72", "Overall": "5.0", "Content": "We only have a small area in our office to share video information. By buying this screen and attaching it to a computer we are able to play informational videos, classes and worship videos playing in the background ... all very valuable in a ministry setting", "Date": "April 6, 2014"}, {"Title": "Surprisingly good black levels / exceptional value.", "Author": "Ryan", "ReviewID": "R2P47SZ4TW8UGH", "Overall": "4.0", "Content": "Pros:Exceptional black level:  some of the best I've experienced with any LED based flat panel.  It's certainly not plasma good (I have an st60 to compare),  but it's very good.  Especially at this price point.Very crisp and clear. Much more so than a 42 inch LG that I got on sale 2 years ago for $750.Extremely bright.  Will do well in bright or dim rooms.Cons:Not the most accurate color.Not the best motion.  If you want better motion you will probably want to upgrade to a 120hz + flat panel.Not the best build quality.Dim corners.All in all an exceptional value and highly reccomended.  Many friends and family,  whom are experienced with flat panels,  have commented on how strikingly good the picture is.I calibrated using AVS test patterns,  X-Rite I1d2 colorimeter, and HCFR calibration software.  In this set a 2 point RGB white balance is provided,  and I was able to achieve a very accurate white balance using it (all delta E under 2 from 20 IRE to 100 IRE).  I was also able to achieve a very flat gamma curve although slightly low averaging about 2.1.  Colors are fairly inaccurate,  with red and magenta being the furthest off (15 and 23 delta E) - blue and green being the most accurate (4.4 and 6.2 delta E).  With no color management system to correct,  i know of now way to do so aside from adjusting color/tint.  These finds were after a fairly quick calibration session and I would like to spend more time ironing things out to see if I can get color more accurate - even so I was impressed with how easy I nailed down white balance and gamma curve.  I'll post my settings at a later date.", "Date": "June 6, 2014"}, {"Title": "Rating", "Author": "CM", "ReviewID": "R3VE6UKW6RBGXL", "Overall": "4.0", "Content": "I finally got it to work and it is OK. It would be better if an off button was on the TV itself. Everything is by remote control.", "Date": "May 31, 2014"}, {"Title": "Happy with the TV", "Author": "januarie", "ReviewID": "R2BH7P4L7FNQPH", "Overall": "4.0", "Content": "I needed a TV with a narrow frame to put in a 35.5\" cubbyhole. This was perfect.I'm not fond of LED TVs because of the \"tinnie\" sound. I expected poor sound quality when I ordered the TV so I also ordered a \"2 x RCA Male, 1 x 3.5mm Stereo Female, Y-Cable 6-Inch\". I had an extra set of computer speakers with sub-woofer that I figured I could hook up to the TV with the adapter. I'm pleased with the result. No more \"tin can\" sound.The picture is clear, the color is good. However, if you watch it at an angle, the color is washed out. This does not happen on my other LED TVs, both 32\".The TV is lightweight, which I really appreciate because I want to lift and work on it myself and I'm not real strong. The TV is a bit wobbly on its stand but easy to position and sits straight.For the price, I couldn't be happier.", "Date": "June 7, 2014"}, {"Title": "Good Investment", "Author": "chetan", "ReviewID": "R2I7JL2T8SY1O2", "Overall": "5.0", "Content": "I was looking for TV for short term and this was perfect and into my budget.Works well and worth buying", "Date": "June 7, 2014"}, {"Title": "Great Picture for the Price", "Author": "Mark", "ReviewID": "R3NBZ7B6ARF04V", "Overall": "2.0", "Content": "I'd definitely recommend buying the bigger size screen for the small price difference here:http://amzn.com/B00HHROCWQ/?tag=wwwquickfixau-20But, besides that I really enjoyed the screen quality, the build of the TV itself, but the sound wasn't as impressive.", "Date": "June 5, 2014"}, {"Title": "VIZIO 24' TV", "Author": "DICK", "ReviewID": "R126GQXBEOG124", "Overall": "5.0", "Content": "VERY NICE TV.  FITS IN MY RV VERY WELL.  EASY TO SETUP. LIGHT ENOUGH SO IT DOESN'T BOUNCE AROUND.  I\"M HAPPY WITH IT", "Date": "May 26, 2014"}, {"Title": "OK quality but has drawbacks", "Author": "Delgado \"A. Delgado\"", "ReviewID": "RCMBL67ZSJ0CE", "Overall": "3.0", "Content": "I purchased this Vizio and am pleased with the product. Picture quality is OK (nothing spectacular) and set-up was easy.However, one major drawback to keep in mind is that it only has TWO HDMI ports. (This is ridiculous, considering my Sony flat-screen that I purchased way back in 2008 -- when HDMI wasn't even as widely used -- has FOUR such ports.) Three or four HDMI ports should be standard on flat-screens nowadays. For instance, you may want to connect the following to your TV via HDMI:1) Your blu-ray player (HDMI connection is better than component connection)2) A Roku or similar device (connecting via HDMI is better than using other cables)3) your laptop or computerI now find myself having to plug or unplug HDMI cables, depending on which device I'm using, which is quite an inconvenience, simply because VIZIO decided to include only two HDMI ports.Also, the remote control is very flimsy, light, and almost seems like a fake/toy remote. It does not convey quality.This is an OK purchase but not one if you're really looking for quality. In hindsight, I would probably pay the extra $50 and go with an LG or Samsung.", "Date": "April 16, 2014"}, {"Title": "Defective TV", "Author": "B. B. Dickson \"muchoscartuchos\"", "ReviewID": "R3GGQHL2P493ZC", "Overall": "1.0", "Content": "The unit was defective.  Specifically, it would not change from \"in-store demo\" mode.  I contacted Vizio who decided it must be the remote.  It took a full week to get the new remote, which was a wasted week, since the problem was the TV.  Then it took another full week to get a replacement TV.  I could have bought the TV from Wal*Mart for about the same price, and exchanged it the same day.", "Date": "May 29, 2014"}, {"Title": "False advertisement as far as I can tell", "Author": "JT", "ReviewID": "R3N7Y42ZZ52LCM", "Overall": "2.0", "Content": "So I bought this TV entirely because it seemed like the best deal for a TV that can play video from the USB. The advertisement on the Vizio website and right here on Amazon very clearly state:\"1 USB port - enjoy photos, music, and video right on the big screen\"Yet only an option for photo shows up. I have tried numerous thumb drives and have reset to factory settings and have tried power cycling the TV numerous times... it would simply seem like the TV just does not play \"video on the big screen\" via the USB port. Now I have to buy a media player and have another remote to deal with. Thanks Viso for falsely leading me to buy this TV.2 stars is because I havent tested this with anything else as its sole purpose was to play USB video files. I assume it doesn't suck as much in other areas.", "Date": "May 13, 2014"}, {"Title": "Horrible OTA receptioin and wifi, awful setup", "Author": "H. Minnich", "ReviewID": "R39J4OQXRU1ULI", "Overall": "2.0", "Content": "I first had the E241-A1 and had screen issues, had over the air reception issues as well, but WIFI was easy to set up and seemed okay. I exchanged for this one. Setup sucked, reception sucks big time, and then while trying to watch a House episode on Netflix, it kept stopping and having to buffer. I never have those issues using my AppleTV and same Wifi to my 39\" Sansui LED/LCD non-smart TV. I'm returning this. If you need good reception, I suggest buying a TV with NTSC/ATSC/QAM. This is the third 24\" I've tried and returned. It went into the exact same spot as an analog with converter box, same antenna, and failed to pull the stations in.I'm going to try a plain old non-smart with NTSC/ATSC/QAM and hope things are better like they are on my 39\" I just bought to replace an older analog w/ converter box.I don't like that they advertise this to have the updated apps program Vizio API plus and show a fancy backlit remote, but this does not come with the nicer remote.Another reason I do not like this is that there is only a very tiny power button on the back that you can't really see. The A1 had a full set of control buttons on the unit. So if you lose your remote, or it breaks, I'm not sure what you'll be able to do without it except for turn the TV on and off. Mine is going back ASAP. Vizio is pretty much off of my list of TV's to buy, from here on out. I'm very happy with Sansui so far and will continue to look for a 24\" one of those.I would like to add that the sounds on this so far, really sucks big time. I'm not really very picky, but it's very tinny, and just not very nice at all.And I forgot to add, the sleep feature is buried in the menu, under timer, and requires a few clicks on the remote to get there. I want a sleep option easy to find/use.", "Date": "April 25, 2014"}, {"Title": "Initial Unit Defective - Replacement Great", "Author": "Mark Lyon", "ReviewID": "RIU9FT1VZ91HL", "Overall": "4.0", "Content": "Purchased this TV model from Best Buy.  When in use, it makes a popping / cracking sound at random intervals.  Sometimes, these noises are accompanied with a temporary muting of the audio.Edit: I returned that unit and, because all the others in Best Buy appeared to have the same lot number, ordered one from Amazon. It works well, does not have the noise, and has good video quality. My only issue is that the sleep timer isn't directly accessible from a button on the remote - you have to go into the menu to set it.", "Date": "April 13, 2014"}, {"Title": "Monitor blurry/ colors weird", "Author": "sergio trojer", "ReviewID": "R3UL1FF5EH4RLR", "Overall": "3.0", "Content": "I just got this monitor in the mail. It's so blurry that it makes my eyes hurt and the colors are way off.I don't know if there is something I can do to adjust that, but if there isn't, then I don't know how I can use this.", "Date": "March 25, 2014"}, {"Title": "hate it", "Author": "gilbert jackson", "ReviewID": "R27ME0Z7P4NXOT", "Overall": "1.0", "Content": "It doesn't work, bought it for grad present. My present sucked,thank you!!!!! Send a return label.  It smells like its burning.", "Date": "June 5, 2014"}, {"Title": "SCREEN FAILED", "Author": "T. Parker", "ReviewID": "R2T6BURNB8R8SP", "Overall": "1.0", "Content": "I did not purchase this exact same model however 3 years ago I purchased a Vizio 48\" LCD/LED smart television (my model was M470NV).  After just 3 years the screen failed!!  The bottom 5\" of the screen developed horizontal lines, blurriness, double vision-type effects.Vizio warrants their televisions for just one year.  The company I purchased it from adds a year of warranty.  Unfortunately I made it just past that time frame.  I contacted Vizio to see if they still might replace the television, help with the repair or provide some form of prorated voucher for the purchase of another television.  The response was simply to provide me with a couple companies that fix televisions and a comment along the lines of \"things happen with electronics.\"  I sent several more emails with questions that were answered by clearly canned responses.  My last email asked the company representative if he would be a satisfied customer if in my situation.  Guess what; no response to that question.", "Date": "May 15, 2014"}], "ProductInfo": {"Price": "$179.99", "Features": "Razor LED backlight - Distributes LEDs along the edge of the screen for a brilliant picture in an ultra-thin design\nE-Series Signature Design - An ultra-narrow frame, a thinner side profile, and slimmer new base makes the new E-Series a perfect upgrade to any room\n1 HDMI ports - perfect for connecting all your high definition entertainment devices to the TV\n1 USB port - enjoy photos, music, and video right on the big screen\nDTS Studio Sound - Simulated surround sound solution with deep bass, high frequency detail and clear dialog for an immersive surround experience using the TVs built-in speakers", "Name": "VIZIO E241-B1 24-Inch 1080p 60Hz LED HDTV", "ImgURL": "http://ecx.images-amazon.com/images/I/51jmm0foT6L._SY300_.jpg", "ProductID": "B00IGSAPV2"}}