{"Reviews": [{"Title": "Great Picture with one big exception", "Author": "Ryan Brady", "ReviewID": "R235M1V0D8R7FX", "Overall": "4.0", "Content": "I purchased this TV because the only thing I am concerned with is picture quality, and at this price it is simply unmatched.  In a dark room watching high quality HD content, this TV performs excellently.  I was slightly worried about the pen-tile pixel layout, but at a viewing distance of 11' I didn't noticed anything.The big problem for me with this set is the performance in daylight.  The screen is so reflective it might as well be a mirror.  It is so sensitive to light that the little bit of sunlight leaking through blinds is enough to kill the experience for me during the day.  I suppose I may be extra sensitive to this problem, but I suspect not.  For this reason I'm returning the TV, and either paying double for the f8500 (which is supposed to work much better in light), or sacrifice PQ and get an LED/LCD.", "Date": "April 7, 2014"}, {"Title": "Amazing price point for this TV.", "Author": "Justin Craig Sandifer", "ReviewID": "R2CTXDMEXY9JKG", "Overall": "5.0", "Content": "I replaced a 2006 model Panasonic 50\" plasma with this model, only because I wanted a bigger tv and Panasonic stopped making them.It has the same glare as any other plasma TV in daylight.  If you're putting this TV in a bright room, it's going to reflect everything.  Blackout shades on windows are your friend.With that being said, the picture quality is fantastic.  The debate on the RGB vs pentile is only valid if you like to sit 2 feet away from your 64\" panel.  There's no 3D, only a couple HDMI inputs (I've got an HDMI switching receiver so who cares), no \"smart apps,\" no frill remote (who uses their TV remote anyway?).On my couch at an appropriate viewing distance, at night, with a Blu-ray in, this is the best TV I've ever seen at almost any price.Amazon Prime was free shipping and a dude in a van showed up with it and set it up for me.", "Date": "April 9, 2014"}, {"Title": "Much Better Now", "Author": "Dr_Tsunami", "ReviewID": "R3H0UZLGP4C9IR", "Overall": "4.0", "Content": "--March 28, 2014, 9:00pm--With the setting of the sun comes the rise of the Plasma. I did not fully appreciate what Plasma TV reviewers were writing when it was stated that a dark room is required. The TV is very sensitive to ambient light, not just direct light, it is sensitive to any light and therefore it was not until the sun set that the colors of the TV showed and the picture is as good as I have read. I cannot give such a sensitive TV 5 stars, it really requires no room lights and no ambient light to look its best and then it is better than my 45\" Samsung 6500 LCD.--March 28, 2014 5:00pm--I was picking up the packaging pieces and saw the four ferrite cores Samsung provides with the TV. I installed two on the power cord and moved the cord away from the other components, and to my surprise the buzzing is reduced by 90%, the static/popping is significantly reduced, who knew.The picture is now about 90% of what I expected from the Blu-Ray, which is near the Panamax Power Conditioner and needs to be moved and from the apple tv the picture is about 95% what I expected.--March 28, 2014 1:00pm--Frustrated. After spending weeks researching LCD and Plasma TV's I took the plunge with the PN64H5000 64-inch 1080p 600Hz Plasma HDTV.First Problem: Glare - The TV arrived just a few hours ago and immediately after setting it up I noticed the TV screen was reflecting every last lumen of light in the room, the screen is like a polished mirror, I had to practically black out the room.After setting up the TV I put in American Hustle in on Blu-Ray, and turned on the TV when I noticed the second problem.Second Problem: Buzz, yes it buzzes and it is from the panels, not the speakers, I am not using the TV speakers.I started watching American Hustle and noticed problem three.Third Problem: The picture appears mushy, very underwhelming... I was expecting the picture to be crisp, sharp and beautiful, instead it appears soft, very frustrating.I have not calibrated the TV, and maybe once I do it will help, but right not, annoyed. Then I noticed the fourth problem.Fourth Problem: Static (popping) pixels around skin areas, such as faces. Within 5 minutes I noticed this static / popping effect around skin areas, especially faces and it is worse when a camera pans around a face.I am frustrated and annoyed, weeks of research, a day off from work to be home when the TV arrived and the result is underwhelming. I am thinking about returning it, and starting again. Ahhhh!!! Samsung!!! Fix it!!! I don't want a big TV if the picture looks like mushy pie!!! If you cant figure out how to deliver the quality don't make it!!!", "Date": "March 28, 2014"}, {"Title": "Banding ?", "Author": "ANDY_MT", "ReviewID": "R2SSM1LKD5NK58", "Overall": "1.0", "Content": "i really can't emphasise enough to be careful when buying samsung plasma tvs.last year i bought their flagship model, the F8500.this developed a very noticeable horizontal band during bright sequences. it's incredible distracting. i hate it.i went to samsung to see if they would fix or replace.they basically told me to go away, the TV was \"within specification\".of course, when i asked them to show me the part of this specification that allowed for such errors, they didn't email me back.the engineer who inspected the TV told me a couple of years ago, Samsung would replace TV sets with this problem without question. now, this problem is \"within specification\"this company has some questionable ethics going on.don't get burned like me. if you have to get this TV, if you see any such banding with the first 28 days, return it ASAP to retailer. don't let samsung stiff you like they did me !or best yet, go buy a TV from another brand that don't treat their customers like this.", "Date": "April 6, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00I4OBXWI"}}